{
 "submission_id": "14jmfzn",
 "title": "Forging A Return to Productive Conversation: An Open Letter to Reddit",
 "selftext": "To All Whom It May Concern:\n\nFor eleven years, /r/Showerthoughts has been one of Reddit’s most-popular communities. That time hasn’t been without its difficulties, but for the most part, we’ve all gotten along (with each other and with administrators). Members of our team fondly remember Moderator Roadshows, visits to Reddit’s headquarters, Reddit Secret Santa, April Fools’ Day events, regional meetups, and many more uplifting moments. We’ve watched this platform grow by leaps and bounds, and although we haven’t been completely happy about every change that we’ve witnessed, we’ve always done our best to work with Reddit at finding ways to adapt, compromise, and move forward. \n\nThis process has occasionally been preceded by some exceptionally public debate, however.\n\nOn June 12th, 2023, /r/Showerthoughts joined thousands of other subreddits in protesting the planned changes to Reddit’s API; changes which – despite being immediately evident to only a minority of Redditors – threatened to worsen the site for everyone. By June 16th, 2023, that demonstration had evolved to represent a wider (and growing) array of concerns, many of which arose in response to [Reddit’s statements to journalists](https://www.washingtonpost.com/technology/2023/06/16/reddit-ceo-blackout-moderators-steve-huffman/). Today (June 26th, 2023), we are hopeful that users and administrators alike can make a return to the productive dialogue that has served us in the past. \n\nWe acknowledge that Reddit has placed itself in a situation that makes adjusting its current API roadmap impossible. \n\nHowever, we have the following requests:\n\n- Commit to exploring ways by which third-party applications can make an affordable return.\n- Commit to providing moderation tools and [accessibility options](https://www.reddit.com/r/Blind/comments/14ds81l/rblinds_meetings_with_reddit_and_the_current/) (on Old Reddit, New Reddit, and mobile platforms) which match or exceed the functionality and utility of third-party applications.\n- Commit to prioritizing a significant reduction in spam, misinformation, bigotry, and illegal content on Reddit.\n- Guarantee that any future developments which may impact moderators, contributors, or stakeholders will be announced no less than one fiscal quarter before they are scheduled to go into effect.\n- Work together with longstanding moderators to establish a reasonable roadmap and deadline for accomplishing all of the above.\n- Affirm that efforts meant to keep Reddit accountable to its commitments and deadlines will hereafter not be met with insults, threats, removals, or hostility.\n- Publicly affirm all of the above by way of updating Reddit’s User Agreement and Reddit’s Moderator Code of Conduct to include reasonable expectations and requirements for administrators’ behavior. \n- Implement and fill a senior-level role (with decision-making and policy-shaping power) of \"Moderator Advocate\" at Reddit, with a required qualification for the position being robust experience as a volunteer Reddit moderator.\n\nReddit is unique amongst social-media sites in that its lifeblood – its multitude of moderators and contributors – consists entirely of volunteers. We populate and curate the platform’s many communities, thereby providing a welcoming and engaging environment for all of its visitors. We receive little in the way of thanks for these efforts, but we frequently endure abuse, threats, attacks, and exposure to truly reprehensible media. Historically, we have trusted that Reddit’s administrators have the best interests of the platform and its users (be they moderators, contributors, participants, or lurkers) at heart; that while Reddit may be a for-profit company, it nonetheless recognizes and appreciates the value that Redditors provide. \n\nThat trust has been all but entirely eroded… but we hope that together, we can begin to rebuild it.\n\nIn simplest terms, Reddit, we implore you: **Remember the human**. \n\nWe look forward to your response by Thursday, June 29th, 2023.\n\nThere’s also just [one other thing](https://i.imgur.com/xLmTxcR.jpg).",
 "created_utc": 1687798031,
 "permalink": "/r/Showerthoughts/comments/14jmfzn/forging_a_return_to_productive_conversation_an/",
 "score": 76,
 "url": "https://www.reddit.com/r/Showerthoughts/comments/14jmfzn/forging_a_return_to_productive_conversation_an/",
 "comments": []
}