{
 "submission_id": "158avwj",
 "title": "What is your go-to joke when somebody asks you to tell one?",
 "selftext": "",
 "created_utc": 1690205703,
 "permalink": "/r/AskReddit/comments/158avwj/what_is_your_goto_joke_when_somebody_asks_you_to/",
 "score": 55,
 "url": "https://www.reddit.com/r/AskReddit/comments/158avwj/what_is_your_goto_joke_when_somebody_asks_you_to/",
 "comments": [
  {
   "comment_id": "jt9hubi",
   "message": "I told my doctor, “I broke my arm in three places.” He told me that I should stop going to those places.",
   "created_utc": 1690214316,
   "score": 37,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9hois",
   "message": "A sheep farmer has a talking dog. One day he asks it to get all his sheep into the pen. \n\nA little while later the dog says \"job's done, all 40 sheep accounted for\"\n\n\"40!? I have 36 sheep, not 40\" the farmer says. \n\nThe dog replied \"I know, I rounded them up\"",
   "created_utc": 1690214252,
   "score": 89,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt94zok",
   "message": "Did you hear about the guy that dipped his balls in a jar of glitter?\n\nPretty nuts, right?",
   "created_utc": 1690209119,
   "score": 172,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt99r1n",
   "message": "One day, a man is waxing the car with his son.\n\nHis son looks up and says, \"You know you can use a rag for this, right?\"",
   "created_utc": 1690211076,
   "score": 5,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9f2pp",
   "message": "What's the difference between a rectal thermometer and an oral thermometer?\n\n\u0026amp;#x200B;\n\nThe taste.\n\n\u0026amp;#x200B;\n\nDoctor goes to write a note, and pulls a thermometer from his pocket.\n\nHe says \"Great, some asshhole has my pen.\"",
   "created_utc": 1690213229,
   "score": 93,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt95far",
   "message": "What do you get when you drop a grand piano down a mine shaft?\n\nA flat minor...",
   "created_utc": 1690209302,
   "score": 162,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9iz2c",
   "message": "A man is walking through the woods when he finds a suitcase. Curled up under the suitcase are a fox and four cubs. He immediately calls animal control to report what he found.  \n  \n“Oh no that’s terrible,” says the animal control worker, “are they moving?”  \n  \n“I dunno,” says the man, “but I guess that would explain the suitcase.”",
   "created_utc": 1690214760,
   "score": 132,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt8xksh",
   "message": "What did the drummer name her twin daughters?\n\nAna 1, Ana 2",
   "created_utc": 1690205888,
   "score": 192,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt95di2",
   "message": "A guy's sitting in a bar just getting absolutely hammered drunk. He gets so wasted that he throws up all over himself. He says to himself \"Aw man, my wife is gonna kill me. She just got me this shirt and here I am getting drunk in a bar and throwing up all over it.\" \n\nThe guy sitting next to him says \"Buddy, relax. Take $10, put it in your shirt pocket, and when you get home, tell her that some other guy got drunk and threw up on you and gave you the 10 bucks to get your shirt cleaned.\"\n\nThe man says \"Oh my god that's fucking brilliant. I'll do that.\" And he leaves the bar to go home.\n\nWhen he opens the door, his wife immediately starts laying into him. \"Oh my fucking god, you god damn drunk. I just bought you that fucking shirt and you already ruined it. Look at you, getting sick all over yourself. You're a fucking embarrassment.\"\n\nThe man says \"Baby, baby, please it's not like that. Some other guy at the bar got drunk and he's the one who threw up all over me. He even gave me $10 to get the shirt cleaned.\" And he gestures towards the bill sticking out of his shirt pocket.\n\nHis wife grabs the bill and says \"But this is $20.\"\n\nAnd the man says \"Oh yeah, he also shit my pants.\"",
   "created_utc": 1690209280,
   "score": 77,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9am9j",
   "message": "I bought my friend an elephant for his room. He said, \"Thank you.\"\n\nI said, \"Don't mention it.\"",
   "created_utc": 1690211431,
   "score": 33,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt96ubz",
   "message": "Took my kids to the zoo and all they had was this little dog.  It was a Shih Tzu.",
   "created_utc": 1690209887,
   "score": 162,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9j8to",
   "message": "Whats the difference between a Hippo and a Zippo?\n\nOnes really heavy and ones a little lighter.",
   "created_utc": 1690214866,
   "score": 199,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9hg0r",
   "message": "A limbo champion walks into a bar. \n\nHe was disqualified!",
   "created_utc": 1690214159,
   "score": 29,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt94b0z",
   "message": "Why doesn't Oedipus use foul language?\n\nHe kisses his mother with that mouth.",
   "created_utc": 1690208831,
   "score": 129,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt986ly",
   "message": "A pirate walks into a bar with a steering wheel in his pants.  The bartender said to him, \"hey, you know you have a steering wheel in your pants?\"  The pirate replied, \"Arrrgghh it's driving me nuts!\"\n\nTwo fish were in a tank.  One fish looks at the other one and asks, \"any idea how to drive this thing?\"",
   "created_utc": 1690210433,
   "score": 37,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9nhid",
   "message": "A bear and a rabbit are taking a shit in the woods. The bear says to the rabbit, 'Do you have problems with shit sticking to your fur?'. The rabbit says 'No'. So the bear wipes his ass with the rabbit. \n\n[Totally stolen from Eddie Murphy.](https://youtu.be/HY7KqOJ9V8c)",
   "created_utc": 1690216505,
   "score": 132,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt98o4v",
   "message": "Why did the bike fall over? \n\nIt was two tired. \n\nrepeat this several times at completely random intervals to annoy my friends",
   "created_utc": 1690210632,
   "score": 136,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9bx3r",
   "message": "Little boy:  \"I'm named after my grandfather.\"\n\nMan:  \"Oh?  What's your name?\"\n\nLittle boy:  \"Grandpa.\"",
   "created_utc": 1690211963,
   "score": 86,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9ga2u",
   "message": "I’m as hungry as a guy who is bad at making analogies",
   "created_utc": 1690213704,
   "score": 119,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9isvf",
   "message": "A man walks into his son’s room. He says, \"Son, if you keep masturbating you’re going to go blind. The son goes, “I’m over here Dad.”",
   "created_utc": 1690214693,
   "score": 166,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt92a1u",
   "message": "What do you get when you cross an elephant and a rhino?\n\n(Shrug your shoulders) \n\nElephino",
   "created_utc": 1690207970,
   "score": 49,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt95y7d",
   "message": "A widow goes to the funeral director to discuss the arrangements for her late husband's funeral.  She says \"one of his final wishes was to be buried in a black suit\".  The funeral director looks at the corpse and says, \"But maam, he's already wearing a very nice navy blue suit.  Are you sure we need to change it?\".  She responds, \"yes, I'd very much like to honor his final wishes\".  The director says, \"ok.  Please give us some time and we'll find him an appropriate suit\".  The widow drives home and once she gets through the door, the phone rings.  It's the funeral director.  \"Maam, we've had a stroke of amazing luck!  We've found the perfect suit! Are you able to come take a look?\".  She drives back to the funeral home and the director shows her her husband, now wearing a beautiful black  suit.  \"It's absolutey perfect!!\" she says.  \"I'm impressed!, How did you find this amazing suit so quickly?  I just left here 10 minutes ago.\"  \"It was easy\" he said.  \"by chance, we just had another client come in and the deceased was wearing this incredible black suit.  He was about the same size as your husband, so all we had to do was swap the heads.\"",
   "created_utc": 1690209519,
   "score": 249,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt94po2",
   "message": "skeleton walks into a bar.\n\nbartender asks: what will you have?\n\nskeleton says: a beer and a mop.\n\nha.",
   "created_utc": 1690209002,
   "score": 9,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9i9zn",
   "message": "My wife always says to me 'You're so sarcastic all the time, being sarcastic never got anyone anywhere.'\n\nSo I told her 'Well, it got me to the World Sarcasm Championships in Santiago, Chile in 1998'.\n\nShe said 'Really?'.\n\nI said 'No'.",
   "created_utc": 1690214486,
   "score": 9,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9hiho",
   "message": "Knock knock\n\n* Who's there?*\n\nDishes\n\n*Dishes who?* \n\nDishes Sean Connery",
   "created_utc": 1690214185,
   "score": 187,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt95n0d",
   "message": "Knock knock\n\nWho's there?\n\nTo\n\nTo, who?\n\nIt's to whom, actually.",
   "created_utc": 1690209390,
   "score": 64,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9c0i0",
   "message": "You can ShaggyDog this one as much as you like, but the shortest version is more or less:  \n\n\nThis man is in New York, working too hard, just tired of life and his job.  When he hears a voice:  \"Sell everything you own and go to Las Vegas.\"  \n\n\nHe ignores the voice for a while but it's so persistent he eventually does just that.  \n\n\nHe gets to Las Vegas and he's waiting and baggage claim and the voice says, \"Go to Caeser's Palace.\"  \n\n\nSo, he goes to Caeser's Palace.  \n\n\nHe get to the casino floor and the voice says, \"Go to the roulette table.\"  \n\n\nSo he goes to the roulette table.  \n\n\nThe voice says, \"put everything you have on 29 Black.\"  \n\n\nAfter some discussion with the Pit Boss and the Casino Manager, they let him put everything he owns on 29 Black.  \n\n\nThe wheel spins, it comes up 5 Red.  \n\n\nThe voice says, \"Shit!\"",
   "created_utc": 1690212001,
   "score": 151,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt8xh37",
   "message": "I heard one that cracked me up but I was drunk at the time:\n\n- \"Ask me if I'm a dinosaur.\"\n\n- \"Are you a dinosaur?\"\n\n- \"No.\"",
   "created_utc": 1690205839,
   "score": 229,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9b604",
   "message": "For Veterans Day, Mrs. Olson invited a local WWII veteran to talk about the importance of the holiday.\n\nSo retired Captain Whitaker from the Army Air Corps comes to give a talk, and after explaining what Veterans day is, he begins telling the children stories from the war. \n\n\"Over France, me and my squadron got ambushed by some Germans. There was flak everywhere. We had fuckers shooting us from the right, fuckers shooting at us from the left. Fuckers shooting at us from above, below, and the rear. I'd never been shot at my so many fuckers at once.\"\n\nUnderstandably, the children are rolling with laughter, and Mrs. Olson regains control of her class. After getting the children to calm down, she says to Captain Whitaker\"I'm sorry, Captain, but the children are laughing because they don't know that Fokker was a German aircraft company.\"\n\n\"Sure, but these fuckers were flying Messerschmitts.\"",
   "created_utc": 1690211657,
   "score": 41,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9czg8",
   "message": "A duck walks into a bar and says, “Do you have duck food here?”\r  \nThe bartender says, “No” and the duck leaves.\r  \n\r  \nThe duck comes back the next day and says, “Do you have duck food?”\r  \nThe bartender says, “No.”\r  \n\r  \nThe duck comes back the next day and says, “Do you have any duck food?”\r  \nThe bartender says, “I already told you ‘No’ twice! If you come back and ask me again, \r  \nI’m going to nail your feet to the floor!”\r  \n\r  \nThe duck comes back the next day and says, “Do you have any nails?”\r  \nThe bartender says, “No.”\r  \n“Do you have any duck food?”",
   "created_utc": 1690212389,
   "score": 145,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt99xv1",
   "message": "A guy finds a magic lamp. He rubs it and out pops a genie.\n\n\n\"You have found my lamp,\" says the genie, \"and in return I will grant you two wishes.\"\n\n\n\"Isn't it supposed to be three wishes?\" says the guy.\n\n\n\"Look in your pants,\" the genie replies.\n\n\nThe guy looks in his pants. \"Holy shit!\" he exclaims. \"My dick is huge!\"\n\n\n\"Yeah,\" says the genie. \"I've been in this business for a while.\"",
   "created_utc": 1690211154,
   "score": 67,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9c7mf",
   "message": "Two whales walk into a bar. The first whale walks up to the bartender and says “**OOuuuYooOOOOooooeuueEEERrrrrrrrrr (continue making whale noises for as long as you like, ideally 2-5 minutes)”**\n\nThe second whale looks at the first and says “Goddammit Steve, you’re so annoying when you’re drunk.”",
   "created_utc": 1690212080,
   "score": 118,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9oqjj",
   "message": "An Irishman walks into a bar and orders three pints of Guiness.\n\nHe takes them to a table and takes a drink from each one, alternating cups until all of them are empty.\n\nHe comes back the next week and does the same. Three pints and takes a drink from each until they are all gone.\n\nThe third time he comes in the barman, curious, asks why he drinks like that.\n\n\"Oh it's for my brother's. We live all over the world and don't get to see each other very often. Doing this feels like we are all together once a week.\"\n\n\"That's lovely.\" Says the barman and wishes him well.\n\nThis continues for several years and the Irishman becomes something of a celebrity as the story circulates among the other regulars.\n\nUntil one night, the man comes in and orders two pints. A hush falls over the bar as they watch him take his drinks and continue alternating like always but with a pint missing.\n\nThe barman, who first asked him about the tradition feels compelled to go over.\n\n\"I'm so sorry for your loss,\" he says pointing at the pints.\n\nConfused the Irishman looks at him before laughing and saying, \"No, we're all fine. I just gave up drinking.\"",
   "created_utc": 1690216981,
   "score": 250,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9unfm",
   "message": "Did you know that before the invention of the crowbar, crows just drank at home?",
   "created_utc": 1690219258,
   "score": 31,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt99byz",
   "message": "Why did the blind man pour ketchup in his eyes?\n\nTo cure his blindness, coz Heinz sight is 20/20",
   "created_utc": 1690210902,
   "score": 51,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt8y3q2",
   "message": "How do you get an art major off your porch?\n\nPay for the pizza.",
   "created_utc": 1690206124,
   "score": 9,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9e2o6",
   "message": "What do you call when a Camelion cannot change colours?\n\nReptile dysfunction",
   "created_utc": 1690212831,
   "score": 177,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9dzmd",
   "message": "Why does the Buddhist monk never vacuum his furniture?\n\nBecause he has no attachments.",
   "created_utc": 1690212796,
   "score": 143,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt94z2k",
   "message": "Two chemists walk into a bar\n\nThe first one says, \"I'll have a H²O please\"\n\nThe second one says, \"I'll have a water too, please\"\n\nThe first chemists sighs as his assassination attempt has failed.",
   "created_utc": 1690209112,
   "score": 227,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt97nl6",
   "message": "Why don’t cannibals eat clowns?\n\n\nThey taste funny.",
   "created_utc": 1690210220,
   "score": 238,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9kwqo",
   "message": "I saw this Mexican magician that said that he would disappear on the count of three.\n\nUno...\n\nDos...\n\nSuddenly he was gone without a Tres.",
   "created_utc": 1690215516,
   "score": 15,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9ejd8",
   "message": "What did the bra say to the hat?\n\nYou go on ahead, ill give these two a lift",
   "created_utc": 1690213015,
   "score": 237,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9ilmk",
   "message": "What starts with an E and ends with an E and only contains one letter?\n\nAn envelope!",
   "created_utc": 1690214613,
   "score": 197,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9m80r",
   "message": "What's the difference between an owl, a piano and a fish? \n\nYou can tune a piano, but you can't tuna fish\n\nWhat about the owl?\n\nWho?",
   "created_utc": 1690216017,
   "score": 143,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9fpva",
   "message": "I have a pet newt named Tiny. I named him Tiny because he's my newt.",
   "created_utc": 1690213483,
   "score": 232,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9nuw1",
   "message": "A woman walks into a hardware store to buy a hinge.  \n\nThe salesman asks \"do you want a screw for the hinge?\"  \n\nWoman says \"No, but I'll blow you for the toaster.\"  \n\n(heard in a standup routine about 40 years ago)",
   "created_utc": 1690216647,
   "score": 176,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9g3zn",
   "message": "Three nuns go to heaven-\nFirst nun comes to Petrus.\nPetrus asks the first nun:\n\"Who was the first woman on earth?\"\nNun:\"Ah- that's an easy one: Eve!\"\n-Music plays, the door opens, the nun enters paradise-\nPetrus asks the second nun:\n\"Who was the first man on earth?\"\nNun:\"Ah- that's an easy one: Adam!\"\n-Music plays, the door opens, the nun enters paradise-\nPetrus asks the third nun:\n\"What were the first words Eve said to Adam?\"\nNun:\"Oh- Puh... That's a hard one...\"\n-Music plays, the door opens, the nun enters paradise-",
   "created_utc": 1690213637,
   "score": 112,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9iuwy",
   "message": "So Quasimodo is working at Notre Dame, ringing the bells every hour on the hour.  One day, tragically, he dies.   So the owner of the bell tower holds auditions to be the new bell ringer.   Many try out, but sadly, none could make the bells ring quite as beautifully as Quasimodo could.  So defeated, the owner says with a sigh \"I guess the bells will fall silent upon Paris from now on\" as he boards up the bell tower.  \nJust then, a short little man approaches and says \"Is it too late to try out to be the bell ringer?\"  \nThe owner says \"Well, I guess you could try out, but... but I can see that you don't have any arms! How are you going to ring the bells?\"  \nThe little man says \"You'll see\".   \nSo they march up the many flights of stairs to the top of the bell tower. The owner says \"Okay here we are. Let's see how you do it.\" \nThe may says \"Stand back...\"  \nHe stretches, gets into a stance, eyes the bell, then takes off at a full sprint towards the bell, *dives* at the bell, hits the bell with the front of his *face*... and it makes the most beautiful sound you have ever heard - even more beautiful than Quasimodo could ring them.   \nTouched, the owner says \"You're hired. You start 6am tomorrow\".   \nSo 6am tomorrow comes along.  The little man arrives, marches up the many flights of stairs, stretches, gets into a stance, eyes the bell, sprints at the bell, dives at the bell, *misses the bell*, and flies out the window, hitting the cobblestone street below and dying instantly.     \nOf course, this causes quite the commotion in the busy streets of Paris. It isn't long before a crowd gathers.  They've never seen such a sight. Soon, a sheriff arrives and beholds the gruesome scene.   \n\"Stand back!\" he tells the crowd, as they murmur amongst themselves.   \n\"Now. Does anyone know what happened here? Does anyone know who this man was?\"  \nThe crowd goes silent as they look around at each other, all at a loss.  \nJust then, a voice from the back of the crowd says:   \u0026gt;!\"I don't know who he is, but HIS FACE RINGS A BELL!!!!!!!!!!\"!\u0026lt;",
   "created_utc": 1690214715,
   "score": 124,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt93vak",
   "message": "The interrupting cow joke. I don't care that it's a knock-knock joke; I love it!",
   "created_utc": 1690208647,
   "score": 128,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9bv55",
   "message": "Why do chicken coops have two doors? \n\nIf they had four doors, they'd be chicken sedans!",
   "created_utc": 1690211941,
   "score": 50,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt939bp",
   "message": "What's the difference between a lady at Church and a lady in the bathtub?\n\nOne of them has Hope in her Soul!",
   "created_utc": 1690208389,
   "score": 117,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt944tp",
   "message": "Why can’t you find elephants hiding in trees?\n\nCuz they’re really good at it.",
   "created_utc": 1690208758,
   "score": 13,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt95r10",
   "message": "Where does a mansplainer get their water?\n\nFrom a well, actually.",
   "created_utc": 1690209436,
   "score": 150,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9cp27",
   "message": "What do you call a dog with no legs?\n\nDoesn't matter, he's not going to come.",
   "created_utc": 1690212274,
   "score": 185,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt972r8",
   "message": "Why are pirates called pirates...\n\nThey just AAAARRRGGGHHH",
   "created_utc": 1690209984,
   "score": 24,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt94yym",
   "message": "How do you turn a duck into a soul singer?\n\nPut it in the microwave until it's Bill Withers.",
   "created_utc": 1690209111,
   "score": 12,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9dfww",
   "message": "Did you hear about the hooker who got a vagina implanted in her hip?\n\nShe wanted to make a little money on the side.",
   "created_utc": 1690212575,
   "score": 127,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9279l",
   "message": "I'm more of a riddler.\n\nWhat is the difference between a drunk cowboy and a constipated owl?\n\nOne shoots and can't hit. The other hoots and can't sh**\n\n(Technically that's a Spoonerism).",
   "created_utc": 1690207936,
   "score": 20,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9e3nh",
   "message": "Why did Sarah fall off the swing? She has no arms\n\nKnock knock. \nWho’s there?\nNot Sarah.",
   "created_utc": 1690212841,
   "score": 151,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt8yl0r",
   "message": "My joke :\n(For context: us germans have rivalries between our favorite beers so one can input every beer.)\n\nWhat is the difference between a clitoris and a *insert beer name*\n\nThe clitoris only tastes like piss for the first few seconds.",
   "created_utc": 1690206340,
   "score": 205,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9lobo",
   "message": "I'll never date another tennis player. Love means nothing to those people.",
   "created_utc": 1690215808,
   "score": 218,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9vl6t",
   "message": "what’s the number one cause of dry skin?\n\ntowels",
   "created_utc": 1690219618,
   "score": 209,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9jruv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9uolr",
   "message": "I told my girlfriend her underwear are far too revealing. She replied, \"Well, then wear your own!\"",
   "created_utc": 1690219270,
   "score": 148,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt8xt3o",
   "message": "What does a nosy pepper do?\n\nGets jalapeno business",
   "created_utc": 1690205992,
   "score": 152,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9n9tq",
   "message": "Why do scuba divers go in backwards?\n\nBecause if they went in forwards they'd still be in the boat.",
   "created_utc": 1690216421,
   "score": 104,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt960cg",
   "message": "Ok so, this is not a nice one but...\n\n\"What's the diference between a joke and 3 dicks? Your mom can't take a joke\".",
   "created_utc": 1690209544,
   "score": 220,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9gmbu",
   "message": "I woke up laughing this morning. I must have slept funny.\nOr:\nI saw a poor old lady collapse at the bus stop earlier. Well I assume she was poor, she only had £3 in her purse.",
   "created_utc": 1690213837,
   "score": 176,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9bjf9",
   "message": "Do you know who've been through a lot of shit but are still together?\n\nMy buttcheeks\n\nFriend told me that one as I was going through a bad breakup. Lol",
   "created_utc": 1690211809,
   "score": 175,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9cc2c",
   "message": "I know a great knock-knock joke.\n\nYou start.",
   "created_utc": 1690212129,
   "score": 56,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9i1xs",
   "message": "Why can't Skrillex go fishing?   \n\nBecause he always drops the bass.",
   "created_utc": 1690214399,
   "score": 34,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jta8bc1",
   "message": "'A man went to  confession   Father', he confessed, 'it has been one month since my last confession. I had sex with Fanny Green twice last month.'\n\nThe priest told the sinner, 'You are forgiven. Go out and say three Hail Mary's.'\n\nSoon thereafter, another man entered the confessional. 'Father, it has been two months since my last confession. I've had sex with Fanny Green twice a week for the past two months.'\n\nThis time, the priest questioned, 'Who is this Fanny Green?'\n\n'A new woman in the neighborhood,' the sinner replied.\n'Very well,' sighed the priest. Go and say ten Hail Mary's.\n\nAt mass the next morning, as the priest prepared to deliver the sermon, a tall, voluptuous, drop-dead gorgeous redheaded woman entered the sanctuary. The eyes of every man in the church fell upon her as she slowly sashayed up the aisle and sat down right in front of the priest. Her dress was green and very short, and she wore matching, shiny emerald-green shoes.\n\nThe priest and the altar boy gasped as the woman in the green dress and matching green shoes sat with her legs spread slightly apart, but just enough to realize she wasn't wearing any underwear.\n\nThe priest turned to the altar boy and whispered, 'Is that Fanny Green?'\n\nThe bug-eyed altar boy couldn't believe his ears but managed to calmly reply, 'No Father, I think it's just a reflection from her shoes'.",
   "created_utc": 1690224785,
   "score": 134,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9g6ed",
   "message": "Another small one I really like\n\nAt a nice, calm evening at bar a man with a gun storms in and screams: \n„Who of you dipshits slept with my wife?“\n\nA man in the back stands up and says:\n„You dont have enough bullets“",
   "created_utc": 1690213663,
   "score": 186,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt99lbr",
   "message": "A man's on a business trip out of town in a city he's not that familiar with. In the evening, after asking his hotel concierge where the best bar in town is, he takes a cab to a bar that's absolutely jam-packed full of people. Inside, it's booming business, but what catches him off-guard isn't the crowd, but the dozens of cuts of beef hanging from the ceiling. Prime rib, porterhouse, new york strips, flanks, all sorts of cuts, hanging from hooks on the ceiling, yet no one inside bats an eye at it.\n\nMaking his way up to the bartender and flagging him down, the businessman says, \"Hey, barkeep, what's with all the beef hanging from the ceiling?\"\n\n\"Oh yeah,\" says the bartender, \"it's our bar's patron challenge: Slap the Beef. You get one shot to make a standing jump, and try to slap a piece of beef, any piece you fancy. If you slap a piece on one try, your tab's on the house for the whole night. But, if you miss, well, then you gotta cover everyone else's tab for the night. Whaddya say, stranger? Feeling like taking a shot at a slap of the beef?\"\n\n\"Hell no,\" said the businessman. \"The steaks are too high.\"",
   "created_utc": 1690211011,
   "score": 160,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9hlis",
   "message": "What's the difference between people from Dubai and people from Abu Dhabi?\n\nPeople from Dubai don't like the Flintstones. People from Abu Dhabi do.",
   "created_utc": 1690214219,
   "score": 127,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9jpig",
   "message": "One day a penguin was driving through the desert and his car broke down right outside of a small town.  He walked to the local garage and the mechanic towed the car to the shop to look at it.  He told the penguin that it would take a little while to find the problem and directed him to the local ice cream shop.  The penguin went in and ordered a triple scoop on a cone.  Now penguins can really hold an ice cream cone well and he ended up with ice cream all over his face.  H we went back to the garage to ask about his car and the mechanic said \"It looks like you blew a seal\" and the penguin said \"No, its just ice cream\"",
   "created_utc": 1690215048,
   "score": 139,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9ih1t",
   "message": "Why does Snoop Dogg carry an umbrella?\n\nFor drizzle",
   "created_utc": 1690214563,
   "score": 95,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9ndtg",
   "message": "A plane crashes in a remote village and three men are the only survivors. They are captured by the natives and brought to the center of the village where everyone is gathered. \n\nThe head chief walks up to them and says “you have invaded on sacred land. You may choose your punishment: death, or watussy.” \n\nThe first man says “well I don’t know what watussy is but I don’t want to die. I choose watussy.” The crowd goes crazy. Everyone lines up and takes turns fucking him in the ass.\n\nThen the head chief turns to the second man. “What about you? Death or watussy?” And the second man says “god, watussy is just horrible. But regardless, I have a family at home that depends on me. I choose watussy.” The crowd goes wild again. They all line up and fuck the second guy in the ass.\n\nFinally, the head chief turns to the third man. “I ask one more time, death or watussy?” The third man thinks for a second and says “I dont think I could live a happy life after being violated like that. I choose death.” The crowd starts to absolutely lose their minds. They are hooting and hollering and just going ape shit. \n\nThe head chief raises his hands to silence the crowd then says “he has spoken! Death…BY WATUSSY!”",
   "created_utc": 1690216464,
   "score": 22,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt99kmz",
   "message": "A guy working in a sawmill accidentally cuts off his finger.  His buddies take the severed finger, tie it in a bag with some ice and take him to the hospital.  Luckily, the best surgeon in the world works there and within the hour he has reattached the finger perfectly.  You'd barely noticed the join.  His mates are astonished that he's back in work the next day.  \n\nNow, being that it was a work accident, he puts in a claim for compensation and is awarded 5 grand.  He can't believe his luck.  So he says to his buddies \"If you 5 grand for a finger and it's reattached perfectly, how much would you get for a whole hand?\"  Before anyone can answer, he cuts his whole hand off with the blade.  His mates put the hand in the bag with some ice, tie it up carefully and bring him to the hospital.  He comes out of surgery 3 hours later with the hand perfectly reattached.  Barely a mark where the join is and he's back in work 2 days later.  Another claim for compensation and this time he gets 15 grand.  \n\n\"Well if you get 15 grand for a hand, how much would you get for an arm?\"  So off comes the arm on the blade.  His buddies, getting a bit tired if this, put the arm in a bag, add some ice, tie it carefully and bring him to the hospital.  6 hours later he's out of surgery with the arm perfectly reattached and he's back in work 6 days later.  Another compensation claim is submitted and he's awarded 50 grand.  \n\nHe's on a roll now and wonders how much he'll get for a whole head.  Maybe he can retire.  So off comes the head.  His buddies are frantic but put the head in a bag with some ice, tie it up carefully and rush him to the nearby hospital.  10 hours later the surgeon comes out and says that he has died.  The mates are shocked.  \"How come you could reattach the finger, hand and arm so perfectly but not the head?\".  The surgeon replies, \"Oh I reattached the head no problem, but you suffocated him in the bag\"",
   "created_utc": 1690211004,
   "score": 147,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt99xog",
   "message": "Two caterpillars watching a butterfly go overhead. One says to the other \"You'll never get me up in one of them.\"",
   "created_utc": 1690211152,
   "score": 18,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9hu6q",
   "message": "How many westboro baptists (the hate group with the \"god hates fags\" signs) does it take to change a lightbulb?\n\ntwenty. one to change the lightbulb, and nineteen to protest it for being brighter than they are.",
   "created_utc": 1690214314,
   "score": 78,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt97oyb",
   "message": "I enjoy anti jokes, and I like this one a lot.\n\nWhat's worse than finding a worm in your apple?\n\nThe holocaust",
   "created_utc": 1690210235,
   "score": 1,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9n9ec",
   "message": "What do u call a fly with no wings? A walk.",
   "created_utc": 1690216417,
   "score": 45,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9s7p4",
   "message": "There are three kinds of people in this world. Those who can count, and those who can't.",
   "created_utc": 1690218311,
   "score": 39,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9f29x",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt907xr",
   "message": "What did the cop say to the man peeing in an alley? 'Urine trouble.'",
   "created_utc": 1690207069,
   "score": 31,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt95137",
   "message": "The light option:\n\nThree dogs, a Lab, a Border Collie and a Jack Russell, cross the rainbow bridge and reach heaven. God is sitting on his throne, and he asks:\n\n\"You there, Golden Lab, what do you believe in?\"\n\nAnd the Lab says, \"I believe in chasing rabbits, playing with a ball and being loyal to my family.\"\n\nGod says, \"You are a good boy. Please come and sit on my right.\"\n\nSo the Lab trots over and God says, \"You there, Border Collie, what do you believe in?\"\n\nThe Collie says, \"I believe in keeping the herd safe, working hard and being the smartest of all dogs.\"\n\nGod says, \"You are a good girl. Please come and sit on my left.\"\n\nSo the Collie trots over and God says, \"You there Jack Russell. Tell me what you believe.\"\n\nAnd the JRT says, \"I believe you're sitting on my throne.\"",
   "created_utc": 1690209136,
   "score": 73,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9gsh9",
   "message": "What’s the difference between a garbanzo bean and a chickpea?\n\nI didn’t have a garbanzo bean on my face last night",
   "created_utc": 1690213903,
   "score": 48,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jtagnf1",
   "message": "It's kinda long but.\n\nThere was this train conductor who killed three people, so he was sentenced to the electric chair. For his final meal he asked for a single banana. He ate it they took him to the chair, but the chair refused to kill him so they set him free. He got the same job and again killed more people. He was again sentenced to the electric chair, again asked for a banana and again the chair refused to kill him.\nSo they set him free and he gets his job back again, and again kills more people.\nAmd is sentenced to the chair.\n\nHe asks for a single banana again, this time the guards say no, we know something in those bananas are keeping you alive.\n\nAnd he says, \" it has nothing to do with the bananas, I'm just a really bad conductor\".",
   "created_utc": 1690228003,
   "score": 125,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt96ga0",
   "message": "Man come home with a duck under his arm. He says \"This is the pig I've been fucking\" Wife says \"That's not a pig it's a duck\" Man says \"I was talking to the duck\"",
   "created_utc": 1690209725,
   "score": 55,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9s5qq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9x2s9",
   "message": "Why do Swedish battleships have barcodes on them?\n\nSo when they come back to port, they can Scandinavian.",
   "created_utc": 1690220183,
   "score": 114,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9ibm4",
   "message": "Two muffins are sitting in an oven. One muffins says to the other \"It getting hot in here.\" The other muffin looks over and says, \"Holy cow, a talking muffin.\"",
   "created_utc": 1690214504,
   "score": 67,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jtabpww",
   "message": "A man goes to the doctor. He says, \"doc, I have had the song 'What New Pussycat?' stuck in my head every day for 8 months now. I am losing sleep, my job performance is down. I don't know what to do.\"\n\nThe doctor thinks for a sec and eventually replies, \"hmmm. Sounds like you've got 'Tom Jones Syndrome.'\"\n\nThe man says, \"you mean other people have experienced this? Is it common?\"\n\nThe doc replies, \"well, it's not unusual.\"",
   "created_utc": 1690226101,
   "score": 126,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jta9uzp",
   "message": "Two Ladies at Lunch \n\nTwo ladies are having lunch when one whispers, \"Don’t tell anyone but I’m getting a boob job.”\n\nHer friend responds, \"That's nothing, I'm having my asshole bleached.\"\n\nFirst lady replies, \"Really? I can't imagine your husband as a blonde.\"",
   "created_utc": 1690225382,
   "score": 80,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jtalw0f",
   "message": "A local newspaper sent a reporter to a dairy farm. The journalist asked, \"How much milk do the cows produce?\"\n\n\"Which one, the black one or the brown one?\"\n\n\"The black one.\"\n\n\"A few liters a day.\"\n\n\"And the brown one?\"\n\n\"A few liters a day.\"\n\nPuzzles, he continues the questions, \"What do you feed them?\"\n\n\"Which one, the black one or the brown one?\"\n\n\"The brown one.\"\n\n\"It eats grass.\"\n\n\"And the other?\n\n\"It also eats grass.\"\n\nGetting frustrated, the journalist snaps, \"If they both produce the same amount of milk and they both eat the same thing, why do you always ask 'which one'?\"\n\n\"Because the black cow is mine.\"\n\n\"And the brown one?\"\n\n\"It's also mine.\"",
   "created_utc": 1690230013,
   "score": 72,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jta7fyt",
   "message": "A Roman Centurion walks into a bar and says “I’ll have a martinus, please.”\n\nThe bartender scratches his head. “Do you mean a martini?”\n\n“Look, if I wanted a double I’d fucking ask for one.”",
   "created_utc": 1690224447,
   "score": 58,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9r59z",
   "message": "A farmer is out in his field, working away, when a government vehicle rolls up. A man in suit hops out, and struts up to the farmer, flashing a badge.\n\n\"I'm with the FDA, here to inspect your operations, and make sure everything is on the up-and-up. I'll check the entire property, and assuming you're doing this by-the-books, I'll be on my way.\"\n\nThe farmer, not wanting any trouble, simply nods, and points to a nearby fence.\n\n\"Okay, sure thing sir, just don't go into that field.\"\n\nThe agent, furious to be told what he can and can't do, shouts him down.\n\n\"I'm a representative of the Federal Government! You see this badge? This badge means I go **where** I want, **when** I want! You don't get to tell me **shit**!\"\n\nThe farmer, taken aback, nods nervously, with a \"Yes, sir, sorry, sir.\"\n\nFifteen minutes later, the farmer hears screaming - he turns about to see that the agent is sprinting across the fenced-in field, running for his very life from the biggest, meanest, angriest bull he's ever seen. Fear makes him fast, but the bull is even faster, and it's quickly gaining on him.\n\nThe farmer leaps into action! He drops his shovel, sprints across his crops, throws himself up on to the fence, and at the top of his lungs, screams:\n\n\"YOUR **BADGE**! SHOW HIM YOUR FUCKING **BADGE**!\"",
   "created_utc": 1690217897,
   "score": 101,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jta909k",
   "message": "How many Germans does it take to change a lightbulb? One. We're efficient and lack a sense of humour.",
   "created_utc": 1690225050,
   "score": 53,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9kx0c",
   "message": "What do gay horses eat?\n\nHhhaaaaayyyy!",
   "created_utc": 1690215519,
   "score": 49,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9w9x2",
   "message": "I went to the zoo and saw a baguette in a cage.\n\nIt was bread in captivity.",
   "created_utc": 1690219883,
   "score": 47,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9orvb",
   "message": "Knock knock\n\nWho's there?\n\nA stupid burglar",
   "created_utc": 1690216996,
   "score": 39,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9mjby",
   "message": "A chicken spots a duck about to cross the road, he runs over to the duck grabs his wing and says  \ndont do it mate, youll never hear the end of it",
   "created_utc": 1690216136,
   "score": 40,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt9tjfd",
   "message": "A pub somewhere in Ireland: Shamus the bar tender talks with a patron.\n\nShamus: aye, do you know who built that bridge out there?\nPatron: Well you did Shamus.\nShamus: Do they call me Shamus the bridge builder?\nPatron: well, no they don't. \nShamus: what about the stools you're sitting on? Who built those? \nPatron: well you did Shamus.\nShamus: Do they call me Shamus the Stool Maker?\nPatron: Well no.\nShamus: Hmmm, and what about the roof on this pub? \nPatron: you built that as well\nShamus. And they don't call me Shamus the Roof Builder.\nShamus: but I fucked one goat...",
   "created_utc": 1690218830,
   "score": 32,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jtafzbs",
   "message": "A man walks into a bar. On the table, he sees a jar filled to the brim with $50 bills. When he asks the bartender what the jar was for, the bartender explained it was a prize for completing a challenge. \n\n\"First, you have to chug a bottle of rum. Then, there's this mean old pitbull outside. Tough as they come, he'll maul you 6 ways to Sunday. He's got a bad tooth, so the second challenge is to reach in his mouth and yank it out. Then, the owner of this bar is a *really* old lady. She's mean and grouchy, but we think it's because she hasn't had an orgasm in 50 years. The third challenge is to go upstairs, and rock her world. If she climaxes, you win the whole jar. But it costs $50 to play.\"\n\nThe man considers this, then decides he'd like to play. He places down the $50, and the bartender hands him the bottle. The man chugs it all, gets pretty ripping drunk, and goes outside. What follows are some of the loudest, most disturbing sounds ever heard from man or beast. After about 10 minutes, the noise subsides, and the man slams open the door. Covered in cuts and bruises, he says \"Alright! Now where's the lady with the bad tooth?\"",
   "created_utc": 1690227745,
   "score": 39,
   "submission_id": "158avwj"
  },
  {
   "comment_id": "jt956gm",
   "message": "What do you get if you cross the Atlantic Ocean with the Titanic?\n\nAbout half way.",
   "created_utc": 1690209198,
   "score": 59,
   "submission_id": "158avwj"
  }
 ]
}