{
 "submission_id": "158dzkg",
 "title": "What do you hate about reddit?",
 "selftext": "",
 "created_utc": 1690212792,
 "permalink": "/r/AskReddit/comments/158dzkg/what_do_you_hate_about_reddit/",
 "score": 251,
 "url": "https://www.reddit.com/r/AskReddit/comments/158dzkg/what_do_you_hate_about_reddit/",
 "comments": [
  {
   "comment_id": "jt9ewo5",
   "message": "All the delusional experts",
   "created_utc": 1690213160,
   "score": 107,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9ivko",
   "message": "I hate how if I look at one post from a sub I get recommended that sub and related ones for eternity",
   "created_utc": 1690214722,
   "score": 2,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9i6p0",
   "message": "Arguing with idiots",
   "created_utc": 1690214450,
   "score": 243,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9eabk",
   "message": "The same joke over and over and over and over again.",
   "created_utc": 1690212915,
   "score": 173,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9jxpz",
   "message": "\"Hi, I've read one of your comments and I know nothing else about you. I'm now going to give my expert opinion on you and your whole life.\"",
   "created_utc": 1690215138,
   "score": 98,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9jfeq",
   "message": "It’s an echo chamber.\n\nAlso it's horny all the time.",
   "created_utc": 1690214937,
   "score": 213,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9h680",
   "message": "Subreddit monopolists. People that mod hundreds of subs and this allows them to basically control how certain topics are discussed.",
   "created_utc": 1690214052,
   "score": 113,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9rj43",
   "message": "Everyone is so f\\*cking mean to each other in the comments.",
   "created_utc": 1690218044,
   "score": 175,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9i97h",
   "message": "Pretty much all the popular subreddits and the repeat questions and jokes. (Yet here I am in one of the most popular subs and worst offender for reposts and the same jokes)",
   "created_utc": 1690214477,
   "score": 12,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9kkys",
   "message": "Some mods abuse their power",
   "created_utc": 1690215389,
   "score": 59,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9pz4b",
   "message": "Posts that are along the lines of \"Firefighters of Reddit...\"\n\nAnd all the top comments are, \"Not a firefighter but my second-cousin is and...\"",
   "created_utc": 1690217452,
   "score": 185,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9f10q",
   "message": "Bots and bot posts of which most is of a sexual nature.",
   "created_utc": 1690213209,
   "score": 33,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9z4d1",
   "message": "Hive mind mentality",
   "created_utc": 1690220961,
   "score": 85,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9lezz",
   "message": "All the sex related threads. Gets old and boring quickly",
   "created_utc": 1690215710,
   "score": 237,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9gew7",
   "message": "redditors",
   "created_utc": 1690213756,
   "score": 94,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9rz0m",
   "message": "The know-it-all reddit “experts.” There are so many people on here who think everything is black and white, that they have it all figured out, act pretentious and confidently say shit that is often completely wrong",
   "created_utc": 1690218215,
   "score": 191,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9z0l1",
   "message": "Getting downvoted for disagreeing with the hive mind.",
   "created_utc": 1690220920,
   "score": 200,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9fd4p",
   "message": "Question asking about specific thing?\n\nI think this about specified thing.\n\n(Other person) Oh, so you think XYZ about THIS other thing?!?! LMAO 🤣💦🔥",
   "created_utc": 1690213343,
   "score": 95,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9mx7i",
   "message": "The middle schoolers asking what sex is like with an actual lady.\n\nThe obsessions with poop knives and bidets.\n\nPeople making \"OP's Mom\" jokes.",
   "created_utc": 1690216286,
   "score": 111,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9m4dl",
   "message": "People treat is as the pinnacle of intellectual debates as social media goes, but its arguably worse than Twitter.\n\nThe upvote/downvote system is a mechanic for silencing unpopular opinions. Most subs are ultimately just echo chambers where anything that's against the common understanding is downvoted. This is not just political statements but even shitpost and gaming subs. \n\nI dont even think its a bias to liberalism/conservatism but just the inherent flaw in the upvote/downvote system. Like comments can get auto deleted after certain amount of downvotes.",
   "created_utc": 1690215978,
   "score": 129,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9jwgm",
   "message": "u/spez",
   "created_utc": 1690215124,
   "score": 203,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtano21",
   "message": "This. When people write ‘this’. I hate it. ‘This’",
   "created_utc": 1690230684,
   "score": 102,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9eq82",
   "message": "OF creators spamming my favourite NSFW subs.",
   "created_utc": 1690213090,
   "score": 133,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9k6rg",
   "message": "Thought Police Mods on the larger subreddits",
   "created_utc": 1690215236,
   "score": 150,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtafe6i",
   "message": "How close minded and extremist liberal it is, especially on places like white people twitter, but at this point you can’t even have an opinion on a non-political sub.",
   "created_utc": 1690227521,
   "score": 33,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9irp3",
   "message": "Users treating subs like their private marketing plan. Just because you created something that's science fiction-related does not mean you should spam every sci-fi-related sub in this site with links to buy it. \n\nI don't see this that often, but I always hate seeing it. It feels like the poster sees the community as dollar signs, not people.",
   "created_utc": 1690214680,
   "score": 44,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9isqx",
   "message": "The redditors.  Bunch of bastards.",
   "created_utc": 1690214691,
   "score": 97,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtaepos",
   "message": "The oversensitive mods",
   "created_utc": 1690227259,
   "score": 56,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtaam9z",
   "message": "Power hungry mods",
   "created_utc": 1690225674,
   "score": 32,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9p0ml",
   "message": "When people use the NSFW tag but there’s no nudity.",
   "created_utc": 1690217090,
   "score": 51,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9lprx",
   "message": "How fragile everyone's feelings are if you disagree, call bs on their bs or the inconsistencies from mods. I got scolded for calling someone a smug twit, they were, but when someone told me to go rape my sister with a catus dildo it was acceptable.",
   "created_utc": 1690215822,
   "score": 91,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9hm0b",
   "message": "When you pretty much explain in your post your point. Then someone either completely misinterpreted it or they go: “dude I don’t know what you wrote.” And it’s like: “I’m agreeing with the point and giving an example.” It’s not hard to get it.",
   "created_utc": 1690214225,
   "score": 48,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9kyfx",
   "message": "Getting downvoted when you ask for a source on a claim.  God forbid you don't take some random person's opinion as a fact.",
   "created_utc": 1690215534,
   "score": 186,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9pr2r",
   "message": "\"This, this right here\".\n\"This is the correct answer\".\n\"This x :random number:\".\n\"Underrated comment\". \n\"X woke up and chose violence\".",
   "created_utc": 1690217367,
   "score": 56,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9jhgt",
   "message": "Downvotes =/= incorrect, in fact a lot of the time it seems like a good indicator of original thought.   \n\n\nAnd remember that cringy trend to berate someone here over grammatical errors a few years ago?",
   "created_utc": 1690214960,
   "score": 69,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtaoanc",
   "message": "Everyone so quick to be funny.   No mfer, I'm genuinely interested in this and can't find a true response anywhere.",
   "created_utc": 1690230922,
   "score": 96,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9kxsq",
   "message": "The fact that, whatever you say, you will get a ton of people saying you said shit, you are dumb, you are wrong, etc. Since a lot of people come, every opinion is there. \n\nThat, and mods censoring a little bit at random.",
   "created_utc": 1690215527,
   "score": 36,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9o105",
   "message": "The average Redditor hivemind upvotes/downvotes depending on the score that's shown (meaning a higher scrore = more likely to upvote, lower or hidden score = more likely to downvote)\n\nThis causes a lot of good comments to get completely buried because some 2 or 3 dumb fucks that don't know how to read or have the reading comprehension of a hamster just downvoted a post to -1, causing the spiral downwards for no reason. \n\nThis place really is a hivemind most of the time.\n\nOh, and \"We did it Reddit!\" or \"Reddit, Assemble\" is the most cringe shit humanly imaginable.",
   "created_utc": 1690216711,
   "score": 51,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtaebgn",
   "message": "I hate going through a profile and seeing the same post on 10 different subreddits before finding the next thing they posted",
   "created_utc": 1690227105,
   "score": 59,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9pvsr",
   "message": "So many rules for making posts, I don’t know how many times my posts were deleted, just over stupid crap!",
   "created_utc": 1690217417,
   "score": 49,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9m9ir",
   "message": "Reddit is very wilfully ignorant and closed-minded",
   "created_utc": 1690216033,
   "score": 67,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9xe7c",
   "message": "The amount of times I see people get mass-downvoted despite being correct. \n\nUsually in regards to politics or religion but I see it everywhere. Even saw a guy yesterday with 50+ downvotes on all his comments even though he was just politely asking questions and trying to get information",
   "created_utc": 1690220303,
   "score": 50,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9oojt",
   "message": "Every single redditor thinks they are the main character.",
   "created_utc": 1690216959,
   "score": 27,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9pgqr",
   "message": "Oversimplication of super complex issues, and over-complicating simpler topics. \n\nWork, politics, budget, diet/exercise, and economics come to mind for the former.",
   "created_utc": 1690217262,
   "score": 51,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9pzrr",
   "message": "The assumption that introverts are all perfect silent geniuses (while also completely missing the definition of introvert) and extroverts are dumb loudmouths.",
   "created_utc": 1690217459,
   "score": 39,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtajsz6",
   "message": "Everyone tries to be a comedian",
   "created_utc": 1690229216,
   "score": 9,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtan92h",
   "message": "Just in general, the way stupid shit gets upvoted, and continues to get upvoted simply because it’s already upvoted, and the inverse for downvoted stuff that isn’t stupid. It’s like this vicious cycle of ignorance because people want to feel included but don’t want to think for themselves. Especially when it’s venom targeted towards a lone non-anonymous individual, where context and nuance don’t seem to matter; almost like a human sacrifice.",
   "created_utc": 1690230526,
   "score": 16,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9lj0r",
   "message": "They’re really liberal on here. \n\nWhich is fine, to each their own, but damn. When someone disagrees with you, they put you down, which I think is ironic, since they want to promote equality and whatnot.",
   "created_utc": 1690215752,
   "score": 149,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9en0k",
   "message": "The left-leaning bias. I'm a lifelong liberal and even I hate Reddit's leftist BS.\n\nI've had comments deleted, been shadow-banned and even outright banned from subs just for asking *questions* about some of the more wacky leftist narratives on Reddit. Literally just \"can you help me to understand why you believe that\" and boom, perma-banned from the sub. It's ridiculous.\n\nWhat makes it even more infuriating is these are the same jackasses who call everyone else fascists...while banning open discussion and silencing dissent. You can't make this shit up.",
   "created_utc": 1690213054,
   "score": 250,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9i008",
   "message": "People who scornfully send you to Google rather than give you the 5 word answer to your question. They must be so much fun at dinner!",
   "created_utc": 1690214378,
   "score": 54,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9sgi6",
   "message": "Clearly unstable people that hate any group of people and talk about being violent or killing them. Just reported a person the other day that was talking about mass murdering people just because they don’t agree with them. Ironically it was the type of person that calls others fascists, etc. while talking just like a fascist themselves. I sure hope Reddit notified the authorities, because that’s the kind of person who should be on a watch list and never have access to firearms.",
   "created_utc": 1690218404,
   "score": 6,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtamld9",
   "message": "Age gap shaming: I see it on Reddit constantly. Healthy relationships between two consenting adults with an age gap is quite normal in the real world. The problem is there's a large proportion of young people that are terminally online and don't actually experience real life. So they sit like spinsters living and judging through others vicariously.",
   "created_utc": 1690230278,
   "score": 27,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtarpa4",
   "message": "The self-righteousness",
   "created_utc": 1690232219,
   "score": 30,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9jztc",
   "message": "How the fuck do I get karma I'm new to reddit and I already hate that system",
   "created_utc": 1690215161,
   "score": 43,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9jwpm",
   "message": "People are too wimpy on here.",
   "created_utc": 1690215127,
   "score": 32,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9oia1",
   "message": "The cognitive dissonance that a large group of idiots can produce when they don't know they are the large group of idiots. \nReddit has become an extreme example of an echo chamber of impractical ideas.",
   "created_utc": 1690216894,
   "score": 20,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9pjyn",
   "message": "Or people that downvote for simply questions like “why do you think that?” When you are clearly trying to understand what the person said or mean with it, and I simply got downvote -15 for that .",
   "created_utc": 1690217296,
   "score": 19,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9pksf",
   "message": "Mods that abuse their power. Was banned from r/news, despite the fact that I was making a good faith argument relevant to the discussion, was not being abusive or using bad language, etc. I assume a mod just disagreed with my position. I massaged the mods to ask what rule I broke and was just immediately banned from messaging the mods as well. Despicable.",
   "created_utc": 1690217305,
   "score": 21,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9ufd5",
   "message": "The stupidest like/dislike system of this site  making threads  literal echo chambers",
   "created_utc": 1690219172,
   "score": 20,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtat9k2",
   "message": "The repetition of jokes, karma trains, \"thanks for the gold kind stranger\" etc",
   "created_utc": 1690232826,
   "score": 22,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtat9qz",
   "message": "Am I the asshole is the absolute worst sub of petty people that wants to feel better. I had to literally just block the entire sub because it annoy the crap out of me.",
   "created_utc": 1690232828,
   "score": 18,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9t1f5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9rbbo",
   "message": "‘He Gets Us’",
   "created_utc": 1690217961,
   "score": 18,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9xdj9",
   "message": "Teenagers giving financial, legal and career advice.",
   "created_utc": 1690220296,
   "score": 19,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtaofd0",
   "message": "There's a lot of people rightfully griping about the average person who uses it, but what about the site itself? It is a fucking mess.\n\nTheir current design is complete dogshit. I'm gone the day they remove old.reddit.\n\nWhy did they make a change recently where when you try to view an image, it puts a shitty reddit border around it and fucks with the zoom in and out ability of browsers? I want to view an image, not an image in an overlay.\n\nSpeaking of images, why are they all webp? Webp is a dogshit format and does nothing png, gif, jpg, etc can't do other than be less supported. Stop trying to make it happen.\n\nAlso why does it keep popping up telling me to download your shitty app if I open a reddit link on my phone? I already have an application that allows me to view websites: it's called a browser.",
   "created_utc": 1690230972,
   "score": 10,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9krz1",
   "message": "Lack of empathy and understanding for people who earn less money.",
   "created_utc": 1690215464,
   "score": 23,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jtaaq4t",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jta59yz",
   "message": "The hive mind, the design (like most media these days) to keep you endlessly scrolling and addicted through tiny hits of dopamine. The countless days I've wasted on it. If it wasn't for it being a good one stop shop for all my news needs I wouldn't be here anymore.",
   "created_utc": 1690223600,
   "score": 11,
   "submission_id": "158dzkg"
  },
  {
   "comment_id": "jt9lfos",
   "message": "How everyone on here kinda sounds the same. Same opinions, same jokes, etc.",
   "created_utc": 1690215717,
   "score": 18,
   "submission_id": "158dzkg"
  }
 ]
}