{
 "submission_id": "158ed30",
 "title": "What is the worst aspect of being a man in 2023?",
 "selftext": "",
 "created_utc": 1690213659,
 "permalink": "/r/AskReddit/comments/158ed30/what_is_the_worst_aspect_of_being_a_man_in_2023/",
 "score": 144,
 "url": "https://www.reddit.com/r/AskReddit/comments/158ed30/what_is_the_worst_aspect_of_being_a_man_in_2023/",
 "comments": [
  {
   "comment_id": "jt9nt4p",
   "message": "Social isolation if youre not really extroverted",
   "created_utc": 1690216628,
   "score": 6,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9ni7g",
   "message": "Dating has largely switched over to dating apps in recent years over traditional methods of meeting. Unfortunately, due to how many men there are on them vs. women, these apps do not favor most men.",
   "created_utc": 1690216512,
   "score": 44,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9o4ra",
   "message": "It's really hard to find support. It feels like no matter what you do, it's wrong. Talk about  thoughts and insecurities?  You're either not a real man or burdening someone with emotional labor. Keep it to yourself? You need to be more open. Ask for advice? This is something you should have figured out by now. Go at it alone? Why won't you let anyone help you?",
   "created_utc": 1690216750,
   "score": 253,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9t78h",
   "message": " Men get lonely too. One man says that he is super lonely all the time. He feels like people only reach out to him when they need something.",
   "created_utc": 1690218696,
   "score": 211,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9p34o",
   "message": "If you are a victim of domestic violence, people won't take it seriously. \n\nMany people still believe a man can't be a domestic violence victim.",
   "created_utc": 1690217117,
   "score": 27,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9npo6",
   "message": "being seen as weird, creepy, or less of a man for being good with kids. \n\nI have been good with kids my whole life, in grade 8 I helped out with the special needs kids and had a huge group of little ones who wanted to hang out with me at recess and sit together on the bus. Little kids often speak to me when I am out walking and I will talk to them back (parents are there), and I am planning on doing an internship thing in a school and going to university to be a teacher but sadly as a guy I wont be seen the same as if I were a girl",
   "created_utc": 1690216592,
   "score": 122,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9o8e8",
   "message": "Idk how life is as a woman since I'm  a guy so i cant say for certain which are more uniquely male experiences. But based on comments and stories from trans men who passed as women and then as men experiencing life on both sides, it would be how lonely it is and how incredibly cold, indifferent,  and uncaring people are to you. You are truly on your own with usually one or two people who genuinely give a damn if youre okay. Thats if youre lucky. And this isn't mentioning the highly self reliant individualistic minset you're raised with. \n\nYou're raised to believe its ALL on you. Succeed or fail. And many MANY men silently walk around feeling like their existence is inherently a burden. No one wants them. And they have to work hard their whole lives to earn the privilege of affection, love, and care. But don't dare complain about it because no one cares to hear it. And that's just you being a burden.\n\nI act as a confidant for my guy friends from time to time. We'll have a drink and if they have something heavy on their mind I'll listen. Men are much deeper than society gives them credit for if you listen to them. The only downside is that so little people listen xD so when you're like me and do then sometimes people unload everythin at once and you gotta eeaaase em back.",
   "created_utc": 1690216789,
   "score": 166,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9qych",
   "message": "As a single man in his 30s no one gives an absolute fuck about me. Which is fine, but sometimes I wish I had someone to vent to",
   "created_utc": 1690217823,
   "score": 85,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9l7wj",
   "message": "Lack of inherent emotional support.\n\nIt's terribly lonely being a man, even if you have a good circle of friends and family.",
   "created_utc": 1690215635,
   "score": 234,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9pcpx",
   "message": "The crippling loneliness and indifference from everyone.",
   "created_utc": 1690217219,
   "score": 46,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9ukjh",
   "message": "- The standards of masculinity nowadays is based on individualistic merit and achievement (fastest car, most women fucked, etc.) as well as many “don’t”s (don’t act gay, don’t drink a feminine drink, don’t be weak).\n\n- No social support. The only male spaces I know of are hobby groups (in decline) and the alt right who see themselves as a pseudo enclave or brotherhood.\n\n- I’ve seen a video of an FTM cry, realizing that male social circles are very small and there is a significant downgrade in the friends they made.\n\n- We as a society have collectively downplayed the father figure role (not saying that it has to be a biological father nescessarily (or even a man), just a firm figure to teach boys how to be responsible and accountable). Fatherless children are more likely to engage in risk taking behaviors.\n\n- Want a better role model? Well fuck you. The only semi popular male role models in mainstream media nowadays are hedonistic douchebags that align with society’s fascination with output such as Andrew Tate.\n\n- Want to feel like a man? Go ahead and buy “dude soap” or some shit like that. Replace values with goods\n\n- The fact I, as a man, cannot go to a playground with my niece without getting stares.\n\n- Because dating apps are used twice by men than women, men get less results and therefore feel worse about themselves\n\n- There is an arguable body dysmorphia crisis amoung men that has not been addressed.\n\n- Testosterone rates are in decline. The only people that are pointing it out are those leaning towards the right, and even then, they blame it on the wrong things (the vaccines, soy, feminism, what have you.) The real reason for this decline is simply a lack of physical activity in our sedentary existence.",
   "created_utc": 1690219227,
   "score": 223,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9ntar",
   "message": "Just the loneliness. Not in a \"woe is me this is a crisis\" way. \n\nMore in this pit-in-the-stomach yearning and sense of loss I feel seeing how many friends my father had in his 40s and 50s and how Ill probably never have that.",
   "created_utc": 1690216630,
   "score": 81,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9safn",
   "message": "after being a victim of an affair and having 3 children, being treated as though you did it and then being threatened with losing you’re children though you’ve done nothing wrong just because of the county you live in and you’re a man.",
   "created_utc": 1690218340,
   "score": 85,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9r0u9",
   "message": "Feeling disposable and treated like I've caused all the problems in the world.",
   "created_utc": 1690217849,
   "score": 136,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9p7yh",
   "message": "That even in this day and age you can be sexually harassed or assaulted and no one will take your side because you are a man.",
   "created_utc": 1690217168,
   "score": 250,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9o01n",
   "message": "That there's not an adequate way for men to support their families with traditional blue collar jobs anymore. \n\nMy Dad and Grandpa were both mill workers and could afford new vehicles, houses, hunting property, and yearly vacations all while comfortably saving for retirement. Meanwhile, I'm a welder and there's absolutely no way I'm doing any of that on current wages.",
   "created_utc": 1690216701,
   "score": 241,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9rph9",
   "message": "One thing that is difficult for me is that I'm an expert in my field, but my field is traditionally dominated by females. I'm an educator. When we have meetings and we are discussing philosophy of education or new policies, or changes in curriculum I always bite my tongue. I have a master's degree in curriculum design and implementation and at a curriculum meeting when we were asked for our input I had thoughts about the particular topic. So I expanded on those thoughts in front of the group, as did others. Afterwards the presenter told me that what I had done was mansplaining. I asked how it was different that the others in the room, who are all female, did the same thing and that was appropriate but mine was not? I was told that I have to be careful because as a man explaining something in depth could be considered inappropriate. I know that the presenter was off her mark. But now every time I have a thought or comment that I want to contribute I keep it to myself.",
   "created_utc": 1690218111,
   "score": 14,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9pneh",
   "message": "My childhood fucked me up and I had no idea how messed up I was. Now I’m 25 and don’t have close relationships with anyone and don’t know where to turn",
   "created_utc": 1690217332,
   "score": 55,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jtaehby",
   "message": "This thread strengthens my conviction that we need tons more mental health care availability. Almost all replies here relates to being lonely and having no one to talk to, while at the same time being uncomfortable with talking to male friends. This is where a therapist would do wonders.",
   "created_utc": 1690227169,
   "score": 26,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9jwu0",
   "message": "I think one difficult aspect of being a man is either the social or self imposed expectation to keep emotions bottled up inside and not reach out for help even during the most difficult of times.  There's a misconception that seeking support or sharing feelings is \"not manly\" or \"weak\".  The burden of trying to be stoic all the time can weigh heavily on a person and destroy them from the inside.",
   "created_utc": 1690215129,
   "score": 49,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9nzlm",
   "message": "The Eldritch whispers in the back of your mind...",
   "created_utc": 1690216697,
   "score": 3,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9mdbc",
   "message": "Having normal products marketed to me with diamond plate or camouflage and the word \"MAN\" in the product name because they think that just buying normal q-tips or baby wipes will shatter my fragile sense of self.",
   "created_utc": 1690216073,
   "score": 159,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9km6o",
   "message": "I feel like we’re bit in a gray area where society is transitioning. The old way was the man was the provider, was a protector of the family, opened doors for women, etc. Now we’re in a modern society and traditional roles are changing. As a man I feel like I’m still expected to do a lot of the traditional things, and also do the more modern things. \n\nFor example, as a husband in my household I’m still expected to be the provider, do the home repairs, take out the trash, etc., and I’m also expected to do the more modern things like to help clean the house, help with the kids, etc. I don’t mind either, but I feel like I’m expected to fulfill both traditional and modern roles.",
   "created_utc": 1690215402,
   "score": 175,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9l8i5",
   "message": "It really isn't that big of a deal but it's even something my wife is guilty of. We are pretty good about splitting everything for our kids, house, etc. 50/50 but every now and again my wife will say something like \"c'mon babe I need you to be daddy and do this for me\". \n\nBasically, that in many regards in life I am expected to be the man and be daddy but if I were to say something like this to my wife she would say something like \"I'm not a SAHM\".",
   "created_utc": 1690215641,
   "score": 234,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9qq01",
   "message": "Man as a father trying not to let my family feel the financial stress of the past couple years. Working more hours, starting a side business and feeling like I'm barley getting by while not missing these years with my 5 and 2 year old. Hopefully things continue to mellow out this year but I feel for every dad out there knowing inflation has taken a toll in one way or another affecting the way we were able to provide.",
   "created_utc": 1690217734,
   "score": 191,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9qgw4",
   "message": "When your wife is abusive and all of your feelings are dismissed.",
   "created_utc": 1690217639,
   "score": 75,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9r459",
   "message": "Tl;dr: Now that men are becoming more in tune with their emotions, people still don't care. To quote a silly video I watched \"Is that your big plan here? To make me feel things just so that you can cut me down a peg?\"  \n\n\nThe breakdown between the old school way of thinking between men and women and the new school growth we're seeing happen.  \n\n\nIf you were born between '00 there was likely a more traditional mindset of shutting up and doing what society said your gender role was. So a lot of us grew up with that rhetoric baked in. As we've all gotten older, we've grown on what we should be. Men should be more in tune with our emotions, being more open to more feelings than just lust or anger. They should also stop considering women as inferior and see them as equals **(shocker /s)**. Women should be more self-sufficient and should demand their even seat at the table. **Personally, I think these shifts are great. The more traditional mindsets are awful and limiting and I'm glad they're changing.**  \n\n\nThe issue lies in one piece that has been far more sluggish in changing. Even in the cases where all of the above is happening, young women are taking their seats and young men are being more open to emotions, it's still difficult for men's emotions, now that they are more openly communicated, to be accepted. A man will open up and be told \"stop bitching, you sound like a woman\" by women and now there are trust issues on top of all the emotional issues we are working through.",
   "created_utc": 1690217885,
   "score": 86,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9rwqc",
   "message": "Barber shops are becoming overpriced and full of bs. No, I don't want to play pool/ps5 and drink your overpriced beer while I wait for an hour to get my haircut because there's only one \"artist\" available in your whole salon.\n\nI just want my quick, simple classic haircut and f-off as soon as possible.",
   "created_utc": 1690218191,
   "score": 134,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9k275",
   "message": "When I take my kids to the park without my wife I’m automatically looked at as a predator. Last time we went a Karen got the cops involved.",
   "created_utc": 1690215187,
   "score": 31,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9vkk8",
   "message": "Literally being told you're shit because you exist as a man. \n\nOr being told to show emotions even though nobody actually means it. The minute you open up you're vulnerable and nobody wants that. Especially your girlfriend/spouse. Shit. I dated a freaking therapist for a few months. I opened up and told her I was feeling a bit stressed with work. I was dumped a few days later. Lol\n\nBeing short. I'm 5' 8\" and I kept getting unmatched the minute I said my height. I ended up needing to have it in my profile. Even had some women say they weren't happy about it but they MAY be able to look past it. \n\nGetting objectified and even groped but literally have women tell you it's not the same and to STFU because it's only women that have that issue.\n\nEdit to say I've reached 100 upvotes like 6 times now. People are really just proving my point. You can't handle a little bit of truth.",
   "created_utc": 1690219612,
   "score": 185,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9mv21",
   "message": "Being in 2023",
   "created_utc": 1690216263,
   "score": 54,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9qaq8",
   "message": "General lack of understanding and support. Dudes aren’t good at supporting other dudes and neither are chicks. Being raised by the “walk it off” generation makes it tough to understand when maybe we need a hand or when someone else needs a hand and how to respond appropriately. Add on top of that shifting expectations and targets of people who want someone who is emotionally available but in reality they have no idea what to do with that type of person when they get their hands on one.",
   "created_utc": 1690217574,
   "score": 45,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9xe32",
   "message": "I’m a wife. This is just my perspective, but I feel as though societal expectations for men to provide for their families are too high. The success of their family (what house they live in, standard of living, etc) falls more on them..and they’re the ones blamed if things go wrong. “He should work harder. He should get a second job. He needs to provide for his family.” But when he’s gone too much, providing, he’s considered an absent husband/father who doesn’t help and then is judged for that too. They’re expected to provide for us all, which in this housing market is so hard, and they work themselves so hard and then they’re expected to help us with our house and our kids and be there for their extended family and then they’re not allowed to be stressed or overwhelmed because most men were raised not to show emotion. None of this is my standards, and I expect nothing from him but the mutual love and respect that we agreed to in our wedding vows. I’m sorry if this got a little ranty. I just see so many guys working their asses off and no matter what they do, they’re damned if they do work overtime and damned if they don’t.",
   "created_utc": 1690220302,
   "score": 77,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9pecz",
   "message": "Unsettling truth is that despite leaps in societal advancement, the stereotype of 'tough it out' mentality still persists, and it's magnified in a hyper-connected era.",
   "created_utc": 1690217236,
   "score": 57,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jtafntc",
   "message": "Some places still don’t have nappy changing stations in mens washrooms!",
   "created_utc": 1690227623,
   "score": 44,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9oufk",
   "message": "Lack of purpose. I just want to feel useful to *someone*, but I just don't see what I offer my friends, my gf, my family or my employer that they can't get better from others.",
   "created_utc": 1690217023,
   "score": 65,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9nkjw",
   "message": "Being completely and utterly expendable.",
   "created_utc": 1690216537,
   "score": 124,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9wd0z",
   "message": "For me specifically: balding.  I started in high school and just went full chrome dome this weekend",
   "created_utc": 1690219915,
   "score": 50,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9n5fl",
   "message": "It is and always has been balls sweating and sticking to our thighs and the stares and looks when you are shaking your leg like a mad man then trying to release the balls incognito so people dont freak out. 😜",
   "created_utc": 1690216373,
   "score": 34,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9lnxs",
   "message": "Peeing in a busy public bathroom while wearing sandals.",
   "created_utc": 1690215804,
   "score": 20,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jtanptx",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jtaa3w1",
   "message": "From my data analysis of this thread, we (men) should turn gay so we have better chances of finding someone",
   "created_utc": 1690225478,
   "score": 41,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jtba6au",
   "message": "The men who make the rest of us look like rapey cave trolls.",
   "created_utc": 1690239768,
   "score": 9,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9ommx",
   "message": "It's getting harder and harder to be a provider in an age where wages are stagnant and COL is skyrocketing.",
   "created_utc": 1690216940,
   "score": 71,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jtb76do",
   "message": "Seeing more and more men my age being sucked into the Andrew Tate type Alpha Male pipeline because there's no real positive alternative male role model.",
   "created_utc": 1690238491,
   "score": 8,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9qfit",
   "message": "Bro no one gives a shit about us 😂 like at all, it’s honestly wild. Dude could be fighting the most insane demons and not a single soul will know or care, you could scream it from the mountaintops that you’re in pain and need help and no one will even flinch. That’s the reality of it.",
   "created_utc": 1690217625,
   "score": 87,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9tgh0",
   "message": "Not being able to afford a family home for your wife and kids even though you work a full time job. How demoralizing.",
   "created_utc": 1690218799,
   "score": 47,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9xirc",
   "message": "That in modern society it is seen as an issue to not express your problems via talk or talk therapy as a man. That expressing your emotions via action is considered toxic, and there is something inherently wrong with being stoic\n\nI'm semi reposting this because it got traction in a comment and I felt it was important.\n\nThe best example of this is a story I once heard about a family losing the mother. The father and the son build a house in memory of their mother. The daughter could not understand why they were not talking about their grief, but they were expressing their greif through action. \n\nWhen my mother died I decided I was going to collect and buy/restore all the main series Pokemon games. I did this in her memory because she was the person who I remember buying me a GBA with Pokemon Gold (Damn Ho-Oh I wanted Lugia). I remember waking up Xmas morning and opening my presents and my mother just sitting and watching me play and in absolute awe at my wonder and excitement. \n\nI will be the first to admit men suck at communicating there emotions and what they are actually doing, but the truth is that most people don't understand it on a conscious level. These behaviors are generally fundamental biological human behaviors. They are to common not to be biological in nature.",
   "created_utc": 1690220352,
   "score": 13,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9nlc9",
   "message": "Inflation is outpacing earnings increases in my area. And, the cost of housing is simply wild.",
   "created_utc": 1690216545,
   "score": 51,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9sx9h",
   "message": "As a gay man there’s a constant undercurrent of unease as the political atmosphere starts to boil and what exactly that means for me, my partner, and our community.\n\nI don’t want to be afraid of the world I live in. I work hard, pay my taxes, and live an unassuming life. I don’t get why my acceptance into the larger community let alone my very existence has to be a point of contention.",
   "created_utc": 1690218588,
   "score": 54,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jtb89dw",
   "message": "Traditional masculinity is shunned meanwhile the things it provides are expected.",
   "created_utc": 1690238955,
   "score": 7,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jt9os0i",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jtb6nxs",
   "message": "I’m tired of pretending it doesn’t suck to hear my wife and close friends say, “all men suck,” or “we’d be better off without men.” I know they don’t mean it entirely, but when you hear it enough times it’s hard not to feel as if they do.",
   "created_utc": 1690238269,
   "score": 126,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jtau5wm",
   "message": "TIL there are a lot of dudes who are lonely or do not feel supported.  If anyone is in those shoes, please send me a DM. I am happy to chat about whatever is on your mind or give advice if desired.  \nDo you want to be helped, heard or hugged?",
   "created_utc": 1690233178,
   "score": 21,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jtatfss",
   "message": "No one believes you if you’ve been through things women tend to have a community for…abuse, neglect, harassment, SA. Your experiences tend to be brushed aside. \n\nWorst experience is when someone told me not to complain just because I had never been through it even though I had. I hate people sometimes",
   "created_utc": 1690232893,
   "score": 18,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jtbl3oh",
   "message": "Constantly hearing about how men should be open about their emotions by the same people who tell you to \"man the fuck up\" whenever you open up about your emotions.",
   "created_utc": 1690244535,
   "score": 20,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jtb5t1v",
   "message": "You know all those \"haha where were all those horny teachers when I was younger\" posts/memes we get every so often? Yeah. Fuck them.\n\nPeople see I good looking woman they would like to fuck and think a 14 y/o is lucky to have been raped by her. Fuck those people.",
   "created_utc": 1690237900,
   "score": 11,
   "submission_id": "158ed30"
  },
  {
   "comment_id": "jtbd1m9",
   "message": "the kill all men jokes, they’re not even funny or ironic it’s just sexist and make most men feel awful",
   "created_utc": 1690241015,
   "score": 40,
   "submission_id": "158ed30"
  }
 ]
}