{
 "submission_id": "158glca",
 "title": "What are some social norms that are pretty fucking weird if you think about it?",
 "selftext": "",
 "created_utc": 1690218565,
 "permalink": "/r/AskReddit/comments/158glca/what_are_some_social_norms_that_are_pretty/",
 "score": 196,
 "url": "https://www.reddit.com/r/AskReddit/comments/158glca/what_are_some_social_norms_that_are_pretty/",
 "comments": [
  {
   "comment_id": "jtaqqmj",
   "message": "Paying tens of thousands of dollars to bury corpses in the fuckin ground.",
   "created_utc": 1690231852,
   "score": 195,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9yf09",
   "message": "Not going to the cinema by yourself.\n\nIf I’m going to sit in silence in a dark room while looking forward why do I need other people there? It’s not a particularly social activity.",
   "created_utc": 1690220691,
   "score": 85,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9vj0e",
   "message": "Blowing out candles on a birthday cake.",
   "created_utc": 1690219595,
   "score": 25,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jta5h81",
   "message": "Women can show their whole breast just not the nipples.",
   "created_utc": 1690223680,
   "score": 157,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jta4p5m",
   "message": "Fairy tale weddings. Huge money and stress for an over choreographed one day party.",
   "created_utc": 1690223374,
   "score": 155,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9t8cn",
   "message": "Working your ass off for 65 years to then live for 10 years",
   "created_utc": 1690218708,
   "score": 141,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9z6aq",
   "message": "Balloons. Here's a plastic sack of my breath. Happy birthday.",
   "created_utc": 1690220981,
   "score": 63,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtagedx",
   "message": "Asking people how they're doing as a matter of courtesy when you truly don't care and are hoping they just say \"good hbu\" in response",
   "created_utc": 1690227907,
   "score": 189,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9zoml",
   "message": "All these random “rules” about texting people. Texting is supposed to be a medium to talk to people and they can respond at their own convenience. \n\nInstead it’s turned into a puzzle of deciphering how long messages should be, how long should I wait before replying, do I double text them or not, did they read my message, why did they leave me on read, list goes on and on…",
   "created_utc": 1690221174,
   "score": 13,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtafe49",
   "message": "Forcing or encouraging a child to hug a family member that has known them since their birth but the child doesn't have any sort of bond with said family member.",
   "created_utc": 1690227520,
   "score": 76,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtad3vy",
   "message": "You can't use swear words on TV, radio, or in movies under PG-13; but you learn most of the swear words that exist by middle school. What's the point?",
   "created_utc": 1690226636,
   "score": 226,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9xtxs",
   "message": "Women's shoes. \n\nI am man btw but I had this argument with my wife, I told her women's shoes were impractical, uncomfortable, many of them like heels are very bad but flat ones are also just as uwful and just dam right pointless. Eventually wheb i explain with most Mens shoes they are comfortable and robust and a little bit of rain doesnt soak them she suddenly went 'yea they are shit' but said that's what we wear. \n\nLiterally a social construction for women to wear shit shoes.",
   "created_utc": 1690220468,
   "score": 159,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9viid",
   "message": "The expectation of tipping for certain jobs, as a substitute for paying employees a higher wage.",
   "created_utc": 1690219590,
   "score": 54,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtafusk",
   "message": "Everything considered drinking culture.",
   "created_utc": 1690227697,
   "score": 68,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9zv9x",
   "message": "Fuck xxx Fuck you yyyyy…written on flags and bumper stickers….I remember adults saying watch the language there’s children../.now it’s fuck those kids…",
   "created_utc": 1690221245,
   "score": 245,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtam8ml",
   "message": "I can’t think of a single reason for ties being the standard for business attire other than it’s a reminder to everyone in the room that you could be easily strangled at any time.",
   "created_utc": 1690230146,
   "score": 66,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9tbiz",
   "message": "Why do men get the higher bar on the bicycle when they take more damage from hitting it?",
   "created_utc": 1690218743,
   "score": 23,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9ycmi",
   "message": "Having listening devices hooked up to the internet in most homes.",
   "created_utc": 1690220665,
   "score": 84,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtae8dh",
   "message": "Open casket funerals. I know it helps some people with closure, but I'd just rather not.",
   "created_utc": 1690227071,
   "score": 51,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtabola",
   "message": "If someone asks how you're doing, if the answer is anything other than \"good\" then it's weird and the person who was asked is at fault for making it weird.",
   "created_utc": 1690226086,
   "score": 63,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtafe1v",
   "message": "Spending thousands of dollars on a wedding.",
   "created_utc": 1690227520,
   "score": 166,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jta4ouu",
   "message": "Clapping.  We show appreciation by smacking our hands together to make a noise.",
   "created_utc": 1690223371,
   "score": 209,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtajmjf",
   "message": "Family asking if you're trying for a child. \n\nLike yep aunt June I'm giving her a cream pie every night. Just load after load busted inside her.",
   "created_utc": 1690229148,
   "score": 111,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtaiz2q",
   "message": "The topic of sex being generally taboo despite the fact that it is the reason we’re all here and that a majority of people fucking love it",
   "created_utc": 1690228892,
   "score": 202,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9yg8k",
   "message": "It's baffling that only one gender is expected to wear make up and the other is discouraged. Just makes less sense the more that I think about it.",
   "created_utc": 1690220704,
   "score": 114,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jta3e5o",
   "message": "Circumcision is pretty wild.  Cosmetic surgery on the genitals of a baby is pretty fucking weird.",
   "created_utc": 1690222839,
   "score": 82,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtabxj3",
   "message": "Blessing someone when they sneeze is bananas.",
   "created_utc": 1690226181,
   "score": 1,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtaqr8j",
   "message": "Education should be fully free across the board. It makes 0 sense that a country would impoverish their own people rather than invest in a strong, educated and healthy population.  \n\nThe ONLY reason that university costs money is to perpetuate social stratification. You could probably take 5% of the military budget and it would more than cover it.  \n\nAlso, isn’t that what “free market” people always bitch about? That once people are rich they will give back and trickle down? Tax the 1% sell slightly more and you would have it paid for.  \n\nGermany has free education. It works just fine.  \n\nIf you are smart and ambitious enough to attend a university, it should be fully state sponsored. The only reason people are against this, is that some kids who grew up rich and didn’t have to take out a mortgage to enter the rat race are jealous they don’t get to keep their advantage.",
   "created_utc": 1690231858,
   "score": 2,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtautt9",
   "message": "Taking up valuable real estate to toss your dead relatives into holes.\n\nPumping your dead relatives full of chemicals so they last longer.\n\nForking over massive sums of money to put dead relatives in ornate boxes that go into the ground and are never seen again. Same with that expensive suit or outfit.\n\nParading dead people around town in convoys, which also costs a fortune.\n\nPaying some crank for bloviating over your dead relatives, pretending they weren't the shitheads that they really were.\n\nWhen I finally go, they can toss my ass in the closest major body of water for the fishes, or set me up high in a pyre for the carrion birds and a bonfire.",
   "created_utc": 1690233441,
   "score": 105,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtaggr4",
   "message": "Consuming milk from other animals and it is totally normal but mention consuming human milk by a non infant and you are crazy.",
   "created_utc": 1690227932,
   "score": 122,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtaebd3",
   "message": "Encouraging people to drink more alcohol. I'm guilty of it myself, 'go on, just one more!' Or I've bought shots for people who have said no, which then pressures them to drink it.\n\nI didn't see a problem with it until I saw a guy taking the piss out of another guy for drinking alcohol free beer. Imagine being ok with being pressured to take drugs? It's madness when I think about it.",
   "created_utc": 1690227104,
   "score": 24,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9vmya",
   "message": "Shaking hands and staring at people's eyeballs.",
   "created_utc": 1690219637,
   "score": 255,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jta0k3m",
   "message": "telling ppl that you and your SO are having tons of unprotected sex.... you know, telling ppl you're trying to have a baby...",
   "created_utc": 1690221506,
   "score": 9,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtaj7qs",
   "message": "Getting so drunk that you end up passed out or fighting in the street of a evening!",
   "created_utc": 1690228987,
   "score": 12,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtau6lh",
   "message": "People's absolute horror about women breastfeeding in public.\n\nOh, I am sorry, Karen. I am giving my baby substance, not trying to attract your 12 year old son.",
   "created_utc": 1690233186,
   "score": 254,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtaenf1",
   "message": "Asking a grown woman's father for her hand in marriage.  What?",
   "created_utc": 1690227234,
   "score": 245,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtaqp1t",
   "message": "Showing excessive gratuitous violence is fine, and will get you at most a PG-13 rating, which most people will think is too strict anyways. But show even one uncovered booby and people will lose their minds.",
   "created_utc": 1690231836,
   "score": 157,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtarrju",
   "message": "Purses seem super useful. Why are men seemingly universally afraid to carry one of their own?",
   "created_utc": 1690232243,
   "score": 31,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jta35qg",
   "message": "Most pleasantries. \n\nWe ask each other how we're doing and stuff like that, but most people dont even really care. We ask anyway because we are supposed to. \n\nIt's most obvious when someone says \"How you doin? So anyway..\" like they just move on with the conversation without an answer seemingly aware how pointless it is, but it happens anyway.",
   "created_utc": 1690222740,
   "score": 38,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtagkzb",
   "message": "The expectation to have a huge wedding",
   "created_utc": 1690227976,
   "score": 69,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jta5nec",
   "message": "Caring what another person wears or what they look like.",
   "created_utc": 1690223746,
   "score": 116,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtaf4yu",
   "message": "The absurd obsession the US has with the flag and the \"reverence\" surrounding it.\n\nIt's a godsdammed piece of fabric.\n\nActually, US patriotism as a whole. https://en.m.wikipedia.org/wiki/American_civil_religion",
   "created_utc": 1690227423,
   "score": 117,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtabety",
   "message": "Tipping hotel housekeepers if you stay 1 night. Its literally their job to clean the room after your stay, before the next guest.",
   "created_utc": 1690225982,
   "score": 17,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9v89r",
   "message": "Having social media",
   "created_utc": 1690219479,
   "score": 28,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtas657",
   "message": "Spending so much for a funeral. Uncle bob is dead, a 1200$ coffin or a 100$ coffin is the same for him.",
   "created_utc": 1690232400,
   "score": 85,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtakq53",
   "message": "Huge weddings. People are paying thousands just to have a nice ceremony for one night and that's it? Come on, they aren't even enjoyable.",
   "created_utc": 1690229566,
   "score": 8,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jta41i6",
   "message": "Shaking hands (at least in America). \n\nIt’s gross. Most people have terrible hygiene or hand washing skills.",
   "created_utc": 1690223110,
   "score": 48,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9zl6p",
   "message": "I could give you a pretty detailed list. But I think one of the most weird and detrimental to society is beauty standards and impossible looks and body types.",
   "created_utc": 1690221138,
   "score": 86,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9z6l1",
   "message": "They are all fucking weird. I just don't get it...",
   "created_utc": 1690220984,
   "score": 23,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtahjga",
   "message": "Women pay way more than men for haircuts",
   "created_utc": 1690228342,
   "score": 21,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtaoqqd",
   "message": "The idea that saying hello while passing others on a trail or in a park is normal and welcomed, but everywhere else is odd?",
   "created_utc": 1690231091,
   "score": 8,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtb2obz",
   "message": "People expect you to get along with family (parents, siblings) even if they treat you like shit.",
   "created_utc": 1690236583,
   "score": 154,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9y8sh",
   "message": " Working 40 hours a week. It’s actually insane that we all put up with it.",
   "created_utc": 1690220625,
   "score": 38,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtauk9g",
   "message": "Not going to a restaurant by yourself. \n\nI am on a business trip, I want to eat somewhere nice, drink some wine, dine nice since the company is paying for that stuff, I didn't bring anyone because its my arrival night or I just want to have a moment for myself. \n\nAnd then I get treated like I have a leprosy, or the waiter tries to strong-arm me to go to the communal area or patio to eat because then I would have some company from the random patrons.",
   "created_utc": 1690233335,
   "score": 5,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtaw8o7",
   "message": "Anything funerary short of cremation or dumping bodies outside city limits.\n\nWhen someone's dead, they no longer exist as a thinking being, so funeral rites cease to matter to them no matter what their wishes were. Their friends and family will probably want a place to gather to remember, but why do they have to gather around ashes in a jar, or a corpse in a box that's buried under dirt? For that matter, how weird is it that we drive past dozens of buried corpses every day?",
   "created_utc": 1690233995,
   "score": 8,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtayljg",
   "message": "All of it - how strange it is to be anything at all",
   "created_utc": 1690234934,
   "score": 6,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtb9w8b",
   "message": "Having Constitutional rights when the justice system does not recognize them.",
   "created_utc": 1690239648,
   "score": 7,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jta6e8t",
   "message": "Blowing out birthday candles - basically blowing your germs all over cake you’re sharing with others .",
   "created_utc": 1690224037,
   "score": 18,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jt9z6nu",
   "message": "Dancing in general. You just go and make unusual movements with your body and its perceived as an enjoyable and fun activity by most people.\n\nThat I can kind of understand, okay. But going to a club and dancing for *hours*? Insane",
   "created_utc": 1690220985,
   "score": 57,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jta20q5",
   "message": "Posting about others' lives on social media, I guess. Or maybe it just annoys me that apparently I(a legal adult) am not in command of my own privacy because my mom wants to publicize things about me at her seriously misunderstanding discretion",
   "created_utc": 1690222229,
   "score": 11,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtadhtf",
   "message": "Acknowledging other peoples sneezes. I’m done with it.",
   "created_utc": 1690226785,
   "score": 12,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jta5jgj",
   "message": "Women’s pants don’t have pockets.",
   "created_utc": 1690223704,
   "score": 20,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtagn6l",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtb0oxq",
   "message": "I feel like too many people talk on speakerphone.  Do you remember when conversations were private?",
   "created_utc": 1690235768,
   "score": 203,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtb9nbh",
   "message": "Garter toss is fucking weird",
   "created_utc": 1690239543,
   "score": 235,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtb3eyx",
   "message": "Everybody hates being sung happy birthday and everybody hates singing happy birthday, so what the fuck are we doing here?",
   "created_utc": 1690236892,
   "score": 124,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtaupk7",
   "message": "Telling babies/kids that people are gonna need to hide their daughters or lock up their daughters/ no dating until their 20something.",
   "created_utc": 1690233393,
   "score": 4,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtb6wl8",
   "message": "Cards.\n\nI'm just giving Hallmark money in exchange for a piece of paper that someone's going to look at for about 10 seconds and then completely forget about.",
   "created_utc": 1690238374,
   "score": 159,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtax3z2",
   "message": "Sending hungry kids to school and not feeding them for free.",
   "created_utc": 1690234340,
   "score": 248,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtc0pvs",
   "message": "Suppressing emotions = “strength”",
   "created_utc": 1690251808,
   "score": 62,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtax7j6",
   "message": "Blood and gore: Meh\n\nSex and nudity: Oh my word!",
   "created_utc": 1690234380,
   "score": 108,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtc03pj",
   "message": "Most of them, I’m autistic",
   "created_utc": 1690251507,
   "score": 70,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtbcjb6",
   "message": "Women being expected to legally change their last name for marriage.",
   "created_utc": 1690240795,
   "score": 63,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtakbdr",
   "message": "Genital mutilation, including circumcision. Fucking weird and atrocious.",
   "created_utc": 1690229409,
   "score": 20,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtbc23f",
   "message": "Why am I the weird one for not wanting to talk to strangers or co workers",
   "created_utc": 1690240584,
   "score": 17,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtb376j",
   "message": "Going out for drinks and/or food abruptly becomes everyone’s one and only hobby after becoming an “adult”",
   "created_utc": 1690236802,
   "score": 39,
   "submission_id": "158glca"
  },
  {
   "comment_id": "jtas8ib",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158glca"
  }
 ]
}