{
 "submission_id": "158hw8i",
 "title": "What is the best response to someone who sincerely believes the Egyptian pyramids were built by aliens?",
 "selftext": "",
 "created_utc": 1690221418,
 "permalink": "/r/AskReddit/comments/158hw8i/what_is_the_best_response_to_someone_who/",
 "score": 108,
 "url": "https://www.reddit.com/r/AskReddit/comments/158hw8i/what_is_the_best_response_to_someone_who/",
 "comments": [
  {
   "comment_id": "jta4oms",
   "message": "“Pfft, you believe in the Pyramids?”",
   "created_utc": 1690223369,
   "score": 253,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta36oq",
   "message": "Shal'kek nem'ron! Before blasting that Goa'uld away",
   "created_utc": 1690222751,
   "score": 24,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta2e5g",
   "message": "Keep encouraging them to explain. You never know where the conversation will go.",
   "created_utc": 1690222401,
   "score": 115,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta3sxg",
   "message": "They were actually built by humans, although those humans were enslaved by a hostile alien race called the Goa'uld.",
   "created_utc": 1690223012,
   "score": 223,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta8emq",
   "message": "They weren't built by aliens, they were built by the unions... Local Pyramid Builders 2601BC.",
   "created_utc": 1690224820,
   "score": 63,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta5l42",
   "message": "My preferred response is to try and one-up conspiracy them until they realize what’s going on and dip. \n“Haha you believe in the pyramids??? Those are fake! Yeah it’s all photoshop and THEY want you to believe that there are pyramids and that aliens built them in order to cover up what’s happening in the Mariana Trench.”\nEdit: fixed a word",
   "created_utc": 1690223721,
   "score": 59,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta98ev",
   "message": "Say I was an Egyptian in a past life and I helped building pyramids. There were no aliens involved",
   "created_utc": 1690225138,
   "score": 21,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta5pbl",
   "message": "“That’s not all they built… they’re running our fucking government and convinced everyone the world is round and birds are real”",
   "created_utc": 1690223767,
   "score": 54,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta179z",
   "message": "If you like this version then believe with pleasure my friend",
   "created_utc": 1690221749,
   "score": 49,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta3wz3",
   "message": "Right because aliens traveled dozens of light years, trillions of kilometers, to (checks notes) stack a bunch of rocks.\n\nMakes perfect sense.",
   "created_utc": 1690223058,
   "score": 67,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta5o39",
   "message": "The one up approach.  Tell them the evidence is clear as day that Lizard People built them and then show him the video of the lady freaking out on the plane.  Shake your head defiantly \"Yes\" the entire time.  Any response, replay the video and point at the phone aggressively.  Works every time",
   "created_utc": 1690223753,
   "score": 28,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta8e2n",
   "message": "Wow, cool. What else did they build?",
   "created_utc": 1690224814,
   "score": 20,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta3n92",
   "message": "\"Never argue with an idiot, they will bring you down to their level and beat you with experience.\"",
   "created_utc": 1690222947,
   "score": 49,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtab9ap",
   "message": "Please. The pyramids are fake so that real patriots can't figure out from where in Ukraine they're projecting the fake moon, which is used to cover up the chemtrails at night so that the global cabal of lizard people (the real aliens that arrived and covered up the truth of the flat earth) can continue to pizzagate our children.",
   "created_utc": 1690225920,
   "score": 9,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta3tmu",
   "message": "Get a picture book, not too juvenile, demonstrating how it was actually done. Remind them of what marvels people are capable of even when they don't have all of our modern technological advantages. The Apollo mission that put men on the moon had less computing power than a 1990s flip phone, for instance. Spectroscopy enabled scientists to figure out what elements the sun is made of, half a century before the invention of the airplane. Greenwich mean time longitude was mapped for the entire world centuries before the invention of GPS. And so forth.",
   "created_utc": 1690223020,
   "score": 24,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaae9l",
   "message": "I'm Colonel Jack O'Neil from General West's office. I'll be taking over from now on.",
   "created_utc": 1690225590,
   "score": 5,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtabaii",
   "message": "Get out of my bathroom!!",
   "created_utc": 1690225934,
   "score": 8,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaeb11",
   "message": "I’ve got a beautiful bridge to sell to you",
   "created_utc": 1690227100,
   "score": 6,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta3ro0",
   "message": "yeah, of course.  They did mount rushmore too.    \n\n\nand at the SAME TIME!!!!!!!!!!!!!!!    Explain to them that there is a 5th face on mount rushmore.  A future president.",
   "created_utc": 1690222998,
   "score": 13,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta8t5e",
   "message": "\"You still believe in Space?\"\n\n\nThe last person that told me the moon landing was fake got hit with \"you still believe in the moon? Talk about gullible!\"",
   "created_utc": 1690224973,
   "score": 7,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtabti9",
   "message": "“Next you’ll tell me the moon isn’t made of cheese”",
   "created_utc": 1690226139,
   "score": 5,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaeks9",
   "message": "Honest question - do we have evidence as to how a civilization so long ago did something so awesome and perfect?  And no, I don’t believe the aliens theory",
   "created_utc": 1690227206,
   "score": 8,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta2q12",
   "message": "Ask if they're a fan of Stargate SG-1 and the rest, and how accurate they think the show is about the history they believe. It could at least be an interesting conversation.",
   "created_utc": 1690222545,
   "score": 10,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta5hjp",
   "message": "\"Ok \\*shrug\\*, I guess nothing is impossible. Hey, are you into \u0026lt;band\u0026gt;?\"",
   "created_utc": 1690223683,
   "score": 7,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaatfi",
   "message": "Tell them to stop bogarting and pass the joint",
   "created_utc": 1690225752,
   "score": 5,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta4z4s",
   "message": "Silence. Let it soak in. Awkward silence. Enough said.",
   "created_utc": 1690223483,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta64na",
   "message": "I’ll listen if they’re buying the next round",
   "created_utc": 1690223932,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta6yoi",
   "message": "\"Nuh-uh\"",
   "created_utc": 1690224262,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta705s",
   "message": "Wait til Wednesday, you can ask them yourself.",
   "created_utc": 1690224278,
   "score": 4,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaa92m",
   "message": "There’s probably nothing you can do. People who believe conspiracy theories usually have an emotional investment in them that can’t really be addressed through debate.",
   "created_utc": 1690225534,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtb1evc",
   "message": "He/she could be right. Who are you to shut people down without opening your mind a bit first. Imagine explaining an iPhone to a neanderthal. Same situation.",
   "created_utc": 1690236062,
   "score": 1,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtb67wc",
   "message": "I tell them to Google [Wally Wallington](https://youtu.be/E5pZ7uR6v8c).\n\nHe’s an engineer who, using only fulcrums and levers, moves multi-ton monoliths by himself.\n\nThen I say, “imagine what it would be like if you had droves of people working together.”\n\nNot really much of a conversation after that.",
   "created_utc": 1690238077,
   "score": 4,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta0mdl",
   "message": "\"Watch out, pal. The aliens know that *you* know their secret now.\"",
   "created_utc": 1690221529,
   "score": 7,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta13ee",
   "message": "\"See you tomorrow at the start of visiting hours. Be sure to take your meds.\"",
   "created_utc": 1690221708,
   "score": 5,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta1rp0",
   "message": "Ask them if they can hold the possibility that humans built the pyramids without the help of aliens.  If they say that they can’t hold that possibility in their head, then end the conversation because there’s no point in having a conversation unless you wanna hear how aliens built the pyramids.",
   "created_utc": 1690222115,
   "score": 7,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta495w",
   "message": "Your an idiot. Everyone knows they where built by robots.",
   "created_utc": 1690223195,
   "score": 4,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtadn1n",
   "message": "Almost every ancient structure that's popularly credited to aliens almost always has them providing  such structures to people of color. Nobody ever claims the roman coliseum, or medieval churches were built by aliens. All white people get is Stonehenge and that's it. Compare that to Machu Picchu, the Nazca lines, Chichen Itza The pyramids of giza, the sphinx, Easter island heads, etc.\n\nThe only logical conclusion is that aliens hate white people and therefore didn't want to give us their cool stuff.",
   "created_utc": 1690226841,
   "score": 4,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta0gu9",
   "message": "Nothing. They’re an idiot lol. There’s nothing you can do for them.",
   "created_utc": 1690221471,
   "score": 18,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta2u8r",
   "message": "\"Ok\" really hit the o on it almost like \"ooook\". in all seriousness if somebody believes something so obviously insane don't argue with them plenty of people have already tried and failed",
   "created_utc": 1690222604,
   "score": 5,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtajzru",
   "message": "They must have been some dumb aliens.\n\nThe first Egyptian pyramid was the Step Pyramid. Hardly anything spectacular, definitely not beyond the abilities of ancient Egyptians.\n\nThe second, third and fourth pyramids all collapsed during construction or were never finished. These are the Buried Pyramid, the Layered Pyramid and the Meidum Pyramid.\n\nThe fifth pyramid was the Bent Pyramid, called that because (while it was completed) the architects made a simple math error, so the angle wouldn’t work and had to be fixed mid-construction.\n\nSo … if they were made by aliens, they were pretty useless and stupid aliens.",
   "created_utc": 1690229288,
   "score": 4,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaam8a",
   "message": "Do you have proof they were not? Let them believe what they want, why does it bother you? If people can believe they are a different gender or race, then damn it, people can believe aliens built the pyramids.",
   "created_utc": 1690225674,
   "score": 5,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta4ds0",
   "message": "Considering were getting alien disclosure from congress in the next coming weeks, I wouldnt dismiss it as a possibility anymore. Especially considering information which aligns and places aliens in ancient civilization.",
   "created_utc": 1690223246,
   "score": 11,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta7a99",
   "message": "Let them believe whatever they wanna believe? Tf 😂",
   "created_utc": 1690224386,
   "score": 1,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaa9f4",
   "message": "Why would you engage with someone like that?  I feel like this a situation you can't 'win'.",
   "created_utc": 1690225538,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtae9b6",
   "message": "Generally to ignore them and let them be dumb. You aren’t going to change their mind. Their identity is “thinking differently”. Trying to change that won’t work",
   "created_utc": 1690227081,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaeunb",
   "message": "If I respond to them then I’m already giving more of my time than they deserve.",
   "created_utc": 1690227314,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtafkkm",
   "message": "No response at all is the best for me.",
   "created_utc": 1690227589,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtafq0e",
   "message": "“You know who would love to hear all about it? My coworker Jeff, right this way. Hey Jeff can you help this customer I’m going on lunch”",
   "created_utc": 1690227646,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtafr78",
   "message": "Sincerely? Idk, get a wellness check on their mental health or something. Honestly your two options here are mental illness or weird political conspiracy cult. Or both. And the way to deal with it is by distancing yourself for safety while also extending them help.",
   "created_utc": 1690227659,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaihpd",
   "message": "Pyramids are literally one of the easiest structures to build on Earth. All you need is leadership over thousands of people and you can brute force them into existence. That's why they're so common in the early history of so many civilizations around the world. Stack more blocks on the bottom, less on the top. Give a child building blocks, and something similar will probably be among the first things they build.",
   "created_utc": 1690228705,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaka53",
   "message": "Just remember what they claim was built by aliens and what wasn’t. Egyptian pyramids? Aliens. Nazca lines? Aliens, Mayan pyramids? Aliens. Roman concrete and architectural advances? Superior ingenuity…….",
   "created_utc": 1690229396,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtamg36",
   "message": "\"That's nice, dad.\"",
   "created_utc": 1690230223,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaoiex",
   "message": "Take away the religious aspect and all it is...is a very large monument funded by one of the wealthiest nations on the planet at that time.  \nThey hired the best engineers, planners and then built a small city for the labor which contained schools, medical centers, and an internal hierarchy that mirrored its military.  \nIts fairly well documented that the workers were paid in beer and bread.  \nBasically they threw money at it.",
   "created_utc": 1690231004,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaoqfk",
   "message": "Say, \"What a coincidence: I prefer velcro shoes!\"",
   "created_utc": 1690231088,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtap3ar",
   "message": "\" i know. i was there when they did it\"",
   "created_utc": 1690231220,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtapfd6",
   "message": "They aren’t well made. We have a clear timeline of each progression in pyramid building from the small crappy ones to the big ones. Why would aliens need to teach us to spend 1000 years learning to stack rocks in a triangle? At least a flat earther you can say it looks flat sometimes…",
   "created_utc": 1690231348,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtavx16",
   "message": "Aliens? \nIt was crabpeople",
   "created_utc": 1690233865,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtazi11",
   "message": "I mean do ants have any idea what they are crawling or walking all over. I bet they got some crazy theories on why that perfectly sloped curb exists for infinity miles at the edge of concrete and grass",
   "created_utc": 1690235291,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtb3g8n",
   "message": "A quick tap to the back of the head with a blunt heavy object will do just fine.",
   "created_utc": 1690236908,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtb4bht",
   "message": "Give them some blocks and asked them to build the tallest, most stable structure with them. See what they build.\n\n*The pyramid is the simplest structure that humans could build that would function as a step to the heavens. Without modern reinforcement inside a tower or similar structure, the only way to build higher is to have the largest part at the bottom, and succeeding levels smaller, so the structure doesn't topple.*",
   "created_utc": 1690237274,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtb4fsp",
   "message": "Prove it.\n\n\"There was no way that they could -\"\n\n\"Where you there? Prove it! Prove they couldn't!\"\n\n\"YOU prove that they could!\"\n\n\"I made no claims. You're the one saying Aliens firstly exist, have had millenia old technology surpassing ours, came to earth, and decided to make tombs for the local government over a span of generations and the Egyptian people, who famously recorded their lives with art and scripture, made not a single reference in that time.\n\"YOU made the claim, not me. So prove it! Show me them aliens!\"",
   "created_utc": 1690237322,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtb4k13",
   "message": "\"We've been compromised. PROTOCOL OMEGA! SCREEEEEEEEEEEEEEEEEACH\"",
   "created_utc": 1690237372,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtb5hfm",
   "message": "No response is best.  Save your breath.",
   "created_utc": 1690237762,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtb6096",
   "message": "\"So you've been smoking crack since before you were born, right?\"",
   "created_utc": 1690237986,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtb6b5h",
   "message": "Humans have been stacking rocks on-top of each other for thousands of years all around the world.",
   "created_utc": 1690238116,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtb6geo",
   "message": "Bye",
   "created_utc": 1690238178,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtb6ye8",
   "message": "I’m not sure how it’s answered in other cultures, but here in Canada the appropriate response would be something like…\n\n“Alright, alllllright there bud, ok. So maybe you should back off a bit there on hacking all those left handed darts eh.”",
   "created_utc": 1690238396,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta23ar",
   "message": "Nobody knows anything for certain, thus there is always the possibility that something we don't believe will come true. What if we are in a simulation",
   "created_utc": 1690222261,
   "score": 6,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtab24n",
   "message": "\"Okay.\"\n\nLet people have their weird conspiracies if it isn't hurting anyone.",
   "created_utc": 1690225844,
   "score": 4,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta1e3r",
   "message": "\"That's somehow dumber than believing they were built by slaves\"",
   "created_utc": 1690221822,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta0uyh",
   "message": "The smaller blocks were hauled up there and the larger made with ancient concrete, there were no alien tools involved.",
   "created_utc": 1690221619,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta1e48",
   "message": "I only need 4 minutes of your life-time. watch this: [https://www.youtube.com/watch?v=dDgr4uvet-g\u0026amp;ab\\_channel=HISTORY](https://www.youtube.com/watch?v=dDgr4uvet-g\u0026amp;ab_channel=HISTORY) and watch more stuff from 101 history. It really could be.",
   "created_utc": 1690221822,
   "score": 3,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta5r1s",
   "message": "You have to go more crazy. The pyramids are where the stonemasons transmit images of the moon, because the moon isn't real. Also Jimmy Hoffa is buried there.",
   "created_utc": 1690223785,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtab4ap",
   "message": "My favorite Sagan quote \"Extraordinary claims require extraordinary evidence\"",
   "created_utc": 1690225867,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaehaj",
   "message": "Look inside yourself for answers. Do research and come to your own conclusion. \n\nThat is part of why they were created - to inspire awe, inquiry, and exploration.",
   "created_utc": 1690227168,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaa64p",
   "message": "I mean let’s not act like anyone actually knows anything.  There guess is as good as most theories I’m sure.  Love all the people saying they’re stupid though lol",
   "created_utc": 1690225503,
   "score": 0,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaeck8",
   "message": "Agree with them",
   "created_utc": 1690227118,
   "score": 1,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta41b1",
   "message": "That theory was pushed by some racist Brit who wrote *Chariots of the Gods*? because he couldn't believe that \"primitive\" people could have actually been that intelligent. Even though they were.",
   "created_utc": 1690223107,
   "score": 2,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtac02v",
   "message": "Realistically, the Egyptians probably just inhabited and tried to copy the pyramids, as the erosion around the sphinx suggests it could be over 40,000 years old. Every pyramid built in later Egyptian dynasties were never on par with The Great Pyramids of Giza, suggesting the knowledge was lost. So you could tell them, \"You could be onto something, but don't jump to aliens.\".",
   "created_utc": 1690226209,
   "score": 1,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtafszy",
   "message": "I believe they were built by humans.  What I don't really believe is the timeline of WHICH humans did it.  I'm not about to preach about Hancock because a lot of his views are problematic too but there are a lot of reasons to question the currently presented archeology.",
   "created_utc": 1690227678,
   "score": 1,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta1t5v",
   "message": "That’s all the aliens could come up with, a fucking triangle?",
   "created_utc": 1690222134,
   "score": 1,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta6hsa",
   "message": "They were built by a shitton of slaves, mortared with their blood, swear, tears and bones.",
   "created_utc": 1690224076,
   "score": 0,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta72t6",
   "message": "Pfft... You believe in the pyramids?",
   "created_utc": 1690224306,
   "score": 1,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtac003",
   "message": "\"I agree\"",
   "created_utc": 1690226208,
   "score": 1,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtb0gtj",
   "message": "Just for fun. How many people responding to this post laughing at such a person believe in Jesus? God? A creator?",
   "created_utc": 1690235677,
   "score": 1,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta5w6c",
   "message": "can someone explain how they were built by the tards of the past to me?",
   "created_utc": 1690223842,
   "score": 255,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtah0sr",
   "message": "These conspiracy theories are based on racism and antisemitism. Every time someone is said to have gotten help from aliens, it's always brown people getting the help. Europeans never had alien contact stories. The types of aliens helping them traditionally have always been depicted as nordic white folks, too, building on the \"White Savior\" narrative. \n\nRacists literally can't comprehend that nonwhite people could build things or have a civilization without someone with white skin helping them. they usually finish up by tying them to \"The Globalist Cabal\", which is their dogwhistle for 'Jews'.",
   "created_utc": 1690228146,
   "score": 253,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta16vq",
   "message": "Say them God bye and chill..",
   "created_utc": 1690221745,
   "score": 0,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jta8ki3",
   "message": "Ancient Astronaut theory says \"YES\".",
   "created_utc": 1690224882,
   "score": 0,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaag1a",
   "message": "Until someone explains how anyone using the tools at hand at the time to cut that stone with such precision and move them around and place them so perfectly then don't dare discount our little alien friends. 😁",
   "created_utc": 1690225609,
   "score": 0,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtabmlf",
   "message": "Yeah, And?",
   "created_utc": 1690226065,
   "score": 0,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtad72x",
   "message": "I walked away from a conversation like this one time I asked the guy what he thought about the Jews doing backbreaking labor as slaves. His response was that there is nothing written in the hieroglyphics that mention slaves so it didn't happen. There's also nothing that mentions aliens but he failed to see that part.",
   "created_utc": 1690226671,
   "score": 0,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtakq17",
   "message": "Let them think so but we know the truth",
   "created_utc": 1690229565,
   "score": 0,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtaq2ww",
   "message": "Of course they were.",
   "created_utc": 1690231601,
   "score": 0,
   "submission_id": "158hw8i"
  },
  {
   "comment_id": "jtahfha",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158hw8i"
  }
 ]
}