{
 "submission_id": "158ozm5",
 "title": "Guys, for what reasons would you have a 4 year sexual relationship with a woman but not want a relationship?",
 "selftext": "",
 "created_utc": 1690237013,
 "permalink": "/r/AskReddit/comments/158ozm5/guys_for_what_reasons_would_you_have_a_4_year/",
 "score": 107,
 "url": "https://www.reddit.com/r/AskReddit/comments/158ozm5/guys_for_what_reasons_would_you_have_a_4_year/",
 "comments": [
  {
   "comment_id": "jtb41hl",
   "message": "Just a guess here, but sex. For sex. Because the other person isn't asking for or demanding any kind of commitment, emotional or otherwise, for the sex.",
   "created_utc": 1690237155,
   "score": 57,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb41xj",
   "message": "Sexual relationships require less effort than committed romantic relationships.",
   "created_utc": 1690237160,
   "score": 97,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb5p75",
   "message": "FWBs is the only reason I can think of",
   "created_utc": 1690237854,
   "score": 121,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb8heq",
   "message": "She’s hot but boring.",
   "created_utc": 1690239049,
   "score": 33,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb7qcx",
   "message": "I'm not a guy but I think I can shed some light in this, sometimes you just don't feel that connection with someone, sexual desire is VERY different from emotional desire",
   "created_utc": 1690238726,
   "score": 83,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb5qtp",
   "message": "Sex is easy. Relationships are not.",
   "created_utc": 1690237873,
   "score": 235,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb77a8",
   "message": "I like sex but I also recognize that I was not in mental capacity to properly handle being in more than a casual relationship. Which was true for most of my life.",
   "created_utc": 1690238502,
   "score": 204,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb7g2x",
   "message": "I may be old, but if a relationship does not move on from being sexual, to something more after 3 months then it never will.",
   "created_utc": 1690238605,
   "score": 90,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb5ztx",
   "message": "For sex",
   "created_utc": 1690237981,
   "score": 97,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb5xzr",
   "message": "The sex was good and even though I didn't want anything long term with her, she was a safe friend and hookup. I could trust her not to be irresponsible or deceitful.",
   "created_utc": 1690237959,
   "score": 122,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbnhge",
   "message": "The answer is in your question grasshopper.",
   "created_utc": 1690245600,
   "score": 39,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbfjit",
   "message": "dat pussy",
   "created_utc": 1690242107,
   "score": 35,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb44nc",
   "message": "Mistress",
   "created_utc": 1690237193,
   "score": 148,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb80bn",
   "message": "Well for me, personally. I suffer from repetitive boner syndrome.  It's a rare condition where i would like to have sum sex. So ocassionally i meet i girl person and SHE would like to have sum sex. So when we're done i'll say,\"Hey, you wanna play xbox or watch fooseball?\"  And she will say \"No, you wanna go to brunch and pay 38 dollars for eggs and gossip with the girls?\"  and i will say \" I would LOVE to, but i promise myself i would stay home today and drive screws through my toes. lets just  get together tommorow and have sum sexy sex.\"  And she will say, \"Sounds great, i love having sexy sex\"  and that goes on for a couple years.",
   "created_utc": 1690238844,
   "score": 22,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb4oea",
   "message": "Maybe the sex is great but she's embarrassing to be with in public.",
   "created_utc": 1690237423,
   "score": 132,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbay9c",
   "message": "Because she was spectacular in bed but was as crazy as a loon.  A beautiful but deeply disturbed girl.",
   "created_utc": 1690240103,
   "score": 33,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbbvuo",
   "message": "For a no strings attached relationship.",
   "created_utc": 1690240509,
   "score": 34,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb7l5n",
   "message": "For.  The. Sex.",
   "created_utc": 1690238664,
   "score": 30,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbei8m",
   "message": "Simply because we had a conversation early enough in the relationship where our long term goals simply don't match, and we know our deal breakers in that regard won't change. So while searching for our forever-mates, a little fun sex on the side with a partner you know you have a good sexual relationship with isn't the worst thing in the world. As long as you both continue to feel the same way.",
   "created_utc": 1690241651,
   "score": 34,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbk8ox",
   "message": "For the sex?",
   "created_utc": 1690244160,
   "score": 14,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbe7ce",
   "message": "She crazy but the pussy is good",
   "created_utc": 1690241517,
   "score": 13,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbxz9p",
   "message": "Becuase you will rarely fuck a guy into a relationship.",
   "created_utc": 1690250458,
   "score": 34,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb41hs",
   "message": "Aromantic but not asexual.\n\nNot mature (or not feeling mature enough) for an actual relationship. \n\nGot out of a toxic relationship/marriage and has no desire to get back into one.",
   "created_utc": 1690237155,
   "score": 47,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb58vp",
   "message": "Free sex.",
   "created_utc": 1690237662,
   "score": 19,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb7xf0",
   "message": "100% Sex. I can't speak for allen, but sex for me is right up there with eating and sleeping.",
   "created_utc": 1690238809,
   "score": 26,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbn4k9",
   "message": "besides the other answers here, there's always the possibility that he's an asshole lmao",
   "created_utc": 1690245437,
   "score": 21,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbkc7k",
   "message": "Could be a bunch of different reasons. Don't want to put in that much work, or lose that much freedom, or whatever. Sex is fun, and while relationships can be very fulfilling and enjoyable, they're a challenge and take a lot of work. I'm a relationship kind of person, but I can easily empathize with someone who would want the enjoyment of sex without the ups and downs of a relationship. Even if it's monogamous sex.",
   "created_utc": 1690244201,
   "score": 7,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbkixa",
   "message": "I mean, you have a relationship. A sexual relationship.  That -is- a type of relationship.\n\nI assume that you mean the hetero and mono normative view of how a romantic/emotional relationship is meant to develop according to a very specific portion of cultural norms.\n\nThe answer is: Because he's just not that into you.\n\nMaybe he sees you as a friend, but not a life-partner.  Perhaps he's bi or ban and wants a relationship with a man as well. Maybe he's afraid to fuck things up and NOT have your fantastic sexual relationship anymore.\n\nWith just this much information, we're all just flinging things at the wall.  Relationships of all types, be they friendships, sexual in nature, or traditional mono-hetero-normative culture, are complicated. Much more complicated than just a one line question can ask about.",
   "created_utc": 1690244284,
   "score": 13,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtcajkg",
   "message": "It’s illegal to marry or date your sister",
   "created_utc": 1690256737,
   "score": 9,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbdiqh",
   "message": "You get the best part of a relationship without having to do all of the other stuff to maintain a relationship.",
   "created_utc": 1690241221,
   "score": 32,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbhkvi",
   "message": "Good in the bed\nBad in the head",
   "created_utc": 1690242999,
   "score": 12,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbltuw",
   "message": "Oh heck to the NO!! I will only let her ride the cactus if I have a strong enough bond with her that I can trust each other during lovemaking.",
   "created_utc": 1690244856,
   "score": 11,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbca2r",
   "message": "Because I want sex but I don't want to put up with her bs.",
   "created_utc": 1690240680,
   "score": 20,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbdwb0",
   "message": "because we enjoy sex. Are you really asking this?\n\nAlso, water is wet.",
   "created_utc": 1690241385,
   "score": 20,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbeo0b",
   "message": "Tbh, my actual relationship is looking a bit rocky at the moment. If things do go sideways and I end up single, the ONLY type of relationship I’ll ever have again will be FWB. I’m not risking the hurt again. Got my kids, I’ll prob have to get a new dog 😢 and that’s all I need. But I’m also 40 so it’s different than if I was 20 or even 30.",
   "created_utc": 1690241722,
   "score": 11,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbdylx",
   "message": "Fear of intimacy. Getting closer than that might just make him uncomfortable. And the closer, the more uncomfortable, Chinese finger trap style. This is sort of how I am. 40, unmarried, and I don’t want an SO because I treasure my independence, but sometimes it’s nice to have someone over for some intimacy… probably",
   "created_utc": 1690241413,
   "score": 10,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbas8z",
   "message": "Good head.",
   "created_utc": 1690240031,
   "score": 4,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbb8z6",
   "message": "cause thats what she wants",
   "created_utc": 1690240229,
   "score": 4,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbceie",
   "message": "Sex and relationships are two very different things, however they can go hand in hand.\n\nThis person values the sexual relationship the two of you share, but *assuming you actually asked about this* does not see you connecting on a more intimate non sexual wavelength.\n\nIf two people are sexually compatible but don’t have romantic comparability they can have an indefinite sexual relationship and be content, but that’s pretty rare. Again *assuming you actually asked about this*, if this person does not want more and you do? It’s time to move on.",
   "created_utc": 1690240734,
   "score": 5,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbho4h",
   "message": "I think for a lot of guys, the cons of seeking a real relationship outweighs the pros. Whether from past experiences, from the common societal expectation to “man up” and avoid emotion, or from the growing societal movement to put men down as gross and undeserving — it’s daunting and terrifying to pursue something real, and many guys just decide not to. \n\nThen, in large part because of the influence of porn and hookup culture, it is a million times easier to disassociate sex from emotional bonds now than it used to be. So sex very easily becomes 1) a distraction from the weight of broken relationships and 2) a form of intimacy with another person (although very broken), instead of being an avenue towards emotional growth. \n\nI’m not saying this is how every guy sees it, but from my personal experience, I know it’s true for some.",
   "created_utc": 1690243038,
   "score": 5,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbinai",
   "message": "UNATTACHED SEX IS NICE",
   "created_utc": 1690243472,
   "score": 3,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbpti4",
   "message": "Bored. Scared of commitment. Like the women as a girlfriend/companion but don't think she's wife material. Don't want to mingle finances. Simply like the relationship as is and are worried changing anything could ruin it. \n\nThere's a bunch of potential reasons, not all are nescessarily bad, but if the situation isn't working for you, talk about it. Or break it off. Or keep being unhappy with the situation. It's your life.",
   "created_utc": 1690246700,
   "score": 5,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtc5mcn",
   "message": "It's a sexual relationship, not every relationship has to be a romantic relationship\n\n\nRelationship is in the name Sexual Relationship",
   "created_utc": 1690254205,
   "score": 3,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtcl8yo",
   "message": "The woman isn’t wife material.",
   "created_utc": 1690263255,
   "score": 4,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb3x6x",
   "message": "Because he's not ready to settle down or he wants to keep his options open",
   "created_utc": 1690237105,
   "score": 11,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbfrla",
   "message": "Fear of commitment. In my mid 20's i would just be honest with women and say i don't want anything aside friendship and casual sex.\n\nI didn't think things thru tho..most of the time girls would want more, and i ended up hurting a lot of women. That i could've just dated, instead of being an asshole.\n\nPeople say, that it's not that bad because you are being honest from the beginning, but one person will eventually want more. I honestly regret that, as i thing i miss out on fun things that dating has aside from sex. \n\nOnly 1 women continues to be my friend, and she did confess she hated me for a while....",
   "created_utc": 1690242205,
   "score": 15,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbkrms",
   "message": "That might be the most \"girl\" question I've ever heard.",
   "created_utc": 1690244390,
   "score": 18,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbj7i7",
   "message": "To pound you and keep it pushing, why do you stay for 4 years? 🤣",
   "created_utc": 1690243715,
   "score": 7,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbmjsv",
   "message": "She exhibits qualities that lets me know she is for the stree- ....I mean, untrustworthy",
   "created_utc": 1690245176,
   "score": 7,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbpnog",
   "message": "OP must be a woman. The guy she’s asks about has told her with every action possible that sex is the reason.  He hasn’t pursued anything else yet she seems confused about his motives?  \n\nJFC ladies…men are simple.  If we don’t do something, it’s because we don’t want to. There isn’t anything deeper. There isn’t a game plan.  There isn’t even any thought behind it.",
   "created_utc": 1690246622,
   "score": 8,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbgl7y",
   "message": "You get a perk from a relationship without having to spend money on it. I mean it's pretty clear. You get sex without taking her out. You get sex without worrying if going out with friends will cause a fight. You get sex without being tied down. Sex without arguments, without having to go to family events, sex without keeping the relationship fresh. Gosh why did I get married lol",
   "created_utc": 1690242564,
   "score": 14,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb6k32",
   "message": "Smart financial reasons....",
   "created_utc": 1690238223,
   "score": 11,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb9qwr",
   "message": "Because I want to have sex but I don’t want to be obligated to her or share a home with her.",
   "created_utc": 1690239585,
   "score": 9,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbibuc",
   "message": "I don't really like her  but enjoy the sex.",
   "created_utc": 1690243331,
   "score": 5,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb3v55",
   "message": "Cousin?",
   "created_utc": 1690237082,
   "score": 12,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbgdtl",
   "message": "If we’re friends who just like to fuck sometimes. I’ve had a few like that, some of whom I’d count as best friends",
   "created_utc": 1690242475,
   "score": 3,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbkkt4",
   "message": "They just aren't that into you. Just because you like someone enough to have sex with them doesn't mean you want to commit to them",
   "created_utc": 1690244308,
   "score": 4,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbmeb3",
   "message": "If she's only asking for sex, without other investments (commitment, \"naming\" the relationship, attachment, etc), then she gets 4 years of just sex.",
   "created_utc": 1690245108,
   "score": 3,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbr7h8",
   "message": "The crazy hot matrix",
   "created_utc": 1690247337,
   "score": 3,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtc5wdd",
   "message": "Good sex but she’s not the whole package. Likely lacking in a few other areas",
   "created_utc": 1690254346,
   "score": 3,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtcqdvi",
   "message": "OP asking for a friend",
   "created_utc": 1690266994,
   "score": 3,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbaugb",
   "message": "Sounds semi-autobiographical based on the specificity",
   "created_utc": 1690240057,
   "score": 4,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbjbgo",
   "message": "There was a time in my life when I was emotionally dead. I couldn’t have had a relationship even if I tried. So, there’s one reason",
   "created_utc": 1690243761,
   "score": 6,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb9gsx",
   "message": "I cannot conceive of a possible reason I would do that",
   "created_utc": 1690239466,
   "score": 5,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbpv7h",
   "message": "It's awesome when you can find someone that you are sexually and intellectually compatible with all in the same person. I've yet to find a partner that gives me both.",
   "created_utc": 1690246722,
   "score": 5,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb42rh",
   "message": "Never commit to a girl if she's as crazy in the streets as she is in the sheets.",
   "created_utc": 1690237170,
   "score": 7,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtb8v8h",
   "message": "Not looking for anything serious.",
   "created_utc": 1690239212,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbcl9j",
   "message": "Your question answers itself.",
   "created_utc": 1690240820,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbczb3",
   "message": "I see the sex long term not the person.....\n\nAlso men doing almost everything with the end goal in mind of securing a mate for what should be life.  AKA consistent coochie \n\nBeing able to consistently get it without having to commit is a win win. \n\nThe person also may not be somebody that I would see as the mother of my child. She can be my fantasy in the bedroom all she wants though.",
   "created_utc": 1690240988,
   "score": 3,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbczdu",
   "message": "Roommates. The ability to tap that when convenient and home together, without needing to be involved in each other's life.",
   "created_utc": 1690240989,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbdybi",
   "message": "The sex.",
   "created_utc": 1690241409,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbh2xv",
   "message": "Whats the frequency of sex?",
   "created_utc": 1690242778,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbh4xe",
   "message": "She’s for the streets",
   "created_utc": 1690242803,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbhu06",
   "message": "A complete lack of trust. You need almost no trust in a transactional sexual relationship. We meet, we do the thing, we check out. Can’t be disappointed in someone you have zero expectations of.",
   "created_utc": 1690243111,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbiitd",
   "message": "Well let’s see, the only real benefit with none of the drawbacks. Yeah idk why anyone in their right mind would want that. 😅",
   "created_utc": 1690243416,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbixbg",
   "message": "I personally couldn't, and this is just me, but sex has to have an emotional component for me to not feel guilty. My favorite parts of being intimate is the connection and interaction leading up to the act and the bonding that happens post act. I know many don't think of sex this way and that is good too. Sexual boundaries are complex and it's ok for them to vary person to person.",
   "created_utc": 1690243594,
   "score": 4,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbknp3",
   "message": "The reason they want a sexual relationship but not a romantic one is probably because they don't want a romantic relationship.",
   "created_utc": 1690244343,
   "score": 3,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbl12m",
   "message": "Convenience vs commitment",
   "created_utc": 1690244503,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtblkv7",
   "message": "She is cute and fun in bed but has unattractive qualities in most other parts of her life.",
   "created_utc": 1690244745,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbmgt9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbmhjd",
   "message": "No sense in buying the cow when you’re getting the milk for free.",
   "created_utc": 1690245149,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbmxly",
   "message": "Sex is usually fun. Relationships can sometimes end up not being fun. It's an odds thing. Higher chance of fun.",
   "created_utc": 1690245351,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbptk1",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbq5zi",
   "message": "Because the guy in question doesn't want the responsibility of a relationship but is not going to say no to free sex.",
   "created_utc": 1690246868,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbr2g4",
   "message": "I mean, if people are friends with benefits for 4 years, they have no *desire* to become more than friends because clearly that's working out for them.",
   "created_utc": 1690247277,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbr9cl",
   "message": "Because you think you can do better for your long term partner, but she keeps giving you sex without requiring a firm commitment, so why not just enjoy the situation you're in?",
   "created_utc": 1690247360,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbrlyt",
   "message": "For the sexual reasons",
   "created_utc": 1690247515,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbro2p",
   "message": "Sex",
   "created_utc": 1690247540,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtburus",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbleh4",
   "message": "I wouldn't. If I'm still so attracted to someone to still want to have sex with regularly after 4 years, she'd have earned that label.",
   "created_utc": 1690244667,
   "score": 2,
   "submission_id": "158ozm5"
  },
  {
   "comment_id": "jtbk2w7",
   "message": "Without trying to sound harsh, some women are fucking material, and some women are dating material. Who falls into which category obviously depends on the guy you’re asking, but I would imagine a lot of us have had sex with someone without any intentions of dating. If the guy is keeping the woman around for sex while leading her to believe they could start a relationship, that guy would be a dick.\n\nEdit before all the Redditors call me a sexist incel: Some men are fucking material, some men are dating material.",
   "created_utc": 1690244092,
   "score": 6,
   "submission_id": "158ozm5"
  }
 ]
}