{
 "submission_id": "159bgl9",
 "title": "What is the dumbest way you've gotten a scar?",
 "selftext": "",
 "created_utc": 1690298374,
 "permalink": "/r/AskReddit/comments/159bgl9/what_is_the_dumbest_way_youve_gotten_a_scar/",
 "score": 177,
 "url": "https://www.reddit.com/r/AskReddit/comments/159bgl9/what_is_the_dumbest_way_youve_gotten_a_scar/",
 "comments": [
  {
   "comment_id": "jte7t7f",
   "message": "I have one on the back of my hand from rubbing the skin off with a pencil eraser longer than the other kid did when I was 13 just to prove I was \"tough\"",
   "created_utc": 1690298469,
   "score": 172,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jte7yww",
   "message": "For my 8th birthday, a classmate got me something like a \"grow your own stalagmite\" kit you could buy at educational stores. Apparently, the purpose was to add water to some powder material, and use a funnel in the kit to drip it down to make your own cave features. Exciting, I know.\n\nAnyway, I kept it and the other birthday presents I got in a cardboard box in my room. Evidently, at some point, moisture got into the box and the plastic the powder was in, and it began expanding. Having nowhere else to go, the \"stalagmite\" material oozed its way out through the narrow slits in its box, and hardened into razor sharp edges. I found this out quite bloodily when I put my hand into my birthday box to grab another toy, and pulled it out with permanently altered fingerprints on my thumb, index, and middle fingers.",
   "created_utc": 1690298530,
   "score": 105,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jte7un6",
   "message": "My brother, sister and I all have the same kind of scar in our left eyebrow and got them at the same age. My brother opened an empty dresser drawer and smacked himself in the face, my sister ran into a brick wall and I fell off the couch onto a coffee table.",
   "created_utc": 1690298484,
   "score": 110,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jte7knm",
   "message": "Don’t touch the iron it’s hot!\n\nCan’t be that hot!\n\nNarrator: It was.",
   "created_utc": 1690298380,
   "score": 82,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteeft3",
   "message": "In high school I ended up at a house party at Miss Teen New Jersey’s house. We did not know Miss Teen New Jersey, but she did say we could help ourselves to fridge beer. Opened the fridge and there was one beer left, a wheat beer forgotten in the vegetable drawer. I grabbed it and when pulling it out caught the back of my hand on something sharp on the underside of the shelf and it shot blood EVERYWHERE. Like a shocking amount, on the fridge and the food and the floor. \n\nI was desperately trying to clean it up when my buddy comes in looking like he’d seen a ghost and pulled me into the bathroom, where he’d taken a huge dump, which clogged the toilet. He then saw the bloody rag on my hand and got immediately sick, puking in the sink, which also clogged. \n\nThis was the nineties and I still have the scar on my hand. \n\nI have no memory of how well we managed to fix any of these problems, but yeah we never got to go back to Miss Teen New Jersey’s house.\n\nEDIT: made the timeframe more vague out of respect for the easily identifiable former Miss Teen New Jersey",
   "created_utc": 1690300988,
   "score": 128,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jte7pxo",
   "message": "I used a pressure washer on my foot",
   "created_utc": 1690298435,
   "score": 253,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jte7n5y",
   "message": "I have a scar on my forearm from a weaponized paper airplane I taped razor blades to and launched with a rubber band.\n\nSadly, this happened when I was 22, in the Air Force as a 3D0X2. It sliced my forearm open on launch. I enlisted the help of another member of our shop to help me destroy the evidence and drive me to the base hospital to get stitches.",
   "created_utc": 1690298406,
   "score": 156,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteelr2",
   "message": "I twisted the head off of my little sister's baby doll.\n\nshe hit me in the head with a garden hoe\n\n\n11 stitches.",
   "created_utc": 1690301049,
   "score": 3,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jted3bu",
   "message": "This is so stupid but In highschool a friend of mine would scar my skin (edit: I let her \"draw\" on me) with a pencil so now every time I get a tan there's just a scar of a star, smiley face, and cat head that shows up and it's so stupid",
   "created_utc": 1690300476,
   "score": 143,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtein4q",
   "message": "In fifth grade I asked a girl to be my girlfriend. She said no. I turned around and fell down a hill and slashed my ankle open on a rock. I have a lifelong scar to remind me of the rejection.",
   "created_utc": 1690302574,
   "score": 202,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtedftp",
   "message": "When I was 4 I got too excited to go outside, and ran through a storm door.  Ripped my arm up good and required a bunch of stitches.  Due to the position there was no way for them to numb it, so they stitched it without anything.  Two days later, I was helping my mom make cookies, I tripped and ripped it all over again.  30+ years later and I now have a scar on my left arm that looks like a bite mark.  \n\n\nI have another on my wrist because I once stuck my hand up a gumball machine, trying to steal a gumball, and it got stuck.  When I finally got it out, it ripped the skin off a chunk of my wrist.",
   "created_utc": 1690300607,
   "score": 103,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteeeiu",
   "message": "An old roommate and I got drunk and had a snowball fight but with beer bottles",
   "created_utc": 1690300974,
   "score": 156,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jte8gwx",
   "message": "I was removing mould from paving stones with a high pressure cleaner.., I guess I had a “moment” when I wondered if it would remove the skin from my foot…",
   "created_utc": 1690298720,
   "score": 246,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteeq68",
   "message": "Tripped over my kitten and busted my head open on my sofa...",
   "created_utc": 1690301096,
   "score": 124,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteb8kc",
   "message": "I was sitting on the back two legs of my chair, I lost balance, fell backward and went through a window. Shards of glass rained on me and one sliced my eyebrow in half",
   "created_utc": 1690299775,
   "score": 131,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteirbn",
   "message": "Using a knife as a flathead screwdriver.....",
   "created_utc": 1690302618,
   "score": 30,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtea0ad",
   "message": "I got a glass bowl full of ice cream, stumbled and didn't let go of the bowl, so it cut open my hand. It's a common reflex of small children, because icecream \"is precious\", but still stupid, because I had to wear a bandage for 2 weeks.",
   "created_utc": 1690299308,
   "score": 45,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jte8ir1",
   "message": "I have a lot of scars from stupid shit. But my stupidest one was from a pair of CLOSED scissors. I got into my bed (don't ask why there was a pair of scissors in there) and leaned very hard on a pair of scissors with me knee. I don't even know how I cut myself with closed scissors wtf.",
   "created_utc": 1690298739,
   "score": 139,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteeqz5",
   "message": "Parents warned me not to tip my chair at the dinner table when I was a kid, I said \"It's okay as long as I don't tip it too far\" then I immediately tipped it too far and split my head open on the corner of the stove. Got a lightning bolt scar to the right of my eye and became diet harry potter over night.\n\nEDIT: Sentence was structured weird.",
   "created_utc": 1690301105,
   "score": 219,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jte8s2s",
   "message": "I’ve got a few dumb ones. \n\nBig scar across my upper thigh because I jumped out of a tall tree (after specifically being told not to) and got cut up by what was left of a bough that had recently been cut on the way down.\n\nScar on my knee because I fell off a waterfall when I swam too close to the edge (again, after specifically being told not to) and got cut up by a sharp rock on the way down.\n\nScar running through my eyebrow because I fell out of bed (this one I didn’t do anything specifically dumb but the fall was so short and insignificant that it feels dumb)\n\nScar on my arm because I willingly let a friend tase me with a shitty little taser she bought from some camping store, and it burnt my skin (this was like two weeks ago)",
   "created_utc": 1690298837,
   "score": 241,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtefotc",
   "message": "Pop tart. Wild berry flavor. Permanent burn scars on my leg. I was young and dumb. Toasting my pop tart. When I pulled it out the frosting was so hot it was literally bubbling. I dropped it because it was burning my finger tips. Dropped it right onto my leg frosting side down. I went to wipe it away, and my skin wiped away with it. Gave me almost third degree burns. Had to go straight to the hospital. Still have the scars 20 years later.",
   "created_utc": 1690301461,
   "score": 92,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteeg65",
   "message": "Testing the sharpness of a knife.",
   "created_utc": 1690300991,
   "score": 117,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteev5o",
   "message": "I have a scar on my finger from when I was 6.  My friend was spinning me in a chair and I put my legs out to kick him because I thought it would be funny.  My leg caught a sewing machine cord and my hand got caught between a sewing machine and a table.  I must have caught the needle because it was a deep cut.  Luckily, my friend's mom was a nurse and was able to help.\n\nI have a scar in my other hand from when I was using a screwdriver to try to get a grommet into a motorcycle gas tank.  It slipped and I stabbed my hand pretty bad.  All I could think of was my middle school shop teacher giving us a lecture on only using tools for their intended purpose.  Sorry, Mr. White.",
   "created_utc": 1690301149,
   "score": 151,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteej89",
   "message": "Oh boy, my favorite scar story! \n\nI was in 4th grade. We had camping chairs to watch TV in because our TV room was upstairs \u0026amp; we couldn't fit a sofa up the stairway. The camping chairs were like recliners with footrests attached by straps.\n\nWe had had these chairs for months, but one day I suddenly blanked on how to get out without tripping. I stood in the chair and surveyed my surroundings. The door to the stairs was open.\n\nI decided the best course of action would be to try to jump out of the chair over the armrest, *toward the open door.* \n\nAs you may have guessed, my foot got caught, I took the whole chair down with me, and landed face-first on the vertical edge of the open door. I busted my lower lip on the door and on my teeth (but not all the way through), and now I have a scar that you can see whenever I smile.",
   "created_utc": 1690301023,
   "score": 90,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteetwc",
   "message": "Just last weekend I cut my forehead pretty decently. Had an epileptic seizure and smashed my head on...something in the bathroom. The ambulance guys insisted we go get some stitches. It'll leave a scar, no doubt. And the doctor who stitched me up was not impressed and referred my dumb ass to a neurologist because I am not taking my meds correctly. If I took my medicine like I'm supposed to this whole mess could have been avoided.\n\nBut no, I'm a dumbass.",
   "created_utc": 1690301136,
   "score": 121,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtebi4r",
   "message": "High school ceramics teacher: don’t touch that, it’s sharp.\n\nMe, 20 seconds later: oops, I need a bandaid.\n\nNurse, 3 minutes later: sit down! Let me call your mom, that bandaid isn’t going to cut it. You definitely need stitches.\n\n😂",
   "created_utc": 1690299877,
   "score": 122,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtef0xb",
   "message": "I thought having a scar will look cool, so I gave myself one.",
   "created_utc": 1690301210,
   "score": 62,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteekv0",
   "message": "Kid in the church nursery hit me in the eye with a plastic carrot. It was 40 years ago. I’ve still got a scar.",
   "created_utc": 1690301041,
   "score": 92,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteguzp",
   "message": "Subway sandwich burn.\n\n I was a sandwich \"artist\" and my coworker was taking a sandwich out of the oven and the cheese grazed my arm and took a piece of skin with it. I had a big blister that turned into a scar. Someone ate my arm skin for lunch. Absolutely horrible. I was in so much pain I ran to the back to scream. I didn't have a sec to tell my coworker to throw it out he was moving too fast to notice. Disaster D:",
   "created_utc": 1690301906,
   "score": 75,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtee4o4",
   "message": "I was maybe 13 or 14. I was tossing a can of wasp spray in the air and catching it. Well I guess I just decided I wasn’t going to catch it, cuz the rim of it struck my eyebrow, gashed open my eyebrow, bled like a stuck pig, and indented my eye socket…nice little scar now but damn was that stupid",
   "created_utc": 1690300869,
   "score": 51,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteev9n",
   "message": "I have a scar just under my lip - perfect spot, as you can’t even see it. \n\nI was 6 years old, and it was early June, so the weather was nice and warm. We had gym class right after lunch, and we went to the baseball diamond to play T-ball. \n\nI was sitting with some friends, and this boy kept pestering me, so I got up to make him stop. He started running away, so I chased after him. He ran out onto the diamond, passing the boy at bat. By the time I reached the batter, he had taken his swing, and the bat collided with my lower lip. I had four adult teeth at that time, and they were all four of my front teeth. \nMy top two teeth were both chipped in half, while my bottom two cut through my lower lip, and become lost amongst the gravel in the baseball diamond. \n\nI was terrified, I remember asking the teacher if I was going to die. I had braces in high school, and when I was 25 (32 now) I had a dental implant for my bottom teeth. My top two were fixed when I was a child. \n\nLooking back, I never should have run onto the diamond after that kid, and I wish I could take it all back, as 25 years later I’m still dealing with the ramifications of that dumb decision. But I was 6, so I try to cut myself a break.",
   "created_utc": 1690301150,
   "score": 47,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jte83tl",
   "message": "Ran into my uncle’s cigarette butt when I was a kid. Snuffed it out with my forehead.",
   "created_utc": 1690298581,
   "score": 51,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jte8fl5",
   "message": "Silly childhood accidents, got a scar sliding down wood stairs, memories!",
   "created_utc": 1690298706,
   "score": 36,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtekkgr",
   "message": "Fell from a pool shed and landed ass first on the tip of a wrought iron fence.\n\nA friend was on a pool shed roof, and I wanted up there as well. I started climbing up and reached up to have him help pull me up. My hand slipped and I fell backwards landing on the sharp tip of the wrought iron fence that surrounded the pool. Still grateful that I wasn’t paralyzed or worse. Literally best case scenario was the small dent in my ass cheek that currently exists",
   "created_utc": 1690303294,
   "score": 25,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtee6hc",
   "message": "not a scar on me, but a scar i accidentally gave my dad: \n\nthe local kroger my family would go to would have their halloween stuff out around that time each year.  the aisle that held the holiday/toy/other exciting things was called 'the fun aisle' in my family, and it was always the last aisle we would go in before checking out.  \n\none year when i was probably around 5 to 7 years old i was playing around with a plastic toy devil pitchfork thing from some halloween costume, and i was pretending to fight my dad with it since he would always play fight with us, and i guess i accidentally scratched his arm too hard and it started bleeding.  \n\nof course i was a little kid and felt terrible about it but my dad has a pretty high pain tolerance and loves showing off his wounds to everyone so he wasn't even upset.  even to this day though, he still has a scar from that scratch on his arm which i think is super funny since it wasn't even a sharp object or anything 😂",
   "created_utc": 1690300888,
   "score": 34,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jted65z",
   "message": "Tried balance walking on a log laying flat on gravel. Tripped and got 13 stitches.",
   "created_utc": 1690300506,
   "score": 22,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtedtvb",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtee1gd",
   "message": "I have \"mirrored\" scars on my chin. When I was 2 I fell off a teeter-totter and put my bottom teeth through my lip/upper chin. Less than a year later I fell off a jungle gym and the same exact thing happened. 29 now and they're still clear as day. \n\nBonus points: when I was 8 I fell and split my lip an inch down in 2 places so those scars are added to the mix too.",
   "created_utc": 1690300834,
   "score": 33,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtek0zr",
   "message": "I blew a raspberry on my cats belly and she scratched a three inch scar into my eyebrow.   \n….hindsight",
   "created_utc": 1690303093,
   "score": 153,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteubpr",
   "message": "I remember the exact day.\n\nTuesday, November 7, 2000. US Election day.\n\nMy sister and I were getting ready to go vote for the first time and deposit my check. She was downstairs in the bathroom getting ready, and I was upstairs in my room. The bathroom door was right next to the stairs. As I was coming down the stairs, it sounded like she was coming out of the bathroom.\n\nNow, I've done this many, many times. Every time it was funny. I'd 'jump' down the last few steps, ducking my head under the 'door' frame at the bottom of the stairs, land in front of her as she was coming out of her room or the bathroom and scare her. Like I said, many times, always funny.\n\nBut this time, I didn't duck nearly enough. I hit my head on the top edge of the door frame. My head stopped, my feet didn't. I spun around and landed on my stomach/arm, on the stairs, facing 180° from my original position.\n\nMy sister then came out of the bathroom and asked what happened, as I'm laying on my stomach, holding my head, thinking I broke my arm (again). I told her I fell, and I thought my arm was broken. She asked to see it, and as I got up, I realized I was now laying in a pool of blood on the steps/carpet. Ran into the bathroom and put my head under the bath tub faucet while my sister went and called our parents.\n\nWent to the hospital, had a concussion, got 12 stitches and now have a 4\" long scar on top of my head. Still got to vote (just a lot later than expected) and got my paycheck deposited. \n\nI did scare my sister, and *now* it's funny.\n\nMission failed successfully.",
   "created_utc": 1690306945,
   "score": 120,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jte7wwn",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtebu79",
   "message": "Trying to fix a faucet.",
   "created_utc": 1690300004,
   "score": 9,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtee85z",
   "message": "I have an inch long scar on the inside of my thumb. I got it by pulling away from a chain link fence.\n\n I was walking along the bleachers at a football game, and turned to watch. I put my hands on the fence in front of me, but then I noticed a man with a camera directly in front of me. He moved the camera away from his face, giving me a displeased look. I then jumped out of the way, catching my thumb on the fence.",
   "created_utc": 1690300906,
   "score": 16,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtef2gk",
   "message": "Coin toss between toddler me dropping a curling iron on my foot, and post-college me trying to feel for a vacuuming airflow in a running wide-belt sander. I’ve got plenty other scars which have much less mindless causes to boot.",
   "created_utc": 1690301226,
   "score": 16,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtef2ia",
   "message": "I have a dot of graphite in the middle of my left palm.\n\nI had this overly sharpend pencil and wanted to drop it into a pencil holder that was on the ground.\n\nIdk what happend but for some reason my knee jerked and it launched my hand that was holding the pencil straight into my other hand. Idk why my other hand was above it anyway but it went right into my hand.",
   "created_utc": 1690301226,
   "score": 24,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtefekl",
   "message": "Trying to get out of a go-kart and using my arm to lift myself up…on the engine.",
   "created_utc": 1690301353,
   "score": 14,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteflvl",
   "message": "I have a scar on my pinky and wrist from dropping a fishbowl in 4th grade (don't worry the fish wasn't in it) Honestly I have no idea how I managed to cut up my hand lol but now the scar on my wrist looks like Africa and I refuse to wear anything over it because I like it 😂",
   "created_utc": 1690301430,
   "score": 22,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtefum9",
   "message": "I have two\n\nI have a big gash on my arm because i had an amethyst (gift) in my bed that apparently had a broken edge and was razor sharp.  I dove into bed and cut it so deep I saw tendons and it was so sharp it didn't even hurt at first.\n\nI also have a scar on my forehead from accidentally slamming the hatch of my mom's PT Cruiser on it",
   "created_utc": 1690301522,
   "score": 20,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtefutp",
   "message": "i was headbanging my hair dry in the bathroom, I hit the counter. I was 8.",
   "created_utc": 1690301524,
   "score": 59,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtefv9z",
   "message": "I was in home economics class in seventh grade and wasn't paying attention to the position of my hand while sewing. Punched right through my finger. It didn't hurt at first so I spun the wheel to raise the needle. It went lower so I panicked and ripped my finger out. Spent the rest of the day in the ER with the needle sticking through my finger.",
   "created_utc": 1690301528,
   "score": 35,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtefyzw",
   "message": "I drunkenly stuck my finger in a wire egg beater and turned it on.\n\nThe wire spun round round threading itself through my finger. Panicked, I began pulling. Only once I calmed myself did I unthread it. Scars are still there 35 years later.",
   "created_utc": 1690301568,
   "score": 32,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteg4e5",
   "message": "I put mosquito spray on my arm and tried to light it on fire then quickly *slap* my arm to put it out. \n\nWell… I was maybe .002 milliseconds too slow with that slap, so I had a nice burn on me, and even worse when I did slap I didn’t get it all… so in the end there was a sorta “C” shaped burn from the spot still on fire. \n\nDumb shit",
   "created_utc": 1690301626,
   "score": 25,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtegco9",
   "message": "I hit myself in the face with a tennis racquet.\n\nThe ball went over my left shoulder, and I tried to hit it with the racquet in my right hand. I missed.\n\nI gashed my lower lip, which bled copiously. The two other people on the court fell to the ground laughing …\n\nI guess it was pretty funny, except that I was in high school and played trombone at the time. Not good.",
   "created_utc": 1690301712,
   "score": 29,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtegoo6",
   "message": "peed on an electric fence",
   "created_utc": 1690301839,
   "score": 16,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtegrf5",
   "message": "Please don't laugh at me, when I was a kid I wanted to plug a small circuit LED bulb directly into the power outlet and see what would happen. So I waited until my father went to work and did it. Suddenly it exploded and I was electrocuted. I fell and hit my head and got injured. I didn't tell anyone that I was electrocuted because I was ashamed. I said that I slipped and fell and was injured  :v",
   "created_utc": 1690301867,
   "score": 28,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtelt84",
   "message": "I nearly cut the tip of my index finger off in high school when I attempted to open a stubborn package of gummy bears with a serrated knife. The blood pretty much exploded out of my fingertip, splattering across our ceiling like a geyser lol. Luckily it was “still hanging on” when I got to the hospital so I was able to keep it. I still don’t have any feeling in my fingertip, above my Frankenstein-esque scar. Let this be a lesson to those other impatient gummy bear lovers, always use scissors!",
   "created_utc": 1690303758,
   "score": 17,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtely85",
   "message": "A couple of dumb scars came from my fascination with the Medieval era as a dumb kid in the 1980s/1990s. \n\nI have a small scar on my forehead from sword fighting with broom handles that the broom heads had been removed from. Turns out the metal threads cut pretty well when swung at your skull.\n\nThe dumbest scar, however, came from jousting on bikes. We started with baseball bats, and it’s a wonder no one broke a rib, but we progressed to tree branches since the bats didn’t give you much reach. I have a nice scar on my right shoulder where a branch pierced through and stopped just beneath my collar bone. My friend has a nice scar where my branch tore away a hunk of flesh along his rib cage.\n\nTurns out that armor is important.",
   "created_utc": 1690303810,
   "score": 37,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteecg5",
   "message": "Self harm",
   "created_utc": 1690300951,
   "score": 8,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtedkk7",
   "message": "Rode bike down massive hill without a helmet, hit pavement with my head. Somehow no severe long lasting damage.",
   "created_utc": 1690300658,
   "score": 3,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtef115",
   "message": "Not me but my younger brother (7) had a brick thrown at his face by my youngest brother (4). There was no reason behind this and now my younger brother has a scar right above his eye.",
   "created_utc": 1690301211,
   "score": 6,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtefzff",
   "message": "I was in middle school and we were going to see coach carter in theaters with the boys b-ball team. Middle school me was PUMPED. While in the shower I thought “Coach Carter eh, I bet they do push ups in that movie. Imma do push ups right now” Tried to do a wall push up. Slipped, smacked my face on the edge of the tub, and split my upper lip open from mouth to nose. Needless to say, did not make it to the movie.",
   "created_utc": 1690301572,
   "score": 16,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteg79s",
   "message": "I snapped a golf club on the back of my neck.\n\nFuckin' hate golf.",
   "created_utc": 1690301656,
   "score": 11,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtegkez",
   "message": "My mom sliced my ankle, open by swinging a lamp with no shade on at me like a bat. She was drunkenly trying to hit my stepdad.",
   "created_utc": 1690301794,
   "score": 4,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jteiihr",
   "message": "Still have a faint line on my finger, from a 1993 incident where I cut myself with a frozen turkey leg at Walt Disney World.",
   "created_utc": 1690302525,
   "score": 4,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtel35r",
   "message": "- Is that hot?  Yes it was on the stove.\n\n- Is that glass sharp?  Yes\n\n- If I put my hand in the door my brother can't slam it.",
   "created_utc": 1690303488,
   "score": 14,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtema75",
   "message": "Being Roman Catholic and having a circumcision, kinda blasphemous stepping over the Lords perfectionism. Pretty stupid not having a choice.",
   "created_utc": 1690303933,
   "score": 4,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtf1pns",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtf1qqq",
   "message": "I scaled a chain link fence to take a short cut to Taco Bell. I sliced the base of my thumb and wrist and was bleeding badly. I asked for napkins and bandaids when I got there then ordered a Double Decker Taco. I miss those things. Every time I see my scar I think of them..",
   "created_utc": 1690309706,
   "score": 4,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtf5a8j",
   "message": "Remember that meme where a guy on a bicycle poke a stick through his wheelie and fall down by himself\n\nYep\n\nTurns out I did have the same idea as him",
   "created_utc": 1690311050,
   "score": 15,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtf5cd6",
   "message": " I am the reason ropes are no longer used to stop people from entering a grocery store register lane. \n\nWhen I was 15, I was a bag boy at Publix. During a Friday night rush, as I bagged some lady’s groceries I noticed her bag of frozen peas had opened. My manager told me to run to get a new bag for her. \n\nOn the way back, being the ultimate bad ass that I thought I was, I hurdled over the rope blocking the register lane next to us. Unfortunately only one of my two feet made it over and I proceeded to face plant onto the floor, in front of what felt like a hundred shoppers. \n\nI also busted the bag of frozen peas so it was a double loss. 8 stitches to my chin later, I gave up on track and field while at work and the ropes came down later that year",
   "created_utc": 1690311073,
   "score": 17,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtefrs8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159bgl9"
  },
  {
   "comment_id": "jtehx0z",
   "message": "Marshmallow fluff. I cut my hand on marshmallow fluff. \n\nWhen I was a kid I thought I'd be a He-Man and open my own jar of marshmallow fluff for my peanut butter \u0026amp; fluff sandwich. Previous sandwich assembly had left fluff to harden around the edge of the jar. Where lid meets fluff, fluff gets thin and hard. One big grunt and twist and... OH GOD WHY IS MY HAND BLEEDING? 40 years later and there's still a scar along my palm.",
   "created_utc": 1690302301,
   "score": 13,
   "submission_id": "159bgl9"
  }
 ]
}