{
 "submission_id": "159hs54",
 "title": "Whats the worst thing you can say to someone at a funeral?",
 "selftext": "",
 "created_utc": 1690312111,
 "permalink": "/r/AskReddit/comments/159hs54/whats_the_worst_thing_you_can_say_to_someone_at_a/",
 "score": 226,
 "url": "https://www.reddit.com/r/AskReddit/comments/159hs54/whats_the_worst_thing_you_can_say_to_someone_at_a/",
 "comments": [
  {
   "comment_id": "jtfda2p",
   "message": "My grandmother died in 1978. At my grandfather's funeral in 2012, someone leaned into my dad and whispered \"you're an orphan now\"",
   "created_utc": 1690314063,
   "score": 197,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtf8gho",
   "message": "'Bout time.",
   "created_utc": 1690312248,
   "score": 38,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfdft6",
   "message": "Who's dick do I have to suck to get a drink around here?",
   "created_utc": 1690314122,
   "score": 133,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfavpr",
   "message": "\"It should have been you\" In fact my cousin is dying of cancer and my other cousin actually said this to me. \n\nI was born with a heart condition so I guess I should be dying not my cousin.\n\nI just walked away",
   "created_utc": 1690313168,
   "score": 1,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfherb",
   "message": "So, now that you are single...",
   "created_utc": 1690315586,
   "score": 234,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfqaqi",
   "message": "When my 3 month old son died of SIDS; a lady came up to me and said “At least you are young enough to have other children”.",
   "created_utc": 1690318930,
   "score": 99,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfecr1",
   "message": "Guys before this funeral starts let's all thank today's sponsor, Raid: Shadow Legends.",
   "created_utc": 1690314461,
   "score": 9,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfguvo",
   "message": "I’m sorry for your loss. Move on.",
   "created_utc": 1690315381,
   "score": 57,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfxhxt",
   "message": "Not the funeral, but during the planning of my dads. He wasnt a church goer but would attend family functions and find a way to slip out during services. When we were discussing his church service, I said for it not to be too long else he'll be getting out the coffin and waiting outside till it was over. Definitely too soon for that comment.",
   "created_utc": 1690322197,
   "score": 206,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtf8ibl",
   "message": "Well, now I’m never get that $20 back.",
   "created_utc": 1690312267,
   "score": 51,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfmvlj",
   "message": "I was struggling with infertility for years. When my dad died my stepsister said \"I bet you feel so bad that you never gave him any grandkids.\"\nI will remember that for as long as I live. I've never felt worse or lower in my life.",
   "created_utc": 1690317594,
   "score": 28,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfo6da",
   "message": "WeLcOmE tO mY uNbOxInG vIdEo",
   "created_utc": 1690318066,
   "score": 70,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfa48v",
   "message": "All the old people poking me at weddings saying _you’re next_ … I’ve started doing the same to them at funerals",
   "created_utc": 1690312883,
   "score": 156,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtg25a0",
   "message": "Not the worst thing that could be said, maybe, but the funniest and most absurd funeral experience I've ever had. \n\nMy grandmother passed away a few years ago. Her family had a long history in a particular California mountain town, and she wanted her remains interred there with her ancestors. Problem was, the only cemetery in town was full. \n\nGrandma was cremated, and my mom began the process of tracking down some distant family members so we could get permission to inter grandma's cremains in one of the existing family graves.\n\nThis took a few months, but finally a 2nd cousin approved the use of grandma's great aunt's plot for this purpose. So we all make plans to head out to California and put grandma to rest. \n\nMy wife and I arrive in this small town in the Sierra Nevada foothills and head to the local church where a small funerary ceremony will be held before the interment. Once inside, my aunt asks me if I'll play some music she has cued up on YouTube on her iPad when I'm given the signal. Of course I'm happy to handle it. \n\nCeremony starts, and my aunt's new husband - who has an absurd handlebar mustache and carries a cane, looking an awful lot like the monopoly man - begins his spiel. He fancies himself a pastor, so he was our dude for the afternoon. He begins speaking IN A COCKNEY ACCENT to lead us in prayer. \n\nHe's from Oregon. Never been to the UK. Doesn't have anything but the mild American west coast accent. But he's speaking cockney at us for some reason. My wife and I exchange puzzled looks but let it go. \n\nA few minutes in, and I get my cue to start the music. I can't remember what song it was, but it was special to grandma. I've got the iPad hooked up to a Bluetooth speaker and I let it rip. Pouring out from the speaker comes \"I WANT MY BABY BACK BABY BACK BABY BACK I WANT MY BABY BACK BABY BACK BABY BACK CHILI'S BABY BACK RIBS\".\n\nThere's a fucking Chili's ad before the song starts and I'm at max volume in a small church. Fantastic. \n\nI'm trying not to lose it laughing at this point. I skip the ads, we get through the song, and move on. Mom is going to say a few words. \n\nShe stands up there and talks fondly of her departed mother, but repeatedly says \"asses\" instead of \"ashes\" when referring to the cremains in a plinth next to her. I'm stifling giggles at this point. \n\nThe ceremony wraps up,  my newly minted uncle speaking in Cockney the whole way. Family files out of the church to head to the cemetery, where my uncle had been the day before to dig a hole in the great aunt's grave. (Yikes) \n\nWe get to the cemetery and unc pulls me aside and asks if I'll fill the hole after they do a little graveside speechifying. Of course. I'm happy to help. \n\nEveryone shuffles over to this hole in the foot of our long dead ancestor's grave, each of grandma's 3 surviving kiddos say some words, and unc puts her in the ground. Now mind you, he has to lie flat across the grave to set the urn in there without dropping it. He dug a deep hole. \n\nI help unc to his feet, he brushes off some dirt from his lapels, I grab a nearby shovel and stand ready to get to work. I expect at this point that the other mourners will leave, and we'll all rally back at the Elk lodge for the wake, but alas, they had other plans. \n\nListen reddit - I'm a big guy. 6 foot, 285lbs at the time. Not in the best shape. And it's 90°F outside, I'm wearing slacks, a shirt, and a tie. The sun is beating down. We're at altitude. All of these things are conspiring against me looking good while I fill this hole. \n\nBut every single person there, all 30 of them,  form a lose semicircle around the grave to watch silently while I fill this hole. Did I mention unc dug it really deep? \n\nSo here I am, the Chili's baby back ribs jingle stuck in my head, throwing dirt onto grandma's cremains. I'm starting to drip sweat. I'm having a hard time not grunting. And around me, just absolute silence from the crowd. Nobody trailing off to their car, no chit chat amongst those near each other. Nada. \n\nIt takes me a solid 10 minutes to fill this hole. I end up having to take off my tie, roll up my sleeves, open my top couple of shirt buttons. Nobody offers to help. New uncle Cockney twirls his cane and his mustache. The birds chirp. The sun beats down. \n\nAt last, I'm done, and everyone heads to their cars to go to the wake. I'm drenched in sweat and wondering where I can change. My wife and I get into the rental car, look at each other for a few long seconds, and burst out laughing. This was the most surreal, strange, and hilarious few hours we'd ever experienced. And I'm glad we both got to experience it together. \n\nRest in peace, Granny Kathy. We saw you off as best we could.",
   "created_utc": 1690323995,
   "score": 230,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtf8aoe",
   "message": "\"Damn, what a loss.  She gargled cocks like no one else.\"",
   "created_utc": 1690312187,
   "score": 160,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtf9dz7",
   "message": "[deleted]",
   "created_utc": 1690312606,
   "score": 35,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfb8vs",
   "message": "Could be worse.",
   "created_utc": 1690313306,
   "score": 72,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtf97fb",
   "message": "“Even with all of her health issues, I glad Grandma was able to come today.”",
   "created_utc": 1690312536,
   "score": 141,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtf91jw",
   "message": "“I’m not gonna lie she looks hot”",
   "created_utc": 1690312474,
   "score": 103,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfc2av",
   "message": "\"Eh, worlds better off with them gone.\"",
   "created_utc": 1690313613,
   "score": 41,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtflzhl",
   "message": "We beat the shit outta a long distance family member from the opposite side of the family because he stood up in the middle of my teenage brothers eulogy to tell a fussy 1 year old not related to him to STFU at the top of his lungs.",
   "created_utc": 1690317271,
   "score": 43,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfaqq5",
   "message": "\"Before I start this funeral, I like to thank a sponsor called NordVPN\"",
   "created_utc": 1690313116,
   "score": 66,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfhf6n",
   "message": "\"Come here often?\"",
   "created_utc": 1690315591,
   "score": 30,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtg82af",
   "message": "This post reminds me of what someone said when my grandfather passed away. He had really bad Alzheimers and it was so painful for my mother to watch her father essentially degrade over time. We were at his funeral when someone said to my mother \"Who cares? He was pretty much already dead.\" Because of the disease, and I was literally going to kill this motherfucker for saying that to my grieving mother at her own father's funeral. Luckily my brother is much more level-headed than me and told me to just walk away and focus on making sure my mother is okay rather than focusing on murdering the dipshit who said that. I do not think I have ever been more mad than I was in that moment in my entire life. Not even close.",
   "created_utc": 1690326404,
   "score": 36,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtf9901",
   "message": "Damn, your mom looks wicked hot laying there in that tight ass dress. Her boobs look fucking huge and she always did have a dummy thicc ass. Its a shame she's dead now. What a waste.",
   "created_utc": 1690312553,
   "score": 62,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfbbse",
   "message": "This was fun. We should do it again sometime.",
   "created_utc": 1690313335,
   "score": 48,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfkh2o",
   "message": "What's the wifi password?",
   "created_utc": 1690316718,
   "score": 29,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfd2pi",
   "message": "\"I'm sorry\" and \"I apologize\" mean the same thing, except at a funeral.",
   "created_utc": 1690313987,
   "score": 50,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtffwqz",
   "message": "About time someone died i’ve been waiting for that funeral food",
   "created_utc": 1690315029,
   "score": 19,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfiift",
   "message": "\"IT SHOULDA BEEN ME, I WAS THE ONE SUCKIN DICK FOR MONEY\"",
   "created_utc": 1690315998,
   "score": 19,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfaryp",
   "message": "When the open casket's  over can I have the body?",
   "created_utc": 1690313129,
   "score": 28,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfchmh",
   "message": "This place puts the fun in funeral!",
   "created_utc": 1690313770,
   "score": 32,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfvu4v",
   "message": "\"It was god's plan\" (at my mother's funeral, by the vicar) was probably the final nail in the coffin for me on religion. Guy was lucky I didn't just thump him then and there.",
   "created_utc": 1690321564,
   "score": 55,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfhu74",
   "message": "As you talk to people individually, insinuate that the death was at least partly their fault. The closer the person was to the deceased, the more at fault you insinuate they were. You dont have to be straight up accusatory, just plant little seeds that will keep them up at night (more than they already are). You know, little remarks that they will replay in their heads over and over. The ones that slowly eat away at their soul until they completely crush their spirit.\n\nThis tactic is particularly effective with su!cides and accidental OD's. Much more difficult with terminal illness, but you can still try to make people feel bad about how they weren't there for them as much as they probably could have been, especially toward the end 🙂",
   "created_utc": 1690315747,
   "score": 60,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfdkrj",
   "message": "He’s in a better place.  I don’t think people who say this have any idea.",
   "created_utc": 1690314172,
   "score": 30,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtficz0",
   "message": "I'm Sorry my man, totally my fault. Won't happen again, I promise.",
   "created_utc": 1690315941,
   "score": 17,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfb166",
   "message": "I'm glad your husband is gone. Wanna fuck?",
   "created_utc": 1690313225,
   "score": 25,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfeukd",
   "message": "\"Wake 'em up, we're here\"",
   "created_utc": 1690314641,
   "score": 11,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtflc69",
   "message": "I'm sorry for your loss. Move on.",
   "created_utc": 1690317035,
   "score": 9,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtg85vr",
   "message": "And for the wake we're serving long pig.",
   "created_utc": 1690326446,
   "score": 9,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfc2xc",
   "message": "\"A live body and a dead body contain the same number of particles. Structurally, there's no discernible difference. Life and death are unquantifiable abstracts.\"",
   "created_utc": 1690313619,
   "score": 13,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfcpc7",
   "message": "I'm not used to seeing them with their clothes on.",
   "created_utc": 1690313850,
   "score": 14,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfen9p",
   "message": "I was supposed to have sex with her the night she died, damn it.",
   "created_utc": 1690314569,
   "score": 6,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfghfc",
   "message": "“She had it coming”",
   "created_utc": 1690315242,
   "score": 12,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfm7st",
   "message": "Here.\nIt's Cradle of Filth.\nIt got me through some pretty bleak times.\nTry track 4, Coffin Fodder.\nIt sounds horrible, but it's actually quite beautiful.",
   "created_utc": 1690317355,
   "score": 12,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtg0yw6",
   "message": "How much did you get?",
   "created_utc": 1690323530,
   "score": 8,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtg4nsg",
   "message": "Or... start telling \"yo momma\" jokes during their mothers funeral.",
   "created_utc": 1690325015,
   "score": 6,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtg7may",
   "message": "\"So you're single now?\"",
   "created_utc": 1690326219,
   "score": 11,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfdar9",
   "message": "“I apologize”",
   "created_utc": 1690314070,
   "score": 5,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfjncv",
   "message": "The body is moving",
   "created_utc": 1690316420,
   "score": 6,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfuhcv",
   "message": "“This eulogy has been sponsored by Tampax: we’ll keep you dry until you die”",
   "created_utc": 1690321052,
   "score": 7,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtg8fk8",
   "message": "I'm just here for the food",
   "created_utc": 1690326558,
   "score": 6,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfdipz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfcm9f",
   "message": "\"They're in a better place now, so stop crying.\"",
   "created_utc": 1690313818,
   "score": 3,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtfede6",
   "message": "When can I get the money? I need it!!",
   "created_utc": 1690314467,
   "score": 3,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtffwxx",
   "message": "They say there’s no two people on earth exactly the same. No two faces, no two sets of fingerprints. But do they know that for sure? Cuz they would have to get everybody together in one huge space. And obviously that’s not possible even with computers. But not only that, they’d have to get all the people that ever lived, not just the ones now. So they got no proof. They got nothin.",
   "created_utc": 1690315031,
   "score": 3,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtg7qv6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtgbpxf",
   "message": "“Is that rigor mortis or are you just happy to see me?”",
   "created_utc": 1690327926,
   "score": 4,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtgbwch",
   "message": "\"I'm so horny rn\"",
   "created_utc": 1690328001,
   "score": 3,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtgkn42",
   "message": "In Kentucky, especially in the southeastern part, people will ask, \"Are they saved?\" I worked at an ER and heard it constantly.  I can't think of anything worse to ask someone who recently lost a family member or friend.",
   "created_utc": 1690331773,
   "score": 7,
   "submission_id": "159hs54"
  },
  {
   "comment_id": "jtflme8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159hs54"
  }
 ]
}