{
 "submission_id": "159imzn",
 "title": "Have you ever been to a nude beach and if you have, what is it like?",
 "selftext": "",
 "created_utc": 1690314018,
 "permalink": "/r/AskReddit/comments/159imzn/have_you_ever_been_to_a_nude_beach_and_if_you/",
 "score": 205,
 "url": "https://www.reddit.com/r/AskReddit/comments/159imzn/have_you_ever_been_to_a_nude_beach_and_if_you/",
 "comments": [
  {
   "comment_id": "jtfj4y2",
   "message": "There was about 10 dicks to every one boob",
   "created_utc": 1690316231,
   "score": 203,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfgaf6",
   "message": "I was, a few times, as a man, I did not care about anybody, but for my girlfriend at the time was different. There’s still older dudes who watch people from the back on the beach on the little hills, so she was just half nude.",
   "created_utc": 1690315170,
   "score": 218,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfy92s",
   "message": "Seriously it’s a bunch of regular people and then a handful of naked dudes. I took a long  walk once through a nude area and I swear I met a serial killer at the nude beach.  I’m at the  shore and he’s naked at the shore.  I head to the cliffs he’s naked at the cliffs.  We cross paths at the shore.  He’s naked and wants to introduce himself.  Says he just moved here and so I want to go on a date.  I say I can’t friends are waiting for me.  As though any figure anywhere would say yes to his? \n\nMonths later I see this guy on the news for killing people - I think it’s near Yosemite.  I swear it’s beach guy.  My family laughs but I look him up and he had been to my area and — yes — frequents nude beaches.",
   "created_utc": 1690322488,
   "score": 208,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtg19ol",
   "message": "Every beach is a nude beach if you’re brave enough",
   "created_utc": 1690323650,
   "score": 189,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfi9p1",
   "message": "I went to Hedo in Jamaica on a day pass. Started off on the prude side with my bikini on, took top off and chilled a while then got the courage to strip off and head to he nude side. Tons of people, all different shapes, sizes and ages. You learn quickly to look people in the eye when you talk to them. I really liked swimming naked and then back to the lounger to dry off. It feels so good without that wet swimsuit. I would go to a nude beach again.",
   "created_utc": 1690315907,
   "score": 0,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfm894",
   "message": "Went to haulover in Miami. Great experience, everybody very respectful and friendly. \n\nAbout 60% of people were on the older side, about 70% men. I (M 26) was the youngest, yet some girls seemed around my age. Usually older people are the ones that go full nude. \n\n10/10 would recommend, the sensation of freedom is unmatchable.",
   "created_utc": 1690317360,
   "score": 33,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfk5tr",
   "message": "They treated me special.  Everyone told me that not only was it unnecessary for me to get naked, but they strongly advised me against it.",
   "created_utc": 1690316604,
   "score": 25,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfss2n",
   "message": "Way more normal than you would expect if you've never been. Everyone just does their own thing. There is etiquette at nude beaches that usually ends up with you experiencing a quieter and nicer experience, than on the clothed beach.",
   "created_utc": 1690320327,
   "score": 227,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfxygk",
   "message": "\"It's never the ones you hope.\"\n\n\\- Tobias Funke",
   "created_utc": 1690322375,
   "score": 121,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfs7ok",
   "message": "Yup loved it. Each one ive been to has been a pretty good hike and definitely off the beaten path especially compared to easy drive up and walk on beach next to it.\n\nBut cant stand when parents bring their children (under 9) and act like its not a nude beach. Happens every time!!",
   "created_utc": 1690319981,
   "score": 87,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfdzbx",
   "message": "Bro, it's so full of weirdo's...\n\nI can't stand all these people watching me while I'm having sex with my wife..",
   "created_utc": 1690314323,
   "score": 161,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtg0v3h",
   "message": "Yes. Not like the movies. The people you want to see nude are at the regular beach and the people you don't want to see nude are at the nude beach.",
   "created_utc": 1690323487,
   "score": 67,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfdx2a",
   "message": "lot if water, strip of sand.  some rocks",
   "created_utc": 1690314300,
   "score": 19,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfli32",
   "message": "Lots of sunblock used. But still not enough.",
   "created_utc": 1690317095,
   "score": 63,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfnp6x",
   "message": "Not beach but a few spas in Europe. All very chill\n 10/10 would recommend.",
   "created_utc": 1690317895,
   "score": 156,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfqa11",
   "message": "Was in Cuba for a girls trip with the family a couple years back and saw this MFM throuple butt naked, playing fighting with each other in the water. We looked around confused and saw some more nakey people. It was a very awkward moment to be in with the family around and wasn’t sure why everyone was naked. I just thought people got horny and wanted to be frisky. I thought nude beaches were just a thing of fantasy. This was until I passed by a sign on our way to our resort that said “Playa Nudista”.",
   "created_utc": 1690318921,
   "score": 191,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfydko",
   "message": "Went to hippie hollow in austin with a few friends and my bf on a really hot day in August, we were in the area eating lunch, nobody had their swimsuit with them but we were dying to get a reprieve from the heat so we decided “fuck it we will go to hippie hollow and just swim in our undies.”\n\nWe got there and everyone there was nude on the rocks by the water, so when we got to our swim spot I thought fuck it and just stripped down to nothing and got in. Everyone else followed suit. \n\nAll was fine, felt strange but kinda freeing swimming naked, until a dude in his 30s (roughly our age) came up to us and chatted us up and WOULD. NOT. LEAVE. even when we signaled that we had to get out. So he just watched us as we got out of the water and dried off. \n\n4/10, good bonding experience with friends, but if you are young you will likely get some attention.",
   "created_utc": 1690322536,
   "score": 205,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfq8ef",
   "message": "Sorta been to one, but not really. \n\nUsed to surf at a spot South of San Clemente called Trails. There are several approaches to the beach from the bluffs above, Trails 1 - 7. One of the spots (I think it was. Trail 1?)  borders on what is (Was? I think maybe they cracked down on the nudity, and it's not any more.) a nudist hangout. Only thing different for me was I didn't worry quite so much about towel coverage when changing in/out of my wetsuit. Not like someone there was going to be offended at the momentary sight of peen.",
   "created_utc": 1690318901,
   "score": 87,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfv591",
   "message": "Go to a retirement home. Then take fifty men and two women. Now have them strip. Congratulations you've found the fugliest sausage party on earth or a nude beach.",
   "created_utc": 1690321303,
   "score": 178,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfrcdn",
   "message": "It was a cool winter day and hardly anyone was there. The old guy I thought was doing yoga on the beach, was actually giving himself a blow job.",
   "created_utc": 1690319532,
   "score": 114,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfsqwp",
   "message": "It honestly didnt phase me at all. Just people sunbathing. Swimming in the ocean naked is bucket list level liberation, so i was glad to experience it. Everyone just minds their own business.",
   "created_utc": 1690320311,
   "score": 145,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfnose",
   "message": "I’ve been a few times and every single time there’s at least one old man with his dick pierced. It makes me wonder what the percentage of Prince Albert piercings is among the general population vs the demographic that frequents nude beaches.",
   "created_utc": 1690317891,
   "score": 114,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfts61",
   "message": "Yes, and I enjoyed it. It actually feels more \"naked\" to wear clothes when everyone around you isn't. If you're naked you blend right in. Just BRING LOTS OF SUNSCREEN!",
   "created_utc": 1690320774,
   "score": 55,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfp0pj",
   "message": "I was like 12 and in the caribbean. Took a boat to an island for the day. Another boat pulls up an hour later full of naked guys and not a single boobie was out. I was obviously disappointed to no end.",
   "created_utc": 1690318370,
   "score": 81,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfxc38",
   "message": "Let me count:\n\n* The Ledges in Vermont\n* Blacks Beach\n* Lake Erie one time at band camp\n* On a sailboat in Caribbean\n* Martha’s Vineyard\n* Bonny Dune\n* Deep Creek hot springs\n* Lake Tahoe secret cove. \n* numerous small ponds and creeks.\n\nIt’s far less sexy than you might think from web searches.\n\nOn average... people look average.\n\nIt’s great to climb out of the water and not be wearing a damp swimsuit.",
   "created_utc": 1690322136,
   "score": 28,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfymr8",
   "message": "Tan everywhere. Sand everywhere.",
   "created_utc": 1690322634,
   "score": 29,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfd9l2",
   "message": "It’s actually great",
   "created_utc": 1690314058,
   "score": 29,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfx4wq",
   "message": "As and old French co worker told me, “If everyone’s naked, nobody is naked”",
   "created_utc": 1690322059,
   "score": 67,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfykvv",
   "message": "Blacks Beach in San Diego, mostly older men but one time I saw an interesting volleyball game from some of the local university students.",
   "created_utc": 1690322614,
   "score": 50,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtggi6w",
   "message": "As a woman, I was honestly objectified LESS at the nude beach than a regular one",
   "created_utc": 1690329976,
   "score": 58,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfil5t",
   "message": "Yeah I was like 7 and my dad took us on a family vacation to Portugal, lots of topless girls, had my stand infront of them to the side to get a picture of “me”",
   "created_utc": 1690316026,
   "score": 49,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfw19i",
   "message": "A lot of old shriveled penises along with their equally old spouses. There may be one young person for every 50 old. Sometimes the younger people will go topless. This is in Croatia’s nude beaches. They’re mainly rocky beaches so there’s no sand to worry about. It is nice swimming naked, feels very freeing.",
   "created_utc": 1690321641,
   "score": 28,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtg9p45",
   "message": "So, what's the etiquette on boners? Do I role over and dig a hole out or just let my flag fly?",
   "created_utc": 1690327087,
   "score": 41,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfzo50",
   "message": "Been a few times to different beaches. Mostly a positive experience and not sexual. Of course one place in San Diego had these creeper dudes that would hang out on the perimeter and gawk.",
   "created_utc": 1690323034,
   "score": 11,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfxmda",
   "message": "In my experience, there are always a lot of naked people and very few of them are the people you'd want to see naked. Just remember you're not there to ogle people and there's no obligation to undress beyond your own comfort level. Most everyone is chill.",
   "created_utc": 1690322244,
   "score": 17,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtgfzqa",
   "message": "The biggest tits you see are hanging on old men.",
   "created_utc": 1690329754,
   "score": 19,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtgabkh",
   "message": "It’s called the beach in Europe",
   "created_utc": 1690327345,
   "score": 9,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfqzxt",
   "message": "Doesn’t seem so odd when everyone is nude (without the pressure to be nude yourself)",
   "created_utc": 1690319203,
   "score": 11,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtg0ok4",
   "message": "I hiked over the hill on Maui from Big Makena to Little Makena (nudist) with my, then, two teen sons and sub-teen daughter back in the mid nineties. They got an eyeful of overweight, aging, baby boomers (like me!). I hoped to give them a story that they could tell their mainland friends but don’t think they were impressed…",
   "created_utc": 1690323416,
   "score": 11,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtggmul",
   "message": "It's like any other beach. There's really nothing sexual about it, people bring kids there. The only thing that annoys me is the tourists who come fully dressed with cameras. I feel no shame telling them off.",
   "created_utc": 1690330031,
   "score": 12,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtgns13",
   "message": "Wreck beach in Vancouver is one of my favourite beaches in the world. Total hippy community vibe. I never went full nude, just topless (I’m a girl). But totally welcoming vibe. Any obvious pervs or photographers were ostracized. Very chill. But in my experience nude beaches are not a place to ogle naked model-types. Mostly people of all shapes and sizes just being free. Wreck beach in Vancouver Canada, if you’re there go. \n\nDisclaimer, I haven’t been there in years and it might be different now. But it was so lovely in the early 00’s when I frequented that beach.",
   "created_utc": 1690333186,
   "score": 19,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfd83a",
   "message": "Mainly old men",
   "created_utc": 1690314043,
   "score": 17,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfdk87",
   "message": "ive been to as a child with my parents (i was clothed dw)  basically just a normal beach with few people under like 30 and everybodys naked.",
   "created_utc": 1690314166,
   "score": 13,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfuvtg",
   "message": "Better have sunblock or your burning 🔥 🔥",
   "created_utc": 1690321204,
   "score": 7,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtg1jmd",
   "message": "It’s a beach where people are naked",
   "created_utc": 1690323760,
   "score": 4,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtg96b4",
   "message": "We go to a clothing optional river spot near us because it is simply the least crowded and nicest area to swim around here. At first I was just like God damn, I do not want to see these dicks. But then it dawned on me...I don't have to look at them. For the most part it's really chill, haven't really seen much creepiness or anything. Think of it as an outdoor ymca locker room and you're not far off",
   "created_utc": 1690326868,
   "score": 11,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtg9eme",
   "message": "I went to Hipppie Hollow in Austin,  TX. It was okay. A good mix of clothed and unclothed people. I went topless. I was about 25 at the time, and no one creeped on me.",
   "created_utc": 1690326966,
   "score": 4,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtge0s6",
   "message": "It's just like every other beach I've been to in that the 15% on either end of the curve (tall, skirt  fat, skinny, hairy, gorgeous, deformed) get looked at and the other 70% are just background noise. Fewer adolescents but not zero.. after 20% it's not strange at all. You're carrying the same gear as roughly half the population. It's nbd.",
   "created_utc": 1690328910,
   "score": 4,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtgf8zf",
   "message": "A few times. Black's beach San Diego. An equal amount of men to women. The average age was way lower than I expected. A lot of young, athletic, good looking people. I was definitely self conscious about undressing. I pretty much stayed in my suit until I was ready to swim. It was liberating to swim nude. Also enjoyed getting out of the water, returning to my towel, and drying off naturally in the sun.  \n\nAfter that positive experience, I decided to go to one on vacation to the Mediterranean. Definitely a much larger cross section of people, body types, ages. More of what I expected the first time I went. People in Europe were definitely less prudish. I definitely saw some sexual activity on the beach that nobody else seemed to care was going on.",
   "created_utc": 1690329434,
   "score": 11,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtgfb8s",
   "message": "I was at a nude beach in italy in 2010.  Out of hundreds of people there that day, there were like 4 old ladies with their tits out and a bunch of naked kids.  I don’t recall any grown men hanging dong.  I had never considered that nude also applied to kids.  It was super weird seeing naked kids all over the beach as an American abroad but no one over there cared.",
   "created_utc": 1690329460,
   "score": 10,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtghng0",
   "message": "Old people rightfully have no time for shame anymore.  And that is all you will find at nude beaches.  \n\nOh and the occasional horny repressed American with an antiquated puritan upbringing that makes a naked body taboo...",
   "created_utc": 1690330471,
   "score": 4,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtghxul",
   "message": "It's like any other beach... Only without clothes. Don't stare at people and mind your own business and you'll forget where you are.",
   "created_utc": 1690330596,
   "score": 7,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtgnt34",
   "message": "Yes, it was all beautiful babes with large breasts. Each one was ovulating and couldn't stop staring at me.\n\nIs this what you wanted to hear, you horny fucker?",
   "created_utc": 1690333200,
   "score": 3,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtgv76l",
   "message": "Hairy beer bellies and gray pubes everywhere.\n\nThe universal rule: people that want to be seen in public naked are never people you want to see naked.",
   "created_utc": 1690336553,
   "score": 1,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtgvmit",
   "message": "Never been, but I can guess.\n\nIt's full of people who don't care about walking around naked.\n\nThose people probably look 10x better with clothes on.",
   "created_utc": 1690336755,
   "score": 1,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfv4bx",
   "message": "wrinkles and pube city, mostly old people who dgaf anymore",
   "created_utc": 1690321294,
   "score": 7,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfqhkv",
   "message": "I mean,  I've been nude on a beach..",
   "created_utc": 1690319013,
   "score": 7,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtg1qgs",
   "message": "Yes, australia, it was fun to be nude, strange mix of others around, all ages and body shapes, would go again.. as full body tan was great",
   "created_utc": 1690323834,
   "score": 7,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtfvgp7",
   "message": "Fat bellies and cocks everywhere",
   "created_utc": 1690321423,
   "score": 3,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtg2a6y",
   "message": "Yes.\n\nThere were naked people there.",
   "created_utc": 1690324049,
   "score": 4,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtg35u3",
   "message": "I went to a few about 10 years ago and realized that nude beaches aren’t at all like they make them out to be in the movies. Only about 1/2 of the people there were nude at all, and even then it was mostly just older guys or topless women. It wasn’t hot or sexy in any way and if anything just seemed kinda normal/natural. I kept my shorts on and my ex-wife only took her top off, nobody said anything to us, and it was all around a pretty underwhelming experience.",
   "created_utc": 1690324401,
   "score": 3,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtgf9nr",
   "message": "When I first got to Austin, a new friend and I were driving by the lake looking for Windy Point park. \n\nWe see a park sign, pull in, pay our fee and park. We (21M and 21F) get out to walk down the trail to find the park.\n\nWe get down the trail aways and come around this corner to a comically obese naked man, with his little tiny weewee just a whistling in the wind. This guy was WHITE, like his reflection almost made him glow, but there was no mistaking the sheer nudeness if it all.\n\nWe just kind of laughed it off and kept walking to the edge of the rocks and it opens up to the nakedest group of gay guys I've ever seen in my life.\n\nWe both turned, looked at each other and immediately made our way back to the car.\n\nThis was my experience at Hippy Hollow in 1991. Hippy Hollow is down the road from Windy Point and I learned a very valuable lesson that day.",
   "created_utc": 1690329442,
   "score": 7,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtghm6h",
   "message": "One time on lake Travis, near Austin a duck boat (tour bus that can go in water) was cruising during a tour when the guide pointed out hippy hollow the only nude beach around. The tourists rushed to the one side of the craft to get a look and capsized it, All to see what was probably 3-4 dudes.",
   "created_utc": 1690330455,
   "score": 7,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtgk06m",
   "message": "Yes and it's nothing like the movies. It's almost everyone you don't want to see naked",
   "created_utc": 1690331497,
   "score": 7,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jtghc20",
   "message": "Everyone was SO old.  Raisins in the sun. Seriously.  Lots of saggy... everything.",
   "created_utc": 1690330334,
   "score": 6,
   "submission_id": "159imzn"
  },
  {
   "comment_id": "jth7o0e",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159imzn"
  }
 ]
}