{
 "submission_id": "159mtlj",
 "title": "Redditors who hated high school, why did you hate it?",
 "selftext": "",
 "created_utc": 1690323048,
 "permalink": "/r/AskReddit/comments/159mtlj/redditors_who_hated_high_school_why_did_you_hate/",
 "score": 42,
 "url": "https://www.reddit.com/r/AskReddit/comments/159mtlj/redditors_who_hated_high_school_why_did_you_hate/",
 "comments": [
  {
   "comment_id": "jtfzyh0",
   "message": "I often felt like there was something inherently wrong with me compared to everyone else. Like I was the odd one out. I wish I didn't care about that stuff. It's a hard lesson to learn but life is a lot easier when you stop overthinking about other people.",
   "created_utc": 1690323144,
   "score": 19,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg4gmz",
   "message": "Wake up at 530 am so you can sit under fluorescent lights all day in a room full of people who don't want to be there.",
   "created_utc": 1690324935,
   "score": 94,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg2wpz",
   "message": "In the 10th grade my best friend randomly became FUCKING OBSESSED with this guy in our class. This went WELL beyond a crush and carried on for years.\n\nShe worked her ass off to make AP Physics so they could be in the same class junior year.\n\nJoined the yearbook committee so she would have access to his pics (seriously).\n\nCreated a sort of picture collage shrine to him in the back of her closet (this is when I started calling her Helga)\n\n**She followed him to college.**\n\nJunior year of high school, when they had AP Physics together, they were paired up for a project. **He went to her house, he went to her room, he came across her diary and...he shared that shite with the entire junior class.**\n\nAs embarrassing as you think this must have been...it was worse.\n\nAfter that she said she was DONE with his sadistic ass. Then, the following year, she just so happened to choose the same college as him.\n\nThe weirdest part is how their \"relationship\" evolved after that.\n\nFreshman year he kept telling her to keep away from him.\n\nSophomore year they were...not fwb/fuck buddies because they definitely weren't friends or buddies. They weren't \"lovers.\" They were...people who fucked regularly. They were fuckers.\n\nBy junior year they were openly dating and exclusive.",
   "created_utc": 1690324299,
   "score": 181,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg2tyt",
   "message": "Too many reasons to list \n\nPoor, socially awkward, smart enough to get decent grades, parents didn't let me have a social life, didn't drink or smoke, generally didn't like the place to begin with, lowest man on the totem pole and everyone's whipping boy",
   "created_utc": 1690324269,
   "score": 169,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg06h4",
   "message": "I hated getting up so early.",
   "created_utc": 1690323231,
   "score": 58,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg087k",
   "message": "Because of students. Place werent bad, but students were humiliating me.",
   "created_utc": 1690323249,
   "score": 69,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg26nh",
   "message": "My high school was a joke academically speaking.  It didn't take much effort to maintain good grade point average.",
   "created_utc": 1690324010,
   "score": 52,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg3s6u",
   "message": "I was an antisocial nerd",
   "created_utc": 1690324658,
   "score": 29,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgbnhk",
   "message": "I was very overweight and socially anxious. I had no friends, no one to talk to, got made fun of behind my back for my weight, and was pressured at the same time to focus on all these different useless subjects amd felt like they didnt really care about me unless I did well, I tried talking to my counselor and teachers an they gave 0 shits until my grades started dropping. Its a terrible environment for kids to be shoved into days on end",
   "created_utc": 1690327899,
   "score": 40,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtge8tn",
   "message": "Untreated anxiety and depression.",
   "created_utc": 1690329005,
   "score": 40,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg5wcm",
   "message": "One of the very first things my \"friends\" from middle school did when we started high school was to start a fake rumor that I was gay. So for pretty much the entirety of high school I had people harassing me online calling me the F slur. In junior year they started mocking me for my mental health struggles. They believed that since I had good grades I must've had a perfect life. The bullying and mocking got so bad that I just decided to suffer in silence. \n\nI was incredibly naive in high school so at the time I didn't even realize I was being treated badly. It was only in college where people started treating me like an actual human being that I realize that high school was shit.",
   "created_utc": 1690325516,
   "score": 23,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgh0v2",
   "message": "Bullies. So. Many. Bullies.",
   "created_utc": 1690330199,
   "score": 18,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgm4qb",
   "message": "Bullying.",
   "created_utc": 1690332426,
   "score": 15,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgpbe3",
   "message": "Undiagnosed and untreated social anxiety disorder, depression, and ADHD.\n\nEvery single day felt like a confusing and exhausting torrent of stage fright.\n\nIt was Hell.",
   "created_utc": 1690333900,
   "score": 37,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg3bo1",
   "message": "Have hearing loss. Fought with doctors for years to get a prescription for hearing aids (when you still needed an Rx for it) and couldn’t hear for most of my classes in high school",
   "created_utc": 1690324471,
   "score": 25,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg2jm3",
   "message": "My life sucked. It was less about school itself and more about the period of life i was in",
   "created_utc": 1690324154,
   "score": 33,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg3yl2",
   "message": "I had a good first year in Highschool.\n\nThen my middle school principle and his shitty ass policies got promoted to the new principal and suddenly all the kids were back to being complete shitheads.\n\nMy dad as a teacher quit under him because his policies for dealing with students were TERRIBLE. Teachers got fucking abused by students and he never did anything.\n\nOne boy nearly set a girl’s hair on fire with a lighter…teacher reported him. Didn’t even get Suspension…\n\nI hold grudges against that principal and his policies everyday. Especially when he tried to tell me with full confidence that I instigated a fight with a bully football player who THREW ME INTO BLEACHERS!",
   "created_utc": 1690324731,
   "score": 12,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg4ygi",
   "message": "I was short and very thin and was made fun of. I hated it",
   "created_utc": 1690325135,
   "score": 9,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg6oew",
   "message": "My parents forced me to play baseball, and my dad was the baseball coach, and all he did was yell at me. And then we'd go home and fight. My grades dropped dramatically, and I slipped into depression, and then I was yelled at for being sad and negative.",
   "created_utc": 1690325835,
   "score": 5,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgeacr",
   "message": "oh man where do I start, the district I was in could care less if you actually learn anything, they only care to meet numbers like most of the American education system. they offered little to no support for those who were actually struggling, we were overpopulated by 1200 students so you were lucky to get a lunch. fights and police calls were a daily occurrence. all of the equipment, desks, chairs, blackboards (not whiteboards) etc were literally 40 years old and they refused to replace them but hey $1 million for a new football field for a team that sucks seams like a great idea. and the people, god the people were horrible, all ghetto trash morons who only cared about drugs. you were lucky if you didn't get robbed by them wandering between classes. the whole experience was awful and honestly I don't care if i ever see all but three of my former classmates ever again",
   "created_utc": 1690329023,
   "score": 9,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgra3s",
   "message": "I actually didn't have many problems with other students. It was entirely egotistical or bully teachers, grading standards, the amount of time teachers expected us to free up for school, and the pacing of learning in general.\n\nFor example, my worst semester in highschool was that one I spent in the brand new charter school. The way that the credits were distributed was God awful. In a normal semester you'd get 4 credits, you needed a minimum of 24 to graduate. At the charter school you were able to get a maximum of three credits depending on the classes you took, the problem was that the teachers were working without checks or balances and the classes with the larger credits would fill up quickly with the teachers choosing who was able to be in them. The point at which one of the administrators came down like a sledgehammer was when a third of students wanted to return to the highschool after the first ever semester of the charter school.\n\nMy experience was similar to many and this is my best example of it. We had an English course about writing persuasive papers, it was ran by a teacher from the highschool who did everything except the grading. We were told to document our research into our subject and have a minimum 8 page paper in two weeks. The English teacher was checking in on everyone and assessing rough drafts at the week and a half mark. I got *very* good feedback so I continued on. At two weeks I handed it in and waited to see what I got for a grade. When it updated it showed a 0% so I talked to the teacher who was grading the course and she told me that, because I turned it in with 14 notecards instead of her arbitrary minimum of 32 that was not disclosed to us, I did not complete the assignment and therefore would not get a grade. I talked to the English teacher who was running the course and checking in on it, she got really angry and dragged me to the office where I was told to explain it to the administrator. I did, he asked for a copy of the assignment, and then by the end of the day I had full credit for the course.\n\nThat was just a summary of the one semester I spent at the charter school. I had a teacher who claimed I wasn't handing in assignments to the point that I had another teacher hand them in for me (the hammer really came down on that one when she said I still wasn't handing them in). I had an algebra teacher marking my tests as failures and refusing to explain why causing me to go to another math teacher who had to get another administrator involved because, spoiler, my tests weren't wrong. She was marking them wrong because she was mad that I wasn't doing my homework and was trying to prove a point. From that point on the administrator had another teacher grading my tests, I ended up with a minimum score of 98%, and passed with flying colors without turning in a single assignment.\n\nIt also doesn't help that I had to take algebra three times. The first time was because I got a concussion then missed too much school due to migraines and the teacher was a hardass who wouldn't let you take the test unless you've done the work, but wouldn't let you do that work if it was more than a week late. The second time I actually just straight up passed it but with all of the drama around the tests I got the credit for the class and was given the \"we still think it's a good idea for you to retake it just in case your scores were a fluke\" speech.\n\nSo yeah, my problem was the teachers and the handling of the curriculum.",
   "created_utc": 1690334766,
   "score": 9,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg5j4b",
   "message": "I went to four different high schools. I’m not comfortable divulging my neurodiversity but that was part of it, and I was socially just not with it. I somehow always managed to make some friends, but I was for sure in the out of the loop crowd up until senior year. Then, I went to an alt HS and everyone was some kind of way, so we weren’t breaking any popularity records but we were not the most ostracized, lol. So, that was not as bad. I also struggled with the education system, so that was part of it, but the social side was the worst. I didn’t ever get bullied like some others (I’m told because people were a little scared of me, cause I was very quiet usually?) but people talked a lot behind my back. Blossomed senior year into someone who lots of different people liked and came out of my shell, but it was rough go. Dropped out actually though and finished later (now college graduate). So, yeah, tough home life, growing pains socially, bad education experience, kids can be cruel, the usual.",
   "created_utc": 1690325370,
   "score": 7,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg5ymy",
   "message": "Wow I don’t miss it. So boring. And to this day I’m still against the idea of homework. Fucking no where else in life do you have to take some shit home with you to finish. It was so… regimented to shit that just did not matter at fucking all. Damn if I would have been given the opportunity to try and accomplish something, I would have done sooo much more to obtain knowledge at that point in my life. There was no opportunity for creativity or any hands on learning. Just … memorization basically. I wasn’t ever told what the goal for each lesson was. They were just lessons.\n\nShort answer: if you can ask “why” and the answer is just “because” I fucking hate it.",
   "created_utc": 1690325542,
   "score": 18,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg54ld",
   "message": "The class is taught to the lowest common denominator. If you're above the median you get fucking board.\n\n10th grade came around, and I finally convinced my teachers not to take my attendance. That I'd be there Monday to pick up the weeks homework and find out what unit we were on and then Friday for the test.\n\nThe rest of the time, I hung out in the library or shot hoops in the gym when there wasn't a class in there. It all felt like a complete waste of time. Community college was the same way, but once I got into my program, it felt WAY better. Was finally surrounded by like minded individuals and the application process weeding out MOST of the stupid",
   "created_utc": 1690325204,
   "score": 23,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgjs8c",
   "message": "I was all about HS my freshman year. I loved school, I was bookish and goal-oriented. A lot of my friends from middle school also went to the same HS. \n\nAs the years went on, I made different friends, met boys, lost interest in academics, discovered drugs and alcohol and was pretty much over it by junior year. My home life was turmoil, and I lost sight of my future. My only goal was  escape.\n\nI mourn for \"high-school-me\" and wish I could go back and help her. But I ended up in a good place and I'm happy with that.",
   "created_utc": 1690331401,
   "score": 9,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg57km",
   "message": "Our principal really sucked. He was strict on dress code and behavioral stuff, but drugs weren’t even on his radar it seemed. I’m from a rural part of Appalachia where pain pills really fucked things up, but especially around my teen years. Kids would openly sell opioids and benzos at school, but god forbid a girl’s shorts are just a smidge too short. I’ve lost several friends to ODs over the years, and they all started in high school. The principal was really weird about facial hair too, like to the point of making my friend Kyle shave his growing stubble every afternoon with a shitty disposable razor… because Kyle was a hairy mf and even though he shaved every day, he’d have a bit of stubble by 1-2pm",
   "created_utc": 1690325238,
   "score": 11,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg74s1",
   "message": "You can only get bounced off lockers so many times before you resent everyone and everything.",
   "created_utc": 1690326018,
   "score": 8,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgbrxf",
   "message": "If you were a basketball star you basically could get away with anything. I would be standing at my locker every morning and this a**hole ball player would walk by and smack my head against the locker. Everyone would laugh even two teachers standing right there in the hall. One time he did it and made my head bleed. I turned around and pushed him. I got detention. My Mom came to the school and made a scene in the office. Threaten to call law enforcement. The guy never bothered me again but school was horrible from then on ☹️",
   "created_utc": 1690327950,
   "score": 9,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg1sfw",
   "message": "Weed, lack of variety, crappy lunches 🤷‍♂️\nI didn't get invited to parties, but I wasn't missing anything lol",
   "created_utc": 1690323855,
   "score": 4,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg70ju",
   "message": "I worked super hard to get into this high school in the ”rich”  part of my city. I was used to going to a school with free lunches but my first day of school i went through the entire lunch line got my tray n finally found a spot to sit, and two seconds later a lunch lady came running up saying i didnt have any money added on my account and snatched my tray. I only had a dollar on me so i ate a pop tart from the vending machine that day. This is pretty much when i knew things were going to be much harder for me. I pretty much became the odd one out in all of my classes(not on purpose its just nobody wanted to be friends- even with group work nobody wanted to work with me) I started getting bullied about halfway through the year (especially since i was normally the only poc in majority of all my classes). I thought i had finally made a friend and we sat together at lunch up until January. Then suddenly, she unfollowed me on everything,stopped eating with me at lunch \u0026amp; joined a new group (so now i was alone sitting at a table near the doors), and every swapped seats in the classroom so she wouldn’t be beside me. Even now i have no idea why. My grades started declining and my anxiety\u0026amp; depression got worse. I went to a teacher who looked like me for support and to ask her to help me with my work. (after all she was my geometry teacher)she had me stay after school one day and basically just told me that ill eventually understand it as long as i “try harder” and then left me alone in the room. After that she scheduled a parent teacher conference and said that i was too hard to teach and that we had to look for an outside tutor. My sophomore year was just as bad except i mad a few “friends” that constantly picked on me throughout the year but at least i had someone to eat lunch with. I transferred to another school back where i was actually zoned for my junior year and got my gpa back up and was actually feeling more comfortable and happier but the right before spring break covid hit and so my junior year ended and my senior year was fully online and we had no in person events other than graduation.",
   "created_utc": 1690325970,
   "score": 3,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgdr6l",
   "message": "I was 4'11\" till I was 17.   \nThe group of nerds and misfits I hung out with still managed to dub me \"Dobby\" from Harry Potter, because of my height. It isn't a name that holds a sense of pride. It holds a fucking sock. One sock. One sock not originally owned by Dobby. Dobby didn't have a sock.  \n\n\nThere was a girl who always called me \"Sexy.\" Not my name, but sexy. She was never single but flirted with me forever. Nothing ever happened in spite of her literally inviting me to go eat her kitty. I was young and inexperienced. I never pursued those kinds of things in school.  \n\n\nHomecoming was with a friend, whom I asked. She said yes, but it was never because she liked me, it was because nobody else asked her. Probably because she was too hot. I asked because I was begged to ask. I wasn't even interested in going. I wasn't really part of a clique after 8th grade. I just didn't fit anywhere. I was the type who paid too much attention to what the adults warned me about and I didn't know to inhale, so when I tried weed the first time, nothing happened. It didn't work. It turned me all the way off for weed forever. I've never related.   \n\n\n\"I bet you're a joy at parties.\" Well no, actually. I'm not at parties.",
   "created_utc": 1690328796,
   "score": 5,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgfab8",
   "message": "High school: where we all felt like oddballs, but hey, we survived! Overthinking skills unlocked!",
   "created_utc": 1690329449,
   "score": 5,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgfia4",
   "message": "I wanted to learn. I was literally there to learn. I'm on the spectrum, I am hyperlexic, I could read a textbook in a few weeks, test out of the course by November and switch into the next level. (I did this more than once, once I did it twice in one year and once I challenged the AP, where I got a five.)\n\nBut unfortunately, in order to learn, I had to sit next to other kids who would make fun of me. I twisted myself into pretzels, pretending to like a certain kind of music, wearing cool-ish KMart clothes that were incredibly ill-fitting, writing the names of bands on my folder, pretending to have devoted my life to them, when I just kind of sort of liked some of their songs. I was too tall, I had severe cystic acne, my mother cut my hair. \n\nI wasn't a total outcast, I had a boyfriend, I had a couple friends, but I remember trying to take classes and just having to walk into a room of strangers, and completely tuning them out, I don't care what they were doing or saying, so that I could focus on what I was supposed to be doing.\n\nIt wasn't until I was in my 40s that I  was comfortable saying I actually don't care about those things. Being in your 40s is tremendously freeing. Also, having enough freedom and adult money to buy clothes that suit your body, live in a place of your choosing, surround yourself with like people at work, etc.\n\nHigh school sucked.",
   "created_utc": 1690329545,
   "score": 4,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg6mwj",
   "message": "My last two years were at a brutal place called the Elan School. Look it up. The reason for my hatred will be self evident.",
   "created_utc": 1690325817,
   "score": 12,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgg5b4",
   "message": "I was bullied and no one answered my cry for help.",
   "created_utc": 1690329820,
   "score": 8,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgjz0u",
   "message": "Bullies",
   "created_utc": 1690331483,
   "score": 12,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtglopv",
   "message": "Bullying. My high school did not take action to prevent or stop bullying, especially when it came to extracurricular activities or sports. It was ignored, and heads were turned.",
   "created_utc": 1690332225,
   "score": 9,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg8vkm",
   "message": "I actually love learning.\n\nHistory and science are amoung my favorite subjects. \nThe problem with my school was that it was a conservative southern Baptist run private school.\n\nReligion shoved down your throat all day, every day and also being blatantly lied to by young earth creationists is enough on its own. Add in that I was a depressed, neurodivergent teen who didn't buy into a word and you just get a miserable time.\n\nIt wasn't until after I graduated that I found my love for learning things again. I don't retain details well, but it's so much fun to read or listen to studies and documentaries about civilization and life that use actual science.",
   "created_utc": 1690326744,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg92au",
   "message": "I have eczema, and it's on my face. It started in middle school when I got an impetigo infection above my lip because of it, and only got worse.\n\nThat and my stalker.",
   "created_utc": 1690326822,
   "score": 5,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg9y6z",
   "message": "Switched schools a lot. Kids are dicks to new kids.",
   "created_utc": 1690327193,
   "score": 5,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgcft0",
   "message": "If I am going to be forced to do a bunch of meaningless bullshit, at least pay me to do it.",
   "created_utc": 1690328231,
   "score": 5,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgcgoa",
   "message": "Treated like complete shit by vast majority of my peers.",
   "created_utc": 1690328241,
   "score": 7,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgequ2",
   "message": "School started at 7:09. I had to wake up at 5:30 cause the bus came at 6:15. First class was swimming and it sucked ass doing laps when your sleepy",
   "created_utc": 1690329217,
   "score": 4,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgfgqg",
   "message": "It’s so indecisive. People are figuring themselves and others out and it’s very confusing. Everything is changing and in some aspects you’re treated like a child still but other aspects you’re expected to act like adults. There is often little to no actual guidance and the schools themselves generally don’t prepare you for the real world.",
   "created_utc": 1690329526,
   "score": 4,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgj77z",
   "message": "I couldn't understand most of my subjects and no one was helping me. Teachers got frustrated easily with me because often I couldn't understand the subject even after a 1v1 session or was weird on how/what I asked questions on/about. I had a Spanish teacher tell me I didn't need help because my grade \"didn't look like I needed help.\" My grade was being carried by how well I picked up reading in Spanish. I couldn't speak or write very well and wanted more help with that\n\nMy parents either didn't recognize or care that i needed help. My parents are divorced, so my dad didn't get a lot of insight into my life, and I kept some of it that way to not cause tension at my moms. My mother did not care and actively told me that she believed I'm just not trying my hardest and was lying to her when I told her I really was.\n\nI was also being heavily emotionally abused at home. I didn't have a lot of friends because I didn't know *how* to make friends because of being abused. I didn't know how to interact with people, which led to a lot of situations where people didn't want to be my friend and hated me",
   "created_utc": 1690331144,
   "score": 4,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgjj6s",
   "message": "I had body image issues and then a girl said I had man boobies. Mind you this was like 16-17 years ago but that shit still sticks with me.",
   "created_utc": 1690331290,
   "score": 6,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgjnej",
   "message": "I went to an all girls Catholic school in Northern New Jersey.",
   "created_utc": 1690331341,
   "score": 4,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgjv7z",
   "message": "Anxiety",
   "created_utc": 1690331436,
   "score": 4,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgl3xr",
   "message": "it was draining.",
   "created_utc": 1690331973,
   "score": 5,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg3l6f",
   "message": "I was the odd one out. I was that diseased kid(genetically speaking). I am/was socially impaired.",
   "created_utc": 1690324579,
   "score": 7,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg4foh",
   "message": "I wasn't interested in what was being taught.",
   "created_utc": 1690324924,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg88tx",
   "message": "The way my country education system works isn't suited teach people like me, dyslexics and such, infact its outdated fot everone, so I struggled alot. I don't know if I'll get into college let but I heard its better.",
   "created_utc": 1690326480,
   "score": 3,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg9fod",
   "message": "Homework Enough Said",
   "created_utc": 1690326979,
   "score": 4,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtga05u",
   "message": "High school was fine. Middle school was hell. Puberty fueled bullying and hallway fights on a daily basis",
   "created_utc": 1690327215,
   "score": 3,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtge49q",
   "message": "High school: Where we all start questioning if being a human is just a really elaborate game show.",
   "created_utc": 1690328951,
   "score": 4,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgeky3",
   "message": "The constant bullying I got for being emo",
   "created_utc": 1690329148,
   "score": 5,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtghuy9",
   "message": "I was bullied. I worked hard to graduate in 3 years instead of 4. I moved right after and haven’t looked back.",
   "created_utc": 1690330561,
   "score": 5,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgisca",
   "message": "I was awkward AF, no friends, and no love interests. It was a lonely time for sure.  College and adulthood is much better. 🥰",
   "created_utc": 1690330967,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgit59",
   "message": "Bullying",
   "created_utc": 1690330977,
   "score": 3,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgivkp",
   "message": "I was very shy to the point where other students would ask me if I even knew how to talk, because they had never heard me say anything. I had a small group of friends that were the only people I talked to. I didn't think I was pretty and I got teased a lot because I was so quiet.",
   "created_utc": 1690331005,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgjvne",
   "message": "Kids suck.",
   "created_utc": 1690331442,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgjy7c",
   "message": "It makes me want to kill myself even more than COVID ever could.",
   "created_utc": 1690331473,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgk4o6",
   "message": "Never fit in with anyone. I had a couple friends, I was super mature for my age and didn’t care about the same things as they did. I was a party girl, which most of the kids bullied me for and harassed me for calling me a variety of names that weren’t true- they all hit their party stage later in life and were train wrecks. Everyone was suuuper judgmental and I feel like the more mature part of me was that I wasn’t judgmental and minded my business.",
   "created_utc": 1690331551,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgk5li",
   "message": "Hated how it was all cliques and that you could lose the friends you grew up with because you weren't \"cool enough\" or didn't wear the right brands.\n\nConstant ridicule if you didn't fit in and didn't want to play sports.",
   "created_utc": 1690331562,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgk6ll",
   "message": "extroverts treating me like a pet because i was quiet. “awww she can talk!” “why are you so quite? you’re so cute, i didn’t know you could speak hahaha!” ffs it was infuriating. i wasn’t particularly shy in expression, i wasn’t meek, i was just quiet and i minded my own business. but i suppose when you’re a woman and you’re quiet, everybody assumes you’re insecure and afraid of everyone. it was annoying as hell.",
   "created_utc": 1690331575,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgk9o8",
   "message": "The students. Rich kids hung out with other rich kids, the poor with the poor. It was super divided, and it was very obvious. This was the same in middle school, too. \n\nExample: I was made fun of once for not having a \"real\" costume for Halloween. Half of it, I had to DIY because my parents couldn't buy all of us kids' new costumes every year.",
   "created_utc": 1690331613,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgkb57",
   "message": "PTSD from constant abuse.",
   "created_utc": 1690331630,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgkdn0",
   "message": "Did anyone really like highschool? Shit was just a judgement fest. I was not close to the in crowd but other than them who actually liked it? Highschool is weird and awkward. My life really took off after highschool. Most people's do. It's kind of an afterthought not something I hated.",
   "created_utc": 1690331661,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgkvbk",
   "message": "Teachers were worthless drones clock-watching for retirement who hated their jobs. Learned more independently than I ever did in class. Bored out of my mind in class. Barely showed up and got straight A’s. What does that say about the quality of the education there?",
   "created_utc": 1690331869,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtglpjr",
   "message": "Didn’t hate high school. But ask me about elementary and middle school, which was like being locked in a cage full of baboons. They started to transform into draft versions of human beings while in high school.",
   "created_utc": 1690332235,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgm4vf",
   "message": "It felt like wasted time for me. I rarely learned anything new or anything I was actually going to use in life. I had straight A's with minimal effort and was bored",
   "created_utc": 1690332428,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgn6lc",
   "message": "Gay kid in the 1980s. I think that should give you an idea.",
   "created_utc": 1690332908,
   "score": 3,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgp1pq",
   "message": "Useless ass garbage information, Filled to the brim with pieces of shit who think they're superior to everyone, asswipe teachers who feel the need to give homework everyday. I could go on and on. You gotta love the \"popular kids\" who go on power trips just because they can.",
   "created_utc": 1690333778,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgplyl",
   "message": "I was black in a racist town",
   "created_utc": 1690334031,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgpqj4",
   "message": "Finding this out as an adult. I have adhd and possibly am on the autism spectrum, I can't say that High-school was exactly set up for my success.\n\nEdit: grammar",
   "created_utc": 1690334087,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgqjw9",
   "message": "I'm suspicious of people who *didn't* hate high school",
   "created_utc": 1690334442,
   "score": 4,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgqo0u",
   "message": "Those days went by fast, a pretty empty existence\nAdolescence has its vices, very young, I was tired of living. \n\nBut Iam good now",
   "created_utc": 1690334493,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgqtoc",
   "message": "When I was in middle school I read everything about columbine and it literally traumatized me. I could barely stay in school and eventually dropped out because the anxiety of being at school was too much. dropping out is still my biggest regret though",
   "created_utc": 1690334562,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgrx58",
   "message": "It was obvious that the administration only cared about attendance and test scores for school funding. On top of that I hung out with the wrong crowd and we would rather ditch than attend school.",
   "created_utc": 1690335049,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgzmfv",
   "message": "Have you been to high school?",
   "created_utc": 1690338680,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jth058c",
   "message": "\nThe people. Students and teachers",
   "created_utc": 1690338944,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jth2s59",
   "message": "Racist teachers and school system",
   "created_utc": 1690340291,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jth2sij",
   "message": "I was poor and socially awkward so some people made my a living hell.",
   "created_utc": 1690340296,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtglvh1",
   "message": "It’s a popularity contest and administration really doesn’t do anything to handle legitimate problems. \n\nAnd the power trip that teachers had was insane. \n\nThe fact you have to be up at the crack of dawn, and if you’re even a second late to any class they mark you tardy, some even lock you out of the classroom, yet refuse to let you leave when the bell rings if they’re still talking, making you late to your next class, even though they all know when classes end and begin and could have planned accordingly to be done on time, yet have the audacity to tell us to plan better. You can’t even use the bathroom without them insisting you should’ve just done it in the brief time between classes. Hell i had a teacher get mad cause someone yawned once. Like we are humans, we’re allowed to be tired, not everything is a personal attack on you. The whole thing is just so weird. They go on and on about how college and future jobs won’t let you do xyz, and yet somehow, college and future jobs never cared about xyz. And i remember them making us have silent lunches for being too loud in the cafeteria, yet lunch time is the only time we were ever allowed to have a break and talk/interact with friends in a way that wasn’t academic related. \n\nThe hours of homework they pile on after having already been in class the entire day. Like to the point people would get so overwhelmed they’d have breakdowns cause it was just so much. \n\nAnd i say this as a student who never skipped classes, was rarely late, rarely caused problems, always completed my homework, and contributed to classes.",
   "created_utc": 1690332310,
   "score": 4,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg3kef",
   "message": "I went to a high school with 3 schools on one campus, and you walk between all 3. About 6500 kids. \n\nIt was just wayyyyy too much.",
   "created_utc": 1690324570,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg64k5",
   "message": "I never fit in. I didn’t do sports, I didn’t care for extracurriculars, best I could do was band and even then, I played guitar so it’s not like I belonged. My high school was filled with druggie drunks and whores. Nasty people.",
   "created_utc": 1690325609,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgdcvp",
   "message": "You always had to fit in somewhere. From friend groups, clubs, sports, and even class, everything felt so fake, as if we were all collectively trying to be the same person. There really wasn't a sense of identity or uniqueness. That's why I like college more. Freedom to self-identify yourself without having a need to \"fit-in\" or be like anyone.",
   "created_utc": 1690328626,
   "score": 2,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgjqzc",
   "message": "There was too much of the over-pronouns (idc if ur a she/he/they, but I’m not getting down on ur bullshit if ur going by the name of “Grass” and your pronouns are “green/green-self” - or there were a shit ton of overly religious people who judged regular people, I hated that",
   "created_utc": 1690331385,
   "score": 0,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg61di",
   "message": "I went to a bad school. My district had both the richest and poorest areas and they closed the poor school and bused the students from that area to the other 4 schools. We had a lot of classist tensions. The movie “Dangerous Minds” was based on my school and then President Clinton spoke on campus about the violence at the time. We even had a huge race riot. It was really sad that this was in an upscale suburb in one of the most expensive places in the country",
   "created_utc": 1690325574,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg7s94",
   "message": "Constant daily harassment and physical bullying, teachers and staff who didn't gaf, having to repeat multiple classes I already passed cause no one cared to listen to me. It was worthless and shitty.",
   "created_utc": 1690326289,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg8ag2",
   "message": "I didn’t mind it too much until junior year when I became a target for a mean girl and her posse. When I finally stood up to her she went crying to the principal and I was the one who got in trouble.",
   "created_utc": 1690326499,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtg9yxh",
   "message": "Loved my teachers was hated by the administration and in return hated them right back\n\nTeachers found out that if I got sent to the office again I would be permanently expelled so they banded together and would kick me out into the hallway (sooooooooo damn boring) \n\nThe reason they loved me is they’d ask a question and if no one had an answer I would give a deliberately long and thorough answer \n\nI was an intelligent long haired hippy biker freak nice to classmates annoying to teachers and an absolute headache to the administrators",
   "created_utc": 1690327201,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgblaj",
   "message": "Bad parenting, lots of hormones, got sent to a different school than ALL of my friends, and finally we were a poor and struggling family, but because we were getting some $ from my dads death, my mom decided to send me to a private catholic high school surrounded by privileged sparrow farts. Also, I’m not catholic and I never was.\n\nIs it normal for kids to graduate having never taken the SAT’s? Cause I got out of high school that way. The idea of a private school is they are supposed to give kids more attention. Well, that’s bullshit.\n\nObligatory, this is not the fault of teachers. Teachers are absolute heroes.",
   "created_utc": 1690327874,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgc25a",
   "message": "Abusive boyfriend. Lack of friends.",
   "created_utc": 1690328071,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgcgbr",
   "message": "I just really hated being inside for 8hrs a day.",
   "created_utc": 1690328238,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgciq4",
   "message": "Bored",
   "created_utc": 1690328265,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgcmrj",
   "message": "Im still in highschool but i hated it because of the people and the teachers. The school food as well.",
   "created_utc": 1690328314,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgd1ff",
   "message": "I felt like I didn't belong",
   "created_utc": 1690328489,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgdqik",
   "message": "KIds were incredibly mean, teachers had zero passion for their work so it was really stressful but also boring intellectually.   I also had to walk 20 minutes to get there, so winters were awful.",
   "created_utc": 1690328788,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtge2mn",
   "message": "It was incredibly boring and I knew I would use virtually nothing I learned from it.  I think 8th grade was probably the last useful year of education and that might be a stretch.",
   "created_utc": 1690328932,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtge34q",
   "message": "Hated it when I was there. Miss it now im gone.",
   "created_utc": 1690328938,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgeetr",
   "message": "I was outed as gay shortly before going to high school which made everyone avoid me like the plague and my grades suffered greatly as a result.\n\nSo yeah, don't miss those years.",
   "created_utc": 1690329076,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgfhr9",
   "message": "It was so boring, I just wanted to eat and play games.\n\nI learned more online than I ever did in Highschool lol",
   "created_utc": 1690329538,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgfkd2",
   "message": "In 9th grade (which was then the first year of high school), I was the smallest kid in the entire school. There was one other girl who was tiny. The other students would do things like make us stand together. One girl even brought a camera once and made us stand there so she could take pictures. \n\nWhen I say \"made us\" I meant she would order us to stand together and used the football players to enforce it.",
   "created_utc": 1690329570,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgfsjo",
   "message": "I was fat an in orchestra. I also grew up in an area full of conservative rednecks, and was friends with members of the alphabet mafia, so I always had a target on my back.",
   "created_utc": 1690329669,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgg4il",
   "message": "None of the elective classes interested me, we were packed in our classrooms like sardines (doesn't help with social anxiety), it was a semi-rich school so being poor automatically made me an outcast, and the food was just edible enough to not give you food poisoning. I swear they crafted that down to a science to make the food as bad as it was but without making kids sick. Hats off to the chefs.",
   "created_utc": 1690329811,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgggw5",
   "message": "I was deemed weird and the teachers, people, and curriculum were shit. I am in 11th grade now, but I am getting homeschooled so yeah. Just a bunch of a mean losers and I am not one of them.",
   "created_utc": 1690329960,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtggi28",
   "message": "my first high school (9th, most of 10th) was great. most folks had people they'd known since grade school, the teachers were decent, etc. we moved, and my second high school was full of bush era \"america, love it or leave it\" upstate rednecks. i hadn't really experienced overt antisemitism until then and suddenly had teachers and coaches encouraging other students to otherize me because we didn't go to their evangelical church. \"i know it's jewish but we're having a pop quiz\" is the teacher's quote from high school that's always gonna stick with me.",
   "created_utc": 1690329974,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtggimy",
   "message": "I was a nerdy, socially awkward kid with zero fashion sense at an affluent, snobbish high school in the late 80s.  These days it's OK in most places to be a nerd, but back then it was a social death sentence.  I was continually ostracized, bullied, called \"loser\" and worse.  All I wanted was to be accepted, but there was very little acceptance to be had.  It sucked.  If I hadn't had band, I wouldn't have made it through.",
   "created_utc": 1690329981,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtggj4g",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtggm6f",
   "message": "I spent my weekends latchhooking pillow fronts because I was always grounded. My mother randomly pulled me around by my hair. So…yeah…",
   "created_utc": 1690330024,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgh62k",
   "message": "I'm honestly wart of anyone who actually like high school.",
   "created_utc": 1690330261,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgh8uo",
   "message": "I was going through puberty, learning how to function socially as an introvert, and was expected to retain \u0026amp; interpret large amounts of information while being told to figure out what I wanted to do for the rest of my life. College was much better for me - academically and personally.",
   "created_utc": 1690330295,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtghbav",
   "message": "Hate as in never attended? World of Warcraft, underage drinking, drugs, and girls. \n\nNo particular reason to hate it as it was a great school had many friends but we just preferred to get drunk than academics",
   "created_utc": 1690330325,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtghj6k",
   "message": "The mundaneness of being around the same people for 12 years got real tiresome.",
   "created_utc": 1690330419,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgi1ui",
   "message": "It was boring as fuck. Never provided a challenge and I was just wasting my time jumping through hoops.\n\nI'm no genius, but I really didn't need to be there.\n\nOn top of that, no one has every asked to see my high school or college degree for work, not even once.",
   "created_utc": 1690330646,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgiel4",
   "message": "First 3 years were great. Then senior year, two trusted teachers and a principal bullied my teacher into having a suicidal nervous breakdown and going on medical leave. Then they went behind my back to try to torpedo a show I was directing. Really rough, man.",
   "created_utc": 1690330801,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgiw7x",
   "message": "I found high school to be boring as hell.  I had some good friends, but I pretty much stopped talking to them as soon as high school ended which demonstrates to me that our relationship was more about convenience. \n\nIn comparison, I'm still very high friends with a lot of people from college and it's been almost 20 years since I graduated.",
   "created_utc": 1690331013,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgizew",
   "message": "My parents spent all their monthly income on an apartment in one of the most desirable zip codes in the country so they could pretend to be upper class, while commuting to towns where we could have had a decent life (reason: racism). All my classmates had parents who gave a shit about them, took them to the doctor and dentist, bought them clothes that fit. Some of my closest friends in elementary school lived in literal mansions.\n\nShort answer: trust fund bullies",
   "created_utc": 1690331051,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgizgo",
   "message": "1) it was run mostly by idiots, there were only a few compassionate teachers  \n2) I was in a school that was bigoted against my people, culture, and religion  \n3) it was a machine designed to make good little conformists",
   "created_utc": 1690331052,
   "score": 1,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jtgiziq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159mtlj"
  },
  {
   "comment_id": "jthltg1",
   "message": "depression lol",
   "created_utc": 1690351290,
   "score": 0,
   "submission_id": "159mtlj"
  }
 ]
}