{
 "submission_id": "159p5kk",
 "title": "Bisexual people of reddit: What are some noticeable differences between dating men and women?",
 "selftext": "",
 "created_utc": 1690328428,
 "permalink": "/r/AskReddit/comments/159p5kk/bisexual_people_of_reddit_what_are_some/",
 "score": 105,
 "url": "https://www.reddit.com/r/AskReddit/comments/159p5kk/bisexual_people_of_reddit_what_are_some/",
 "comments": [
  {
   "comment_id": "jtguc9z",
   "message": "Men are so sexually aggressive I have a three date no sex rule because I need to see how they respond to that. If I tell them up front my rule and they push for sex those three dates, I know they're gonna be a sex pest. I orgasm with women more, they are more focused on giving pleasure and taking the P in V off the table makes it soooo different and generally better. \n\nWomen are difficult to communicate with. They can be very indirect, they have a tendency to let problems build up until they're almost impossible to solve, and they have higher expectations. It's socially easier with men because they are more go with the flow. \n\nBiphobia manifests as the automatic demand for a threesome with men. It's far worse with women. I've heard the most toxic, slut shaming, misogynistic crap come out of gold star lesbians mouths.",
   "created_utc": 1690336146,
   "score": 82,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth4w0i",
   "message": "Overall:\n\nFor me the women have been more... and I hate to use this word but it's appropriate... clingy but at the same time they tend to communicate with poetry and limericks and riddles and shit. \n\nMen tend to be more... nonchalant while at the same time... needy. \n\nSex wise: \n\nWomen are more intimate and passionate and fuck like they are in love with you. \n\nMen are more rough and passionate and fuck like it's the last nut they'll ever bust. \n\n\nUgh. Love 'em.",
   "created_utc": 1690341396,
   "score": 241,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgdkfb",
   "message": "With women you have to find one who doesn't have all these insecurities that get in the way of enjoying life \n\nWith men you have to find one who cleans their asshole properly",
   "created_utc": 1690328714,
   "score": 71,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth0m34",
   "message": "this might be a me problem, but i find it incredibly hard to discern whether a girl is flirting with me or just being friendly. i worry a lot about coming off as creepy and i’m very afraid to misinterpret. i wish i could just confidently approach cute girls, but i’m always afraid they’ll be straight and mortified. that said, it is fun to compliment girls. but i’m always afraid of misinterpreting. \n\nwith men, i don’t have that fear because i reap the benefits of social norms. i find flirting with men to be much more natural as a result. but i’m attracted to so few and far between when it comes to men that i barely do it. i am incredibly selective, whereas i find many, many women attractive. this factor made me think i was a lesbian for a long time because my attraction to men is so incidental. but i still very much am bi. \n\npersonalities i like vary across gender, too. i like girls who are extroverted and more social than me. i tend to be into men who aren’t quiet per se, but don’t feel the need to be the center of attention. i like sweet, gentle men and women who would naturally draw me out of my shell. i also feel that my attraction to women is very superficial, whereas my attraction to men seems to be fueled by personality predominantly. it seems like i’m into a very specific personality type with men. \n\nbiphobia has been a particular torture for me, especially internally. i’ve gone back and forth that i’m straight or gay countless times, but the truth is, my attraction transcends gender. i’ve been like this my entire life. i would stare at pictures of aaron carter and hilary duff. i would get crushes on my boy and girl classmates in elementary school. i used to wish i was one or the other, but these days i feel very lucky to experience life like this.",
   "created_utc": 1690339180,
   "score": 123,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgoeze",
   "message": "A bisexual friend raved about how incredibly low the bar is with most women for being The Most Awesome Person They've Ever Dated. The expectations of women who've only dated straight men are insanely low.",
   "created_utc": 1690333485,
   "score": 137,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth3yf3",
   "message": "Men in my experience reply more, and even meet up for dates more ofter.",
   "created_utc": 1690340924,
   "score": 31,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgeund",
   "message": "Women smell better, usually",
   "created_utc": 1690329262,
   "score": 60,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgjw2y",
   "message": "I'm biSEXUAL. I don't date men. I have sex with them. I date women.",
   "created_utc": 1690331447,
   "score": 77,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgdecu",
   "message": "They're both equally hard to handle\nJust gave up at this point lol",
   "created_utc": 1690328644,
   "score": 56,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth1gqv",
   "message": "I only dated women at first. I was never insecure about my body until i had started to date men. I was never insecure about my boobs until I had dated a man. Every man I've dated has made a negative comment on my appearance while women don't do the same things. Men care more about how their partner looks than women do in general.",
   "created_utc": 1690339612,
   "score": 55,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgme6j",
   "message": "Men has a penis and girls has a potina.",
   "created_utc": 1690332548,
   "score": 32,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth2n1y",
   "message": "boobies/no boobies",
   "created_utc": 1690340215,
   "score": 19,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth1xox",
   "message": "I only hook up with girls, but will date guys.",
   "created_utc": 1690339843,
   "score": 9,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgkva7",
   "message": " Penus",
   "created_utc": 1690331869,
   "score": 246,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgdd2r",
   "message": "Been more open with my wife",
   "created_utc": 1690328628,
   "score": 247,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth88d0",
   "message": "Boys have a penis, girls have a vagina.",
   "created_utc": 1690343060,
   "score": 251,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth65k4",
   "message": "The penis",
   "created_utc": 1690342014,
   "score": 244,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthcjpk",
   "message": "Penis.",
   "created_utc": 1690345414,
   "score": 246,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthmpxv",
   "message": "Bi dude here.\n\nGay dudes don't give a fuck if I'm Bi.\n\n60% of girls are super uncomfortable with it and don't really understand what being Bi is. 20% are into it but like weirdly so, and the rest are cool normal humans about it.\n\nThat's just my experience.",
   "created_utc": 1690351934,
   "score": 84,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthgtyh",
   "message": "For me personally, the men I’ve dated weren’t very good at taking care of themselves (housework/chores/etc.). Maybe it’s just my poor luck with men, but it seems like there’s a large number of them who just don’t know how to function, and I always end up with one. Don’t get me wrong, some of them were great guys, and I still talk to a few of them as friends, but it’s exhausting having to act as a second mother of sorts. \n\nAs far as women go, I did have better luck across the board (taking care of themselves, communication, etc.), although my exes and I parted ways on a mutual basis for various reasons (wanted different things in life, things just didn’t work out, all that jazz). The most difficult part though was figuring out whether or not we were flirting or just being friends. It took about a year for my very first gf to figure out that I liked her, and even then, I had to outright say it for her to believe me!",
   "created_utc": 1690347988,
   "score": 81,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthj1mh",
   "message": "In bed, I would not expect a woman to just kiss me for a few seconds and then try to shove, say, her hand into my foof.",
   "created_utc": 1690349417,
   "score": 28,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthostv",
   "message": "(As a man) I have more in common with the dudes typically (taste in media, sense of humor, hobbies, etc), but women are prettier and tend to be more emotionally “in-tune” (for better or worse lmao). I appreciate both obviously. With a dude it feels more like a good friend that I have the bonus of being romantic with. With women it’s more like the romantic aspects of the relationship are front stage (which carries its own merit), and we may not have as much in common in terms of what we’re doing when not on dates/fucking/etc, but makes up for that in different ways.\n\nImportant to note that your mileage may vary. I’m not the most experienced person in the world, but this is just what I’ve observed so far…\n\nAlso (as others have said) men tend to be more forward and there’s far less ambiguity. They will tell you if upset, etc (and I know, “not ALL women”, but it’s a trope for a reason imo having experienced both)",
   "created_utc": 1690353446,
   "score": 13,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthuipy",
   "message": "Women are super cagey at first and then fiercely possessive. Guys are super nonchalant at first and then get kinda needy",
   "created_utc": 1690357806,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthm3rw",
   "message": "Sounds like a wild rollercoaster of love and nut-busting adventures!",
   "created_utc": 1690351496,
   "score": 2,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthj81s",
   "message": "For starters, the men aren’t women and the women aren’t men. I think that’s quite a large difference",
   "created_utc": 1690349534,
   "score": 248,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthk08h",
   "message": " P pp p",
   "created_utc": 1690350047,
   "score": 251,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthp663",
   "message": "Honestly in my experience it’s pretty much the same, just that it’s different due to the different partner",
   "created_utc": 1690353719,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthwi9y",
   "message": "Lesbian relationships can be very fast paced and toxic",
   "created_utc": 1690359364,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthxd2n",
   "message": "Dating men is a pain in the ass ;)",
   "created_utc": 1690360033,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthxhik",
   "message": "Women are more emotionally in-tune. They pick up on stuff guys don't. It's pretty great most of the time but can be frustrating. Also they are prettier. \nMen get jealous more often which is good in a healthy amount because it makes me feel wanted but excessive jealousy is rly annoying.",
   "created_utc": 1690360134,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthxhrm",
   "message": "Being bisexual Is like picking icecream: there Is chocolate and there Is strawberry Watch one has it's goods",
   "created_utc": 1690360139,
   "score": 1,
   "submission_id": "159p5kk"
  }
 ]
}