{
 "submission_id": "159p5kk",
 "title": "Bisexual people of reddit: What are some noticeable differences between dating men and women?",
 "selftext": "",
 "created_utc": 1690328428,
 "permalink": "/r/AskReddit/comments/159p5kk/bisexual_people_of_reddit_what_are_some/",
 "score": 42,
 "url": "https://www.reddit.com/r/AskReddit/comments/159p5kk/bisexual_people_of_reddit_what_are_some/",
 "comments": [
  {
   "comment_id": "jtguc9z",
   "message": "Men are so sexually aggressive I have a three date no sex rule because I need to see how they respond to that. If I tell them up front my rule and they push for sex those three dates, I know they're gonna be a sex pest. I orgasm with women more, they are more focused on giving pleasure and taking the P in V off the table makes it soooo different and generally better. \n\nWomen are difficult to communicate with. They can be very indirect, they have a tendency to let problems build up until they're almost impossible to solve, and they have higher expectations. It's socially easier with men because they are more go with the flow. \n\nBiphobia manifests as the automatic demand for a threesome with men. It's far worse with women. I've heard the most toxic, slut shaming, misogynistic crap come out of gold star lesbians mouths.",
   "created_utc": 1690336146,
   "score": 78,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgdkfb",
   "message": "With women you have to find one who doesn't have all these insecurities that get in the way of enjoying life \n\nWith men you have to find one who cleans their asshole properly",
   "created_utc": 1690328714,
   "score": 64,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgoeze",
   "message": "A bisexual friend raved about how incredibly low the bar is with most women for being The Most Awesome Person They've Ever Dated. The expectations of women who've only dated straight men are insanely low.",
   "created_utc": 1690333485,
   "score": 27,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth0m34",
   "message": "this might be a me problem, but i find it incredibly hard to discern whether a girl is flirting with me or just being friendly. i worry a lot about coming off as creepy and i’m very afraid to misinterpret. i wish i could just confidently approach cute girls, but i’m always afraid they’ll be straight and mortified. that said, it is fun to compliment girls. but i’m always afraid of misinterpreting. \n\nwith men, i don’t have that fear because i reap the benefits of social norms. i find flirting with men to be much more natural as a result. but i’m attracted to so few and far between when it comes to men that i barely do it. i am incredibly selective, whereas i find many, many women attractive. this factor made me think i was a lesbian for a long time because my attraction to men is so incidental. but i still very much am bi. \n\npersonalities i like vary across gender, too. i like girls who are extroverted and more social than me. i tend to be into men who aren’t quiet per se, but don’t feel the need to be the center of attention. i like sweet, gentle men and women who would naturally draw me out of my shell. i also feel that my attraction to women is very superficial, whereas my attraction to men seems to be fueled by personality predominantly. it seems like i’m into a very specific personality type with men. \n\nbiphobia has been a particular torture for me, especially internally. i’ve gone back and forth that i’m straight or gay countless times, but the truth is, my attraction transcends gender. i’ve been like this my entire life. i would stare at pictures of aaron carter and hilary duff. i would get crushes on my boy and girl classmates in elementary school. i used to wish i was one or the other, but these days i feel very lucky to experience life like this.",
   "created_utc": 1690339180,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgeund",
   "message": "Women smell better, usually",
   "created_utc": 1690329262,
   "score": 17,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth4w0i",
   "message": "Overall:\n\nFor me the women have been more... and I hate to use this word but it's appropriate... clingy but at the same time they tend to communicate with poetry and limericks and riddles and shit. \n\nMen tend to be more... nonchalant while at the same time... needy. \n\nSex wise: \n\nWomen are more intimate and passionate and fuck like they are in love with you. \n\nMen are more rough and passionate and fuck like it's the last nut they'll ever bust. \n\n\nUgh. Love 'em.",
   "created_utc": 1690341396,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgjw2y",
   "message": "I'm biSEXUAL. I don't date men. I have sex with them. I date women.",
   "created_utc": 1690331447,
   "score": 20,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgdecu",
   "message": "They're both equally hard to handle\nJust gave up at this point lol",
   "created_utc": 1690328644,
   "score": 9,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth3yf3",
   "message": "Men in my experience reply more, and even meet up for dates more ofter.",
   "created_utc": 1690340924,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth1gqv",
   "message": "I only dated women at first. I was never insecure about my body until i had started to date men. I was never insecure about my boobs until I had dated a man. Every man I've dated has made a negative comment on my appearance while women don't do the same things. Men care more about how their partner looks than women do in general.",
   "created_utc": 1690339612,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgme6j",
   "message": "Men has a penis and girls has a potina.",
   "created_utc": 1690332548,
   "score": 10,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth2n1y",
   "message": "boobies/no boobies",
   "created_utc": 1690340215,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgkva7",
   "message": " Penus",
   "created_utc": 1690331869,
   "score": 3,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgdd2r",
   "message": "Been more open with my wife",
   "created_utc": 1690328628,
   "score": 255,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth1xox",
   "message": "I only hook up with girls, but will date guys.",
   "created_utc": 1690339843,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth65k4",
   "message": "The penis",
   "created_utc": 1690342014,
   "score": 1,
   "submission_id": "159p5kk"
  }
 ]
}