{
 "submission_id": "159q08t",
 "title": "[NSFW] People who knew someone who died at work, what happened?",
 "selftext": "",
 "created_utc": 1690330527,
 "permalink": "/r/AskReddit/comments/159q08t/nsfw_people_who_knew_someone_who_died_at_work/",
 "score": 84,
 "url": "https://www.reddit.com/r/AskReddit/comments/159q08t/nsfw_people_who_knew_someone_who_died_at_work/",
 "comments": [
  {
   "comment_id": "jtgpod5",
   "message": "He came in to work, sat down at a table in the cafeteria, said he was tired, put his head down on his arms, and died. It was completely unexpected and it shocked everyone.",
   "created_utc": 1690334061,
   "score": 184,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgt1fo",
   "message": "Dude was hanging out in the break room cracking jokes. Laughed, fell over and was dead. Brain aneurysm. It’s terrifying how fragile our lives are and how quickly it can end without warning. Might be a blessing as well though",
   "created_utc": 1690335547,
   "score": 176,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgi56d",
   "message": "He was an older guy and wasn't feeling well and went to use the portapotty. Ended up having a heart attack and passing while on the can. He was treasured in the workplace, and it was a big loss.",
   "created_utc": 1690330688,
   "score": 82,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgsadh",
   "message": "A student. He was chewing on a cap to something while walking in the hallway. Ended up choking and  died.",
   "created_utc": 1690335212,
   "score": 156,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgi96s",
   "message": "My employee.  They were my go to person, a friend, and we chatted constantly even after we transitioned to work from home.  Working late one night we were chatting on slack while working and he disappeared.  Two hours later his phone text me and stated \"this is xxxx's fiance,  I found him on the keyboard and he's dead.  He won't be into work tomorrow.  Please call me at xxxxxxxxx\". \n\nI'm privileged not to deal with people in shock in my profession.  That was heart breaking and sobering.  Ill miss him.",
   "created_utc": 1690330736,
   "score": 225,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgtsju",
   "message": "It wasn't AT work, but I worked for CNET when James Kim died while on holiday. He was returning home with his family from Thanksgiving and got caught in a snowstorm. The map he was using led him down a very remote road where his car was stranded. After a few days of holding out, James went out on his own in search for help. He died, but his family was eventually rescued.\n\nThe annual holiday party was appropriately cancelled, and the mood int he office was pretty somber in the weeks to follow.",
   "created_utc": 1690335887,
   "score": 143,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgnp8r",
   "message": "My first hire as a manager, and it was his first job out of college.  I was away on a business trip, he was heading into work one morning and had an asthma attack and died on the platform.  I had only known him a few weeks.  I went to the funeral, met his family and actually am still in touch w one of his uncles. Sad for me, but of course nothing like what his family went through.",
   "created_utc": 1690333150,
   "score": 74,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgu0ih",
   "message": "Guy had the crown of his head sliced clean off when a hydraulic press suddenly decided to drop because they forgot to bleed the pressure before starting to do maintenance on the machine.",
   "created_utc": 1690335990,
   "score": 84,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgi4yi",
   "message": "A buddy of mine worked at a FedEx warehouse and ran over a coworker with a forklift and killed him. It was ruled no-fault and he (the driver) kept working there afterwards",
   "created_utc": 1690330685,
   "score": 250,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgrsu7",
   "message": "A manager got fired, after HRs kid made up some lies about him, went to the parking lot, blew his brains out with a gun.",
   "created_utc": 1690334997,
   "score": 64,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgv62e",
   "message": "Got 2 of them.\nOne was a coworker. Shot by some punk who thought we weren't serious about our job. Private security contracting. Neither of them made it.\n\nThe other was a random homeless woman. I was working on a city security contract. Cheap, observe, and report, mall cop type stuff. Shift was ending, and I was headed back to the city office when I noticed something rather strange. A sleeping bag in the middle of the alleyway. Didn't think anything of it, so I went inside. Garbage truck came through while I was. Didn't put 2 and 2 together till I walked outside and smelled it. Garbage truck ran the sleeping bag over with a drug addict inside. Former teacher from what I read later.",
   "created_utc": 1690336538,
   "score": 159,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgout2",
   "message": "His managers were told several times he shouldn't be on the ladder at work because he was older/unstable. They didn't give much of a shit, so they kept putting him in a role where he had to use the ladder in order to work. He slipped and brained himself on the concrete. But they dedicated a bench outside to him!!!",
   "created_utc": 1690333689,
   "score": 234,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgikgp",
   "message": "Started my current job about 6 years ago. Was going to head down to Austin to meet one of my colleagues down there and do some brainstorming and activity planning. Was supposed to meet in hotel lobby and he never shows. Email and calls go unanswered. Send my boss in NYC a message like WTF. Few hours later his daughters found him dead.",
   "created_utc": 1690330872,
   "score": 159,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgs3e2",
   "message": "It was an older maintenance man, and he always into our boiler room at work to have a smoke before he went home. \n\nWe think he had a massive heart attack, because a half smoked cigarette was found under his body when they found him, five hours after he was supposed to have gone home.\n\n\u0026amp;#x200B;\n\nThen there was the 30 year old guy who stuck his hand in a machine to clear some scrap out of the way, and got his arm pulled off and bleed to death, that was real bad, real, real bad.",
   "created_utc": 1690335127,
   "score": 230,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgnnu0",
   "message": "One time I was eating a wiener schnitzel in the food court of a skyscraper when a guy came crashing through the glass ceiling having jumped a window high above. But I was on break, so it probably doesnt count.",
   "created_utc": 1690333132,
   "score": 252,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgw0yt",
   "message": "We had a mainframe operator who worked weekends exclusively. One weekend payroll had not received their reports. The payroll manager called into the operations room and got no answer.\n\nShe called the lead operator. He tried to check the cameras in the room but they were all turned in non normal positions and locked from turning via the remote software. He couldn't see anything.\n\nHe drove in to the office. When he got there he found the small windows on the big steel doors papered over. He opened the door and found the operator. He was hung from a attic truss. He was completely naked. His clothes were folded neatly on the floor next to him. There was a laptop on wheeled cart in front of his dead body.\n\nHe was getting himself off and I guessed just misjudged his tolerance, passed out and then never woke up.\n\nThere's been some shocking stuff that's happened on our campus (affairs, verbal and pretty near physical altercations etc) but nothing has tried this in the 22 years I've been there",
   "created_utc": 1690336945,
   "score": 50,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgpq4m",
   "message": "Used to work at amazon. There was someone who got their hair caught in a conveyor belt and was scalped.",
   "created_utc": 1690334082,
   "score": 142,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgynux",
   "message": "Brand new father.  Picked up by an Uber and left the parking lot when they were broadsided by a drunk driver - both Uber driver and new father were killed instantly.  Drunk driver was a local fireman and didn’t attempt to render aid.",
   "created_utc": 1690338206,
   "score": 153,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgsfy7",
   "message": "He drove someone across the street to get gas in a gas can to put in her car after work. Thieves pulled a gun in an attempted robbery and shot him. Aaron was a good guy, and his life shouldn't have been taken.",
   "created_utc": 1690335281,
   "score": 111,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgu34d",
   "message": "she was our cleaner, i was sick at home on the last day she was there and apparently she was asking why i wasn't there. she killed herself when she got back home... we weren't that amazingly close but we all used to say she was like the mom of our company",
   "created_utc": 1690336023,
   "score": 254,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgya3o",
   "message": "Everyone has a gruesome story.  Mine is simple.  Went to Safeway deli with a co worker.   He was early 30s I was Early 20s.   He dropped while walking.  like a light switch went off.  Right in the door.  Brain aneurysm.  \n\nI only knew him about 9 months but it was shocking.  Most store patrons got to him before me.  People calling 911.   We all knew he was dead and the EMT confirmed it.  \n\nWe weren't best friends but he seemed like a good dude.  Definitely didn't deserve that.  That was ten years ago so I'm about his age.   But after learning about aneurysms it is quite rare.",
   "created_utc": 1690338021,
   "score": 166,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgmdcs",
   "message": "I actually found him.  I was at work in the bathroom going to poop. He's in the stall next to me. I recognized his boots.  Said wussup. No reply. No biggie.  Ten minutes later I finish and I see he hasn't moved but his phone is on the floor and his arm is just hanging. I call out to him.  Nothing.  Look over the wall and see him slumped.  Scream for someone to call 9-11 and we break the stall door and get him out. Try to perform CPR on him. Ambulance arrives. They take over with defibrillators but it was too late.  Massive heart attack was the result.  A shame too.  Only 51 years old and a great guy.",
   "created_utc": 1690332538,
   "score": 229,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgkq14",
   "message": "Two guys. One OD'ed and the other managed to ground himself and arced.",
   "created_utc": 1690331808,
   "score": 188,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgv8lk",
   "message": "My husband had a hemorrhagic stroke while we were at work. I clocked in a wife, and clocked out a widow.",
   "created_utc": 1690336572,
   "score": 184,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth005t",
   "message": "I was locking up at the end of the day and saw brake lights flashing on the car of our welder while I was pulling out. I pulled back in to see if everything was ok. He was in the midst of heart attack. Ambulance was there in three minutes, but I watched him fade away in my arms before they arrived. He was a good man and is sorely missed.",
   "created_utc": 1690338872,
   "score": 176,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgzcyv",
   "message": "Buddy of mine worked for a sewage company - he went down a narrow shaft to do maintenance and the fumes overwhelmed him and he passed out and fell down the shaft and died from the trauma.  He had a wife and young daughter.  He was legit a top 1% human and it hurts still 15 years later.",
   "created_utc": 1690338549,
   "score": 164,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgtyw2",
   "message": "Ok so may 5th of this year my bosses ex walked in and shot her and turned the gun on himself. Two weeks prior she was kidnapped by him at work also. \n\nThey gave us a week off with pay but immediately brought in new management and started to increase our work load. Not immediately but pretty close. \n\nThey did bring in grief counselors and offered free counseling through them. But as far as security and making us feel safer they did nothing. They even threatened our wages if we wanted safety.",
   "created_utc": 1690335969,
   "score": 102,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgz1fj",
   "message": "Iraq 2011 about 5 am just as the sun was about to be coming up our incoming alarm went off late as some rockets went under our radar zone, so we had a couple explode before the mortars came in and tripped it, guy I knew opened the door to his chu(like a little living quarters that had 1 maybe 2 people in it) he made it one step before a mortar landed at his feet. He was blown in half, nothing from the waist down. He was still alive and in shock. Me and a couple others ran over and got em loaded into a vehicle to get sent to the medics tent just across our base. He didn't make it and since I was one of the people that helped load em up and I already seen everything unfold in a series of slow motion frames I was part of the detail to clean up what was left of him and his belongings. It was a rough day and I was 19",
   "created_utc": 1690338388,
   "score": 133,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgq4jl",
   "message": "Guy ran his transport off the road, hit a deep soft shoulder and died. He was a really nice guy.",
   "created_utc": 1690334255,
   "score": 40,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtguopl",
   "message": "Fell in a recovery boiler building a scaffold to stop people from falling….ironic and cruel.",
   "created_utc": 1690336309,
   "score": 248,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgykjc",
   "message": "I worked at a supermarket in the mid 2000's. We were doing inventory prep one night and the store manager said he was feeling kind of weird. He went to sit down in the office and suffered a fatal heart attack. He was fairly young (late 30's) and in relatively good shape and was a really nice guy, so it hit a lot of us hard. The guy selected to be our new manager was very popular in the company and came in the next day to introduce himself. Seemed like a really cool guy. On the morning with what would have been his first shift at our store, he was killed in a motorcycle accident on his way in. Definitely the craziest work week of my life.",
   "created_utc": 1690338160,
   "score": 240,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth21ab",
   "message": "In 2000 I was working with a road crew doing debris cleanup on the roadsides after a huge ice storm. Me and one of my coworkers had a system running that he would be on the roadside cutting and loading the trailer, and I  would unload back at the burn pit. We'd meet halfway on the road, pull over, and swap vehicles to keep pace going. We'd been running hard and were super excited about how many loads we were getting, cause that was gonna give us a big payday coming. Anyways, we had been running that system all day with not a blip. On our second to last load, we met on the roadway, and he came over to my side to swap. We chatted for a second, and he realized he'd forgotten his smokes in the other truck, so he was gonna come back across the road with me and grab them. I saw a truck coming. It seemed further away than it was, I thought(?) he saw it too, but I guess not. I hesitated, and he turned and went to bolt across the road, hesitated, and then took a couple of steps and bam. He was hit by the truck, which was doing at least 50 to 60 mph. Never, for as long as I live, will I ever forget seeing his body tossed into the air up over the back of the truck bed like a ragdoll and slam into the ground. I will never forget that sound, ever. He was barely more than an arms distance from me when he was hit, and I felt the impact in my bones. I ran over and sat on the ground and pulled him into my lap, and I could see he was gone. I just started screaming and rocking him. The guy that hit him had pulled over and come running to offer aid. He was gone, though. I think he probably died on impact, and I hope so honestly. I've been through some traumatic shit, but nothing tops that. I have ptsd from it. I'm scared to cross roads or to allow others to do so. Even writing this now, tears are streaming, and I feel panicky. I will never truly be over it, I don't know how someone could ever erase that from memory. But I sure wish I could. \n\nRIP Fred N.\n\nEdit: Thanks everyone so much for the caring comments. I'm sorry if I was too graphic. I don't talk about this much, so when I do, it tends to just pour out. Im still in therapy, just not specifically for this. Even though it happened over 20 years ago, the details are fresh and raw in my mind when I recall it. It definitely made me have a greater appreciation for life and how an instant of bad judgment can be deadly. It made me more cautious, albeit too much so at times. I empathize deeply with anyone who's been through something similar. Thanks again everyone ❤️\n\nAlso: I can't fathom the trauma the guy who hit him must have. He was so nice, he sat there with us, trying to comfort me until emergency services arrived. I remember at one point he went and sat on the side of the road and put his head in his hands and just sobbed. He came to the funeral too, and watching him hug Fred's mom and her consoling him was so amazing. She didn't fault him at all. It was just a terrible accident, but I can imagine he felt guilty for a long time. I hope he was able to get therapy too and heal.",
   "created_utc": 1690339894,
   "score": 194,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgukzq",
   "message": "He walked into a moving tail rotor.",
   "created_utc": 1690336260,
   "score": 177,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgwl6m",
   "message": "Suicidal friend of my SO slit their wrists with a box cutter in the freezer. No one noticed they were gone for hours.",
   "created_utc": 1690337211,
   "score": 239,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth0uj8",
   "message": "I was a teenager with a job as dish bitch, the head chef was talking about quitting smoking in the fall. Heard a thump from behind me, I turned around and he was face down on the table. Had a heart attack, he was dead before the ambulance arrived.",
   "created_utc": 1690339298,
   "score": 83,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgr982",
   "message": "Stood up on a forklift while it was on to push stuff off the forks. Slipped on a lever and pinned himself to death.",
   "created_utc": 1690334756,
   "score": 212,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgtlrt",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgwmpl",
   "message": "Amazing bloke and very popular, died instantly from heart attack. Funeral was packed.",
   "created_utc": 1690337231,
   "score": 166,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgi053",
   "message": "My Aunt was killed on 9/11 at her job in the North Tower does that count",
   "created_utc": 1690330625,
   "score": 247,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgxexd",
   "message": "Helicopter pilot on a fire I was working. His long line hooked a tree top after dropping a water tank off for us and he didn’t hit the release (or he did and it didn’t work). Helicopter pendulumed into the ground before I could blink. One of the most surreal things I’ve ever seen.",
   "created_utc": 1690337607,
   "score": 183,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgubao",
   "message": "Real nice guy and spoke to him everyday. Didn’t know he was addicted to fentanyl, died the next morning.",
   "created_utc": 1690336133,
   "score": 42,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgv7pg",
   "message": "His name was Kevin and a great guy excellent at his job who Although I didn’t know well was always nice and helpful to me. He was the last one leaving the remote job site in the middle of winter.  Likely heart attack.  Found much later on the ground, maybe even not until the next morning.  No supervisors, managers and certainly not the owners at the company even acknowledged it beyond how to schedule his absence.",
   "created_utc": 1690336560,
   "score": 23,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgvbsb",
   "message": "Not where I worked but just a couple of buildings down the street. We heard a big boom and went out to see a hole in the other building. Guy was welding on a gas freight truck. They hadn't cleared the fumes well enough and it exploded. Took his head off.",
   "created_utc": 1690336612,
   "score": 137,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgw2gw",
   "message": "I had a friend when I was younger whose dad used to replace industrial sized windows in warehouses. He was on a ladder one day taking measurements of a skylight window when he slipped and fell off, landing directly on his head from about 15 feet up. It split his head clean open and broke his neck. He was only 38, and a GREAT guy. RIP Mike.",
   "created_utc": 1690336965,
   "score": 58,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth031r",
   "message": "I had a coworker that I used to go to lunch with every day. He was a little quirky, but a lot of people in tech are. Super smart guy that was amazing with radios and loved heavy metal music. \n\nOne day I get a message from a friend saying someone's been hurt in the next building over. I find out through the grape vine that someone shot themselves in their office. I had a sinking feeling that it was him. I desperately tried to ping him on our messaging platform.  When I tried to go near his office, they had closed that area off to everyone.  The person in the next office over heard the gunshot and came running to find him. \n\nI was a manager, so having to get everyone in a meeting and tell them that a friend they've known for years was dead was horrible. Easily the hardest conversation I had to have.",
   "created_utc": 1690338913,
   "score": 246,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth1ln7",
   "message": "I trained a UPS loader who ended up going driving later. He was murdered while delivering packages.",
   "created_utc": 1690339681,
   "score": 0,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth1xow",
   "message": "Construction site. A 30ft concrete wall toppled over like a domino and smashed three people to death. It was my first job and fucked me up really bad. The lawyers of other subcontractors subpoenaed me and I had to go to court several times even after I didn’t work there anymore to prove I wasn’t at fault. I wasn’t.",
   "created_utc": 1690339843,
   "score": 152,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgzzvq",
   "message": "One of my team members at my previous job had epilepsy. He was a great guy, had a fucking dark and dry sense of humor (big reason we got along), and he was a HARD worker. He had made a ton of mistakes in his youth, but he was really trying to work past that.\n\nHe went out one night with some of the other night shift folks. Wound up having a seizure on his way home and whacked his head on the pavement. The next day, I was getting pissed because I hadn't seen any sign of him. I went back to a computer to double check the schedule (thinking that my manager had changed his start time and forgotten to relay it to me). While I was back there, my manager called my phone and told me C had passed away the night before and obviously wouldn't be coming in. I, being me, said \"well I certainly hope not!\"\n\nThen I got pissed that C would never hear that joke, which would have had him pissing himself. I was upset, but corporate wanted to get together some grief counseling options before disclosing to the team. I had to sit on the info for two days.\n\nBecause I was off the day they were going to tell the department, one of the store managers sat me down to tell me the next morning. I insisted I already knew. He insisted I didn't. We closed the door, I asked \"is this about C? Because M already let me know.\" Manager says \"oh. So you do know.\" I sobbed for a good ten minutes while the manager scrambled to console me as I choked out \"it's. Not. Your. Fault. I'm o-o-o-o-kay.\"\n\nI was told that our team took it hard. Some of my night people tried to lie and tell me they were doing well. I told them to cut the crap and they admitted they were pissed and grieving. Another manager tried to give one of my shift leads a problem because she wasn't handling things well for the first shift we were all together and got politely told to fuck off by me. \n\nI backed off of my team for a little while, especially at night, and everyone had a really hard time adjusting to it. He was really well liked, and we both used to have one another laughing all the time. I still miss the dude, and I haven't worked there for over a year.",
   "created_utc": 1690338869,
   "score": 176,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth23uq",
   "message": "Dude drove the forklift like an asshole. No seatbelt. Took a turn too fast, and rolled it onto its side. He fell out as it rolled, and the super strong roll cage came down on him—the bar crushed his head against the solid concrete floor.\n\nIt popped his head like a grape, pretty much right at eye level. Pretty much emptied his skull, eyes out, whole deal. The floor was a total mess. \n\nCoroner people collected what they could, but we had to spray the rest out of the building with a hose after they left and released the scene. Sprayed the forklift down too. Threw down a fresh coat of concrete paint the next day. \n\nThat forklift was still there when I left that job…..",
   "created_utc": 1690339933,
   "score": 73,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgomqr",
   "message": "I work in construction, we had a guy get run over by a trackhoe last year. Super cool dude.",
   "created_utc": 1690333585,
   "score": 39,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgufql",
   "message": "USMC. Lost a lot of good friends in my time in.",
   "created_utc": 1690336191,
   "score": 32,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth11bm",
   "message": "We had a leak from one of the pipes. I don't know and we weren't supposed to know what was in them... But we got our PPE on and started walking on the catwalk. 20ft down the catwalk we found the chemicals leaking from the pipe. I got on the radio while my buddy started working on the pipe. Then I just heard him scream in agony. I looked over and he was trying to get out of his gear. He dropped to the ground and was dead before I could even process what was going on. \n\nThat shit killed him within seconds. I quit that day.",
   "created_utc": 1690339394,
   "score": 29,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgxgk5",
   "message": "Suicide. One of my fav physicians I ever worked with too. Also had one murdered at work. We had a year full of several tragedies but those were the two at work",
   "created_utc": 1690337628,
   "score": 102,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgz8kf",
   "message": "A teammate didn't show up for work and her boss called her cell phone which was answered by her neighbor. The neighbor found her on the floor of her home when he noticed she wasn't coming and going, then let himself in with a spare key she had given him. \n\nI've never gone through that before and it was rough. I felt sad that she had passed but she was also a really shitty person to people in the workplace which made me feel not as bad. Trying to resolve the two feelings made me feel guilty but I eventually got over it.",
   "created_utc": 1690338487,
   "score": 48,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth1rnr",
   "message": "5 RNs......COVID happened",
   "created_utc": 1690339764,
   "score": 64,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgxon9",
   "message": "Coworker had a stroke right next to me.   Just fell face down on the keyboard and twitched a little….\n\nAnother guy died driving to work.   Got hit by a pregnant woman texting while driving…all died",
   "created_utc": 1690337737,
   "score": 31,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgy0ls",
   "message": "Car accident. The nicest guy in the office and always willing to help. Collided with a road maintenance vehicle in a work truck. Wasn't even 30 years old.",
   "created_utc": 1690337896,
   "score": 134,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgyfo2",
   "message": "Ex brother-in-law passed away a few weeks before retiring. He had worked at a railroad for his entire life and dropped dead. At the funeral his colleagues were talking about his last words being “this sucks” before collapsing.",
   "created_utc": 1690338094,
   "score": 253,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth0fgk",
   "message": "Worked in a copper wire factory. Big machines that braid different copper wires  together and make all different sizes. New girls was on one of machines that makes really small wire. Was told not to wear her hair down. Always keep it up. Didn't listen, on her fourth day there she for had it down for some reason. My trainee taps me and points to her.  These machines are so loud you wear ear pro and can't hear anyone talk. Start walking over to her and she  bent down, well her ponytail got caught in the gears and they move fast on the small wire machines. It pulled her head so fast into the machine it scalped her instantly and crushed part of her scull in. She died later that day.",
   "created_utc": 1690339087,
   "score": 38,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgvmhm",
   "message": "He went on vacation to Jamaica (he’s from Jamaica) and got shot. Random act of violence.",
   "created_utc": 1690336754,
   "score": 47,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgxjkj",
   "message": "Young kid (teenager) fell off a golf cart and hit his head. Eyes rolled back and he was gone.",
   "created_utc": 1690337669,
   "score": 79,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth0by4",
   "message": "Middle aged guy, had a massive heart attack sitting at his desk. Coworkers did CPR for more than 30 minutes. The office did not have any of those automated difib boxes.",
   "created_utc": 1690339038,
   "score": 16,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgul3k",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgymx8",
   "message": "I had a 23 year old coworker have a heart attack and die while a couple of us tried to revive him. He was a good man, it sucked beyond words.",
   "created_utc": 1690338193,
   "score": 44,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth1ua9",
   "message": "We were just finishing up for the night and shutting down the office slowly. She was sitting down wrapping up a call at her cubicle and she got up and was fanning herself, saying she felt weird and it was hot. She walked down the aisle between all of our cubicles and went to go lay down on the couch. Within seconds the ambulance was there and put her on the stretcher. As they were wheeling her out she raised her arm up to wave bye to us, and it just collapsed. We all go out to our cars to leave and the ambulance was still there rocking back and forth, they were trying to resuscitate her. We learned she passed away when she was telling us night.",
   "created_utc": 1690339797,
   "score": 69,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth3ylm",
   "message": "Not me but my flatmate had somebody die at work. They work in a factory and dude got pulled into one of the machines and was killed pretty fast. \n\nThey all got sent home instantly. The factory was closed for forensics and they paid everybody for being off work. When they went back, work offered them therapy and told them if they more time, they can take it.",
   "created_utc": 1690340927,
   "score": 241,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgwzzg",
   "message": "Office building in downtown Chicago, I think somewhere between 30 and 40 floors. Janitor guy I used to see all the time, very friendly, hard worker. One day around 4pm he jumps off the roof and lands in the middle of the street. Building on lock down for a bit, eventually let us out, and I see them loading the body in the ambulance. Given the high profile area, there were definitely people outside who saw him hit the ground, likely happened right in front of a few people.",
   "created_utc": 1690337407,
   "score": 93,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgy8zg",
   "message": "Heart attack. The guy went into his office to get his stuff, he wasn't feeling well - nauseous I think he said. He didn't come out.\n\nHe was was a couple of years younger than I am now. It was sad, he was a really nice guy, but not a complete shock. Very heavy, smoked (but not heavily), a lot of self-induced stress on the job, the usual. Plus heart issues apparently ran in the his family.",
   "created_utc": 1690338007,
   "score": 28,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgyc7o",
   "message": "I was in the air force we worked in F-4s. He was working in the cockpit and lowered the seat down onto an open circuit breaker panel which ignited the fuel for the seat.",
   "created_utc": 1690338049,
   "score": 153,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgyr5m",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgzkqz",
   "message": "I had a plumber on an emergency plumbing job at a retail store that had a heart attack and died while on site. His name was Mike and he was a really nice guy.",
   "created_utc": 1690338657,
   "score": 14,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth1u8w",
   "message": "I work in movies and tv. There’s van drivers that drive crew back from set to crew parking at the end of the day. When I and other crew arrived there was a driver on the ground being given CPR next to his vehicle. The crew stood there in shock as more and more of us returned to our cars. Very quickly an ambulance/police/etc arrived and started doing their thing. After a bit we realized they weren’t putting him inside the ambulance and that they would’ve taken him already if he survived.",
   "created_utc": 1690339797,
   "score": 147,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth2ehi",
   "message": "The guy overdosed in an employee bathroom. The cleaning staff found him three hours later, this was in a hospital and he was a nurse.",
   "created_utc": 1690340089,
   "score": 14,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth2ewi",
   "message": "My employee said they had an upset stomach, leaned over the sink, died of a fentanyl overdose. Didn’t even suspect her of doing serious drugs.",
   "created_utc": 1690340095,
   "score": 8,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtguowj",
   "message": "Not coworkers, but two people od’d in the parking lot at work. Only one of them made it. Dude in the passenger seat was fully slumped",
   "created_utc": 1690336312,
   "score": 12,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgypga",
   "message": "He met with a vehicle accident on this way to work one day. It was kind of surreal. Just the previous day, we were joking about the busiest times of the years and how hectic it would get and we even shared a cab home. Then, the next day, he didn't turn up to work. That evening, we found out. \n\nHe was in a coma for a week before breathing his last. I didn't know him much but I do hope he's resting in peace.",
   "created_utc": 1690338227,
   "score": 11,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth3i6c",
   "message": "I used to work for a supermarket chain that would get fresh bread delivered every morning by a separate company.\n\nEveryday, no matter what, Eric would show up. 7 days a week, he never took a day off. He was the happiest, hardest working guy you could ever meet. The type of person you simply can’t be upset around. He worked so hard for all of his kids’ future.\n\nI used to tell him he’s more than earned some time off, even just for a few days to spend time with his kids. He would politely smile and say, “everything is an investment, I’m doing this now so I don’t have to in the future” give me a smile and head off to his next delivery.\n\nOne morning he didn’t show up. We were all so confused, he had never missed a day in years. We found out he passed away at 32 of a heart attack, almost certainly from how hard he worked. \n\nI’ve taken numerous lessons away from him, to never take life for granted, the importance of work life balance etc. The whole situation broke my heart, he never got to see his kids enjoy the money he had worked so hard for.\n\nRest in Peace Eric",
   "created_utc": 1690340681,
   "score": 209,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth3zja",
   "message": "Work in the telecom industry had a guy I knew for a year or so had been working in the industry for 12 years. He got lax with safety and would regulary go up ladders on utility poles without any kind of harness or safety equipment. One day he fell from the top landed on his back on a concrete wall and broke it, ended up in the hospital but died a few days later. PPE IS IMPORTANT DO NOT GET LAZY AND THINK IT CANT HAPPEN",
   "created_utc": 1690340940,
   "score": 88,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth0pow",
   "message": "Coworker got a finger caught in a rubber mill.  He was about 5’8” and chubby.  He came out the other side about 5mm thick and 12’ tall.  The sound of the bones popping, and the screaming, stays with me.",
   "created_utc": 1690339230,
   "score": 119,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgwhs4",
   "message": "When I was about 6, my uncle (who was 25 at the time) was at work doing construction on a roof and he fell off and broke his neck. Died instantly.",
   "created_utc": 1690337167,
   "score": 19,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth0gf2",
   "message": "We were apprentices at the time. I got the call and turned the job down. My best friend in the apprenticeship got the call next and accepted the job. It was a hot summer day, and he worked himself into heat stroke because he had made a few mistakes days prior, gotten chewed out, and was \"making up for it.\" In his confusion from the heat stroke he wandered into a place of the Job he shouldn't have been, passed out, and his head was backed over by a dump truck. He was the third man to die on that job. He was married and in his early 30s. I miss him.",
   "created_utc": 1690339100,
   "score": 50,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth1z6n",
   "message": "I was holding down a summer position at the electronics plant my old man worked at. Got to finally meet one of the idiots he is always talking about. Long story short. The guy was about to test a piece of equipment and went to set up the power supply, but completely forgot to turn off the power before doing so. Ended up cooking himself with a few hundred amps of electricity. This was back in the late 1990s. Went to visit my pop at work almost a decade later and the burn mark was still on the floor of his work station.",
   "created_utc": 1690339864,
   "score": 10,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth2lhc",
   "message": "I never had anyone die on the job, but I had three coworkers die in a year and it’s made me realize mental illness and substance abuse needs to be addressed more directly even if it’s uncomfortable. The first person was a good friend of mine in his early 20’s. He came from a rough background and when I met him he was strung out on meth but I watched him get clean and sort his life out. He was honing his craft at work and being a better father for his kids but the fun thing with addiction is most people never beat it, they just trade substances. He started drinking more heavily but never let it get so bad he couldn’t work so I never realized it was as bad as it was. One night he goes out partying and asks me to join, I couldn’t make it because I had out of town obligations and told him I’d see him when I got back to town. That night he was in a solo accident and died at the scene and that’s something I’ve had to hold onto ever sense. The next person was a hard ass in his late 20’s with a similar story that had a shut up and get it done mindset for himself and everyone around him. He may have been abrasive but he was a damn good person at the end of the day and cared for everyone around him. Same story, although some allege a mechanical failure in his car I know the truth. Third person was a talented but troubled man in his 30’s that pushed me every day to be better than I was the day before which I had never experienced. I don’t know what was broken in him but he never allowed himself to accept his own accomplishments and drank away all of his failures even if they weren’t actually his. He became fixated on the idea that “death’s come in three’s” and drank himself to death because none of us had the courage to have a hard conversation with a hard man. I think about these people daily and if you don’t know what it’s like to look around a room full of your peers and fear who’s next I envy you. When you see the signs, please say something. Reach out. Be more than a coworker when you have the chance. An awkward conversation is a lot less painful than a funeral.",
   "created_utc": 1690340192,
   "score": 28,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgzgos",
   "message": "I have a small clinic that I started a few months ago. We are still credentialing with insurance companies and Medicare so it’s very small and cash only at the moment. My office manager/medical assistant didn’t show up for work two weeks ago which was extremely unusual. Apparently the night before he had a brain aneurysm while in the shower. The paramedics brought him back a couple of times and took him to the hospital for emergency surgery but he didn’t survive the operation. Of course it’s shocking and heavy loss, but on top of that we’re now stuck trying to figure out his passwords and all the different things that he did. It just sucks in every way possible.",
   "created_utc": 1690338601,
   "score": 14,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jtgy8f0",
   "message": "Worked at cineplex , line cook in his mid 20s had a stroke and hit his neck wrong on the way down. I was 17 and watched , won't ever forget he was 100% ok literally seconds before and it was my first week. I left that job for ptsd reasons. Yes I'm aware that makes me weak",
   "created_utc": 1690338000,
   "score": 17,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth0scb",
   "message": "Had a young iron worker on the job site whose wife just had their 3rd kid that weekend, fall 4 stories. He got high that morning before work and was standing with one foot on the top handrail. He lost his balance and went over the edge. It was 1986. Very sad. He was a good guy.",
   "created_utc": 1690339267,
   "score": 7,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth1atr",
   "message": "I had an old dude leaning on my cubicle wall. Asked him what he was doing. Said he was just stretching. Collapsed right there. He had a stroke. He didn’t die that day, but about 2 weeks later. Found out he was 55. I thought he was in his 70’s. Big smoker. Cleary didn’t take great care of himself. It was surreal. I was probably about 25.",
   "created_utc": 1690339527,
   "score": 8,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth0a7y",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth5a20",
   "message": "The company I was working for sent a few of us to an industry conference. Our first night there, we all had a few drinks at the bar before heading off to our rooms, agreeing to meet for breakfast. One of my coworkers was a no-show the next morning. Didn't think much of it at first, but about halfway through the day I realized that he wasn't anywhere at the conference either. Didn't get an answer on his phone, and when I called my boss back at our office, our boss wasn't able to reach him either. \n\nEventually, my boss called his wife, who had apparently also been trying to call him because he'd failed to call HER that morning. She said he NEVER missed calling her when he was traveling. \n\nWent to the hotel desk and they sent a manager up to do a welfare check. They found him dead in the bathroom. He'd apparently fallen while getting out of the shower, banged his head on the counter, and broke his neck. We were later told that his death was almost instantaneous. \n\nThat was 20 years ago, and I still feel like shit when I think about it. We were kidding around and making jokes about him sleeping in or being hungover as we ate breakfast in the hotel restaurant, while he was lying dead in a bathroom four floors above us.",
   "created_utc": 1690341589,
   "score": 79,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth5grw",
   "message": "I just posted about this elsewhere just yesterday, but not with any details so here goes:\n\n* Two coworkers were out one night and decided to drive way too fast on a narrow curving road. They lost control and hit a tree. Neither made it.\n* Another coworker: OD'd on pain meds. No one knows if it was accidental or intentional.\n* Coworker that I had a date with didn't show up for work the day of our planned date. She'd been on holiday and no one could get ahold of her. She'd died in a car accident while on holiday.\n* My boss didn't show up for work one day. We sent one of her friends over to check on her and found her dead in her bathtub with her wrists cut.\n* Early-30s coworker doesn't show up for work one day. His wife calls later in tears because he'd died of a heart attack the previous evening.\n* Coworker was having a rough time and suffering from depression. He was finally let go because of performance issues. He sent a series of disturbing texts to coworkers who were also friends that got everyone scared for his safety and trying to reach out. Within a few days he sent a text saying he was ending his life and someone made a call to the police to get help there asap. He barricaded himself in and killed himself later that night.\n* Another coworker showing off on his motorcycle. Accidentally jumped a curb and hit an oncoming car.\n\nThere are more, but I'm tired from thinking about that and writing it all out.",
   "created_utc": 1690341677,
   "score": 151,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jthij6o",
   "message": "My buddy died on the line (cooking) I asked him if he was good on table 11, he said send it. A few seconds later there was a huge crash, I turn around to see my best friend laying on the ground, convulsing, my fellow line cook insists we pull my buddy out from under the table; we do, and he lands on his back. Immediately turns purple, so I, running off adrenaline at this point knew this wasn’t working so I turned him on his side, and start slapping him on the back, which he responded to (gasped for air, started breathing again). Well a few minutes of me slapping him on the back and calling for help passes and I see him turn blue. His ears, his cheeks, his face… eventually the paramedics arrive and start performing CPR, at which point I left the scene and went to smoke.. the manager comes out ten minutes later and tells me my buddy is dead and they did all they could.. a few more minutes roll by with me and all my coworkers in tears, thinking we lost our good friend but lord and behold they hit him with the paddles one more time and he came back.. I guess he suffered a severe heart attack and me not knowing what I was doing kept him alive for a few minutes until the paramedics got there.. idk it was fucking surreal but I’m glad my boy is still here",
   "created_utc": 1690349077,
   "score": 187,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth44t2",
   "message": "Not a coworker but rather a patient I provided services for on an inpatient psychiatric residential unit (with several other staff on duty at any given time; rotating shifts). As I am bound and committed to the principles of confidentiality and privacy, I'll try to be as discreet as possible here. I work as a sort of liason/advocate for said patients (between them and their respective treatment teams), helping them to develop coping skills and guiding them through experiences that challenge their fears (exposure therapy; very gradually, at their own pace and with a great deal of time for self-care and compassion).\n\nA couple of years ago, I was working with a patient not much older than myself who struggled with quite a lot of internal demons. She was always pleasant to talk to and thanked me profusely for my help. I told her not to hesitate to reach out to me while at work if she ever needed someone to listen, offer support or aid with short term solutions. She had a strong aversion to certain auditory stimuli in the environment, often triggered unintentionally by other patients/staff on the unit. Before I clock out for the evening, she thanks me for all of my help again and I wish her a safe and relaxing weekend.\n\nAs soon as I return to work on Monday afternoon, I find out she had hung herself in her room. I was in absolute disbelief upon being told this and spent the day completely dumbstruck by what had happened. By the time I signed off my shift that day, I spent about 10-15 minutes just crying in my car. Looking back on it all in retrospect, there weren't any direct signs to suggest she was suicidal, but her gestures of thanking me as well as other staff excessively might have been a subtle sign that she was at peace with her decision to end her life (and was doing this to make amends before going forth with it). I'm 32 now and in the 8 years I've worked in this job, this was by far one of the hardest experiences for me to endure.",
   "created_utc": 1690341017,
   "score": 54,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jthnag5",
   "message": "A worker at one of my construction sites got flattened by a precast concrete wall, after it fell from the third floor.\n\nEveryone who saw it just froze in place, except one elderly worker who ran around screaming \"Don't call anybody!! Did he have a helmet on?!?\"\n\nNobody answered him, so he got the crane worker to lift the concrete wall slightly and threw a helmet under the wall before ordering the wall to be lowered again.\n\nHe did it to make sure that the insurance would payout the full amount to the poor guys family.\n\n\nEdit to respond to some questions:\n\n\nThe older guy took a look when the wall was lifted to check for a helmet and tossed a helmet in when he couldn't see any.\n\nI live in Denmark, and I'm not sure how the insurance work completely in these situations but, the dead guys own life insurance would probably cover this accident, the company has an extra insurance to help their workers out, such as if you breake your leg, the company insurance can help you to a private hospital and some rehabilitation. That ekstra insurance can be quite strict, that's why they made sure it looked like he had his helmet on.\n\nAnd YES, the guy definitely died instantly. No helmet can save your life from an 8-9 metric ton concrete wall falling from 12m height.",
   "created_utc": 1690352348,
   "score": 182,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth3fzu",
   "message": "My dad had a heart attack in the parking lot of his work. His coworkers came to the memorial in shifts because someone had to be on shift at the store since they didn’t close.",
   "created_utc": 1690340648,
   "score": 157,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth5kaz",
   "message": "I came pretty close. Had a super stressful event that I flew to HQ for and the night before my “big day” I had a few beers with my co workers and ate an abundance of pizza. Went to bed early because I was feeling off and didn’t want to drink more and woke up about 1 month later. Had a severe brain aneurysm in the morning and wasn’t found until 2pm, walked into the ER room on my own 2 feet and shortly after that they were telling my parents I just might not make it. \n\nOn the positive side, it’s been 5 months and I’m already easing back into work but on my own terms. Need to watch my blood pressure from now on..",
   "created_utc": 1690341726,
   "score": 169,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth6l3z",
   "message": "I had a classmate die of cancer before. They died in our 1st sem so we didn't get to know each other well. They still enrolled even tho they were already terminal, and it was just sad whenever some teachers would still call him for attendance",
   "created_utc": 1690342227,
   "score": 146,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth6ar3",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth44yr",
   "message": "I work in grocery stores, managment. You get transferred around a lot the longer you're with the company. The last store I worked in before being transferred recently had an elderly lady I'll call Jane that worked in the produce departmemt. She tended the wet-wall and put product on the shelves and in the displays. She also sometimes cut fruit and veg for those little plastic bundles we sell. \n\nJane also smoked and this is where our paths crossed most often. I wasn't immediately Jane's supervisor (different departments) and because of this Jane and I were pretty informal with one another when we'd catch eachother outside for nicotine. \n\nShe'd usually chit-chat about her family. Occasionally she'd gossip about co-workers, or complain about favoritism in managment. But mostly, like many employees in this line of work her age, she just wanted the day to be done so she could go home and enjoy her free-time. \n\nThe day she died was my last-day before a short vacation. I opened the store that day so I was getting ready to leave shortly after 1:00 in the afternoon. I was coming back inside from the gas station and noticed her in the produce department tending to the wet-wall. I was in a hurry to pass-off a list of things the gas attendant needed re-stocked and then be on my way home. \n\nNot even a few minutes into my car and then shortly on the highway back home did Jane drop dead, right on the produce sales-floor, from an aneurism. She had barely begun her shift. I'm told she hadn't any indication of the onset of symptoms or health complications that may have led to having a deadly aneurism. At least none that she shared with anybody at the store.\n\nNo one told me she had died until I came back from vacation.",
   "created_utc": 1690341018,
   "score": 236,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jthip5f",
   "message": "Story about FIL, he didnt die immediately but his quality of life took a massive shit. He died a 366 days later.\n\nFourth of July, 2020, he’s a paramedic. Just got done doing an event downtown (the town still had a 4th of July parade even though covid was a thing). He picked up someone in the ambulance and when they got to the hospital, he started to have breathing issues and got pale. Complained his chest hurt but they did not find signs of heart attack.\n\nWorse. Aortic Dissection.\n\nThey flew him to Indy and he had surgery that night and was out for two whole weeks. When he came to, the doctors found out he suffered a stroke in surgery and he was essentially crippled for the rest of his days. \n\nThe last thing he said before the surgery was to my wife where he stated that “he wasnt going to make it.” In a very real sense, he didnt. He wastes away in front of us for a year before his body gave out. Always in bed, could barely move any part of his body, suffered from a stutter. \n\nIt fucking sucked. Sometimes I wish he had just died on the table, then my wife wouldnt have to see him wither away. And sometimes, Im pissed that he left at all. His kids miss him. My children miss their grandparent. \n\nRest in peace.",
   "created_utc": 1690349186,
   "score": 207,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jthkz5m",
   "message": "Guy had a heart attack and died when I was working at a target distribution center. After the ambulance took him away we had a meeting. The managers told us you know Fred would have wanted you all to hit those numbers so let's get out there and make up for the lost time and do the best we can for him!",
   "created_utc": 1690350710,
   "score": 3,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth485q",
   "message": "I worked at a big company with  a nice couple, Billy and Grace.  Billy was a big biker dude, funny and gregarious.  “Adventure” seamed to follow him around.  There was always some new funny situation he got himself involved in.  One night after work Billy almost got into a big fight, but cooler heads prevailed and it all calmed down.  \nA couple days later, Billy and Grace were driving into work on a 2-laner, and a woman coming the other way got distracted and crossed into their lane head-on.  The other woman got banged up a bit.  Billy was killed instantly, and Grace was unconscious, with both arms and legs smashed up badly.  \nWhen I got to work, I saw a friend having a smoke out back, and says “Hey, did you hear about Billy?”  I thought he was talking about the almost-fight from the other night, so I said “Yeah, that’s Billy for you.”  He gave me an odd look.  When I got to my desk I heard the news.  \n\nI felt like a bit of an ass.",
   "created_utc": 1690341064,
   "score": 236,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jthik17",
   "message": "Ten years ago there was a shooting at my college where I also worked.  There was a groundskeeper there that I saw frequently while coming to and from the on campus office I worked in. Super friendly guy who didn’t talk a whole lot (to me at least) but very warm and always had a smile for you.  When the shooter arrived, he was shot in the head while starting his drive off campus, and his daughter was in the front passenger seat, who was also shot in the head and died two days later.  His name was Carlos.  That happened right in front of our office.  I happened to not be at work or on campus for anything that day, and I’m grateful as I could have easily encountered the shooter based on the location Carlos was killed in.  I still to this day can’t believe it though.",
   "created_utc": 1690349092,
   "score": 203,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth554t",
   "message": "I worked at an office-supply shop in the 80s. Worked with a teenage girl, nice young woman, shy, surprsingly funny when she had gotten comfortable with you. She worked 9 a.m. to 1 p.m., took a bus to Niagara Falls, at which point she headed to the water's edge just where the falls go over, climbed a fence, jumped. Apparently she was incredibly determined in the way she walked, there was no hesitation. Some Japanese tourists had it on video so the police could identify her. It really shook the tourists badly. Her body was never found. I've really never gotten over the fact that I didn't see it coming. There was no giveaway. She was her usual self.",
   "created_utc": 1690341521,
   "score": 146,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth467j",
   "message": "Worked at the mines\n\nGuy was directing a lifted large cargo container which unfortunately broke and landed onto him, decapitating his head from his body\n\nThe worst part that haunted me to this day was what the project manager said after that\n\n\"Darn, we could have gotten more use out of him\"\n\nAll i did was froze in fear from what just happened and what he said",
   "created_utc": 1690341036,
   "score": 114,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jthgvjo",
   "message": "Admin. was pulling down a box from ontop a filling cabinet.  A green file organizer,  with the metal edge which sits inside cabinets, was laying across the box. \n\nThe green file organizer fell from the box when she was carrying it down, and it sliced the poor women's neck. \n\nShe bled out in a matter of maybe 90 seconds. The whole time apologizing for all the blood she was spilling on the carpet...",
   "created_utc": 1690348016,
   "score": 140,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jthlxvn",
   "message": "This didn't happen AT work but we all found out simultaneously at work in the worst way. \n\nI was working AT a large Telecom company doing L2 \nphone-based tech support. One of our colleagues was ex military (explosives), going through a rough divorce, attorney was basically guaranteeing he wouldn't get the kids... He was staying with another co-worker.\n\nOne day, he doesn't show up, phone goes straight to VM... The co-worker goes home to check on him, there's a note on the door: \"Don't knock, don't come in. Just call the police.\"\n\nSWAT shows up and sends in a bomb robot, found his body in the bedroom. He had put a shotgun to his head.\n\nCoworker/roommate was devastated. We all were. Boss took our team off the phones (~20 of us out of the 300-400 on the floor) and took us out to an Applebee's up the street and bought us all rounds while we let our emotions out. Told us to go home and take all the time we needed, if we needed to. That was Feb 13 2009.  Jim, you are sorely missed. Jason, you are an amazing boss.",
   "created_utc": 1690351378,
   "score": 113,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jth3ghf",
   "message": "My job lead ran up to me that a driver had collapsed and was unresponsive outside. I ran (don't run! stay calm) over and he was on the ground in fetal position like he was sleeping. By the time I could get CPR started he was already agonal and greying.\n\nI did the best I could to keep him alive until the ambulance showed. In the early stints of compressions he showed some good signs but they waned the longer it went on. Between myself and a coworker we worked on him for over 25 minutes. In my head my mind was telling me that it'd just been too long and if he was resuscitated his qualify of life would be non existent but I ignored those thoughts.\n\nHe died at hospital. He was under 60 years old.",
   "created_utc": 1690340655,
   "score": 83,
   "submission_id": "159q08t"
  },
  {
   "comment_id": "jthjj4t",
   "message": "A guy in my department, a work friend.  He went across the country for a week-long EMS conference. About the day he was supposed to return his wife received a call that he had been killed.  Turns out he was \"visiting\" a woman he had met at the conference.  Here husband came home and killed them both, then himself.",
   "created_utc": 1690349737,
   "score": 87,
   "submission_id": "159q08t"
  }
 ]
}