{
 "submission_id": "159sbz3",
 "title": "People with physical scars, how did it happen?",
 "selftext": "",
 "created_utc": 1690336758,
 "permalink": "/r/AskReddit/comments/159sbz3/people_with_physical_scars_how_did_it_happen/",
 "score": 21,
 "url": "https://www.reddit.com/r/AskReddit/comments/159sbz3/people_with_physical_scars_how_did_it_happen/",
 "comments": [
  {
   "comment_id": "jtgyw20",
   "message": "Some guy in NYC stabbed me in the chest.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\nOkay, okay, he was a surgeon, but it still hurt like a MFer when I woke up.  I do appreciate the new heart valve and aortic stent.",
   "created_utc": 1690338315,
   "score": 19,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgvzfw",
   "message": "Trying to impress a girl while drunk and open a (not needed) bottle of wine. While cutting the foil with the little corkscrew knife thing, my hand slipped and now I have a jagged scar across my thumb knuckle.\n\nWe got married a year ago.",
   "created_utc": 1690336925,
   "score": 16,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgw5mv",
   "message": "Too many to tell about them all so I'll just name the first. I have a scar on the back of my head where I was bit by a Belgian Malinois when I was three years old, I ended up with over thirty stitches. I'm 57 now and I have plenty of scars.",
   "created_utc": 1690337006,
   "score": 9,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgwgy8",
   "message": "I was holding my cat and dropped her tub of food, it was super loud and scared the shit out of her and she kicked my face accidentally while trying to jump out of my arms. I have about a 2 inch scar from my bottom lip down still and that happened probably 12 years ago",
   "created_utc": 1690337156,
   "score": 6,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgwj7u",
   "message": "Fell through a window head first, I was cleaning my sisters room when I found old moldy food under bed. I went to go open her window but tripped on a skateboard she had",
   "created_utc": 1690337185,
   "score": 5,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgvx25",
   "message": "Car accident. Impaled my knee on a steering wheel adjustment knob. Scar looks like \"6.\"",
   "created_utc": 1690336894,
   "score": 3,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgxp2k",
   "message": "1. Sliding on a slip and slide that had a piece of glass on it\n2. Had two small humans who decided to bake the wrong way In my uterus so they had to be cut out. (Breech twins).",
   "created_utc": 1690337743,
   "score": 3,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgwa0o",
   "message": "Had a precancerous mole on my shin when I was 6. They removed it. Then had to go in and remove more cause they missed some. I have a good sized divot on my shin but I honestly almost never notice it. Maybe once a year or so I'm like oh yeah I almost got skin cancer.",
   "created_utc": 1690337066,
   "score": 3,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgwe1k",
   "message": "I was balancing in some weird way on a bathtub edges for absolutely no reason and then fell and hit the angular one",
   "created_utc": 1690337119,
   "score": 3,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgxat2",
   "message": "My most prominent scar is my c section scar. But the one with the best story is on my knee where I was banging it against the bottom of a glass cage/aquarium and it broke. I was 8 and mad my mom was making me clean the hamster cage. Left a little dime size crescent scar.",
   "created_utc": 1690337552,
   "score": 3,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgymw6",
   "message": "Surgeries... Over a dozen at least. Too many health issues.",
   "created_utc": 1690338193,
   "score": 3,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgyvuq",
   "message": "Rolled my car, nearly bite my tongue off, and ruptured my intestines. Huge scar on my stomach. Almost died",
   "created_utc": 1690338312,
   "score": 3,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgze2v",
   "message": "Face through a windshield.   \nAxe to the leg.    \nArm 'rearranged' at wrestling practice.    \n[Pop-tops on the ground around the pool](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS3yOeBzimrAa5NYXHqZppKXWKuYd0bUEPAX-atfTCy5NB18AlIcXMx07c-CYuWTm-ISYc\u0026amp;usqp=CAU)     \nBroken window glass.     \nMotorcycle exhaust pipe.  \n...",
   "created_utc": 1690338565,
   "score": 3,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth1mby",
   "message": "Some jerk cut my foreskin off",
   "created_utc": 1690339691,
   "score": 3,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth27y2",
   "message": "I was born with Russell-Silvers Syndrome. As a result, I had to get daily growth hormone injections from ages 5-15. When I was 10 years old, I had limb-lengthening surgery performed on me that required a year of rehab (For those who watch Baki on Netflix, think Jack Hanma), and 10+ years to regain full musculature. There are now 2 scars, and 21 “dents” where the rods that gradually shifted my bone were. It’s been a wild ride\n\nEDIT: This is on my left leg",
   "created_utc": 1690339993,
   "score": 3,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth4b3v",
   "message": "I woke up coughing one night and didn't think too much of it. Turns out I had aspirated some food and/or stomach acid. Lung went necrotic and the doctor had to cut my ribs and a 7\" hole in my chest to get it out. He said it was hard like cement and wouldn't come out through the camera hole.\n\nI'm leaving out a lot of details, but that's the cliff notes.",
   "created_utc": 1690341106,
   "score": 3,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgvqhl",
   "message": "sleeping walking and my leggings got stuck to a opened wound when i was a kid.",
   "created_utc": 1690336808,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgwsno",
   "message": "MMA Training",
   "created_utc": 1690337309,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgx4o7",
   "message": "Rough life.",
   "created_utc": 1690337470,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgy1eo",
   "message": "I (6yrs) was younger than the kids at the neighbors' pool.   \nThose kids were all jumping off the side of the pool backwards, so I had to do it too.  \nExcept I missed, scraped my chin along the side of the pool and the water turned red like a shark attack.   \nMy mom freaked, we went to the ER, I got stiches. First scar.  \nOthers: chicken pox (itchy AF!), sights on a rifle from drill team--throwing and not catching well (college), volleyball (GetOutOfMyWayImTheSetter! He didn't \u0026amp; I got slammed.)  \nProb'ly others.",
   "created_utc": 1690337907,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgycc0",
   "message": "Numerous fights and work related incidents, also a few dog and snake bites.",
   "created_utc": 1690338050,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgygqk",
   "message": "I was walking home from my best friend's house and I stepped on a rooster's foot. It flew up and sliced my lip open.\n\nA few years later my sister and I were fucking around with my dad's golf clubs. She took a swing and sliced my temple on the back swing.\n\nA few years after that I was learning how different plastics burned. I was fascinated by how cellophane burned. I was burning a piece in my hand. It got too close and I panicked, and it wrapped around the back of my hand, still burning.\n\nThose are some of the weirdest ones.",
   "created_utc": 1690338108,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgz60w",
   "message": "Weird one - My umbilical cord wouldn't disconnect from my intestines after I was born, and they had to surgically remove it. It's a tiny scar but noticeable.",
   "created_utc": 1690338452,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgzaym",
   "message": "I round-house kicked a dry Mullein plant when I was like 7, and I missed and it left 3 scars in my right thigh.",
   "created_utc": 1690338520,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgzptu",
   "message": "My brother threw a rock at me when we were little and I had to get stitches.",
   "created_utc": 1690338728,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgzvjc",
   "message": "Suzuki GT750, highspeed wobble, t-shirt.",
   "created_utc": 1690338808,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgzx3t",
   "message": "Dirtbiked into a barbwire fence. Didn't notice how messed up my leg was until I felt something trickling down my leg.\n\nWell, a lot of something.",
   "created_utc": 1690338831,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth0aqv",
   "message": "Huge scars on my back. When I was a child my father sent me to the chicken coop to get the eggs. A rooster attacked me and I dropped the eggs. Dad was so angry he beat me senseless with some jumper cables.",
   "created_utc": 1690339021,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth0mdm",
   "message": "I was born through C section, and the OBGYN who operated accidentally cut my face. They patched me up and wrapped my newborn hands in cotton and gauze so I wouldn’t pick or scratch at the stitches. Scar is till visible. Used to be large in proportion to my small, child-sized cheek, but now that my face has grown it’s less noticeable.",
   "created_utc": 1690339184,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth0r5d",
   "message": "Had a tumor on my left shoulder when I was a baby that was removed. Have a scar there that is my favorite part of my body now.",
   "created_utc": 1690339250,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth0z57",
   "message": "Cross country race, I slipped on a turn and my teammate stomped on my hand with 3/8inch spikes. Immediate fracture. I got back up, looked at my bleeding hand and finished the two remaining miles for a new pr.",
   "created_utc": 1690339362,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth11fw",
   "message": "I tripped over a recycling bin and hit my chin on the doorknob.",
   "created_utc": 1690339395,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth1as0",
   "message": "Let's see. When I was eight I got stabbed in my index finger by a classmate, I promptly ripped it out and stabbed him in the hand, to which he responded by putting it into the back of my left hand. I have a piece of graphite still in my left index finger, and a cyst on the back of my hand where he stabbed it. A year later I fell out of an oak tree I climbed to get to the roof of the house to escape my abusive father and one of the branches split my chin open. When I was fifteen I was hit by a Cadillac while riding my zx10. Complete left knee reconstruction using a cadaver knee so now have scarring all over my left knee. At 16 and a half I got six stitches on my forehead from being thrown from a cattle car by my casualty handle onto a curb during basic training. I have burn scars, vocal cord damage and permanent hearing loss from an i.e.d. that's about it, I've tried to live a safe life after all that.",
   "created_utc": 1690339527,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth1f4i",
   "message": "something bit me on the butt when i was a baby, had to get some kinda surgery for it, and now there’s this weird bump on my buttcheek. kinda looks similar to a mole, but without hair or discoloration or anything. it’s pretty weird. unfortunately, somehow my parents do not remember what the bug was or why i had to get surgery. one year it was a black widow, another year it was just a spider, another year they didn’t remember what it was, and so on.",
   "created_utc": 1690339588,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth1jsg",
   "message": "Ate a tree at 55 mph from a back seat.",
   "created_utc": 1690339656,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth1npu",
   "message": "Hip replacement. But I like to tell people it was a shark attack",
   "created_utc": 1690339710,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth22z6",
   "message": "tried to get a pan out of the oven and burned the top of my arm in the process",
   "created_utc": 1690339920,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth240s",
   "message": "took a zquill planning on going to bed, then stayed awake for another hour or two chatting with my husband and kids.  went to the restroom and came back outside and toppled down our stone steps. pretty cool scar on my arm. tried to catch the incoming boat, and it pushed me back resulting in a scar on my knee. jumped off a pedal pub and landed on me other knee, and another scar. I'm very clumsy so i have a lot of scars",
   "created_utc": 1690339936,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth2rdr",
   "message": "Fainted from low blood pressure and hit my face on a metal window sill. Split my forehead open down to the bone from my scalp to my brow. Had to get internal and external stitches plus laser surgery.",
   "created_utc": 1690340280,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth2x4l",
   "message": "Not me but my brother in law. Had a car fall off the jack and bounce and I mean literally bounce on his head.",
   "created_utc": 1690340367,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth3a26",
   "message": "I’m a glazier by trade.\nHad a 1/2” piece of tempered pop on my hand 🤚🏼lacerated my tendon and my hand was immobile for 6 months.",
   "created_utc": 1690340557,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth3lj8",
   "message": "Chainsaw kicked back and hit me in forehead",
   "created_utc": 1690340732,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth3s2z",
   "message": "got in a fight against 2 guys and i had two stitches on my face and one set of staples on the back of my head. Not huge but noticeable",
   "created_utc": 1690340831,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth41gv",
   "message": "I was a small teen. Everyone thought it was cool to pick me up.. one day I was picked up and walked through a doorway where there was an exposed nail. That nail cut me in the face. Now I have an anti joker scare. I say that cause joker got a smile. Mines more of a frown.",
   "created_utc": 1690340968,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth4bpw",
   "message": "I stabbed myself in the hand as a kid while carving a pumpkin with a regular steak knife. Stuck in there pretty good. Needed two people to pull it out.",
   "created_utc": 1690341115,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth4onf",
   "message": "Arm surgery. They dropped my arm and have a bone poking out forever too",
   "created_utc": 1690341297,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth5ecb",
   "message": "I was 6, \"helping\" my dad cut down the tree in the front yard with my hatchet. I swung and missed the tree, hitting my shin, where the hatchet stuck.",
   "created_utc": 1690341645,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth5hca",
   "message": "My cat launched himself off of my face as I was sleeping. It’s a small scar along the edge of my nose.",
   "created_utc": 1690341685,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth5vl5",
   "message": "On vacation in Florida,  I tried to climb the counter for the mint chocolates on top of the fridge, as I came down a broken handle on an appliance cut the back of my leg. 8 stitches later I was living in regret unable to swim for the rest of vacay",
   "created_utc": 1690341878,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth6152",
   "message": "if it's pointed out, I always make up a ridiculous, fantastic lie about it...",
   "created_utc": 1690341953,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth6p8h",
   "message": "Broke my ankle very badly while skateboarding and have a metal plate and 13 screws in it, split my head open while skating as well, accidentally sliced the back of my wrist open with some glass and also accidentally stabbed my myself in the arm with a box cutter while at work",
   "created_utc": 1690342284,
   "score": 2,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthd48z",
   "message": "So much surgery",
   "created_utc": 1690345745,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth649d",
   "message": "You wanna know how i got these scars?\n My father was a drinker...and a fiend. And one night he goes off crazierrr then usual. Mommy gets the kitchen knife to defend herself, he doesn't like that....not...one...bit!\n\nSo! Me watching, he takes the knife to her...laughing while he does it. He turns to me, and he says \"Why sooo serious?\" He comes at ME with the knife... \"WHYY SOOO SERIOUS?!\" He sticks the blade in my mouth \"LETS PUT A SMILE ON THAT FACE!\" Aaaand...",
   "created_utc": 1690341996,
   "score": 0,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgwe0e",
   "message": "I was born (birthmark)",
   "created_utc": 1690337119,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgwmq0",
   "message": "Surgery on my leg",
   "created_utc": 1690337231,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgx9rt",
   "message": "Restoring old cars as a hobby. It comes with the territory—sharp sheet metal edges, power tools, rusty/stuck fasteners, etc.",
   "created_utc": 1690337538,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgxss0",
   "message": "I got an ass ton of mental scars. Otherwise my scars are from me attempting to befriend and pick up every stray cat I’ve ever seen in existence to rescue them.",
   "created_utc": 1690337791,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtgxy5h",
   "message": "Motorboating accident. I was called to fix a problem, but I didn't really know where that was going to lead.",
   "created_utc": 1690337863,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth000c",
   "message": "Thermoplastic poured on index finger. Now have a nice 3 inch graft from my leg on it.",
   "created_utc": 1690338870,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth0imy",
   "message": "I have a giant scar from my sternum to below my belly button.  2 separate surgeries. Pancreas and splenectomy. My belly is all uneven as a result.",
   "created_utc": 1690339132,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth0m9c",
   "message": "One on the wrist from dropping a glass bowl as a kid.\nThe other is on the back of my hand from getting caught by a machine at work.",
   "created_utc": 1690339182,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth0rm3",
   "message": "Dog bite to the face in the middle of the night, she had a nightmare…and became a night terror.",
   "created_utc": 1690339257,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth1be8",
   "message": "Cat rolled onto its back and gave me this look of \"Oh won't you please pet my belly..  it would make the the happiest kitty in the world.\"\n\nSuddenly murder mittens...   and I have 3 long scars down my forearm that never healed correctly because they got infected and I was stupid and took a long time to finally see a doctor.",
   "created_utc": 1690339535,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth1dnf",
   "message": "Multiple street drug IVs on the same spot\n\nThey're fading away thank god",
   "created_utc": 1690339566,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth1lts",
   "message": "Doesn’t everyone have at least some scars",
   "created_utc": 1690339684,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth1r1v",
   "message": "Ate a tree from a back seat at 55mph",
   "created_utc": 1690339756,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth1xd0",
   "message": "I have an eyebrow scar from being a dumb kid and lying under a rocking chair. Thick brows normally hide the missing line of hair though. Knee scar from playing digimon on wooden pillars and falling off mid \"diginova blast\". Finger scar from throwing broken glass. And a fairly long forearm scar that I don't actually know where it even came from.",
   "created_utc": 1690339838,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth2dsp",
   "message": "My depressed teenage self found out people cut themselves to feel better. Sounds stupid but my curiosity told me to give it a shot. Still can see some of them pretty good.",
   "created_utc": 1690340078,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth2x1c",
   "message": "I have a lot of scars. A few on my back from falling through a barstool I got at a garage sale. Turns out they were selling it because the support beams were completely rotted and they painted over it. A few from force on force training exercises with the sheriffs office. A few from motorcycles. A few from playing with my pocket knife in an irresponsible manner as a kid.",
   "created_utc": 1690340365,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth2yyy",
   "message": "Was pairing the rim of a window pane and I slipped forward, putting my hand through the window and the glass cut right across my wrist. Blood started squirting like whoa. Co-worker took me to the hospital and now I have to tell people I swear I never tried to off myself because of the long scar on my wrist.",
   "created_utc": 1690340395,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth352g",
   "message": "My mom hit me a lot when I was younger, unfortunately.",
   "created_utc": 1690340482,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth5eto",
   "message": "Heart transplant scar. First scar I’ve received (and hopefully the last). Goes from the top of my chest towards the base of my neck all the way down past my rib cage.",
   "created_utc": 1690341651,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth6c6n",
   "message": "Skydiving canopy wrap. Got line burn on my arms, back and leg.",
   "created_utc": 1690342103,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth6ewn",
   "message": "Knife fight at 2AM as a teenager.",
   "created_utc": 1690342142,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth6l7x",
   "message": "Long story short.\n\nHad a hottie female friend who is a bartender that I was hoping to be FWBs with. Knew she was cool with the idea and the lifestyle. One day, her ex-boyfriend showed up to the bar drunk and attempted to attack her with a knife. I stepped in to protect her and took the knife to the ribs. Sadly, she thought I was an idiot for saving her life. I have since replaced our friendship with a badass scar.",
   "created_utc": 1690342228,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth6y5g",
   "message": "Racing accident",
   "created_utc": 1690342406,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth74gc",
   "message": "Depends on which one we're talking about ...\n\nPersonally I believe the one that involved an ax is the most interesting. \n\nAlthough I do have quit the indent in my shoulder, easily passes for an exit wound.  Of course it's far less interesting  ...",
   "created_utc": 1690342495,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth78mj",
   "message": "Two elbows in the face during a mosh pit.\n\nI’m 125 lbs and I’ll do it again.",
   "created_utc": 1690342552,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth78o6",
   "message": "Vaguely: a shovel, merry go round, saw of pocket knife, dog fang, raccoon scratch,  back of a television, cat scratch, chicken wire, a lightswitch then brakes on my bike, brand new blade on a box cutter.\n\nI think that's all that probably won't fade away",
   "created_utc": 1690342553,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth7c9g",
   "message": "One above my eyebrow from falling on my face in the middle of the night. I have one on my left elbow that I got playing basketball on asphalt. The one on my left shin is from when I smacked my leg against my metal bike pedal. I got one on my right ankle from when I broke my ankle and the bone tore through the skin. There are plenty more but those are the most memorable.",
   "created_utc": 1690342603,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth7diq",
   "message": "Car accident.  Head went into my windshield.",
   "created_utc": 1690342621,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth7dt0",
   "message": "Epileptic. \n\nI had a major tonic clonic while preparing dinner followed by going status epilepticus. \n\nI stabbed myself in leg with a chefs knife- 30 stitches. \n\nI chewed a piece of my tongue off. \n\nSplit my eyebrow- 6 stitches.\n\nAll a single event.",
   "created_utc": 1690342625,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth7fav",
   "message": "Lost half of my bottom lip from a 38 year old buckshot injury becoming infected,I retained around thirty pieces in my gums and face but never had any other issues,the odd one has fallen out of my gums over the years.",
   "created_utc": 1690342646,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth7fi1",
   "message": "Bottom lip left side - due to being accidentally pushed into the entertainment center \n\nAbdominal area - due to gallbladder being removed",
   "created_utc": 1690342649,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth7o6e",
   "message": "I had an on again off again ex who was a bit on the wild side. She took a knife to my face one night, slashing the left side of my face. I didn’t bother going to the hospital to get stitches so it’s very noticeable.",
   "created_utc": 1690342771,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth7oqo",
   "message": "During wrestling practice I took a clumsy kid to the ground and he landed with his knee in the air. My head crashed into his knee when I came down with him, and 2 of my teeth ended up going through my lip. I didn't even notice at first, all I knew was my nose hurt. He said \"oh my god you're bleeding\" so I went to the bathroom and saw the real damage. My gums hurt from the impact for like a week, it felt like getting your braces tightened. I didn't even end up joining the team smh, but at least now I have a cool scar",
   "created_utc": 1690342780,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth7paa",
   "message": "I sliced my big toe on a sharp rock after falling off my bike wearing flip-flops.\n\nI have two puncture scars that are from a dog bite when I was 10. The teeth touched completely in the meat of my arm, and when the EMTs poured sterile water in the top hole, it drained straight out the bottom hole. You can still feel a hollow spot near the bottom puncture hole 35 years later.\n\nI now have a gnarly scar, basically that runs 3\" above AND below my belly bottom from hernia surgery. Also from the hernia debacle, i have a little tiny spot in my throat where they had to put in the tube they used to give me a few sessions of kidney dialysis.\n\nFun times.",
   "created_utc": 1690342787,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth7qzj",
   "message": "I fell on my dog and they bit me, my dog is pretty much blind and thought it was my other dog",
   "created_utc": 1690342812,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth7z8q",
   "message": "One was from falling 15ft out of a flimsy tree, two more were from getting cut by glass, some others were burns or from hot things.",
   "created_utc": 1690342930,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth7zhx",
   "message": "tried killing myself a couple times.",
   "created_utc": 1690342934,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth821w",
   "message": "I was kicked by a horse in my shin at horse camp. We were playing cowboys, good guys bad guys, and hiding behind small hills. Someone else's horse kicked at mine and got me instead.  Totally worth it. Best summer camp ever! Aqua Barn, Renton, WA.",
   "created_utc": 1690342971,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth83pb",
   "message": "1. i ran into an ironing board when i was 4\n2. a kid pulled me off a highjump map and i went face first into asphalt\n3. i sliced my finger on stream while cutting garbage up with a knife during queue\n4. a bike i found in the river had a broken back break and it sliced my calf\n5. i was a suicial depressed teen\n6. picking scabs from road rash skateboarding",
   "created_utc": 1690342995,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth8bks",
   "message": "got punched in the jaw and it split my lip",
   "created_utc": 1690343108,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth8fb0",
   "message": "I have been cutting myself with a razor blade since I was a small child due to depression \u0026amp; abuse. I think most of the scars are on my thighs.",
   "created_utc": 1690343161,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth8m6z",
   "message": "Small scar on my nose from tripping over a tool box when I was 3, scar on my wrist from falling on a treadmill when I was around 8, and many scars on my thighs that are self inflicted :/",
   "created_utc": 1690343261,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth914h",
   "message": "I broke a pint glass at work and it cut my wrist open. Now have a fun scar that mostly just looks like a wrinkle or fold in my skin",
   "created_utc": 1690343479,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth91p8",
   "message": "First one: was holding a beaker in a laboratory. Someone called my name, turned and smashed the beaker on a counter corner, shard went into my palm.\n\nSecond one: held my dog when she was being reactive to another dog. Got “grazed” on the cheek with those knife-teeth when she whipped her head around.",
   "created_utc": 1690343488,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth9boj",
   "message": "I have a scar on my lip from trying to bathe my friend’s dog and slipping on the tile, I have another on the back of my head from busting my head open (twice) as a child, I have a scar on my thigh from a broken plate, a few burn scars from various reasons, my knees are scarred from when someone shoved me down the stairs at school, and a lot of different scars from unknown reasons",
   "created_utc": 1690343635,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth9lsv",
   "message": "I woke up in the middle of the night and stumbled when I got out of bed - directly into the corner of my dresser. I came too with blood all over my face from above my eye where I made contact and crawled to the bathroom for a towel. Briefly passed out again but was able to stop the blood with continuous pressure.\n\nA smart person would have gotten to the ER for stitches but I am not that person. \n\nIt’s now a small Mercedes logo without the circle around it right over my left eyebrow.",
   "created_utc": 1690343784,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth9o90",
   "message": "I scar super easily so I’m covered but my biggest scar is on my arm: was riding my bike home from school with my lunch box dangling from my handlebar because I had too much homework for it to fit in my backpack. Lunch box flung into the tyre causing the bike to abruptly stop flinging me into my neighbours fence. Thank goodness for helmets. \n\nMy dumbest scar? Scratched my hand on a metal handle for a washroom drawer. Didn’t seem to scratch it badly…but I still have the scar 17 years later.",
   "created_utc": 1690343820,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth9oig",
   "message": "Playing tug of war with my dog. I moved my hand down on the toy just as she was moving her mouth up. Got my finger chomped. Didn't quite make it to the bone, but close. Still, the scar is quite small.\n\nShe was so sorry about it though, she immediately dropped the toy and wagged her tail in that sort of \"I'm guilty\" way. There was no way I could be mad at her, it was just an accident.",
   "created_utc": 1690343824,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth9pel",
   "message": "IED.",
   "created_utc": 1690343837,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth9qt5",
   "message": "Abusive friendship, dogs who don't let us cut their nails, and accidentally cutting myself while shaving. They all don't need to be further talked about especially the first one.",
   "created_utc": 1690343857,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jth9wp0",
   "message": "I was running around chasing my cousin when I ran into a table",
   "created_utc": 1690343944,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jtha704",
   "message": "Broke my ankle in a muddy puddle with snow on top. Foot got stuck and I fell. Broke 3 bones. My scar is my surgical scar.",
   "created_utc": 1690344100,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthahzo",
   "message": "I have four on each knee. I had four surgeries on them to fix and leg length discrepancy problem. If the stupid hospital didn't mess up twice, I would have only had scars on one knee and only two surgeries.",
   "created_utc": 1690344268,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthakd7",
   "message": "A buddy of mine tried using a box taper to tape my arm right as class got out. There was quite a bit of blood and a (faint) scar but he didn't manage to leave any tape behind.",
   "created_utc": 1690344304,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthalj9",
   "message": "A lot of different ways, and my mood is way too low to share.",
   "created_utc": 1690344321,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthatzb",
   "message": "Skateboard accident, truck, fire hydrant\n\nI skateboarded off a truck into a fire hydrant.",
   "created_utc": 1690344448,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthaxwg",
   "message": "I tried to do a front flip on a trampoline like 7 years ago and now i have a neat tattoo of the braces i had on my knee",
   "created_utc": 1690344508,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthayq5",
   "message": "Got my leg sliced open by a small metal pole outside.",
   "created_utc": 1690344521,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthb5bm",
   "message": "There's too many to explain, but the most interesting looking one was from breaking a beer bottle against a street curb. My index finger is still numb in some areas from the scar.",
   "created_utc": 1690344622,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthbhhm",
   "message": "I was trying to open a bag at work and sliced my knuckle with a serrated knife on accident",
   "created_utc": 1690344811,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthbj2g",
   "message": "I was giving a Wheaton terrier a haircut when it lost its shit and lunged at me, I jumped back and slit my arm wide open with my razor sharp 8” strait shears. Right off to the ER I went 10 stitches later and I have a nice scar on my arm for life because of it. And I still came back and finished the god damn haircut with my arm all wrapped up. I don’t fuck around at work.",
   "created_utc": 1690344835,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthblxa",
   "message": "I was a very clumsy kid and had stitches so many times. I’m now a clumsy adult who works on cars for a living. I try to be careful but my hands and arms look like I stuck them in a crate of angry weasels.",
   "created_utc": 1690344879,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthbot3",
   "message": "School was having an anything but a backpack day and i wanted to bring a stainless steel kitchen sink (that hadn’t been installed into any pipes yet) I put all my stuff in the sink, tried to walk it down the hall out of my house, hit the sink against the wall which made the thin/flat edge of the sink cut my right middle finger open.",
   "created_utc": 1690344924,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthbukh",
   "message": "Car accident, c-section, gall bladder removed, fallopian tubes removed",
   "created_utc": 1690345014,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthbvty",
   "message": "I have one on my hand from petting a shop cat after being warned what might happen if I pet the shop cat. Fucked around, found out.",
   "created_utc": 1690345033,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthbyey",
   "message": "Got attacked by a pitbull, but I won",
   "created_utc": 1690345074,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthc06c",
   "message": "Cut my hand cutting wood with a bow saw. I've seen my bone.",
   "created_utc": 1690345103,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthc4kr",
   "message": "Got one on my left check about two inches below my nipple…\nWas maybe 4 or 5 and was at my friends house. We were playing with this vacuum tube. He had it for awhile then I got it and he immediately wanted it back. So he bit me.. about a month or so earlier he was climbing the rack behind the toilet and fell off catching the top of the porcelain tank with his teeth, so he ripped a chunk off of me that created a huge scar…\n\nOn my forehead, left side, not as noticeable anymore but had a big scar from where I picked a chicken pox and the scab and the next scab and so on…\n\nHave a round burn scar on my right leg right above my knee from melted plastic. I was stoned and melted things to make other things…\n\nRight foot, heel right below the Tendon. Was 20, girlfriend 26 and at the bar, they let me come in as long as I don’t drink but it was otherwise of town and I was in bed stoned watching tv but she begged me to walk over so I did. Metal screen door caught my foot. Didn’t feel much till later when I sobered up and realized how bad it was…\n\nI got a really bad sunburn on my legs one year, like almost third degree was told to put newspaper and pour vinegar on it for some reason by nurses. After keeping it clean and treated finally healed by on my one leg you can still see the pattern from the burn like a bunch of dots…\n\nAnd on my head, I believe right side I have a small pee sized bald spot. Only noticeable when my hair is super short and if I shaved it be a round scar there. When I was still in the womb something happened and they had to put a screw in my head.",
   "created_utc": 1690345173,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthc66y",
   "message": "Got bit by a doggo , got one on my left forearm and my left ankle. Got a side of ptsd , but I’m doing a lot better ❤️ :)",
   "created_utc": 1690345198,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthc7va",
   "message": "1. The one on the back of my head: age 8, tripped backward and fell on the corner of my friend’s TV. The injury wasn’t deep enough for stitches, but the scar is apparently pretty gnarly.\n\n2. The one behind my eyebrow: age 15, had a seizure, hit my head on the table on the way down. This one did require stitches, and it’s pretty small.",
   "created_utc": 1690345225,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthcdbd",
   "message": "Running as a child and I tripped over something. Somehow two of my bottom teeth pierced through the skin right below my bottom lip and cut all the way through to the outside. My lip literally had to be pried free from my teeth.",
   "created_utc": 1690345312,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthcj5m",
   "message": "Compartment syndrome in my right leg. Two huge scars from the fasciotomies and my anterior tibialis muscle is completely removed. Then there's an additional 6 scars from my recent tendon transfer to help with long lasting effects of losing my muscle.",
   "created_utc": 1690345405,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthclc0",
   "message": "\"Attempting\"to wheelie on a motorcycle. The plus side is the scar looks like a shark bite on my ankle.",
   "created_utc": 1690345440,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthcnox",
   "message": "Hit by a truck as a pedestrian while I was in a crosswalk and dragged across the concrete. My left thigh took the brunt of the impact and was scraped down to the muscle. Seven years later, raw skin grew back, but there is a scar the size of a small pizza.",
   "created_utc": 1690345476,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthcrr3",
   "message": "I have a hole in my right knee about the size/depth of pez candy- a neat little rectangle. It's from a human bite- but amazingly, my jeans did not tear while my flesh did",
   "created_utc": 1690345542,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthcxvb",
   "message": "School yard fight - 10 stitches lip \n\nRacket ball slip - 17 stitches chin \n\nBoxing head butt - 20 stitches forehead \n\nTotal Knee Replacement - 60+ stitches knee",
   "created_utc": 1690345641,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthd182",
   "message": "I got kicked by a horse. My husband and I had just started dating, and we went out to see my horse in the pasture. He’s not a horse person, but I’m glad I convinced him to go out there with me. One of the other horses kicked me in the arm trying to kick another horse and my hubs dragged me out of the pasture, tied his shirt around my arm, and drove me to the ER. I needed stitches and still have a big scar on my upper arm. One day I want to get a horseshoe tattoo around it lol I grew up around horses and this was the first time I ever needed stitches/got a visible scar.",
   "created_utc": 1690345696,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthd2g5",
   "message": "Self harmed (by scratching myself) and since I had anorexia I didn’t eat enough for the scratches to heal 😃",
   "created_utc": 1690345716,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthd2xc",
   "message": "One scar is a bicycle accident, the other was a bar fight.",
   "created_utc": 1690345723,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthd6il",
   "message": "i have 5 scars most from burns when i was a kid, i was hit by a metal baseball bat directly in the face, burnt with a iron, and cut with a cooking knife, but eh more scars more unique i am. ….. right?",
   "created_utc": 1690345783,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthd6me",
   "message": "My best friend accidentally stabbed my palm our Sophomore year of high school",
   "created_utc": 1690345784,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthdci9",
   "message": "Head - Wooden Dowel thrown at me, glued the injury back together at the hospital.\n\nHands - Cut myself using carving knives, and a deep cut from wrestling with one of my friends who had nails on.\n\nArms - Picking scabs over and over again as a child.\n\nKneecap - Pencil lead embedded in knee from falling on a pencil.",
   "created_utc": 1690345880,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthdei7",
   "message": "I ran towards my friend and his nail just scratched my face. I didn't feel pain until my teacher noticed and told me.",
   "created_utc": 1690345912,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthdh67",
   "message": "I feel on my knee as a kid.",
   "created_utc": 1690345955,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthdi21",
   "message": "Self harm, getting sober, becoming a welder. Not very friendly on the epidermis",
   "created_utc": 1690345970,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthdkc4",
   "message": "Knife fight in a Bangkok alley.",
   "created_utc": 1690346006,
   "score": 1,
   "submission_id": "159sbz3"
  },
  {
   "comment_id": "jthdnio",
   "message": "When I was like 7 or something, I was at a church friend’s house, every few weekends all the parents with kids would meet up at someone’s house for a potluck, and the kids would hang out.\n\nWell, these people lived near a playground surrounded by woods. Their kids had “forts” in there (they were just little clearings in the woods.)\n\nThe older kid who was about 13, had an area where you had to walk over a fallen log to get there. Under the log there was all kinds of sharp metal and glass that had been there for God knows how long. Us, the children wanted to be like him, a big mature grown up kid! So we walked across the log. It was fine. Nothing happened. \n\nBut then I wanted to go across again. And again. And *again*. Well, friends, you can probably tell what happened next. I fell into the pit of razor sharp, rusted metal and debris. Luckily I escaped with just a massive, incredibly deep cut on the back of thigh and under my knee. But the most pain came from my mother cleaning it with alcohol.",
   "created_utc": 1690346057,
   "score": 1,
   "submission_id": "159sbz3"
  }
 ]
}