{
 "submission_id": "159yzf3",
 "title": "Where did you lose your virginity?",
 "selftext": "",
 "created_utc": 1690357428,
 "permalink": "/r/AskReddit/comments/159yzf3/where_did_you_lose_your_virginity/",
 "score": 221,
 "url": "https://www.reddit.com/r/AskReddit/comments/159yzf3/where_did_you_lose_your_virginity/",
 "comments": [
  {
   "comment_id": "jthw9et",
   "message": "Bold of you to assume I’ve lost my virginity. I never lose.",
   "created_utc": 1690359170,
   "score": 90,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthufu4",
   "message": "If I knew that, it wouldn't be lost, would it?",
   "created_utc": 1690357743,
   "score": 41,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti0xev",
   "message": "funny story. I lost mine in my ex boyfriends room while watching minecraft tutorials. I didn't know I had a condition where I faint caused by orga*m. He thought he killed me my first time when I actually just came.",
   "created_utc": 1690362863,
   "score": 237,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthwn2g",
   "message": "It's still with me. It's too afraid to leave me i guess.",
   "created_utc": 1690359468,
   "score": 0,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthv11p",
   "message": "In my vagina",
   "created_utc": 1690358203,
   "score": 216,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthvqy7",
   "message": "My imagination",
   "created_utc": 1690358770,
   "score": 11,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthwjvq",
   "message": "ex girlfriends bed, boring i know",
   "created_utc": 1690359399,
   "score": 210,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthvnk1",
   "message": "In a movie theater. During a Sunday afternoon showing of Balls of Fury, humorously.",
   "created_utc": 1690358698,
   "score": 116,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti1jxz",
   "message": "Ex's bed. Her brother caught us and beat me up later in school.\n\nEdit: The reason about it was because she was religious and he probably beat his sister as well. We were 14 back then and the brother was 18.",
   "created_utc": 1690363358,
   "score": 17,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthxtiy",
   "message": "Highschool girlfriend's bed while being terrified about her father coming home, who had forbidden her to date caucasians.",
   "created_utc": 1690360403,
   "score": 19,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthx6ne",
   "message": "In my friends mom's bed. \n\nMom wasn't there before you even ask. \n\nShe was on the sidelines cheering me on. Hahaha j/k",
   "created_utc": 1690359892,
   "score": 111,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti2cqb",
   "message": "After my fam was asleep, my girlfriend would sneak over, and we would hang out all night and then I'd sneak her back to her place before her parents were up. To get away with it, the only place we could hang out was in the living room where there was a couch on each wall across from one another, so the night it did happen we pushed both the couches to the centre of the room, worked out great.\n\n I've pulled the akimbo couches a few times since then, and it will always be better than 1 couch",
   "created_utc": 1690363988,
   "score": 169,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthw6z6",
   "message": "Behind some officers dorms, in a wooded area, on base in Korea.",
   "created_utc": 1690359116,
   "score": 166,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthxcy6",
   "message": "In a family bathroom at the mall.\nI was also on my period",
   "created_utc": 1690360030,
   "score": 172,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthy8u1",
   "message": "Whore house. Pretty disappointing experience but it actually helped me lose that absurd sense of unrest around sex and physical contact with women.\n\nEnded up \"getting\" my first gf a couple months later or so and finally got to enjoy myself a bit.",
   "created_utc": 1690360736,
   "score": 175,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti4l9l",
   "message": "Her bedroom after a wonderful dinner and 2 player board games over wine.  Yes I was in my late 20’s when I lost my virginity.",
   "created_utc": 1690365712,
   "score": 229,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthu2y3",
   "message": "In Scotland.",
   "created_utc": 1690357463,
   "score": 218,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthy776",
   "message": "In my girlfriend.",
   "created_utc": 1690360700,
   "score": 179,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti0a5o",
   "message": "On a bed to a hot escort from Michigan who was living in the UK. It was reasonably pleasant experience. Not bad!",
   "created_utc": 1690362352,
   "score": 68,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthvb2o",
   "message": "Back of a car (ford falcon) at a football oval in the nearby mountains. He scored the nickname \"air humper\" among all my friends because at one point, he said,\"ohhh, that feels so good,\" and i said,\".... you're not even in there.\"",
   "created_utc": 1690358422,
   "score": 202,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthzm80",
   "message": "When I studied abroad in Spain",
   "created_utc": 1690361828,
   "score": 136,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthzo9g",
   "message": "In his tiny twin sized bed from 5th grade while his parents were downstairs. His mom walked in without knocking like 2 minutes after we were done while watching jimmy here, id say we were lucky.",
   "created_utc": 1690361873,
   "score": 195,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti2s48",
   "message": "I was on a staircase with a chick I met at the bar. It was fun until the neighbor came…",
   "created_utc": 1690364320,
   "score": 36,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti9o5c",
   "message": "Will update when this happens.",
   "created_utc": 1690369285,
   "score": 224,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthw15z",
   "message": "In a high school gym bathroom. I’m not proud of it, it is one of my biggest life regrets",
   "created_utc": 1690358989,
   "score": 112,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti0cz4",
   "message": "I lost my virginity? That's news to me",
   "created_utc": 1690362413,
   "score": 150,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti1qp2",
   "message": "In a Olympic gold medalists home with his stepdaughter, in Boulder Colorado. No Cap !",
   "created_utc": 1690363504,
   "score": 103,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti19hf",
   "message": "On a building terrace in Bombay",
   "created_utc": 1690363128,
   "score": 35,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti3s3x",
   "message": "My community college dorm room. \n\nI wish I never met her.",
   "created_utc": 1690365098,
   "score": 79,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthyppe",
   "message": "At my neighbor's. They were sisters and we spent a good solid 2 years of spending the night.",
   "created_utc": 1690361114,
   "score": 98,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthzlf7",
   "message": "In the back of a Rover 220 DTurbo with no MOT. Outside an MOT centre. The perfect 'F You'.",
   "created_utc": 1690361812,
   "score": 75,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthzcu1",
   "message": "in the butt, bob",
   "created_utc": 1690361617,
   "score": 55,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti146b",
   "message": "In my room with my first gf on top of me. She was very unhygienic and on the heavy side. I was digusted by her but no one else wanted me so yeah. I didnt feel anything because condom to tight and angle was shit. She came. I didnt",
   "created_utc": 1690363010,
   "score": 126,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthwqy2",
   "message": "I’m a sigma. If you never play, you can’t lose. Haha……god send help",
   "created_utc": 1690359554,
   "score": 60,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti6vqy",
   "message": "Ohh boy here we go. I was studying my master's and 23 years old at the time and used to work at McDonald's part time doing night shifts on Friday and Saturday. Sunday comes around and I wake up at 2pm, roll some weed and go out to the park to smoke. I'm about half way through my j when this 30 yo woman sits next to me. She looks at me and tells me it's been 3 weeks since she's had sex. I asked her to repeat because at that point I've never had any interest shown by a woman. I ask her why it's been so long and she proceeds to tell me how she broke up with her ex. I'm like okay??? She asks me where I live and then it hits me what she was trying to say. I get all excited and happy and proceed to walk her to my place and we do the deed. But I couldn't get that hard so we only fucked for a little bit. After which she proceeds to tell me that she really needs 20 for a cab home. I give her the money and she leaves.\n\nAfter 30 minutes I realise what has happened. I paid for sex for my first time....\n\nWoman whose name I never even asked, if you're reading this, thanks for showing interest. It boosted my confidence for the whole 30 minutes it took me to realise what had happened.\n\nMy other half likes to bring up this story a lot along with another story of me getting arrested because of a misunderstanding.",
   "created_utc": 1690367391,
   "score": 11,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthy1v9",
   "message": "In an escort's hotel room in Manchester.",
   "created_utc": 1690360585,
   "score": 48,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthyay9",
   "message": "It wax my wedding night",
   "created_utc": 1690360784,
   "score": 82,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthyjkk",
   "message": "Chexk your mom's onlyfans.",
   "created_utc": 1690360977,
   "score": 37,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti94ci",
   "message": "In the future",
   "created_utc": 1690368928,
   "score": 7,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti1whq",
   "message": "In my mind😌",
   "created_utc": 1690363630,
   "score": 45,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti3uc0",
   "message": "My cousins bedroom",
   "created_utc": 1690365144,
   "score": 96,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti43vd",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthxu5d",
   "message": "In the back of a GMC Jimmy parked in a McDonalds parking lot. Went and got a snack wrap right after.",
   "created_utc": 1690360417,
   "score": 113,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthzz1y",
   "message": "In a $5 dollar a night hostel on an island off of Honduras",
   "created_utc": 1690362111,
   "score": 19,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti1e8p",
   "message": "Japan.",
   "created_utc": 1690363233,
   "score": 36,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti1fhz",
   "message": "On the track in high school",
   "created_utc": 1690363260,
   "score": 24,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti3edm",
   "message": "On a huge rock about half a kilometer away from the shore in Antalya Kemer, Turkey...\n\nYes it was uncomfortable.",
   "created_utc": 1690364809,
   "score": 118,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti675c",
   "message": "Im a guy. I wanted my first time to be special. Turned down sex a couple of times because it didn't feel right. Ended up losing my virginity at 19 in a toilet at a dirty rock bar.",
   "created_utc": 1690366902,
   "score": 146,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti1i2i",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti2yp6",
   "message": "Inside a WW2 tank.",
   "created_utc": 1690364466,
   "score": 23,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthvswe",
   "message": "Freshman dorm room.",
   "created_utc": 1690358813,
   "score": 22,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthzcab",
   "message": "In the girls best friends bed. Her best friend came home halfway through and slept on a yoga mat outside the door 😂😂",
   "created_utc": 1690361605,
   "score": 8,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti63az",
   "message": "With my ex in a movie theater during a showing of *Unaccompanied Minors*. I was back home from college and she was able to convince her foster parents she was going to see a movie with her friend. It was the first time I ever went down on a girl and her reaction solidified my love of giving oral.\n\nMy first actual BJ was a month later at my work study job from a girl I had just met 30 minutes before we hooked up.\n\nYes, I was still with the ex from my hometown at the time.\n\nI wasn’t a good person back then.",
   "created_utc": 1690366828,
   "score": 9,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthzq9u",
   "message": "In my car",
   "created_utc": 1690361917,
   "score": 24,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti0x9w",
   "message": "In 1996 in the back of my 1988 Mazda Mpv minivan, parked in the corner of the parking lot at a Bennigans Restaurant @ River Oaks mall just south of Chicago.",
   "created_utc": 1690362860,
   "score": 83,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti3vm3",
   "message": "I went to college at Penn and my boyfriend was living in the “nipple” of the Quad, in Trump Jr.’s room from the year before. I lost my virginity in that dorm room. I shudder to think that Trump Jr. did anything on that mattress before me lol.",
   "created_utc": 1690365170,
   "score": 59,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti5b4p",
   "message": "In a tree fort on New Year’s Eve 1975/1976.",
   "created_utc": 1690366246,
   "score": 50,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti64id",
   "message": "My friends basement with his older sister who snuck down during a sleep over it was glorious",
   "created_utc": 1690366851,
   "score": 9,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti7ry5",
   "message": "In the vagina of a beautiful prostitute in the Nieuwstad at Groningen, me being high as a kite on a shitload of amphetamine, coke, xtc and cannabis and awake for a week at that particular moment, now almost 20 years ago.\nI paid for 20 minutes, she was very understanding but I wasn't able to cum so it took about 45 minutes before we called it a day and we showered together afterwards. Btw the lady came multiple times, over and over. She was completely exhausted, but I wasn't, so I hopped back in my car and raced back home and came back to her the next day for another ride, which was fun too.",
   "created_utc": 1690368020,
   "score": 3,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti8e1z",
   "message": "57th floor of the Westin Peachtree Plaza hotel in downtown Atlanta, with some random guy I met on the train. I was 20. Those were fun times...",
   "created_utc": 1690368444,
   "score": 47,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti1pl9",
   "message": "On a hot July night, Tennessee, on a blanket under the stars in the pale moonlight surrounded by fireflies.\n\n\n\n\nNot really but every country music song makes be wish this instead of the reality of loosing it on a older couch in our barn house.",
   "created_utc": 1690363480,
   "score": 71,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti2lbp",
   "message": "Like Blanche Devereaux, I lost it either at a pancake breakfast or in a hot air balloon",
   "created_utc": 1690364175,
   "score": 4,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti4du9",
   "message": "The woods, oddly enough. Just happened in there. One with nature I guess",
   "created_utc": 1690365556,
   "score": 40,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti8jiq",
   "message": "My exes couch. Years later when I was looking to buy a house her mothers was for sale. It was a nice house, so i looked at it. There in the basement was the couch. I told my wife, \"I lost my virginity on that couch.\" She said, \"A couch like that?\" I said, \"No, that couch.\" We didn't buy that house...",
   "created_utc": 1690368549,
   "score": 101,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jtih4ae",
   "message": "The greatest nation of all time \"imagination\".",
   "created_utc": 1690373634,
   "score": 1,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jthy9mv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jtik2fj",
   "message": "I remember the day well, 23 years later… it was Feb 17th of the year 2000. My friend told me that her mom was out and we could bang if I came over right away. It was like 9:20 at night and I said fuck it. I told my dad that my friend had a computer issue and I needed to help her real quick so she could finish an assignment and ran out while he was still grumbling. I get to her place and she points to her couch and says we’ll do it there. \n\nThe thing about her place was, her mom was a hoarder. So there were books and trinkets stacked everywhere. In retrospect, their place was filthy but 17 year old me had a fuck to give and I was going to deliver. \n\nMy friend lays down, and pulls up her dress and tells me to drop my pants and hands me a condom. So there I am, fumbling to roll on a condom in the middle of her dark living room when I look over and notice her cat staring at me. I don’t even care, that cat could judge my little dong all it wanted. I was about to plow her human. \n\nI get the condom on, waddle over to her, because who actually takes their pants off… I begin to lay on top of her when she tells me to pause for a moment while she puts on some music. \n\nSo there I was on my friends couch losing my virginity while listening to Garbage with her cat watching. Best 37 seconds of my life. \n\nWe finish up, we’ll I finished up… and I apologized and she says something along the lines of her not expecting much given it’s my first time. I went back home and hoped no one would realize that I had just had sex. \n\nI went back to her place the next day and when she opened the door I said, “we need to do it again but better”. She just stepped to the side to let me in and we banged it out on that sofa again. This time for something like 20 minutes. \n\nWe fucked when ever I was single for years. I honestly should have married that girl. She was an amazing friend  and we both low key loved each other beyond a friendship. \n\nMeagan, if you’re on Reddit reading this, thanks for always being such a good friend and I’m sorry I sucked as a friend at end when you were moving away.",
   "created_utc": 1690375157,
   "score": 154,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jtib140",
   "message": "I didn’t lose it. I know exactly where it is",
   "created_utc": 1690370145,
   "score": 21,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jtia4ch",
   "message": "With my friend's hot (now ex) girlfriend.\n\nRemarkably, I had his blessing in advance. He knew she was sleeping with other guys, and had a soft spot for me, so he wanted to burst in and catch her cheating, so she couldn't deny it. He wanted to dump her without looking like it was his fault.\n\nHe waited until I'd... finished (noisily) then burst in. But he was almost laughing, and he had a tent pole, too.\n\nIt was a weird break up.",
   "created_utc": 1690369576,
   "score": 134,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jtied79",
   "message": "On a water bed during the after-party lunch thing after my girlfriends grandfather's wake.",
   "created_utc": 1690372122,
   "score": 20,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jtiu2tx",
   "message": "In my bed, to my years long middleschool-Highschool crush after so long of fantasizing about it\n\nIt was awful",
   "created_utc": 1690379711,
   "score": 21,
   "submission_id": "159yzf3"
  },
  {
   "comment_id": "jti56y9",
   "message": "in my bedroom, my mom went to walmart \u0026amp; my dad was cutting the grass. that 30 minute window was my time to SHINE for all of 2 minutes",
   "created_utc": 1690366161,
   "score": 41,
   "submission_id": "159yzf3"
  }
 ]
}