{
 "submission_id": "15a7tjp",
 "title": "What’s the worst part about aging?",
 "selftext": "",
 "created_utc": 1690382785,
 "permalink": "/r/AskReddit/comments/15a7tjp/whats_the_worst_part_about_aging/",
 "score": 81,
 "url": "https://www.reddit.com/r/AskReddit/comments/15a7tjp/whats_the_worst_part_about_aging/",
 "comments": [
  {
   "comment_id": "jtj41d6",
   "message": "Parents getting old and passing away\n\nMiss you Mom",
   "created_utc": 1690383661,
   "score": 119,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj3i0i",
   "message": "Feeling like you are running out of time to do things because the check engine light in my body never goes off now.",
   "created_utc": 1690383453,
   "score": 5,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj20gz",
   "message": "Everything hurts",
   "created_utc": 1690382880,
   "score": 40,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj20kk",
   "message": "For me, generally, regret builds up. The “could’ve, would’ve, should’ve” syndrome is strong in me",
   "created_utc": 1690382882,
   "score": 193,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj1udp",
   "message": "gettin ugly in my case gettin uglier",
   "created_utc": 1690382814,
   "score": 165,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj9tx5",
   "message": "Feeling your body fall apart.",
   "created_utc": 1690385848,
   "score": 155,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj3d3g",
   "message": "Realizing how much you missed and what you could’ve done if you took a different path. For me, I always reflect on how I could’ve been bolder and had a better time if I was just more confident",
   "created_utc": 1690383401,
   "score": 124,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjcwn2",
   "message": "You have fewer and fewer alternative life paths available, and you start to regret the paths that you did take.",
   "created_utc": 1690386980,
   "score": 43,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj7rr9",
   "message": "Seeing everybody else moving forward in life. Being actually good in living life.\n\nWhile you're stuck with no solution nor any way to fix yourself watching how every day slips away from you.\n\nAnd not being able to quit because some people would be fucking sad.\n\nLife is a cruel joke.",
   "created_utc": 1690385074,
   "score": 77,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjm0xw",
   "message": "Soon to be 73 here. The worst? Not being able to do the physical things I did when I was younger. Getting tired easier, sooner. Watching your friends, family die. I'm very fortunate to be healthy enough to work, travel, and not fear a visit to the doctor.\nWhen I was 20, I thought 40 was old, when I was 40, I thought 60 was old. When I passed 60, I figured every day I wake up, get out of bed and know who I am and where I am, is a bonus day. Lol I don't worry about dying as much as I did when I was young. But I do worry about my \"quality of life\" as I grow older.\nI've had a good life, good wife (married 50 years), good career.\n\n\"And now the days are short, I'm in the autumn of my years, and I now think of my life as vintage wine, from fine old kegs, from the brim to dregs, it pours sweet and clear, it was a very good year\". Frank Sinatra-1965",
   "created_utc": 1690390326,
   "score": 39,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj4y9t",
   "message": "I'm technically more fit in my 30s than in my 20s. But if I hurt myself it takes 10x longer to heal.  Hurt my knee? No running for 2 months in my 20s it would be fine after 3 shots of vodka and sleeping it off. Cut myself at 25? No evidence in a week, at 35?  Takes 2 weeks to heal and leaves a scar.\n\nAlso I basically don't drink anymore now that I get hangovers.  Which I guess is a good thing but still sucks.",
   "created_utc": 1690384011,
   "score": 99,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtja4p3",
   "message": "That there are more \"last times\" than \"first times.\"",
   "created_utc": 1690385961,
   "score": 60,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjc3vg",
   "message": "Seeing old pics and videos of yourself and realizing how gradual the change was that you never noticed how much you've aged.",
   "created_utc": 1690386687,
   "score": 57,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtja1qb",
   "message": "Calculating what your current age is the halfway point of in your life.\n\nFor example, if you're 60 and expect to live to 80, you're at the halfway point between 40 and death.\n\nYou can start this in your late 30s (based on life expectancy) and unlock a strange combo...a new way to fear death and a new way to start doing stuff on the harsh realization that you're somewhere on the back 9 of life.",
   "created_utc": 1690385930,
   "score": 25,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj5usw",
   "message": "Joint pain in the knees",
   "created_utc": 1690384356,
   "score": 24,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj9yyt",
   "message": "You have heard all the songs and stories, everything they come up with now feels like a bad copy.\n\nAlso, the amount of things you are doing for the last time, or are never going to do at all, grows and grows.\n\nPeople you love die. People you love stop loving you back. You stop loving people even though they deserve your love.",
   "created_utc": 1690385901,
   "score": 19,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj8nld",
   "message": "The invisibility.",
   "created_utc": 1690385406,
   "score": 42,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtji4xj",
   "message": "I once sneezed and cracked a rib",
   "created_utc": 1690388902,
   "score": 18,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjdv1o",
   "message": "Regret.\n\nReflecting on all the opportunitys you missed, experiences you never had, decision that impacted your life in a negative way.",
   "created_utc": 1690387330,
   "score": 17,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj1xum",
   "message": "Pain",
   "created_utc": 1690382852,
   "score": 33,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjdnq0",
   "message": "For me as a woman it's definitely my looks. I was a late bloomer when it came to my looks but In my early to mid 20s I was so pretty :( I had a bangin body and was so beautiful and I took care of my appearance and took pride in it. Then around 25 life hit me pretty hard and I stopped taking care of myself. I'm now 35 and this year I am finally making an effort to care about my appearance again/ losing all the weight I had put on. This whole time I've been trying to get back to my old adorable 20 year old self. But last night I looked in the mirror and realized no matter how much weight I lose and makeup I start wearing again and clothes I start dressing better in, the 20 yr old adorable young me has been replaced by a 35 yr old woman and the old me is gone forever. No matter how hard I could try, I can't hide that, I don't have the same face I did back then.\n\nSure, I'll be a hot 35 yr old woman but the old me I was trying so hard to get back to is gone and she's never gonna get a chance to come back again... destined to only be seen again in preserved photos and videos. That baby faced beauty, she's now a woman with crows feet and worry lines, splotches of rosacea and baggier eye lids. I've always been the type to say to my friends \"fear not growing old, for many are denied the privilege\" but last night I got so sad about it and it was the first time I ever got upset about getting older. I just had to take a second to mourn the loss of my old self. I told myself I would try not to hold onto the loss too much because I need to embrace this present before it too is gone, so that helped. But a little piece of me has a bit of regret. I wish I did more to look good in my late 20's before I lost my baby face and that \"youthful tenacity\" hall pass, I know this part won't make sense but I wish I didn't let one terrible incident with that one terrible person make me say \"fuck it\" for 10 very important years.",
   "created_utc": 1690387254,
   "score": 29,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj7owc",
   "message": "Everything. As a woman in my late fifties, I have had a hard time dealing with getting old.",
   "created_utc": 1690385045,
   "score": 12,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtje2za",
   "message": "Being invisible",
   "created_utc": 1690387411,
   "score": 12,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjx8q5",
   "message": "That nobody can see you are exactly the same person you always were, just stuck inside a body that no longer matches.",
   "created_utc": 1690394422,
   "score": 11,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj3k6j",
   "message": "remembering what was and what wasn't?",
   "created_utc": 1690383476,
   "score": 10,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj4n4g",
   "message": "Constantly losing friends",
   "created_utc": 1690383892,
   "score": 10,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtje9x9",
   "message": "Your body betrays you.",
   "created_utc": 1690387485,
   "score": 9,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjkofm",
   "message": "I remember when I was a kid I loved Summer breaks. School would let out end of June and so for the next two months, I was free to sleep in, play with my friends, and just enjoy the warm days. Summer was the absolute best. \n\nOne day when I was older I suddenly had this realization that once the day was over, it meant I had one fewer day to enjoy the Summer break, and that it meant I was one day closer to the start of the new School year. So once I hit August I realized that I was halfway through the break, and so the rest of the month was spent not really enjoying the break, but rather being sad and miserable at the idea that I was on the back half of my break. \n\nGetting older is the same. I'm now in my 40s and I have a beautiful and wonderful family. I enjoy them immensely and I couldn't be happier with my life. But I have this realization that as I get older it just means I'm now entering the \"August\" of my life, and that slowly but surely I am entering the back half of my life where my Summer Break will be over, only this time I'm not just losing out on my Summer to go to School, it means I'll be burying my loved ones and dealing with major ailments and illness. Sure I'll enjoy watching my kids grow and blossom, but in the end it also means I'll be saying by to them forever.",
   "created_utc": 1690389842,
   "score": 10,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj1z31",
   "message": "for me its looking back on what i could have done with my time.",
   "created_utc": 1690382865,
   "score": 10,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj27fc",
   "message": "Everything hurts and you get fat.",
   "created_utc": 1690382956,
   "score": 17,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjo8bo",
   "message": "You hit a certain point where you realize your career isn't going to advance anymore, because if you haven't made the leadership ranks by a certain point everyone assumes it's because there's something wrong with you. People stop saying \"it will happen someday\" because now it \\*is\\* someday. And if you work in a youth-dominated field, you're just absolutely fucked.",
   "created_utc": 1690391133,
   "score": 8,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjenpi",
   "message": "Realizing that \"midlife\" is actually 40 and not 50, and that I closer to death than birth at this point (assuming natural cases of course)\n\nI'm having a hard time dealing with the mortality issue, I don't want to not be here for my kids. I don't want to be the reason they hurt so much when I go....\nAnd yet, there's not a damn thing I can do to stop it....\n\nNot having any kind of Control is the big shit of it.....\n\nOur limited lifespan isn't enough.....",
   "created_utc": 1690387626,
   "score": 15,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjjmfb",
   "message": "Saying goodbye to people. Or never getting the chance to.",
   "created_utc": 1690389455,
   "score": 7,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjjy7i",
   "message": "Seeing my parents age has been so tough on me. Dad was diagnosed with CLL this year but after 4 chemo treatments, he’s back driving truck at 74. Mom was just diagnosed with Parkinson’s. She’s had bad shakes for several years and now finally went in. They recommended that my dad retire to take care of my mom. The problem is, they’re so used to being apart days at a time and finding it tough to live together. It’s sad but so common I’d imagine…",
   "created_utc": 1690389575,
   "score": 7,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj2a7m",
   "message": "Regret of not listening sooner to your inner voice.",
   "created_utc": 1690382987,
   "score": 5,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjdgyw",
   "message": "I think my 30’s are my best decade yet, but also time goes WAY faster as you get older. I’m turning 35 this year. I was 25 like 2 weeks ago. What the fuck happened.",
   "created_utc": 1690387185,
   "score": 6,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjgbv9",
   "message": "my metabolism is so slow and its getting harder to lose weight",
   "created_utc": 1690388244,
   "score": 6,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjjfx8",
   "message": "Meh...not too worried about it.  Is what it.  All I can do is eat good.  Try not to drink too much booze.  Drink tons of water.  Exercise as much as possible and enjoy life.  I'm in my early 50's and stronger than I was when I was 20.  In great physical and mental shape.  Happier than I've ever been.  Looking forward to the future but living a healthy lifestyle as best I can to make sure I won't need someone wiping my ass for me when I get really old.  If that happens, my wife has orders to push me off a cliff.",
   "created_utc": 1690389389,
   "score": 6,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj2aaw",
   "message": "Young peoples’ naive perception of what aging is. Until it happens, you literally have no idea what it’s like.",
   "created_utc": 1690382989,
   "score": 10,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj8hyn",
   "message": "You feel the same as you did when you were young and it doesn't seem all that long ago but then you look in the mirror and look like a completely different person.",
   "created_utc": 1690385347,
   "score": 5,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjhu16",
   "message": "Knowing the clock is winding down as the number goes up.",
   "created_utc": 1690388792,
   "score": 5,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtk25zt",
   "message": "Becoming irrelevant. I work on the same campus I attended 40 years ago, and I feel the looks saying, “You don’t belong here anymore.”",
   "created_utc": 1690396236,
   "score": 6,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj9gdo",
   "message": "Time flying by.",
   "created_utc": 1690385708,
   "score": 3,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjafmz",
   "message": "Remembering what you could still do when you were younger, but didn't.",
   "created_utc": 1690386073,
   "score": 4,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjhltl",
   "message": "Everything just hurts for no reason...",
   "created_utc": 1690388709,
   "score": 4,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjjed3",
   "message": "The extra pain for no reason",
   "created_utc": 1690389373,
   "score": 3,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjjyce",
   "message": "the memory of looking better...snd pictures to prove it",
   "created_utc": 1690389576,
   "score": 4,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjp8nh",
   "message": "Loneliness. The world can easily just forget you.",
   "created_utc": 1690391506,
   "score": 4,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj1xu5",
   "message": "not being young",
   "created_utc": 1690382852,
   "score": 3,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj65a3",
   "message": "Seeing younger people do parkour shit you used to do",
   "created_utc": 1690384467,
   "score": 3,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjbcfz",
   "message": "Getting further away from your childhood and getting more and more entrenched into the burden of responsibility and societal expectations",
   "created_utc": 1690386406,
   "score": 3,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjjnau",
   "message": "Watching my parents get old.\n\nI cannot fathom how I’m going to handle losing them.",
   "created_utc": 1690389463,
   "score": 3,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjp0pj",
   "message": "It has a limit.",
   "created_utc": 1690391425,
   "score": 3,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjv8o2",
   "message": "Having an awareness of what you missed and what you may have accomplished by choosing a different course. For myself, I often think back on how I could've been braver and enjoyed myself more if I was simply more self-assured.",
   "created_utc": 1690393697,
   "score": 3,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtk3nft",
   "message": "A 20 year old mind with desires to do stuff and a 71 year old body that won't let you. What's worse is finding \"the one\" spending the last 21 years together and realizing it probably won't last another 20.",
   "created_utc": 1690396783,
   "score": 3,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtkatq6",
   "message": "Watching young people make the same mistakes you made in youth, even after you warn them.",
   "created_utc": 1690399407,
   "score": 3,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj1xyk",
   "message": "Getting grey and wrinkly I'd imagine.",
   "created_utc": 1690382853,
   "score": 5,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj53ij",
   "message": "Responsibilities",
   "created_utc": 1690384066,
   "score": 4,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjl2dm",
   "message": "Going about life and generally feeling forgotten about. Ads, marketing, dating, technology… it’s all designed for younger people. That crop top at the store isn’t meant for my 35 year old body. Now I’m just a “ma’am” and people either don’t take me seriously or speak to me like I’m a Karen before I even open my mouth.",
   "created_utc": 1690389981,
   "score": 6,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj2vl3",
   "message": "Dying",
   "created_utc": 1690383215,
   "score": 3,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj4e1j",
   "message": "I'm 24 and going grey. Seeing the oldness of it kills me.",
   "created_utc": 1690383797,
   "score": 4,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj1w3l",
   "message": "Getting closer to death and not being able to do things as well as before",
   "created_utc": 1690382833,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj3dbn",
   "message": "Aging itself",
   "created_utc": 1690383404,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj6f3h",
   "message": "Aging",
   "created_utc": 1690384571,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj6ztb",
   "message": "You fucking die at the end",
   "created_utc": 1690384788,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjadku",
   "message": "joint pain",
   "created_utc": 1690386052,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjaiku",
   "message": "People dying around you :(\n\nThe absolute worse about timing moving forward.",
   "created_utc": 1690386102,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjblvc",
   "message": "Becoming a crippled mess",
   "created_utc": 1690386504,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjc1tz",
   "message": "Next to losing people, slowly losing your appetite for new things and being bored with the old.",
   "created_utc": 1690386666,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjd4nb",
   "message": "Shorter memory and cognitive decline.",
   "created_utc": 1690387061,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjjgll",
   "message": "Constant aches and pains.",
   "created_utc": 1690389396,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjk5bq",
   "message": "Your body breaking down",
   "created_utc": 1690389647,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjkeno",
   "message": "Physically unable to do the things your body use to be able to do without hesitation.",
   "created_utc": 1690389743,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjkpld",
   "message": "Pain",
   "created_utc": 1690389853,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjrai7",
   "message": "My parents are in their very late 80's. The hardest part for them is not the aches or pains, it's not the quadruple bypass my dad had, it's not failing hearing/eyesight/memory. The hardest part of aging is the loneliness. All their friends have passed away. All their brothers and sisters have gone before them. They still have us, their children, but it's not the same. Everyone they knew are now gone. This is by far the hardest part of aging.",
   "created_utc": 1690392258,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjvcru",
   "message": "Diminishing health and arthritis. Everything hurts all of the time, constantly, and you can be in pain or be a drug addict. Those are the options. I think the feeling I get from my annual check up is equivalent to what other people feel while bungee jumping. Going to the doctor is scarier than any horror movie could dream of being.",
   "created_utc": 1690393739,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjxe23",
   "message": "Either aging like fine wine or aging like milk",
   "created_utc": 1690394476,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjy24n",
   "message": "It's so fucking lonely.",
   "created_utc": 1690394724,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtk2auw",
   "message": "Losing your physical abilities, if you haven’t been a maniac about staying healthy when young.",
   "created_utc": 1690396286,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtk3paj",
   "message": "Loneliness.",
   "created_utc": 1690396802,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtk89qx",
   "message": "You ever put your shoes on too hard and throw your back out?\n\nYou ever sneeze too hard and throw your back out?\n\nYou ever wake up too hard and throw your back out?\n\nYou ever turn your head too fast and throw your back out?\n\nYou ever try to make yourself more comfortable while sitting and throw your back out?",
   "created_utc": 1690398467,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtkaqe6",
   "message": "A trip to the doctor isn’t just “Take these pills for a week and you’ll be fine”. It’s now a multitude of “rest of your life” conditions. Also, fast and strong, is now slow and steady. Bummer.",
   "created_utc": 1690399373,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtkbh1y",
   "message": "Recovery slowing down. Things you used to heal from in a day take a week.",
   "created_utc": 1690399648,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtkbt47",
   "message": "Your knees giving out",
   "created_utc": 1690399773,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtkbt9a",
   "message": "Going to more funerals than weddings...  \n\nSlowly loosing the ability to do the things you used to do when u were younger.... Having your body start to fail you before your mind..",
   "created_utc": 1690399774,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtkbyjs",
   "message": "Most simply, loss.",
   "created_utc": 1690399829,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtkcb93",
   "message": "When even though you're retired and thought you'd seen the last of a daily calendar, you now have more doctor appointments than you ever had business meetings.",
   "created_utc": 1690399949,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtkcj2k",
   "message": "Society kinda stops acknowledging that you exist.",
   "created_utc": 1690400027,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtkkvbn",
   "message": "Not having the memory that I used to... Wait, was that what I was going to say? 🙄",
   "created_utc": 1690403071,
   "score": 1,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj9pyx",
   "message": "Having to deal with this new generation of idiots",
   "created_utc": 1690385807,
   "score": 3,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj28az",
   "message": "Gettin' stomped in the dick repeatedly.",
   "created_utc": 1690382966,
   "score": 2,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtjxy9u",
   "message": "Realizing many health issues could have been prevented if you just prioritized taking care of yourself",
   "created_utc": 1690394685,
   "score": 1,
   "submission_id": "15a7tjp"
  },
  {
   "comment_id": "jtj7f6i",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15a7tjp"
  }
 ]
}