{
 "submission_id": "15abwcg",
 "title": "What are your thoughts on the congress hearing on UFOs?",
 "selftext": "",
 "created_utc": 1690392164,
 "permalink": "/r/AskReddit/comments/15abwcg/what_are_your_thoughts_on_the_congress_hearing_on/",
 "score": 81,
 "url": "https://www.reddit.com/r/AskReddit/comments/15abwcg/what_are_your_thoughts_on_the_congress_hearing_on/",
 "comments": [
  {
   "comment_id": "jtjv1pp",
   "message": "Was definitely an interesting hearing. Some wild statements made by both the witnesses (tic tac description, description of \"non-human intelligence\", football field size crafts, etc) and congress members (video of large orbs in formation).\n\nIf there is truth to these statements, hopefully the public will eventually get to see the hard evidence.\n\nAlso hard to discount that this is one of the few topics both republicans and democrats seem to agree with each other on. Not sure if that lends credibility to the topic, but points to them knowing more from closed door cessions that the public has seen. This is further corroborated by the multiple comments of over classification and the need to declassify at least old material\n\nEdit: For those interesting in watching the actual hearing and listening to the witnesses and congress men and women themself (instead of second hand comments on reddit), here is the official link to youtube. [https://www.youtube.com/watch?v=KQ7Dw-739VY](https://www.youtube.com/watch?v=KQ7Dw-739VY)",
   "created_utc": 1690393626,
   "score": 88,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjuvi0",
   "message": "If it’s all true 🛸, I hope they come to help.",
   "created_utc": 1690393564,
   "score": 112,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjspkp",
   "message": "Credible high ranking former U.S. Navy and Air force officers testified under oath to UAP and related satellite imagery, radar data, electro optical data and visual contact.\n\nAnother intelligence official stated under oath they have retrieved crashed UAP craft with biological evidence and that defence contractors were involved.\n\nI think this needs to be investigated and pushed to get some transparency because this is starting to sound like the scandal of all scandals.",
   "created_utc": 1690392774,
   "score": 205,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjz4g0",
   "message": "It’s interesting that it’s being taken seriously but I’d want to see tangible evidence before I believe it myself.",
   "created_utc": 1690395114,
   "score": 225,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjtkxg",
   "message": "More UFO hearings for this House of Representatives than climate hearings",
   "created_utc": 1690393093,
   "score": 75,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjus4i",
   "message": "It is quite intriguing and there’s a lot of (on paper) credible people testifying. But… The evidence isn’t exactly irrefutable. Until and unless we get that solid, unquestionable evidence (or a UFO lands on the White House lawn) then I think this is going to be a whole load of nothing, sadly.",
   "created_utc": 1690393530,
   "score": 56,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtk0qo6",
   "message": "[removed]",
   "created_utc": 1690395712,
   "score": 73,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjzpul",
   "message": "Only thing we actually know is that the government WANTS you to believe in alien spacecraft.",
   "created_utc": 1690395334,
   "score": 91,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjtu50",
   "message": "I’d be surprised if the whole thing wasn’t a distraction from some kind of geopolitical or governmental issue tbh",
   "created_utc": 1690393187,
   "score": 66,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjtakl",
   "message": "Also, people need to remember that hard evidence usually goes public DURING or AFTER investigations, not before they begin. Otherwise, the accused would already be in cuffs.  \ncalling all researchers, by the way https://www.reddit.com/r/UFOs/comments/159w041/request\\_for\\_help\\_putting\\_together\\_a\\_timeline\\_with/?utm\\_source=share\u0026amp;utm\\_medium=web2x\u0026amp;context=3",
   "created_utc": 1690392989,
   "score": 51,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjrm3l",
   "message": "No evidence.  No story.  \n \nsame as decades before. paper trails don't mean much.",
   "created_utc": 1690392375,
   "score": 181,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtk4jng",
   "message": "It's difficult to say because we really don't know anything yet. Some of Grusch's claims seem reasonable (government not disclosing details of UFO encounters) while others seem downright bonkers (retrieval and reverse engineering of nonhuman spacecraft.)\n\nI could believe that there have been sightings of drones or vessels of unknown origin, but it's much harder to believe that such vessels are known or proven to be of otherworldly origin or that they move with no propulsion system. The latter would break the laws of physics, and an alien spacecraft would still be subject to the laws of physics.  \n\nSo while I think it's absolutely possible, even probable, that there have been and still are experimental aircraft both from within and outside of the USA that have been uncovered, I would need convincing evidence to entertain the idea that they could be from another planet.  \n\nI find it difficult to believe that an extraterrestrial race would be present on or around earth without publicly making themselves known, and it's not exactly the sort of thing that would be easy to hide either.  \n\nGrusch's claims fall apart quickly when examined closely. No one questioned has any evidence to support any of these claims, and even Grusch himself admitted he has never seen any of these things himself, yet he nevertheless insists that aliens and alien spacecraft must both necessarily be real. Basically he's using circular logic; the fact that there is no evidence proves there's a coverup, which proves the aliens are real. It's actually pretty sad when you break it down.  \n\nI have no doubt that people have seen UFOs/UAPs. I do not believe there is any evidence to support claims that these unidentified \"things\" are alien in nature. I think it's a case of a handful of individuals who want to believe looking for an excuse to believe.",
   "created_utc": 1690397102,
   "score": 101,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjubu9",
   "message": "The inter-dimensional hypothesis just blows my freaking mind. I can sort of wrap my head around warp drives and humanoids coming from light years away, but possible dimensions we can't perceive...what!?",
   "created_utc": 1690393367,
   "score": 53,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjunji",
   "message": "Not impressed until unmistakable visual and physical evidence is made public. They can flap at the gums all they want until then.",
   "created_utc": 1690393484,
   "score": 83,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtk0l72",
   "message": "Regardless of how this turns out, I still think butt probe insurance is a scam.",
   "created_utc": 1690395657,
   "score": 49,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjridf",
   "message": "Kinda crazy to think that there's a congress hearing on UFO's tbh. I doubt much will come from it, though.",
   "created_utc": 1690392338,
   "score": 10,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtk5okt",
   "message": "I'm skeptical about it being aliens. It's likely just spy aircraft they don't want public.",
   "created_utc": 1690397517,
   "score": 107,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtk1nop",
   "message": "Typical Congress, real world in shambles and their attention is on more stupid ass shit that changes nothing.",
   "created_utc": 1690396050,
   "score": 28,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtk0hy9",
   "message": "Its cool, but like...wtf are we supposed to do with this information? We still have bills to pay lmao",
   "created_utc": 1690395624,
   "score": 11,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtk0rwn",
   "message": "I'm desperately interested in the idea that aliens could visit earth. I want to be alive to learn about a completely alien culture.\n\nAnd the more information I've gathered, the more I think there has never been an extraterrestrial, sentient presence on Earth. There probably aren't any aliens we would recognize as intelligent within thousands of light years of Earth. FTL travel is probably impossible, and even if it's not, the distances involved could still be prohibitive.\n\nThe painful part is that it is a near-certainty that recognizably intelligent life exists in the universe, just by overwhelming probability.",
   "created_utc": 1690395724,
   "score": 9,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjui47",
   "message": "Nothing really. People hear the word UFO and Immediately assume batshit insane conspiracy theories about aliens and whatnot. They started to look into it more recently, as these supposed extraterrestrials look suspiciously like spy drones of enemy nations. They are an every day occurance in plane and maritime circles, most people don't really give a shit about them.\n\nUfo contains U, meaning unidentified. That is that. We don't know what it is. This doesn't mean extraterrestrials. Drones, debris, other aircraft, even kites and balloons picked up by wind fall into this category.",
   "created_utc": 1690393430,
   "score": 17,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtkcl6p",
   "message": "I don't give a fuck. Send Trump to prison",
   "created_utc": 1690400049,
   "score": 2,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtkj8ta",
   "message": "It's all so... Just out of this world.",
   "created_utc": 1690402476,
   "score": 15,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtkgall",
   "message": "I should have started my alien podcast a few years ago to catch on this hype",
   "created_utc": 1690401401,
   "score": 1,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjwpxi",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjxfum",
   "message": "I think it's a sign of the general dumbing down of not only our people but our leadership. How about that climate change? You guys are eating up a trail of shit like ET eating Reeses Pieces.",
   "created_utc": 1690394495,
   "score": 7,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtk5k0n",
   "message": "More boring no evidence crap. Bunch of old dudes having public fantasies.",
   "created_utc": 1690397471,
   "score": 5,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjsg9g",
   "message": "If anyone would like to pitch in to construct a timeline of credible ufo 'waves' or periods of increased sightings juxtaposed with major world events and legislation, here is the link to what I have so far. I think that, either this is all theater to distract from something else, or it's really true. I lean true.  https://www.reddit.com/r/UFOs/comments/159w041/request\\_for\\_help\\_putting\\_together\\_a\\_timeline\\_with/?utm\\_source=share\u0026amp;utm\\_medium=web2x\u0026amp;context=3",
   "created_utc": 1690392680,
   "score": 3,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjwymb",
   "message": "It’s so amazing what they are saying without evidence that I’m going to have to dismiss it outright unless they provide some evidence.",
   "created_utc": 1690394319,
   "score": 3,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtk0fk6",
   "message": "Deflect the population's attention from the actual lizard people in Congress.",
   "created_utc": 1690395600,
   "score": 3,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjv52d",
   "message": "Enormous waste of time",
   "created_utc": 1690393660,
   "score": 3,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjt8e9",
   "message": "Can't wait for next year's \"Flat Earth\" hearing",
   "created_utc": 1690392966,
   "score": 3,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtkgawv",
   "message": "A waste of time to keep people distracted with conspiracy theories.",
   "created_utc": 1690401405,
   "score": 1,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjytgw",
   "message": "complete bullshitry",
   "created_utc": 1690395001,
   "score": 2,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjv0s1",
   "message": "The world isn't ready for aliens",
   "created_utc": 1690393617,
   "score": 2,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjxlmm",
   "message": "A few thoughts here.\n\nGrusch is either telling us the truth which makes the most sense since he is testifying under oath or this is all a scam to sell an upcoming book he has in the works.\n\nOn a more personal level I do believe that he is telling the truth. Our government is shady. Always has been. Makes sense that we would try to conceal what we do know about UAPs to keep foreign adversaries on their toes (ie possible development of alien tech for military purposes).\n\nI have always maintained that if extraterrestrials do come here then we are screwed. No way they want to \"help\" us. The only reason a more intelligent species would have for visiting Earth (a less intelligent species since we do not possess lightspeed travel) would be for Earth's resources. As we have seen time and time again with colonization/crusades. We have absolutely nothing to offer them in terms of knowledge or the betterment of their lives. Only resources.",
   "created_utc": 1690394555,
   "score": 1,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtk40ks",
   "message": "Next up: the Easter Bunny",
   "created_utc": 1690396914,
   "score": 2,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjvnra",
   "message": "What big scandal are they trying to distract from this time?",
   "created_utc": 1690393850,
   "score": 3,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtjxdtw",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtkjbxr",
   "message": "Honestly, if this is all true, and I personally believe it is, it will be a gradual reveal to the public culminating in a true paradigm shift across society. The US government and indeed many other governments across the world have all of the motivations imaginable to have concealed the existence of foreign vessels in our skies for decades. Specifically speaking for the US, keeping UAP retrieval and possible alien bodies secret from the public for as long as possible would have been paramount for both national security and avoidance of mass panic in the streets. The military industrial complex would prefer to have a technological advantage over enemy nations in terms of reverse engineering craft for potential use in conflict as well as economic trade secrets, and I suspect Russia, China, UK, Canada, and others are in a similar boat, with limited intelligence sharing between allies. I believe we are entering a pivotal, groundbreaking era in gradual disclosure to the public. It's going to be a wild ride.",
   "created_utc": 1690402508,
   "score": 29,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtk5yhy",
   "message": "They should have a hearing about the ocean being literally as hot as a hot tub instead",
   "created_utc": 1690397618,
   "score": 128,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtkiy0x",
   "message": "\"It's a cookbook!!\"",
   "created_utc": 1690402368,
   "score": 26,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtkp396",
   "message": "I’d love to see the GOP obsess over this and leave the trans and LGBTQ communities alone. Like, let’s move on to something or someone else to yell about, sigh.",
   "created_utc": 1690404615,
   "score": 11,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtksul6",
   "message": "So much came out in this hearing, but the one piece of info that will surely ignite Congress and other UAP researchers is the mechanism for funding these off-book programs: IRAD’s are about to become HIGHLY scrutinized.",
   "created_utc": 1690406009,
   "score": 3,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtk3mp4",
   "message": "Answer: a whistleblower named David Grusch, who was formerly a representative to the USA's Unidentified Aerial Phenomena Task Force, came forward in June alleging that the US government had recovered intact non-human spacecraft and the bodies of their pilots. He has also alleged that the secretive program in charge of the captured non-human material has murdered US citizens in order to keep their activities secret.\n\nIn order to legally act as a whistleblower, Grusch first had to clear all the information he planned to publicly reveal with the US government to ensure that no classified information would be exposed, which they allowed. This could indicate that Grusch has revealed legitimate, non-classified information, but could also indicate that his claims were not classified because they do not relate to an existing government program.\n\nAfter Grusch gave testimony to Congress [Official hearings are scheduled for later this month] After hearing Grusch's story, Senator Chuck Schumer introduced an amendment that would create a commission with the ability to declassify government records related to this topic, which is modeled after a similar commission created to declassify information related to the JFK assassination. This amendment is likely to pass and become law as part of an upcoming defense spending bill.\n\nUp to this point, no evidence other than individual testimony related to Grusch's claims has been released. Grusch says that he has seen evidence (images and reports) that back up his claims, but that they are classified and cannot be publicly released.",
   "created_utc": 1690396775,
   "score": 5,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtktj0h",
   "message": "I just watched it. This dude said he can't say anything because he'll be on \"News Nation\". For someone who is a whistle blower, he's not providing much information that is soluble... But he'll release it later on a show.\n\nAlso, all these relics are just spitting anti-Biden talking points.\n\nHe was also talking about \"The Holographic Principle\" to explain their travel. Uh... Look it up...",
   "created_utc": 1690406270,
   "score": 5,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtkmzqw",
   "message": "👾👽🛸",
   "created_utc": 1690403847,
   "score": 2,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtkw9f8",
   "message": "Although there was a lot said, what I find interesting was what could NOT be said.\n\n‘Was there a campaign to divert public attention away from uaps’  - can’t answer that \n\n‘Have there been a misallocation of funds concerning this government research and covering it up’ - can’t answer that in detail but yes \n\n‘Who do we need to contact to get these answers? Who is in charge’ - can’t answer that \n\nThey touched on things being over classified. I agree. \n\nBut also! When they said that they only release these low quality, shitty videos when they have much higher resolution cameras. Sketchy.",
   "created_utc": 1690407333,
   "score": 1,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtkxnv5",
   "message": "I think most of the “gasp” moments will be from people who are just super into conspiracy theories but appear to be highly credible and convincing.\n\nThere will be very little to no actual evidence other than grainy and blurry footage/photos. \n\nI’m a stern believer that there’s life out there. I’m not convinced the evidence for it will be found here on earth nor will the first evidence of extraterrestrial live be advanced enough to have made a spacecraft that can travel light years to end up here.",
   "created_utc": 1690407881,
   "score": 24,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtkzd9o",
   "message": "Will I somehow be taxed for this",
   "created_utc": 1690408549,
   "score": 157,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtkzqit",
   "message": "What else is going on with the government today that they want us to be distracted from?",
   "created_utc": 1690408693,
   "score": 1,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtl1lx0",
   "message": "Tom Delong is salivating",
   "created_utc": 1690409427,
   "score": 9,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtk3tp9",
   "message": "Answer: The legislation in question is an amendment proposed for the National Defense Authorization Act by Chuck Schumer and co-sponsored by a bipartisan group of senators. The Schumer part is a REALLY big deal because he is the Senate Majority Leader and a member of the Gang of Eight. The legislation calls for the immediate transfer of any and all records related in any way, shape, or form to UAPs to the National Archives, where they will be placed in a special collection. A review board will be established, with members appointed by the President, to work through reviewing and declassifying these records ASAP. Notably, the amendment specifically states that there should be a presumption that all records will be declassified and that the panel is basically determining if there’s a reason that certain records CAN’T be. All of the details of this process, timelines, definitions, etc are all outlined in the amendment in iron-clad and minute detail.\n\nThis is an incredible development for many, many reasons, but notably that Chuck Schumer would not propose such a “controversial” amendment without being given the ok from the White House (they cannot have Biden vetoing legislation proposed by a Democrat, and the majority leader no less), and because of the seriousness and specificity of the amendment. Tl;dr, they are not messing around anymore and the Schumer amendment would almost certainly result in not only Disclosure but the release of many many pieces of evidence that the government has been hiding for 80 years.",
   "created_utc": 1690396845,
   "score": 10,
   "submission_id": "15abwcg"
  },
  {
   "comment_id": "jtkhkkl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15abwcg"
  }
 ]
}