{
 "submission_id": "15aer4m",
 "title": "What was ruined for everybody by one person?",
 "selftext": "",
 "created_utc": 1690398625,
 "permalink": "/r/AskReddit/comments/15aer4m/what_was_ruined_for_everybody_by_one_person/",
 "score": 205,
 "url": "https://www.reddit.com/r/AskReddit/comments/15aer4m/what_was_ruined_for_everybody_by_one_person/",
 "comments": [
  {
   "comment_id": "jtkgu7s",
   "message": "The shoe bomber",
   "created_utc": 1690401601,
   "score": 228,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtk9b7j",
   "message": "The kid who jumped off of 7th floor of a building here in Turkey because he thought he was a Pokemon. They stopped airing the show because people thought it was \"bad influence\" on kids. And Pokemon was huge back when i was a kid so pretty much every kid back then was devastated.",
   "created_utc": 1690398849,
   "score": 75,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtka4g6",
   "message": "Back in the middle ages when I was a child in Detroit the electric company gave out free light bulbs. You kept the burnt out ones in a bag, and when it was full Dad would take it to Detroit Edison and exchange them for free ones. Then some guy who owned a store (I remembered it as a pharmacy) sued because he couldn't sell light bulbs and that was the end of free light bulbs.",
   "created_utc": 1690399151,
   "score": 115,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkb4o4",
   "message": "The toothbrush mustache.  Made famous by people like Charlie Chaplin and Oliver Hardy, ruined forever by Hitler.",
   "created_utc": 1690399520,
   "score": 225,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtk9ulp",
   "message": "The Swastika by Hitler. It Was once a Symbol of Peace in parts of asia.\n\nEdit: as a reply pointed out, the swastika is of course something different from the Nazi hakenkreuz, although he still appropriated it to fit his Agenda.",
   "created_utc": 1690399049,
   "score": 181,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkrssr",
   "message": "The [sushi terrorist that licked things](https://mothership.sg/2023/02/sushiro-conveyor-belt/) on the conveyor belt of Japanese chain Sushiro for clout, making them stop doing the conveyer belt thing. \n(Tbf, he wasn’t the only one, but the one that comes to mind.)",
   "created_utc": 1690405613,
   "score": 26,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtlhdka",
   "message": "The world, by the parent who was supposed to be watching their kid at the Cincinnati zoo.",
   "created_utc": 1690416100,
   "score": 8,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtknacn",
   "message": "Remember the chick that licked all the ice cream in the store?\nNow we got a bunch of plastic shit to cut through",
   "created_utc": 1690403957,
   "score": 10,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtk9n77",
   "message": "There was a coffee shop that everyone loved that did the thing where if you buy 8 drinks, you get the next one for free.  For 2 years I went there religiously at least once a week.  Then one day, they told us that the stamp cards were no longer good because someone had stolen the stamp and had been abusing it by stamping their own cards.  I just didn't like the accusatory tone when they explained to us what happened, I felt like I lost something that I made an effort to earn (although only maybe 5/8th of one drink), and they were punishing the loyal customers.  It was just terribly handled.  I never went back after that.  The once bustling coffee shop that everyone loved closed down 6 months later.\n\nBasically, they probably killed their business over one person who maybe got a few free drinks at most.",
   "created_utc": 1690398972,
   "score": 39,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkijva",
   "message": "The second Temple of Artemis. Way to go Herostratus...",
   "created_utc": 1690402224,
   "score": 230,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkiwtn",
   "message": "Masturbating on planes. Thanks a lot bin Laden.",
   "created_utc": 1690402355,
   "score": 45,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtktv7w",
   "message": "JFK's Parade",
   "created_utc": 1690406400,
   "score": 73,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkze49",
   "message": "Your last meal before execution in the U.S. used to be whatever you wanted, until one guy ordered an 18 course feast and didn't touch it. After he was executed a law was passed saying all death row prisoners' last meal would be the same as all the other prisoners.",
   "created_utc": 1690408558,
   "score": 84,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtknbbt",
   "message": "Submarine tourism by Stockton Rush.",
   "created_utc": 1690403967,
   "score": 21,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtl0o7k",
   "message": "I used to work at the YMCA teaching children from 3-11 swimming lessons.The amount of times the pool closed because someone shit in it or puked and had to be rechlorinated….. guys just don’t use public pools.\n\nIt’s more sanitary to to get piss drunk in a kiddie pool sitting in warm piss water in your lawn then setting foot in a public pool.",
   "created_utc": 1690409067,
   "score": 35,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtl14ak",
   "message": "Not sure if its been said but Kanye ruined Kanye for everybody",
   "created_utc": 1690409242,
   "score": 7,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkjto9",
   "message": "This god damn question. Here are the top answers, as usual:\n\nHitler and his mustache. \n\nHitler and the swastika.\n\nHitler and the name Adolf/Adolph.\n\nRichard Reed and taking your shoes off at the airport.\n\nKevin Spacey and House of Cards.\n\nPeewee Herman and porn theaters.",
   "created_utc": 1690402690,
   "score": 99,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkkh4e",
   "message": "Bill Murray refused to do another Ghostbusters movie and was the single holdout among Ivan Reitman, Harold Ramis, Dan Akroyd who together owned creative control of the project.",
   "created_utc": 1690402930,
   "score": 152,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtksmp5",
   "message": "I know \"Shitler\" is the popular \"fit in with the cool kids\" answer...I'm going a different direction. \n\nThe asshole who poisoned Tylenol in the 1980s and made it acceptable to make everything, not even just medications, very tamper proof, but also pretty damn user proof if you have any dexterity limitations at all.",
   "created_utc": 1690405925,
   "score": 167,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtko3kc",
   "message": "Pokémon cards at my school. Some Kid lost a battle and (as playground rules dictate) he had to hand over his losing card to the victor. However, this was a particularly rare card that had suffered a surprise loss when his opponent whipped out an even rarer and more powerful Pokémon to battle it. The kid never expected the defeat and had no intention of handing the card over; a fight broke out and teachers got involved. Being this was one of a multitude of Pokémon related fights breaking out at the time, the teachers (at the end of their tether) gave the boy a choice; hand over the card or Pokémon gets banned in the school…. And that’s why my school had no more Pokémon from that moment on.",
   "created_utc": 1690404254,
   "score": 169,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkv4wx",
   "message": "Vaccines by Andrew Wakefield. Thanks to that ass hat we have way too many antivax idiots",
   "created_utc": 1690406890,
   "score": 30,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtl17ry",
   "message": "Red baseball caps.",
   "created_utc": 1690409281,
   "score": 217,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtk9m8u",
   "message": "Wrestlemania 9 - Hulk Hogan",
   "created_utc": 1690398962,
   "score": 161,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkkodh",
   "message": "Vaporeon",
   "created_utc": 1690403002,
   "score": 195,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtk93ej",
   "message": "Twitter aka x",
   "created_utc": 1690398768,
   "score": 249,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtl17l9",
   "message": "That one guy who operated heavy machinery after taking prescription drugs has ruined it for the rest of us.",
   "created_utc": 1690409279,
   "score": 113,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtl56o8",
   "message": "Gender reveals during fire season.",
   "created_utc": 1690410906,
   "score": 80,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkw9yr",
   "message": "Airport security. Everyone was just chillin’ taking flights and then Bin Laden had to fly a plane into a building… twice!",
   "created_utc": 1690407339,
   "score": 188,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtk92q9",
   "message": "Recess in the 2nd grade.  We all had to miss it (once) thanks to one person.",
   "created_utc": 1690398761,
   "score": 191,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtl159p",
   "message": "The Cosby Show.\n\nBecause of Cosby.",
   "created_utc": 1690409253,
   "score": 245,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkfgd8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtl0jj9",
   "message": "A shit ton of symbols have had their meaning completely changed because some mentally ill dude got rejected by an art school",
   "created_utc": 1690409014,
   "score": 232,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkb21s",
   "message": "The quality of airlines and flying",
   "created_utc": 1690399493,
   "score": 139,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkhuq6",
   "message": "The shoe bomber ...\n\nDamned taking off shoes in the airport.....",
   "created_utc": 1690401970,
   "score": 48,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtki2r1",
   "message": "Irving Gould Ruined the whole computer gaming era. Back in the day Mac’s were for artists, PC for boring engineers, and Amiga was waaay ahead for gaming. Irving then mismanaged the whole commodore company that made the Amiga, and the whole home gaming was moved towards they way worse PCs. I’ve always imagined what gaming would have become if he didn’t ruin it for everyone.",
   "created_utc": 1690402051,
   "score": 163,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtldya6",
   "message": "The name \"Karen\"",
   "created_utc": 1690414637,
   "score": 139,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkszlc",
   "message": "Reddit by u/spez",
   "created_utc": 1690406062,
   "score": 212,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkwop6",
   "message": "Twitter, by Elon Musk. Pretty basic, I know but geez. This man's just an arrogant child with waay to much money",
   "created_utc": 1690407499,
   "score": 24,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtl21lx",
   "message": "Fucking Erebus",
   "created_utc": 1690409602,
   "score": 28,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkwekw",
   "message": "Whatever slack-jaw fuckwit had their username set as \"Han-Solo-Dies\"",
   "created_utc": 1690407388,
   "score": 85,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtl4eh9",
   "message": "Kombucha was ruined by Lindsey Lohan. At least it had to be altered and or labeled differently. She had an ankle monitor on and that’s how the powers that be discovered that kombucha has alcohol in it.",
   "created_utc": 1690410581,
   "score": 95,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkx3w8",
   "message": "Beatles reunion ruined by Mark D. Chapman.",
   "created_utc": 1690407664,
   "score": 25,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtkzytn",
   "message": "Cosby show reruns",
   "created_utc": 1690408784,
   "score": 7,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtle1mk",
   "message": "Martin Shkreli",
   "created_utc": 1690414676,
   "score": 31,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtl1o57",
   "message": "Star Trek  with Alex Kurtzman as show runner",
   "created_utc": 1690409448,
   "score": 12,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtl1k4l",
   "message": "The female body image, by the Kardashians. Yes, I consider them all one person, since they all seem to have been built by the same plastic surgeon. Millions of girls and women worldwide seem to think that surgery, teams of hairdressers, nail and make-up artists, personal stylists, shapewear, Instagram filters and photoshop make them real women. That whoie family should be cancelled, instead they're billionnaires. Sign of the times  ..",
   "created_utc": 1690409410,
   "score": 23,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtki8gy",
   "message": "The Presidency.\n\nYou know who did it.",
   "created_utc": 1690402108,
   "score": 63,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtk8y6p",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtlv8td",
   "message": "I hate to be dark but, as a gymnastics coach: people like Larry Nassar and my own coach \n\nAs a gymnastics coach myself, I have to be extremely careful how I touch a kid in a sport where I have to….pick them up and move their body around and stuff. And obviously, I’d never purposefully put my hand in an inappropriate spot, but if I accidentally do while saving a kid from falling or something I have to profusely apologize and feel anxious. 99% of the time, the kid doesn’t even notice I grabbed them or something. Or, they don’t care because they’re happy I saved them from snapping their neck. \n\nSome gyms ban coaches from giving a kid a hug and whatnot. We have strict rules in the gymnastics world where two or more adults have to be with a kid if they are alone in the gym. Which hey, I support. When I train male coaches, I tell them to be extra careful since they are more likely to get accused. Groomers gonna groom, but if a guy accidentally brushes a girl’s boob when he spots her, it shouldn’t be world ending. With the abusers that people know of primarily being men, male coaches are watched like hawks. I can get away with a gaggle of little four year olds tackling me and laying on me for a group hug. A male coach has to be veeeery careful.\n\nBut, it’s sad it has to be like that. I wish I could text a kid myself, set up a private lesson, meet them at the gym alone, we work on stuff, their parent picks them up. That’s not reality. People should just…not be weird to kids. Adults should be respectful and not abuse their privilege and a child’s innocence.\n\nNow, people have a terrible perception of the sport I love because of the abuse myself and others faced. And, I don’t blame them.",
   "created_utc": 1690422124,
   "score": 81,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtlfn7b",
   "message": "Someone installed an AC incorrectly in their window at my in-laws building. It ended up falling out and killing a 2 year old girl and now everyone is banned from using window AC's 🫠\n\n(This was in Scarborough - Toronto)\n\nEdit: Words",
   "created_utc": 1690415358,
   "score": 203,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtl8aa7",
   "message": "The guy who stole my Amazon package. I used to have treats outside my door for delivery people but decided to remove all the snacks and the basket they were laid on.",
   "created_utc": 1690412211,
   "score": 116,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtluneu",
   "message": "Elections. It used to be that when someone lost an election, they'd accept it, concede gracefully, and that would be that. Now because of our whiny former president, election losers feel emboldened to scream \"it was rigged\" and never accept their loss.",
   "created_utc": 1690421861,
   "score": 105,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtlw1iu",
   "message": "Masculinity by that emotionally inept asshole Andrew Tate",
   "created_utc": 1690422477,
   "score": 99,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtlth6y",
   "message": "The internet was ruined by whoever it was that invented pop-ups. And video ads, for that matter.",
   "created_utc": 1690421340,
   "score": 93,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtlu9yj",
   "message": "That one fucking kid that swallowed the kinder toy\n Fuck him",
   "created_utc": 1690421696,
   "score": 170,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtlu627",
   "message": "The arsonists who set the Quebec forests ablaze, placing the North western hemisphere under smoke for a third of our summer..... Natural disaster caused a lot of the fires still going today but intentional sabotage didn't help.",
   "created_utc": 1690421648,
   "score": 48,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtluvgt",
   "message": "Guys on 9/11 ruined flying honestly. All the security means when u fly u have to get there super early and stand in lines all day.",
   "created_utc": 1690421960,
   "score": 40,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtlquzz",
   "message": "Coronavirus —\u0026gt; no more snow days",
   "created_utc": 1690420196,
   "score": 50,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtlqwlp",
   "message": "2-3 years of recent life. By whoever fucked that pangolin.",
   "created_utc": 1690420214,
   "score": 13,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtlresn",
   "message": "Telemarketing. Owning a phone used to be a good thing, now almost every phone call is some shady insurance scam or panhandler looking for money.",
   "created_utc": 1690420436,
   "score": 29,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtl4dv2",
   "message": "Twitter oh I'm sorry, X",
   "created_utc": 1690410574,
   "score": 17,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtlultm",
   "message": "The word Trump",
   "created_utc": 1690421842,
   "score": 28,
   "submission_id": "15aer4m"
  },
  {
   "comment_id": "jtlk0ly",
   "message": "Jared ruined the Subway diet.\n\nI mean, the Subway diet was always a sham that was basically intermittent fasting mixed with anorexic tendencies, but he sure shattered the illusion.",
   "created_utc": 1690417247,
   "score": 15,
   "submission_id": "15aer4m"
  }
 ]
}