{
 "submission_id": "15ag3xv",
 "title": "Do you believe “Aliens” exist and what is your reasoning?",
 "selftext": "",
 "created_utc": 1690401724,
 "permalink": "/r/AskReddit/comments/15ag3xv/do_you_believe_aliens_exist_and_what_is_your/",
 "score": 60,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ag3xv/do_you_believe_aliens_exist_and_what_is_your/",
 "comments": [
  {
   "comment_id": "jtkhi1e",
   "message": "Of course. We are a grain of sand on a beach to the universe. But this one grain of sand is SO special that it's the only one to contain life? It's not a lack of other lifeforms but an abundance of distance between them.",
   "created_utc": 1690401843,
   "score": 145,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkhil0",
   "message": "Yes. There's an unknown number of galaxies and planets out there, possibly billions, trillions, who knows. The odds of us being the only beings in existence is next to impossible.\n\nI don't believe they're ever visited earth, though.",
   "created_utc": 1690401849,
   "score": 39,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkh8q7",
   "message": "Yes, it's a good movie",
   "created_utc": 1690401747,
   "score": 18,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkji78",
   "message": "It's a big fucking universe. Probably life on another planet somewhere.",
   "created_utc": 1690402572,
   "score": 20,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtko74f",
   "message": "To quote the book/movie contact:\n\n\"It would be an awful waste of space\"",
   "created_utc": 1690404291,
   "score": 9,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtklj7o",
   "message": "Yea! The universe is beyond huge. The chances of earth being the only planet with life is really low.\n\nWhether or not Aliens are already on /know about our planet is kind of a crazy thought. Crazy as in fun to think about",
   "created_utc": 1690403313,
   "score": 8,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl5fj0",
   "message": "This is one of my favorite subjects to talk about, the Fermi paradox. Why haven’t we found them? Statistically they should be there, even if you account for the right circumstances leading to life on a planet being exceptionally rare. The answer to this question is likely terrifying, whether it’s something like a great filter(some event always happens to advance civilizations that wipes them out) or there is a predatory species out there that’s wiping everything out. We could also be the first too, or we could live in a backwater part of the galaxy, or we could just lack the necessary tools to find them",
   "created_utc": 1690411007,
   "score": 6,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl3kjt",
   "message": "People always assume aliens mean super intelligent beings but from a mathematical perspective, there is most likely life or living organisms in other planets/solar systems. Even just bacteria or cellular life elsewhere is amazing to me and highly probable.",
   "created_utc": 1690410234,
   "score": 5,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkq1b5",
   "message": "Dude said under oath they’re here lol",
   "created_utc": 1690404958,
   "score": 19,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkmiun",
   "message": "While it's plausible that extraterrestrial life exists, it's more likely that such life takes the form of simpler organisms rather than technologically advanced civilizations. Technologically intelligent aliens might be exceedingly rare. Our inability to detect them can largely be attributed to the vast expanses of space and time.\n\nFor instance, even if a civilization comparable to ours existed on Proxima Centauri, our closest star at 4 light-years away, our current technology would not be capable of detecting their radio signals due to signal weakness.\n\nFurthermore, their societal and technological development would have to align precisely with ours. As a species, humans have only had the capability to send and receive radio signals for slightly over a century. This is an extremely short span of time when contrasted with the billions of years of Earth's existence, illustrating the minuscule chance of aligning with an alien civilization in terms of technological development.",
   "created_utc": 1690403676,
   "score": 17,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl2hp8",
   "message": "Yes. Statistical probability dictates they exist.",
   "created_utc": 1690409785,
   "score": 8,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkod6f",
   "message": "I just want a spaceship, hopefully this opens up the doors for other whistleblowers and the release of energy efficient technologies to the public",
   "created_utc": 1690404352,
   "score": 4,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl3ipu",
   "message": "I think it was Neil deGrasse Tyson who said the odds of a planet producing life or somewhere around 1 in a trillion so with a septillion planets just in our observable universe, it seems like a mathematical probability that life is out there somewhere",
   "created_utc": 1690410213,
   "score": 4,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkxbgt",
   "message": "Yes because with how indescribably large and old the universe is it’s a complete statistical impossibility that complex and intelligent life has yet to develop elsewhere but earth. They just aren’t spacefaring yet. Even if are they’re most likely millions to billions of light years away with no possible way of knowing we exist either",
   "created_utc": 1690407747,
   "score": 3,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl3bgj",
   "message": "LeBron James",
   "created_utc": 1690410130,
   "score": 3,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl3sof",
   "message": "We're here so makes sense there's others,",
   "created_utc": 1690410329,
   "score": 3,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl5ifd",
   "message": "Yes. We cannot be the only sentient life in the universe.",
   "created_utc": 1690411040,
   "score": 3,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl9a0a",
   "message": "The universe is just way to big, with a large enough sample size even super unlikely events become common",
   "created_utc": 1690412640,
   "score": 3,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl9bdx",
   "message": "I would bet that they are because our system is surrounded by infinite space. There’s no way there aren’t aliens. I’d also bet there are different ‘Earth’s out there all over the place.",
   "created_utc": 1690412656,
   "score": 3,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtlc1gy",
   "message": "My friend, who worked for NASA, once made a *really* interesting argument about this. He’s a scientist and I work in politics so hes much more smarterer than me so ill try and condense it down. \n\nEssentially, he said that given the scale of the universe, the statistical probability of alien life existing is almost 100%. However, based on what we know of how energy works, their ability to move between galaxies etc would require energy production at a scale in which it would be difficult for our space surveillance systems not to have picked up on. So his assessment was essentially that the aliens that exist are probably not technologically advanced enough to even be able to communicate with us, based on how we understand space travel and energy to work. So its not that they dont exist *per se*, its more that we dont have an ability to understand how they would be able to visit us.",
   "created_utc": 1690413815,
   "score": 3,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkhc8k",
   "message": "Yes the movie is available and pretty good",
   "created_utc": 1690401783,
   "score": 5,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkonpi",
   "message": "Probably exist, but I doubt they've been here\n\nIt's not just the distance, it's all existing at the same time as us, theyve probably existed and burned out or they haven't got going yet.",
   "created_utc": 1690404459,
   "score": 4,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkhzp9",
   "message": "It's impossible for us to be the only living things in the universe.\n\nOtherwise it's 2 things: God exists and only made us or this is a simulation and the publishers don't have even processing power or ram.",
   "created_utc": 1690402020,
   "score": 2,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtktnlr",
   "message": "I 100% believe in aliens, to think we're the only possible form of life is crazy, but I do remember I once was looking out the bus window when my marching band was on our way to a parade. There was this massive black triangle thing in the sky and a few of us noticed, so we (of course) were trying to get people's attention, but we drove by a really wide and tall building, so it went away. We were telling people to wait and see, but it just disappeared. Some thought we were lying, but we didn't care. We just wanted to figure out what that thing was. I'm open to suggestions about what it could have been if not something unexplainable, but it'll take a hell of a lot to convince me there's no such thing as aliens.",
   "created_utc": 1690406320,
   "score": 2,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtlbar4",
   "message": "In the wise words of Lil Dicky: \"Why would we be the anomaly?\"",
   "created_utc": 1690413503,
   "score": 2,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtlbdxk",
   "message": "Lot stars out there dude. I doubt our planet is the ONLY damn one. 🌌",
   "created_utc": 1690413539,
   "score": 2,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtle89c",
   "message": "Statistically there would have to be.\n\nI really doubt aliens have visited us, though. More likely there's lots of planets with protobacteria in their seas and thin films of algae analogs covering the surface. Maybe primitive plants and animals.\n\nA short list would maybe have non sapient life or life that could *maybe* be sapient if it evolved the right prerequisites. In order to form an intelligent, cooperative civilization like humanity you'd need the ability to communicate, appendages that can build and use tools, and brains capable of expanding and learning.we have a few species on Earth right now that are up against this line now but can't cross it for various reasons (monkeys can use and make tools but their communication is limited and they're kinda dumb. Corvids like ravens are smart and can communicate but can't make tools. Octopi are smart and have good limbs but no communication or ability to make tools. Porpoises are smart, social, and have a rich vocabulary but... no hands.)\n\nSo I think alien life is certain but we probably built the pyramids ourselves.",
   "created_utc": 1690414756,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtlfczp",
   "message": "Absolutely.\n\nGiven how easy it is to start the process of life (a few organic compounds made from elements at the top/plentiful area of the periodic table and some electricity), and how many potential chances there are to create it in the universe (the Deep Field photos show there's a LOT more stars and planets than we ever expected) it has to exist.\n\nNow, how far up the evolutionary chain such life is, that's a different question. There will be a lot of life further down the chain (much like Earth), and probably some life further up. I'm sure there some statistical curve that'll fit. There will be life constrained by the conditions of its starting place. There's probably a planet out there that just has some amoebae and fungus because that's all it can support. And there's probably a planet out there that's gone through multiple iterations of advanced life rising and going extinct (see also: Dinosaurs). The problem is that they're all just reaalllllyyyy far apart.\n\nAnd if you want to throw a circular logic curve at it, aliens definitively existed the moment we landed on another celestial body. So, yeah. They exist, and they are us.",
   "created_utc": 1690415237,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtlh1k9",
   "message": "Do I believe that there's life out there somewhere? Yeah sure. Do I believe that it's been here with us? No. I really don't. Getting through the vastness of space is something that's so advanced that it's incomprehensible to most people. Also people have been seeing things in the sky they can't explain since long before written history. So what do you give credence to? Just the past decade? Century? Thousands of years? And then what? They come here and do donuts over the ocean? \n\nI understand the appeal of believing they're here, but every time some person gets hyped up as the person that's going to prove it, it never happens. Five years ago it was Bob Lazar and now the UFO community hates him, today it's Dave Grusch. Honestly I'm going to need a lot more evidence, any evidence, beyond \"Someone told me that this incomprehensibly advanced craft crashed in the 30s and the Vatican took it, then they gifted it to the USA and we haven't been able to figure it out.\" \n\nMy belief will change when I'm shown evidence that's solid.",
   "created_utc": 1690415957,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl2wdg",
   "message": "Yes. Believing that we're alone in the universe (or even this galaxy) is the height of arrogance.",
   "created_utc": 1690409955,
   "score": 3,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkhns9",
   "message": "there's no evidence. so i don't have good reason to believe they exist. until proven otherwise. but i like to think they do",
   "created_utc": 1690401902,
   "score": 4,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl0u18",
   "message": "no, for the same reason i don’t believe in a supernatural deity: a complete lack of physical evidence.",
   "created_utc": 1690409129,
   "score": 4,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl2xv6",
   "message": "Exist? Yes. Visited anywhere near us? Nah. We can barely get to and back from our own moon. They wouldn’t be interested in us. Even if they noticed us, which is doubtful, they would see we are far from establishing even a solar system wide axis of control.",
   "created_utc": 1690409973,
   "score": 2,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkhxkz",
   "message": "Nah it's been years people claiming they exist but there's none, they just say this from time to time just to get famous or attention",
   "created_utc": 1690401999,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl8xsh",
   "message": "No. Not only does it not make sense, there is no evidence of it. If anything, carbon-based life are the aliens.",
   "created_utc": 1690412494,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl193r",
   "message": "Most people say \"yes\" roughly because \"the universe is ultra big\".  \n\n\nLet me present a counterargument.  \n\n\nIt is easy to imagine that universe is so big it is pretty much infinite. That logic hints that it must contain all sorts of stuff including many different life forms.  \n\n\nHOWEVER  \n\n\nWe don't quite know yet how life emerges from lifeless material. Because of that, we can't truly estimate how probable it is. As far as we are concerned it may be pretty much so rare that one could say it is \"infinitely\" rare...  \n\n\nNow in an infinitely big universe everything, even the rarest thing should happen. But ... we don't have any evidence that confirms that the universe is truly infinite. As far as we know it is just very big. Every time infinity pops up in physics is because of a math glitch of a physics model not reflecting the nature of reality. I think even most scientists when they say that universe is infinitely big they don't really mean it - they are just saying that it is VERY FKIN BIG.\n\n  \nSince the infinity of the universe is not provable let's just assume that it is VERY FKIN BIG.  \n\n\nBack to life from lifeless matter - we don't know how that happens and we are not even close. OP didn't specify what 'kind' of aliens he is asking about so I am assuming civilized and intelligent ones. So for that to emerge there are some conditions that must be met for the most primitive life forms to emerge, then they have to become multicellular, then they have to have the possibility to evolve, then the evolution has to take the right path, then the intelligent species has to survive long enough to learn about the world.  \n\n\nThis is a very rough description, there may be steps before my description and after which we don't know.\n\nNow imagine that list of conditions and events required to happen in order is long. It may be very long. It can be infinitely long. Nah infinity does not exist so let's say the list of the steps is VERY FKIN LONG.  \n\n\nAssuming all that it is easy to imagine the probability of it all happening could be low. If the list contains 1000 steps and each step has a 1/6 probability of occurring (like rolling 1 on dice) and each step requires the one before to happen correctly... The probability can be VERY FKING LOW. Like throwing 1 on a dice 1000 times in a row. Now we don't know how many steps there are but some steps may be ridiculously improbable. Like they have a chance of happening 1/10000000 or much fking less.\n\nTaking all the above into consideration the universe probably is VERY FKIN BIG but the probability of intelligent life forms emerging is probably VERY FKING LOW.  \n\n\nSO HOW ARE YOU ALL SO SURE THE UNIVERSE IS FKING BIG ENOUGH FOR THIS EVENT OF VERY FKING LOW PROBABILITY TO HAPPEN MORE THAN ONCE?  \n\n\nHere are some yt materials on the topic (watch in order, or watch only the first one).  \n\n\n[https://www.youtube.com/watch?v=8wa1l7M5gU8](https://www.youtube.com/watch?v=8wa1l7M5gU8)  \n[https://youtu.be/\\_Tju7EaSfmM](https://youtu.be/_Tju7EaSfmM)\n\n  \nKind regards\n\nyazoodd",
   "created_utc": 1690409296,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkhry5",
   "message": "Yes,too many of 'em in America these days.",
   "created_utc": 1690401944,
   "score": 0,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkhmjv",
   "message": "No. It’s unlikely they exist; however, never impossible.",
   "created_utc": 1690401889,
   "score": 0,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkn1oz",
   "message": "Definitely. The universe being as infinitely vast as it is, it would be illogical to not believe in them. It would be narrow minded to believe that we are alone.",
   "created_utc": 1690403868,
   "score": 0,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkij63",
   "message": "Yes. Saw a UFO several years ago.",
   "created_utc": 1690402217,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkiwx3",
   "message": "I'm alien",
   "created_utc": 1690402356,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkjnvs",
   "message": "Yes\n\nReason: My mom is from Poland",
   "created_utc": 1690402629,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkk0ka",
   "message": "Yeah, I have that DVD",
   "created_utc": 1690402761,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkk5lm",
   "message": "No, this is a fairytale",
   "created_utc": 1690402814,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkmavv",
   "message": "It's very narcissistic to think that we are the only intelligent beings in the entire fucking universe. There are others out there and they are probably way smarter than we are.",
   "created_utc": 1690403594,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtknxu0",
   "message": "The chance theres no „Aliens“ somewhere out there is basically 0.",
   "created_utc": 1690404195,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkojmh",
   "message": "There are an estimated 200,000,000,000,000,000,000,000 stars in the universe. There's for sure life out there somewhere.",
   "created_utc": 1690404418,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkp4ck",
   "message": "Maybe, I feel like if space is supposed to be unlimited and we exist then there must be more life somewhere, we might never meet but I don't see how we could be the only life in something unlimited",
   "created_utc": 1690404626,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkpd60",
   "message": "entire solar systems are like grains of sand on the beach y'all\n\nof course there is aliens out there\n\n//\n\nalso consider the sand that has ever existed on earth so time is also a factor of a few of the solar systems having life at the same time",
   "created_utc": 1690404715,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkq0h7",
   "message": "Yes, the statistical impossibility in not only the universe but our own galaxy is too hard to ignore.",
   "created_utc": 1690404950,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkqcvp",
   "message": "If there were and people know about it, it wouldn't be a secret for long. So are there? Maybe but if they visited here, yeah, we'd know about it.",
   "created_utc": 1690405077,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkqsb9",
   "message": "Because Tom DeLonge said so. Obviously. \n\nBut also, the universe is absolutely infinitely huge, there’s no way we are the only inhabited planet",
   "created_utc": 1690405233,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtks26o",
   "message": "I love it when op responds to all the comments",
   "created_utc": 1690405712,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkuun3",
   "message": "The universe, let alone our galaxy, is too massive to assume that we are the only living things in it. \n\nNow do I think we have ever been visited by aliens or will we ever meet aliens. I don’t know. I think there are a lot of valid theories for why we may never meet an alien species.",
   "created_utc": 1690406778,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkuuxz",
   "message": "Yes. Because we exist. Countless variations of life exists in this one planet. Same dynamics apply universally.",
   "created_utc": 1690406781,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkuwwn",
   "message": "it depends on how you define aliens. I do believe there are  microorganisms in our galaxy,  and there may be larger life forms somewhere  out there. I don't believe in 👽 though",
   "created_utc": 1690406802,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkv00b",
   "message": "If aliens don't exist, then we are the saddest existence in the universe.",
   "created_utc": 1690406835,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkw7fy",
   "message": "I believe there is no reason to believe something exists with zero evidence. There is currently zero evidence for the existence of life beyond Earth. That being said I think it would be really great if life was discovered beyond the Earth, and I respect the search.",
   "created_utc": 1690407312,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkwhio",
   "message": "Yes and no.\n\nTo say Earth is the only planet in the universe to have life is kind of ridiculous when we consider the absolute massive size of the universe. It's so big, we don't know how big it is.\nWe are a fraction of a fraction in comparison to the universe as a whole.\n\nHowever, I believe if there was other intelligent life within our solar system, we would know about it.\n\nWe've explored more of space than our own oceans. Surely, if there was an intelligent life to be found with our nearest neighbours, we would have found it by now.",
   "created_utc": 1690407420,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkyaj5",
   "message": "Guaranteed that there’s smart life out there. To deny it shows the limited understanding of how massive the universe is. \n\nIf the chance of other civilizations existing is only 1 in a Trillion. Then there’s 200 Billion civilizations out there.  \n\n200 Billion Trillion (equals 200 sextillion) is the estimated number of stars that exist. Most people cannot comprehend that number or how statistically impossible it is that were are the only ones.",
   "created_utc": 1690408127,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkzmj3",
   "message": "For sure extraterrestrial life exists, the universe is too big. We may find evidence of simple life elsewhere in this solar system but we will never encounter anything from beyond, the universe is too big.",
   "created_utc": 1690408650,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkzqns",
   "message": "Drake equation…",
   "created_utc": 1690408695,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkzu8u",
   "message": "The idea that we're alone in the universe is terrifying.",
   "created_utc": 1690408734,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtkzxfh",
   "message": "Yes. I also wonder if the light saturation closer to the middle of the galaxy inhibits a brilliant species from exploring beyond their atmosphere because there are no apparent celestial bodies.",
   "created_utc": 1690408770,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl03wo",
   "message": "Yes, it's just a numbers game \nErath is about 4billion years old, humans have only been crawling on its surface for 20 thousand? Years or so, and we just learned how to fly in the last 100 years.  \n\nWe aren't even a type 1 civilization yet, I'm sure there are type 2,3,4 and beyond that got there by being older than us.\n\nEvolution didn't stop because we have thumbs",
   "created_utc": 1690408840,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl0gkb",
   "message": "They certainly exist. I belive that due to us being here and space being hugely, ridiculously big.\n\nI'm gonna need a lot of fucking pictures to declare that aliens made it *here*  though.",
   "created_utc": 1690408981,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl0k7l",
   "message": "Hey mom, there's something in the back room",
   "created_utc": 1690409022,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl1cvf",
   "message": "I can’t believe something without proof. Sure there could be aliens out there my answer is no until we find them.",
   "created_utc": 1690409339,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl2jeo",
   "message": "I saw a Spaceship once and It was probably an experimental drone to fuck up with people\n\nSo apart from life forms that are not comprehensible  to us Humans I guess the answer is no",
   "created_utc": 1690409805,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl2nug",
   "message": "I don’t believe anything strong like that without proof…\nSo I agree with the theory and math behind the number of stars, planets \u0026amp; galaxies…that life must exist plentiful elsewhere.\nDo I believe aliens constantly visit earth and have lost craft and aliens, that have been recovered? \nNO. Not even remotely. I do believe people lie and love  attention and storytelling (and how trauma can warp one’s understanding of what’s happening).\nI don’t trust people…and their words.\nI trust truths. Where there is tangibility",
   "created_utc": 1690409856,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl3134",
   "message": "Yes but we haven't came in contact with them.",
   "created_utc": 1690410010,
   "score": 1,
   "submission_id": "15ag3xv"
  },
  {
   "comment_id": "jtl3om6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ag3xv"
  }
 ]
}