{
 "submission_id": "15ak1ns",
 "title": "What's the most ridiculous thing you've heard someone say that they were 100% serious about?",
 "selftext": "",
 "created_utc": 1690410812,
 "permalink": "/r/AskReddit/comments/15ak1ns/whats_the_most_ridiculous_thing_youve_heard/",
 "score": 29,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ak1ns/whats_the_most_ridiculous_thing_youve_heard/",
 "comments": [
  {
   "comment_id": "jtl7ozs",
   "message": "I knew an American guy who claimed that bears were not dangerous to humans. He claimed that if you were ever attacked by a bear all you would need to do is stick your thumb up its anus and it would immediately fall asleep. \n\nYeah I can just see an angry bear stop attacking you the minute you tell it to \"Bend over.\"",
   "created_utc": 1690411955,
   "score": 255,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlf3nu",
   "message": "I heard one customer tell another that Joe Biden was really Jim Carey and it was all a ruse lol",
   "created_utc": 1690415128,
   "score": 236,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlg3nv",
   "message": "[removed]",
   "created_utc": 1690415552,
   "score": 185,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl5lvp",
   "message": "That when we were in the Caribbean we were seeing a different moon. Their moon.",
   "created_utc": 1690411078,
   "score": 136,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl5hdy",
   "message": "jfk is alive.",
   "created_utc": 1690411028,
   "score": 69,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl79a4",
   "message": "I overheard a guy talking to someone at the bus but sadly i could not hear it all:  \n\"The government is secretly burying peoples corpses to prevent earthquakes (...?)!",
   "created_utc": 1690411770,
   "score": 186,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl7rqc",
   "message": "the northpole is the closest place to space on earth",
   "created_utc": 1690411987,
   "score": 193,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlc5ed",
   "message": "This weekend my 75 year old neighbor told me with absolute certainty that women are allowed to get an abortion up to two weeks after the baby is born.",
   "created_utc": 1690413863,
   "score": 35,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl6mkx",
   "message": "My brother in law confidently said that Obama was responsible for the 08 crash and great recession. \n\nHe absolutely would not admit he was wrong and Bush was president in 2008. \n\nWhen I showed him multiple sources, including from GWBs own website...\n\n\"That's fake news and you can't believe anything on MSM websites\"\n\nI literally wanted to carve my brain out with a spoon.",
   "created_utc": 1690411502,
   "score": 104,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlcmpf",
   "message": "I was doing an OB ultrasound on a patient. The patient was worried the baby was going to chew through the umbilical cord.",
   "created_utc": 1690414070,
   "score": 212,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlcuan",
   "message": "\"Trump is the most Christian President ever\". I was flabbergasted at that statement, couldn't reply and just never talked to the person again.",
   "created_utc": 1690414161,
   "score": 141,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlckx1",
   "message": "The earth is flat",
   "created_utc": 1690414049,
   "score": 113,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl58l9",
   "message": "The covid jabs are to turn people into 5g antennas",
   "created_utc": 1690410928,
   "score": 24,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl5o4q",
   "message": "I heard a bearded woman say she washed her hair in beer. She also claimed to be related to Stone Cold and have a Bengal tiger as a pet, so maybe 100% is a stretch.",
   "created_utc": 1690411103,
   "score": 58,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtle1w8",
   "message": "Off the top of my head, one of my co workers VEHEMENTLY arguing that the moon isn't real.",
   "created_utc": 1690414679,
   "score": 63,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtliuy5",
   "message": "I knew we were in trouble when before the 2016 election someone said to me, about Trump, “He came from nothing!” As if he was a self made man, born into poverty. I looked at them confused and said, “huh? He was born rich.” I don’t think they believed me.",
   "created_utc": 1690416746,
   "score": 76,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl5myd",
   "message": "My SIL once said their father had a heart attack because they (my SIL) missed church one day.  As in god punished her.  Her father was not a man who took care of himself or watched what he ate.  It was a minor thing and he totally survived.",
   "created_utc": 1690411090,
   "score": 187,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl5bm6",
   "message": "That they could win a fist fight against a rutting buck.",
   "created_utc": 1690410962,
   "score": 115,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtla6a7",
   "message": "The CIA only committed so many crimes against humanity because the KGB infiltrated them and set them up with false info/made them do it.",
   "created_utc": 1690413023,
   "score": 49,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlj3gq",
   "message": "My mom said the craziest thing I have ever heard a person say in real life. She was driving me and herself to her place of work so I could spend the day helping. I don’t even remember what led up to it, but she told me she thought it was the government’s job to round up gay people and give them the choice to either covert to Christianity or die. It was, to this day, the most shocking thing I’ve ever heard someone say in seriousness.",
   "created_utc": 1690416849,
   "score": 6,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtla7as",
   "message": "The Holocaust hasn’t happened YET but it will soon because my cousin will start it except he’s gonna put white people in camps",
   "created_utc": 1690413035,
   "score": 62,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtldvg9",
   "message": "\"The titanic was fake. The ship can not be in the Pacific Ocean\" said my science tutor..",
   "created_utc": 1690414603,
   "score": 114,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlal5c",
   "message": "The longest hole in Russia (12km) is a gate of hell",
   "created_utc": 1690413199,
   "score": 134,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtliri6",
   "message": "\"Wouldn't it be cool if we could see in 3d?\"",
   "created_utc": 1690416704,
   "score": 23,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtle706",
   "message": "The Soursop (custard apple [guanabana in Spanish]) is a cure for cancer but big Pharma have been hiding it in order to sell their poisons.\n\nIf only a fairly common fruit, whose juice you can get in most bigger supermarkets was a cure for the many thousands of diseases under the umbrella of cancer.  That really would be nice. \n\nIt’s a mixture of wishful thinking (a magic fruit) and conspiracy theories about evil Pharma. Can Pharma be evil - sure Purdue was very evil pushing OxyContin.   Most people are very glad for their life saving medicines though that help us address so many diseases that were once death sentences.",
   "created_utc": 1690414741,
   "score": 127,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlg9ry",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl8cp4",
   "message": "\"It's summer when Earth is closer to the sun.\" \n\nAn idiot boomer in my office truly believed this, but couldn't explain why summer in Canada meant it was winter in Australia.",
   "created_utc": 1690412242,
   "score": 66,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlae6a",
   "message": "The earth is flat\n\nVaccines cause autism",
   "created_utc": 1690413117,
   "score": 31,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlsj2n",
   "message": "Dinosaurs never happened, because the earth is only (5000?) years old. From a teacher. To my daughter in 5th grade.",
   "created_utc": 1690420925,
   "score": 210,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtle13n",
   "message": "A Californian man thought that trump was Canada's President too (back when he was running in office).",
   "created_utc": 1690414670,
   "score": 16,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtli1qj",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl5ubn",
   "message": "My bf is totally convinced that because he does not have biological children that he is the last of his parents’ line of genetics. No the fuck he is not, his sister has children. That carries on his mom and dad’s genetics but because his nephews have a different last name he believes that they don’t count. He is the last to carry the NAME, not the DNA! He genuinely does not comprehend me trying to tell him this.\n\nEdit to add that this completely frustrates the piss out of me because he is not really that dumb about most other things. He’s very successful at his job, successful enough that we are comfortable only on his income, so he isn’t some uneducated idiot. I do not understand why he can’t process this.\n\nEdit 2: He is the area manager of several fast food restaurants so he is far from stupid. He’s just fucking stupid about this for some reason.",
   "created_utc": 1690411174,
   "score": 125,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtld2z7",
   "message": "Worked with a girl in a pretty nice neighborhood that would get on her hands and knees to look under her truck just in case a human trafficker was underneath with a knife trying to cut her Achilles tendon.",
   "created_utc": 1690414264,
   "score": 165,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtljlzk",
   "message": "My friend called me a notc in high school. I texted back \"what the fuck is a notc\". This dude says \"one of those German guys\"...",
   "created_utc": 1690417072,
   "score": 90,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlb0fk",
   "message": "That the Gulag was actually a good thing.",
   "created_utc": 1690413380,
   "score": 22,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtldxuc",
   "message": "My old coworker said he went to Antarctica in college for a month for research, and had to be careful of polar bear attacks.",
   "created_utc": 1690414632,
   "score": 53,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlogu6",
   "message": "A check out woman told me that Democrats ate babies",
   "created_utc": 1690419155,
   "score": 58,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlpwrz",
   "message": "Someone during Covid…\n\n“I don’t trust the Covid vaccine - it’s not FDA approved.”\n\nFDA approves vaccine - “Well, I don’t trust the FDA, so them approving it doesn’t persuade me to get the shot.”\n\nThe mental gymnastics and goalpost moving. Unreal.",
   "created_utc": 1690419785,
   "score": 32,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlrh3r",
   "message": "A nurse I used to work with asked why we can't drive to Hawaii. She was absolutely serious and I wasn't surprised when she didn't last beyond her training period.",
   "created_utc": 1690420464,
   "score": 149,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlrowb",
   "message": "Teachers are trying to indoctrinate children. We don't got time for that.",
   "created_utc": 1690420560,
   "score": 59,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl7kof",
   "message": "That beer gets you drunk faster than 40% proof alcohol...",
   "created_utc": 1690411905,
   "score": 10,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtla6u7",
   "message": "Pokémon is a satanist plot, they’re all based on Chinese gods.",
   "created_utc": 1690413029,
   "score": 129,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlfyo6",
   "message": "A coworker told me that aliens from space were going through his apartment while he was at work.",
   "created_utc": 1690415492,
   "score": 83,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlokdi",
   "message": "\"Trump is the most honest politician in America.\" \n\n\\- Some guy I met at a break bakers meetup.",
   "created_utc": 1690419197,
   "score": 5,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlqhfw",
   "message": "Summer intern at work commented that she was going to need a passport for a trip she was taking in a few months and when asked where she was going replied New Mexico.",
   "created_utc": 1690420034,
   "score": 32,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlqr3f",
   "message": "My FIL was driving me home from work the other day and he started on about how he thinks the covid vaccine was a way for the government to inject people with stupidity. And then he goes did you get the shot? And I said yeah. He apologized and I told him I’m not stupid so I wasn’t offended. \n\nMore so just wondering HOW they would isolate stupidity and put it into a vaccine??",
   "created_utc": 1690420150,
   "score": 45,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtluwve",
   "message": "That the city needs to move those deer crossings instead of putting them on highways.",
   "created_utc": 1690421977,
   "score": 55,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlkdzk",
   "message": "That the Biden administration was trying to kill (yes, actually kill) Americans with the COVID vaccine.  \n\nThe lack of critical thinking in some people is astounding.",
   "created_utc": 1690417405,
   "score": 26,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl5og8",
   "message": "Donald Trump was the best president the USA has ever had. Ever had. Ever had. Ever had……",
   "created_utc": 1690411107,
   "score": 20,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlabjm",
   "message": "Most of the outlandish Covid vaccine claims, including attributing all the deaths we see now to the vaccine. You know it’s coming every time, yet the sheep still shock me with their conspiracies",
   "created_utc": 1690413085,
   "score": 10,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtl53fw",
   "message": "[deleted]",
   "created_utc": 1690410869,
   "score": 7,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtleqrh",
   "message": "Mexico isn't in North America.",
   "created_utc": 1690414974,
   "score": 43,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlekxg",
   "message": "I have a buddy who will claim to be an expert in military strategy and tactics, who at the same time claims studying history is pointless. He never served in any capacity.",
   "created_utc": 1690414905,
   "score": 20,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlfqmb",
   "message": "\"I shouldn't lose my shift just because I am late\"   \n\n\nFor context. This was a security job, you cannot leave until you are relieved, dude was about 2.5 hours late (no call either) and got irate that he wasn't going to be allowed to work the remainder of his shift because we replaced him with someone else.  \n\n\nJust about any other industry/company I would have been surprised that he still had a job at all at that point. (this was a regular thing with him)",
   "created_utc": 1690415399,
   "score": 51,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlj2hb",
   "message": "Putting in a roundabout was stupid because now they had to stop 4 times instead of 1 if they had just left it a 4-way-stop.",
   "created_utc": 1690416837,
   "score": 56,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtllw3g",
   "message": "“When I take a picture of the moon, do I need to turn the flash on?”",
   "created_utc": 1690418048,
   "score": 20,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlpix0",
   "message": "She was very serious that a useable hand-held shower head without a hose, because the hose was “ugly”. Asked if she meant an overhead or a wall-mounted shower head because those didn’t require a hose. Nope. She wanted the water to flow from the wall into a handheld shower head without a hose. I tried to tell her that wasn’t possible and ended up sending her to a different home improvement store.",
   "created_utc": 1690419616,
   "score": 198,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlwsov",
   "message": "Recently I went to a market and a woman was selling incense that protected against 5G and and WiFi signals.",
   "created_utc": 1690422807,
   "score": 33,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlwzrl",
   "message": "Some girl I knew went on a rant about Obama renaming the Kennedy Center to the Obama Center. She also claimed he was doing it because JFK was a republican. I’ve never felt so much secondhand embarrassment for someone in my life.",
   "created_utc": 1690422892,
   "score": 44,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlx01b",
   "message": "These were all said by a close friend of 30+ years.\n\n1. Chemtrails are real\n2. The Earth is flat\n3. We didn't land on the moon\n4. 5G is lethal\n5. Vaccines cause Autism\n6. Covid vaccines have microchips \n7. Sandy Hook was a false flag\n8. Covid was manmade for population control\n\n\nThe most insane part of all this, is this man is a legitimate genius. He has 2 degrees from MIT.  A Master's in applied mathematics, and a master's in their robotics program.\n\nEasily the smartest and stupidest person I know.",
   "created_utc": 1690422896,
   "score": 138,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlcnwg",
   "message": "Most recently? That trump wasn't who appointed Chris Wray director of the FBI.",
   "created_utc": 1690414085,
   "score": 7,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtli5f7",
   "message": "It's tough to answer because it is so hard to believe that anyone can even be serious about something so stupid...but, I'd say that the 2020 election was stolen.",
   "created_utc": 1690416438,
   "score": 5,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlirux",
   "message": "Nurse at our elementary school mistook allergies for pink eye. When I said that it cleared with eye drops she told me allergies are contagious too.",
   "created_utc": 1690416709,
   "score": 189,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtljjde",
   "message": "The Liver King wasn’t on steroids",
   "created_utc": 1690417039,
   "score": 3,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlk5jy",
   "message": "“Eggs are meat”",
   "created_utc": 1690417305,
   "score": 19,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtll1q6",
   "message": "The earth is flat",
   "created_utc": 1690417688,
   "score": 3,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlmha1",
   "message": "Literally above this post in my feed is a screenshot of someone claiming that the US shot down Malaysia Flight 370 because one dude was going to give a report in China, so likely that",
   "created_utc": 1690418298,
   "score": 3,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlo39m",
   "message": "I had a classmate in my constitutional law class who genuinely believed that the earth is flat, planets aren’t real, and neither is NASA. My teacher proceeded to show him photos of the moon and asked him “what do you think that is?” \n\nThe class also asked him “when you look up in the night sky, what do you see?”\n\nHe had no response lol. I avoided interactions with him ever since.",
   "created_utc": 1690418993,
   "score": 91,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlo8zi",
   "message": "\" i like seeing my class suffer.\"",
   "created_utc": 1690419061,
   "score": 3,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlp3lm",
   "message": "Moon is flat and it goes dark when it flips on other side and it’s dark side is on us",
   "created_utc": 1690419429,
   "score": 31,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlp5nw",
   "message": "I had a coworker, (one of those manly men, patriot types) who said trump running for president (2016) was just a way for Obama to get another term. I explained to him that no, Obama cannot get a third term, the limit is two terms. He argued with me until I googled it for him.",
   "created_utc": 1690419455,
   "score": 3,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlr2vy",
   "message": "A man claims to have been sent to hell for 12 minutes. God let him experience it before bringing him back out of hell to tell the world. \n\nHe knows he's a chosen one because he was being dragged underwater by a shark and God pulled him out of the water and also healed his leg so there are no scars. \n\nI've had someone send me a video of this guy with 100% seriousness as an attempt to save my soul.",
   "created_utc": 1690420290,
   "score": 37,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtltj7m",
   "message": "That if I clench I can make my period stop 🤣",
   "created_utc": 1690421365,
   "score": 72,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtluecw",
   "message": "probably when my friend called mt. everest american mountain because she forgot what it was called",
   "created_utc": 1690421749,
   "score": 10,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlv1gh",
   "message": "That we should be allowed to have guns in our desks at work for “self defense”.",
   "created_utc": 1690422033,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlvwg5",
   "message": "My co-worker. We were all having a conversation. I don't remember what we were talking about, but I said something to the extent of \"Crazy, it's like someone thinking the earth is flat.\" His response was \"well, it is.\" My other co-worker and I looked at each other confused. Flat-Earth co-worker continues explaining why the earth is flat. \n\nHe was saying it like he was stating facts. We're engineers for crying out loud. You paid too much money for your glasses, and degree to see things this way!",
   "created_utc": 1690422414,
   "score": 27,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlw547",
   "message": "Pulls out list of things my Republican brother randomly spouts that he read on youtube",
   "created_utc": 1690422520,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlx0cy",
   "message": "My ex-husband was a horrible driver. Wrecked everything he ever owned and then some, but he somehow thought he was an excellent driver.\n\nWe were riding through a town with a 4-lane main road. He started to change lanes oblivious to the car that was located exactly where he was headed. I told him to stay in his lane, and fortunately, he did.\n\nHe said, 100% seriously, that if he'd changed lanes and crashed into the car that was already there, it would have been their fault because they didn't honk their horn to warn him.",
   "created_utc": 1690422900,
   "score": 222,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlxah8",
   "message": "That Trump is the best president the US has ever had.",
   "created_utc": 1690423025,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlxb8b",
   "message": "I just need to say one name... Donald John Trump 💀",
   "created_utc": 1690423035,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlo9ri",
   "message": "\"Evolution is just a theory\"",
   "created_utc": 1690419070,
   "score": 5,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtloszx",
   "message": "That if you fertilize an egg with human sperm it will grow into some weird-looking organism.",
   "created_utc": 1690419300,
   "score": 4,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlgntk",
   "message": "\"Why does my front door always face east if the Earth is spinning?\"",
   "created_utc": 1690415792,
   "score": 2,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlh4st",
   "message": "That the earth is FLAT..",
   "created_utc": 1690415996,
   "score": 2,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlj8f0",
   "message": "By eating eggs you’re killing baby chickens",
   "created_utc": 1690416907,
   "score": 22,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlji5i",
   "message": "The earth is flat so",
   "created_utc": 1690417025,
   "score": 2,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlortr",
   "message": "coworker once told me to rub hand sanitizer on my face to get rid of acne, when I challenged him on this he proceeded to lather his own face in hand sanitizer as some sort of gotcha",
   "created_utc": 1690419285,
   "score": 2,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlpoak",
   "message": "“Travel time from country A to country B is different than country B to A due to time zone difference.” \n\nI explained how head and tail wind works and still nothing. I was 23 at the time and this person was 51.\n\nEver since this incident this person became an asshole to me.",
   "created_utc": 1690419681,
   "score": 2,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlrlo2",
   "message": "\"I'm pretty sure I was a dragon in a former life, probably explains why I'm such a pussy now, ya know, I used to fucking fly and eat people and set shit on fire for fun\"",
   "created_utc": 1690420520,
   "score": 59,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtls348",
   "message": "Someone I used to work with claimed that taking a couple of tablespoons a day of Borax, as a supplement, cured all kinds of ailments.  I lost count of how many other employees he duped into believing it.  He was adamant that big pharma was suppressing this fact.",
   "created_utc": 1690420731,
   "score": 31,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtls5k0",
   "message": "A friend of mine told me a couple days ago that he thinks I take way too long to respond ( I reply every hour or two ) and he said he wants me to reply no more than a minute after he texts me each time. He’s also been stalking me on the snap map.",
   "created_utc": 1690420761,
   "score": 2,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlscmu",
   "message": "My brother, against all laws of known physics, is absolutely certain that if he was ever in a tsunami he could just \"swim under it\".\n\nWe've both been in the ocean plenty of times, surfed a bit, and have definitely had our share of waves wreck our shit, but he's still certain he could do it if he got the timing right.",
   "created_utc": 1690420846,
   "score": 79,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlsi8e",
   "message": "“You can be saying excuse me and thank you to females. That’s some beta male shit” \n\n-My coworker who was clearly insecure and on coke",
   "created_utc": 1690420914,
   "score": 38,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlt4un",
   "message": "My 10th grade history teacher said that Hitler didn’t kill himself. He moved to Cullman, Alabama.",
   "created_utc": 1690421190,
   "score": 90,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtltmj1",
   "message": "My 50 year old father believes Jesus himself hand wrote the bible",
   "created_utc": 1690421407,
   "score": 2,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlu9d3",
   "message": "\"we can't be sure humans and dinosaurs didn't live at the same time. I mean, I wasn't there, who am I to say?\" \n\nI started laughing, realized she was serious, and almost died trying to choke it back. Never hung out with her again.",
   "created_utc": 1690421689,
   "score": 2,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlukba",
   "message": "Was cooking noodles with a friend once. It boiled over, so he turned the heat off and said: \"It needs to de-gas for a few\"",
   "created_utc": 1690421823,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtluty5",
   "message": "When I told my dad I got the covid shot, he looked me dead in the eye and with a straight face said \"they're going to control you now, you know that right?\" And holy shit I didn't know whether to slap him or laugh 🤣🤣🤣",
   "created_utc": 1690421942,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtluucj",
   "message": "“I never wear a seatbelt.”\n\nWhy the hell not?\n\n“Because if I am in a wreck, there’s no way I’d be thrown to safety.”",
   "created_utc": 1690421947,
   "score": 247,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtluyls",
   "message": "That the Earth is only 6, 000 years old, dinosaurs weren't allowed on Noah's ark and that is why they are extinct AND dinsaurs have long necks because of Noah's flood.   \n\n I asked 1 question: You mean that dinosaurs lived at the same time on Earth as all of the animals that were on the ark?\n\nResponse:  the 1, 000  yard stare.",
   "created_utc": 1690421999,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlv14t",
   "message": "“You can only get sick during winter not summer” and that “I don’t need a job when I’m gonna have a man to pay all my stuff until I grow old”. Like yeah keep believing all that shit. My ex was a true piece of work",
   "created_utc": 1690422029,
   "score": 47,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlvb3r",
   "message": "“England’s life expectancy is 37 years old” -my little cousin",
   "created_utc": 1690422152,
   "score": 20,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlvc93",
   "message": "Heard a guy at work go off about how melatonin is a lie and a conspiracy against black people and that the real source of a black person's pigment is carbon. Also, because of this, black people are the only people on the planet with carbon in their bodies.",
   "created_utc": 1690422166,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlvjnf",
   "message": "A former coworker was convinced that baby's umbilical cords were attached to their mother's belly buttons from the inside.\n\nShe had two kids by the point.",
   "created_utc": 1690422257,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlvp7p",
   "message": "I mean I’ve talked to flat-earthers and slavery apologists (🤮) sooo…",
   "created_utc": 1690422326,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlvtv6",
   "message": "Used to work for a place that didn’t allow outside food unless it was for babies or medical reasons. Woman brought a liter of fancy french sparkling water for the baby formula. 100% seriously. I had to explain why sparkling Similac would be a bad idea for a newborn. That kid would have belched to the moon.",
   "created_utc": 1690422382,
   "score": 113,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlw0pv",
   "message": "Some guy told me with certainty that oil and natural gas flow from the core of the earth",
   "created_utc": 1690422467,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlw10w",
   "message": "My cousin was not the sharpest tool in the shed, he was convinced he could have unprotected sex with any women as his current girlfriend was pregnant so there was no risk he could get another girl pregnant…",
   "created_utc": 1690422471,
   "score": 219,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlw7c7",
   "message": "“We should send all our trash on Earth to Mars instead.”\n\nI thought she was joking but her behavior after indicated as if she believed she genuinely stumbled on a brilliant solution to our waste problems",
   "created_utc": 1690422548,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlw9w8",
   "message": "Every time Conservatives say they aren't a cult followed by proving they are a cult.",
   "created_utc": 1690422579,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlwe0k",
   "message": "A guy explaining how the pyramids were built by aliens",
   "created_utc": 1690422628,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlwk1w",
   "message": "\"As long as I'm alive I AM the center of the universe.\" \n\n-my abusive narcissistic father. He was in his 60's.",
   "created_utc": 1690422701,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlwthc",
   "message": "That “Star wars” shouldn’t be allowed to be sold in my store because it was “pagan” and “evil” and I was going to hell for it. Ok ma’am",
   "created_utc": 1690422817,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlxbsu",
   "message": "The Caribbean coast is off the coast of England because they have British accents in Pirates of The Caribbean. This man was in the military and had no knowledge of geography.",
   "created_utc": 1690423042,
   "score": 95,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlxc45",
   "message": "\"Did you know that slipknot wear masks because they're wanted criminals\".\n\n\u0026amp;#x200B;\n\nNow imagine me wasting 15 minutes of my life trying to explain that if they were wanted criminals, they'd just arrest them on stage.",
   "created_utc": 1690423045,
   "score": 36,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlxd89",
   "message": "“You’re actually not allergic to bees! You were sitting right next to me that one time when I got stung and your body didn’t react!”",
   "created_utc": 1690423059,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlxfso",
   "message": "I'm 43 now, but used to do a fair bit of traveling in my younger days, up until I was about 30. Always coming back home for Thanksgiving/Christmas. Anyway, I had hitched back into town and was walking to my grandmas where I'd be staying, carrying my alice pack. A girl got to talking with me on my way, and it came up that I'd just got back from Oregon..and dead faced confused she was like \"they have towns out there, like cities and stuff?\" She genuinely believed it was still like the Oregon trail days...this was in like 2005 lol",
   "created_utc": 1690423090,
   "score": 175,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlxge3",
   "message": "She's Filipino but she looks Asian.",
   "created_utc": 1690423097,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlxkmv",
   "message": "\"Why do they call one side of the Sun the Moon?\"\n\nThis 30 yr old legitimately thought the moon was just the other side of the sun.",
   "created_utc": 1690423147,
   "score": 61,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlxqdm",
   "message": "Approximate means exact.",
   "created_utc": 1690423217,
   "score": 1,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlrcvo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtm03em",
   "message": "My ex wife got so angry she didn’t talk to me for a day when we went to the beer cave in Walmart and I stopped at the counter to pay there (and get the things bagged to carry easier) before going to the rest of the store and getting our other needs because “you’re going to get taxed twice”. Took me a minute when she said that because my first reaction in my head was yeah that’s how sales tax works but obviously I know how percentages work. And she stood there angrily and said that’s double taxation. That I’m wasting money by paying taxes twice. I said if sales tax is 10% and we make 2 $50 purchases, we are paying the same total as making 1 $100 purchase. She has an MBA, but after that example just seethed more and said I’m wasting money by checking out twice and getting taxed twice. Then just stopped talking to me the rest of the night…",
   "created_utc": 1690424281,
   "score": 77,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtm2sxi",
   "message": "At work, I overheard a man rant about how melatonin is a myth and a plot against black people, and that the true source of a black person's hue is carbon. Black people are the only people on the earth that have carbon in their body as a result of this.",
   "created_utc": 1690425533,
   "score": 90,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlzdel",
   "message": "I was working at a grocery store in the US when the change counting machines first came out. I was walking by and I noticed a woman was confused and offered her help. She said she accidentally hit the Spanish button by accident. I explained that it was okay, just keep dumping her coins in there and she will just need to bring the receipt to the guest services desk to cash it out when she was done. She said well I don’t want to get Spanish money. I had to explain to her that she would give me American money, she just kept repeating that she hit the Spanish button though. I had to walk away",
   "created_utc": 1690423955,
   "score": 66,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtm3eph",
   "message": "I worked with someone who told me the government created the wind to cause natural disasters",
   "created_utc": 1690425820,
   "score": 25,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtm5tyc",
   "message": "\"I have a toaster that's just such a slut, she's super sexy but you can't safely do anything about it.\" I...I was so confused by this but apparently the guy was into kitchen electronics in a whole different way.",
   "created_utc": 1690426979,
   "score": 45,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtm1d8d",
   "message": "My friend could not comprehend that the people of India are Asian. . .",
   "created_utc": 1690424859,
   "score": 23,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtly2bp",
   "message": "I work in gynecology…gonna skip over the tons of incorrect terms used for genitalia…and the top 10 outrageous patient comments…and go to-I am SO sick of explaining to women they don’t have prostates.",
   "created_utc": 1690423363,
   "score": 37,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtm3xtd",
   "message": "I briefly dated a guy who left Iran in the late 70s. Even under the Shah, they had little freedom of speech. He became on of those \"America, love it or leave it\" people. He said that if they have complaints, they should live somewhere else or just shut up. I asked what he thought of freedom of speech. He said that we Americans should be more grateful to have freedom of speech. So, I asked \"are you saying that we should be so grateful to have freedom of speech that we should never exercise it and should just leave if we disagree?\" He said \"it sounds pretty stupid now that you say it.\" I assured him that it sounded just as stupid when he said it. He laughed but didn't change his position. 🫤🧐",
   "created_utc": 1690426069,
   "score": 48,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtm41qs",
   "message": "The amount of both men and women who truly believe women pee out of their vaginas is concerning.",
   "created_utc": 1690426121,
   "score": 37,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtm6p07",
   "message": "Former 911 dispatcher here. I had a guy call once freaking out about the white orb thing in the sky. The moon. He was very worried. \n\nDrugs were obviously involved so I made sure he wasn’t having physical signs of an OD and made him promise not to drive or leave his house. I told him to callback if he felt sick but we never heard from him again. I wonder if there’s a dude out there who remembers that time he got high and called 911 because of the moon.",
   "created_utc": 1690427405,
   "score": 47,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlzmxb",
   "message": " My mom said that my daughters nursery couldn't be blue because that would make her a lesbian.",
   "created_utc": 1690424073,
   "score": 39,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlyprz",
   "message": "Dude, at my new job while watching a Starbucks ad in the breakroom, \"those drinks make you more feminine and ruining masculinity.\" I just replied, \"If a coffee with sugar makes you less masculine, then you weren't masculine to begin with. I'll show up in a dress eating a banana and still be more manly.\" Never talked to me again",
   "created_utc": 1690423657,
   "score": 15,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtlyq46",
   "message": "A guy was hitting on me at a bar once when I was single in my 20’s \u0026amp; he told me he’s really good in bed and loves sucking on a woman’s clip. \n\nA CLIP! …. I immediately walked away. God help him.",
   "created_utc": 1690423661,
   "score": 22,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtm2s66",
   "message": "The lower your credit score the better",
   "created_utc": 1690425523,
   "score": 19,
   "submission_id": "15ak1ns"
  },
  {
   "comment_id": "jtm5d2z",
   "message": "That Abraham Lincoln was the *worst* president because he was attempting to enslave all white people alongside all Black people. (According to her, he accidentally freed the slaves because his attempt to enslave white people backfired and freed Black slaves as a side effect?)\n\nShe was 100% serious, very angry, and was super-pissed about Presidents' Day because she shouldn't be \"forced\" by the government to celebrate Abraham Lincoln.\n\nThis all came up at a Presidents' Day 5K charity fun run. (Which, like, if she thought Presidents' Day was evil, maybe she could have just not attended? Your guess is as good as mine.)",
   "created_utc": 1690426749,
   "score": 19,
   "submission_id": "15ak1ns"
  }
 ]
}