{
 "submission_id": "15amyau",
 "title": "What is the worst pain you’ve felt that wasn’t life threatening?",
 "selftext": "",
 "created_utc": 1690418204,
 "permalink": "/r/AskReddit/comments/15amyau/what_is_the_worst_pain_youve_felt_that_wasnt_life/",
 "score": 143,
 "url": "https://www.reddit.com/r/AskReddit/comments/15amyau/what_is_the_worst_pain_youve_felt_that_wasnt_life/",
 "comments": [
  {
   "comment_id": "jtm6557",
   "message": "Period cramps with endometriosis. \n\nI've also had a kidney stone, and I prefer the kidney stone.",
   "created_utc": 1690427131,
   "score": 198,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlra9z",
   "message": "Kidney stones. I threw up all the way to the hospital.",
   "created_utc": 1690420381,
   "score": 151,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm3t6s",
   "message": "Gallbladder attacks - they come out of nowhere, last however long they want, and feel like someone is stabbing your upper abdomen and twisting the knife over and over. So happy to have had that removed. Would’ve had it removed earlier except my boyfriend kept telling me they were gas bubbles - I think he thought I was exaggerating the pain. I was not.",
   "created_utc": 1690426008,
   "score": 58,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm98tu",
   "message": "That weird butthole cramp pain",
   "created_utc": 1690428702,
   "score": 54,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlw054",
   "message": "Ovarian torsion caused by a huge blood-filled cyst.",
   "created_utc": 1690422460,
   "score": 47,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlrmtm",
   "message": "Stepped on a nail, almost dead center of my foot. went all the way through my foot and popped out the top. Hurt just as bad on the way out.",
   "created_utc": 1690420534,
   "score": 81,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtln4tv",
   "message": "I had a baby tooth extracted when I was like 13 because it wouldn’t come out even though the adult tooth had mostly descended.  When they went to give me the lidocaine shot they stuck the needle into a nerve cluster and my vision narrowed to a pinpoint and almost blacked out from the pain.",
   "created_utc": 1690418578,
   "score": 75,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlqjyu",
   "message": "Trigeminal neuralgia - Google it.  Can't even remember 3 days of my life.",
   "created_utc": 1690420063,
   "score": 34,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm2j7y",
   "message": "Breathing with broken ribs",
   "created_utc": 1690425407,
   "score": 37,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmita3",
   "message": "Thought I might have appendicitis. Pain was bad enough I woke up my roommate to drive me to the hospital. I would describe the pain as an 8 or 9. Doctor gave me dilaudid by IV after an hour I ripped the biggest fart in my life. Total relief. And that's how I got a $3000 hospital bill. At least that met my deductible so there is a tiny win. \n\nA $3000 fart, I still shake my head about it years later.",
   "created_utc": 1690434126,
   "score": 33,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtma2dc",
   "message": "Herniated disk\n\nI never knew the term “stabbing pain” could be so literal. Felt like a knife was in my lower back.",
   "created_utc": 1690429129,
   "score": 26,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlnxc4",
   "message": "Anal sex….like wth? That shit is so painful? I don’t understand how that could ever be enjoyable? It felt like I was taking the biggest shit of my life, inwards….so fucking weird?….",
   "created_utc": 1690418921,
   "score": 74,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlyl3s",
   "message": "Nerve Damage",
   "created_utc": 1690423598,
   "score": 24,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlyw0u",
   "message": "Hand, foot, and mouth disease. It’s supposed to be a children’s illness but I got it at age 19. Apparently it’s less common for adults to get it but much worse when they do. It made me itchy all over and all the spots were sensitive and would get all this crusty scabbing. But more importantly, my feet were in IMMENSE PAIN. I legitimately could not even walk around my house. It hurt so bad, especially on tile flooring. And when I wasn’t on my feet, they ITCHED SO BAD. Basically, for the whole week that I was sick, I could not sleep because of the itchiness but I also could not do anything but lay down because of the foot pain. I literally went days without sleeping because the discomfort was unbearable. After the sickness started to pass, the skin on my feet fully peeled off and my feet were so raw and irritated. I literally wouldn’t wish this pain on anyone. My feet have recovered but I have nightmares of getting this sickness again!!!",
   "created_utc": 1690423737,
   "score": 21,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm2jk2",
   "message": "Kidney stones.  Fucking A that was bad.  And I walked off a broken ankle.",
   "created_utc": 1690425411,
   "score": 36,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm9yxu",
   "message": "Broken tailbone. Cracked it falling down on a rock. The worst part was for weeks i couldn't really sit, it hurt to stand, or lay on my side. Being on my stomach was the best but only a little",
   "created_utc": 1690429078,
   "score": 15,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmaygp",
   "message": "Having my first IUD removed and the second one inserted within a minute or so. It was brief, but I was screaming uncontrollably on another planet in pain.",
   "created_utc": 1690429597,
   "score": 15,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtluk21",
   "message": "Tonsillectomy at 39 years old...went to the emergency room for supplemental pain killers and fluids 3 times the following week.\nWay worse pain than breaking my neck in a car accident!\n\nI wouldn't recommend it ,not even if I was on fire!",
   "created_utc": 1690421819,
   "score": 14,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm5qho",
   "message": "post surgery after my c section.  i got the old fashioned belly button to crotch up and down slice.  22 stitches.  and i was trying to breastfeed.",
   "created_utc": 1690426931,
   "score": 12,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlmqnk",
   "message": "Heartburn / GERD... Nothing like waking up in the middle of the night choking on your own stomach acid",
   "created_utc": 1690418412,
   "score": 11,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtluoai",
   "message": "Had to have a failed root canal dealt with not too long ago. There was an infection so they had to remove the crown, the tooth, and a little stent. They warned me that the pressure was gonna be really, *really* bad, and it was! It was so unbearable, I felt like my head was gonna explode. The kind of pain that would just be exacerbated by crying (which I, a grown adult, was genuinely close to). They also couldn’t use the numbing stuff before the needle for the area I needed, so they just stuck the needle directly into the roof of my mouth. Ouch! \n\nOther than that, blacked out once while getting my blood drawn. When I came to, I felt like my bones were on fire and my blood was boiling. Tried leaning over to vomit, then realized my body literally couldn’t handle it and leaned back. Went back and forth with that for a while lol. They didn’t even get all the blood they needed so I had to come back the next day for the rest",
   "created_utc": 1690421872,
   "score": 11,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm4fsw",
   "message": "Ovarian cyst. Barf.",
   "created_utc": 1690426307,
   "score": 10,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm5gxo",
   "message": "Bone biopsy.  Giant gauge needle shoved into your bone with only a local anesthesia.  And I've had gall stones, kidney stones and open heart surgery.",
   "created_utc": 1690426801,
   "score": 10,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm94fb",
   "message": "Having shingles at the age of 18. Was a 10/10 on a pain scale from the slightest touch of literally anything. It was on my back in the middle area of my spine.Worst part was the timing. Happened after coming home from college during summer and working in a restaurant every day having to wear heavy scratchy clothing all day.",
   "created_utc": 1690428640,
   "score": 10,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmb0bq",
   "message": "Deep fried my hands…",
   "created_utc": 1690429625,
   "score": 10,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlp3hv",
   "message": "Pelvic floor spasm or Menstrual Cramps from the most insignificant clinical case of Endometriosis.  Bodies are fucking weird",
   "created_utc": 1690419427,
   "score": 9,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm81cs",
   "message": "Breaking a tooth and exposing a nerve but not noticing until the chips I was eating stabbed me straight in the root of said tooth. It felt  like somebody was digging a sewing needle into my face continuously for like 6 hours until I passed out. Took a medically unsafe amount of advil which makes me extremely drowsy.",
   "created_utc": 1690428084,
   "score": 7,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmbsqe",
   "message": "fibro the awh that hurts but no one knows why condition.",
   "created_utc": 1690430041,
   "score": 7,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm7gk0",
   "message": "A bad migraine.\n\nI've had a baby, had gallstones, been shot with a BB gun, but none of those take over your entire body like a bad migraine.",
   "created_utc": 1690427792,
   "score": 13,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlrdkd",
   "message": "Gout/kidney stone",
   "created_utc": 1690420421,
   "score": 7,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlrpdz",
   "message": "Ruptured ear drum. \n\nThank goodness the pain only lasted about fifteen seconds. Must discomfort and annoyance over the next year though.",
   "created_utc": 1690420567,
   "score": 7,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm7gwq",
   "message": "Either passing a kidney stone, having an ovarian cyst burst or just having chrons in general",
   "created_utc": 1690427797,
   "score": 6,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm7xpu",
   "message": "Getting a paper cut on your finger and without realizing its existence, sanitizing your hands\n\nTHAT SHIT IS A JUMPSCARE",
   "created_utc": 1690428032,
   "score": 7,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmdweo",
   "message": "Severe chest pains caused by anxiety attack. I had to see the numbers for myself to believe I wasn't having a heart attack.",
   "created_utc": 1690431194,
   "score": 6,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlt6ia",
   "message": "It's a toss up between the kidney stone and getting a spinal tap.",
   "created_utc": 1690421210,
   "score": 12,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm3hok",
   "message": "Gall stones. Specifically, the 3.2 cm stuck coming out of the gall bladder. An attack would last for 8-12 hours. I'd feel like a golf ball was in my chest and radiated all the way round my right side.  Couldn't sit, lie, or stand in even a vaguely comfortable way.",
   "created_utc": 1690425859,
   "score": 7,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm8q95",
   "message": "I was on a ventilator due to respiratory failure. They woke me to extubate me and there was a delay in the doctor getting to the hospital. I sat fully awake with the tube down my throat and they would suction my airway every hour or so. It was so painful when they suctioned, I’d basically go into uncontrolled spasms.",
   "created_utc": 1690428438,
   "score": 7,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmb4j8",
   "message": "Natural childbirth. And, about to do it again in about a week!",
   "created_utc": 1690429688,
   "score": 6,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmfur5",
   "message": "Being aware you're looking at someone who has already been sentenced to death, it's just that their body hasn't caught up yet. \n\nIf you meant strictly physical though, dislocating my hip was goddamn awful.",
   "created_utc": 1690432328,
   "score": 6,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlmxa3",
   "message": "When the doctor injected anesthesia into 3 open wounds on my arm. They were gaping slits, the doctor needed to inject the anesthesia before he could stitch them up. I saw him inject the needle directly inside my open wound. That part made me cringe, but the real pain was when he pushed the liquid inside. I think it’s the closest thing I’ve felt to burning lava. It literally felt like he was injecting hot lava inside my wound multiple times. I have an above average pain tolerance and I couldn’t even stop myself from screaming while this was happening. Worst pain imaginable.",
   "created_utc": 1690418489,
   "score": 16,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm587x",
   "message": "Does heartbreak count ? 🙃🙃🙃🙃🙃🙃🙃🙃. Actual answer, peeing blood. Got a UTI when I was 7. Lasted literally just a day. The burning pain at the very top of the dick where the little mouth is is the worst shit I have ever felt in my life and I honestly don’t wish it on anybody except rapists.",
   "created_utc": 1690426684,
   "score": 12,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm37fj",
   "message": "Calf cramps in the middle of the night\n\nI remember flipping 180 degrees because it was so bad (like my head was near the edge of the bed, and my feet near the pillow)",
   "created_utc": 1690425722,
   "score": 10,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlmmyo",
   "message": "I guess when I fell backwards and tore something in my ankle. It hurt bad whenever I stepped on it. I literally had to crawl back inside my house and I couldn't walk or run properly for a few years.",
   "created_utc": 1690418368,
   "score": 4,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlp5bq",
   "message": "Broke my pinky toe ligament not a fun time",
   "created_utc": 1690419451,
   "score": 5,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlv97z",
   "message": "Currently the bone spurs I have in my left knee",
   "created_utc": 1690422128,
   "score": 6,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm5v3q",
   "message": "Separated shoulder. The only time I nearly passed out from pain. Fought like hell to stay conscious.",
   "created_utc": 1690426994,
   "score": 5,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmibns",
   "message": "Period cramps",
   "created_utc": 1690433816,
   "score": 5,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlmdui",
   "message": "Being ghosted",
   "created_utc": 1690418257,
   "score": 17,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm22bb",
   "message": "I ended up with two large nails stabbing into the sides of my thighs, they went from the ending of my knees to where my hip is.",
   "created_utc": 1690425185,
   "score": 4,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm4vic",
   "message": "Pleurisy due to air pockets in my chest after surgery, I couldn't breathe it was so painful. The crazy part is a quick shot of toradol completely cleared it up in 10 minutes",
   "created_utc": 1690426515,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm6zrj",
   "message": "I had shingles when I was only about 19-20 and the pain/itchiness was torture. I didn't know what it was at first, thought maybe it was bug bites and let it go too long. The doctor was really surprised when I showed him. They gave me strong painkillers that didn't really work but they helped me sleep. I had it on my chest and back, I can't imagine what kind of pain people have when it's on their face.",
   "created_utc": 1690427558,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm83dk",
   "message": "Frozen shoulder. You forget not to raise your arm and then the sharp pain shoots in your upper arm and I would actually tear up.  It would throb for an hour or so after that. It also wakes you up in the middle of the night with throbbing pain. This only lasted a year or so.The PT to fix said shoulder is not for sissies either. That has also been another year. Good times.",
   "created_utc": 1690428113,
   "score": 4,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm9vwp",
   "message": "Tattooing my nipples, the blood rushing back into my arteries after a hospital stay for deep vein thrombosis, and a herniated disk are all up there",
   "created_utc": 1690429035,
   "score": 4,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmaxf4",
   "message": "Breaking my tail bone.\n\nFell down the stairs when I was 10 or so, hitting it on each step. Took a couple of weeks to be able to walk without help and then I had a pass to be late to all my classes for several months because I just couldn’t move well, much less quickly.",
   "created_utc": 1690429583,
   "score": 4,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmbq36",
   "message": "I had a 16p framing nail ricochet into my right eye. The head of the nail not the pointy end. It popped my eye like a grape. Excruciating for days. It healed but is pretty blurry.",
   "created_utc": 1690430003,
   "score": 4,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmh9b3",
   "message": "Had to have a big toenail removed. The shots to numb the toe were excruciating. When the doctor says “grab onto something” before she uses a needle, you know it’s going to hurt.",
   "created_utc": 1690433168,
   "score": 4,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm3npp",
   "message": "Compared to these other people what I’ve experienced doesn’t sound so bad but it’s TMI I accidentally took 2 doses of laxatives it felt like my stomach was falling out of my ass and I also was projectile vomiting and I was crying it was a MESS",
   "created_utc": 1690425937,
   "score": 6,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm6y2c",
   "message": "My mother's passing",
   "created_utc": 1690427534,
   "score": 7,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlmjiu",
   "message": "Something tearing in my leg. I couldn't walk for days.",
   "created_utc": 1690418326,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlp5e9",
   "message": "A week long water infection",
   "created_utc": 1690419452,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm6so0",
   "message": "Knocked my knee out of place doing toe touches in my bedroom as a preteen. Immediately knocked it back into place. 10/10 would not recommend (the out of place part)",
   "created_utc": 1690427458,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmawzn",
   "message": "A failed spinal tap led to me getting extremely painful headaches if I moved my neck.",
   "created_utc": 1690429576,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmbs43",
   "message": "Wasp stings",
   "created_utc": 1690430032,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmcltn",
   "message": "At age 11 I slipped on wet grass had a rock embedded in my ligament below my knee. Hole was about the size of a half-dollar coin. Novicane would just bleed out so there was little to no numbing and the doctor had to lift skin to scrape away dirt and sand.",
   "created_utc": 1690430478,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmctz7",
   "message": "The skin on the sole of my foot detatched during a jump march while I was in the army.   \nI made about 20-30 seconds more before I passed out : /",
   "created_utc": 1690430602,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmgsbo",
   "message": "I didn’t have health insurance and got a sinus infection. \n\nI had it for 6 months before I found a job with insurance and it kicked in.\n\nBy the end my teeth hurt. I was taking DayQuil, Motrin, spraying numbing in my throat and sucking on cough drops 24/7. Anything to help\n\nFinally got a Z-Pack and 3 days later the insides of my face started draining. It was glorious. Disgusting, but glorious",
   "created_utc": 1690432884,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmhzw3",
   "message": "Wisdow tooth, bedbound for like a week before I could get the tooth out and it was like getting brayed every few minutes laid in bed",
   "created_utc": 1690433617,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmi9t3",
   "message": "Double inner-ear infection.\n\nOnly time as an adult that I cried from the pain.",
   "created_utc": 1690433785,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmifwa",
   "message": "The bone pain during chemo treatments. I couldn't function enough to be able to do anything.",
   "created_utc": 1690433891,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmk6ef",
   "message": "Had a dentist do a nerve test to see if I needed a root canal, unfortunately that meant he put dry ice directly on an exposed nerve. Never came so close to punching someone in the mouth on reflex. My vision literally went white for a second and it still hurt for multiple minutes after.",
   "created_utc": 1690434989,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmkqkl",
   "message": "Getting my IUD. Worst pain ever, like someone’s taking my insides out. I was vommiting from pain.\nNext in the line is wisdom tooth pain. Painkillers didn’t work, I was literally crying from pain. Had to take it out.",
   "created_utc": 1690435358,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtml702",
   "message": "Went to the dentist for a cavity, got a numbing shot. Waited 15 minutes. \"Are you numb yet?\" \"Kinda, not really\" \"Okay, we'll wait another 10 minutes.\"\n\n10 minutes later: \"are you numb yet?\" \"no\" \"don't be a baby\"\n\nDrill: WHRRRRRRR  \n\n\nYeah. The nurse had to hold me down in the chair but apparently I'm not a reliable person to ask if I'm numb or not.",
   "created_utc": 1690435660,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmnj7j",
   "message": "Dry socket after getting my wisdom teeth pulled.",
   "created_utc": 1690437242,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmnvq8",
   "message": "Toe surgery without the anesthesia\n\nDoc was even flabbergasted when he found out he forgot to give me any halfway through the damn surgery.\nStill feel the sharp needle pliers digging in my toenail just thinking about it. 😖",
   "created_utc": 1690437487,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmoxpw",
   "message": "Delivering twins with precipitous labour. Dr had to grab Twin B and position into the canal for delivery as he went transverse (sideways) after Twin A was out. 3rd degree tear and felt every bit of it as I'm pretty sure the Dr was pressing on my perineum to cause that tear. \n\nGet to the hospital in time for an epidural, friends.\n\nAlso, hope you don't get a douche canoe OBGYN on shift.",
   "created_utc": 1690438236,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmp96d",
   "message": "Endometriosis and childbirth. 27 hours of screaming agony.",
   "created_utc": 1690438467,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlv1jv",
   "message": "So... It was a week before my first ever national exam and I had been feeling very weird, nausea, headaches, no spacial awareness... Until one day I was making my bed AND I SUDDENLY FELT SUCH A SHARP PAIN ON MY BELLY I couldn't literally breathe. From that point on I was bed ridden, for 3 whole days I couldn't get up... Until one day.... I just started gassing... And gassing... Until I could get up and go to the bathroom to take the biggest pile of shit I ever could've taken. God I thought it was gonna touch me from the huge amount that came out. But all good, apparently if I'm really nervous/stressed I get constipated which.. I didn't know. 💪",
   "created_utc": 1690422035,
   "score": 6,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm42aj",
   "message": "Labor",
   "created_utc": 1690426129,
   "score": 4,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm88o8",
   "message": "Getting an epidural during my second delivery. This lady wiggled that shit around and honestly it hurt worse than giving birth. Ow",
   "created_utc": 1690428188,
   "score": 6,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtlmgf1",
   "message": "Kidney stones",
   "created_utc": 1690418288,
   "score": 4,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm5sce",
   "message": "Shattered femur",
   "created_utc": 1690426956,
   "score": 3,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm53bx",
   "message": "Broken nose",
   "created_utc": 1690426619,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm9c3h",
   "message": "Nearly broke my leg after hitting the knee joint really hard on the corner of a deck after getting tackled while playing backyard football. Couldn’t walk for a week because I couldn’t put any weight on it.",
   "created_utc": 1690428749,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtm9u84",
   "message": "Broke my wrist",
   "created_utc": 1690429010,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmajwt",
   "message": "Impacted tooth.",
   "created_utc": 1690429385,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmauqt",
   "message": "Exposed nerve in a tooth. I'd rather break all my toes at once than experience that again.",
   "created_utc": 1690429543,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmavht",
   "message": "My mom had a small adheasional blockage in her small intestine. She said that she rather have kidney stones x14",
   "created_utc": 1690429554,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmbesu",
   "message": "I’m not sure if I was pissing blood clots or passing a kidney stone last week at 4am, but that. Whatever that was.",
   "created_utc": 1690429837,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmbk1w",
   "message": "Pulled a muscle in my hip, I couldnt move or exist without major pain \u0026gt;:(",
   "created_utc": 1690429913,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmbrha",
   "message": "Dislocated and broken shoulder",
   "created_utc": 1690430023,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmd2ph",
   "message": "Natural labor",
   "created_utc": 1690430738,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmdel8",
   "message": "Sting ray barb to my foot was pretty painful. Not as painful as some of these other comments but definitely surprised me. But the poison afterward was gnarly. I didn’t have any access to hot water (no lifeguards at this beach) so I couldn’t get the poison out.",
   "created_utc": 1690430918,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmdynz",
   "message": "I was betrayed by someone I loved.",
   "created_utc": 1690431231,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtme1ch",
   "message": "Panic attack\n\nAlthough it can be life-threatening it also maybe not.",
   "created_utc": 1690431273,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmebrn",
   "message": "Shingles will probably be the worst pain I'll ever have until I'm stabbed......which may not be as bad...",
   "created_utc": 1690431440,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmefqg",
   "message": "Double sided migraine, no medication worked could only lay down and wiggle around in bed from pain.",
   "created_utc": 1690431504,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmfh4f",
   "message": "When a dentist was grinding out a cavity with some heavy duty tip.  The novacaine was no where near enough. I gave out a crazy yell when I felt the grinding tip tearing up the nerves.",
   "created_utc": 1690432102,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmfrka",
   "message": "Last Wednesday.\n\nIT band flareup after gym night Tuesday.\n\nI basically couldn't walk for two days and was rummaging through the cabinets trying to find Percocets left over from previous surgery.\n\nI had to go to work Wed night and stand in one place for about 4 hours. Percocets and a muscle relaxer got me through. At least the band was pretty good. Anyone know Milky Chance?",
   "created_utc": 1690432274,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmh0tc",
   "message": "I broke both bones in my wrist when I was 12. The Dr wrapped the cast too tight and as my arm swelled up it had nowhere to go. It felt like my arm was in one of those videos where a 10 ton hydraulic press crushes a bowling ball. Worst 3 days of my life. I have since broken my hand twice and snapped both bones in my ankle, been stabbed, stepped on a nail and then was given a shot directly into the puncture on the sole of my foot, had too many lacerations requiring stitches to remember. But nothing compared to that fucking cast when I was 12.",
   "created_utc": 1690433028,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmhhm3",
   "message": "Shingles",
   "created_utc": 1690433309,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmhhx9",
   "message": "My dad told me he had cancer.",
   "created_utc": 1690433314,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmhx11",
   "message": "Achilles tendon tear",
   "created_utc": 1690433567,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmhz70",
   "message": "Waking up from an adrenaline shot in the OR after a partial colectomy. I stopped breathing when the took me off the ventilator, so they had to use adrenaline to wake me up from anesthesia. I immediately screamed so loud as it felt like my insides were on fire. They sedated me fairly quickly. But I still remember those few seconds were utterly excruciating beyond belief.",
   "created_utc": 1690433605,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmiakl",
   "message": "Stepping on my kid’s LEGO in the middle of the night, middle of the foot.  No greater pain has ever been experienced.",
   "created_utc": 1690433798,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmj8u3",
   "message": "Kidney stones for sure. I've been unlucky enough to have 13 so far. I guess it's \"my thing.\" Anyone who shares my pain has my deepest empathy.",
   "created_utc": 1690434397,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmjmyz",
   "message": "dental abscess - though that can become life-threatening from sepsis if not treated.   \n10/10, screaming and crying in agony. I've nearly blacked out and thrown up from dental pain.",
   "created_utc": 1690434642,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmkri4",
   "message": "Ruptured ovarian cyst when I was 17. A friend whacked me in the abdomen with a foam sword during videography class and I just doubled over screaming",
   "created_utc": 1690435374,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmku2y",
   "message": "Fell in a computer chair after goofing off with my brothers and my thigh cracked down on the arm of the chair, which was metal. It hurt to even think about touching",
   "created_utc": 1690435422,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmlc5f",
   "message": "Sciatica",
   "created_utc": 1690435756,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmlh2i",
   "message": "Grief",
   "created_utc": 1690435849,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmmqui",
   "message": "When I crashed my bike and was left on the entrance of the high way for over an hour, and all people did was take videos from their car. I think the pain of knowing our world has gone so far into a shit hole that people would rather spend an hour taking videos of someone clearly hurt than help out is what made it so bad. It was humiliating on top of extremely painful.",
   "created_utc": 1690436697,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmmuf0",
   "message": "Food poisoning. It was so bad I was dry heaving Bile to make the pain stop. \n\nI got to the ER and morphine finally knocked it out.",
   "created_utc": 1690436765,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmn0o0",
   "message": "I messed up my back once moving furniture, I believe it was my sciatica, never did get it properly diagnosed. I could barely bend over without extreme pain for roughly 3 months. One day I stood up and I felt something shift in my lower back/tail bone area, and I fell to the ground in pain. It was so painful, I couldn't even move my legs, it lasted maybe a minute, and it went away.  \n\n\nI could bend over without any pain again and nothing hurt anymore. It was bizarre, the only thing I can think is I maybe popped a disc out of place, and when I stood up it shifted back.",
   "created_utc": 1690436886,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmnucc",
   "message": "Pilonidal access. It's the closest I've ever been to passing out from pain, and I've taken a golf club the the head.",
   "created_utc": 1690437459,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmnvq1",
   "message": "Got an infection in my butt crack. I don’t think we ever determined how I truly got infected, but the 2 or so weeks before the pustule burst was pain. I had thrown up, got scared to eat. Got dangerously low blood sugar twice. Chills, unable to comfortably sit. When we went to the hospital. I was drugged out of my mind crying myself to sleep because I hadn’t told any one about my pain earlier. We even had to fly out to a larger hospital.",
   "created_utc": 1690437487,
   "score": 2,
   "submission_id": "15amyau"
  },
  {
   "comment_id": "jtmpaxh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15amyau"
  }
 ]
}