{
 "submission_id": "15aprrc",
 "title": "Do you ever look into crowds of people and ponder to yourself on how each and every single person there has a life and an existence as complex, complicated, and intricate as yours? If not, why not?",
 "selftext": "",
 "created_utc": 1690426055,
 "permalink": "/r/AskReddit/comments/15aprrc/do_you_ever_look_into_crowds_of_people_and_ponder/",
 "score": 180,
 "url": "https://www.reddit.com/r/AskReddit/comments/15aprrc/do_you_ever_look_into_crowds_of_people_and_ponder/",
 "comments": [
  {
   "comment_id": "jtm43rx",
   "message": "Noun. sonder (uncountable) (neologism) The profound feeling of realizing that everyone, including strangers passing in the street, has a life as complex as one's own, which they are constantly living despite one's personal lack of awareness of it.",
   "created_utc": 1690426148,
   "score": 229,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtm7q5x",
   "message": "not only do I think about that, but I think about how amazing it is that we are alive. All the ancestors that it took for each of us to be here. Like, imagine if just one had died in our lineage that led to us… we wouldn’t be alive.",
   "created_utc": 1690427927,
   "score": 116,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtm413q",
   "message": "Everyday I think about that. It amazes me",
   "created_utc": 1690426113,
   "score": 54,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtm8y39",
   "message": "Only when I witness them inconveniencing strangers in public and wonder what gives them the excuse to be so self absorbed. Are they running late? Did they get some bad news? Maybe the camo backpack and aggressive t-shirt means they're a hostile dickhead on purpose?\n\nI'm totally trying to justify judging their whole personality in an instant.",
   "created_utc": 1690428550,
   "score": 17,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtm43zy",
   "message": "Yeah. At school. I try not to, it just makes me feel bad because they’re all doing better than me.",
   "created_utc": 1690426151,
   "score": 10,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmd696",
   "message": "I think about it when I see a plane in the sky.",
   "created_utc": 1690430790,
   "score": 10,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtm80qv",
   "message": "Yeah it’s called people watching. Personally I enjoy making up backstories for them",
   "created_utc": 1690428076,
   "score": 5,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmfbyc",
   "message": "I do. I also get quite frustrated that so many people don't give a shit about anyone else's lives. Rude motherfuckers, driving like idiots, treating people like garbage for no reason.\n\nMost people treat others like NPCs",
   "created_utc": 1690432017,
   "score": 38,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtm6rjv",
   "message": "Nope! I think I assume people lead simpler, easier lives than me. I know that assumption is incorrect but I had never examined it until now.",
   "created_utc": 1690427442,
   "score": 14,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtm4szr",
   "message": "Sometimes I’ll observe another one person and try and imagine what they are seeing from their perspective",
   "created_utc": 1690426481,
   "score": 4,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmdy8d",
   "message": "I just see a shitload of people wondering if they left the oven on.",
   "created_utc": 1690431224,
   "score": 4,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmelpf",
   "message": "All the time!",
   "created_utc": 1690431596,
   "score": 3,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtm5m3o",
   "message": "Yes, all the time.",
   "created_utc": 1690426870,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtm6qzz",
   "message": "All the fucking time",
   "created_utc": 1690427433,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtm71al",
   "message": "I often imagine myself like the agent in The Matrix - able to upload themselves into anyone they want to \"possess\". Kina cool, along the lines of Altered Carbon. I love playing with that reality during sexual fantasies. What would it feel like?",
   "created_utc": 1690427579,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtme9uu",
   "message": "Not really. Because humans are vain \n\n*gestures broadly*",
   "created_utc": 1690431409,
   "score": 4,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmmnup",
   "message": "I always think about that. And how many people would be effected if something happened to each person",
   "created_utc": 1690436640,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmi5ag",
   "message": "No. You're all just elaborate NPCs.",
   "created_utc": 1690433708,
   "score": 4,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmfe76",
   "message": "Not exactly. My thoughts go about this: Look at them, going about their days, living their lives and they have no idea I'd like to rub syrup on my body and pretend to be a pancake.",
   "created_utc": 1690432054,
   "score": 15,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmjz3q",
   "message": "no theyre all npcs and i am god",
   "created_utc": 1690434857,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmmyml",
   "message": "I live in Spokane County, USA, so I assume 90% of people are on hard drugs and have absolutely nothing going on between their ears.",
   "created_utc": 1690436845,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmkqja",
   "message": "Ain't nobody got time for that",
   "created_utc": 1690435358,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmlo34",
   "message": "They are mostly just people shaped objects that I avoid walking into.",
   "created_utc": 1690435979,
   "score": 3,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmmzwd",
   "message": "I mean I know it but I don't actively think about it...",
   "created_utc": 1690436870,
   "score": 3,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmmzzd",
   "message": "No. It sounds arrogant but I’ve met way too many people who simply just exist and spend all their time just doing routine tasks and passively consuming garbage media. There really are people out there who rarely get curious, contemplative, or introspective.",
   "created_utc": 1690436872,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmnhw7",
   "message": "They aren’t main characters",
   "created_utc": 1690437218,
   "score": 0,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmh6lq",
   "message": "I take it for granted that they do. I find nothing exceptional about the concept.",
   "created_utc": 1690433122,
   "score": 3,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmofcv",
   "message": "Yes, I am an empath and feel other peoples' presence and mood. It's why I avoid crowds.",
   "created_utc": 1690437877,
   "score": 0,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtma9hm",
   "message": "Nope.\n\nBecause I do not assume useless shit.",
   "created_utc": 1690429234,
   "score": 251,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtm6rkl",
   "message": "This is actually called “spender”, and it is the most inspiring feeling! I love to unlock these hints into what their main character story is.",
   "created_utc": 1690427442,
   "score": 0,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtm9db0",
   "message": "Sometimes I always feel that everyone's life is different, thinking about what kind of life I want, for me to enjoy it",
   "created_utc": 1690428766,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmi9ou",
   "message": "\"The great events of an age appear, to those living through them, as backdrops only to the vastly more compelling dramas of their own lives, and how could it be otherwise?\"\n\n\\-Lord of Emperors by Guy Gavriel Kay\n\n\u0026amp;#x200B;\n\nI think about it a lot, and especially historically that to 99% of people who have ever lived, what we know as the main story of the world was a side quest.",
   "created_utc": 1690433783,
   "score": 13,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmj5ur",
   "message": "The older I get, the less I like others.",
   "created_utc": 1690434346,
   "score": 5,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmjrpx",
   "message": "What's even cooler is you cam approa h these people, and with the right questions you can learn a bit about their version of things. \n\nThe world is a library, sometimes you gotta grab a book and read",
   "created_utc": 1690434726,
   "score": 3,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmlkc1",
   "message": "Yes I was at kings island thinking about this a few weeks ago. A park packed full of strangers. It’s insane to think about how everyone has complex life’s like I have, my friends have. I know it’s super obvious that everyone does but it’s hard to wrap my head around.\n\nI love meeting new people so it’s always fun  to get to know someone’s life, everyone has a different unique story. It always dives so deep. What they like, don’t like what makes them happy or sad, those things that we are better off not talking about exe.",
   "created_utc": 1690435909,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmnbgg",
   "message": "Yes and I think about how everyone needs to eat, use water, buy clothes, use the bathroom, and throw out trash and I get overwhelmed.",
   "created_utc": 1690437096,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmnnjr",
   "message": "I often wonder how many are murders, creeps hiding in plain sight.",
   "created_utc": 1690437325,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmo84z",
   "message": "Yes, and as stupid as it probably sounds, I also sometimes wish I could pop in and out of people's bodies until I find a life I love as I'm profoundly disappointed with my own.",
   "created_utc": 1690437735,
   "score": 3,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmpznf",
   "message": "Every day, all the time",
   "created_utc": 1690438990,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmqfls",
   "message": "Every time I’m stuck in heavy traffic I’m like there’s NO WAY everyone here has a life worth living. NO WAY.",
   "created_utc": 1690439317,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmqlul",
   "message": "All the time",
   "created_utc": 1690439446,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmqwbd",
   "message": "How can people be so evil?",
   "created_utc": 1690439663,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmrqem",
   "message": "All the time. I walk through New York City and marvel at all the people, all the lives, all the stories. I drive the highways and pass suburbs, blocks and blocks of homes, each with a family, every member of that family having their own distinct journey. And this is all just in one part of my state. Extrapolate this to all the towns and cities in the country, and across the world. It's quite staggering.",
   "created_utc": 1690440287,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmwpx7",
   "message": "Yeah, particularly unhoused or drug addicted people on the street. I think their lives must be scary as hell, I try to put myself in their shoes but its just so far removed from my experience its hard. Just the idea of trying to find somewhere to sleep in that situation gives me anxiety.",
   "created_utc": 1690444142,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmsxd8",
   "message": "Honestly no, these “did you ever consider that everyone else is also a real complex human” thoughts seem really bizarre.\n\nReally, what’s the alternative? You’re surrounded by zombies? Movie extras? In a video game? Were you raised around other humans? \n\nIt sounds sarcastic but I’m genuinely curious what the alternative default assumption is.\n\nI could kind of understand if you were in a fame bubble, but most people I’ve heard talk about this concept live in absolute ass scratching mediocrity and are like blown away that they aren’t the main character.",
   "created_utc": 1690441183,
   "score": 5,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmr6lb",
   "message": "I usually do the same but when it is dark outside and you can see the lights on in all the apartments.",
   "created_utc": 1690439871,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmrzq8",
   "message": "I think about this all the time. Especially when I meet new people. I’m astounded at the amount of sex that has to actually result in a full term pregnancy for us to all get here, too. Looking at a crowd at a baseball game or concert really makes the cogs turn.",
   "created_utc": 1690440484,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmsji6",
   "message": "why should i bother\n\ncant even handle my own life properly",
   "created_utc": 1690440890,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmu882",
   "message": "I do. I wonder a lot. I wonder what they do. What’s their fave thing to do. If they are going through a hard time or not and things like that. Hm. Humans are incredible creatures, full of so many wonders! 😊\nWhat a great random thought! ❤️",
   "created_utc": 1690442182,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmu98c",
   "message": "No, I'm the main character and most of them are NPCs.",
   "created_utc": 1690442203,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmucih",
   "message": "Yeah, and its kinda overwhelming. Hell, I also think of how each person is made up of countless living microscopic things, and how each of them is sort of like a planet.",
   "created_utc": 1690442274,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmuieb",
   "message": "No, I avoid crowds like they’re COVID-19…",
   "created_utc": 1690442398,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmulhk",
   "message": "First time this happened was in highschool. After doing LSD it's pretty much my constant state of mind. I think Dictionary of Obscure Sorrows called it \"Sonder.\"",
   "created_utc": 1690442462,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmupkb",
   "message": "they’re all npc’s as far as im concerned",
   "created_utc": 1690442549,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmv417",
   "message": "Sure.\n\nIt's called Sonder.",
   "created_utc": 1690442867,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmvfup",
   "message": "It makes me feel overwhelmed. I remember thinking of this concept as a very young child and it always felt like my mind was on a train ride to nowhere.",
   "created_utc": 1690443129,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmwoid",
   "message": "Nope! Just feels like I’m surrounded by unknowable aliens usually. Less as complex and more they’re way *more* complex than what I have going on :,)",
   "created_utc": 1690444109,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmx8f7",
   "message": "Been there done that with existential thinking. I stopped caring about this, when I realised how much groupthink there is. What's the point in being an individual when others are so focused on blending with the majority?\n\nI take more comfort in living in the present moment, and revelling in the absurdity of the entitlement and self-importance others apply to themselves and our existence. I used to want to be a Psychologist with a focus on therapy moreso than research, but concluded that people aren't worth saving. And yes I am equally unimportant in the grand scheme of things, so no need to point out the obvious to me. I am sure I can expect responses attempting to be \"insightful\", but I have already thought about much of this.",
   "created_utc": 1690444545,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmxi20",
   "message": "I do this and stuff similar to it.",
   "created_utc": 1690444755,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmy2ki",
   "message": "I think about it sometimes when I see the inside of another apartment from the window. I look at that small part of a cupboard, or a couch, or a bed, and think that \"there are people living there, I wonder what their life is like, what are they doing now?\"\n\nWhen I see an ambulance I think \"There is someone in there that is going to the hospital. Will them come back or die at the hospital? Is their life going to end there? Is their life still worth living, or are they just desperate, suffering and waiting to die? When will it be my turn to be like them?\"",
   "created_utc": 1690445197,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmybg5",
   "message": "Yes, and it makes me feel amazed and sometimes hollowong pointlessness",
   "created_utc": 1690445391,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmyjc0",
   "message": "yes. sometimes i love people watching for this exact reason. ill go to this restaurant cafe thing near my place and just sit there. the ambiance of the cafe is whack, its a fast food chain and fkin loud all the time but i love sitting there. theres something so peaceful and comforting in just looking at people and thinking how diff or similar we all are and all of our lives just kep continuing in parallel. a bit of kindness, gratefulness and humbleness can go such a long way. and then i take a prayer to whomever that is up there watching us, and think to myself how luck we are to be alive. one love people \u0026lt;3",
   "created_utc": 1690445567,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmzhie",
   "message": "Go to the top of a ferris wheel and look at the little ants. It's that scene from the third man.",
   "created_utc": 1690446317,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtmzw54",
   "message": "Sometimes I do. And then I wonder if there is a word for that feeling? There's surely a German word for it.",
   "created_utc": 1690446644,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn08iy",
   "message": "Yup. Ever since I was a kid. Happens more when I’m a passenger in a car bc most people act like they can’t be seen in their cars.",
   "created_utc": 1690446923,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn0nim",
   "message": "They are just background characters, the Devs programmed them to have simple routines so they appear alive, but really they are just mindless characters following a set path.",
   "created_utc": 1690447253,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn1988",
   "message": "Yes. Crowded spaces make me physically nauseous. It's like my head and the space together are not enough to hold all of those stories.",
   "created_utc": 1690447742,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn1pzn",
   "message": "I find that it's easier to understand people when you realise that everyone around you is the protagonist in their own stories.",
   "created_utc": 1690448109,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn1um2",
   "message": "Yeah I told this to someone and they said it's called being overwhelmed 🥲😬",
   "created_utc": 1690448212,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn21xk",
   "message": "Oh, their lives are easily more complex, complicated, and intricate than mine.\n\nNo wondering at all about that.",
   "created_utc": 1690448375,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn288r",
   "message": "One of my favourite Facebook updates was when I wrote this:\n\nEdinburgh adventure update:\n#6\n\nAfter visiting the war museum within the castle I stop for a pot of mango and strawberry tea and a scone. \n\nOn the table adjacent to me is a, not unattractive, young man writing in a journal. He's on page 6 by the look of it... I ponder what he is writing about...while I am writing about him.\n\nHe stops to take in the view outside the beautiful bay window before continuing his writing.",
   "created_utc": 1690448515,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn2gvc",
   "message": "\"Sonder: The Realization That Everyone Has A Story | A Lust ...sonder – n. the realization that each random passerby is living a life as vivid and complex as your own. \"\n\n[https://www.organizingcreativity.com/2014/03/realizing-that-each-random-passerby-is-living-a-life-as-vivid-and-complex-as-your-own/comment-page-1/](https://www.organizingcreativity.com/2014/03/realizing-that-each-random-passerby-is-living-a-life-as-vivid-and-complex-as-your-own/comment-page-1/)",
   "created_utc": 1690448706,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn30mh",
   "message": "Commutes are when I take notice of that the most.",
   "created_utc": 1690449137,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn3mmz",
   "message": "I do that on that bus in a slightly different way. Sometimes if Im in a packed bus I end up looking at the back of their head, I remember thay everything about this persons experience is just there 2ft in front of me, inside their skull, that little orb on the top of a body, that they could be hearing terrifying voices or beautiful music, their thoughts could be in russian or sign language. Wouldnt it be interesting to experience someine elses mind momentarily",
   "created_utc": 1690449626,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn44gk",
   "message": "I'm usually watching whatever they're watching so no.",
   "created_utc": 1690450021,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn4fs6",
   "message": "Yes. That's the sort of thing that gives you perspective about being judgemental.",
   "created_utc": 1690450276,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn4wpr",
   "message": "I do this but while watching old youtube videos, I mean really old videos, like from 1900/1910/1920\nI go humm that person is dead by now, how he have died? What he did during his time on earth? Was he/she happy?",
   "created_utc": 1690450643,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn5ijw",
   "message": "I have and thought how glad I am I don't have their problems.",
   "created_utc": 1690451118,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn5q7f",
   "message": "Nah but do think about the different ways they could all be felled.",
   "created_utc": 1690451282,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn6ib4",
   "message": "I usually think this when I see a ton of cars on the motorway, everyone there going to different destinations each doing what they need to do in the day.",
   "created_utc": 1690451873,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn7b22",
   "message": "I do this deliberately to give myself perspective on how unimportant I am.",
   "created_utc": 1690452469,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn7era",
   "message": "I'm fairly sure that everyone else is just an NPC",
   "created_utc": 1690452542,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn8bpt",
   "message": "Never done exactly this.\n\nBut it is the reason why I like airports, flights, train stations etc.\nSo many people together. All with their own destinations. Fascinating.",
   "created_utc": 1690453218,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn8m2c",
   "message": "Do you ever look at a crowd and wonder what they think of you?",
   "created_utc": 1690453422,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn8xbu",
   "message": "My life is not complex nor intricate",
   "created_utc": 1690453644,
   "score": 2,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn916s",
   "message": "Bit full of yourself to think your life is the most complex, intricate life around lmao odds are yours is much less intricate than you believe but your ego gives you more importance compared to the others around you",
   "created_utc": 1690453720,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnd8iv",
   "message": "I usually think how many could I get with one clip",
   "created_utc": 1690456476,
   "score": 0,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn9uad",
   "message": "When I was a kid I thought about it a lot, I’d also make up stories about them on long car rides I’d just pick out a person and be like they’re a lawyer who works long hours to provide for kids they never see but have all the nice things, or that person just won the lottery and got hit by lightning in the same day, just random life stories for random people",
   "created_utc": 1690454286,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtn9who",
   "message": "Sometimes, I guess it's probably pretty healthy to do so periodically. Feels like a very fundamental exercise in building and maintaining empathy.",
   "created_utc": 1690454326,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnadbv",
   "message": "no im pretty self centered tbh",
   "created_utc": 1690454644,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnaqja",
   "message": "“I’m Tracy Jordan! When I go to sleep, nothing happens in the world.”",
   "created_utc": 1690454887,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnax3m",
   "message": "I came to this thread thinking how long before someone mentions sonder. Top comment.",
   "created_utc": 1690455006,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnbhz4",
   "message": "All the time. I thought it was just me.",
   "created_utc": 1690455383,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnbu83",
   "message": "Yes.  I wonder what it's like to be them.",
   "created_utc": 1690455597,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtncpro",
   "message": "People watching, my favorite pastime",
   "created_utc": 1690456153,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtndvtg",
   "message": "I have the same thought but for “dull”, boring, mostly residential areas instead. Sometimes I go for walks to some random park and walk through some residential blocks. I like going around and thinking while most people who don’t live there probably won’t think much of the place, I like to ponder on the thought that these boring places are someone’s childhood, their daily routine and for people who’ve lived there but since moved away, probably a fond memory as well",
   "created_utc": 1690456865,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtneo4r",
   "message": "Yes. I often look up at planes too. I wonder how some are not just vacationing, but maybe moving away, getting married, divorced, or flying out for a funeral or sick family member etc.\n\nWe live in a world together, yet have our own just the same.",
   "created_utc": 1690457327,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtneusc",
   "message": "Unfortunately, I have enough going on in my mind that I don't have the capacity to wonder about everyone else's intricacies.",
   "created_utc": 1690457435,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnfdmh",
   "message": "It wasn't until I played GTA V that I realized this.",
   "created_utc": 1690457742,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnfx1m",
   "message": "The first time I thought of this, I pictured it as everyone in the world being able to put all the things in their brains onto a table so we could see everything that was inside of it. That’s a lot of stuff, if they have as much stuff in their brain as I do.",
   "created_utc": 1690458047,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtng764",
   "message": "Some of them. \n\nFor a few I have trouble getting past “damn, they wore -that- outside the house?”",
   "created_utc": 1690458206,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnghvj",
   "message": "This is why I try and keep my mouth shut and listen to others; the tragically beautiful stories and lives of others keep me going.",
   "created_utc": 1690458371,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnghyo",
   "message": "I generally look at the grocery items the people before and after me are buying as a means of amusement, and 'complex, complicated, and intricate' are not the first words that usually spring to mind based upon that sampling method....",
   "created_utc": 1690458372,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnh0yc",
   "message": "Yes! \nSometimes, it utterly sucks. Really highlights my own mortality/insignificance. \nMy weirdest moments are when reading books, fiction or nonfiction, and a death just happens to an unnamed character. \nAnd I go, what about their story? The single second of time for a rifle to be aimed and fired just deleted 30 years of life and growth and relationships.  \n\nAnd poof. \nIt's gone.",
   "created_utc": 1690458663,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnhho4",
   "message": "If more people did this the world would be a better place.",
   "created_utc": 1690458914,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnhrav",
   "message": "No, I’m too busy trying to avoid having a panic attack in public and trying to get through the things I need to do without worrying about and focusing on other people",
   "created_utc": 1690459060,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnhro9",
   "message": "I think about that at a rational level from time to time, because it makes sense. However, i don't really have an emotional reaction to such a realization. I think there are some who do \"feel\" it, but i have yet to experience that sensation.",
   "created_utc": 1690459065,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtni1oo",
   "message": "No. I just want them to get out of my way.",
   "created_utc": 1690459215,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtni2dv",
   "message": "Yo no hablo inglés. Soy de marsian.",
   "created_utc": 1690459224,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtni8i9",
   "message": "Yep. I get especially overwhelmed in airports, when i think about how every person had a completely different process, yet we all got to the same place at the same time and have the same one, immediate goal.",
   "created_utc": 1690459317,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnilvj",
   "message": "Often.  But pretty certain half of them are NPCs.",
   "created_utc": 1690459520,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnimrp",
   "message": "no cause that's rude.\n\ni dont want anyone thinking about me, so i wont think about anyone else",
   "created_utc": 1690459534,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnisg4",
   "message": "No I do not, probably because I barely give a shit about myself so why would I care about random strangers",
   "created_utc": 1690459619,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnjhl4",
   "message": "Honestly. No. I'm pretty damn sure most people don't think nearly as much as I do. This thought just makes me angry because there are so many people that are assholes and I constantly wonder \"How can a living, thinking human be such a dick?\"\n\nThe only conclusion I can come to is that many people don't think, and therefore their lives and existences are not as complex, complicated, or intricate as mine.\n\nThis fact has been confirmed more and more the older I get. People are idiots. And ignorance is bliss.",
   "created_utc": 1690459989,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnk917",
   "message": "Everybody is “I”.",
   "created_utc": 1690460394,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnkbax",
   "message": "I remember as a kid we'd be driving on the freeway and I'd look down at the houses and think \"wow every single one of those has a whole separate family like mine probably with grandparents, parents, cousins, aunts, kids, pets, a history etc\"",
   "created_utc": 1690460427,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnlk4f",
   "message": "That would take a very long time",
   "created_utc": 1690461066,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnlrfz",
   "message": "Of course not.  In a crowd, they're just in my effen way!",
   "created_utc": 1690461170,
   "score": 1,
   "submission_id": "15aprrc"
  },
  {
   "comment_id": "jtnlwkb",
   "message": "No, I don't.  Why not?  Because that's the assumption of life, that everyone's got their own crap going on.",
   "created_utc": 1690461244,
   "score": 1,
   "submission_id": "15aprrc"
  }
 ]
}