{
 "submission_id": "15audil",
 "title": "Men who gave up on dating, what happened?",
 "selftext": "",
 "created_utc": 1690440561,
 "permalink": "/r/AskReddit/comments/15audil/men_who_gave_up_on_dating_what_happened/",
 "score": 96,
 "url": "https://www.reddit.com/r/AskReddit/comments/15audil/men_who_gave_up_on_dating_what_happened/",
 "comments": [
  {
   "comment_id": "jtmu08y",
   "message": "Dating is like taking on a part time job, I don't have the time or the energy.",
   "created_utc": 1690442013,
   "score": 84,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmu4cs",
   "message": "I'm just tired. I feel like everyone I date has a laundry list of expectations for me. I just want to be seen as myself and not just \"a guy\".",
   "created_utc": 1690442100,
   "score": 168,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmtve3",
   "message": "To be honest I’d just rather be a little lonelier than deal with all the hassle of dating; I’m really not in a place emotionally and financially where I can deal with sorting through a bunch of misses to find a missus.",
   "created_utc": 1690441910,
   "score": 159,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn1w4z",
   "message": "My wife insisted it was no longer something I was allowed to do.",
   "created_utc": 1690448246,
   "score": 91,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmvx3u",
   "message": "I just live the single life, I mean I failed in the relationships  I had a real chance with due to my myriad of mental issues I now work to manage.  Issue is I am getting old and the dating pool just shrinks fast after a certain age, so now I just 'retired' from trying while working on keeping my mental problems from controlling my life.  In a way it is liberating, I don't have to try for anyone except myself, so anything I put real effort into is solely for my own enjoyment.",
   "created_utc": 1690443503,
   "score": 109,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmu4eb",
   "message": "Mental illness. I cannot in good conscience subject another person to this.",
   "created_utc": 1690442101,
   "score": 68,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmty2s",
   "message": "I've learned to not look. Just keep doing other stuff. Looking leads to misery.",
   "created_utc": 1690441966,
   "score": 87,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtms9wu",
   "message": "Was forced to give up because what’s the point when I tried and got 0 results.",
   "created_utc": 1690440693,
   "score": 81,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmu5zy",
   "message": "Delete all data apps. Go old school. Like all social media, they fucking ruin everything. I realize the irony of posting this on reddit.",
   "created_utc": 1690442134,
   "score": 45,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmteez",
   "message": "girlfriend died",
   "created_utc": 1690441544,
   "score": 23,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn2akg",
   "message": "I lost the love of my life through my own fault and I’m in a wheelchair. Feels like I’m not worth anything to anyone anymore.",
   "created_utc": 1690448567,
   "score": 35,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmskib",
   "message": "Maybe it's just my town or something but literally every girl I take a liking to is already dating someone and I usually find out the second I ask them out. It's demoralizing",
   "created_utc": 1690440911,
   "score": 30,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmth8s",
   "message": "it's not that I've given up on it, but I just don't seem to find anyone interested in me. I've literally had zero dates this year, I've been to singles parties with 100s of other people most of whom who are single  (or met in the group) and still gone home alone.",
   "created_utc": 1690441605,
   "score": 13,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn9qtl",
   "message": "Single Dad, happy in my own skin, don't need a partner.\n\nMy only and primary focus is my child.\n\nPotential partners don't seem to understand that.",
   "created_utc": 1690454220,
   "score": 12,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmz45l",
   "message": "Shits fucked",
   "created_utc": 1690446024,
   "score": 24,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn1b95",
   "message": "i was broken up with by the love of my life a little over a year ago, a relationship of which i thought it would last a life time. don’t have the motivation anymore. don’t really care about anything anymore to be honest lol.",
   "created_utc": 1690447787,
   "score": 10,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn14hy",
   "message": "Dating is just emotionally traumatizing lately. \n\nI matched with this girl who lived out of state. But there was an instant connection. We texted and called for hours every single day for 2.5 months. She even FaceTimed-introduced me to her best friends.One day she just unadds me from Snapchat and starts slowly ghosting me. When I asked if she was okay, she sends me a “We should just be friends” days later. I really fell for this girl and she was supposedly falling for me too. And that wasn’t even the first time something like that has happened. Idk if I can keep doing this boys ):",
   "created_utc": 1690447634,
   "score": 20,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmtp3h",
   "message": "I stopped trying to get dates. Ended up meeting my wife a little while later, her cousin was dating my best friend/roommate and kept hanging out at the house and things happened organically",
   "created_utc": 1690441772,
   "score": 7,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtncrgw",
   "message": "Spoke with some ladies but i found something each time that made me think \"yeah, this isn't gonna work out\". \n\nLately i don't even speak with anyone, let alone dating. I've been feeling like, I'm too heavy to handle myself so i don't expect anyone else to carry it.. and let's be real, no one is gonna be willing to handle someone that can't even handle himself. So I'm dealing with that or trying to deal with that i don't really know. \n\nMental problems aside, i don't feel like i have a chance in dating world either. I mean I'm a mid looking guy at best and I'm a bit more emotional person rather than those cold guys, which is a turn off i guess. So i basically eliminate myself from the dating pool lol \n\n\nBasically, when i felt I'm okay to date it didn't work out. Now I'm not in a state to date anyone due to my mental health at the moment and i guess I'm not really a desirable guy anyway.",
   "created_utc": 1690456182,
   "score": 6,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn9cyj",
   "message": "Dating apps suck. People don't want to get to know each other on them they want to be entertained. \"Hello\" and \"I see you like ..\" are considered boring. \n\nMeeting people IRL becomes difficult when you work nights and weekends",
   "created_utc": 1690453951,
   "score": 5,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtncjbe",
   "message": "Everytime I did, I got cheated on. \n\nSelf pity and comfort food led to size increases i am having trouble shaking which has led to me having trouble connecting or getting past the first date when I have tried",
   "created_utc": 1690456042,
   "score": 5,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmxc4s",
   "message": "Near impossible to find someone who:\n\n\u0026amp;#x200B;\n\nWants to be a partner instead of a girlfriend.\n\nWill accept split bank accounts with a shared splitting of shared costs, equal responsibility.\n\nHave a job with either decent pay or a path to decent pay.\n\nAn understanding that being together 100% of the time is not necessary or healthy.\n\n\u0026amp;#x200B;\n\nNot much to ask but it seems like people just want a free ride.",
   "created_utc": 1690444626,
   "score": 47,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnb5pk",
   "message": "Ran into a girl randomly in public, started talking, got her number as one of my first questions, hung out a few hours, got a date the next day. Been hanging out every day since. Guess giving up and saying screw it--just ask this time worked. I never tried that before, assuming rejection was just bound to happen.",
   "created_utc": 1690455163,
   "score": 4,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn0wv5",
   "message": "Too busy running a business",
   "created_utc": 1690447461,
   "score": 8,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnau85",
   "message": "The more I interact with women in relationship dynamics the less I viewed women because of the way they treated me. Their bias towards men, was starting to justify me having and believing in bias towards them. Also was tired of getting hit and being pressured to accept compromises I should have never accepted. I still don't understand why violence and sexual assault against men is still acceptable.",
   "created_utc": 1690454953,
   "score": 8,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmtyli",
   "message": "Got married.",
   "created_utc": 1690441977,
   "score": 11,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmuy6q",
   "message": "Hadn’t met someone that draws me in since I got out of my last relationship. When I finally did, this person hates me so…..I don’t see any choice.",
   "created_utc": 1690442738,
   "score": 3,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn1jqq",
   "message": "I have no free time or energy for meeting people, and nothing anyone would want in a partner. \n\nJust doesn't really make any sense to try.",
   "created_utc": 1690447972,
   "score": 3,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtncl7u",
   "message": "Haven’t given up on dating I’m just no longer looking for anyone.  My last relationship leaving me without most of the money and possessions I walked into it with notwithstanding.",
   "created_utc": 1690456074,
   "score": 3,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtndzf3",
   "message": "Bad luck. Cheated on twice. Honestly isn't worth the effort. If something happens, it happens. If not, I'll live my life as a single virgin. I don't need a girl, I'll just take my car.",
   "created_utc": 1690456922,
   "score": 3,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn7f4p",
   "message": "Made enough money so now I just pay for play with girls out of my league.",
   "created_utc": 1690452549,
   "score": 6,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn4aww",
   "message": "Obviously it’s super anecdotal but in my experience women just aren’t all that great. I’m gonna get a lot of hate for saying it but like young women (\u0026lt;25) especially are just kinda useless. Like lazy, no skills, no hobbies, can’t hold a conversation, and no loyalty. All they’re really bringing to the table is sex, and even then I’m the one putting in all the work and effort while she just starfishes. It’s all just such a high effort high cost performance for nothing really.\n\nAnd like there’s just no incentive to settle down, especially since I don’t need to be in a relationship to get sex. I’d rather work on myself for the long-term and maintain my health, my freedom, control over my own situation, expenses and finances etc and just get sex casually on the side rather than sacrifice those things to look after this human sized pet rock who contributes nothing to an arrangement that should be 50/50.\n\nI know it sounds like some incel shit and I’m gonna get downvoted but I just wanted to be real for a second and give an honest male perspective. I do imagine it gets better as you get older tbf.",
   "created_utc": 1690450166,
   "score": 21,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmy42j",
   "message": "Beyond 30-35 the dating pool shrinks to the ugly and the crazy  (in general, not as in 100% always).  \nAnd to those who desperately want to  get pregnant (Not that this is a bad thing, but it's likely that they are not necessarily interested in you as a person. \"Mission accomplished - divorce incoming - pay for the rest of your life - no, you won't get the kids\"). \n\nBeyond 50+ you have to be really lucky to get anyone decent (that is for all sexes).   \nAnd with sexual desires somewhat slowing down you eventually stop bothering and live your life on your own.",
   "created_utc": 1690445229,
   "score": 12,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmvs7z",
   "message": "Improved my photos multiple times, still the same results.",
   "created_utc": 1690443398,
   "score": 3,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn4mpx",
   "message": "Tired of the expectation that as a man I need to put 120% into the relationship and still have the energy/time to deal with whatever other bs is going on by myself. \n\nIt's cool though, I'll have a house, a career I love and a couple of my dream cars by 35. I'd rather retire early and spend my free time in peace doing what I love, which is driving and road trips.",
   "created_utc": 1690450428,
   "score": 7,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn18mz",
   "message": "It's easier to love imaginary things",
   "created_utc": 1690447728,
   "score": 2,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn55fs",
   "message": "A few reasons: \n\n- My last relationship sucked, and I don’t wanna risk putting myself through that again.\n\n- I haven’t found anyone recently that I’ve been genuinely attracted to. I’ll have a passing interest in someone, but it’ll fade pretty quickly. I don’t wanna enter a relationship with someone who I can’t see being with long-term. \n\n- My school is very socioeconomically different from the area I grew up in. I don’t really feel comfortable pursuing relationships with people who are significantly more wealthy/privileged than I am. It just seems like too much of a barrier to overcome.\n\n- I don’t have as much confidence in myself as I used to. While I’ve lost weight/gotten better hair, a series of rejections in the past has made my confidence diminish quite significantly. The third point plays a big part in this as well. \n\n- My parents’ recent divorce, as well as the state of my dad’s parents’ marriage, has made me pessimistic about my ability to have a marriage/family in the future. While I actively try to not be like my father and grandfather, I worry that I’ll end up becoming like them someday. \n\nI haven’t “given up” on dating per se, but I’m not actively making an effort either. I’m just apathetic atm.",
   "created_utc": 1690450830,
   "score": 2,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn8wws",
   "message": "Covid happened",
   "created_utc": 1690453636,
   "score": 2,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn9xs4",
   "message": "Had a relationship in my sights and my mother found out about it, she said if I went through with it, it would ruin her relationship with the rest of the friend group (long story) so basically was cock blocked by my mother lmao. First time I get a chance after I got my heart broken, I’m shot down again by different circumstances.\n\nI’m really just being petty I feel like because tbf I’m a testosterone filled young adult who wants some action, but at the same time this was a chance to explore different styles of dating and try something out and it got taken from me. My mother isn’t the boss of me but got me and this girl to stop doing what we were doing because it messed with her perspective of the friend group. The friends are still the same people, just hiding behind what you won’t let them express.\n\nI just woke up, I hope to god no one sees this LMAO",
   "created_utc": 1690454350,
   "score": 2,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnbolq",
   "message": "I don't have exceedingly high standards but i have *some* standards. And im just not willing to drop them. I've always preferred a solitary lifestyle anyhow.",
   "created_utc": 1690455500,
   "score": 2,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtncg3s",
   "message": "No one was interested in me",
   "created_utc": 1690455985,
   "score": 2,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnfeqh",
   "message": "Erectile dysfunction",
   "created_utc": 1690457759,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtng4fb",
   "message": "Tired of being judged by people who are so lazy they dont even try to scratch the surface",
   "created_utc": 1690458163,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn6dr1",
   "message": "In the words of The great one.\n\nOh, what's the point? When I like them, they don't like me, when they like me, I don't like them. Why can't I act with the ones I like the same way I do with the ones I don't like?”\n\n— George Costanza, \n\n\nI in all honesty thought I recently had a good one... then she turned into a crazy person after we moved in together. Almost drove us off a bridge after a tantrum.",
   "created_utc": 1690451775,
   "score": 5,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn8yu4",
   "message": "Tried, got 0 results.\n\nSocially awkward so i dont go to bars and stuff so used dating apps. Pretty sure i can count on 1 hand the amount of matches i got.",
   "created_utc": 1690453673,
   "score": 3,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnd0e4",
   "message": "Haven’t given up but I think my standards are way too high, when I was young my first relationship ended because I had a job in high school and wasn’t able to see her as much as she wanted so she dumped me, next girl which I met at work in high school was fun and wild but she kept telling me about her ex, turns out he wasn’t an ex and she lied to me telling me she was cheating on him with me, felt so used, dumped her, after that the next girl I dated wanted to make her ex jealous, found out after the fact and when that happened we broke up, next one I asked for her number as she was someone I knew when I was younger and it was great at first until she told me she really was only wanting to use that as an excuse to become friends, I’ve had a lot of bad first dates, now I haven’t dated anyone since the pandemic, it seems hard now since I’m older and don’t want to date anyone with kids (personal preference) but I’ve been hurt so many times by women, I’m not the best looking, hell… not even close but my personality is good, I just have to protect myself as I keep getting more and more picky with each relationship feeling like they want something from me and not me if that makes any sense… it’s frustrating but people who enter my life and want to date me for one reason or another I just don’t have a spark with them so I don’t know, online dating for a mid-lower mid looking guy… yeah no one responds to me so I don’t waste my time",
   "created_utc": 1690456337,
   "score": 3,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn6dby",
   "message": "Wife forced me to stop.",
   "created_utc": 1690451766,
   "score": 5,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmtd03",
   "message": "Due to some issues that probably need therapy I'm not getting into any relationship until I become filthy rich",
   "created_utc": 1690441515,
   "score": 2,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn7h2b",
   "message": "I just saw the statistics on how slim the chances are for an average man on Tinder. It's literally fractions of a percent. I might as well fly to the Moon with the same success rate.",
   "created_utc": 1690452588,
   "score": 2,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn1ghm",
   "message": "My wife started to get a bit annoyed.",
   "created_utc": 1690447901,
   "score": 3,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmz8gr",
   "message": "Money. Decided to get a vasectomy, build an emergency fund, and ensure the money doesn't bleed out on unnecessary expenses. I've still been dating my toxic ex because she knows the deal. New dates are risky. I feel like if I dated new people I would expect money to flow more freely for appearances if I were in their shoes. That can't happen when the world feels so dire.",
   "created_utc": 1690446116,
   "score": 2,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn562n",
   "message": "Nothing. I still go on as many dates as before.\n\nNone.",
   "created_utc": 1690450845,
   "score": 2,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtngupd",
   "message": "Well this is all uplifting and hopeful for a single woman looking to date 😣",
   "created_utc": 1690458567,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmsk8e",
   "message": "Attract, don’t chase 😌",
   "created_utc": 1690440906,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtngeqj",
   "message": "I met my wife and we have kids now. So mission complete I suppose.",
   "created_utc": 1690458322,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtndv6a",
   "message": "Why bother with dating. Most people on sites see men as a free meal. Then you have manipulators who would do anything for what they want. Then you have people only wants money because I heard as soon as someone married someone they get divorced and lose half of not more than half of their money and anything else they own. Women are now cheating more. https://nypost.com/2022/08/23/women-are-more-likely-to-cheat-than-men-heres-why/\n\nWe're also never going to see our child even if we fight hard. If we also show our emotions people would take it and use it against us. So tell me why as a man should we be dating?",
   "created_utc": 1690456854,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmwmne",
   "message": "I don't do \"casual dating\". I mean sex is great and all, but I don't really care about some random hookups. I'm actually more interested in real connection. And since I'm not interested dating crazy so most of the western women are not to my liking. Most people think that means I want some houseslave, but that's not at all what I want, I want a strong partner, someone who I'm willing to strong with. I can't be some drunken fat fucker either, relationship should be equal partnership. Hate me all you want, but that's what I think.",
   "created_utc": 1690444068,
   "score": 250,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn0ott",
   "message": "Got a partner and it’s frowned upon to continue.",
   "created_utc": 1690447281,
   "score": 0,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn88pt",
   "message": "Became a prostitute. Gotta get my holes filled one way or another",
   "created_utc": 1690453158,
   "score": 255,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtmyty6",
   "message": "Married",
   "created_utc": 1690445802,
   "score": 0,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn7t2f",
   "message": "I landed what I wanted👍",
   "created_utc": 1690452833,
   "score": 0,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn8zef",
   "message": "I have neither the time nor the money for that.",
   "created_utc": 1690453685,
   "score": 0,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn9dgz",
   "message": "Got married",
   "created_utc": 1690453960,
   "score": 0,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn9zjm",
   "message": "I got married",
   "created_utc": 1690454383,
   "score": 0,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnayh6",
   "message": "Got a GF.",
   "created_utc": 1690455032,
   "score": 0,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnbmor",
   "message": "I got married. I still take my wife out, but I’m not actively dating any more.",
   "created_utc": 1690455467,
   "score": 0,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnbn27",
   "message": "Got married.",
   "created_utc": 1690455473,
   "score": 0,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtncnry",
   "message": "My wife won't let me.",
   "created_utc": 1690456119,
   "score": 0,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnfha9",
   "message": "Married one",
   "created_utc": 1690457799,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtng0qj",
   "message": "Got married",
   "created_utc": 1690458105,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtngu6y",
   "message": "Got married.",
   "created_utc": 1690458560,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn1c18",
   "message": "Modern feminism is what killed the chivalry of being a gentleman.",
   "created_utc": 1690447803,
   "score": 242,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn7c1l",
   "message": "Those damn storks!",
   "created_utc": 1690452489,
   "score": 255,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn9bue",
   "message": "I got married",
   "created_utc": 1690453929,
   "score": 254,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn3nsf",
   "message": "I don't want to upset my wife...",
   "created_utc": 1690449651,
   "score": 253,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn92nq",
   "message": "My gf doesn't let me :(",
   "created_utc": 1690453748,
   "score": 253,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtms93r",
   "message": "Sex",
   "created_utc": 1690440676,
   "score": 252,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnb280",
   "message": "Radical feminists, I'm guessing. The types that say you're not allowed to open doors for them (apparently you have to smell this preference before you do it), or explain something to them (\"mansplaining\"), but still want men to foot the full dinner bill. When these expectations aren\n\nIt's not a lot of women that are affected by this, but it's spreading. And it's just not worth the risk.",
   "created_utc": 1690455100,
   "score": 252,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn44ir",
   "message": "frigidity in communication",
   "created_utc": 1690450022,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn7jse",
   "message": "Happliy ever After i guess? \n\nIts a peaceful life",
   "created_utc": 1690452644,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn91s9",
   "message": "Women I wanted to be with clearly made me known that I had no chance.",
   "created_utc": 1690453731,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtn9nox",
   "message": "I barely have enough time, energy or money for myself fuck being a burden for someone else",
   "created_utc": 1690454160,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnal4y",
   "message": "They were finally happy.",
   "created_utc": 1690454789,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnb7io",
   "message": "Nothing. I really enjoy being alone, and that's it. Suddenly it just made sense that I don't need to put any energy on something that gives me nothing in return.",
   "created_utc": 1690455196,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnbf8h",
   "message": "Who gave up? No one wants me!",
   "created_utc": 1690455332,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtnbyb7",
   "message": "they said there'd be plenty of fish in the sea, but I am a slimy land slug. If I go in the ocean i will die.",
   "created_utc": 1690455670,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtncb88",
   "message": "i think there is no point in writing day/month/year to every single thing i do.",
   "created_utc": 1690455899,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtncq6a",
   "message": "Probably being broken-hearted doesn't help...!",
   "created_utc": 1690456160,
   "score": 1,
   "submission_id": "15audil"
  },
  {
   "comment_id": "jtncqvx",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15audil"
  }
 ]
}