{
 "submission_id": "15ava6n",
 "title": "What caused you to stop smoking cigarettes?",
 "selftext": "",
 "created_utc": 1690443691,
 "permalink": "/r/AskReddit/comments/15ava6n/what_caused_you_to_stop_smoking_cigarettes/",
 "score": 64,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ava6n/what_caused_you_to_stop_smoking_cigarettes/",
 "comments": [
  {
   "comment_id": "jtmyfr3",
   "message": "Vaping got me off cigarettes, and then nicotine patches/gum got me off vaping. \n\nIt's still a struggle, but so far I've held strong.",
   "created_utc": 1690445487,
   "score": 177,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmxrsq",
   "message": "Got tired of the smell and icky feeling on my teeth. It’s honestly way easier to quit cigarettes than vaping. Just quit cold turkey if you’re planning on quitting.",
   "created_utc": 1690444964,
   "score": 186,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn0kla",
   "message": "Nothing. One day I decided I had enough. After that decission I smoked on two separate occassions and after that never touched a cigarette again. It s been 11 years",
   "created_utc": 1690447187,
   "score": 67,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmxuhp",
   "message": "Ive smoked for 31 years most of them at a pack a day. About 7 of the latest years were a pack a week. and a couple years ago i just lost interest in it and tapered off. About a month ago i had a lot of stress and bought a pack, but they didnt have the same effect on me. I got all green and wobbly.",
   "created_utc": 1690445024,
   "score": 140,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmysif",
   "message": "I only started smoking cigarettes originally to talk and bond with my mothers boyfriend, I had lost my father 5-6 years prior and found it as a way to gain a father figure/friend. \n\nHe left my mum and I was at that time addicted… but over time every time I smoked I always just felt increasingly alone, sitting outside day or night just staring at the grass wishing for company.",
   "created_utc": 1690445771,
   "score": 136,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn1m93",
   "message": " Pregnancy! 6 months pregnant and I’m not going back",
   "created_utc": 1690448026,
   "score": 191,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3fgk",
   "message": "Met a girl.  She said stop.  15 years and 4 kids later, I'm glad I picked her over the ciggies.",
   "created_utc": 1690449468,
   "score": 237,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn0zc3",
   "message": "I'm 21 and tommorow I finish my last pack!\nI've gotten a new car and thought to myself: why am i even smoking? My life's going well and I shouldn't destroy that. Last thing i want is to die from Cancer. We live in exciting Times. We can see the interplanetary travel unravel on our eyes and i'm going to die from a Cancer stick? No fucking way.\nSo I decided to smoke my last cigarettes and stop altogether. Got a vape with Little nicotine so it would help me to stop. Wish me luck!",
   "created_utc": 1690447518,
   "score": 58,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmyz6i",
   "message": "When a friend of mine was diagnosed with stage 3 lung cancer",
   "created_utc": 1690445918,
   "score": 68,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmware",
   "message": "I stopped vaping bc I knew one day I would quit, and then a few months of really wanting to quit, and then just a week of feeling like shit knowing its probably the cheap ass njoy, then one morning I was coughing bad already and I bought nic gum. \n\nNow if I crave anything I just smoke weed lol, what's great about that is I can have a whole normal sober day and then not need anything once I get home bc I have weed",
   "created_utc": 1690443804,
   "score": 9,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn0zfq",
   "message": "I'm planning on stopping pretty soon. It's really not an easy addiction to overcome. You can go cold turkey for 24 hours, wake up absolutely fanging, that cigarette that you relapse gives you a huge rush and reaffirms everything you thought you knew \"I really need these things\" some people quit easily (I've done it easily before lately it's hard) while other people really struggle.\n\nThat being said, the way I am attempting to quit is using a drug that used to be called champix and now is renamed. I got a script for it the other day. It's supposed to block off withdrawals and make you feel gross if you have a cigarette. I'm a pretty heavy smoker, so we will see how I go, I know some people are having success with it.",
   "created_utc": 1690447520,
   "score": 22,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn03jm",
   "message": " Well, mate, it wasn't some life-altering epiphany or anything fancy. I just realized that puffing on those cancer sticks was turning my lungs into smoked bacon. No thanks, I'd rather breathe!",
   "created_utc": 1690446811,
   "score": 20,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn1myf",
   "message": "Two things.\n\nFirst, I was moving to a place where cigarettes were more expensive and the cost of living was higher in general.  So there was a financial aspect to it.\n\nSecond, Chantix had been out for about five years, and I hadn't heard of any terrible side effects from it, so I figured I'd give it a shot.  (While I definitely found out later about many people who had absolutely terrible side effects, I was fortunate, and never had any at all.)\n\nBetween those two things, I managed to quit, and I've been free of cigarettes (and all nicotine products) for over a decade now.",
   "created_utc": 1690448041,
   "score": 11,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2o97",
   "message": "I quit 5 months ago.  I'm not yet 50 and smoked for over 35 years, some heavy, some light, and 3 not at all when I had my child.  I've \"tried\" to quit before, but not really because I really enjoyed smoking, with morning coffee, drinks, a good meal, and feelings.  However,  sometime last year I really hated how I felt in the morning physically and how dirty it all of a sudden it felt anytime I lit up, like for the first time I could actually smell ashtray inside me.  I chose a particular shaped vape box to segue, and now I hardly puff that either.  I miss smoking some days and almost forget I quit and walk outside absent minded to light up, but I don't actually crave them nor am I going up the wall by not having one. I'm done smoking.",
   "created_utc": 1690448867,
   "score": 18,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2l54",
   "message": "Waking up coughing. Was a pack a day smoker for a while. Read a book called \"The Easy Way to Quit Smoking\" by Alan Carr, then I read it again, and then I listened to the audio book. I wanted the book to permeate into my subconscious. I brainwashed myself with the book. \n\nI had quit several physiological addictions before. It had been relatively easy for me, I knew I just had to wait out the withdrawal symptoms and I was home free. But I didn't apply the same mindset to smoking, I'd made smoking a part of my identity. \n\nThe book ended that for me. I quit smoking like I did every other drug, just waiting out a few weeks of discomfort, getting through it however i can except smoking a cigarette, and then I'm free. \n\nThat was in 2011. I've had no relapses, not been tempted. Changing beliefs through your subconscious is the easy way to do just about anything.",
   "created_utc": 1690448798,
   "score": 44,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmzs76",
   "message": "The price its too expensive to smoke so I quit",
   "created_utc": 1690446557,
   "score": 44,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn1tbr",
   "message": "I took up pipe smoking. A 40g pouch of tobacco lasts me a week.",
   "created_utc": 1690448184,
   "score": 8,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3q0d",
   "message": "Jan 5, 1998, just after midnight, was my last cigarette.  \n\nI finally had enough of the expense, being ostracized ( smokers don't care if you don't smoke but non smokers care if you do), and coughing up a lung every morning. What helped me quit was this: a nic-fit only lasts a few minutes, then you're ok for a while. Then it happens again, then you're ok. But each time it's a tiny big less severe and spread further apart. Barely noticeable difference at first, but eventually you realize that you're only having one twice a day, then once, then once a week, etc.  \n\nThat and gum. It cost me a few cavities but it was worth it. I actually quit.",
   "created_utc": 1690449699,
   "score": 34,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4exk",
   "message": "Coughing up blood in the shower",
   "created_utc": 1690450256,
   "score": 35,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmwbxj",
   "message": "My brother had a very untimely medical crisis and his doctor told him (among other things) that he had to quit smoking, so I quit with him and it ended up benefiting us both",
   "created_utc": 1690443830,
   "score": 5,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmz4mx",
   "message": "The flavour, smell and cancer",
   "created_utc": 1690446035,
   "score": 5,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmzy2b",
   "message": "I met my now husband and during our first trip together he asked me if I was willing to stop smoking, I hadn’t smoked for long but he was still worried about my health. I promised him that I would stop and hadn’t smoked since (2 years ago).",
   "created_utc": 1690446687,
   "score": 7,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2lqm",
   "message": "Anxiety, I was getting the shakes and a racing heart from the nicotine. One day I realised how much worse it was making my life and I went cold turkey. Two years later and I don't miss it a bit.",
   "created_utc": 1690448811,
   "score": 7,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2rlp",
   "message": "Started taking Wellbutrin for depression, and a couple months later was confused as to why I'd get halfway through a cigarette and be like bleechh I don't want this, and then I finally put it together and was like hey might as well go all the way, used Nicotrol Inhaler for a while and then that was it, just kinda poof.",
   "created_utc": 1690448938,
   "score": 4,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3rpu",
   "message": "Was getting to expensive at $60 dollars a pack and I was struggling to breathe",
   "created_utc": 1690449736,
   "score": 7,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn17w2",
   "message": "Death, I died",
   "created_utc": 1690447711,
   "score": 0,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmzqr3",
   "message": "Tuberculosis",
   "created_utc": 1690446525,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmzxwu",
   "message": "I saw that a lot of people who smoke are trashylower class types and i saw them and realized i must protect my status and have a little pride so i had to quit",
   "created_utc": 1690446684,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmzan3",
   "message": "I’ll reach the 5-year mark next January.\n\nYay me. 🙂",
   "created_utc": 1690446164,
   "score": 10,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmzm56",
   "message": "Cancer",
   "created_utc": 1690446422,
   "score": 3,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmztuo",
   "message": "I was tired of engaging in sub-mammalian, slavish behavior.",
   "created_utc": 1690446594,
   "score": 250,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmyk8s",
   "message": "I never did and the fact that I lost my dad at a very young age because of them makes me set for life",
   "created_utc": 1690445588,
   "score": 254,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn0qov",
   "message": "Smell terrible, feel gross all the time. Plus I got into a relationship with someone who hated it.",
   "created_utc": 1690447322,
   "score": 0,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn11xc",
   "message": "maybe i’m just lucky but i never once ever liked smoking. cigarettes smell too gross, i only vape when drunk girls want me to hit their vape, but never think about seeking it out on my own",
   "created_utc": 1690447576,
   "score": 254,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2c69",
   "message": "The pandemic. I thought it would be better not to damage my lungs more during a lung disease.",
   "created_utc": 1690448602,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3q1v",
   "message": "Covid",
   "created_utc": 1690449700,
   "score": 0,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3wlj",
   "message": "Nothing, never started luckily",
   "created_utc": 1690449845,
   "score": 253,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmw9fs",
   "message": "Never smoked a cigarette",
   "created_utc": 1690443775,
   "score": 239,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmw9uw",
   "message": "My daughter birth",
   "created_utc": 1690443785,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmwpnp",
   "message": "I started smoking around march this year.10 days ago i quit because i started to notice i couldn't breath properly and my chest was heavy all the time.",
   "created_utc": 1690444136,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmxax5",
   "message": "Watched my grandpa take his last breath. He had COPD.",
   "created_utc": 1690444600,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmy1vg",
   "message": "Dating an asthmatic.",
   "created_utc": 1690445183,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmy95b",
   "message": "Pneumonia",
   "created_utc": 1690445340,
   "score": 5,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmyhhl",
   "message": "Covid",
   "created_utc": 1690445526,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmyt1x",
   "message": "The constant coughing in the morning.",
   "created_utc": 1690445783,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmzxkp",
   "message": "Waking up at night coughin my lungs out.",
   "created_utc": 1690446677,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn06yg",
   "message": "Simply waking up in the morning and coughing. I was smoking around 25 years with some (longer) interruptions. But it was never easier to quit than this time.",
   "created_utc": 1690446888,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn0l3c",
   "message": "Having kids.",
   "created_utc": 1690447199,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn0yrd",
   "message": "I was only ever a casual smoker but I stopped that when I started to seriously think about getting pregnant. Most of my smoking was done when going out and drinking, so stopping both at the same time made it much easier.",
   "created_utc": 1690447505,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn1exn",
   "message": "I'm 16m and have been smoking/vaping for a year and only told one of my friends and my gf doesn't know and I just need some tips on how to quit",
   "created_utc": 1690447866,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn1lea",
   "message": "Vape.",
   "created_utc": 1690448007,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn1ntr",
   "message": "The anxiety of my neighbours complaining about the smell of smoke and the expense. They got so expensive.",
   "created_utc": 1690448061,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn1p3x",
   "message": "My tonsils get infected after a while and i become sick with fever, therefore I can’t smoke",
   "created_utc": 1690448090,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn1sl9",
   "message": "I just didn’t like it. Seeing photos of how they’re tested on animals helped!",
   "created_utc": 1690448167,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn20op",
   "message": "Triathlons",
   "created_utc": 1690448348,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn23v2",
   "message": "price,$65 30grm around $90-100 50grm",
   "created_utc": 1690448418,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn25gj",
   "message": "i outgrew the habit that came from wanting to look cool and be cool as a kid in front of siblings and friends. too many years later i realized i didnt need to look or feel cool anymore. i then paid more attention to the inconveniences a cigarette habit causes and the bad side effects such as smell and health issues and that just motivated me even more to stop. so i did and my quality of life has certainly improved.",
   "created_utc": 1690448454,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn25y8",
   "message": "Can’t sing anymore, and it kills me",
   "created_utc": 1690448464,
   "score": 3,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2cw8",
   "message": "probably the fact i am 17 also the fact i wanna live longer",
   "created_utc": 1690448619,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2ivq",
   "message": "My ex kinda did. \n\nNow it's more than before.",
   "created_utc": 1690448751,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2kb3",
   "message": "There was no way to hide it. I had to brush my teeth, wash my hands, change clothes. That’s too much to keep up. It took a good ten years to fully let them go, use nicotine replacement and stop wanting them completely. I’m happy to be alive in a time that it’s unpopular bc I would have smoked all my life if not",
   "created_utc": 1690448781,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2n0c",
   "message": "health.  3rd cold turkey did it.",
   "created_utc": 1690448839,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2o5v",
   "message": "Getting cancer (diagnosed at 34)",
   "created_utc": 1690448865,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2oxp",
   "message": "The price got out of control.",
   "created_utc": 1690448881,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2rwe",
   "message": "Massive heart attack.",
   "created_utc": 1690448944,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2tkb",
   "message": "I got bored",
   "created_utc": 1690448980,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn2zfi",
   "message": "Mainly the price",
   "created_utc": 1690449110,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn36jy",
   "message": "I started vaping and now rarely do that. It’s great to be free.",
   "created_utc": 1690449269,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3bgj",
   "message": "Nicotine and caffeine both has no effect on me and I picked up smoking socially because of work. After I left that job I went from smoking everyday for 2-3 years to just nothing.",
   "created_utc": 1690449378,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3dyl",
   "message": "The cost in Australia is insane. Also got tired of being a slave to it. I wanted to quit for my kids. First quitting I used patches. They worked, a few weird side effects if I left them on too long (auditory hallucinations). I had quit for a while, then got made redundant and started up again to cope. Fell right off the wagon and was back full time, hiding it from my family and hated knowing I was spending so much and not being truthful. Second son was born right before Covid lockdown. I started taking lozenges and haven’t smoked since. Glad to have quit. Haven’t looked back, although the weirdest things give me cravings. Watching family guy and seeing Brian smoking makes me desperate for a smoke. Also walking around with the family and passing thru a smoking area - the family are all repulsed, not me. Nice deep breath.",
   "created_utc": 1690449433,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3f1g",
   "message": "My girlfriend at the time (now wife) told me I need to quit. A bit because she hates the smell, but mostly because when we met she had a 2 month old and  when we got together we knew we would want another child.\n\nSo went cold turkey. Im allowed to smoke when we have a babysitter for the night and we are spending that evening with friends :p So I get my hit 2-3 times a year.",
   "created_utc": 1690449458,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3htf",
   "message": "They got more and more expensive. Plus it got harder to get Seven Stars in the US so I just dropped it altogether.",
   "created_utc": 1690449520,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3jg3",
   "message": "My parents chaught me",
   "created_utc": 1690449557,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3jgj",
   "message": "I have a method I used to quit smoking I go an hour without a cigarette then the next week an hour 15 an hour and a half after it so on until I hit 3 hours and then by then I'm only smoking four a day so I can just take the pack and go away",
   "created_utc": 1690449557,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3o6e",
   "message": "My now husband told me on our third date my smokers cough sounded exactly like his fathers did just before his father was diagnosed with terminal lung cancer. That was 25 years ago. He later admitted it was a little bit of a white lie. It was easy to stop when I thought about that.",
   "created_utc": 1690449659,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3p96",
   "message": "\nThis is my first answer on quora.. and I prefer it to be anonymous.",
   "created_utc": 1690449683,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3qdm",
   "message": "Started dating a girl who didn't smoke.",
   "created_utc": 1690449708,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3t1f",
   "message": "This is about my mom. She started smoking in her first year of college in 1952. She quit in November of 1987. It was Thanksgiving and I and my sibs were trying to convince our mom to quit. This was the same timeframe that indoor smoking laws were changing. Mom got really mad, threw down a dish towel saying that you'd think it was a crime to smoke and stormed out of the house. She quit cold turkey that day out of anger and spite. We were sorry we made mom feel bad but are grateful she quit. Unfortunately, in the 35 years she smoked, she scarred her lungs and now has interstitial lung disease and can't go anywhere without O2. She can barely breathe without O2, even sitting down. Thankfully she quit. We probably would have lost her years ago if she had continued. For those of you trying to quit, you can do it.",
   "created_utc": 1690449767,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3t3n",
   "message": "Cigarettes",
   "created_utc": 1690449768,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3tok",
   "message": "the birth of my first child",
   "created_utc": 1690449781,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3uza",
   "message": "Nothing, I never started.",
   "created_utc": 1690449810,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3vc2",
   "message": "The looming sense of an early death.",
   "created_utc": 1690449817,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3w27",
   "message": "Getting super exhausted after doing a little bit of physical activity",
   "created_utc": 1690449834,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn3zh7",
   "message": "Just before I really got into smoking, a very close uncle of mine got sick. He was a really heavy smoker. He eventually had to be rushed to the hospital, and me, being really close with him, went along with his family.\n\nOn the way to the hospital, with his really weak voice, he told me to not smoke the way he did and take care of my health. On the day of his funeral, I promised myself to never be a smoker.",
   "created_utc": 1690449910,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn41ab",
   "message": "I bought a house and didn't want it to stink. Also, I wanted the lung capacity to climb a mountain with my dad before he got too old for it. And money, health, etc.",
   "created_utc": 1690449950,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn47uu",
   "message": "Tbh, at some point I was just sick with myself. \nI used to smoke a lot, and at some point of the day I would just smoke and hate it but I remember I couldn't let it go either, that cognitive dissonance moment made me want to want to quit ( I didn't misspell that last sentence). \n\nI knew I couldn't do it alone, I was hooked. \nSo I asked for help for one of the programs in my area to help you stop smoking, all natural homeopathy stuff, I don't generally believe in these (and still don't tbh) , but what can I say, it worked and I stopped smoking around 4 months ago. \n\nSo I guess u need to just hate to the point of you willing to ask for help to quit, or just be able to quit cold turkey.",
   "created_utc": 1690450096,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn48l9",
   "message": "Cancer",
   "created_utc": 1690450113,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4cne",
   "message": "Leaving the Army.  I was an xray tech and civilian hospitals won't hire you if you smoke (they test for it when they do your pre-employment drug test).  About 3 months before I left active duty I quit smoking cold turkey.  \n\n\n\nOnce I got hired, I enjoyed an occasional cigar with my dad before he passed, but otherwise I haven't touched a cigarette in 7 years",
   "created_utc": 1690450205,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4dsh",
   "message": "Never starting in the first place",
   "created_utc": 1690450231,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4dxz",
   "message": "I haven't yet",
   "created_utc": 1690450234,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4eo1",
   "message": "I never started.",
   "created_utc": 1690450251,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4fln",
   "message": "My blood Pressure kept going thru the roof and I realized I felt like shit all of the time. So I used the patch and successfully quit. That was 5 years ago. \nQuitting cigarettes was the absolute hardest thing I ever had to do mentally and even after I quit it still took me two years from my last cigarette to stop having cravings and thinking about them",
   "created_utc": 1690450272,
   "score": 4,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4ins",
   "message": "I lost my IQOS and I wondered if I would buy another one or accept the lost as a sign and quit for good.\n\nThis is my 3rd week of smoke-free 🥳🥳🥳",
   "created_utc": 1690450339,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4j8p",
   "message": "My dad was a smoker, he stopped when he got a stroke. Never looked back.",
   "created_utc": 1690450352,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4l5n",
   "message": "Waking up at 3am driving  to 7-11 because I was having nicotine withdrawals.  It took another week of thinking how stupid and out of hand the situation has gotten.",
   "created_utc": 1690450394,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4lkl",
   "message": "Seeing those who smoke cough at other people.",
   "created_utc": 1690450404,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4lot",
   "message": "Nothing. I have lung cancer and I still smoke. I want to die in extreme pain and agony.",
   "created_utc": 1690450406,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4ltw",
   "message": "Death sticks, stinky breath, bad habit. Joints only #420",
   "created_utc": 1690450409,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4mi9",
   "message": "I was in my early 20's and would have the most intense fits of coughing to the point when I'd try to breathe they'd just intensify it was like I was choking and not able to breathe. I finally stopped after quite a few attempts using nicotine patches, it's been about 13 years since I had one.",
   "created_utc": 1690450424,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4ncb",
   "message": "My fucked up teeth and a severely damaged lung.",
   "created_utc": 1690450441,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4qaa",
   "message": "A visit to a thoracic hospital. So many people wasting away from one of the worst types of cancer out there. I know 5 people who in the past year battled with cancer and won. Breast cancer, stomach cancer, colon cancer, pharyngeal cancer. All of them got chemo and surgery and now they're in remission. But the person I was visiting in that hospital, along with everyone else in there, had no such hopes. The prognosis for all of them was grim. The person I was visiting myself was a heavy smoker her entire life. No history of cancer in the family, her parents are still alive in their 90s, she herself got regularly checked up every year. But through a combination of doctors being way too dismissive of smokers and her not seeking out lung exams herself, since her doctor hadn't referred her to them, she ended up in the hospital after she rapidly deteriorated at home over the course of a week. \n\nThe diagnosis was COPD and lung cancer. Her daughters were devastated, both in their early 20s and there's no other family. Dad is not in the picture, their uncle is in absolute denial about everything, they haven't told their grandparents so that they won't die from shock and there's just no one else. They lost the earth beneath their feet. It's one of the most horrible things I've seen. COPD alone is debilitating but she'll be soon dead from the cancer anyways. She'll have to be on oxygen for the rest of her life and really all that's left to do now is to see whether she can have a few months at peace in her home or if she'll die in the hospital. We met several more people in there, most of whom had a relative with lung cancer in there as well, and most of them had a history of cancer in the family, and just hearing the stories of how these families were decimated by the same disease was horrifying. \n\nI couldn't help but feel like that woman was selfish. Sure she was generally depressed and had a hard time raising her daughters by herself but at the same time she was always selfish and had some serious personality flaws. Even so she was the world to her daughters and now they're both devastated from this, all because she couldn't put that fucking cigarette down and look after herself a bit for their sake. Even now after two weeks in the hospital all she cares about is going out for a smoke. When she was taken to the hospital she was found unconscious in her home with a cigarette in her hand, while she was on oxygen. She could have blown herself up right then and there, all for a smoke. Suddenly the cigarette addiction seemed just as sick as any other. It's a horrible way to die from lung cancer and a horrible thing for your loved ones to experience.",
   "created_utc": 1690450507,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4qkj",
   "message": "I was addicted to vaping, and when I went on a family vacation that lasted a week, I didn't bring one on purpose and used it as an opportunity to get that initial break from the addiction and be able to have my mind off it by focusing on the vacation. It still took time after that, but the addiction wasn't as strong.",
   "created_utc": 1690450513,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4r5y",
   "message": "I stopped drinking.",
   "created_utc": 1690450525,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4sgf",
   "message": "my health",
   "created_utc": 1690450553,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4t8f",
   "message": "My dad getting diagnosed with COPD from agent orange exposure.",
   "created_utc": 1690450570,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4vsn",
   "message": "Not me but a far relative aged 70 or 80, has been smoking for more than 50 years, had a heart attack, doc told him to stop smoking, so he did. He says the hardest thing was the force of habit, he found him self moving his hand to his mouth - as if he was smoking - more than he notices. His wife says he does it in his sleep as well.",
   "created_utc": 1690450624,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4wtf",
   "message": "The thought of having to speak to my niece and nephew through a voice box and them being afraid of me because of it.",
   "created_utc": 1690450646,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4wul",
   "message": "I took up a martial art in university. Turns out you can breathe and move much better without all that junk in your lungs. I quit for about a year, then started again and found myself short of breath during /warm-up/ so I quit again almost immediately.\n\nFell off the wagon again 3 times after that, but I've been clean again for almost 5 years now.",
   "created_utc": 1690450646,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4yvk",
   "message": "Grandmothers cancer…",
   "created_utc": 1690450688,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn4zdy",
   "message": "I got sober, then the smell and taste started grossing me out and I then I threw up. That was 9 months ago and I haven’t wanted one since",
   "created_utc": 1690450699,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn50mz",
   "message": "Laziness.  Smoked pack a day for 10 years or so.  Was watching football game and ran out.  To lazy to walk 100 yards to the store.  So I kept that streak going and now I haven’t had one in more than a decade.",
   "created_utc": 1690450725,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn53og",
   "message": "breathing issues.",
   "created_utc": 1690450791,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn54cy",
   "message": "Snus. Though I was already doing snus at the same time. Cigg fortunately taste so damn bad I never built a fond habit on it.",
   "created_utc": 1690450806,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn551f",
   "message": "The smell and switching to vaping",
   "created_utc": 1690450822,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn55ve",
   "message": "I started smoking 3 packs a day",
   "created_utc": 1690450841,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn55zm",
   "message": "i used to think i enjoyed smoking but came to a realization that it was actually to breathe better when im stressed. which is often cus life can be rocky sometimes. decided to get into being grateful for things around me and being very patient with myself. every few days i smoke one, but now getting to a point where i dont even enjoy that one anymore. hoping to quit completely in the near future. :)",
   "created_utc": 1690450844,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn57b5",
   "message": "It made my Dr Pepper taste terrible. I’d rather that be my vice.",
   "created_utc": 1690450873,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5802",
   "message": "The price in Australia. Cigarettes are over $2 per stick. So a pack of 25s is over $50. When I started smoking in the late 70s $2 would buy you 2 packs. Even the smaller pouch of rollies tobacco is $60. Moved to vaping and love it.",
   "created_utc": 1690450888,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn59rd",
   "message": "Working at a job where you couldn't smoke on premises",
   "created_utc": 1690450927,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5aks",
   "message": "A farmer in my area in 2021, couldnt get his normal chemicals, so found a way to import illegal herbicide from Mexico.\n\nHe sprayed, and for 3 saturdays in a row I went to ER.\n\n3rd saturday I had a ciggie on way in, felt a cramp then a 'pop' in my chest. Threw ciggies out the window. Havent touched since.\n\nThat weekend was the start of many issues that led to me listing my shop and home for sale, and semi-retiring.",
   "created_utc": 1690450945,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5az3",
   "message": "For me it happened sort of naturally. I was trying to quit for a while, after having been smoking quite a lot during University and then when I started my first job, but I could never quite fully quit.\n\nLuckily I was also doing sports(weird, I know) and one evening after a long run I...lit a cigarette and I started feeling really, really bad so I told myself \"wtf am I doing? This cannot go on, I must either quit smoking or running\". So I did. Now I'm 10 years free of smoking and still running.",
   "created_utc": 1690450954,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5f8r",
   "message": "My smoking came from my anxieties in myself and for life. I eventually found different ways of managing my stress that are healthier, more reliable and cheaper too \nBecoming aware of those fears and anxieties helped also, though that was a longer and more painful process",
   "created_utc": 1690451046,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5ibd",
   "message": "My motivation was the surgeries that I need. My method was willpower + Chantix to defeat that last 3-4/day.",
   "created_utc": 1690451113,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5kzk",
   "message": "Covid. Couldn't fucking breathe for two weeks, last thing I was gonna do was smoke a cigarette . Now the smell actively makes me sick and I couldn't imagine smoking again. Yay covid? lol",
   "created_utc": 1690451170,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5l88",
   "message": "I quit after my first breakup, it was a relationship for about 7 years since 9th grade. I thought it's time to change and reinvent myself. I went a whole year without smoking or drinking, trying to be a healthy and good person. Then I was like fuck it. It's been 8 years since then and now I'm happy with smoking everyday. It makes everyday moments worth living for!",
   "created_utc": 1690451175,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5mas",
   "message": "Birth of my child. I wanted to be able to play with her and see her grow into a awesome person.",
   "created_utc": 1690451198,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5mgi",
   "message": "I smoked when I got drunk.  \n\nI stopped getting drunk. \n\nI stopped getting drunk when I had my kids early 40s.",
   "created_utc": 1690451202,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5no1",
   "message": "I vape on and off. \n\nLike i buy a few of them, smoke 1 month and then get off of them a month or two. Just to prove myself that i'm not addicted to such small shit.\n\nCall it mental training, additionally to many other things.",
   "created_utc": 1690451227,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5p5o",
   "message": "I stopped Cold Turkey in 2013 for three reasons. \n\nFirst was that many people told me that they hated how i smelled of cigarettes and it made me hate myself every time i smoked. \n\nSecond was that i was moving to a tropical country and figured because of my job there it would be the perfect opportunity to stop now because i would have to create new habits either way. \n\nLast was that I figured out why i was smoking. I got diagnosed with ADHD and realized that cigarettes were a form of stimulant for me.  So i just replaced them with drinking more coffee.",
   "created_utc": 1690451259,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5r5k",
   "message": "I started vaping because I hated cigarettes and couldn't take a break at my job unless I smoked (17 working closing shift, btw.) After the legal age was announced to jump to 21, I started using vape juice with less and less nicotine until I hit 0%. When my final coil burnt, I didn't feel the need to get more",
   "created_utc": 1690451302,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5rxr",
   "message": "I quit 2 times before but with no success and thrid time I was sick for 2 weeks (I never smoked when I was sick) so I thought I will try it again and it has been 10 years this May.",
   "created_utc": 1690451320,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5s74",
   "message": "I'm not sure if this counts, but I stopped vaping cold turkey a couple of months before my daughter was born.",
   "created_utc": 1690451324,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5syf",
   "message": "Asthma and dedication, just cold turkey one day.",
   "created_utc": 1690451341,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5tpm",
   "message": "I read a book called “Easyway” by an author called Allen Carr (not the comedian), stopped smoking in October after around 15 years and have not touched one since, was even out on a stag do full of smokers on the same month and didn’t even feel tempted. \n\nI still have the occasional vape if I’m out drinking, but last weekend at a friend’s BBQ I barely used it, so might pack that in as well.",
   "created_utc": 1690451358,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5vaf",
   "message": "It was expensive habit. And my aunt died from lung cancer before she was 50.",
   "created_utc": 1690451391,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5vhm",
   "message": "Dental issues, circulation issues, breathing issues, just general health problems. Switched to vapes and slowly lowered the nicotine level. So now I'm just fat lol",
   "created_utc": 1690451395,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5vj0",
   "message": "I was forced to smoke once when I was 5. My mums idea cause I was mimicking my dad, but imagination. 1 maybe 2 puffs \u0026amp; omfg I absolutely hated it, revolting, burns the throat \u0026amp; horrible taste. I never did so after that single day, my sister on the other hand was never given that situation…. She’s a heavy smoker. I have no desire to start, even second hand makes me queasy.",
   "created_utc": 1690451396,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5vmq",
   "message": "A house fire (not caused by cigs). I was in hospital for 48 hours, then it took about a month before I felt like I did prior to the fire. Unfortunately since then, there have been some major stresses in my life, that have caused me to start again.",
   "created_utc": 1690451398,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5w6k",
   "message": "Stability and a life worth having.  Right now my biggest trigger is my child’s father bc I know he’s going to do things to hurt me.",
   "created_utc": 1690451409,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5xdk",
   "message": "I became out of money",
   "created_utc": 1690451435,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5yh9",
   "message": "I never had before",
   "created_utc": 1690451458,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn5yna",
   "message": "Replacing it with vaping CBD",
   "created_utc": 1690451461,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn60md",
   "message": "I got to the point I couldn't afford the food I wanted to eat. It was either stop smoking or shop at walmart.",
   "created_utc": 1690451501,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn622b",
   "message": " Cost. Smell. Taste.",
   "created_utc": 1690451531,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn63oa",
   "message": "Never smoked and never will.",
   "created_utc": 1690451564,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn65px",
   "message": "My son.",
   "created_utc": 1690451607,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn65xs",
   "message": "Vaping )))",
   "created_utc": 1690451611,
   "score": 3,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn6654",
   "message": "Money, my breath coming back was what kept me motivated. I bought a car with the money I'd saved. I tried patches, gum, vape (just made me want to smoke more), what worked was cold turkey and pretending to smoke with tooth picks, I changed none of my habits aside from actually smoking. When I had a craving I went outside and used a toothpick as a fake cigarette and pantomimed it.",
   "created_utc": 1690451615,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn68k5",
   "message": "I tried to give up several times but I kept going back on them.  I had laryngitis regularly and as a singer its not good for the job. I would quit till my voice got better. The last time, I had it for 2 weeks. I did all the right things to make it better. By the time my voice was better I had been off them for two weeks and I didn't notice. Apart from one drunken night I never smoked again. I don't miss them and I hate the smell of them now. Alan Carrs book helped me one [time. It](https://time.It) probably helped me quit completely because a switch just went for me and I just stopped. Before you give up I would recommend giving it a read.",
   "created_utc": 1690451667,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn68oa",
   "message": "I watched my Mum die of lung cancer. I quit before she died, she smoked until the end. She's been gone 3 years and I'm only 48",
   "created_utc": 1690451669,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn69ip",
   "message": "Don't know if I'm a rare case but I simply got bored ot it.",
   "created_utc": 1690451687,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn6dp8",
   "message": "I woke up extremely hungover with 3h of sleep at a friend's place after a party, I asked for a cigarette cause i didn't have any and for some reason it was so disgusting I just stopped smoking after that. For some reason smoking when hungover always had a different feeling and very bad taste. It's been almost 2 years since then and I haven't smoked again",
   "created_utc": 1690451774,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn6e3t",
   "message": "They make me feel like shit. I replaced a cigarette for food every time I got a craving. Worked until the cravings stopped.",
   "created_utc": 1690451782,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn6eid",
   "message": "My daughter and the prospect of not being around for her. Been years since I've smoked cigs or cigars and I miss it everyday but I love life more.",
   "created_utc": 1690451791,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn6eti",
   "message": "I smoked for 10 years and suddenly one day they just stopped tasting good. That's it, that's the only reason.",
   "created_utc": 1690451797,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn6g63",
   "message": "Vaping",
   "created_utc": 1690451827,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn6gc7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnciay",
   "message": "Magic mushrooms made me experience my own future death: my entire body clogged up with stale grey ash until I suffocated. After that even the thought of smoking reminded me of the ash and I've never smoked since.",
   "created_utc": 1690456024,
   "score": 27,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnchsx",
   "message": "I was sitting on my couch smoking, and my 2 dogs were sleeping on the loveseat directly across the room from me. I looked over at them, and I could see the smoke in the air just”hanging” above them, and I thought, “I’m not just killing me, I’m killing them, too.” I put that cigarette out right then and there, and never lit up again. (And I had smoked for about 25 years.)",
   "created_utc": 1690456015,
   "score": 12,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtneowo",
   "message": "Had a pulmonary embolism where both lungs filled with dozens of clots.",
   "created_utc": 1690457339,
   "score": 5,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnch9b",
   "message": "I made a conscious decision to stop being a slave to anything that would compel me to waste money time and health for no real meaningful return.",
   "created_utc": 1690456005,
   "score": 5,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn6szi",
   "message": "Had a kid",
   "created_utc": 1690452094,
   "score": 3,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn8v5v",
   "message": "hate me or not, for me it was LSD\n\nlighted one during a trip, looked at it and i was so disgusted at what i was looking... \n\njust looking at the burning cigarette gave me feeling of gulping a whole ashtray\n\nthis association faded by now but luckily i could use it to not touching a cigarette again",
   "created_utc": 1690453600,
   "score": 3,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtneu8x",
   "message": "I have quit 2 times. First time when I got a really bad flu, cigarettes tasted awful so I quit for 2 weeks and figured why go back to smoking since I can easily do without apparently. After a year or so I did start smoking again, and stopped because of pregnancy. Now I have a kid I’ll never allow myself to pick up smoking again, have no desire for it either!",
   "created_utc": 1690457426,
   "score": 3,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnev5o",
   "message": "Fear of Covid.",
   "created_utc": 1690457441,
   "score": 3,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtneyci",
   "message": "I quit drinking. Then I never really wanted one again.",
   "created_utc": 1690457493,
   "score": 3,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtngbuz",
   "message": "I had a pen cap that I would pretend to smoke with. I looked like a fool for 4 months but it worked. \n\nCold turkey, when I get a craving I find a pen cap and pretend to smoke lol",
   "created_utc": 1690458278,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtncigc",
   "message": "I was tired of feeling like crap and feeling like I was addicted to something. It was also getting very expensive. \n\nQuit cold turkey, didn't tell anyone I was trying to quit as I didn't want the attention if I failed. Which I did a few times. It took about 5 attempts over the course of a year. Each attempt making it longer and longer. Eventually to the point where I could get past the physical withdrawal symptoms. Been cig free for over a decade now.",
   "created_utc": 1690456026,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtneop7",
   "message": "I smoked for ten years and stopped twelve years ago. I used the patch and took twice as long as recommended on each step. Best decision of my life.\n\nI stopped because I was sick of being a second class citizen, and I was out of shape. I was only skinny because of my metabolism, but my 37 year old self can out run, out lift, out fight and out think my 25 year old self.",
   "created_utc": 1690457336,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnesvr",
   "message": "Well i quit fentanyl and a year later thought \"why do I smoke cigarettes?\" And didn't have an answer besides \"bc I'm addicted to them* ..... So I went out and bought some nicotine gum and after 10 years of smoking, I quit.",
   "created_utc": 1690457405,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtneug1",
   "message": "The ridiculous cost was a motivator, but there's always a 'tab man' selling them cheaper. The taste and smell just started to ick me out. I quit just as COVID kicked off, then after abt 18mo started vaping. Just quit vaping a month ago after deciding I'm sick of nicotine having a hold over me. This mindset kicked in after kicking painkillers. Now I'm freeeeee 💪.",
   "created_utc": 1690457429,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnew7t",
   "message": "I finished a pack one day and decided I didn’t want to buy another one.",
   "created_utc": 1690457458,
   "score": 2,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnjpje",
   "message": "In October 2021 my work mate bet me $500 I couldn’t quit for 3 months, I collected in January 2022. I still don’t smoke. Personally, I think it’s about finding your motivation for giving up. Mine was money.",
   "created_utc": 1690460106,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnjs78",
   "message": "When I felt like I couldn't go anywhere enclosed without feeling trapped and panicked.  Movies, concerts etc.  I was always looking for the smoking area.  Switched to the Juul because it was easy to hide.  I only vape once in awhile now, but haven't lit a cig in 4 years.  Feels good.",
   "created_utc": 1690460146,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnjtnj",
   "message": "Started a new job and felt embarrassed. Didn’t want to smoke at my workplace and just kept it up. Probably helped that I was on adderall at the time.",
   "created_utc": 1690460167,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnjugw",
   "message": "I love my Son. And we get along great but I realized what an impact smell has on nostalgia. I realized that whenever I smelled a cigarette (that I wasnt smoking) I thought of my Dad. So I associated that smell with home, love, family, youth, etc. My first wife smoked and that was probably a part of the attraction. I realized this and thought \"what if my Son does the same thing? And as he and his kids sit on the side of his dying wifes bed (due to cancer or other smoking related disease) what pain will they all feel due (in part) to the association I fostered?\". So with that I put down my two pack a day 20+ year habit. It wasnt easy but with that as a background \"Why\" it was definitely easier.  It is rather egocentric of me (upon reflection) to think that I would have that much influence, and probably would never have that impact but it definitely helped me quit and that turned out better all around. \n\nIn conjunction with this was reaching over and opening the pack to see only 4 smokes and thinking \"Better smoke those fast and pick up another pack so you have some to get you through the rest of the day.\" The continuous chain of that struck me hard. It was then that I stopped calling it \"Having a smoke\" and started calling it \"Taking a hit of my drug\". That mindset of being addicted to a drug and needing a regular hit just to get through the next hour or two really put it into perspective. Regardless how legal - I was an addict. I don't know how but I threw the pack out the window (with the 4 cigs in it - Sorry about that one Environment) and never went back. That was Oct 2007 and havnt had one since.",
   "created_utc": 1690460179,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnjuq9",
   "message": "If you're like me, you make a pact with your husband to quit together.  Go cold turkey.  Almost lose your brand new marriage after three days bc of being bitchy (him and me), but don't give up bc you don't want the other one to win bc you're both stubborn as hell.  After a month you notice you smell grass being cut and food tastes amazing.  You still want one but don't go back because you never want to go through those withdrawal symptoms again.  It's been 15 years. (Also we are still happily married, we do things together even if they're hard. We're in it together)\n\nTldr: Stopped cold turkey.  Hard as hell but worth it.  Been smoke free for 15 years.",
   "created_utc": 1690460183,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnjvk2",
   "message": "Smoked for 3 years and then pandemic hit.\n\nThen I thought about what I was doing so I threw my ciggs and didn't smoke for 1 year and then relapsed to it and then clean till now\n \nHope to stay this way",
   "created_utc": 1690460195,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnjwon",
   "message": "I quit because smoking is getting heart disease and cancer on an installment plan. You pay a little bit every [day.  It](https://day.It)'s stupid.  I quit cold turkey. Thought I could have one now and then. Nope. Hooked again. Quit again. Smoked one a couple of months later. Hooked again.  Quit again. For me, it was a serious addiction. I had to quit for 30 min,.then 30 min. more. Clean for 43 years now.",
   "created_utc": 1690460212,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnjygk",
   "message": "Found out I was pregnant. Quit cold turkey that day after 10 years of smoking.",
   "created_utc": 1690460239,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnk01e",
   "message": "Went to repaint my front porch and after getting the first coat on one wall the contrast between the fresh primer and yellow ceiling made me realize my insides probably didn't look much better",
   "created_utc": 1690460263,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnk0q4",
   "message": "Realised I couldn’t go an hour without. Failed quitting a few times but then just went cold turkey, been over 3 years now 💪\n\nNow I run ultramarathons. The only issue that lasted is I don’t think my teeth will ever go back to as white as they were.",
   "created_utc": 1690460273,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnlkt0",
   "message": "I worked on a med/surg unit as a nurse, and I smoked around 1.5 packs a day.  It was a slow process of seeing multiple end of life COPD patients dyeing what I thought was a miserable death.  I was already starting to see some of the symptoms of COPD, and I knew it was time.",
   "created_utc": 1690461075,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnlkuk",
   "message": "Sex.   \n\nI was fresh out of a 20 years long  relationship and was hitting a huge wall trying to find someone. 9 people out of 10 didn't want to date smokers.  \n\nQuit smoking like THAT.",
   "created_utc": 1690461076,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnll4k",
   "message": "Meeting my future wife who was repulsed by smoking. Stopped cold turkey and haven’t looked back. Married 7 years now",
   "created_utc": 1690461080,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtnlms3",
   "message": "I wanted to be a non-smoker worse than I wanted a ciggy.  Smoked for 12 years, been free of that shit for 24.  It was rough for the first couple of weeks but worth it.  If you want it bad enough, set your mind on it and you can dobit too!",
   "created_utc": 1690461103,
   "score": 1,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn7bcl",
   "message": "Wanting to live",
   "created_utc": 1690452475,
   "score": 0,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn7bw1",
   "message": "Having a Brain",
   "created_utc": 1690452486,
   "score": 255,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn6z12",
   "message": "I never started",
   "created_utc": 1690452221,
   "score": 252,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtn718t",
   "message": "I never did... And don't intend on it.",
   "created_utc": 1690452268,
   "score": 253,
   "submission_id": "15ava6n"
  },
  {
   "comment_id": "jtmwavw",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ava6n"
  }
 ]
}