{
 "submission_id": "1585wz8",
 "title": "What was the best relationship advice you ever got?",
 "selftext": "",
 "created_utc": 1690191939,
 "permalink": "/r/AskReddit/comments/1585wz8/what_was_the_best_relationship_advice_you_ever_got/",
 "score": 72,
 "url": "https://www.reddit.com/r/AskReddit/comments/1585wz8/what_was_the_best_relationship_advice_you_ever_got/",
 "comments": [
  {
   "comment_id": "jt8mo6j",
   "message": "Keep in mind that you are not fighting against your SO during conflicts.\n\nYou and your SO are up against the issue.",
   "created_utc": 1690200353,
   "score": 235,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8bba5",
   "message": "Never take each other for granted; show appreciation often.",
   "created_utc": 1690192634,
   "score": 213,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8b595",
   "message": "Prioritize trust and build a strong foundation of it",
   "created_utc": 1690192502,
   "score": 138,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8lmne",
   "message": "I love the quote \"I don't want you to save me, but you can hold my hand while I save myself\"\n\nSupport with respect is key.",
   "created_utc": 1690199745,
   "score": 177,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8jx45",
   "message": "Discuss life goals (especially kids) and financial habits before you get married. If one person wants 6 kids and the other wants to be childless that’s not going to work. If one person has champagne tastes and spending habits but you as a couple have a boxed wine budget, then that is a problem. More than one marriage has been ended because one spouse is bad with money and refuses to live within their means.",
   "created_utc": 1690198720,
   "score": 102,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8emel",
   "message": "There is no reason to keep score. You are both on the same team. If one (or both) of you starts keeping score with things it is time to evaluate the state of the relationship and why this is occurring. \n\nOn a related note, all problems can be solved, but not all problems are worth solving.",
   "created_utc": 1690195164,
   "score": 108,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8hsmg",
   "message": "While in a relationship don’t lose yourself as an individual.",
   "created_utc": 1690197370,
   "score": 64,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8l4ow",
   "message": "If the grass is greener on the other side, try watering yours.",
   "created_utc": 1690199452,
   "score": 163,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8b1su",
   "message": "Remember to laugh together and keep the romance alive.",
   "created_utc": 1690192428,
   "score": 157,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8b9t9",
   "message": "Be each other's biggest supporter and cheerleader.",
   "created_utc": 1690192602,
   "score": 64,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8b3bo",
   "message": "Practice active listening to understand each other better",
   "created_utc": 1690192460,
   "score": 198,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8hisz",
   "message": "Make time. You'll always have a million and one things that need your attention, but if you're going to be with someone, start a family with them, make time for them. \n\n-My dad, who is still very much in love with my mum, who isn't really feeling it anymore because she's spent the last 35 years married to a workaholic farmer.",
   "created_utc": 1690197184,
   "score": 38,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8hflq",
   "message": "Your partner can't read your mind. Talk to them why you are upset or what is bothering you. Don't hold your negative thoughts inside, it will only make the situation more bitter.",
   "created_utc": 1690197124,
   "score": 70,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8hi7e",
   "message": "A partner is the cherry on top of a cake.\nThe cake is your responsibility.\n\nTranslation:\nA good partner can make you happier in life but can never make you happy.\nIt is your own responsibility too have a happy and fulfilling life.\n\nThe inverse is a little different.\nA bad partner can ruin your happiness.\nBut it is your own responsibility to ( not let a bad cherry ruin your cake) not let a bad partner ruin your happiness.",
   "created_utc": 1690197173,
   "score": 152,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8n67t",
   "message": "Having kids will not solve the problem",
   "created_utc": 1690200634,
   "score": 146,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8vk9k",
   "message": "That \"relationships are SO HARD\" or \"marriage takes so much work\" is terrible advice.\n\nRelationships take effort and maintenance and mindfulness, but it shouldn't be work. It's a garden, not a salt mine. If literally everything is an uphill struggle all the time, you're not compatible. Move on. \n\nAll \"relationships are SO HARD, Y'ALL!\" teaches people is to stay in relationships that are bad for them. Get therapy and find healthy partners. And DEFINITELY don't have kids if your relationship is already \"OMG SO HARD.\"",
   "created_utc": 1690204944,
   "score": 32,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8bzn1",
   "message": "Don't look for a relationship just for the sake of being in a relationship.",
   "created_utc": 1690193172,
   "score": 83,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8chwb",
   "message": "Communication is the key",
   "created_utc": 1690193566,
   "score": 143,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8irfh",
   "message": "Relationships in fiction are fictional.",
   "created_utc": 1690197995,
   "score": 251,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8rmgn",
   "message": "Not relationship advice per se, but something that helped immensely in all future relationships:\n\nI used to be a \"typical\" nerd including some of the negative stereotypes associated with that. I was never introverted and got along well with most people, very well with those in my immediate vicinity.\nOne weekend I was at a LARP event with some friends and met a girl who I liked and hit off with. It didn't work out and she started seeing someone else that evening.\n\nI must have made a face or something, because she noticed. And gave me this feedback:\nI was in my own world most of the time, not caring that much about my appearance or the vibes I gave off. Spent most of my time slouched over.\nShe said even though she liked talking to me, my whole demeanor gave off vibes of being somewhat unhappy. In the end, if there are 2 equally nice and interesting people, why would you choose to spend your time with someone who doesn't even appear to enjoy spending time with himself?\n\nIt wasn't the most friendly advice but it stuck - primarily about me being slouched over all the time, which I consciously tried to correct the following years (it worked). I was never unhappy with myself, but I never put in much effort towards other people either, which I changed and I think it worked out for the better.\n\nIn the end a lot of relationship, whether intimate or other, is about effort. If you put an effort into maintaining it you give significance to it, from the other person's point of view.\n\nSorry, english isn't my first language.",
   "created_utc": 1690203018,
   "score": 246,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8l5lk",
   "message": "It takes a hell of a partner to beat no partner at all.  Vet carefully and with a clear head:  Does this person **add** to your life? Is being with them an improvement over your regular, solo life? Or are they an effort to be around, to accomodate?",
   "created_utc": 1690199467,
   "score": 152,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8zkd7",
   "message": "if you have to constantly push your partner for anything (moving in, going out, doing trips, improving anything, getting engaged,..) its not a partner its a WHEELBARROW!  \nDo you want to live with a wheelbarrow?  \n\n\nthat made me laugh, but opened my eyes on lots of things",
   "created_utc": 1690206780,
   "score": 109,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8empg",
   "message": "Don't post your relationship life on social media",
   "created_utc": 1690195171,
   "score": 118,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8fn23",
   "message": "If you take a Coke Zero out of the fridge, put another one back in.",
   "created_utc": 1690195897,
   "score": 212,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8gboe",
   "message": "I had a coworker who had a very happy marriage. I asked her how she chose her husband. She answered, “He was the nicest man I ever met.”. That was an epiphany for me.\n\nI went on to marry the nicest man I ever met. We’ve been married over thirty years. I won the husband lottery.",
   "created_utc": 1690196371,
   "score": 23,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8gxhx",
   "message": "To never fall in love with someone / stay with someone because of their potential of becoming better. The potential is not guaranteed. This is in the context of my abusive relationship, I’m not referring to regular conflicts that can be resolved",
   "created_utc": 1690196787,
   "score": 173,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8i3pk",
   "message": "Idk if it's considered relationship advice but.. When I was around 14 and had my first serious relationship, I went to go see my girl in the evening. \n\nBefore I went out the door, my dad stopped me and said: 'Son, there's one thing that you should know and after I tell you I'll shut up about it.. If a girl says \"no\" that means \"no\".\n\nI felt really awkward atm cause it seemed obvious and I felt like my dad saw me as an idiot.\n\n10 years later I still think about that moment and what my dad said and I feel so proud of him for pointing out something that is really important.\n\nI feel like simple advice like that is not given often enough.",
   "created_utc": 1690197576,
   "score": 94,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8cju2",
   "message": "If you can't laugh at each other's embarrassing moments, are you even really a couple?",
   "created_utc": 1690193608,
   "score": 226,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8indd",
   "message": "Be each other’s friend above everything.",
   "created_utc": 1690197924,
   "score": 71,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8jt5s",
   "message": "Never start imagining a life together before you even started. Get to know the person first. Build it up from there.",
   "created_utc": 1690198654,
   "score": 64,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8nmsb",
   "message": "Even head over heals in-love people get on each other's nerves once in a while. It's not necessarily a sign of trouble, or that you're growing apart, or you or she isn't good or the right one. You're together almost ALL the time. It's a sign that you're human.",
   "created_utc": 1690200897,
   "score": 64,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8mn37",
   "message": "Don’t accept anything you wouldn’t accept being done to a loved one",
   "created_utc": 1690200335,
   "score": 127,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8ela3",
   "message": "Try to fix your issues or break up openly. Don't make the same mistakes as me. My first breakup was extremely slow, painful, and cold. It caused my ex to mentally degrade and end up attempting suicide, and haunting my life forever. Communication matters no matter how tired or selfish you are.",
   "created_utc": 1690195142,
   "score": 232,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8q2vu",
   "message": "[deleted]",
   "created_utc": 1690202223,
   "score": 123,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8g9sb",
   "message": "Two pieces.   1. If you aren't going to remember being upset over this, it's not worth arguing over now  and 2. There are peaks and valleys in relationships. Don't give up until it's only valleys.",
   "created_utc": 1690196334,
   "score": 214,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8cjdo",
   "message": "Don't chase who's running !",
   "created_utc": 1690193599,
   "score": 160,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8q12x",
   "message": "I hated it, but I was talking to my psychotherapist about trying to get myself straightened out to be in a relationship...\n\nShe smiled and said \"the only way to learn to be in a relationship, is to be in a relationship.\"",
   "created_utc": 1690202197,
   "score": 58,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8xcw3",
   "message": "This wasn’t something someone personally told me but, most recently I saw this quote on Reddit and it really stuck with me.\n\n“ you don’t know the person you’re with until something lifechanging happens”",
   "created_utc": 1690205785,
   "score": 59,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8jxrf",
   "message": "Choose each other every day.",
   "created_utc": 1690198731,
   "score": 51,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8lcpg",
   "message": "Have a goldfish's memory when it comes to arguments. The elephant's memory is the good stuff.\n\nMoreover, never \"keep score.\" A team, you are.",
   "created_utc": 1690199583,
   "score": 52,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8qxzt",
   "message": "“When you marry someone, you marry their whole family.”  I have always taken this to mean that you should learn about the family before you commit to the relationship.",
   "created_utc": 1690202668,
   "score": 97,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8ma4z",
   "message": "Above all, just be you.\n\nDon't waste your time trying to be someone that you believe other people want you to be.",
   "created_utc": 1690200125,
   "score": 166,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8b6tt",
   "message": "Don't sweat the small stuff; choose your battles wisely.",
   "created_utc": 1690192536,
   "score": 184,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8cdqh",
   "message": "Find ya best friend and marry them",
   "created_utc": 1690193476,
   "score": 143,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8n52y",
   "message": "Eat ALWAYS PRIOR TO making key decisions or having significant interactions.",
   "created_utc": 1690200616,
   "score": 39,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8p7zx",
   "message": "What you put up with, you end up with.",
   "created_utc": 1690201762,
   "score": 40,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8b84a",
   "message": "Embrace each other's differences and celebrate individuality",
   "created_utc": 1690192563,
   "score": 69,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8loxi",
   "message": "No one is going to love you the way you love them, always keep that in mind.",
   "created_utc": 1690199782,
   "score": 67,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8byos",
   "message": "Relationships are like WiFi. Sometimes they go down, but a simple reboot (a hug) can fix it!",
   "created_utc": 1690193151,
   "score": 223,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8l6g5",
   "message": "Be content by yourself. If you want happiness, don't rely solely on your relationship. There will always be a period when you need to enjoy yourself by yourself.",
   "created_utc": 1690199481,
   "score": 36,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8pk1o",
   "message": "Find someone who lets you be vulnerable without judgement.",
   "created_utc": 1690201945,
   "score": 31,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8qshs",
   "message": "If someone makes you feel like they do not care about you\n\nBelieve them",
   "created_utc": 1690202591,
   "score": 32,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8yd7l",
   "message": "I had this professor at university, he was an ex-marine turned therapist. Big cuddly, but very stern man. The class was interpersonal relations. \n\nHe told us once, that relying on a long lasting love and relationship to be this explosive, magical experience will always lead to disappointment. He said, actually being in love is finding someone who annoys you in ways that you can put up with. And I have found it to be totally true.",
   "created_utc": 1690206242,
   "score": 33,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8ebwz",
   "message": "Just be you, there will be a person who is looking for someone exactly like you. But you two haven't met yet.",
   "created_utc": 1690194954,
   "score": 55,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8nkte",
   "message": "From my wife's grandad on our wedding day. (Along with Grandma, The most incredible, kind, humble, beautiful people you could wish to know)\n\nDon't marry the person you can see yourself living with.\nMarry the person you can't see yourself living without.",
   "created_utc": 1690200865,
   "score": 57,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8ndnc",
   "message": "if you are trying to catch them. They don't like you. One single Reddit comment set off the process via which I began to let go of a long-term crush.",
   "created_utc": 1690200751,
   "score": 73,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8qitj",
   "message": "Instead of repeating what's already been said;\n\nMe ex left me and for a few weeks afterwards, my friends, mom, sister, etc kept telling me: Why did she leave you? She's gonna realize she made a mistake and come back!!  \n\n\nMy dad though, brought me aside and straight up told me: She's not coming back. Let her go.\n\nSo I did. I tried moving on with that mindset.\n\n\u0026amp;#x200B;\n\nLow and behold, she never did come back, fast forward a few weeks and I met my now loving wife! (This was 10 years ago)\n\nThanks dad!",
   "created_utc": 1690202451,
   "score": 51,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8s3je",
   "message": "When you have the upper hand, don’t use it.",
   "created_utc": 1690203251,
   "score": 49,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8njyh",
   "message": "When your partner wants to have a serious talk, ask them if they want you to give advice or just listen! There’s a huge difference :)",
   "created_utc": 1690200851,
   "score": 66,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8l0fu",
   "message": "Pick up after yourself.",
   "created_utc": 1690199381,
   "score": 21,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8opyq",
   "message": "The single most important decision you make in life will be the person you choose to enter into a long-term relationship with. It will MAKE or BREAK you if you choose the wrong person, ignore flags and base it on superficial merits.\nChoose wisely",
   "created_utc": 1690201490,
   "score": 24,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt964w9",
   "message": "Contempt is one of the largest causes of divorce.\n\nGoing on 14 years married and knowing that one thing has helped so much.",
   "created_utc": 1690209595,
   "score": 24,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt9ip6b",
   "message": "That it only has to 'not work' for one person for the relationship to 'not work'.\n\nI used to stay in relationships where I was unhappy because the girlfriend was happy - and I didnt want to make her sad by breaking things off. So I'd stay in it - unhappy - until, eventually, we were both unhappy enough that we'd end it. I could have saved us both a lot of time and heartache by moving on sooner.",
   "created_utc": 1690214652,
   "score": 19,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt9o0ot",
   "message": "You shouldn't want someone that doesn't want you.",
   "created_utc": 1690216708,
   "score": 19,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8hn0k",
   "message": "Would you date yourself? If not, why would you expect somebody else to want to be with you.",
   "created_utc": 1690197263,
   "score": 44,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt966jg",
   "message": "To find the type of woman you want, don’t put your focus on finding her….rather focus on becoming the type of man that woman would want to be with and she will find you.\n\nSource: my mom.\n\nIt worked.",
   "created_utc": 1690209613,
   "score": 42,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8n6zv",
   "message": "From my lovely grandma:\n\n'Stay single for a long as possible'",
   "created_utc": 1690200646,
   "score": 111,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8lyco",
   "message": "When you're upset, talk to them. You cannot be read by them. If you keep all of your bad thoughts inside, they will just make you bitter until they cease working.",
   "created_utc": 1690199936,
   "score": 18,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8mrhj",
   "message": "Kind of just people advice in general but \"people will treat you how you let them treat you\"",
   "created_utc": 1690200404,
   "score": 16,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8x9re",
   "message": "A person should want you, not need you. Codependence places a massive burden on the partner. Obviously this applies to yourself as well: be a whole person, not a dependent one, before you get in a serious relationship.",
   "created_utc": 1690205744,
   "score": 17,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8l396",
   "message": "Never leave something when everything is all bad between you, leave when it’s seems Ok, but feels wrong",
   "created_utc": 1690199428,
   "score": 37,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8qscc",
   "message": "You aren’t just marrying them, you’re also marrying their family, their trauma, and their baggage.",
   "created_utc": 1690202588,
   "score": 36,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8k3aa",
   "message": "It's not about sex, it's about building a very specific and intimate bond with someone you're attracted to. Being the one person they can go to for their deepest, darkest secrets and trusting you to never reveal that to anyone else.\n\nRelationships aren't a game and the person you're in the relationship isn't a toy. You start out testing the waters, determine if there's something to work with, and go from there and build a foundation for a long lasting relationship that leads to a family\n\nTo be honest, I'm sick and tired of relationships where people \"test\" their partners. Especially testing their trust. This generation of relationships has this misconception that their partner is a play thing to beat around with when, in actuality, you're only building into their distrust of everything. Which just makes new relationships harder to build and, in some extreme cases, end entire bloodlines because someone really insisted on fucking with their emotions.",
   "created_utc": 1690198823,
   "score": 47,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8orek",
   "message": "Recognize and validate what you do for each other; even the small things. Saying \"I appreciate you doing X\", even for a small thing that doesn't seem like much, shows that you're paying attention to each other.",
   "created_utc": 1690201511,
   "score": 17,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8orxm",
   "message": "Don't forget to say 'thank you' when they make your coffee!",
   "created_utc": 1690201519,
   "score": 16,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8wpza",
   "message": "Perceptions are not always reality. More often than not, if you partner does something that bothers you, it wasn’t malicious or aimed at you. Rather, they didn’t see anything wrong with it. Explaining your feelings and getting their take can help establish healthy and open communication",
   "created_utc": 1690205492,
   "score": 15,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8nmss",
   "message": "Appreciate each passing moment. Always remember nothing lasts forever.",
   "created_utc": 1690200897,
   "score": 14,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8dlrb",
   "message": "Be confident enough in yourself to set boundaries.  You should want them, but not need them.",
   "created_utc": 1690194412,
   "score": 34,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8lh81",
   "message": "If the bad outweighs the good, get out.",
   "created_utc": 1690199656,
   "score": 28,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8u7om",
   "message": "Sex is like ketchup, ketchup makes every meal better but you can’t make a meal out of ketchup.",
   "created_utc": 1690204299,
   "score": 31,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8lbw8",
   "message": "Don’t date anyone with a vastly different intelligence level to yourself. It’ll never work out.",
   "created_utc": 1690199569,
   "score": 75,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8rcga",
   "message": "Don’t lite yourself on fire to keep others warm. \n\nGrass is greener where you water it.  \n\nNever say “Shut up” or “Fuck you”",
   "created_utc": 1690202875,
   "score": 12,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8xs22",
   "message": "It's never you versus them it's both of you versus the problem",
   "created_utc": 1690205979,
   "score": 12,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt9iruo",
   "message": "Do you just want to vent, or do you need help solving the problem? \n\nIn my experience this is often the biggest block in couple communication,  so asking this before a discussion can help you get into the right 'listening ' or 'helping mind set",
   "created_utc": 1690214682,
   "score": 14,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8mf9l",
   "message": "Well, my mother was a staunch christian, and did not like the fact that I was gay, of course. But she once told me, \"Never let a man know how much you love him or he will shit all over you.\" She said dad knew that she loved him, but never knew exactly how much. Which is kind of sad when you think about it.",
   "created_utc": 1690200209,
   "score": 49,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8p2q2",
   "message": "Communication is in the receiving of information. Otherwise it’s just broadcasting.\n\nTalk but listen and listen actively. Validate.",
   "created_utc": 1690201681,
   "score": 12,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8ppvo",
   "message": "If they want to walk out of your life let them. But if they cherish you and show genuine kindness hold on for dear life and show them the same",
   "created_utc": 1690202032,
   "score": 11,
   "submission_id": "1585wz8"
  },
  {
   "comment_id": "jt8ts1o",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1585wz8"
  }
 ]
}