{
 "submission_id": "1588rwt",
 "title": "What is considered to be the most courageous decision in your life and what did it bring you in the end?",
 "selftext": "",
 "created_utc": 1690200317,
 "permalink": "/r/AskReddit/comments/1588rwt/what_is_considered_to_be_the_most_courageous/",
 "score": 180,
 "url": "https://www.reddit.com/r/AskReddit/comments/1588rwt/what_is_considered_to_be_the_most_courageous/",
 "comments": [
  {
   "comment_id": "jt8ywba",
   "message": "I donated a kidney to a relative.  So far it's given me 8 more years with them.",
   "created_utc": 1690206482,
   "score": 70,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8sl1t",
   "message": "I left a high paying job with benefits to start my own chocolate confection delivery company.  The result.... this morning I applied for a dishwashing position at a bakery.\n\n\u0026amp;#x200B;\n\n\\*\\*Sorry to edit after the post, but I have to say thank you to everyone for their encouragement.  You all have definitely made my day/week/month. I will continue chasing the dream.",
   "created_utc": 1690203495,
   "score": 28,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8pftr",
   "message": "Leaving my stable job to pursue my passion brought uncertainty, but in the end, it led to a fulfilling career and genuine happiness.",
   "created_utc": 1690201879,
   "score": 198,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8ouyx",
   "message": "quit drinking\n\nI'm 100% better of in all areas of my life.\n\n\n6 years sober",
   "created_utc": 1690201565,
   "score": 45,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8r5ve",
   "message": "Reported my rapist to the police.\n\nUnfortunately he was a foreign student and was never caught. But I'd never have lived with myself if he attacked someone else and I could have prevented it",
   "created_utc": 1690202782,
   "score": 164,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8vd8k",
   "message": "I decided right after high school to walk across the United States. In the end I walked over 4,500 miles own nearly a year. It reshaped my life completely. It helped me build a lot of confidence, patience, and appreciation for the world and it's inhabitants. A few years before that it was looking like I wouldn't even graduate high school and even after I did graduate I didn't have any other plans. Taking that extra time between high school and university allowed me to succeed at the latter. Because of my journey, I can now think back to it whenever I have problems in my current life.I don't think anyone actually thought I'd make it more than a week or two, which is honestly fair. An asthmatic 19 year old who has never played sports or accomplished anything isn't exactly the horse you'd bet on. \n\nWhat hardship can compare to walking across the US? All in all, one of the greatest decisions of my life.",
   "created_utc": 1690204852,
   "score": 139,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8xs0c",
   "message": "I left my abusive controlling marriage of nearly 40 years. It’s brought me peace and contentment.",
   "created_utc": 1690205979,
   "score": 106,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8sch2",
   "message": "Quit my job, sold all the stuff in my apartment and left my country to work abroad for a year(that was the plan). Six and a half years and five different countries later I can tell you that it was the best decision I've made. Met tons of great people.",
   "created_utc": 1690203375,
   "score": 127,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8qvts",
   "message": "Moved hundreds of miles away from home with a girl I'd been dating less than a year without many/any job prospects. Got a job in a month, got into grad school two years later, and 25 years later I'm still with her. Had to make the no/no-go call after about 7 months together too, I absolutely can't fathom my life without taking that leap though.",
   "created_utc": 1690202637,
   "score": 25,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8qd58",
   "message": "The day after my suicide attempt, I immediately left the Uni campus, headed home, and confessed my crime to my psychiatrist and then my family. That gave me a new diagnosis and treatment.\n\nHad I decided to do business as usual, I would have definitely attempted again, and by then I had figured out why it didn't work the first time.\n\nI'm sad, tired, and pissed, but I'm still here.",
   "created_utc": 1690202369,
   "score": 240,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8p34g",
   "message": "Honestly, I don't have any major \"Norma Rae\" style shows of heroism.\n\nI have a series of small incidents that didn't seem like a big deal to me but seemed to stand out for other people. \n\nI **LOATHE** seeing people pushed around and I'll always try to intervene if I see an injustice. \n\nOne very typical example: I was in class and we were spitballing ideas.  A very shy and soft spoken girl, named Rita, started to make a suggestion...when Emily (a very outspoken, and frankly abrasive, girl) interrupted and started loudly talking over her. It was totally unrelated to what Rita had said, she just acted like Rita didn't exist. Rita immediately stopped talking and looked embarrassed. Everyone noticed this, including the professor. No one said anything. So I loudly said \"hey, Emily, Rita was talking. You interrupted her.\"\n\nEmily played dumb, said sorry and allowed Rita to continue.\n\nAfter class three people came up to me separately to say \"I LOVE that you called Emily out. She's such a bully and no one ever says anything!\"\n\nI've had literally dozens of incidents similar to this (not always about interrupting someone, sometimes I'll offer a comeback when someone is being teased and isn't fighting back).\n\nWhat I find curious is why the people who then \"congratulate\"/thank me, for standing up for the little guy, won't do it themselves.",
   "created_utc": 1690201687,
   "score": 232,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8r16w",
   "message": "I was struggling with extreme fatigue since I was 15, just barely able to walk to the corner of the street, even sitting down for half an hour was tough. My attempts at getting better always failed, so I kinda resigned myself to my situation of hardly ever leaving the house. I kept myself occupied with movies and videogames and feeling generally awful. I did try to write some stories/a novel (I'd always dreamt of being an author) but my poor endurance and focus issues always held me back. At 23, I decided to give it my all one last time, thinking if my exercising program failed, I could always return to my quiet and anonymous couch life. I ended up making very slow progress, but progress nonetheless. I put myself out there, found the girl of my dreams and published my debut novel 1.5 years ago at one of the major publishing houses. I'm now working on a second. I'm still tired though and can't do all that much compared to healthy people. But at least I can do a lot more than I used to, I'm making some things happen and they give me happiness, pride and more confidence. Just that one period in my life where I decided to give it my all again, day after day, not feeling any improvement for months on end but still pushing through to invisible progress, I'm really proud of that.",
   "created_utc": 1690202715,
   "score": 184,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8uv4i",
   "message": "I had a stroke a bit over 11 years ago. I initially died, and the prognosis after resuscitation was not good. I worked hard at rehab, I worked hard getting back to work, and more recently I have worked hard to get into and complete a degree.\n\nI am told I could have been given permanent disability status and no one would blame me. I am told my decision not to take that path is brave. I dunno.",
   "created_utc": 1690204613,
   "score": 78,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8sk38",
   "message": "I moved to Germany and started a new life. Then she cheated on me and I moved back to America. The bravery and life lessons are still there and I bet she still doesn't have a job.",
   "created_utc": 1690203481,
   "score": 140,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt98pt2",
   "message": "    I've been told by other people that sticking by my wife when she had cancer was a \"courageous\" decision.  I didn't see it that way.  She had cancer when we met, and we fell for each other with 1 conversation (it was an 8 hour phone call, but it still counts as 1 conversation).  She tried to stop talking to me several times in the first few weeks because she didn't want to leave me heartbroken when she died.  Her attempts were just \"I don't think this will work, I have cancer, I don't want to hurt you\" and I would reply \"No, thank you\", and continue what we had just been discussing.  She would just laugh and away we went.  \n    The following 860 days were the happiest I have ever been.  We had a courthouse marriage 9 months and 9 days after we met, the ceremony was the following June.  She was kind, loving, empathetic, gorgeous, funny, and smart.  I still don't understand how I was able to reciprocate the love she gave me.  \n    My decision to love her wasn't a decision at all, to be honest.  It was out of my control.  When we first spoke, it was immediately comfortable and relaxed, like we were just continuing our last phone call.  I had known Aly my entire life, and we were just catching up.\n    Aly died in my arms May 13th, 2023 of the cancer she had been fighting for 5 years.  She had just turned 33.  \n    I don't regret loving her, I don't regret marrying her, and I don't regret giving her my heart so deeply that I am left hollow and numb with her gone now.  Our love for each other  brought me a greater understanding of communication, life in general, and what to cherish and consider important.  If I could, I would do it all again, with no hesitation.\n\nhttps://imgur.com/gallery/AkTePQE",
   "created_utc": 1690210651,
   "score": 44,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8sie7",
   "message": "Leaving teaching for a \"real\" 9 to 5 job. I do marketing in the tech industry. I'm happier, healthier, and have more of a work-life balance than I ever had as a teacher. Teaching is more than just Monday to Friday 8-3 with summers off.",
   "created_utc": 1690203458,
   "score": 138,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8sofl",
   "message": "obtaining a divorce. We remain friends, but my life has improved immensely. My current hubby is quite popular with my ex. Ex claims he is honoured to describe both of us as friends.",
   "created_utc": 1690203543,
   "score": 69,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt929h6",
   "message": "deconverting.\n\nreligion may be positive for some people, but it was toxic in my life.  everything is better without it.",
   "created_utc": 1690207963,
   "score": 51,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8uupp",
   "message": "I almost gave in to ending my life. I had everything planned. Even wrote my final will and testament was only 29 years old.\n\nThe day I planned to do it arrived and all I could see in my head was my mum and my brother’s faces. I didn’t do it out of love for them. It would have broken them as we are very close.\n\nI told noone of what I was going through. But I pushed myself on. About 4 months after almost ending it I was headhunted for a job opportunity in Switzerland. \n\nIt is by far the scariest thing that I have done being away from them but I’m grateful to be here. I will be turning 31 soon and have made progress. I go to therapy regularly and am trying to constantly remind myself of the good things I should be grateful for. Fighting my depression is a constant battle but therapy gives me the tools to do so.\n\nAnxiety combined with depression is no joke. At one point my brain absolutely convinced me that ending it is the only possible solution. It’s not easy but I take one day at a time and focus on my mental well-being.\n\nIf anyone out there is going through mental health struggles and need someone to talk to please reach out. My Dms are open to those who need a metaphorical ear.  Rude messages will be blocked/reported (sorry to add this but in the past some weird messages where sent).",
   "created_utc": 1690204607,
   "score": 33,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt91caj",
   "message": "I’ve been clean and sober now for 8 years",
   "created_utc": 1690207561,
   "score": 30,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt929me",
   "message": "Left my narcissist ex with absolutely nothing except the most important thing: my son. I had no money, no job, no family and friends due to isolation. I thought I would be homeless. I weight 98 pounds at 5’6 and was considered failure to thrive. I was hospitalized twice. However, anything, even death, would have been better than the pain of being silently tortured and knowing that would be my sons experience as well as he got older. \n\nI live with my son in our own cute little condo now. I have a great job and am about to complete my Masters of Social Work next year so I can help other women who may be struggling. I want them to know that things get better. We are different people than we were all those years ago. And it was for the better for everyone, including my ex. \n\nMy son is about to be six and he is thriving. I can’t imagine what our lives would’ve looked like if I would’ve stayed.",
   "created_utc": 1690207965,
   "score": 26,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8pksf",
   "message": "I had this friend of mine that had a kid and started hinting that she was into me and even asked me out, but I rejected a couple of times. My friends kept telling me that I shouldn't go out with a mother because you don't only break her heart when you break up but you also break the kid's heart. I stayed friends with her and became really good friends. Years after, I got drunk and asked her out. I told her after that I was drunk but that we should give it a try on the good ends. So if it doesn't work out, we stay friends. She was broken and depressed, her ex that left her was a narcissistic cunt that would get girls pregnant (has 2 kids already) and she was just a lot to work with.\n\nIt worked out in the end, we moved in, her kid was barely 2 years and call me dad, we married and got a kid together. I did everything to make her into a normal person again, she is a really happy woman now, loves me, I love her and by me working my courage up to becoming a parent at the age of 21 payed off and made me a better and happier person as I had come from a very dark place.",
   "created_utc": 1690201957,
   "score": 131,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8rx3c",
   "message": "I went to the central intelligence agency in November of 2018 and informed them of a national security crisis involving government and corporate corruption that had occurred (think \"too big to fail\"-esque dynamics but in a national security context). \n\nIt brought me new enemies lol.",
   "created_utc": 1690203162,
   "score": 76,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8u9w9",
   "message": "Deciding not to die. I was at a weird place in my life when I was 17. Had a drug problem and was essentially ok with having a short life. Anyways, I was traveling with family when we had a whitewater accident in class four rapids. I got knocked out of the raft first, thought I was alone. Couldn’t breathe, getting bounced off boulders every which way. I kind of just decided to let it happen at that point, I was heading that was anyways and at least then it wasn’t going to feel like my fault. \n\nSo I’m bobbing along waiting to die. But then here’s my little sister in the water with me, and then the other one. They’re screaming and crying so dying in the river just wasn’t a luxury I had anymore. I needed them to be okay, and they needed me so I couldn’t just decide to drown. We hung onto the side of the raft until we got to the last boat ramp for five miles, passing bystanders and takeout points and missing every single other one. It was the last shot we had. I was able to get the attention of someone on shore- hooked my ankle around the line, let go of the raft, and swam for it. They hauled us all out of the water in one piece and I missed my opportunity to die young. It’s been a long time, the girls have grown up now into awesome ladies and I got to see it. Everything I have now I owe to that choice.",
   "created_utc": 1690204329,
   "score": 75,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8t792",
   "message": "Left an abusive workplace several years ago. Career has seen a massive upward trend ever since",
   "created_utc": 1690203809,
   "score": 24,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt92tlq",
   "message": "Met a girl on Reddit. I lived in England and she lived in Australia. After 2 years talking online, I quit my job (also turned down a big promotion), gave up my apartment, sold my car and belongings and flew out to meet her a week later. Since that day we haven't been apart. We're now married and planning for small ones.",
   "created_utc": 1690208203,
   "score": 30,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt93g4x",
   "message": "Reported my rapist to the police.  I wanted nothing more to just, and feasibly could have, showered, gone to bed, and pretended it didn’t happen. But I was worried about if he’d done it to others, or would in the future, so I made the call. \n\nI was lucky, I had a lot of evidence and told the starkest truth, he was stupid and tried to lie. He was convicted of 2 counts of rape and 1 of false imprisonment and sentenced to 9 years. He served 4 and a half before being autoreleased and promptly breaching his licence. He’s now “unlawfully at large” and wanted for recall to custody. \n\nSo I guess it got me some justice? And some emotional honestly and support from those around me that I wouldn’t have had if I’d tried to squish it down with the squisher downer.",
   "created_utc": 1690208470,
   "score": 21,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8sxqw",
   "message": "Moved from Chicago to Miami during the pandemic. Lived in Chicago my whole life, I had never been to Miami before and didn't know anyone. I now have a beautiful wife from the south of France, the most adorable Shiba Inu puppy and a baby girl on the way.",
   "created_utc": 1690203674,
   "score": 41,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8vqr6",
   "message": "I'm currently in the process of preparing to leave my abusive husband. Quietly getting all my ducks in a row. It's been really, really, really hard to find the courage to do it all.",
   "created_utc": 1690205028,
   "score": 44,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8wvyp",
   "message": "As a severe asthmatic, refusing to fund raise for a sponsored run we were forced to do at school.  I was sent to Coventry for three months among other tortures.  Just because an organisation unites in judging you wrong, you do not have to accept that judgement.  A boy died from an untreated asthma attack during a games lesson the year after I left.  Fuck you Langley Park.",
   "created_utc": 1690205569,
   "score": 40,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8vsqt",
   "message": "I restarted my life.\n\nI quit my pretty decent job and went back to school. I worked two jobs that could I could manage with m schedule, moved to a railroad tenement apartment with rats and a series of strange roommates, and I ate a lot of lentils and rice.\n\nIn retrospect, the process seems pretty miserable now. But at the time, as Tevye says in *Fiddler on the Roof*, I was so happy I didn't know how miserable I was.\n\nWhat did it bring me? Eight or nine years after the process began, I got my PhD and started on the career I always wanted.",
   "created_utc": 1690205054,
   "score": 18,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8qbgw",
   "message": "Q: Starting my business.\n\nA:  $millions and zero debt",
   "created_utc": 1690202345,
   "score": 61,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8r0na",
   "message": "Breaking up with my first ex. They didnt treat me right, thats for sure.\n\nIm proud at myself but at the same time Im not? I think Im at the part of the post-break up where you question every word youve said in the relationship, think about the what-ifs, a part of me is thinking that maybe I shouldnt have broken up with them. Its hard getting past that stage yet. Ig its hard for me since its the first time ive fallen in love",
   "created_utc": 1690202707,
   "score": 48,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8s5sf",
   "message": "I moved to China for a year to supervise a major project.  \n\n\\- Great experience, and made many lifelong friends.  \n\n\\-  After coming home the company I was at decided I was paid too much, and put me under a bully nutjob manager to drive me out.  \n\n\\-  Luckily China job greatly increased my career prospects and had an easy time moving up the ladder and make more $$$$.",
   "created_utc": 1690203282,
   "score": 47,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8trsz",
   "message": "Gave everything away to embrace a minimalist lifestyle. Literally everything I had accumulated over years; beautiful furniture, artwork, kitchen appliances, designer clothing to name a few items. I gutted my life of excess and began living purposefully.\nIt absolutely changed my life for the better.\nIt brought me PEACE.\n10 yrs later and I regret nothing and actually funded my entire retirement and emergency fund accounts for my later years.",
   "created_utc": 1690204086,
   "score": 50,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt9a108",
   "message": "Bringing myself to go to the gym while I was overweight. I feel like since then, I’ve been a lot happier with myself and what I could achieve.",
   "created_utc": 1690211190,
   "score": 15,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8uy8p",
   "message": "not trying to hang myself in my basement while kicking the chair away from my feet.\n\nI want to express my gratitude to each and every one of you for your wonderful words. You all have completely improved my day.\n\n\nEdit 2: I'm open to hearing any stories anyone of you would care to share with me. I'm available if you need someone to chat to about this right now. And you can get the assistance you require.",
   "created_utc": 1690204655,
   "score": 13,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8ygh4",
   "message": "Fought an 11 year lawsuit without settling, refused to declare bankruptcy despite the fact it likely would have saved our family alot of money and heartache. I simply could not let go. I could not admit to wrong doing when I felt to my core that we had done nothing wrong and should fight to clear our name. \n\nContext: Contractual dispute. Fired a subcontractor from a construction project for gross incompetence and not paying his bills, ultimately losing his insurance. When his creditors came to him, he accused my company of denying him profits associated with the job he was fired from. Got it to a jury and...yeah...",
   "created_utc": 1690206284,
   "score": 12,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8yqcc",
   "message": "Leaving a toxic relationship while going through issues with my thieving, lying, abusive family.  Best decision ever.  Happily married now with a family where my kids actually feel comfortable talking to us, establishing boundaries and being responsible with money, without worrying about us \"borrowing money since you have it\".",
   "created_utc": 1690206407,
   "score": 13,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8t5bq",
   "message": "Selling most of my things, quitting my job, and moving to the US. Leaving your home country, family and all that stability is not a decision to be taken lightly.  I did it to get married. Still here and happily married 23 years later.",
   "created_utc": 1690203783,
   "score": 11,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt94uw6",
   "message": "I was born and raised in a small midwestern town. It was the kind of place where you knew everybody, and you also knew their parents, and their siblings. In my 20's, I was working for an IT company that my father owned, and making decent money for the area.  I had a pretty clear path to take over the company when he eventually retired. I was surrounded by family, and friends that I'd known literally since kindergarten.\n\nThe problem was that I wasn't very happy. \n\nI felt like I had very little actual control of my life, and every day was basically the same, seeing the same people, going to the same places, and having the same conversations. \n\nI'd known every eligible woman in the dating pool for more than a decade, and there wasn't a lot that interested me, there.\n\nI met a woman online, and after long-distance dating for a few months, I quit my job and moved across the country to be with her.\n\nThat was 18 years ago. I've been married to the woman that I met online for 16 years, and I've never been happier. I work in IT for one of the largest companies in the world, and make more money in a quarter than I ever made in a year back \"home\".\n\nI'm surrounded by friends who are friends of my choosing, not just the people who were in my third grade reading group. \n\nA lot of my family was pretty toxic, and I've been able to effectively remove them from my life.\n\nI haven't been back to my home town in more than a decade, not because I have any ill will for the place, but because there's just nothing for me there. At some point, I realized that a place that was my entire world just wasn't that important, anymore.",
   "created_utc": 1690209063,
   "score": 11,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt9svj8",
   "message": "This post is 5 hours old but I hope someone still reads this.\n\nI am in my mid 30s and never took a solo vacation. So I took a week off work, flew to DC, and spent 5 days/4nights by myself in a city half way across the country. It was the best trip I ever took. I decided when to wake up, where to go, when to leave, what to eat, etc. However, after 3 days it felt lonely. I had no one to take pictures with and no one to share the experience with.\n\nThe trip gave me the confidence to start dating again, an interesting story to tell on a date, and the determination to find someone to share that with in the future.\n\nA year later and now I am in an amazing relationship and have 2 step kids that look up to me. I finally feel complete and it is all because I took a solo adventure.",
   "created_utc": 1690218568,
   "score": 14,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8tbdp",
   "message": "Quitting my job of 13 years. It brought me education and time with my dad who ended up getting diagnosed with cancer and passing the following year.",
   "created_utc": 1690203865,
   "score": 9,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt91rq3",
   "message": "i told the adults in my family about the sexual grooming i had to endure at the hands of my home tutor from grades 8-12. they heard me, believed me, but still let him take classes for my little cousin brother. i kept fighting them to fire him even though it made me badly physically anxious. i warned my little brother that he's not a nice person and that he should tell me if anything ever happens cause no matter how badly i might get hurt i was determined to protect him. he came up to me one day telling me how this guy's trying to ask him extremely prying/sexual questions. fought my family again, determined to call the police this time if necessary, and finally got him fired. my little brother's much happier now.",
   "created_utc": 1690207749,
   "score": 10,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8shw2",
   "message": "I began performing well in school and enrolled in a big 10 university for college. Remember, I was a drug dealer in the Detroit projects.",
   "created_utc": 1690203450,
   "score": 19,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8xeq4",
   "message": "I stood up for a guy who was being beaten by three neonazi skinheads, even that I was shaking. It brought me a brain contusion after I was surprised by a highkick to my head and I left the event in ambulance, they fled and the defended guy waited with me for the ambulance, he had only some scratches. I would do it again.",
   "created_utc": 1690205809,
   "score": 18,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt92m4h",
   "message": "Deciding to not have kids at 25. I'm 34 and I love my freedom and my wallet and silence.",
   "created_utc": 1690208114,
   "score": 9,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8xzqh",
   "message": "left my toxic abusive homophobic family and country to start anew in another one where I barely spoke the language and knew nobody.\n\nHave a beautiful girlfriend, the job I always wanted, no more toxic friends, and finally healing from all the bullshit. And also fluent in a new language. I know a lot of people afraid to take the step to leave but i'm so fucking happy I left",
   "created_utc": 1690206075,
   "score": 9,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt911nd",
   "message": "I stopped a girl being robbed on a train in Napels. I saw it happening and decided I had to act.\n\nFor my trouble I was assaulted by the robber, the girl did say thanks after the robber had fled which was nice. When I got back to the UK I took up MMA so next time it won't go down the same way. Turns out I really enjoy MMA and its a great form of exercise. \n\nAlso I got a good story I guess... overall net positive I reckon",
   "created_utc": 1690207430,
   "score": 8,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt914l2",
   "message": "Left my soul sucking corporate job to do photography full time. Best decision of my life.",
   "created_utc": 1690207467,
   "score": 8,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt93py7",
   "message": "Was sexually assaulted by a professor in grad school and reported it to the department. They didn't do anything, so I reported the professor and the department to the dean. Professor was found guilty in the school's investigation.\n\nWord spread in my field, I got a reputation. I got really jaded about academia and was at a low point. My dad was diagnosed with stage 4 cancer. I started dating my ex, my dad died, then I moved to ex's country to run away from everything. \n\nA year later ex invited that professor for a visit. I married my ex a month after the visit. 16 years later I escaped that abusive relationship. I've been in intensive therapy and things are going really well since.",
   "created_utc": 1690208585,
   "score": 7,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt94666",
   "message": "My relationship of 16 years fell apart during the lockdown in 2020. The moment it ended I decided to move 1200 miles away to KC where my remote job was located. That very day I bought a car, packed my belongings and left, never looking back.  Within 18 months I met my future wife, got married and am living my absolute best life",
   "created_utc": 1690208773,
   "score": 8,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt94i6n",
   "message": "I saved a 6-7 years old boy from drowning in the sea. Nothing, small plus in karma I guess 🤷‍♂️",
   "created_utc": 1690208914,
   "score": 7,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt9edw5",
   "message": "Someone was talking on the phone on the quiet coach of a train. Politely asked them to take it outside the carriage and they did. \n\nSounds like nothing, but I’m British so it’s the equivalent of charging at a machine gun nest. \n\nGot so many nods of respect and appreciation  walking back through he carriage.",
   "created_utc": 1690212954,
   "score": 6,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8stwz",
   "message": "Coming out as trans I guess. Lost my family, but now lifes worth living so no complaints.",
   "created_utc": 1690203621,
   "score": 65,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt9jqt1",
   "message": "Asked out a guy on accident 3 days after leaving my insanely abusive ex. Nearly canceled it the day of because I felt guilty for it being so soon after my last relationship. Therapist told me at the time to go for it because worst case scenario we break up.... Anyway the guy I accidentally asked out married me  3 days ago 🥰",
   "created_utc": 1690215062,
   "score": 5,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8q3bi",
   "message": "Left my job to take care of my dad with brain cancer. Now he's dead and I can't get a job. It's lovely. /s",
   "created_utc": 1690202229,
   "score": 18,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8wvdw",
   "message": "Cutting my family out of my life. I always thought since they weren't THAT bad (compared to many horror stories) I should just stick it out out of obligation. It brought me peace and healing I never thought possible, and my life is so simplified. I also have social energy to spend on people I actually enjoy and make me feel good.",
   "created_utc": 1690205562,
   "score": 5,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8zrdp",
   "message": "Decided I was finished working for others and started my own businesses. It afforded me more time with my wife and children while allowing me to retire at 53.",
   "created_utc": 1690206865,
   "score": 5,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt93ccf",
   "message": "I had a conversation with my boss to give my coworker a raise since she was a hard worker despite her only joining 4 months prior. 7 days later he ended up agreeing and also decided to give me a raise with it. \n\nNever told her how she ended up getting a raise.",
   "created_utc": 1690208424,
   "score": 6,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt93te6",
   "message": "Joined the navy after I finished college. Was severely depressed/burnt out and somehow thought the navy was more dangerous than it was and that I could find a chance to die doing something heroic. Lol. Made a lot of friends, got over depression and then left the navy and got my life in order. People say the military gives you ptsd but lowkey college fucked me in the head way more with lack of sleep, social isolation and self worth issuss. I wouldn't say the military didnt give me any mental issues but i came from such a low point that it was a net positive on my mental health.",
   "created_utc": 1690208624,
   "score": 5,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt9d36y",
   "message": "I left a high demand religion/cult/mormonism.\n\nLost friends, have been excluded by family, damaged my marriage.\n\nMy kids won't be raised to hate themselves and others. The buck stops with me.\n\nWould 100% do it again, although the pain is still echoing through my life years later.",
   "created_utc": 1690212431,
   "score": 5,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8tcx8",
   "message": "I fought back against a mugger with a knife and managed to disarm him and kick the knife down a gutter. Courageous to some, foolish to others. I realise now that the value of life is more important than any material belongings and regret my choice. But I still wonder how I would respond next time I’m in that situation.",
   "created_utc": 1690203886,
   "score": 11,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8u4cm",
   "message": "Seven years ago one of my good friends proposed marriage to me. I had been seeing another guy, and almost married him years before that, but then he got cold feet. I stuck with Mr. Cold feet because I didn't think I could do better. \n\nAfter his proposal I didn't sleep for three nights, then said yes and never looked back. We have a wonderful marriage with two amazing kids and a dog.",
   "created_utc": 1690204254,
   "score": 9,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8sk3r",
   "message": "Leaving the old job where I injured myself. Got better job.",
   "created_utc": 1690203482,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt904gg",
   "message": "Reported abusers and reporting suspected child abuse/trauma/self-destruction.  It brought me peace of mind to know that I did what I could especially for children who couldn't do it by themselves.",
   "created_utc": 1690207027,
   "score": 4,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt935n6",
   "message": "Walking away from my partner who became abusive. Still trying to see what it will bring me. Right now I just feel sad.",
   "created_utc": 1690208346,
   "score": 5,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt95o8h",
   "message": "Moving to the other side of the continent for a job offer. The job didn't turn out very well, but I met this cute guy... That was 13 years ago, we're married, and have a dog and a house together. \n\nTake the risk, but always have a backup plan! (Backup as in money for a ticket home, not that you can find the love of your life. That was pure luck, but it wouldn't have happened had I not dared to leave everyone and everything to see where that job led.)",
   "created_utc": 1690209404,
   "score": 4,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt964wq",
   "message": "Left my abusive marriage of 22 years. In the end it brought me an unnerving case of C-PTSD.",
   "created_utc": 1690209595,
   "score": 4,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt97xt3",
   "message": "Organized my neighbors and other renters in buildings owned by the same huge landlord company to fight against our illegal eviction and demand time and assistance for low income families with disabled children to be able to relocate within the same school district and during the summer instead of in the middle of the school year.",
   "created_utc": 1690210335,
   "score": 4,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt9guw1",
   "message": "I jumped into a frozen pond to rescue a lady who was trapped inside a sinking car in the middle of February.  \nI forgot that I can't swim. :)",
   "created_utc": 1690213930,
   "score": 4,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt9kv3k",
   "message": "I left my long-term cheating ex and moved in with my sister. (4 years ago)\n\n(3 years ago) I started seeing a holistic doctor. After 3 weeks on natural supplements, I was able to get my chronic depression under control (after a 10+ year long struggle), and my life has been improving steadily ever since. I found a therapist. Little by little, I overcame my general anxiety disorder (caused by the depression). I started my own small business. I conquered a lifelong eating disorder. I quit smoking cigarettes. I quit drinking. I'm constantly educating and improving myself. I still have a long way to go, but I've never been happier or more self-assured.",
   "created_utc": 1690215498,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt9u0h0",
   "message": "I was asked by my faith community to visit a friend who lived near where I was working. His only child had killed herself with a shotgun the previous night. I was sobbing uncomfortably as I met him at his door and both of us just cried for a very long time without speaking. I hate losing control but everyone she knew was devastated. It still chokes me up over a decade later. I didn't want to do it but I also knew I would have been even more miserable if I hadn't.",
   "created_utc": 1690219014,
   "score": 5,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8x98u",
   "message": "I was playing a bandit machine and my friend told me not to spin again, and to cash out. But I was feeling courageous so I spun again and wouldn't you know it... I lost everything. \n\n\nI also quit smoking. Joined the army. Saved lives and killed terrorists. But the bandit story is the one that really stands out.",
   "created_utc": 1690205737,
   "score": 6,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8znel",
   "message": "My wife and I had just gotten married about 2 years prior. We both come from big tightly knit families. We had just bought a house and a new vehicle. I had a job offer that would take us 1500 miles away.  We sold everything and moved. The experiences together and learning to just rely on us has transformed our life together. We eventually started a family of our own and moved back to our home state 10 years later to be closer to family.  It's like a totally new adventure again.",
   "created_utc": 1690206817,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt90lhi",
   "message": "Pulling myself together to switch careers at 34yo and during the pandemic while I was unemployed, depressed and with some suicidal thoughts.",
   "created_utc": 1690207232,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt93czk",
   "message": "To keep living.\n\nWhat did it bring me? Well... More pain. But also, more joy. The chance to live a life free from anorexia and BPD. The chance to experience life without my ex husband, and experience relationships with actual love. The chance to have some amazing experiences. The chance to live a life that some people said would never be possible. The chance to give a big \"fuck you\" to the people who didn't believe in me. The chance to live a life where I spend over a year out of hospital, instead of more time in hospital than at home. The chance to assemble an incredible treatment team, all of whom believed in me, instead of just a couple. The chance to meet my nephew. Also, the chance to pat more cats, which is great.\n\nIt's been nine years and four months since my last suicide attempt. Eight years and five months since I was declared recovered from BPD. Seven years and three months since my last anorexia relapse. A year since my last self harm. This was a life I was told would never be possible (fuck those doctors and nurses). This was a life I never thought would be possible. So, while I'm still extremely unwell, I'm far from where I was. And that's amazing.\n\nIt was worth it.",
   "created_utc": 1690208432,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt94tji",
   "message": "I was not in constructive\" place in my life so I got up borrowed 50 euro for \"a one way trip to join the French foreign Legion.\n\nDropping off the map for almost 5 years.\n\nSpent 7 years total in the legion and now I own my own home with a steady job and and am getting married in 2025 to a wonderful woman.\n\nGetting on that train was the best decision I ever made. Although I would not recommend it too most people just people like me.",
   "created_utc": 1690209047,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt94yk5",
   "message": "Moved across country, by myself, to a place where I had no contacts or roots, or even an apartment for that matter, for a job that paid less than $20/hour.\n\nMarried with kid now, very glad I did it.  Salary has increased, too.",
   "created_utc": 1690209106,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt95ndx",
   "message": "I donated a kidney.",
   "created_utc": 1690209394,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt969nz",
   "message": "I decided to move to Los Angeles on a whim after graduating college and having almost started a financial adviser job due to the economy at the time. I figured, “well, I should get a job immediately because I might not find one later.” With the job being commission only to start, I realized that struggling at something I was barely into anyways seemed dumb, as I’d rather struggle at something I love or want to try. So, I moved to LA without knowing anyone, tried being an actor and experimenting with new things. I became SAG eligible and got a principal role on a Disney commercial and met some celebrities I never thought I’d ever meet in real life. Also started doing home IT work and met some of the craziest and richest people in the world.",
   "created_utc": 1690209648,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt96m2m",
   "message": "I moved to the United States to live with my then fiancee.  Would have had to happen eventually, and that weekend I came down with just a weekend bag so we could talk to our immigration attorney about how to best plan for a wedding and be in good compliance with the law/how to 'do it right'.\n\nLong story short, attorneys told us that the wisest thing would be for me to not return to Canada, get married in about three months, and then immediately apply for my EAD and permanent residency based on adjustment of status.\n\nThat's what I did and now I'm a happily married, permanent resident home owner WITH A DOG.  I spent most of my 20s in a mental place where a life like this felt like it was just not in the cards for me, so it remains an enormous shock to me to this day how things played out.\n\nAs a side note, I'm extremely lucky to have moved out of my apartment a month before this, and that my wife had a good job and could afford to keep us both afloat through this expensive adjustment on just her income for nearly a year.  Besides the short notice, we were better situated than most for something like this, and it ought to be much easier for the sake of those not so privileged as we were.\n\nI think my wife might be the hero of this story, actually.",
   "created_utc": 1690209793,
   "score": 4,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt98xg7",
   "message": "Going to therapy and opening up about trauma I hadn't really told anyone about. The trauma was related to being vulnerable and it's not exactly easy to be vulnerable with a stranger. My mental health was terrible and I had thought about ending my life often. It was hard at first but now I'm so much better and my life is better too.",
   "created_utc": 1690210738,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt9bltk",
   "message": "Showing up for a job interview I nearly ghosted out of fear.   \nResult was a stable enough career to support a marriage and children.",
   "created_utc": 1690211836,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jtapjdj",
   "message": "Listened to my wife - left a career that made me miserable, moved across the country to be near her family...It was absolutely the best thing we could've done and the timing was perfect - my wife changed doctors and the new doc ordered tests and discovered her cancer relatively early. We had a few years to really live life before she passed whereas we would've likely not discovered it until end stages. She got to live out her remaining years surrounded by her family, who still take care of and support us to this day.",
   "created_utc": 1690231391,
   "score": 5,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8tim8",
   "message": "stop searching for a girlfriend, it brought me more joy because I don't need to keep a good reputation",
   "created_utc": 1690203963,
   "score": 5,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8x868",
   "message": " Well, to make the right decisions you really need not require any courage or any right time, all you need is the right mind-set. This may sound a bit spiritual ...",
   "created_utc": 1690205724,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt95isw",
   "message": "Leaving the UK after 10 years to go back to my family in Poland, I left my 2 year old daughter there with her mum but me and her had a very unhealthy and toxic relationship. 2 weeks in and no regrets although I do miss my daughter. The main reason why I did it was because I'm an addict and I felt I was all alone in it and that my family will support me through it and I wasn't wrong I'm getting all the support I need. So hopefully in the end i will be clean.",
   "created_utc": 1690209342,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt9a7tm",
   "message": "Getting sober. It's been 10+ years now and my life is so much better in almost every way.",
   "created_utc": 1690211266,
   "score": 5,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt9gjqf",
   "message": "I adopted a baby through an adoption agency (with my husband). Best decision I’ve ever made, but it was incredibly scary at times.",
   "created_utc": 1690213809,
   "score": 3,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8xeu8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8x8ny",
   "message": "Left my previous, toxic, household to get away from the madness.  Ended up feeling 100% better and attracting more healthy people and possibilities",
   "created_utc": 1690205730,
   "score": 2,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8xfx2",
   "message": "My wife and I have packed up our lives and have moved across the country (USA) 4 times now, each time for the others' needs. It always tends to be a quick decision and not always the most comfortable decision for one of us.\n\nWe are usually chasing job opportunities, education, or what one of us thinks would be a good 'quality of life' move.\n\nIt has always been a great decision. Things seem to have settled down now, but we joke about the \"2 year itch\" because that's when we seem to start packing things up.",
   "created_utc": 1690205825,
   "score": 2,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8y3pr",
   "message": "Moved home to help my dad take care of my mom when she got sick. Taught me more about myself and my capacity for empathy than anything else I’ve ever done.",
   "created_utc": 1690206124,
   "score": 2,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jt8zzh4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1588rwt"
  },
  {
   "comment_id": "jtbcb5c",
   "message": "I one day decided to check myself into rehab for hard drugs. It took 5 years, 2 tries many broken promises and a 30 day retreat to come to terms with my addiction. It changed my life. Allowed me to finally live. This was over 25 years ago. Still clean from coke and heroin. It brought me peace.",
   "created_utc": 1690240694,
   "score": 3,
   "submission_id": "1588rwt"
  }
 ]
}