{
 "submission_id": "158quvr",
 "title": "What statistically improbable thing happened to you?",
 "selftext": "",
 "created_utc": 1690241437,
 "permalink": "/r/AskReddit/comments/158quvr/what_statistically_improbable_thing_happened_to/",
 "score": 81,
 "url": "https://www.reddit.com/r/AskReddit/comments/158quvr/what_statistically_improbable_thing_happened_to/",
 "comments": [
  {
   "comment_id": "jtbq7dw",
   "message": "Riding my bicycle on a commercial fishing pier as a kid I lost control and rode off the edge with a 20' drop to exposed rocks at low tide.\n\nI tried to stop myself going over by planting my feet on the edge of the pier, but I knew my bike was too heavy.\n\nSomehow the bike stopped, halfway over at a 45 degree angle. However now the seat was in the small of my back preventing me from getting off, and I couldn't budge it at all to get the bike back up. \n\nA fisherman finally ran over to help me and we decided he would pull me as hard as he could and I'd let the bike fall. \n\nI jumped to the side as he pulled me back to the pier, and it worked.\n\nHowever.\n\nMy bike was still there, not moving at all. \n\nWhen I examined what had happened, there was a piece of rebar sticking out from the edge of the pier bent upwards in an L shape, and it passed diagonally through the spokes of my front tire and completely wedged my bike in place. \n\nIt was the ONLY spot on the 300' long pier with ANYTHING sticking out. \n\nI most certainly *did not* stop myself and my bike from going over.",
   "created_utc": 1690246887,
   "score": 90,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbsu4d",
   "message": "I received my heart transplant after being on the list for only 7 hours.",
   "created_utc": 1690248058,
   "score": 148,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbko2s",
   "message": "Dropped a glass while washing six - just six - wine glasses. It hit another glass, and shattered glass flew up out of the sink, hit me in the wrist, resulting in an arterial bleed. Home alone (house sitting). Cell service not available due to a big service fail in the area. Managed to stumble my way off the acreage to the nearest road and a driver was able to call for police and ambulance. Too close. Too damn close. I lost consciousness moments after hailing car for help. If she hadn’t stopped…. ****EDIT*** FOR CLARIFICATION, TO ANSWER QUESTIONS AND TO DISPEL WACKY ASSUMPTIONS.  You folks are kind. And some of you folks are wildly accusatory. Sigh. \n1. Assuming I was drunk on wine, and drunk on the power of using a different wine glass for each drink I had. Lol. I don’t drink. The homeowners had had company the night before they left. Hence, the wineglasses. They wouldn’t put their “expensive, shipped home from Italy during last trip there” glasses in the dishwasher and asked me to wash them. This happened about four hours after they left to go to their summer house. \n2.  There was a massive cell service outage. No, it shouldn’t have happened. Read about the 2022 Rogers Communication Outage. Yeah, I should link it, but I don’t know how to do so properly. Apologies. \n2(a) No, they don’t have a land line. \n3. Yes, it was an arterial bleed. I knew it was bad, because I’ve watched ER (ha) and because the blood was spurting up and out all over the counter, the floor, me, the stove, the hanging pot rack, etc. \n4. I’m a fainter. I quickly slumped down to the floor, having attempted a tourniquet while repeatedly calling 911. My dominant hand was injured. I’m a fainter. It was bad. I said to myself - out loud - YOU ARE NOT GOING TO BE ONE OF THOSE PEOPLE THAT DIES IN A STUPID FUCKING HOUSEHOLD ACCIDENT. NOW GET UP AND WALK TO THE END OF THE PROPERTY AND HOPE A CAR GOES BY. \n5. I did get up while putting pressure on my wrist and dropping saturated tea towels and adding new tea towels. The blood stain trail showed I was not steady on my feet and that I apparently tried to get in the car and drive. Blood trail continued down paved drive but also went in circles and onto the grass as I apparently fought against fainting/losing consciousness. \n6.  First car that drove by wouldn’t stop. I can’t say I blame them. Woman covered in blood stumbling, they may have been afraid. Car that stopped used in-car comms (OnStar? Apple? I dunno) to get help. But she wouldn’t get out of her car until I guess she was sure this wasn’t a domestic violence incident and she wasn’t putting herself in danger. She would not touch me or help to apply pressure. \n7. Just as I was passing out - and if you’re a fainter, like I am, then you know when you’re going to faint and you know when you’ve reached the point where you can’t do anything to stop it - a woman from another car ran up to me and I asked her to keep pressure on - which she did. Using her bare hands and a small rag over my blood soaked tea towel. She saved my life. She didn’t have to do that, and I’m eternally grateful to her. No. I don’t know who she is. \n8. Police entered the house and cleared it. Apparently believed that this was a possible domestic violence incident and thought the perp - or other victim - or that I was the perp and there was a victim of MY actions - might be in the house. They wrote that “the scene matched the story”, or something to that effect. The woman who stopped first must have told them I said I’d hurt myself washing dishes - which I’d told her in an effort to get her out of her car and applying pressure to the bleed. \n9. Doctors in ER asked me what happened. Told them. I don’t know if they believed me or not, but as per normal protocol, they did ask me if I was safe at home. My license and health card showed I did not live in the area, so maybe then they believed I actually was just the house sitter. \n10. I was in the hospital for about 6-8 hours. Went back to the acreage. Went to bed. Slept for about 12 hours. Cleaned the blood and glass up the next day. It was bad. Very bad. \n11. I no longer use glass containers. I use only plastic cups. I’m still a non-drinker. I still house sit. I do not hand wash glasses. Ever. Under any circumstances. And when hearing a glass break I start to cry. Pathetic, but true. \n12.  I suggested to the homeowners that they get a landline. They did not. \n13. From time to time, I still have some discomfort in my wrist. Also some numbness. I just rest it for a day or two and then it’s fine. Yes, I have a scar. Not very noticeable. \n14. I had a second arterial bleed in the hospital when the resident stitching me up nicked my artery as they tried to do the repair. Shit happens. At least I was in the hospital. \n15. The ER docs were absolutely amazed that I’d walked to the end of the property and gotten help all by myself. One doctor said, YOU  saved yourself. Any lingering doubt was likely cleared up by police report of scene and blood trail. \n16. Did this change my outlook on life? Yes and no. I’m less fearful in many ways, and more inclined to say yes to new experiences and adventures. I have developed a deep rooted fear of glassware. No joke. I won’t wash glassware. I was already aware of the random nature of life - and death - as my parents died when I was young , and I’ve had other random shit happen to me. So. I get it. Life is random. Life is fragile. In the face of so much bad luck, I’ve been lucky. I’m still here. Still house sitting. Take care, friends. And be careful washing those damn glasses. (Edited for brevity and to satisfy someone’s unquenchable thirst for paragraphs.)",
   "created_utc": 1690244347,
   "score": 196,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbr3kj",
   "message": "i have been hit in the head by live squirrels three times in my life each on separate occasions.",
   "created_utc": 1690247291,
   "score": 95,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbs0xg",
   "message": "I was on a road trip with my cousins in the 80s. One of them kept playing the same song over and over by rewinding the tape and playing it again. The song was “another one bites the dust”. After three plays in a row the driver pulls out the tape, says enough! And turned on the radio… Sure enough that song was playing on the radio right then.",
   "created_utc": 1690247699,
   "score": 212,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbpjod",
   "message": "Back in community college people thought I was dead for half a day. I was supposed to meet a friend on campus to go eat. I was running late because my dad wanted me to do something before I left. I don't remember what.   \n\n\nI get to campus and there's this fountain the kind you can walk through or run about and avoid sprays of water. Around the whole fountain is a bunch of police tape. So I kind of think \"huh okay weird\" then I go to the building where my friends hang out. As I walk in behind one of them I hear them telling everyone else I killed myself that morning.   \n\n\nTurns out that a guy matching my physical description killed himself in the fountain. Between that and what he'd said to someone before doing it along with my appalling lack of punctuality everyone thought it was me.   \n\n\nI always thought the Mark Twain quote of \"The reports of my death are greatly exaggerated\" was badass but I had never thought I'd have the opportunity to use it.",
   "created_utc": 1690246569,
   "score": 197,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtc47bq",
   "message": "Took a summer time Organic Chemistry class, one month of classes 5 days a week then a three week break then another month for the second semester.  After the break I reached into  the box in my closet to grab the textbook where I had hidden it and felt a sharp stab in the corner of my little finger at the cuticle of the nail bed.  I was running late to class so I thought nothing of it.\n\nI became ill with profuse sweating and nausea during the day then violently ill into the night with vomiting and diarrhea and swollen adenoids.  Went to the ER the next morning and they ran every test they could.  Two days later I started having trouble breathing and went to the ER again.  My heart was swollen up half again it normal size, my lungs were swollen, and my kidneys too.  Doctors kept me for two days with batteries of tests and after two days let me go as everything was going back to normal.  Then I began shitting what appeared to be a white paste and this went on for two days.  At the end of which I noticed that my tongue and the lining of my mouth was almost purple in color and I had a red streak from the tip of my little finger that during the day extended up to my bicep by that evening.  Went back to the ER and the doctor said he had no clue but maybe I had been bitten by something venomous.\n\nI then thought about the day that the symptoms started and went to that box in my closet and sure enough there was a little black spider in the box.  I asked one of my professors about it and he told me the county Health Department had a entomology office not far from campus so I captured the little spider and went on over.\n\nThe doctor there told me it was just a grass spider and there was absolutely no way it could have envenomated me for 3 reasons.  He said they have curved mandibles so they cant hit the human skin, they have soft mandibles so even when they manage to strike the skin the mandible will turn and not break the surface but most importantly their venom which digests the proteins that stretch between the cell walls of animals gets bound to Platelets in the human bloodstream and is almost instantly neutralized.\n\nI showed him where the bite was as evidenced by the red streak and sure enough it was in the corner of the nail bed in very soft tissue of the cuticle where the spider could actually get a strike.  He asked if I had some kind of platelets disorder.  I made a quick call to the Cancer Research hospital I worked at in the evenings at that time and sure enough I had donated platelets the evening before being bitten.  A process where they put you on a platelet phoresies machine and extract almost all of your platelets for donation to kids who are in need of them due to having low counts from the chemotherapy.\n\nIt was at this point that the entomologist started hyperventilating and asking all kinds of questions.  He was low key freaking out.  He kept repeating that this was a billion to billion to one event and he'd never heard of it before.  He ended up getting me to sign some papers so he could have my medical records and published a paper on it.  Fun for him but not so much for me.  The white paste that I pooped for 3 days was the epithelial lining of my entire digestive tract which came out as white pasty looking individual cells.  By the end of the month everything was back to normal like none of it had ever happened.  Interesting side note.  When some spiders inject their victims and turn them into liquid that they can then drink this venom dissolves the proteins that hold cells together by running between the cell walls.  These proteins re the only things binding the cells together.  Without these proteins we would be reduced to a nasty white almost liquidy paste.  \n\n\nEdit: as it has been asked many time in the comments I do not possess a copy or link to the paper the entomolgist wrote.  Nor do I remember which journal it was in.  This happened in the early nineties and may have never even been out on the internet.  Also I don't know if that journal even still exists.  Can't be that many people reading journals on entomology.  Also he was a PhD in Entomology and not a medical doctor so it wasn't in a medical journal.",
   "created_utc": 1690253472,
   "score": 13,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbg0c8",
   "message": "Went to a county fair and found a season pass on the ground with my name on it. 4 people in my area with the same name and I know 2 if them. What are the odds of that?",
   "created_utc": 1690242311,
   "score": 128,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbzdi5",
   "message": "I saw an ad on a Pepsi case at a grocery store for a text to win contest to see Beyoncé in concert. I figured why not, and sent a text and was entered. A few weeks later I got a text back from the same number that told me I won the grand prize! I ended up winning 2 tickets to Beyoncé’s Mrs Carter World Tour in Brooklyn and $500 on a Visa gift card. Used the $500 for some bus tickets and a hotel down the street from Barclays. The seats were awesome and it is something I’ll never forget!",
   "created_utc": 1690251144,
   "score": 91,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbyrxl",
   "message": "My dads birthday was 3-3, my brother is 6-6, mine is 7-7 and my son is 11-11.",
   "created_utc": 1690250846,
   "score": 145,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbm6eb",
   "message": "Nearly getting killed by the same reckless/drunk driver twice in three years. The first time in 2001, I turned right. Before I completed the turn a Pontiac Sunfire zipped by going 100-110 mph. \n\nThe second near death was in the driveway in 2004. I was supposed to pick up my brother from work. This time I didn't. Instead, I hear a noise that could be heard a block away. The drunk driver smashed my car and turned it around 180 degrees. His BAC was 0.20. He tried running away and the neighbor tackled him. There happened to be a police officer nearby, too. Life comes at you fast. \n\nI played softball with the kid when I was 11 years old. Drunk drivers don't want their license.",
   "created_utc": 1690245012,
   "score": 224,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbhf3a",
   "message": "Hit by lightning. Sort of .. indirectly. Lightning hit a tree near the wellhead while I was doing dishes. Exploded the tree, fried the well and gave me a jolt that made my metal fillings so hot they burned my tongue. Other than that, I was fine.",
   "created_utc": 1690242926,
   "score": 64,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbgt2b",
   "message": "My wife and I (both right handed) had two left handed kids. Which has around a 1% chance of happening twice.",
   "created_utc": 1690242659,
   "score": 54,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbxmsw",
   "message": "Not me, but a friend. He was a merchant mariner. Lived here in Virginia Beach. He was alwaus calling and texting, posting pics from around the world. \n\nOne time he'd been out a while, we knew he was heading to Dubai, but didn't know where he'd be after that. 4 months go by, nobody's heard from him.\n\nHis neighbor, who I was friends with, gets married and goes to Thailand for his honeymoon. He texts me one day and said you aren't gonna believe this shit. \n\nHe said he asked a local where a good local spot to eat was that tourists wouldn't be at. Guy takes him 30 minutes from the beach, to some dive bar/restaurant with no sign, no clearly marked entrance, he said it looked so shady he was afraid he was about to be robbed and killed. He goes in, and it's a legitimate restaurant. He eats, drinks some beers, goes to the bathroom. Out walks my friend, so he took a pic and sent it to me to confirm he's ok.\n\nImagine taking a flight several thousands of miles away, getting away from the tourist areas and going into a local dive bar, and running into your fucking next door neighbor you haven't seen in months. Shit's wild.",
   "created_utc": 1690250290,
   "score": 60,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbrbud",
   "message": "While attempting to get medical treatment, the dr.’s office ran a pharmacy report on my medical history and prescriptions. My terminally ill brother, whose full name was only 2 letters different from mine and we had the same address and phone number, was on a shitload of narcotics at the time and through their search they pulled up HIS report and thought it was mine. They yelled at me and kicked me out of the office saying I was just looking for drugs. I was mortified and very upset and they wouldn’t listen to me when I said it was my brother and not me. I ended up calling the pharmacy board and they called the doctor and explained that since we had the same address, phone number and an extremely similar name, they had to search by social security number. The doctor felt horrible and gave me free treatment and now he tells that story at conferences he goes to. It was crazy. So of course, I had something happen to me that the doctors or nurses had never come across before. The doctor shared with me the tales of the conferences he spoke at and said none of the doctors there knew it was possible for data from 2 people to be included in the same pharmacy report either. I guess they do now!",
   "created_utc": 1690247390,
   "score": 231,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbqyo5",
   "message": "I underwent a surgical procedure called a stapectomy to improve the significant hearing loss in my GOOD ear.  Instead, I ended up completely deaf.  My surgical ENT said this has only happened to 5 patients IN THE US.  (He was doing research to try to help me afterwards.)  I don't know how true it is, but hey, lucky me.",
   "created_utc": 1690247231,
   "score": 1,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbsu4u",
   "message": "Got left a written message to call a girl, mistakenly called another girl instead with the same name....we've been married for 14 years.",
   "created_utc": 1690248058,
   "score": 134,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbv83k",
   "message": "Lost my house in civil court. Represented myself and won in appeals court twice. Since my case was unique in this state, my cases were published both times. Moving back into my old house soon.",
   "created_utc": 1690249147,
   "score": 140,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbluco",
   "message": "I had two relatives die on my birthday. My grandma (Noni) in 2007 and my mom in 2016.\n\nEdit:\n\nWow, this has blown up more than I expected. Thank you guys for all the support. For a little more, my dad passed away the year prior to my mom during my birth month. I think March is my cursed month.\n\nEdit 2:\n\nFor anyone that wants to help, check my profile. I put myself in debt to pay for my parents funeral expenses. Then COVID happened and I fell behind. Not looking for people to pay my debts, I want to do that myself. I just need a little help to give me the tools to do that.\n\nBonus Improbable Thing:\n\nI have been suicide adjacent on two separate occasions while staying over at other people's houses. The first was my Aunt Linda. She was separated from her husband and had been staying at my Grandma's house. One night I was staying over as well. She overdosed on pain meds and we found her the next day on the floor in the living room.\n\nThe other was while I was staying over at a friend's house. At night we heard a weird noise that is hard to describe. It was kind of like a long low squeak. We looked out the window but didn't think anything of it. In the morning I headed home. Later that day I received a call from my friend, he sounded like he'd been crying. He told me his dad was dead, he killed himself that night. He had locked himself in the shed outside with a grill running and fell asleep. The noise we heard was likely something to do with a pressure change.\n\nHowever, it gets weird. He didn't leave a note for his family. He didn't leave them anything at all. The only thing they found was a manila envelope with my name on it. Yes, the last thing he wrote was something to me. It didn't contain a note though. He left me some comic memorabilia because he'd gotten me into some stuff and it was a mutual interest we shared. My friend and his family had to move back home because his dad had moved them all there for a programming job. I ended up losing touch with my friend.",
   "created_utc": 1690244862,
   "score": 92,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbjxz7",
   "message": "I got bit by a ground hog. I’ve never researched the odds of getting bit buy a ground hog but it’s gotta be pretty low, right?",
   "created_utc": 1690244032,
   "score": 115,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbq3gq",
   "message": "After losing an AirPod while skiing I was able to find it the next run",
   "created_utc": 1690246833,
   "score": 236,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbu81b",
   "message": "Got attacked by a robin in the morning, then attacked by a hawk 3 hours later. Weird day.",
   "created_utc": 1690248690,
   "score": 215,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbvt3g",
   "message": "Picking the slowest checkout lane in the grocery store every single time for the last 40 or so years.",
   "created_utc": 1690249419,
   "score": 154,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbxs2y",
   "message": "Not me, but my grandfather:\n\nWeeks before his 93rd birthday, he was finishing a day of yard work on his farm. He tripped while getting off the lawnmower, and it rolled on top of him (blades turned off, luckily). He was pinned under it long enough that he was about to slit his own throat to put himself out of his misery (as opposed to freezing to death overnight beneath a lawnmower). \n\nJust before he ended himself, he happened to see a crowbar in the yard that he dropped earlier. It was just in his reach, and he grabbed it. He proceeded to somehow lift the lawnmower off of himself with it, slide himself out from beneath the mower, crawl back onto the mower with broken limbs, ride the mower up to the house, crawl up the stairs, and grab his phone to call my dad. \n\n\"I need a ride to the hospital. I think I hurt myself.\"\n\nETA: The mower was a riding zero-turn style mower (worth a Google if you aren't familiar). It rolled on its wheels on top of him as he stepped off of its platform. With gas and the machine combined, it weighed just under 600 pounds. He survived this incident, but unfortunately, it led him down a domino effect of events that led to his death this year.",
   "created_utc": 1690250362,
   "score": 178,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbh4y0",
   "message": "This is the dumbest story ever but the one time in my entire life that someone asked me if I wanted to buy a pair of shoes at work is the day (a few hours later) that the sole of my shoe came off. \n\nSo yeah, I bought the shoes. \n\nCoworkers husband bought wrong size shoes and not sure why they couldn’t return them.",
   "created_utc": 1690242804,
   "score": 39,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbu78p",
   "message": "Correctly guessed all the numbers of the California Lottery 20 years ago upon arriving in my hotel room and turning on the TV at the drawing time.\n\nI keep running into the same ex every few years, no matter where I go on the planet (30+ years). We have =NOT= stayed in touch.",
   "created_utc": 1690248679,
   "score": 213,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbhgld",
   "message": "Moved from Ohio to Texas back in 2006 to be with my now wife. Was interviewing for my first career job, and one of the interviewers was not only from Ohio, she graduated from my university, AND she went to the same high school as both of my parents (two hours away from that university, so not like they were in the same place) just a couple of years before them.",
   "created_utc": 1690242944,
   "score": 202,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbpcjm",
   "message": "My twin sister and I hit the same answer to “rock, paper, scissors” 14 times in a row. My husband thought we were cheating haha! Gotta love the power of twins!",
   "created_utc": 1690246476,
   "score": 31,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbsbs4",
   "message": "I have all ten childhood aces. I have grandparent suicides on both sides. I have drug addicts on both sides, servere mental illness on both sides.\n\nSomehow I didn't end up dead, commit suicide, overdosed, in a ditch, or without any technical extreme mental illness. \n\nI like to think video games, and music keep me away from that stuff. \n\nDespite what my elementary school and middle school teachers might have believed. I got a college degree in Aerospace Engineering one of the hardest degree programs from a semi decent school. \n\nPretty much beat every statistic in regard to my early childhood outcomes. \n\nMake no mistake all the stuff I went through has left me emotionally crippled but I mostly get by.\n\nI just want to say thank you to everyone that's read this. I really appreciate all the kind words. Also I'm by no means thriving it's a constant battle every single day to pick myself up and get up.",
   "created_utc": 1690247832,
   "score": 226,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbe4hj",
   "message": "Made a living as a musician all my life.",
   "created_utc": 1690241482,
   "score": 67,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbowvx",
   "message": "My son used the head rest to break a window to pull 3 children out of cars in two different accidents, both driven by women in (6 children in total) exactly 3 months apart. The first accident occurred one day after he filmed “stop the bleed” training available through a local hospital. The first accident caused by speed and the SUV flipped on its roof right in front of him and he also got the Mom out. The second one caused by a man who fell asleep coming home from third shift and crossed a double yellow and hit a woman head on taking her 3 kids to school. The woman needed the jaws of life to be extracted and after getting her kids out my son checked the male driver for trauma/bleeding and held his hand until EMTs could get there. The man was life flighted to the hospital. While my son was tending to him the local fire department arrived and took off the side view mirror of my son’s car that was off the road. :/ My son is convinced that he will have to help others out of their cars in more accidents. I keep telling him that this is not common for a civilian. Super thankful he saw the training on what to do.\n\nEdit: Thank you for the sweet award. 🥰\n\nEdit: Thank you for all of the heartfelt replies and second award. We are super proud of him and thankful for his quick thinking and action to help others when in need. He is an incredible human.\n\nEdit: Thank you for the Wholesome Award. My son is the one that is so deserving of it.\n\nEdit: TLDR: My son broke windows with a headrest and pulled a total of 6 children and an adult out of cars in 2 separate accidents exactly 3 months apart. The first accident occurred one day after he filmed “Stop the Bleed” training at a local hospital.",
   "created_utc": 1690246272,
   "score": 8,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbw2yw",
   "message": "Been struck by lightning 3 times.\n\nShocking, I know.",
   "created_utc": 1690249549,
   "score": 3,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbkgvm",
   "message": "I was born on my parents' first anniversary. Both my parents have the same birthday (same day, same year). My husband and I have birthdays a day apart from each other.",
   "created_utc": 1690244259,
   "score": 2,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbyp4k",
   "message": "My friend was going to Ireland to visit her extended family for the first time and invited me along. We had a great time meeting her aunts and uncles, seeing the beautiful sights, etc. On our last night in Ireland, the family all got together for dinner, some rousing laughs, and a general awesome time. Her cousin had been traveling that week and was only in town for one night and so she and her boyfriend swung by to say hi and bye. They left for the airport to NYC and we went to sleep, getting up at 4am to catch our own flight to NYC.\n\nTwo days later, I had to be in NYC for a job interview. I wasn't familiar with the Wall St. area, so I went extra early just in case I couldn't find it. But as luck would have it, I found it with no problem and had 40 minutes to kill.\n\nI had no idea what to do, considered getting food but didn't want to risk staining my clothes or having an upset stomach or anything, so I wandered around a little until I stumbled on the Barnes \u0026amp; Noble bookstore. Thinking this was perfect, I went in and walked slowly through the store looking for somewhere to sit. There weren't any sort of private spaces on the first floor so I found the escalator and started heading up.\n\nAs I approach the halfway mark, I see a young couple going down on the escalator. As our eyes meet, we recognize each other and at the exact same time, as we both met halfway up/down the escalator, we pointed to each other and turned as we passed each other, mouths open in shock.\n\nMy Friend's Cousin and Her Boyfriend. Two nights ago I had met them for the first time and we had been laughing and sharing food and wine in her aunt's house In IRELAND. And now here we are, crossing paths exactly halfway on the escalator. A moment sooner or later and we would have completely missed each other.\n\nShe quickly came back up the escalator and we chatted about how CRAZY this coincidence was.\n\nI nailed the job interview too because I just felt this surge of Right Time Right Place-ness that meant I was supposed to be there. I was so full of confidence and optimism, I made the whole panel of interviewers laugh and talk comfortably with me and got the job!",
   "created_utc": 1690250808,
   "score": 12,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbig4d",
   "message": "My college advisor in hs did some bullshit ass calculations on his computer, flipped the screen around and it said I have a 1.34% chance of getting in to the school I wanted.\n\nGuess who made it in that bitch. And I got the degree now too.",
   "created_utc": 1690243383,
   "score": 110,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbmfru",
   "message": "I've been hit by two F5 tornadoes. Both of which hit the same house.",
   "created_utc": 1690245126,
   "score": 94,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbl406",
   "message": "i had my car stolen from work and caught the theif myself the next day.",
   "created_utc": 1690244539,
   "score": 173,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbqee5",
   "message": "1. Lost a job to the RK riots because the building literally burned down.\n2. Was on a Delta Shuttle to NYC, Tuesday morning September 11th at 830am.\n3. I could go on but those two are highlights.",
   "created_utc": 1690246977,
   "score": 61,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtc0bg1",
   "message": "Had a vasectomy.\n\nIt was only 2 hours before it all went wrong, but I was following all the post-procedure stuff: wear a jock strap, gentle icing, no lifting, no exercise, plenty of rest, etc.\n\nI was actually quite excited to sit in bed for a few days and find a show to binge, when shit started going south. \n\nWas laying in bed and had been feeling a weird twinge/pulling sensation for a bit, and finally put the tablet down to get a look down my shorts. The doctor said there might be swelling, but I wasn’t quite prepared for what I saw.  My ball sack had increased in size to about an orange and my lower abdomen was swelling as well. There was a black/blue bruise that was spreading down my leg and up into the abdomen. \n\nStarted to google stuff and had my wife call the doctor. She finally got a hold of the night attendant, and he told her it was normal.\n\nI tried to relax and get my mind off of things… but I was a bit anxious, to say the least. I checked again about an hour later… and my balls had grown to the size of a small cantaloupe. \n\nThey had swelled up so big, that my penis had been entirely engulfed—except for the foreskin—by the mass of sack around it. \n\nMy junk now looked like a furry, zombified Q-bert. \n\nI had never had a panic attack before, but my brain decided that *now* would be a good time to introduce that to my repertoire. My arm went numb, the world was spinning, I was struck by an impending sense of doom and my heart felt like it was going to beat through my chest. Thinking I was currently well along in the process of dying, I had my wife call 911. \n\nBy the time EMS got there I felt much better (Opiates), and I’m not Bill Gates, so I told them my wife would take me to the hospital. \n\nBy this time I had to pee, and all I can say about that is it’s quite an experience to have to fish your penis shaft out of your painful, grossly swollen ballsack and *just* barely get enough of the tip out to spray urine everywhere like an epileptic with a super soaker. \n\nArrived at the ER and they confirmed that yes… my “shit was fucked up.” Out of a bit of horror and pity, they gave me some morphine in my IV right after the sonogram. \n\nIn the chaos, however, I neglected to inform them I had just taken some opiate pain meds. (Not to mention I had doubled the dose considering my condition). \n\nI didn’t OD or anything, but there was lots of puking and feeling like I was falling into myself and other fun stuff I’d rather not endure again. \n\nHad to wait a bit for surgery, so they gave me some antibiotics beforehand to get that round of meds started.\n\nUnfortunately, I didn’t realize that I was allergic to Sulfa antibiotics. Nothing happened that night (thankfully) but for whatever reason Sulfas give me a male yeast infection. \n\nSo, I got to convalesce with a tube still draining blood and fluid out of my left nut, all the while my penis was covered in slime and sores. \n\nThe doctor said that the possibility of the initial complications *alone* was somewhere in the range of 0.001%, let alone the rest of that fucking nightmare.\n\nStill, at least it supplanted “live moth in my ear canal” as the #1 worst physical experience I’ve had to endure thus far in life.",
   "created_utc": 1690251614,
   "score": 69,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbr8n0",
   "message": "Had my tonsils out, twice because they grew back. Let me tell you that throwing up blood that runs down the back of your throat after surgery was an exorcist level event. I’m glad the pain pills were huge that I had to break up into smaller jagged bits.",
   "created_utc": 1690247351,
   "score": 238,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbs8an",
   "message": "I have 2.\n\n1) My car, 2 days after we bought it, was shot while I was driving in to work.  It happened in a hotel parking lot in a safe neighborhood at like 6am.\nCar and I both survived, though cops said a centimeter in and direction would have changed those results.\n\n2) I safely stole back a waist pack from a bear.\n\nDO NOT DO WHAT I DID!  It is not safe!\n\nIn summary, camping in the white mountains and a yearling has been checking out our camp.  Friends all go to the bathroom, one friend leaves her waist pack with her insulin and glucose meter in her tent.  Bear breaks into her tent, runs off with the pack.  I follow the bear.  I politely ask the bear to drop the bag.  We (the bear and I) both are surprised because the bear listens.  I then ask if I can trade the pack for a stick.  I use the stick to distract the bear and grab the pack.  The bear sits and examines the stick and VERY LUCKY NOT TO BE DEAD me takes the pack and backs away slowly.  I give my friend her slightly chewed pack with her meds so we can avoid going to the hospital.  Then we find out my friend is highly allergic to black bear spit.  She ends up in the ER anyway.",
   "created_utc": 1690247788,
   "score": 203,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbtf84",
   "message": "My son died at 11 months old for 2 1/2 minutes.  I got to hold him as he took his first breaths, hold him while he took his last breaths and then got to hold him as he took his first breaths again.  It’s something as a mother I don’t wish on anyone.  It was by far the scariest night of my life.  I’ll never forget it, New Years Eve 2007 in Fairbanks, AK.  \n\nMy son statistically was not supposed to survive the pregnancy.  I nearly lost him 3 times in the first trimester,  I started going into active labor at 20 weeks, got put on strict bed rest and then developed preeclampsia.  I also had hyperemesis through the whole pregnancy, I couldn’t even hold down water and needed daily IV fluid and nutrition.  I was 17 lbs lighter than my pre pregnancy weight when I delivered him at 39 weeks.  By all of that he shouldn’t be here now.  \n\nTo make things even weirder the doctor that kept me from losing him in my pregnancy was the doctor that treated him in Alaska.  A completely different hospital, all the way across the country from where we first met.  It felt like divine intervention to see his face and I knew deep in my soul my son was going to be ok.  \n\nMy son is a happy, healthy teenager now.  I am sitting here crying thinking about that night.   It definitely still feels like a gut punch when I think about it.",
   "created_utc": 1690248321,
   "score": 87,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbmuo4",
   "message": "When I turned 23 I met my 2 biological half brothers. The showed me a photo of them with our father and in it they’re all smiling to show how the three of them are all missing a front upper middle tooth. When I was 7 I lost my upper middle front tooth, making it all four of us.",
   "created_utc": 1690245315,
   "score": 91,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbr3hy",
   "message": "I was a heroin addict, got sober in 2015 and became a psych and addictions RN.",
   "created_utc": 1690247290,
   "score": 31,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtc5d2q",
   "message": "Husband and I visited our old hometown and went to a used book store we used to frequent. \n\nI picked up a familiar title in nostalgia and flipped it open to find a school student’s ID card.\n\nThe name and photo on the ID? \n\nMy husband. \n\nTurns out his mom had donated books to that store many years before we all moved away from that area. He must have been using it as a bookmark and forgotten. \n\nIt’s not so surprising considering we used to live in that area, but the ID was nearly 10 years old by the time we found it. \n\nThat book was sitting on the shelf for nearly a *decade* untouched, waiting for me to come along and pick it up. Bizarre.",
   "created_utc": 1690254070,
   "score": 142,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbeqk8",
   "message": "My body is a disaster of genetic luck.",
   "created_utc": 1690241752,
   "score": 85,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtblypo",
   "message": "I got married.\n\nI drove from the Golden Gate Bridge to I280 without a single red light.  Once.  Only once.",
   "created_utc": 1690244916,
   "score": 197,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbei41",
   "message": "Being 6ft tall yet getting Robert Wadlow in front of me at every concert lol",
   "created_utc": 1690241649,
   "score": 156,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbyihz",
   "message": "I have seen a white hummingbird",
   "created_utc": 1690250718,
   "score": 21,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbykwf",
   "message": "I ran into an emu with a Buick in the middle of nowhere Illinois.",
   "created_utc": 1690250751,
   "score": 160,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbrsmm",
   "message": "Got caught in a small tornado in southern California. I was about 12 years old and skateboarding in the parking lot at my Dad's work. I remember stopping for a second and noticing that all noise around me had completely stopped. No great way to describe it other than all of the normal sounds (breeze, birds, background noise) had fallen flat. It's not that noise disappeared, rather it was like the air couldn't carry sounds normally. \n\nI looked up and the sky was a yellow color, all of the overcast clouds looked as though the sun was setting even though it was in the middle of the day. Right after I noticed the color, I also saw several large pieces of light trash circling in the air above me (trash bags, chunks of cardboard, etc). Still, no noise. \n\nThen, across the wash (a cemented channel that feeds into the LA river), a large piece of corrugated roofing loudly ripped itself off of a porch in the adjacent trailer park and joined the other trash circling in the sky. That was when I booked it back across the parking lot and back into the shop bay at Dad's work. \n\nThe chunk of roofing ended up on my side of the wash. A few of the owners in adjacent bays came out to see, but don't think they saw it during its short flight. It was all said and done in probably less than thirty seconds, so I doubt it was newsworthy. \n\nMaybe not much to someone living in the Midwest, but very unusual to happen to anyone in the Los Angeles area.",
   "created_utc": 1690247595,
   "score": 132,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbruk1",
   "message": "I won over $1,200 on a $2 wager in horseracing and then less than a week later I won over $1,600 on a $6 wager. \n\nThe first was a pick 5, meaning I had to pick the winner of 5 consecutive races and the second was a pick 4 which is similar, but only 4 races. \n\n[I actually have proof too.](http://imgur.com/a/XjsM482)",
   "created_utc": 1690247620,
   "score": 151,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbttx5",
   "message": "I've survived over 10 overdoses. 4 years free of heroin",
   "created_utc": 1690248506,
   "score": 184,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbrbk4",
   "message": "I attended my ex-husband’s widow’s wedding reception when she got remarried yet didn’t realize how odd that was until long after I came home.",
   "created_utc": 1690247386,
   "score": 6,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbw6nk",
   "message": "Many years ago I had a terrible day where my then GF broke up with me, then I did terribly in a final exam for a college class, then I lost my wallet, and finally, as I was doing the Charlie Brown sad walk back home some random branch broke off a tree as I was walking on the sidewalk underneath it and the damn thing fell on top of me and hit me square across the shoulder and knocked me to the ground. I just burst out laughing because it was so ridiculous.",
   "created_utc": 1690249596,
   "score": 11,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbtkrt",
   "message": "Yesterday, we went to woodman's grocery store where we bumped into a family that are friends.  Ok, not that improbable.  \n\nBut then we went to aldi's, I wanted something only they sell, but that is the second grocery store.  Bumped into the same family, weird.\n\nAfterward, we went to Lowes, and now I am getting a little freaked out, but the same family was there also shopping. \n\nThis is all in the course of 4 hours in northwest chicago area, so it's a big area.  Not some small rural town.",
   "created_utc": 1690248390,
   "score": 28,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbeop1",
   "message": "Heterochromia",
   "created_utc": 1690241730,
   "score": 143,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbxhdo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbs5cy",
   "message": "Met my husband shortly after I moved to a new town. He had moved there about a month earlier. Found out on our first date that we lived about four blocks away from each other - I'd picked a restaurant close to my house if I needed to bail. We both walked to our first date.\n\nI'm sure he thought I was a drama Queen at first, two of my friends died within two weeks of each other (I was mid 30s, both were 40 or under). He called for our second date while I was shopping for a funeral dress (she was very stylish, so we dressed to the nines). He called for our third date while I was still processing the sudden death of a dear friend that morning. Bless him, he assessed the situation, asked if I still wanted to go do something in a few days (I said yes, but I couldn't make decisions right now, so could he just plan something), he said \"yep, do you need to talk?\" I said no, and he said \"I will let you know when I figure something out, I'm so sorry,\" then hung up. He did exactly what I asked him to do in the moment and took all the pressure off about his part of my situation. Now he's sitting in our living room with a cat in his lap.\n\n♥️",
   "created_utc": 1690247753,
   "score": 254,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtboo22",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbe7lo",
   "message": "Having the combination of red hair and blue eyes; the rarest combination in the world, at just a 0.17% chance.",
   "created_utc": 1690241520,
   "score": 95,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbuv27",
   "message": "My hand eye coordination is horrible, I can't hit where I aim no matter what. My husband and I were throwing leftover water balloons at each other when miracles of miracles.  I aimed for his chest and hit his groin, as he was doubled  over screaming in pain I let another one fly. That one landed in his wide open mouth perfectly.  I was so proud of myself!",
   "created_utc": 1690248981,
   "score": 94,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbs4g1",
   "message": "I've accidentally walked into a riot on 3 separate occasions in my life.",
   "created_utc": 1690247741,
   "score": 170,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbs6xr",
   "message": "I have a very rare type of cancer. It is about 3% chance relative to other cancers of the same nature. It is metastasized which is about 1% or less chance of this type of cancer.\n\nI also won $20 on the last 3 scratch and win lottery games I got for various Christmas and birthday gifts.",
   "created_utc": 1690247772,
   "score": 192,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbfyzt",
   "message": "We were making dinner once and there was a large knife on the counter with part of the handle hanging over the edge.  My ex put his hand down on the handle, it flew up in the air, flipped and landed pointy side down, directly in my big toe.",
   "created_utc": 1690242294,
   "score": 246,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbgapn",
   "message": "Crossing a grassy area near my home one night I dropped my keys, but only realized it when I felt for them in my pocket so I could unlock the street entrance to my building.\n\nI walked back to the grassy area and felt around with my foot at a spot where I remembered fumbling for something in my pocket. I found the keys in less than a minute! Seemed to be a miracle!",
   "created_utc": 1690242437,
   "score": 84,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbppp4",
   "message": "I was on a train that derailed.",
   "created_utc": 1690246648,
   "score": 133,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbu3m9",
   "message": "As a child I was approached by a stranger in a car asking me if I wanted to go to a circus with her. All the '80s stranger-danger training came in handy and I biked away as fast as I could.  \n\nMore recently I looked up the stats on children being kidnapped by strangers.  It's something absurdly low, like less than 1%.",
   "created_utc": 1690248632,
   "score": 78,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbw4xh",
   "message": "I once met a guy who had been born on the same day as me, at the same hospital, and we both had similar birth names (his name was the first four of my name). We also weighed the same, and we found out later that we were born within minutes (if I was 12:02 he was 12:00 type close) of each other. Also we were both born six week early. Same color eyes and hair. Our moms worked at the same Walmart, and that’s how we met. (We lost contact a year or so after his mom quit) \n\nSometimes I remember that kid and wonder  how the fuck did that happen and how the fuck did we meet? Idk the stats on any of that but it’s gotta be pretty damn low",
   "created_utc": 1690249574,
   "score": 2,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtby34r",
   "message": "My mom is 14 years older than her sister.\nHer sister (my aunt) is 14 years older than me.\nI am 14 years older than my niece (daughter of said aunt).\nMy niece is 14 years older than my daughter.\n(Eta- COUSIN not niece 🤦🏼‍♀️)",
   "created_utc": 1690250509,
   "score": 51,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtc7gr7",
   "message": "Broke free of a 10 year addiction to meth. Took a very long time to feel some kind of normal again. 10 years clean this year, woohoo\n\nEdit. \n\nThanks for the kind words",
   "created_utc": 1690255143,
   "score": 6,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbgkl9",
   "message": "Was in an ER that crashed while taking me to the hospital. The thing is, they were driving me from another crash in which I got badly hurt.",
   "created_utc": 1690242557,
   "score": 70,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbthg2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbo0cy",
   "message": "Not me, but my sister had my niece at a really unique time. \n\nHer first child, a girl, born on the same day as our maternal grandmother's first child who was a girl (My aunt). Born at the exact same time of night as my sister, who was my mother's first child, a girl.",
   "created_utc": 1690245844,
   "score": 49,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtc5ffr",
   "message": "My mom gave birth to me after sudden onset of labor at 37weeks and 6 days gestation, had a c-section because I was breech, born at 9:48 AM. \n\nI gave birth to my child after sudden onset of labor at 37weeks and 6 days gestation, had a c-section because my daughter was breech, born at 9:48 AM. \n\nSeems statistically improbable to me but maybe not super odd.",
   "created_utc": 1690254104,
   "score": 193,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbsmaj",
   "message": "My brother, my husband, and I were all among the first IVF babies 30+ years ago. (Not sure exactly how close to first we all are. I think that the ectopic pregnancy my mom had before my brother and me was among the first 50 IVF pregnancies.)\n\nI'm sure this kind of thing will be more common with gen z and gen alpha, but considering how early we all were, it was kind of a surprise for my husband and I to find out that we were both IVF.",
   "created_utc": 1690247962,
   "score": 99,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbjb5c",
   "message": "Born with a third nipple.",
   "created_utc": 1690243758,
   "score": 220,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbu26w",
   "message": "I was driving to a friend's house when a huge tree fell on the road. My car passed under it as it was falling, so as soon as I could pull over I called the emergency services and messaged my friend to say I would be late.\n\nWhen I got to his house, I found that his girlfriend's mum was in the car behind and the tree fell on her car. Luckily she only had minor injuries but one tree almost took us both out.",
   "created_utc": 1690248614,
   "score": 85,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbm7jv",
   "message": "Hit the lottery",
   "created_utc": 1690245026,
   "score": 133,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbpots",
   "message": "My alcoholic husband, my two kids and I had to move in with my alcoholic MIL\nJust as she was telling me and the kids we had to move out, I was able to buy a home through a program KCMO had at the time with Wells Fargo. I qualified for $15,000 down payment, free. Didn't have to pay taxes on it or anything. It saved mine and my kids lives, and I was able to provide them with a stable home.\nI was nearly homeless with two kids.",
   "created_utc": 1690246637,
   "score": 247,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbk1zm",
   "message": "Waking up in the early AM to first responders knocking on the door because someone gave the wrong address to 911, twice. And this was at two separate addresses\n\nCops for a domestic abuse call in 2018 (turns out neighbor was shouting at their dog for going into the trash)\n\nEMS for someone who fell and can’t get up in 2022",
   "created_utc": 1690244081,
   "score": 26,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbry08",
   "message": "Flipped a coin over a wooden floor in a gymnasium.  The coin rolled into a gap between 2 slats. Held up by the wood it stopped rolling, and stayed there... standing straight up on its edge.\n\nTLDR; Heads, tails, or edge.  I flipped edge.",
   "created_utc": 1690247663,
   "score": 51,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbp5yh",
   "message": "I've been pooped on by a bird. Getting pooped on by a bird has roughly a chance of 1 in 5 million. HOWEVER... I think the chances of WHERE I was pooped on make the probability ratio even larger. See... I had a seagull poop and the poop landed PERFECTLY on the breast pocket of the polo shirt I was wearing that day. I have refused to eat at the Ivar's on the Seattle waterfront for decades now.\n\nEdit: guys, I'm just going by what I googled. I was more going to the part of where the poop landed that was more of the insane odds bit.",
   "created_utc": 1690246391,
   "score": 32,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbt1hp",
   "message": "I stepped in bear shit on my wedding day. Twice.",
   "created_utc": 1690248149,
   "score": 73,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbnfoe",
   "message": "I have grey eyes.",
   "created_utc": 1690245576,
   "score": 136,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbrduq",
   "message": "Found a Tal Rasha amulet in the normal difficulty in the game Diablo 2. Technicaly i had higher chances of getting hit by lightning.\n\nI had a 1:8000000 chance. *possible error*\n\nEdit: \n\nActually since i got it from a normal difficultly hell bovine its 1:3528051,  i think the other calculator was wrong.",
   "created_utc": 1690247416,
   "score": 174,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbulpc",
   "message": "My dad had a heart attack, wasn’t breathing with no heartbeat for like fifteen minutes, was in a coma for a week and a half and is now alive and well today, two years later.",
   "created_utc": 1690248865,
   "score": 53,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbz0t9",
   "message": "A bird shit in my mouth. I had the car door barely open, while my boyfriend pumped gas, was mid sentence when a bird flew under the awning and shit at the perfect angle to go through the barely open door, right into my mouth.  Gross.",
   "created_utc": 1690250968,
   "score": 55,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbt2g5",
   "message": "Won an Oscar. Only a few thousand ever awarded.",
   "created_utc": 1690248161,
   "score": 96,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbomnr",
   "message": "I don't know what the statistics are, but two of my three exes were Starbuck's baristas with seizure disorders.",
   "created_utc": 1690246140,
   "score": 113,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbmtkb",
   "message": "My stepson was born the same day as my father. My stepsons father was born the same day as my mother. My daughter was born the same day as her gran dmother  who she was named after before my wife got pregnant.",
   "created_utc": 1690245300,
   "score": 55,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbwap3",
   "message": "I had a baby die inside me at 36 weeks (9 months). Still had to have a delivery and birth and then funeral.",
   "created_utc": 1690249650,
   "score": 34,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbxcu9",
   "message": "I was \"swimming\" about 20 yards away from shore where it is about 15 feet deep in lake Erie (water is a little cloudy) with my glasses on so I can see.  A wave runner rushes past and the wake knocks off my glasses.  I make a few dives.  Try and mark my location with landmarks.  Swim to shore, explain what happened and ask people if they have a mask or goggles I can borrow.  Someone does loan me their goggles.  I swim out and dive about 20 times.  I decide I am going to take two more dives then end it and drive home to Chicago without being able to see.  I go down and a bass swims under me.  I decide to follow it since I had never been so close to one other than fishing.  It swam over my glasses.  I shoot to the surface with my glasses in my hand.  The beach erupts in cheers - apparently the word got out.  I was ELATED and stayed to camp and party with my friends (mostly old and a few new).",
   "created_utc": 1690250156,
   "score": 210,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtcbluj",
   "message": "First got cancer in 1993. \n\nIn 2003, they told me to get my affairs in order, I had 6 months.\n\nIn 2021, they told me it's spread to my bones and lungs. They gave me 5 years.\n\nIn 2023, two years down and feeling about 90%",
   "created_utc": 1690257311,
   "score": 29,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbxp64",
   "message": "My friend had two sets of monochorionic-monoamniotic twins--the rarest kind of twins--in back-to-back pregnancies. Identical twins that share the same amniotic sac and same placenta. \"Mono-Mono\" or \"MoMo\" twins happen in about 1% of identical twin pregnancies, and less than 0.1% of all pregnancies.",
   "created_utc": 1690250322,
   "score": 213,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtc0dov",
   "message": "High school drop-out with a Masters Degree.  Read somewhere duting my career that 1/2 of 1% of high school drop-outs get an Associates Degree.",
   "created_utc": 1690251644,
   "score": 94,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtc6rzn",
   "message": "[removed]",
   "created_utc": 1690254793,
   "score": 45,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbukea",
   "message": "I accidentally caught a guitar pick at a My Chemical Romance concert 12 years ago. I was standing there and had my hand at my side with my fingers kinda half way to a fist. I felt something hit my hand, looked down and it was just there. It was at the amphitheater in Bonner Springs KS so not a small crowd either",
   "created_utc": 1690248849,
   "score": 179,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtcn7q8",
   "message": "I got a degree after aging out of foster care ☺️",
   "created_utc": 1690264622,
   "score": 51,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbu34o",
   "message": "I got married and had a kid. Several fertility doctors told the wife and I it would never happen. Due to issues with both of us. So we moved on with our lives. Well the universe has a funny sense of humor",
   "created_utc": 1690248626,
   "score": 61,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtceym9",
   "message": "I was contacted by the FBI in regards to a criminal on the most wanted list.\n\nThere were so many coincidences in our lives that the agents thought that I had to know where he was. They grilled me for a couple of hours trying to get information, but I had never heard of the guy.\n\nIncredible since:\n\nWe lived two streets apart as kids, attended the same elementary, middle, and high schools, and were members of the same church.\n(He was 3 years older than me so we never met at school, and his family attended church during a different time slot).\n\n\nWe both studied French at the same university. As language tutors, we worked in the same office and had the same boss and general phone number.\n(The age difference kept us from ever meeting, and he switched from French to Business before I got there).\n\n\nWe both did a church missionary service in the same part of France, and even lived at the same address twice.\n(Our time in France never overlapped, and those mission apartments changed tenants every couple of months).\n\n\nWhen we both lived in Salt Lake, we lived in the same (large) apartment complex.\n\n\nHe robbed an armored car outside of a movie theater on a Monday morning, getting away with a lot of cash and murdering the driver. I was working the overnight shift at a grocery store (from Sunday night to Monday morning) on that exact morning. The theater and the grocery store shared a parking lot.\n\nEvery 6 months or so, the FBI checks in with me.\n\nFor the curious, [HERE'S THE GUY](https://www.fbi.gov/wanted/murders/jason-derek-brown/person-view)",
   "created_utc": 1690259227,
   "score": 109,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtcn180",
   "message": "Not an exciting life or death incident, but something rather sweet:\n\nI took care of my late father for the final two years of his life. He had Alzheimer’s and pulmonary fibrosis, among other issues, so we had a lot more bad days than good. In the summer of 2019, I took my dad out for a “date” one day to a historic old drugstore that has phenomenal milkshakes (one of his favorite foods in the world). It was one of Dad’s increasingly rare good days, where he chatted merrily with me about all sorts of old memories. I felt like I had my dad’s former self back for just a little while. We had such a wonderful time that I intended to take him there again soon. However, this ended up being our last “date.” \n\nFor most of the remainder of that year, Dad declined too much (mentally and physically) for me to take him out for anything other than very short grocery trips or to appointments. The following year . . . enter the pandemic. It was a very, very rough year with Dad. In January of 2021, my father died, alone, in a hospital in another state (our state ran out of hospital beds and he had suffered a traumatic fall that required hospitalization). That day in 2019 ended up being the last truly happy day I had with my Dad and the last fun outing he ever got to experience.\n\nThree months after my dad died, I met a wonderful man online. (Nine days after signing up for a one year membership, because “surely it’s going to take time to find someone truly compatible with a shy nerd like me!”) A few months later, we decided to try a first date. He lived three hours away, but wanted me to be comfortable, so he volunteered to drive to my town for the date. He looked online for an appealing restaurant to suggest, and excitedly told me about this really neat historic drugstore we could go to. . . . \n\nWe went on a very crowded day (local festival — oops) and had to wait quite a while for a table. The waitress sat us at the EXACT same table where I sat with my dad nearly two years earlier! I was even in the same seat. \n\nThree months later, we got engaged at that drugstore. \n\nSo the beginning of the end of one chapter of my life crossed paths with the beginning of the best (so far) chapters. My husband and I have since decided to make a trip back there at least once a year. Dad really would have loved my husband.",
   "created_utc": 1690264491,
   "score": 220,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtc7zdv",
   "message": "I was almost murdered in a case of mistaken identity. \n\nA guy came chasing after my car on the highway, waving his gun out the window.  He eventually got in front of me, blocking my car, and stopped his car and got out.  He came right up to my Window, pointed the gun right at my head, looked me in the eyes and said \"Sorry.  Wrong chick\", then got back in his car and drove away. \n\nI still have no idea who he was or who the \"right chick\" was.",
   "created_utc": 1690255400,
   "score": 42,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtciu2f",
   "message": "Years back, my best friend and I went swimming at a lake. He was so excited to get in the water that he left his phone and wallet in his pocket and lost both. It sucked, the lake gets deep quickly and is very muddy. We looked and looked, but water was too deep and it gets scary deep in lakes!\n\nAnywho, I’d say a month-ish went by, and we were swimming at the lake again, and being the smart ass friend I am, I dove down to find some lake trash and tell him I found his wallet, but it’s like a soda can or something. (Har har har bad joke, but I’m a bad friend) \n\nInstead, what happened went like:\n\nMe: bobbing around looking for stuff with my toes along the bottom of the lake (it’s pretty deep).\n\nI touch something, and my blood runs cold cause it’s super scary to touch things in water. But this joke will happen, no matter how lame. \n\nI grab it with my long toes, a neat skill I have. Very dexterous. \n\nI hand the trash from my toes to my hand, and swim up for air, holding the trash above me so that it dramatically surfaces first. \n\nAs my ears emerge from the water, I hear my friend say “are you fucking with me?” I look in my hand overhead and I am unbeknownst to myself triumphantly holding up my friends lost wallet.  \n\nIt was goddamn uncanny.",
   "created_utc": 1690261638,
   "score": 38,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtc97pa",
   "message": "I was hit in a crosswalk 2x as a pedestrian by the same person. The incidents were 4 years apart and in different states.",
   "created_utc": 1690256032,
   "score": 25,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtc38bx",
   "message": "When I was a teenager I picked up a hitchhiker and then a few years later the same guy picked me up when I was walking after I ran out of gas. Never saw him before or after those two occasions.",
   "created_utc": 1690252987,
   "score": 240,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtbv6wo",
   "message": "Got shot in the thigh, bullet went between My bone and an artery. A little to one side and My leg would've been amputated, a little to the other side and I wouldn't be here or on Reddit.",
   "created_utc": 1690249131,
   "score": 105,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtcqael",
   "message": "Posted this before on an old account but years ago I was having a really stressful time in life with finances and just shit hitting the fan in general. My friend suggest I go to a small hike which leads up to a an empty clearing at the top and scream as loud as I can letting it all out. Anyways I climb for about 2 hours to the top of a small summit nearby and scream my loudest like a fucking lunatic and in doing so dislocated my jaw …..and then the pain made me pass out….. and when I passed out I hit my head on a bunch of rocks and broke my arm- had to be helicoptered down when a group found me and thought I was dead, it cost me 5000 for the helicopter ride to the hospital.",
   "created_utc": 1690266922,
   "score": 110,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtc5ej7",
   "message": "Started dating a woman about a year after my divorce.  After dating for about four months I learned  that the man my ex was dating had the same last name as my girlfriend.  No relation and not a super common name.  We ended up marrying our respective SOs, so my ex wife and current wife essentially swapped last names.",
   "created_utc": 1690254091,
   "score": 97,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtc5cuw",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "158quvr"
  },
  {
   "comment_id": "jtcrkux",
   "message": "I was driving with the windows down and my friend was riding shotgun telling me about his friend, nicknamed Bird, who’s death anniversary it was. We stopped at a red light and a feather flew into the car and landed on his arm that has a feather tattooed for his friend.",
   "created_utc": 1690267912,
   "score": 91,
   "submission_id": "158quvr"
  }
 ]
}