{
 "submission_id": "159p5kk",
 "title": "Bisexual people of reddit: What are some noticeable differences between dating men and women?",
 "selftext": "",
 "created_utc": 1690328428,
 "permalink": "/r/AskReddit/comments/159p5kk/bisexual_people_of_reddit_what_are_some/",
 "score": 159,
 "url": "https://www.reddit.com/r/AskReddit/comments/159p5kk/bisexual_people_of_reddit_what_are_some/",
 "comments": [
  {
   "comment_id": "jtguc9z",
   "message": "Men are so sexually aggressive I have a three date no sex rule because I need to see how they respond to that. If I tell them up front my rule and they push for sex those three dates, I know they're gonna be a sex pest. I orgasm with women more, they are more focused on giving pleasure and taking the P in V off the table makes it soooo different and generally better. \n\nWomen are difficult to communicate with. They can be very indirect, they have a tendency to let problems build up until they're almost impossible to solve, and they have higher expectations. It's socially easier with men because they are more go with the flow. \n\nBiphobia manifests as the automatic demand for a threesome with men. It's far worse with women. I've heard the most toxic, slut shaming, misogynistic crap come out of gold star lesbians mouths.",
   "created_utc": 1690336146,
   "score": 254,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth4w0i",
   "message": "Overall:\n\nFor me the women have been more... and I hate to use this word but it's appropriate... clingy but at the same time they tend to communicate with poetry and limericks and riddles and shit. \n\nMen tend to be more... nonchalant while at the same time... needy. \n\nSex wise: \n\nWomen are more intimate and passionate and fuck like they are in love with you. \n\nMen are more rough and passionate and fuck like it's the last nut they'll ever bust. \n\n\nUgh. Love 'em.",
   "created_utc": 1690341396,
   "score": 180,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgdkfb",
   "message": "With women you have to find one who doesn't have all these insecurities that get in the way of enjoying life \n\nWith men you have to find one who cleans their asshole properly",
   "created_utc": 1690328714,
   "score": 131,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth0m34",
   "message": "this might be a me problem, but i find it incredibly hard to discern whether a girl is flirting with me or just being friendly. i worry a lot about coming off as creepy and i’m very afraid to misinterpret. i wish i could just confidently approach cute girls, but i’m always afraid they’ll be straight and mortified. that said, it is fun to compliment girls. but i’m always afraid of misinterpreting. \n\nwith men, i don’t have that fear because i reap the benefits of social norms. i find flirting with men to be much more natural as a result. but i’m attracted to so few and far between when it comes to men that i barely do it. i am incredibly selective, whereas i find many, many women attractive. this factor made me think i was a lesbian for a long time because my attraction to men is so incidental. but i still very much am bi. \n\npersonalities i like vary across gender, too. i like girls who are extroverted and more social than me. i tend to be into men who aren’t quiet per se, but don’t feel the need to be the center of attention. i like sweet, gentle men and women who would naturally draw me out of my shell. i also feel that my attraction to women is very superficial, whereas my attraction to men seems to be fueled by personality predominantly. it seems like i’m into a very specific personality type with men. \n\nbiphobia has been a particular torture for me, especially internally. i’ve gone back and forth that i’m straight or gay countless times, but the truth is, my attraction transcends gender. i’ve been like this my entire life. i would stare at pictures of aaron carter and hilary duff. i would get crushes on my boy and girl classmates in elementary school. i used to wish i was one or the other, but these days i feel very lucky to experience life like this.",
   "created_utc": 1690339180,
   "score": 59,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgoeze",
   "message": "A bisexual friend raved about how incredibly low the bar is with most women for being The Most Awesome Person They've Ever Dated. The expectations of women who've only dated straight men are insanely low.",
   "created_utc": 1690333485,
   "score": 103,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth3yf3",
   "message": "Men in my experience reply more, and even meet up for dates more ofter.",
   "created_utc": 1690340924,
   "score": 86,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgeund",
   "message": "Women smell better, usually",
   "created_utc": 1690329262,
   "score": 166,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgjw2y",
   "message": "I'm biSEXUAL. I don't date men. I have sex with them. I date women.",
   "created_utc": 1690331447,
   "score": 153,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgdecu",
   "message": "They're both equally hard to handle\nJust gave up at this point lol",
   "created_utc": 1690328644,
   "score": 166,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth1gqv",
   "message": "I only dated women at first. I was never insecure about my body until i had started to date men. I was never insecure about my boobs until I had dated a man. Every man I've dated has made a negative comment on my appearance while women don't do the same things. Men care more about how their partner looks than women do in general.",
   "created_utc": 1690339612,
   "score": 174,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgme6j",
   "message": "Men has a penis and girls has a potina.",
   "created_utc": 1690332548,
   "score": 58,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth2n1y",
   "message": "boobies/no boobies",
   "created_utc": 1690340215,
   "score": 65,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth1xox",
   "message": "I only hook up with girls, but will date guys.",
   "created_utc": 1690339843,
   "score": 15,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgkva7",
   "message": " Penus",
   "created_utc": 1690331869,
   "score": 238,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtgdd2r",
   "message": "Been more open with my wife",
   "created_utc": 1690328628,
   "score": 247,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth88d0",
   "message": "Boys have a penis, girls have a vagina.",
   "created_utc": 1690343060,
   "score": 239,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jth65k4",
   "message": "The penis",
   "created_utc": 1690342014,
   "score": 237,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthcjpk",
   "message": "Penis.",
   "created_utc": 1690345414,
   "score": 237,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthmpxv",
   "message": "Bi dude here.\n\nGay dudes don't give a fuck if I'm Bi.\n\n60% of girls are super uncomfortable with it and don't really understand what being Bi is. 20% are into it but like weirdly so, and the rest are cool normal humans about it.\n\nThat's just my experience.",
   "created_utc": 1690351934,
   "score": 82,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthgtyh",
   "message": "For me personally, the men I’ve dated weren’t very good at taking care of themselves (housework/chores/etc.). Maybe it’s just my poor luck with men, but it seems like there’s a large number of them who just don’t know how to function, and I always end up with one. Don’t get me wrong, some of them were great guys, and I still talk to a few of them as friends, but it’s exhausting having to act as a second mother of sorts. \n\nAs far as women go, I did have better luck across the board (taking care of themselves, communication, etc.), although my exes and I parted ways on a mutual basis for various reasons (wanted different things in life, things just didn’t work out, all that jazz). The most difficult part though was figuring out whether or not we were flirting or just being friends. It took about a year for my very first gf to figure out that I liked her, and even then, I had to outright say it for her to believe me!",
   "created_utc": 1690347988,
   "score": 227,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthj1mh",
   "message": "In bed, I would not expect a woman to just kiss me for a few seconds and then try to shove, say, her hand into my foof.",
   "created_utc": 1690349417,
   "score": 214,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthostv",
   "message": "(As a man) I have more in common with the dudes typically (taste in media, sense of humor, hobbies, etc), but women are prettier and tend to be more emotionally “in-tune” (for better or worse lmao). I appreciate both obviously. With a dude it feels more like a good friend that I have the bonus of being romantic with. With women it’s more like the romantic aspects of the relationship are front stage (which carries its own merit), and we may not have as much in common in terms of what we’re doing when not on dates/fucking/etc, but makes up for that in different ways.\n\nImportant to note that your mileage may vary. I’m not the most experienced person in the world, but this is just what I’ve observed so far…\n\nAlso (as others have said) men tend to be more forward and there’s far less ambiguity. They will tell you if upset, etc (and I know, “not ALL women”, but it’s a trope for a reason imo having experienced both)",
   "created_utc": 1690353446,
   "score": 112,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthuipy",
   "message": "Women are super cagey at first and then fiercely possessive. Guys are super nonchalant at first and then get kinda needy",
   "created_utc": 1690357806,
   "score": 109,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthm3rw",
   "message": "Sounds like a wild rollercoaster of love and nut-busting adventures!",
   "created_utc": 1690351496,
   "score": 7,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthj81s",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthk08h",
   "message": " P pp p",
   "created_utc": 1690350047,
   "score": 244,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthp663",
   "message": "Honestly in my experience it’s pretty much the same, just that it’s different due to the different partner",
   "created_utc": 1690353719,
   "score": 13,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthwi9y",
   "message": "Lesbian relationships can be very fast paced and toxic",
   "created_utc": 1690359364,
   "score": 9,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthxd2n",
   "message": "Dating men is a pain in the ass ;)",
   "created_utc": 1690360033,
   "score": 41,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthxhik",
   "message": "Women are more emotionally in-tune. They pick up on stuff guys don't. It's pretty great most of the time but can be frustrating. Also they are prettier. \nMen get jealous more often which is good in a healthy amount because it makes me feel wanted but excessive jealousy is rly annoying.",
   "created_utc": 1690360134,
   "score": 39,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthxhrm",
   "message": "Being bisexual Is like picking icecream: there Is chocolate and there Is strawberry Watch one has it's goods",
   "created_utc": 1690360139,
   "score": 2,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jti1t2i",
   "message": "guys move fast sexually and just want to smash and pass ASAP. gay girls move fast emotionally and want to U-HAUL after the first date. as someone who’s highly reserved and likes taking things slowly, dating is a fucking nightmare on both sides for me lol\n\nusing dating apps as a bi person is funny because the straight men I see are all normie joe schmoes and then the queer women and nbs are like…. goth cowboys and witches and shit lol. i feel so terribly uncool around other queer women 🥲\n\nalso nerdy queer girls are waaaay more palatable than nerdy straight guys 💀",
   "created_utc": 1690363556,
   "score": 228,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jti0i8x",
   "message": "In my experience as a bisexual male that likes to wait a while with sex in relationships. I can say that most girls seem to appreciate it. And it makes the first time with each other amazing.\n\nGuys on the other hand seem to be way more inpatient and get frustrated when they're not getting sex after 2 weeks in a relationship.\n\nThis however, is a good first test when getting to really know someone.",
   "created_utc": 1690362528,
   "score": 22,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jti4n8g",
   "message": "As a bi man-\n\nMen are a lot less work, it's much, much easier to meet men and have sex, they are likely to take initiative more. The sex is not transactional and often more impersonal. You can expect not to stay the night unless you're already dating. \nAlso everything women say about men is correct - being weird about condoms, choking you without asking, bring selfish with pleasure, etc. Not to say it's bad, especially as a man as well I don't have a problem standing up for myself, but it does happen a lot.\n\nWomen are more work - many (most) want you to take the lead, make the approach, carry the conversation, be funny, take the initiative with dates, make the first move etc. There is a lot of gender based expectations.\nSex is more straightforward, no extra prep needed and everything is designed to fit easily, staying the night is much more likely.",
   "created_utc": 1690365756,
   "score": 73,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jti404g",
   "message": "The natural body smells. You can literally smell the difference in hormones",
   "created_utc": 1690365265,
   "score": 48,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthz7ms",
   "message": "Getting laid with a guy is wayyy easier than with women\n\nBut getting a quality date, equally difficult.",
   "created_utc": 1690361506,
   "score": 34,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jti0nni",
   "message": "My personal experience (bi trans woman) is rather limited, since I have rather specific kinks, but overall what I can say:\n- with women I usually find it a lot easier to have an emotional connection, at least in my case I feel like they tend to be interested in me as a person, and things don't have to be sexual right away (if at all), which I greatly appreciate.\n- most men I meet usually are interested on a pure sexual level, and anything else comes after that, if at all. Also they usually are rather bad at communicating emotion or wishes/needs. Either they're completely quiet and barely communicate at all, or they're weird and creepy about it. \n\nThat's not to say all men are bad or anything, in fact I date more men than women, these are just trends I personally noticed.",
   "created_utc": 1690362647,
   "score": 24,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jti5jur",
   "message": "Honestly the biggest difference is that in a straight relationship, it feels like there's a particular way it's \"supposed\" to go. Regardless of whether or not you follow or even care about the rules, you're still both very *aware* of them.\n\n\nMeanwhile, even in the most stereotypical queer relationship you can find, it feels like you're making everything up as you go along.",
   "created_utc": 1690366429,
   "score": 24,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtiacn9",
   "message": "I live in a small, very old, very conservative town. So the biggest difference for me is that one is actually feasible.",
   "created_utc": 1690369723,
   "score": 15,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtic2ez",
   "message": "In my experience as a bi male, sex on the first date is much more of an expectation among gay/bi men than with straight/bi women.",
   "created_utc": 1690370780,
   "score": 7,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtifxnn",
   "message": "The flesh from men tastes better",
   "created_utc": 1690372996,
   "score": 5,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jthzcy4",
   "message": "For men, the connection is based on how good the sex is and for women, the connection is based on how well you meet their emotional needs. That’s my experience anyway.",
   "created_utc": 1690361619,
   "score": 15,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jti1qsn",
   "message": "Both myself and my wife are bisexual but she is the only woman that I've been with and I'm the only guy that she has been with most of our community is bisexual as well for me I notice that most the guys I'm with are for lust there are a few guys that I have more attractive feelings for and wouldn't mind being married to but lust is still a major factor in our relationships I enjoy hard sex with other guys both top and bottom while with my wife I like to be gentle and more romantic. \nI asked my wife and her response was that she liked being with other women when she is looking for lust as well she said that she feels that there are certain things that men can't satisfy that a woman can she also says that being with me is more romantic than being with other women.",
   "created_utc": 1690363506,
   "score": 2,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jti8zs7",
   "message": "Dating women is much easy, they look for the qualities that make a person worth hanging out with and I find it easier to talk to them if I am even interested in them.   \n\n\nMen....so far am yet to find a single man who has treated me well.Most times they don't even want to know me, or see how I look like, but straight ask for my dick pic. \n\nmost judge for the way I look, they don't want to have conversations or any form of intellectual foreplay, direct to \"what do you do on bed\" \"this is what I want on bed\"..even if its just sex...its never about \"what do you want out of this\"..quite selfish, I know not all men are like that but grindr has made me lose faith in men and when women say men are trash, I know exactly what that sis is talking about.",
   "created_utc": 1690368845,
   "score": 15,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jti9dsi",
   "message": "I’m gonna guess: genitalia.",
   "created_utc": 1690369099,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jti5cx1",
   "message": "Masculinity and real dick",
   "created_utc": 1690366282,
   "score": 0,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jti9alb",
   "message": "It depends on whenever you're dating a femboy or a regular girl.",
   "created_utc": 1690369042,
   "score": 255,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtihvx0",
   "message": "I feel like men are harder to get to know on a first date - they typically won't talk about deep or emotionally charged / transformative events of their life, they like to talk about achievements and hobbies / interests which tends to result in a more surface level conversation. At the end of it they feel like a deep and meaningful conversation was had and they're ready for sex, meanwhile I feel like I just had a friendly chat and a round of pool with a stranger at the pub for 30 minutes and feel no emotional attachment whatsoever. \n\nAs a woman I just feel like other women are better at conversation and emotional connection, even with people we have just met. I am bisexual and demisexual which means I need an emotional connection to feel sexual attraction; men are harder to date because they push for physical intimacy faster and emotional intimacy is never there. Whereas women will happily wait for sex and have weeks/months of conversation and dates, it feels like they genuinely are just enjoying getting to know me and not holding their breath for sex the whole time.",
   "created_utc": 1690374040,
   "score": 12,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtii1te",
   "message": "Women: Clingy poets, men: Needy nut-busters. Love 'em! 😂💕",
   "created_utc": 1690374126,
   "score": 6,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtiiftm",
   "message": "With guys, I end up submissive by default. With women, I end up dominant somehow. And I don’t just mean in the bedroom, but not in a controlling way. It’s hard to explain. It’s like “the dominant personality” in the relationship; the leader, the decision maker, the protector, etc. \n\nWhen I’m with a guy, I want him to lead (this isn’t the same as him being controlling). When it’s a woman, I want to lead.",
   "created_utc": 1690374326,
   "score": 7,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtijnnv",
   "message": "They both suck and my hand does a better job than both ever could",
   "created_utc": 1690374954,
   "score": 5,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtikfnd",
   "message": "men have better open communication, women are better at giving affection",
   "created_utc": 1690375341,
   "score": 2,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtirbi8",
   "message": "The penis and the vagina are 2 completely different beasts.",
   "created_utc": 1690378536,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtire85",
   "message": "Woman here. Married to a man in a polyamorous relationship. \n\nMen have simpler needs, but are more aggressive about them. It’s rare for me to meet a man that actually stays in touch with me throughout an evening to check what I’m in the mood for. Instead they just go for it using trial-and-error, which is okay if the chemistry is there, (still not optimal though and definitely a turn-off) but absolutely horrifying if I’m not into him. Men are easier if I just want a quick fuck, though. Men are also more the same in regards to humor and what they are attracted to, so once I started figuring that out, going on dates and leaving a good impression felt pretty easy. I’m introverted, I play games and spend a lot of time on Reddit, and for some reason that’s all I have to say for most guys to start being real charming. Men are much scarier to turn down, though. I always prepare myself for a bit of a shitstorm when I send the final text, saying I’m not interested in meeting again. It’s 50/50. My husband is the exception to these things though, hence why I can’t get enough of him.\n\nWomen are way more individualistic with their needs, interests and humor, so I always get a bit more quiet around them because I know I have to get to know them better than I do the men, in order to actually make an impression. At the same time I’m also more relaxed, because I know I’m not in any danger at all. Women are very in touch with not only their own wishes for the night, but they ask about mine as well. They communicate so brilliantly. I’ve also definitely had the more intellectually interesting conversations with women, because they have that much more personality. I feel much more in control when I’m with women as well. There’s no arbitrary rules about who’s to initiate something, which is also a breath of fresh air, so we need to cooperate much more. It feels much more even between us that way.\n\nIn short, when I’m with men the spotlight is on me. When I’m with women, I put the spotlight on them. This is a broad generalization, though.",
   "created_utc": 1690378569,
   "score": 1,
   "submission_id": "159p5kk"
  },
  {
   "comment_id": "jtirj0h",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "159p5kk"
  }
 ]
}