{
 "submission_id": "15b0g3d",
 "title": "How do you forgive the unforgivable?",
 "selftext": "",
 "created_utc": 1690460475,
 "permalink": "/r/AskReddit/comments/15b0g3d/how_do_you_forgive_the_unforgivable/",
 "score": 122,
 "url": "https://www.reddit.com/r/AskReddit/comments/15b0g3d/how_do_you_forgive_the_unforgivable/",
 "comments": [
  {
   "comment_id": "jtnngdw",
   "message": "You don't have to forgive everything but it's your responsibility to take yourself to a safer place where the unforgivable won't happen again.",
   "created_utc": 1690462006,
   "score": 105,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnku13",
   "message": "There is a difference between forgiveness and moving on.",
   "created_utc": 1690460696,
   "score": 202,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnnzhb",
   "message": "You don't. If you do then, by definition, it wasn't unforgivable.",
   "created_utc": 1690462259,
   "score": 58,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnl73a",
   "message": "You can’t",
   "created_utc": 1690460881,
   "score": 34,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnms8b",
   "message": "you make it get you a chicken sandwich and some waffle fries",
   "created_utc": 1690461680,
   "score": 12,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnufs8",
   "message": "Man so many people on Reddit are so bitter.\n\nIf you don’t forgive them you’re allowing them to punish you twice. You’re letting them win.\n\nYou don’t have to like someone, say anything nice about them or ever surround yourself with them again. It’s probably advised that you don’t.\n\nSo, how?\nI get it. I’ve been betrayed by girlfriends, business partners, you name it.\nIt’s one of the hardest things to do, all I would recommend is to avoid suppressing the hatred \u0026amp; anger. Express it. Anger is energy and can be an incredible motivator to get in shape, work on a project, start a business etc.\n\nAs long as you don’t suppress it then time will take it away. Give it 6-12 months.",
   "created_utc": 1690465154,
   "score": 27,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnpk0x",
   "message": "You don’t. You don’t have to forgive anything. Forgiving doesn’t mean you forget what they did but you’re never obligated to forgive anyone for anything.",
   "created_utc": 1690462994,
   "score": 10,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnv6oj",
   "message": "There is no obligation for you to do that, it's not your responsibility to forgive what cannot be forgiven. \n\nI tried to do that in my lifetime due to previous religious beliefs and then general guilt and it tore me apart because it is simply against my nature to give in to the cruelty of what happened to me and excuse it as if it didn't impact me majorly. \n\nForgiveness to me, means giving up on how deeply it affected me, it means giving power to the perpetrator who did me wrong, it means invalidating my hurt, my pain, my experiences that were soured by all of my trauma, nah I think the fuck not. I'll keep my hatred in my heart for my abuser. \n\nAnd if when I die and God proves to be real and he asks me, \"Why didn't you forgive?\" I'll say, \"Why did you let it happen?\" And take my ass promptly downstairs cos he doesn't deserve my company. What a dick.",
   "created_utc": 1690465472,
   "score": 6,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtntcbf",
   "message": "That's the neat part, you don't!",
   "created_utc": 1690464678,
   "score": 6,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto9lt1",
   "message": "A therapist told me once in a group therapy session that forgiveness has to come from yourself, not from anyone else. Sometimes, you feel that you need someone to apologize or take some action for us to forgive them, but sometimes we need to reconcile something that was done by someone who is dead or otherwise inaccessible. Sometimes, we need to reconcile with someone who just doesn't have it in them to apologize. \n\nForgiveness is much more effective if you think of it as a vehicle for you to let go of the idea of being hurt unjustly.",
   "created_utc": 1690471125,
   "score": 5,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnlbtq",
   "message": "I've heard people say that you forgive someone for yourself, not for them. \n\nThat's bullshit. You don't forgive the unforgivable. You move on and try not to think about it.",
   "created_utc": 1690460947,
   "score": 25,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto05oz",
   "message": "Frankly, sometimes forgiving is super hard. We hold on to the hurt and don't let go.  It has a hold on our heats and minds and how we interreact with others and view the world.  In America, I feel its viewed as 2 way.  You apologize, I forgive.  Forgiveness isn't a 2 way street though....its one.  You chose to forgive whether or not the offender apologizes.  Sometimes the offender won't apologize or never will.  You however can forgive and let go of the hold it has on you.  \n\n  \nTo directly answer your question of how to do this...its a choice in your heart.  You say I chose to forgive.  The hurt may still have a 99.9% hold on your heart, but the seed is planted.  You have to actively combat the hurt when it pops up saying \"they hurt me\" and respond \"yes they did, but i choose to forgive\" or \"you owe nothing to them\" with \"they hurt very deeply, I do owe nothing to them, but I still choose to forgive\".  Forgiveness is a process and very rarely is it a 1 stop decision.  Its a muscle.\n\nPeople forgive for heinous things like a parent forgiving a drunk driver from killing their child.  Or a spouse running a marriage to the ground and leaving the other spouse's life in shambles.  There were even some holocaust survivors that forgave the perpetrators.\n\nOn forgiving perpetrators of the Holocaust, Holocaust survivor Eva Kor on forgiving an 93 former Auschwitz guard at his trial in 2015:\n\n\"My forgiveness ... has nothing to do with the perpetrator, has nothing to do with any religion, it is my act of self-healing, self-liberation and self-empowerment,\"\n\n\u0026amp;#x200B;\n\nIf you deeply hurt, I hope you heal.",
   "created_utc": 1690467501,
   "score": 3,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto0l52",
   "message": "Forgiveness isn't about the other person, it's about giving yourself the peace you need to move on.\n\nToo many people think forgive = absolve. It doesn't.\n\nForgiveness is a mental process where you decide that you aren't going to be affected anymore. That can take years and may need a lot of therapy to accomplish. But don't get hung up on the \"others\".",
   "created_utc": 1690467668,
   "score": 3,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtntq24",
   "message": "If they’re unforgivable why do you want to? There’s no need to forgive them.",
   "created_utc": 1690464849,
   "score": 2,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnxo2n",
   "message": "You can't and don't, you just have to move on and process it until your mind stabilises",
   "created_utc": 1690466497,
   "score": 2,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto06id",
   "message": "You don't, either accept it as part of the road or change paths.",
   "created_utc": 1690467510,
   "score": 2,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto462g",
   "message": "forgive but never forget brother",
   "created_utc": 1690469053,
   "score": 2,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto5rye",
   "message": "You can forgive somebody, but that doesn’t mean you have to invite them to thanksgiving dinner. It’s for you, not them.",
   "created_utc": 1690469669,
   "score": 2,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto5tpo",
   "message": "I saw a sentence somewhere that says \"don't forgive them because they deserve it, forgive them because you deserve to be peaceful\" it's not word for word but it definitely changed my view on life and made it easier",
   "created_utc": 1690469687,
   "score": 2,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto86bo",
   "message": "just move on. You dont have to forgive anyone. Just learn the lesson and apply it to your life.  No contact or 'amends' are even needed. be kind to yourself.",
   "created_utc": 1690470582,
   "score": 2,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnza8r",
   "message": "Holding a grudge or hating someone is like drinking poison and expecting the other person to be hurt, so you should forgive them for your own sake, if not for theirs.",
   "created_utc": 1690467153,
   "score": 2,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnqs0r",
   "message": "Understand you are not hurting them by refusing to forgive, even if you have the best reasons not to forgive. No effect on them whatsoever, it may in fact give them pleasure that you don't forgive them, other than that, no effect on them really. Now understand that not forgiving is hurting you. You are the one in pain, not the un-forgiven. It hurts you, and possibly some of the people near you that you care about. That's all it does. It doesn't change anything except how much pain you, and by proxy those close to you, are feeling.\n\n***You don't forgive evil as a favor to evil, you do it as a favor to yourself.***",
   "created_utc": 1690463548,
   "score": 3,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtojr9a",
   "message": "I recommend looking into stoicism. Letting go of things you are not able to control is more powerful than holding on to vengeance or malice. By allowing whoever wronged you to remain in your head, you are giving them control over your mind.\n\nIf you are asking because you are trying to salvage a relationship, ask yourself if you can even try to do that before dealing with your feelings, or else things will always be turbulent down the line.\n\nIn many cases, forgiveness is not an option. When it comes to your inner peace, it is better to accept that you can not change or fix everything and keep moving forward.",
   "created_utc": 1690474873,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtojcf3",
   "message": "Religious answer here, but for me, I had to pray that God would let me see the person (who murdered a family member) the way that God sees them. In time, I was able to feel sorry for them and for how they got to the point in their life that they were willing to do that. And I think I can say I’ve forgiven them. But that doesn’t mean I have an ongoing relationship or trust with them, either.",
   "created_utc": 1690474723,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnxp41",
   "message": "Find the blessings in it......",
   "created_utc": 1690466508,
   "score": 0,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnkmhx",
   "message": "you don't, dumbass",
   "created_utc": 1690460589,
   "score": 253,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnmqz1",
   "message": "What do you consider unforgivable?",
   "created_utc": 1690461663,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnp5g3",
   "message": "By its very definition, you can not.\n\nYou forgive the “very hard to forgive” through state of mind, and effort.",
   "created_utc": 1690462804,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnpqm8",
   "message": "By definition that is an oxymoron. The answer is ... you can't.       \n\nIf you remove hyperbole from the question I would say that forgiveness is a three step process.   \n\n1. An apology\n2. Augmentation of previous behaviors\n3. Maintenance of augmentation of previous behaviors       \n\nPeople generally do step one and bring the waterworks and promises. Steps two and three don't happen over night. You have to prove yourself over time. I'm not Jesus. I'll watch you do what you do before any type of forgiveness or reconciliation.",
   "created_utc": 1690463077,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnq8x5",
   "message": "You don't. You don't have to forgive everything.",
   "created_utc": 1690463309,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnq9if",
   "message": "You don't, just move on.",
   "created_utc": 1690463315,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnqdae",
   "message": "sometimes you don't.",
   "created_utc": 1690463363,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnqfqe",
   "message": "By definition, you don't.",
   "created_utc": 1690463393,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnrevy",
   "message": "Don’t forgive. Go your own way.",
   "created_utc": 1690463834,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnrili",
   "message": "Depends on the unforgivable.\n\nIf it is truly unforgivable, you don't.\n\nYou need to figure out how to get past the unforgivable event/act/person without it consuming you. That doesn't mean you forgive them. It just means that you stop letting them live in your head rent free.",
   "created_utc": 1690463881,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnrof4",
   "message": "You don't.  Why would you need to?  Just move on and don't look back.",
   "created_utc": 1690463953,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnrvw0",
   "message": "The same way I walk the unwalkable or swim the unswimmable. I can't do the undoable.",
   "created_utc": 1690464043,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtns0qv",
   "message": "By forgetting about it.",
   "created_utc": 1690464101,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnsuhh",
   "message": "You don't.",
   "created_utc": 1690464463,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnsur4",
   "message": "If it was Crucio or Imperio, you can at least try to forgive, but how can you forgive Avada Kedavra if you're dead?",
   "created_utc": 1690464466,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnsuz8",
   "message": "Forgiveness is for myself, not to mute your feelings of guilt. \nIf I deem what you did unforgivable, you can go the rest of your life with the guilt of knowing what you did. My forgiveness is not REQUIRED. You can wallow in knowing you’ve done something terrible, I hope it cripples you forever.",
   "created_utc": 1690464469,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtntxgx",
   "message": "Forget but never forgive\n\n-Lucille Bluth",
   "created_utc": 1690464938,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnvvto",
   "message": "By realizing their punishment is being themselves for all eternity.",
   "created_utc": 1690465763,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnwjmw",
   "message": "The same way you move an immovable object or stop an unstoppable force?",
   "created_utc": 1690466038,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnwp6x",
   "message": "You forgive the unforgivable by remembering it's for you, not them. It's for your own sanity and how you live the rest of your life. It's not saying they're OK. It's very difficult.",
   "created_utc": 1690466100,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnwvr0",
   "message": "You don't. Hence the term \"unforgivable.\"",
   "created_utc": 1690466176,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnxt4t",
   "message": "You don't. You don't owe forgiveness to anyone.\n\nAnd you don't even owe anyone a chance to apologize. Hot take, I know, but I don't need to listen to someone try to explain himself or say \"I'm sorry IF\" or \"I'm sorry you feel that way,\" etc. Those are conditional, non-apologies and I don't need to even risk hearing one just to offer someone an opportunity to make themselves feel better.\n\nYou owe yourself a chance to move on and define how things work. That doesn't always mean to forgive and/or forget.",
   "created_utc": 1690466556,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnxtv7",
   "message": "When you put it that way…",
   "created_utc": 1690466564,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtny398",
   "message": "It's impossible otherwise it's forgivable",
   "created_utc": 1690466671,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnym3o",
   "message": "That's the trick, you don't have to.  \nDon't have to let it control you either.",
   "created_utc": 1690466883,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnynnl",
   "message": "By letting go and moving on",
   "created_utc": 1690466901,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnyueb",
   "message": "50 robux",
   "created_utc": 1690466976,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnz1z0",
   "message": "Buddy I don't even forgive most forgivable stuff.",
   "created_utc": 1690467060,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnzhe3",
   "message": "Forgive? Hardly.\n\nI curse their name every night.",
   "created_utc": 1690467232,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtnzoum",
   "message": "You don't. You don't have to.   \n\n\nYou forgive yourself. For falling for it, for being a part of it, whatever the case may be. You promise yourself you will never participate in that action.   \n\n\nYou don't have to forgive anything, but you do need to give yourself grace and figure out what is best for you.",
   "created_utc": 1690467314,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto04pf",
   "message": "You Dont... Let time pass... Depending on how they act in the next years they may deserve another chance... But you will never forgive what they did... You will learn with it and grow with it...",
   "created_utc": 1690467490,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto0ln1",
   "message": "You don't.   If you can forgive whatever the wrong doing was then it is not unforgivable.",
   "created_utc": 1690467673,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto1e62",
   "message": "You have no obligation to forgive but you also can move on.\n\nI was bullied in school by someone, not awfully but I truly hated him. 8 years later and do I forgive him? No. Have I moved on? Yes.\n\nHe might be a great person now, I know I have changed a lot in those 8 years and he might have too. If he came to me with regret, telling me he was sorry then I would tell him to just move on with his life, I have no intention on forgiving him but I also don't hold the resentment. Time has gone by, what's done is done and I don't want him in my life and he doesn't need me in his.\n\nWith all this said, this applies to me too.\n\nWhen I was 11 I bullied this girl badly. She didn't deserve it and I regret what I did every time I think about it. I haven't apologized because would she even want that, as stated, I wouldn't. I wouldn't expect her to forgive me and I don't deserve it. But I know I have moved on and grown as a person and would change it if I could but I can't.",
   "created_utc": 1690467982,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto1eux",
   "message": "This!!",
   "created_utc": 1690467989,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto1trp",
   "message": "Learn to forgive it for your peace. Which just means learning to let go of it.",
   "created_utc": 1690468151,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto29h0",
   "message": "You don't forgive the deed, but sometimes it's possible to forgive the person for being so damaged that they did that thing. (Or at least to forgive the person you imagine they might have been, had they not been so damaged.)",
   "created_utc": 1690468321,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto2du9",
   "message": "You can never actually forgive, you just cope with it or else youll end up a bitter person for the rest of your life.",
   "created_utc": 1690468368,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto2feb",
   "message": "Nuremberg style mf",
   "created_utc": 1690468385,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto2i3w",
   "message": "Forgiveness is understanding.\n\nYou can seek to understand how something happened yet still bring forth a consequence that ensures the offense will not happen again. \n\nForgiveness does not mean free from consequence of their actions.",
   "created_utc": 1690468414,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto2lbn",
   "message": "Watching MIB to forgive unforgivable",
   "created_utc": 1690468448,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto2p7a",
   "message": "By forgiving the unforgivable",
   "created_utc": 1690468490,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto2pch",
   "message": "Thanks. I guess its time for me to rewatch these. https://youtu.be/0dJu1Jj7VTw",
   "created_utc": 1690468492,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto312k",
   "message": "Ghost them and take mushrooms about it",
   "created_utc": 1690468616,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto4kx7",
   "message": "“Forgiveness is key to every door…”   GD",
   "created_utc": 1690469212,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto4ncm",
   "message": "Forgiveness comes from a place of understanding that the other person is in pain, even if they don't know it or they don't admit it. A person at peace doesn't hurt others.\n\nBut you forgive for yourself so you don't have to live with the pain of being hurt.\n\nIt really depends what you are looking for though. You can forgive, talk, internalize and move on together. Or forgive, learn your lesson and let them go.",
   "created_utc": 1690469238,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto5p9y",
   "message": "You learn to accept.  You are not obligated to forgive, but you don't have to hold onto the negative feelings.  \n\nAcceptance and moving past it is for you, letting go is for you.",
   "created_utc": 1690469641,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto6a38",
   "message": "DON’T.",
   "created_utc": 1690469862,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto6m1o",
   "message": "you don’t. you move on. however sometimes you have to forgive for yourself not for the person you’re forgiving or what you lose. forgive so YOU can heal.",
   "created_utc": 1690469988,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto7wff",
   "message": "You should forgive them not because they deserve it, but so that you can feel peace",
   "created_utc": 1690470479,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto9f53",
   "message": "Jesus said it best turn the other cheek.",
   "created_utc": 1690471055,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto9hq5",
   "message": "I mean personal it its not forgivable dont forgive them and just move on not worth the time or effort to give a fuck if its not forgivable",
   "created_utc": 1690471081,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto9izu",
   "message": "If you’re Christian this might help: I would pray about someone who did something unforgivable to me asking God to let me see them from His eyes. I know that God loves His creation and wants us to forgive as Jesus did, so sometime I just need Him to help me see my “enemy” the way He sees them.",
   "created_utc": 1690471095,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto9kvy",
   "message": " “Forgiveness does not change the past, but it does enlarge the future.” – Paul Boose\n\nYou learn to forgive, but you don't forget. You forgive because you're doing yourself a favor by letting go of the pain that the person caused you. You forgive, so you don't carry baggage with you that might affect your future. Don't be a prisoner of hate; let go because you can be at peace in your own way.\n\nIt's their own action anyway; your **reaction** is what's important. \n\n*So hold your ground and channel the pain to be better, not bitte*r.\n\n\" If there's a will, there's a way.\"",
   "created_utc": 1690471114,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto9onl",
   "message": "You... don't?",
   "created_utc": 1690471154,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jto9sni",
   "message": "With an itheberg.\n\n\nWait wrong joke.",
   "created_utc": 1690471196,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoa5em",
   "message": "You may not be able to, but you can outgrow your anger about it.",
   "created_utc": 1690471325,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoatdv",
   "message": "I simply don't. Why would I forgive unforgivable?? Not sure what makes anyone think that everything should be forgiven.",
   "created_utc": 1690471573,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoatjy",
   "message": "You don’t",
   "created_utc": 1690471575,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoaxsa",
   "message": "The first step in forgiveness is admitting you aren't ready to forgive.",
   "created_utc": 1690471619,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoazuh",
   "message": "You don't.",
   "created_utc": 1690471640,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtobol4",
   "message": "realize it's not got the person you're forgiving but for yourself",
   "created_utc": 1690471896,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoc4dv",
   "message": "Like the meme says \"That's the neat part, you don't!\".",
   "created_utc": 1690472060,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtocdxq",
   "message": "I did something unforgivable and now my best friend is dead. I'm probably going to kill myself. Not today but, as the years drag on eventually I don't think I'll be able to take it anymore.",
   "created_utc": 1690472157,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtocytw",
   "message": "Depends on what you mean by \"forgive\" though.  You can forgive someone in your mind, which means you aren't carrying the burden of anger at them, but still cut that person out of your life and have nothing to do with them.  \n\nBut if \"forgive\" means \"act as though it never happened and resume the relationship as if the unforgivable act never happened\" that's not really forgiveness as much as it is a kind of deliberate and selective amnesia.  \n\nAs others have said, you forgive because it unburdens YOU, not because it excuses or erases what someone else did.  \n\nThere's a corny old saying I've always liked regarding grudges:  \"Carrying a grudge is like drinking poison and hoping the other person dies.\"  So don't nurse or feed that grudge.  \n\nLiving well is truly the best revenge.",
   "created_utc": 1690472372,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtodbrq",
   "message": "That's the neat part.  \nYou don't.",
   "created_utc": 1690472506,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtofmuu",
   "message": "I don't.\n\nI will stop keeping a grudge for I don't wanna die of a hear tattack but I will not forgive.\n\nYou f\\*cked up = You f\\*cked up period.",
   "created_utc": 1690473356,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtogptl",
   "message": "you don’t, just move on",
   "created_utc": 1690473753,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoi215",
   "message": "Some shit isn't meant to be forgiven.  It's meant to be learned from, grown away from and moved on from.",
   "created_utc": 1690474247,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoifd0",
   "message": "By definition you don’t.",
   "created_utc": 1690474384,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoirmz",
   "message": "Easy cut them out of my life. If I encounter them, just act neutral and indifferent.",
   "created_utc": 1690474511,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoiyto",
   "message": "Amnesia",
   "created_utc": 1690474585,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtojwt7",
   "message": "You just… try. \n\nIt’s not easy, but forgiving the unforgivable is one of the best things you can do. You can forgive, but you don’t have to forget. Yet forgiving is giving second chance. Or a third chance. Or as many chances that unforgivable person needs.\n\nYou can always let go of it, and move on. But moving on without forgiving still leaves the person without a choice. \n\nForgiving someone is not only letting yourself move on, but giving them that choice to move on, too.",
   "created_utc": 1690474930,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtok7xi",
   "message": "You recognize they can never pay you back. Then you stop expecting them to pay you back. You forgive their debt. \n\nIt does not make what they did ok. It does not make them good people. \n\nThen you move on. Every time you remember what happened and feel hurt you tell yourself you are no longer expecting repayment",
   "created_utc": 1690475043,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jton04q",
   "message": "Depends on what is unforgivable. If it is an affair, that is either through marriage counseling and therapy, or a breakup. if it is betrayal of a friend, you either talk it out after giving it some time, or you part ways. If it is severe like murder, that might not be forgiveable. in fact in that case forgiveness is rare and respectable. But if unforgiving is from something simply on your end, you have to do some self-reflecting.",
   "created_utc": 1690476067,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jton5fm",
   "message": "You don't, because, by definition, it's unforgivable.\n\nOr are you asking how to forgive the truly heinous?\n\nThis article helped me to clarify some things: [https://www.franciscanmedia.org/st-anthony-messenger/november-2017/how-can-i-forgive-him/](https://www.franciscanmedia.org/st-anthony-messenger/november-2017/how-can-i-forgive-him/)\n\nIt is entirely possible to forgive without reconciling.",
   "created_utc": 1690476121,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtonaa8",
   "message": "Why would you?",
   "created_utc": 1690476169,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoni9w",
   "message": "I ask myself this question each and every day, on several matters in my life.\n  \nThe only thing I can say is sometimes it easy to believe that what you are doing is good and just, or what you are about to do isn't that bad or you deserve it; until you get into that position and see from the inside out that 'benevolence and cruelty are simply different shades of the same colour' or that you were being selfish. \n  \nIt took me a while to find my way out, but it is a longer climb still to figure out what it means to truly forgive. I can't forget, I have tried.",
   "created_utc": 1690476250,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoo20o",
   "message": "Forgive for your sake, not for their sake. Forgiveness has been so important in my life. The more I forgive, the easier it is to control my feelings and emotions.",
   "created_utc": 1690476449,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoo21k",
   "message": "You don't.",
   "created_utc": 1690476449,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoo4mn",
   "message": "With an itheberg.",
   "created_utc": 1690476476,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoq7xq",
   "message": "Personally, I don't. I never really believed in forgive and forget, at most I believe in \"Sometimes forgive but always remember\" unless you're talking about a truly innocent mistake on someone else's part.\n\n\nIf what was done against you was bad enough and/or those who harmed you showed no true remorse, then forgiveness is pointless. I don't think forgiveness is a necessary component to moving on.",
   "created_utc": 1690477238,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoqxq8",
   "message": "Make a choice. You can either tolerate what it is or choose not to.\n\nI‘ve termed it my misery quotient, just how much misery am I going to allow in my life from someone else’s behavior, opinions, influence, ill treatment, or what I consider bad behavior?",
   "created_utc": 1690477500,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtorzsz",
   "message": "There is only learning how to live with it",
   "created_utc": 1690477882,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtot0od",
   "message": "If you love someone enough you forgive and move on 🤷‍♀️",
   "created_utc": 1690478256,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtotozj",
   "message": "You dont! Why the hell would you even want to forgive the unforgivable?",
   "created_utc": 1690478502,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtousz6",
   "message": "Morph into a power ranger, pose infront of them, and they explode.",
   "created_utc": 1690478902,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtouvi7",
   "message": "You don't👍",
   "created_utc": 1690478927,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtov8n1",
   "message": "The trick is to surrender to the flow.",
   "created_utc": 1690479060,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtovi2l",
   "message": "When you forgive people do it for you, it's not for them",
   "created_utc": 1690479157,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtovuds",
   "message": "I can hear the gears grinding between your ears, Jayden.",
   "created_utc": 1690479282,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtownza",
   "message": "Why was the first thing I thought of the curses from Harry Potter?",
   "created_utc": 1690479585,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtowq90",
   "message": "That's the neat part, you don't. People aren't entitled to your forgiveness. I have a short list of people I'd never forgive for different things they've done.",
   "created_utc": 1690479608,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoxg32",
   "message": "I forgive easily but actually it’s a big problem for me because often I shouldn’t. Sometimes the other person needs to accept accountability and face the consequences of their actions.",
   "created_utc": 1690479872,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoxpe4",
   "message": "Forgiveness is not manadatory or a necessity.",
   "created_utc": 1690479967,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtoxv65",
   "message": "I learned that forgiveness is this “I understand how a person who has experienced what you have experienced might find themselves capable of that”.  It’s establishing a tiny speck of empathy for how screwed up a person would have to be to do what they did.\n\nThen, you leave it there.  You saw it clearly and you leave it there.  No “forget”, no “now we continue like normal”, just a big dose of “I get it, and now I’m going to head out”.",
   "created_utc": 1690480026,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtp1vfo",
   "message": "You don't have to forgive. It's a myth that you have to forgive anyone.",
   "created_utc": 1690481513,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtp220s",
   "message": "Revenge.",
   "created_utc": 1690481582,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtp2rt4",
   "message": "find Jesus",
   "created_utc": 1690481862,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtp33tw",
   "message": "I did not understand all this 'forgiveness' balls until I listened to a guy on the radio. He explained that not forgiving an offence injures *you* and not the offender. It makes you bitter. If you *forgive* them. You are telling them they are nobody and fuck off. I think that works.",
   "created_utc": 1690481997,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtp4rjc",
   "message": "You forgive so that you can put the baggage down, not for the people you're forgiving.  Never forget, though.  Setup good boundaries and enforce them.  It's ok to be done with horrible people and situations.  Move forward with your life without them.",
   "created_utc": 1690482647,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtp546f",
   "message": "Kind of hard for me to move past it when I'm still living in it.",
   "created_utc": 1690482774,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtp5zkg",
   "message": "Thinks I think are unforgiveable or at least intolerable most people just accept such as injustice, bad faith, corruption, not even attempting to be honest, zero regard for others rights or privacy, destroying lives based on perceived hierarchy or ideology.\n\nThe list goes on. \n\nI think in the end its not about forgiving its about making sure the above abuses are minimised in our society and an attitude from the ruling elite down that they realise this is truly the way to a better society. Unfortunately we are a million miles away from that and heading in the wrong direction.",
   "created_utc": 1690483099,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtp6btk",
   "message": "I start by focusing on what I can control instead of what I can’t. Forgiveness is for me, not the person who harmed me, \u0026amp; it doesn’t mean I flip a switch and suddenly don’t feel anger or pain over the situation. \n\nIf my attitude is that I “can’t” let go of something, then I’m choosing to keep carrying it. Walking around with deep, gut-wrenching resentments, no matter how justified, will only hurt me - like drinking poison and expecting the other person to die. By doing so, I surrender my present life to whatever/whoever harmed me. \n\nFor me, the process of forgiveness is not a once and done occurrence, but a conscious way of moving forward in life based on what is most important to me rather than on what is the most painful. Being human, it’s often 3 steps forward and 2 steps back.",
   "created_utc": 1690483228,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtp6ma9",
   "message": "I don’t. God forgives, I don’t",
   "created_utc": 1690483337,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtp6uqx",
   "message": "i was wondering the same thing bc i just got betrayed by two friends of mine on roblox but i think that’s different",
   "created_utc": 1690483425,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtp91dg",
   "message": "What is this, a riddle?",
   "created_utc": 1690484250,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtpalus",
   "message": "Realize that someone doing something against you is likely the result of something happening to them at a prior date, or a situation they’re in. Not saying it’s at all okay to mismanage those emotions and take them out on others, but just realize that nobody is perfect and we all have at least one tremendous struggle. If I want people to forgive me when I make tragic mistakes, even if it’s a reoccurring offense, I have to be willing to forgive the offenses of others, even if they are reoccurring. Life is too short for that shit, I wish I made peace with my mother before she died. Regardless of what she did to me, my emotions being hurt can’t hold a candle to the pain I feel knowing she died on bad terms with me. Completely irreversible and I’d do anything to have one more conversation.",
   "created_utc": 1690484849,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtpb2ad",
   "message": "From a distance. Forgive the person, but do NOT let them back into your life under any circumstances.",
   "created_utc": 1690485024,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtpb3j0",
   "message": "You don't have to forgive. \n\nThe idea that we should forgive those that wronged us stems from Christianity as far as I know. Even as a staunch Atheist I can say it's one of the best aspects of the Christian religion. \n\nSometimes people don't deserve your forgiveness, they only deserve your silence. Is it \"good\" to forgive for your own mental well being / soul ? Sometimes yes, sometimes no.",
   "created_utc": 1690485038,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtpbk9a",
   "message": "You don't. That's what unforgivable means",
   "created_utc": 1690485216,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtpccvl",
   "message": "why should you (given it is truly unforgivable)? not everything is worthy of forgiveness.",
   "created_utc": 1690485521,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtpd4en",
   "message": "Forgiveness is hard, but I'll start by forgiving my alarm clock for waking me up early every morning.",
   "created_utc": 1690485809,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtpe1th",
   "message": "Sometimes you just don’t. And despite what people say that is something that is ok given certain wrongsz",
   "created_utc": 1690486157,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtpe9q3",
   "message": "Maybe I'm being too literal here, but the way your question is worded the only answer is \"you can't\"",
   "created_utc": 1690486239,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtpf4mj",
   "message": "Forgiveness is about you. It releases the anger and hurt from you so it doesn’t eat you up inside. It’s  not as if they get away with anything. Gotta place boundaries on their behavior to be sure it never happens again.",
   "created_utc": 1690486564,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtpfsvp",
   "message": "You forgive so that you can work towards healing the pain and moving on with your life, otherwise you're just hurting yourself.",
   "created_utc": 1690486816,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtpftye",
   "message": "If they deserve forgiveness then it's easy to forgive.",
   "created_utc": 1690486828,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtpg318",
   "message": "Waffle fries and a Dr Pepper. FOR FREE",
   "created_utc": 1690486922,
   "score": 1,
   "submission_id": "15b0g3d"
  },
  {
   "comment_id": "jtpg3ox",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15b0g3d"
  }
 ]
}