{
 "submission_id": "15b153r",
 "title": "What is the worst job you had?",
 "selftext": "",
 "created_utc": 1690462434,
 "permalink": "/r/AskReddit/comments/15b153r/what_is_the_worst_job_you_had/",
 "score": 115,
 "url": "https://www.reddit.com/r/AskReddit/comments/15b153r/what_is_the_worst_job_you_had/",
 "comments": [
  {
   "comment_id": "jtnsoqm",
   "message": "Restaurant Manager\n\nIf we were slow, it was the most boring job ever. If we were busy, there wasn't enough of me to be everywhere I needed to be. Then there's the dreaded \"table 55 wants to see you\". fuuuuuuuuuuuckkkk\n\nThen the company had a contracted company to do \"secret shopper\" and come in to eat and rate everything. One of their questions was \"did the manager talk to you while you were there\". A 'no' meant you were gonna get bitched at and told that part of our job is to walk around and check on every guest. Also, everything else would fall onto you, even if their complaints were with the server or something out of your control. If it went bad, the boss would talk to you, complain, try to tell you what you need to do better, etc. If it went perfect? Doesn't matter, straight into the trash. They only focused on the negative.\n\nAlso I'd get in \"trouble\" for some of the dumbest shit ever. Turn someone away at 11:59(we closet at midnight)? They call the number and talk to our district manager. Let a customer in at 11:59? The server now hates you. The Kitchen staff flips the fuck out on you and it's just a disaster.\n\nI made good money for my early 20s, but I hated it.",
   "created_utc": 1690464392,
   "score": 57,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnp57g",
   "message": "Telephone marketing selling advertisements. I lasted one day.",
   "created_utc": 1690462801,
   "score": 64,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnu6ef",
   "message": "Oh oh oh orielly auto parts \n\nManager was a Dick, customers sucked, pay was Jesus Christ terrible, and WHY DO YOU WANNA BUY AN ITEM THAT IS $1 AND PAY WITH A GOD DAMN $100 BILL AND ACT LIKE I DONT SEE THAT FUCKING $5 BILL IN THERE",
   "created_utc": 1690465043,
   "score": 34,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnzbnb",
   "message": "IT guy at Chase.  The whole team was Indian, managers were Indian, and non-Indians are not welcome.  They wouldn't even speak English, as to cut you out of the project work completely, written up , then fired. This was in Ohio, USA.  Chase's own money laundering software caught leadership taking bribes from Indian consulting firms.  It's a labor workforce nightmare.",
   "created_utc": 1690467168,
   "score": 28,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnoygh",
   "message": "Working at a childcare centre that didn’t treat children with… care",
   "created_utc": 1690462712,
   "score": 23,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto68v5",
   "message": "I worked in a cash vault for a major armored transport company. I’ve never seen more money in my entire life. I stood in a vault with almost 200m dollars. \n\n**It was living hell.**\n\nMoney is *absolutely fucking disgusting*. Blood, body fluids, disgusting unidentifiable rot. I would have dust a few millimeters thick at my station after only 2-3 hours of running currency through a counting machine. COVID face masks was easy for me to adopt after this job. I had to wear a mask and change it every 4 hours at work because it would get clogged up with dust coming off the money. \n\nThey also don’t tell you working in this environment that the counting machines are so loud you risk hearing loss. You weren’t allowed to have a phone with you, because you might take photos of confidential bank numbers. So no music was allowed unless it was a 2012 iPod nano basically. \n\nI was barely paid $12/hr but workweeks were 75 hours minimum. Break times were heavily monitored. You were strip searched every time you entered and exited the building to prevent anyone from sneaking money out. If the bank count was off, everyone was detained and the balance had to be rectified. I had to wait at work for 8 hours once because someone accidentally put 101 bills in a strap that was only supposed to have 100. unpaid. \n\nThis lead to coworkers hating each other because virtually any mistake, minor or huge, directly impacted everyone. Fistfights would regularly break out between people in the cash vault, once two people who were armed with pistols by requirement got into a fight and we were terrified they’d pull their guns and shoot each other it got so bad. \n\nBosses actively assumed everyone was stealing, and treated you horrendously. \n\nFuck that noise. I got a job offer, got out, and I’ve never looked back. I may not really love my office job, but thank fucking god it’s not that cash vault.",
   "created_utc": 1690469849,
   "score": 24,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnw4wb",
   "message": "Currently working as an Occupational therapist and maybe the best paying job yet for me to date, but it's the worst by far. It's is boring af and the nursing home setting is unpleasant/depressing with being surrounded by old dying people. Had more fun working retail actually lol",
   "created_utc": 1690465868,
   "score": 14,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnwf12",
   "message": "Easter bunny at the shady mall",
   "created_utc": 1690465985,
   "score": 13,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnxlix",
   "message": "Door to door perfume salesman.  The pitch was that the perfume I was selling was the exact same from the manufacturer, Obsession, Chanel, Pier Cardin, etc, BUT with our bottles.  This made the expensive perfumes you love cheaper to make, and we pass the savings to you.\nI was there probably 1 month.  Didn't sell a single bottle, and we only got paid if we sold a bottle.  One day I showed up to work, and the office was shut down.  They vacated the premises.\n\nDoor to door encyclopedia salesman, just before the internet boom.  Not Britannica, some knockoff no name brand encyclopedia.  No sales.\n\nDebt collection.\n\nAppointment setter calling out on a ROTARY phone, all.  day.  long.",
   "created_utc": 1690466469,
   "score": 9,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto42sm",
   "message": "UPS night shift loader. No air flow. July heat loading packages by hand in a truck. Every day I went in saying to myself I was going to quit. Next thing I know I was top sorter running the shift during the sort and months had gone by. Dudes I worked with were great. Turned out to be a decent college job.",
   "created_utc": 1690469018,
   "score": 9,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto7k5a",
   "message": "I'm a Pharmacist.  First few years were wonderful, but now, it's hellish all the time. People trying to get meds filled before the refill date. When I decline, I've been hit with clipboards, pens, hand sanitizer, etc. Yes, the opioid epidemic is real and I hate my career.  I need a career do-over.",
   "created_utc": 1690470350,
   "score": 9,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnpeed",
   "message": "maintenance work for green areas. It was brutal, because of the heat. We had to pick up weeds from under of rose bushes. I got stung many times and it sucked.\n\n I can still remember drinking those last drops of that heated up water. The wage wasn't good either. Basic summer job.",
   "created_utc": 1690462920,
   "score": 8,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnv5xf",
   "message": "Concreting house slabs. It was just back breaking fast paced labour with little rest time. It took me a week to recover from my first three days of work. I did it for about 6 months.",
   "created_utc": 1690465464,
   "score": 9,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnp9ey",
   "message": "Call centre. It was stressful and I was underpaid",
   "created_utc": 1690462855,
   "score": 7,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto0h9t",
   "message": "I worked at a new small 9-table mom and pop Italian restaurant. Insanely yummy authentic 7 course meal. Espresso at the end and all. Thing was, I was their only employee besides the husband and wife. So I prep-cooked, did dishes, bussed, waited tables, cleaned, even gardened AND shoveled snow lol. Some weeks they even couldn’t afford to pay me. Customers did come pouring in though once word got around how good the food was, which brought in more money, but not enough to hire someone else. \n\nAlso Idaho had these weird laws like they paid less than minimum wage and then the tips make up for the minimum wage. So it was 3 bucks an hour plus tips… this was 2011-2012.\n\nAnyway, I had to quit eventually. I felt more like a slave since I wasn’t really getting paid (not to minimize real slaves). But they shut down not long after I quit. Hard to find push overs like me lmao.",
   "created_utc": 1690467626,
   "score": 6,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto944y",
   "message": "Glass collector for a busy nightclub whilst I was at university.\n\nIt totally ruined nights out for me, and the smell of beer makes me vomit from trauma.\n\nAlso having to clean up vomit, broken glass, and so much worse things on a nightly basis.\n\nThe pay was crap, the late hours were crap and I ended up working every single night it was open so I never really got to enjoy the free staff entry or cutting lines to get in. The hours also played havoc with my sleeping pattern that took nearly a decade to correct.",
   "created_utc": 1690470939,
   "score": 7,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto5dsb",
   "message": "Worked as a cashier at a gas station.\nPeople that took off without paying their gas were our responsibility. The owner took those amounts from our salary.",
   "created_utc": 1690469520,
   "score": 6,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtotvxl",
   "message": "Cold call jobs stink. Did that for a minute.\n\nI am a middle school teacher, have been for ten years. I think if you are a specific kind of really patient person that can be a good job. I like it well enough. It suits me and the perks offset things like crazy parents and lazy admin.\n\nBut the worst job? Substitute teaching right out of college. If you are in, like, a dozen different buildings in multiple districts you have no idea where stuff is or where to go—the kids have no reason to listen to you. I stopped subbing middle school and only subbed high school. They were at least quieter and cared a little bit more. Got a teaching job teaching middle school and it is a totally different experience than subbing and so much better.",
   "created_utc": 1690478571,
   "score": 5,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnoshk",
   "message": "[deleted]",
   "created_utc": 1690462635,
   "score": 4,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnryfz",
   "message": "Every one I've ever had.\nA necessary evil.",
   "created_utc": 1690464074,
   "score": 6,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto068r",
   "message": "Democratic calling center asking people for their money and having to get 3 no’s before we could hang up. Also on an auto dialer so it was just constant. 4 hour shifts during college. I lasted 6 weeks. Fuck that place",
   "created_utc": 1690467507,
   "score": 3,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto0r26",
   "message": "TJ Maxx. Not the tasks performed as much as the company culture. The manager treated me like I was an alien. And the hours in that building just felt so soul crushing",
   "created_utc": 1690467732,
   "score": 3,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto1ws6",
   "message": "Technical support, Apple support.",
   "created_utc": 1690468183,
   "score": 3,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto277z",
   "message": "IT recruiter",
   "created_utc": 1690468296,
   "score": 3,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto4nfo",
   "message": "Big 4 accounting firm. Absolutely horrible. No one should work there",
   "created_utc": 1690469239,
   "score": 3,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtohosg",
   "message": "I dont like my job but I dont think because it's a bad job but because I am a lazy person",
   "created_utc": 1690474111,
   "score": 3,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtopz8n",
   "message": "Being the mother of a 27 year old man. (I was a 21 year old girlfriend)",
   "created_utc": 1690477149,
   "score": 3,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtor21n",
   "message": "Middle school teacher. It was one of those every day is worse than the day before deals.",
   "created_utc": 1690477543,
   "score": 3,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoswuj",
   "message": "Paint factory where they treated metal and sprayed it, don't know the perfect words for it in English sorry.\n\nPeople nearly closed the oven before I left it, yelled at me from 6 am until I left work (9,5 hour work days). Had to work with chemicals that got me so high that I stuck a massive magnet to a metal palletcart, so nearly lost my fingers. Also almost lost my eye when my boss \"secured\" a package so tightly that the  metal band snapped and hit me an inch away from my eye. Got a neat pirate scar now though. Could've probably sued them but never did.\n\nThe chemical is known to result in painters disease, because it vaporises your brain essentially. No protection offered. Got that shit in my eyes almost every day. Swept 5 kilos of dust weekly.\n\nLeft after 3 months.",
   "created_utc": 1690478218,
   "score": 3,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnojb6",
   "message": "Order Picker, Royal Insurance, 1980.",
   "created_utc": 1690462514,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnsskr",
   "message": "Serving. Not a ppl person. Idk why I thought I would be good at it.",
   "created_utc": 1690464439,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtntkc5",
   "message": "Waitress. A lot of work, dealing with a lot of drunk and weird people, and my boss was super demanding for the amount I was being paid",
   "created_utc": 1690464778,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnxen1",
   "message": "Flag waver at liberty Tax. \n\nLiterally the most demeaning and embarrassing job.",
   "created_utc": 1690466390,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto1foe",
   "message": "Working for a Corona Test Laboratory, scanning and opening a few thousand vials daily.",
   "created_utc": 1690467998,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto35gf",
   "message": "Soda Bottling Plant - in Louisiana during high summer. 100F / 40C while standing ankle deep in rotten soda pop while trying to find out why the lines quit working.  It was terrible.  I lasted three months.",
   "created_utc": 1690468663,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto76pd",
   "message": "Took a job that was listed as a marketing internship. Turns out it was door to door sales for verizon fios. They had me walking around north Philly, bothering people as a 21 yo white boy in khakis and a polo with a laptop strapped to me, 6 days a week. \n\nGet fucked.",
   "created_utc": 1690470209,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto7dat",
   "message": "My first job out of college for a third party tech support company for Verizon’s shitty DSL service. To this day, I refuse to sign with Verizon for anything because I had PTSD for years about that job.",
   "created_utc": 1690470279,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto7ko5",
   "message": "I've actually been very fortunate to have had all pretty decent jobs, and even my \"worst\" comparatively isn't *that* bad. But anyway my worst was working in a small town community bank operations department. The whole department was gross, middle-aged townie women, one gay guy, and me. The dick jokes and commentary were relentless.  I'm not to any extent \"prude\" but there's only so much intimate dick talk a person can handle from their coworkers.  Additionally, I was paid like junk at this job.",
   "created_utc": 1690470355,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto9to8",
   "message": "I tried to make a move to Atlanta with one of my friends but only spent a summer there since I couldn't make it work. But while I was there I had 2 jobs and they both qualify.\n\nFirst was a pizza shop, I only lasted a couple days there because the back room where they kept the flour, pizza toppings, cups, etc was full of roaches. Just roaches everywhere, in everything. They would have to pick them out of the flour when they made dough, it was awful. I would just sit and itch all day long.\n\nThe other one was at a subway, I was the only white guy who worked there and was blamed for absolutely everything, even things that happened on my days off. Money stolen? It was me. Manager miscounted boxes of bread? I obviously stole it to feed my friends. Tomatoes at the bottom of the box went bad? Yeah that was somehow my fault too. The day shift didn't make extra stock for veggies and what not? Yeah my fault that we had no cut onions. I was never anything but friendly, the racism there was still crazy, I had no idea there were so many slurs for white people. Even got spit at. Just overall treated like shit.",
   "created_utc": 1690471206,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoavnd",
   "message": "Telecommunications call centre. I wouldn't suggest it to my worse enemy.",
   "created_utc": 1690471596,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoi2r5",
   "message": "Hoeing weeds at a plant nursery.\nThe problem is you have to be careful not to accidentally hit any of the plants and I just couldn't Master being quick and careful at the same time. They fire me the same day they hired me",
   "created_utc": 1690474254,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto0zdv",
   "message": "Law firm.\n\nBecause attorneys make money by billing their work by the hour, their ability to manage their time is crucial to the success of the firm. However, that can generate the impression that their time is more important than everyone else's time and then they act like it. In high-pressure firms, they behave terribly: swearing at assistants, throwing files, demanding impossible amounts of work to support them. You either get along with it or get out. I got out.",
   "created_utc": 1690467822,
   "score": 3,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnpa6n",
   "message": "My aunt were my boss once and I delivered her accounting work to a government office,  i had to sit in a chair for 6 hours 3 times a week and i was lucky to walkout with 200 bucks monthly salary \n\nThat's not the worst part about it , the worst part is I don't know when she'll call me to go , like I'm taking a nap call me wake me up time to go , I'm in a college lecture boom time to go , I'm hanging out with my friends guess what ? It's time to go",
   "created_utc": 1690462866,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnv4da",
   "message": "Food service. I hate food service",
   "created_utc": 1690465445,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto2dlr",
   "message": "A foot job",
   "created_utc": 1690468365,
   "score": 2,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnrypu",
   "message": "Part time job at the University's library restocking books. It was so boring. I lasted seven days.",
   "created_utc": 1690464077,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtpl3ui",
   "message": "Demolishing warehouses full of asbestos, to rebuild them in the Texas summer heat was horrible, and this was before 105 Fahrenheit apparently became our summer temp",
   "created_utc": 1690488799,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto67ov",
   "message": "I am an architect so the worst one for me was to recreate renders from a interest images.",
   "created_utc": 1690469837,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnu505",
   "message": "Being your assistant",
   "created_utc": 1690465027,
   "score": 0,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnuje8",
   "message": "Semi tire retread shop",
   "created_utc": 1690465196,
   "score": 0,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtogzs6",
   "message": "Blowjob?🤷🏿",
   "created_utc": 1690473856,
   "score": 255,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtntrc7",
   "message": "Handjob",
   "created_utc": 1690464864,
   "score": 250,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnu3tq",
   "message": "Pre-professional, Walmart.  Fuck them.\n\nProfessional, IT for a small marine shipping company.  The stupidity in management was astounding, and there was zero effort made to keep the inmates from running the asylum.",
   "created_utc": 1690465013,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnxbvr",
   "message": "Insurance follow up for hospital claims of a large healthcare corporation. Man our (US) system is fucked. It paid decently and I was able to work from home after a few months but I really hated the work",
   "created_utc": 1690466359,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnxgsc",
   "message": "Because of working environment? Pizza place. No real set schedule, owners were pricks, no breaks (illegal for 16 year olds in WI), frequently worked past midnight on school nights (again illegal) and frequently had to serve alcohol (also illegal).\n\nBecause of the job itself? Roofing. Ok(ish) pay but hotter than hell up there and loong days.",
   "created_utc": 1690466414,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnydee",
   "message": "Weed whacking tombstones in a cemetery and then my friends died and were buried there.",
   "created_utc": 1690466785,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnyncu",
   "message": "Working the register and cleaning the floor/bathrooms at a McDonald's, on the interstate between Indianapolis and Chicago.",
   "created_utc": 1690466898,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtnzju3",
   "message": "Sold home security systems door to door. Was there for a month",
   "created_utc": 1690467259,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto0083",
   "message": "IT for individual at home.",
   "created_utc": 1690467440,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto1jo6",
   "message": "Black Friday/holiday worker at GameStop. It was the year Pokémon sword and shield AND Star Wars fallen order were released in the same night😅 memorable to say the least.",
   "created_utc": 1690468042,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto209l",
   "message": "Grocery store in the southeastern US. Somehow lasted 7 years. Hated every fucking second.",
   "created_utc": 1690468221,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto34l2",
   "message": "Cleaning the toilets at IKEA… bloody animals…",
   "created_utc": 1690468653,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto3mrk",
   "message": "Stocking shelves at Home Depot",
   "created_utc": 1690468846,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto45o3",
   "message": "Honestly haven't had many bad jobs but probably my first one, Fredmyers (krogers) and it wasn't even that bad. I just have one laughably silly memory.\n\nThere was a lady who would never use the painfully clear \"press this button for bottle return help\" and walk inside, find anyone and start complaining about how the machine wasn't accepting her bottles.\n\nI'd get asked \"why didn't you answer the bottle phone?\" mfer, it never rang and every time it was like she had 1 or 2 bottles (back when it was only 5 cents each) one time the bottle was painfully, obviously bent out of shape and the barcode was unreadable. I took 5 seconds to bend it back and it instantly accepted it.\n\nAnother time it was literally just some dirt over the bar code and I'd kind of just look at her afterwards to make her feel dumb. While I was working there it happened like 5+ times, such a Karen.",
   "created_utc": 1690469049,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto506x",
   "message": "Working the \"kill Room\" at the animal sciences lab, during my time at university. Although it paid pretty well..",
   "created_utc": 1690469376,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto57fh",
   "message": "I worked in an outbound call center that was more than a little shady. I kept expecting the FBI to raid the place at any time. I lasted a week.",
   "created_utc": 1690469454,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto5avi",
   "message": "McDonald's cleanup at the age of 14. Had to clean toddler vomit out of a playpen on several occasions",
   "created_utc": 1690469490,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto6fbt",
   "message": "In my teen years I used to work in a massive outdoor fruit and veg market. It was only open to businesses and would start about 3am.\n\nIn the summer it was awesome, but in Winter it was hell on earth. Everything you had to pick up was covered in ice or freezing water. I have never had to wear so many layers and keeping your feet warm was impossible. Nothing like stepping in 6 inches of half frozen rain water to warm you up.\n\nOne good thing was there was a bar that had a unique license to operate through the night. So for breakfast you could get a fry up and a pint to warm you up.",
   "created_utc": 1690469917,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto6qmw",
   "message": "Charity call centre work. Lasted three days. Was genuinely so awful and stressful.",
   "created_utc": 1690470036,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto8hc9",
   "message": "Digging holes under houses for a foundation company. This was back in the 90's, now a days I think they use a big drill to just drill a hole. Back when i did it, we would have to manually dig  4ft x 4ft x 4ft holes around the perimeter of the slab foundation of the house. And that was a good job. If the house had cedar posts we would have to be under the house digging holes. That job has made all the other crappy jobs I've had through the years seem not so bad.",
   "created_utc": 1690470698,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jto8yko",
   "message": "Bagging groceries in the 90s.",
   "created_utc": 1690470880,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoa4lr",
   "message": "Lowes. Without a doubt no questions asked the worst experience ever. It was worse than high school in terms of drama. There was sexual assaults happening every day from 50-60 year old men on 18-25 year old college girls. I brought it up to HR twice and they essentially said nothing will get done about it. \n\nThen a woman who worked there, who was in a 10 year relationship, got knocked up by her manager whom she was fucking in the back rooms in the store. Manager was 10ish years her senior and was married with 3 small kids at home.",
   "created_utc": 1690471317,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoadq2",
   "message": "Cashier at a grocery store - may as well have been a verbal punching bag.",
   "created_utc": 1690471412,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtobdwd",
   "message": "Data Analyst at a third party HR company. I lasted 77 days and by the first months end I was applying to jobs all day long at my desk because I had literally nothing to do. I was given these huge projects with little to no instruction and I would do them to the best of my ability and my micromanager would see them and say its not her way of doing them and take them away to do them her way. I sat at the very front of the office, basically I was hired as a Data Analyst but they wanted me to also do admin work like answering the main phone, restocking the copy machine and fridge and doing bullshit inventory. \n\nI had 7 days of PTO so decided I was done and took a week off the day I found out I got hired at my current job and then sent them an email on the morning I was set to come back from PTO saying I quit effective immediately.",
   "created_utc": 1690471786,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtobwpb",
   "message": "Chuck E Cheese, working by myself up at the registers AND working the prize corner at the same time; people who constantly asked why they had to take photos together instead of getting the hand stamp (post Covid), loosing my voice every single day because of constant talking,  kids screaming and crying when they couldn’t get a small prize, parents getting pissed that tokens/physical tickets didn’t exist anymore, managers were buddy buddy and didn’t give a shit about any other associates. The list goes on and on, and don’t even get me started about parents fighting after drinking. Walked out after 2 months\n\nEdit; the kicker is I got paid like 8.25 for a 30 minute drive, complete nightmare",
   "created_utc": 1690471981,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtod54h",
   "message": "I worked in a freezer warehouse for a summer in college. It was -10 and I was just loading frozen burritos into trucks en route to 7-11.",
   "created_utc": 1690472437,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtodks4",
   "message": "Collections/accounts receivable\n\nPure dog shit job, but it was a start…",
   "created_utc": 1690472599,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtodpg1",
   "message": "I worked at KMart in the grill when I was in high school. It was the worst. People would actually come eat there on Friday nights. Complain about the food.  I always wondered why they insisted on coming here then. It was greasy, hot and dirty working the grill.",
   "created_utc": 1690472647,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoefcn",
   "message": "Enterprise Rent-A-Car by far. Cool coworkers, unbelievably shit job.",
   "created_utc": 1690472916,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoehop",
   "message": "Waiter at Applebee's.\n\nAwful experience. Decent coworkers. Cyclical hell.",
   "created_utc": 1690472940,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoekbq",
   "message": "Current job. Selling dental implant systems to general dentists.\n\nThe pitch is that general dentists can make a buttload more money by specializing in implants themselves vs sending the cases to oral surgeons/specialists. The catch is that a lot of general dentists have good relationships with surgeons and sometimes get a monetary kickback for sending them patients, so the GDs are already making money off implant patients with no extra work.\n\nSo what ends up happening is your sales team devolves into the standard overselling/high pressure/predatory tactics to meet quotas. The sales rep before me in my territory (who had to quit because he was causing heart problems for himself by overworking, sometimes past midnight) oversold like a motherfucker. Now I have all these dentists that want to return (as is their right) $5,000 - $50,000 worth of merchandise they never ordered in the first place!! And my boss has the gall to tell me to force/pressure dentists into more contracts/sales.\n\nFuck all that noise. Doing a final interview today for a job I know I'm going to get and getting the hell outta here. Now I know why they say sales is a nightmare. You need way more than just a good product, you need a company that knows how to run itself efficiently and understand when/where your business model isn't viable.",
   "created_utc": 1690472967,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtofbi0",
   "message": "Burger King, hands down. Lasted 3 shifts when I was 16",
   "created_utc": 1690473241,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtofd6k",
   "message": "Teller at a credit union",
   "created_utc": 1690473259,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtofiti",
   "message": "Fast food, 100 degree kitchen in a fast paced environment making minimum wage.",
   "created_utc": 1690473315,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtofptc",
   "message": "Working as an auto lender for a very large well known bank! I ended up leaving 2 days before my 90 day probation period! We were all essentially the banks slaves and they justified it by paying us a hair over the national average. Not worth it!",
   "created_utc": 1690473386,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtog857",
   "message": "Roofing company - job was to pick up 66 lb bag of concrete, lift it over a hopper, break the bag on a pin and then empty it. Repeat.  No safety equipment so mouth nose and eyes were cemented shut by noon.  Which is when I left.",
   "created_utc": 1690473571,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoh4vk",
   "message": "It’s a tie between AT\u0026amp;T and Walmart.  \n\nAT\u0026amp;T paid well but they were constantly threatening you with getting fired.  You had to meet objective numbers.  Sometimes there was no way to meet their targets.  They didn’t seem to care about you as a person.  Some people did a poor job, and got good numbers because they skipped half they things they asked employees to do.  But then they would use that persons numbers as the target for everyone else.  Calling off was also a thing that could get you terminated.  \n\nWalmart was bad.  They seemed to care about you.  But also would badger you if you got sick.  Like omg. You’re leaving me to do this by myself?   You’re a terrible person for getting sick. But the biggest problem there was the low pay.",
   "created_utc": 1690473909,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoh6fh",
   "message": "I worked for a tool company, small-owned with a couple of locations, as their social media and general marketing person.\n\nThere were a LOT of things wrong with what was going on there. Firstly was the hiring process. They told me they wanted to start me out on a sort of 3-month trial at a lower rate of pay and no benefits until after that trial. Unfortunately, I was kind of desperate at the time and agreed.\n\nDuring that 3 months, I saw the manager of our location (daughter of the owner) bring her newborns in and treat the office staff as babysitters for them. People didn't get much work done because they were watching her kids.\n\nThe owner was a landlord for a couple properties (the tool company was left to her by her dead husband but I don't think she enjoyed it) and so she was rarely in as she was typically handling her other business things.\n\nThe other location was run by the owner's OTHER daughter, and you could tell she hated it.\n\nDuring my review, at the end of the three months, they revealed they had cameras in the office, which they used to basically spy on employees and make sure they were working. This was pretty traumatizing and a MASSIVE breach of privacy, and to this day, I can't handle people even standing behind me when I work.\n\nThey told me they wanted to have me do some live video and photography during this big tool sale event they have every year. I found out a couple of days beforehand that they weren't planning on paying me for it and thought that, \"I would appreciate the opportunity because it's something I enjoy doing.\"\n\nWhen I brought up the benefits and increased pay they got massively upset that I had \"the audacity\" to ask for more and harassed me with angry calls and emails over the course of the next week before firing me. I guess they assumed I was looking for a new job and figured they'd cut their losses.",
   "created_utc": 1690473924,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtohiev",
   "message": "working maintenance in a deli meat packing plant.\n\nI don't eat pre-packaged deli meat any more.",
   "created_utc": 1690474047,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtohs3r",
   "message": "Veterinary Receptionist at a specialty and Emergency hospital. By far some of the most vile nasty disrespectful people I’ve ever had the displeasure of dealing with. Makes retail look like a slice of cake",
   "created_utc": 1690474145,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtohsoc",
   "message": "being a reddit user. I show up, i don’t get paid.",
   "created_utc": 1690474151,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtohwbs",
   "message": "Dog bather. \n\nI worked at a dog groomer washing pissed off dogs. I got a percentage of every wash based on the difficulty of the wash and its fur coat. Spoiler, every dog was a pain in the ass to wash. \n\nWorked for 8 hours and I was paid like 26 bucks. I lasted a day.",
   "created_utc": 1690474189,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtohy1m",
   "message": "Medical collections. Good pay actually but mentally exhausting in multiple ways. Pay kept me miserable much longer than I needed.",
   "created_utc": 1690474206,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoi4jw",
   "message": "It's a split between industrial landscaping over the summer, and selling gravestones by looking up the addresses of surviving family members mentioned in obituaries and sending thinly veiled ~~ads~~ I mean condolence letters.",
   "created_utc": 1690474273,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoi5i6",
   "message": "This one",
   "created_utc": 1690474283,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoimi8",
   "message": "Billing for an orthopedic clinic. I've never walked out of a job before that. Everyone was stressed out, I didn't get any training and probably fucked a bunch up, my \"manager\" was shocked when I showed up the second day \"oh wow, you're back! That rarely happens!\"",
   "created_utc": 1690474458,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoizwe",
   "message": "Cold calls to book time share presentations. I’m Canadian and this was for an American company. I wasn’t aware it was for time shares as I had to follow a script. We only got paid per booking we made. Even better, the “office” was a shed next to a barn where horses were housed. Did not last long!",
   "created_utc": 1690474595,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtojbcb",
   "message": "I was a driver for a bread delivery company contracted with a bakery located in a very dangerous area. My route had me loading the truck from 11pm - 3am. People regularly hung around the loading area trying to steal from our trucks (usually from the cab - it was common knowledge among the locals that we’d just give them some bread if they asked). This was such a common occurrence that the company I worked for provided drivers with a metal club; I was expected to defend the truck and myself from theft for near minimum wage. I quit after the second time I had to threaten someone with it.",
   "created_utc": 1690474712,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtokh8p",
   "message": "Sheet metal factory. One month between semesters in college. I called it The Carousel to Hell. All I did was hang sheets of metal on a conveyor to dry. By the time I'd hang them all, the conveyor made its loop. Then, I had to take them down all down and stack em. No music. Nobody around to talk to. Just standing in one spot with a bucket of hooks and two carts.",
   "created_utc": 1690475138,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtokqok",
   "message": "Montgomery wards .\nPaint department.\n\nRemember that movie MallRats were the Ben Affleck character says :\n\n\"THE CUSTOMER IS ALWAYS A ASSHOLE!!\"\n\n\nYep.",
   "created_utc": 1690475236,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoksxb",
   "message": "Gas station attendant, the hours tend to suck, you're forced to work all the major holidays, and you have to deal with tweakers and assholes from all walks of life thank God prepay is more common now.",
   "created_utc": 1690475259,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtokzv3",
   "message": "Being a cleaning lady.",
   "created_utc": 1690475329,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtolfsl",
   "message": "Bouncer at a lakeside bar, pulling old fat guys off of each other was sad",
   "created_utc": 1690475491,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtolln4",
   "message": "Kirby vacuum salesman, I didn't like trying to guilt poor people into buying a fucking $2,000 vacuum cleaner.",
   "created_utc": 1690475552,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtolv5a",
   "message": "Over night making plastic wrap",
   "created_utc": 1690475651,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtolxiv",
   "message": "Call center for a big insurance company. I used to sit in my car shaking and crying before going into the building. It was so so awful.",
   "created_utc": 1690475675,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtom172",
   "message": "Got a job delivering food once. First day, asshole counted pennies so I'd have no change while smiling, and then went back inside his mansion. Quit the same day and looked for something else.",
   "created_utc": 1690475713,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtom41t",
   "message": "Mall maintenance, easily. Most of the stories I accumulated while working there are extremely dark/disgusting. I didn't get paid for 4 months and the conditions were so bad that our security mostly consisted of actual police officers.",
   "created_utc": 1690475742,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtomejo",
   "message": "Its a tie between Chick-Fil-A and being a deli employee at Sprouts for sure",
   "created_utc": 1690475850,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtomfv1",
   "message": "McDonald’s, hands down. Fuck that place",
   "created_utc": 1690475863,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtomob8",
   "message": "Night shift at an adult video store in Vegas. I lasted a week. Some people are nasty in ways you never knew existed.",
   "created_utc": 1690475948,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtond1n",
   "message": "Maintenance tech. I’d climb up 40 foot ladders with another 8 foot A frame on my shoulder to set up on a ledge, so I can get from one section of the roof to the other. This is without a harness, and sometimes in the pouring rain. We did the jobs people would absolutely refuse to do, or have a panic attack doing. At some of the properties, a fall from the roof was guaranteed to be fatal.",
   "created_utc": 1690476197,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtonvl4",
   "message": "I did dishes at an all you can eat truck stop buffet. My dad worked there with me and he took a smoke break every 30 minutes and left me with all the bullshit. I made 5.15 an hour. I ended up quitting after a couple months.",
   "created_utc": 1690476384,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtoo3wu",
   "message": "Selling frozen meat door to door. Shitty meat. Shitty people. Pay depends on how much you could rip people off. The number one sales tactic was start unboxing the meat and shoving it in their freezer so they’re almost forced to buy it. And lying about weight.",
   "created_utc": 1690476469,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtooy3a",
   "message": "I had a job back when I just left school where I had to count 23 straws then put an elastic band round them. Put the bundle in a box, then repeat. For eight hours a day. \n\n23. Not 20, not 25. 20 fucking 3. \n\nOh and we weren’t allowed to wear headphones either.",
   "created_utc": 1690476775,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtop08s",
   "message": "Building supply delivery. It was almost exclusively dry wall. A fully loaded flat bed would be unloaded by hand two sheets at a time. By the end of everyday, I thought my arms were going to tear themselves in half. Unload truck, go get more dry wall. Unload truck. Get more dry wall.",
   "created_utc": 1690476797,
   "score": 1,
   "submission_id": "15b153r"
  },
  {
   "comment_id": "jtope7y",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15b153r"
  }
 ]
}