{
 "submission_id": "15b3kz3",
 "title": "What's the stupidest \"Real Men don't ________\" you've ever heard?",
 "selftext": "",
 "created_utc": 1690468624,
 "permalink": "/r/AskReddit/comments/15b3kz3/whats_the_stupidest_real_men_dont_youve_ever_heard/",
 "score": 71,
 "url": "https://www.reddit.com/r/AskReddit/comments/15b3kz3/whats_the_stupidest_real_men_dont_youve_ever_heard/",
 "comments": [
  {
   "comment_id": "jto3br5",
   "message": "I've heard real men don't drink tea.",
   "created_utc": 1690468730,
   "score": 176,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtobvv0",
   "message": "Wannabe tough guy: \"Real men don't cook... Only women and gay men cook.\"\n\nMe: \"What about male Chef's like Gordon Ramsay?\"\n\nResponse A) They're closeted gay men.\n\nOr\n\nResponse B) A Chef is a paid position so it doesn't count.",
   "created_utc": 1690471972,
   "score": 191,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jto7jtr",
   "message": "\"Read the Instructions\"",
   "created_utc": 1690470346,
   "score": 65,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jto4ssq",
   "message": "\"wash their ass because it makes them gay\"",
   "created_utc": 1690469298,
   "score": 98,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jto3y6a",
   "message": "My friends once introduced me to this guy who was talking REALLY LOUDLY.\n\nI thought maybe he didn't realize how loud he was being so I said \"you're a little loud.\"\n\nDude said \"real men talk loud. Chicks like that.\"\n\nI did not like that.",
   "created_utc": 1690468968,
   "score": 42,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtobkvc",
   "message": "My former boss would die on the hill of \"real men don't use rolling suitcases.\" He'd sooner throw out his shoulder carrying a heavy duffel bag than ever be caught dead rolling a suitcase through an airport.\n\nEdit: forgot to add he also thinks \"neck pillows are fruity\" and can't stand when men wear them around their neck on planes. Also, re: the comments about benefits of hiking backpacks, I don't think I ever saw him sport a two-strap. Fellas, is it gay to have even weight distribution on your shoulders?",
   "created_utc": 1690471857,
   "score": 72,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtofk0i",
   "message": "Real men don't put cream in their coffee.  I responded with, \"real men don't give a shit what other men think of their beverage choices.\"",
   "created_utc": 1690473327,
   "score": 73,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtoibz8",
   "message": "I was told that really men never look at their nails with their palm down and would only ever look at their nails with their palm up and fingers curled.\n\nI gotta wonder how secure in your masculinity you've got to be to spend time even thinking about the right way to look at your nails.",
   "created_utc": 1690474349,
   "score": 96,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jto7ff0",
   "message": "There was a post on Reddit somewhere a while back of a guy remembering his dad chastising him for saying \"Good Morning\" to another man at a laundromat. His dad said that saying good morning to another man would make him \"think you're sweet,\" which in this context I assume means that people will think you're gay if you say good morning. Honestly some of the dumbest shit I have ever heard and I bet that guy's dad could suck the chrome off a doorknob.\n\nEDIT: /u/kwk442 don't you know that real men don't give Reddit gold? Just kidding, thanks babe!\n\nSource: [https://www.reddit.com/r/AskMenAdvice/comments/10nhivw/is\\_it\\_gay\\_for\\_a\\_man\\_to\\_tell\\_another\\_man\\_good/](https://www.reddit.com/r/AskMenAdvice/comments/10nhivw/is_it_gay_for_a_man_to_tell_another_man_good/)\n\nEDIT 2: Gold and Platinum!? I am basking in the testosterone that radiates off you. Thank you, you manly mans  /u/bojangles69  \nEDIT 3: Hell yeah /u/Limenoodle_ Good Morning to your lime noodle. Thanks for the platinum!",
   "created_utc": 1690470301,
   "score": 114,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtomp1v",
   "message": "I was at Joanns and the man behind me in line was buying something for his wife and didn't have any coupons. I told him about the app and the website and offered to pull up my coupons for him to use.\n\nHe laughed and said \"Boys don't use coupons\"\n\n\nSo weird. It's free money. How fragile is your masculinity that you pay full price when you don't have to.",
   "created_utc": 1690475956,
   "score": 240,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jto3kys",
   "message": "Wear sunscreen.",
   "created_utc": 1690468827,
   "score": 76,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtomuno",
   "message": "Not sure if it counts, but a young woman wouldn’t sell me a Luna Bar because it’s made for women. I said “No. It’s marketed to women. But I like this flavor.” She said “I can’t sell it to you. It has estrogen in it.” We had a frustrating back and forth before I finally convinced her that I was willing to take the risk and she sold it to me.",
   "created_utc": 1690476013,
   "score": 109,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtoetql",
   "message": "I saw a video of a woman saying “Real men don’t eat peanut butter and jelly” and I was flabbergasted.",
   "created_utc": 1690473061,
   "score": 218,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtoadby",
   "message": "\"Real men don't order dessert.\"\n\nI'm sorry, it's \"gay\" to like sugar? This real man is gonna deep throat a bananas foster while holding eye contact with you the entire time.",
   "created_utc": 1690471408,
   "score": 89,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jto6esz",
   "message": "Use umbrellas.",
   "created_utc": 1690469912,
   "score": 254,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtoe53m",
   "message": "1. My cousin was working at a chocolate shop and said a guy barged in asking for \"chocolate for MEN.\" She never did figure out what he was talking about.\n\n2. My grandfather firmly believed real men didn't smile in photos. Smiling = gay in his mind (needless to say he was a homophobe).",
   "created_utc": 1690472808,
   "score": 57,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtochbx",
   "message": "Eat pussy.  Oh, so doing this one simple trick that makes it really easy to sexually satisfy women is too gay for you?",
   "created_utc": 1690472192,
   "score": 149,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtomrsg",
   "message": "Once saw a woman on twitter say something like “if a man is too eager when the free bread gets to the table that’s sus” and I was just blown away by that one",
   "created_utc": 1690475983,
   "score": 21,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtoflpv",
   "message": "\"Real men never say no to sex\"",
   "created_utc": 1690473344,
   "score": 139,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtoi651",
   "message": "Real men don't lift under (insert weight). Everyone has to start somewhere dick head. I have been lifting for years but when I see a new kid try lifting crazy heavy with bad form I warn him it's a good way to get hurt. If they don't listen then that's on them.",
   "created_utc": 1690474290,
   "score": 167,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtol03s",
   "message": "Drink fruity cocktails, dude, my cocktail has 5 spirits in it, it's way more alcohol than your 3.x% abv. beer and it tastes nice .",
   "created_utc": 1690475331,
   "score": 215,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtoet3n",
   "message": "Real men don’t wipe after shit…because it’s touching a man’s anus.",
   "created_utc": 1690473055,
   "score": 68,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtofg29",
   "message": "Real men dont drink fruity drink, only beers and hard liquor. \n\nFuck off. I drink something if it taste good and i will die before doing 50 differents type of faces just to swallow something that taste like satan butthole and batteries acids",
   "created_utc": 1690473287,
   "score": 8,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtohrrd",
   "message": "Real Men don't show their own children affection or accept affection from them, apparently.",
   "created_utc": 1690474142,
   "score": 146,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jto5g09",
   "message": "Look at explosions",
   "created_utc": 1690469543,
   "score": 31,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jto3l76",
   "message": " Real Men don't use GPS because they navigate by the sheer power of their masculinity. They just follow the scent of burning testosterone to find their way.",
   "created_utc": 1690468830,
   "score": 189,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jton6h2",
   "message": "Wave, cry, masturbate, do desk jobs, sing, show emotion, show love, be good fathers, be ill, be poor, not fight, have female friends, I’ve heard so many stupid stereo types being born in 75. \n\nI still won’t cry after my older brother beating the crap out of me any time I did as a kid. A few years ago I had mentioned I haven’t cried since I was in my early teens and he had the audacity to say real men cry.",
   "created_utc": 1690476132,
   "score": 197,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtoei8k",
   "message": "Real men don't love their women as much as or more than she loves him. He has to always love her less and be less emotional to hold more power in the relationship.",
   "created_utc": 1690472946,
   "score": 16,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtod007",
   "message": "My dad told me once, \"Men don't say thingy.\"\n\nAnd frankly I agree. A man should speak eloquently. Be sure to enunciate. A say specifically what you mean.\n\nBesides, there are way better words than 'thingy\".\n\nFor example, doohickey, thingamajig, whatchyacallit, or whoswhatsit are of my favorites.",
   "created_utc": 1690472384,
   "score": 188,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtogugx",
   "message": "Eat dessert. Seriously. I was told it was gay to eat dessert. \"Because children and women like sweet things.\"\n\nFuck you, Paul, I am going to eat this raspberry cheesecake.",
   "created_utc": 1690473801,
   "score": 49,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jto3zlv",
   "message": "\"cry\" literally everyone cries stfu.",
   "created_utc": 1690468984,
   "score": 28,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtoi406",
   "message": "A guy at work described something his daughter did as “cute” and then some douche told him that men aren’t supposed to call things cute.",
   "created_utc": 1690474267,
   "score": 152,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jto6kg5",
   "message": "use airbags",
   "created_utc": 1690469971,
   "score": 181,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtogb71",
   "message": "Parent. Are you kidding me? Do you know how manly it is to raise your kids?\nAlso bonus: cook. WTF. Until maybe the silly 50s gender coding, cooks were ONLY male.",
   "created_utc": 1690473603,
   "score": 17,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtohx12",
   "message": "\"Real men don't have cats.\"\n\nLaughable.",
   "created_utc": 1690474196,
   "score": 194,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtog50g",
   "message": "I recently saw “If you’re a straight man and go see the Barbie movie you’re 100% a beta”\n\nI thought, “I’m so sorry that someone called you a beta once and that ever since you’ve been critical of your fellow man by hamfistedly dissecting everyone’s choices through an arbitrary and nonsensical social hierarchy platform that only exists to a few and matters to less! That kind of thinking is how we get Nazis Bruh, you could do with some content that boldly and artistically tackles some questions of who we are in the universe, society and what real support and true friendship looks like. Maybe go see Barbie?”",
   "created_utc": 1690473540,
   "score": 34,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtod0hj",
   "message": "“Sleep on their stomachs”",
   "created_utc": 1690472389,
   "score": 90,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtog1pv",
   "message": "My ex husband used to say real men don't eat popsicles.\n\nEdit to add: my current husband loves popsicles, ex husband was a POS who never got to experience the joy of an icy treat on a hot summer day in the south.",
   "created_utc": 1690473506,
   "score": 167,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtobhuh",
   "message": "Wear pink. Pink is an awesome color - and you’re a little bitch if you think I’m not rocking an awesome color.",
   "created_utc": 1690471826,
   "score": 90,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtofvr7",
   "message": "*... Don't eat sweet things like candy or chocolate, it's gay.*\n\nI fucking love chocolate so I'm probably the biggest gaylord out there.",
   "created_utc": 1690473446,
   "score": 176,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtonodm",
   "message": "Gotta be “wash their a-holes.”",
   "created_utc": 1690476312,
   "score": 61,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtolvtn",
   "message": "The Home Improvement video game.  \n  \nIf you ever played the Home Improvement video game (yes, the Tim Allen sitcom) for Super Nintendo or Sega Genesis/Mega Drive I hope you were intuitive.  If you tried to look in the book it came with the instructions were blocked out with a big red stamp:  \n  \nREAL MEN DON'T NEED INSTRUCTIONS\n\nAppropriate, since it was a mind-boggingly stupid game.",
   "created_utc": 1690475658,
   "score": 76,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtomoi8",
   "message": "Wipe their asses. I've seen it on /r/relationshipadvice so many times. There are men out here who think it's gay to touch their own asses, with toilet paper, with soap, with anything. It's uncharted, unwashed territory back there. I simply *cannot*.",
   "created_utc": 1690475950,
   "score": 85,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jto7qcf",
   "message": "Eat quiche. Shit's amazing.",
   "created_utc": 1690470415,
   "score": 130,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtobuj5",
   "message": "Saw on /serverlife,  \"real men don't use ice\" (for their sparkling water)",
   "created_utc": 1690471958,
   "score": 60,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtoakth",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtof2ct",
   "message": "\"Real men don't apologize\"",
   "created_utc": 1690473149,
   "score": 35,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jton64u",
   "message": "”Dance. Eat vegetables. Yoga. Cry.” You pick!",
   "created_utc": 1690476128,
   "score": 38,
   "submission_id": "15b3kz3"
  },
  {
   "comment_id": "jtouy2f",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15b3kz3"
  }
 ]
}