{
 "submission_id": "15dye06",
 "title": "What type of person do you not fuck with?",
 "selftext": "",
 "created_utc": 1690755722,
 "permalink": "/r/AskReddit/comments/15dye06/what_type_of_person_do_you_not_fuck_with/",
 "score": 33,
 "url": "https://www.reddit.com/r/AskReddit/comments/15dye06/what_type_of_person_do_you_not_fuck_with/",
 "comments": [
  {
   "comment_id": "ju4o4eb",
   "message": "I don’t fuck with the type of person who immediately loses their cool. There is no rationalizing with them.",
   "created_utc": 1690756006,
   "score": 125,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4r2zz",
   "message": "People who have nothing to lose.",
   "created_utc": 1690757353,
   "score": 97,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4o21m",
   "message": "Generally don’t mess with anyone that has cauliflower ears. Usually an indication of a wrestler or mma person.",
   "created_utc": 1690755977,
   "score": 178,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4nnu5",
   "message": "I try not to fuck with anyone generally. Except online of course. You never know who is unstable.",
   "created_utc": 1690755798,
   "score": 112,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4nnws",
   "message": "Airport security; especially in those countries where the security is decked out in army uniforms and have visible weapons.\n\nThey will fuck you up.",
   "created_utc": 1690755798,
   "score": 149,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4omb1",
   "message": "People who seem under the influence of drugs. I just maintain a sort of firm passive presence. You don't want to make them think you're vulnerable, but you don't want to make them think you're aggressive either.",
   "created_utc": 1690756236,
   "score": 107,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju51r5o",
   "message": "Anyone with vaguely veiled criminal or mafia ties...I've come across a few, and I just make sure to be respectful and stay out of their way as much as possible. Not my monkey, not my circus. You leave me alone, I leave you alone.",
   "created_utc": 1690762293,
   "score": 125,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju54wyh",
   "message": "People who pretend you mean something slightly different when you have an issue just so they feel justified getting mad at you",
   "created_utc": 1690763801,
   "score": 249,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4vzag",
   "message": "If a dude looks super fucking scary but is extremely polite, that dude is super fucking scary.",
   "created_utc": 1690759590,
   "score": 53,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju55evr",
   "message": "(Learned this from my friend who is a CO)\n\nNever fuck with people who are very calm during an altercation. Loud and obnoxious people are usually soft/timid when it goes down...\n\n\u0026amp;#x200B;\n\nBut someone who is in the middle of a heated argument and just looks around and says things like \"I'm not trying to hear it\" in a calm manner.... watch out. Those types are usually effective fighters and don't need to 'show off' because they're confident in their ability to KO somebody.",
   "created_utc": 1690764040,
   "score": 165,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4wy8s",
   "message": "I don't fuck with anyone, literally couldn't be bothered with that shit. Once you learn to let everything just roll off your back, learn your place, or mind your business.. life becomes a tad more peaceful.",
   "created_utc": 1690760039,
   "score": 66,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju54cg4",
   "message": "When I was a university student, I did not mess with campus cafeteria or food court folks. As a result, I often got free perks. (For example, once they messed up an order and made a mushroom burger for someone by mistake; instead of throwing it away, they saved it for me because they knew that I'd be coming later that morning.)",
   "created_utc": 1690763527,
   "score": 60,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4p0iv",
   "message": "Wu Tang Clan",
   "created_utc": 1690756416,
   "score": 106,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju55mmw",
   "message": "People who always play the victim mentality \u0026amp; act like everything is everyone else’s fault. They never take accountability for things they’ve clearly done.",
   "created_utc": 1690764143,
   "score": 65,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju55zhn",
   "message": "People with road rage, I’ve seen the movie Unhinged. No thank you!!",
   "created_utc": 1690764314,
   "score": 66,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4pzyq",
   "message": "Beware the old man in a profession where men die young",
   "created_utc": 1690756858,
   "score": 232,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju57aye",
   "message": "Anyone who handles my food, money, or haircuts for starters.",
   "created_utc": 1690764940,
   "score": 125,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4r9bj",
   "message": "Anyone who has less in life to lose than you.",
   "created_utc": 1690757433,
   "score": 210,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4nn77",
   "message": "I don't fuck with girls who have controlling boyfriends anymore. If you wanna be with Mr. McBeatyoass that's cool, just don't involve me or my friendship cuz I don't fuck with you.",
   "created_utc": 1690755790,
   "score": 42,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju51vvl",
   "message": "Red Foreman",
   "created_utc": 1690762355,
   "score": 85,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju5fjed",
   "message": "The silent ones it’s always the silent ones especially the nice quiet ones who appear to be well put together and well spoken.\n\nThey are the most dangerous types.",
   "created_utc": 1690768931,
   "score": 40,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4p3yt",
   "message": "I don't Fuck with people who are tired/ complain all the time. I know it's rough out here, and right at that moment they \"probably\" do have it worse than the people around them. But life is a ride, and I just don't have the mental space to devote my time to people who aren't down for it anymore. Everyone complains sometimes, and that's cool, necessary even. But when it becomes a constant it's a different thing. I look for people who give each other energy through the hard times these days, and try to be the same way.",
   "created_utc": 1690756458,
   "score": 235,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju59eag",
   "message": "Never fuck with people that don’t clean up after their pets. It’s generally a good indicator that they don’t believe the rules apply to them, don’t care about the welfare of the community, don’t care about others, \u0026amp; can not be bothered/trusted to do the right thing when no one is looking.",
   "created_utc": 1690765953,
   "score": 80,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju57k4h",
   "message": "Ludacris... i dont know him like that",
   "created_utc": 1690765064,
   "score": 36,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju5dz65",
   "message": "beekeepers\n\nI feel like they can rally the troops",
   "created_utc": 1690768180,
   "score": 36,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju5ff7i",
   "message": "The \"quiet guy\" because once you trip over that line hassling them you won't know till it's too late.",
   "created_utc": 1690768875,
   "score": 39,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4qqb5",
   "message": "Those people always trying to one-up everyone around them on everything.",
   "created_utc": 1690757192,
   "score": 96,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4pl2s",
   "message": "Primitive stupid aggressive machos. They don't know when to stop and don't care about getting caught.",
   "created_utc": 1690756671,
   "score": 87,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju5avf5",
   "message": "Never, ever mess with the quiet ones in a meeting. They’re quiet because they’re listening, taking in info, and thinking about next steps. \n\nThe ones doing all the talking never shutting up? You can mess with those people.",
   "created_utc": 1690766663,
   "score": 75,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju5613u",
   "message": "Miracle Whip people. I'm from a mayonnaise family. We weren't allowed to mix with Miracle Whip people (if you can even call them \"people.\") It may not be PC, but I think they should just stay in their own neighborhoods, and not bring trouble to us hard-working mayo folk.",
   "created_utc": 1690764336,
   "score": 95,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4z2je",
   "message": "Farmer",
   "created_utc": 1690761027,
   "score": 28,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju5g4s9",
   "message": "A millionaire who still mows his own lawn.",
   "created_utc": 1690769219,
   "score": 25,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju6c4sv",
   "message": "A gentle person who's been pushed too far. When they break, they break with collateral.",
   "created_utc": 1690789491,
   "score": 27,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4usfs",
   "message": "I don't fuck with people who have nothing to lose.",
   "created_utc": 1690759045,
   "score": 51,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4u36r",
   "message": "Anyone with less to lose. Crazy people, aggressive drivers, drunks and losers.",
   "created_utc": 1690758724,
   "score": 68,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju55ynh",
   "message": "Leroy Brown",
   "created_utc": 1690764303,
   "score": 65,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju55ghm",
   "message": "Tweakers",
   "created_utc": 1690764063,
   "score": 21,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju59ui7",
   "message": "The Quiet guy, you have no clue what he's about",
   "created_utc": 1690766173,
   "score": 20,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4ye9o",
   "message": "The one with \"POOR IMPULSE CONTROL\" tattooed on their forehead",
   "created_utc": 1690760713,
   "score": 56,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju54k8k",
   "message": "People that are mean to service workers of any kind. And people that are mean when drunk. It’s who they really are and I try to surround myself with kindness",
   "created_utc": 1690763633,
   "score": 81,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju5ivml",
   "message": "The people who do your laundry and cook your food and serve your dinner. Who make your bed and guard you while you're asleep. Who drive the ambulances. Who direct your calls. Cooks and taxi drivers. Who process your insurance claims and credit card charges.\n\nThe middle children of history, raised by television to believe that someday they'll be millionaires and movie stars and rock stars, but they won't. And they're just learning this fact. So don't fuck with them.\n\n(on a more serious note, just don't fuck with people in general, makes the world a nicer place)",
   "created_utc": 1690770568,
   "score": 15,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju53dvh",
   "message": "I’m assuming this is as in someone who wants to fight, if so… this is an easy one for me.  It’s the crazy one that won’t stay down and keeps coming at you.  I’ve been a musician and hung out in seedy bars for many years.  When I was young I was trained in self defense and how to fight and I’ve been in several fights over many years.  I assure you I’m not the type to go looking for fights, and try to talk my way out of what I can, but sometimes it’s unavoidable, especially when alcohol and other illicit substances were about.  The guy that’s bigger, stronger, menacing looking, they never really struck fear into me… it’s the guy that keeps getting up and won’t stay down no matter how much he’s taken.  You don’t get a break, you can’t turn away.  You can’t get to what’s next and settle your nerves.  Those are scary dudes!",
   "created_utc": 1690763066,
   "score": 43,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju52atu",
   "message": "Anyone who bases their entire personality off zodiac signs",
   "created_utc": 1690762551,
   "score": 57,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju56lp7",
   "message": "Anyone with visible racist tattoos. People like that are fast to overreact and escalate unnecessarily. Doesn’t even matter what race you or they are. White supremacists are just about as quick to kill a white person they see as inferior as they would another race.",
   "created_utc": 1690764608,
   "score": 12,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4x025",
   "message": "I don’t see a point in fucking with anyone. Treat people how you would want to be treated. Don’t you learn that in kindergarten?",
   "created_utc": 1690760062,
   "score": 38,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju52md8",
   "message": "Generally, I don't fuck with people who stay silent after they've been deeply insulted and go back to being super nice to you afterwards. Those are the type of people who will destroy you and you won't know it's them. I know this because I and some relatives of mine are like this. I scare myself sometimes.",
   "created_utc": 1690762705,
   "score": 126,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju5au3g",
   "message": "The alternative med/Qanon/antivax/conspiracy theory people.",
   "created_utc": 1690766645,
   "score": 44,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju5xfxs",
   "message": "Gossiping assholes, it’s one thing to make conversation it’s another to say things that damage someone’s character  or the right ear’s perception of that person… but then again I don’t fuck with the type of person to listen to gossip and let that form your opinion of said person without knowing them or forming independent opinions of your own",
   "created_utc": 1690778680,
   "score": 13,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4z8k9",
   "message": "People who talk in the movie theater.",
   "created_utc": 1690761105,
   "score": 24,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju50k9v",
   "message": "Those who perform mental gymnastics in a desperate way to deflect logic, reason and factual information.",
   "created_utc": 1690761730,
   "score": 26,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju53ci0",
   "message": "Slim.  Big Jim would know what I mean.",
   "created_utc": 1690763049,
   "score": 27,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju55ura",
   "message": "I try not to fuck with anyone. Cause nearly anyone is capable of ruining your day/life",
   "created_utc": 1690764251,
   "score": 13,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju59s0s",
   "message": "The type whose humor is always at the expense of someone else.",
   "created_utc": 1690766140,
   "score": 21,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju58clo",
   "message": "The calm person. When a bar fight is about to break out, there’s a heated argument etc. the person who goes quiet and just looks very relaxed and in control is probably the last person you want to face if things turn to violence",
   "created_utc": 1690765450,
   "score": 9,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4vwlp",
   "message": "As a psychiatrist, I can say from experience that one would be ill advised to fuck with the crazy…\n\nSome of them are just nice enough to mentally disarm you then POUNCE they unleash pure savagery",
   "created_utc": 1690759555,
   "score": 42,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju4y6g2",
   "message": "As a rule of thumb, don't \\[unprintable\\] with anybody if you can avoid it. As Machiavelli (God bless his soul) so helpfully pointed out, one of the keys to success in life is making sure that other people don't hate you.\n\nIn the event that \"you cannot please everyone\" (as Machiavelli put it), there are two sorts of people you especially don't want to piss off: people you depend on (bosses, spouses, etc.), and people who remain calm when confronted.\n\nThe latter may not seem immediately obvious, so to illustrate my point, here's a story my grandfather used to tell.\n\n\"Once, back in Spain, there was a respected late-middle-aged man, who in his youth was an accomplished knife fighter. One day, he and his thirteen-year-old son went to the market, to get groceries and such. While they were in a shop, a young man came up to the old knife fighter and demanded a duel, in the hopes that he would win, and so gain honor. The man said, 'No.' Irate at being brushed off like that, the young punk made the same demand again, more loudly, only to receive another calm 'No.' By this point, a small crowd had gathered, and the prospective duelist was forced to leave.\n\n\"The older man's son, who had been standing with the shopkeeper while all this happened, commented that he was disappointed that his father would dishonor himself by refusing a duel. The shopkeeper angrily responded, 'No! The reason your father refused was because he didn't *need* to fight to maintain his honor. Had he accepted, the only result would have been that overconfident young fool's death.'\"\n\nTL;DR: Don't piss off people who keep their cool. There's generally a reason they're able to do so.",
   "created_utc": 1690760611,
   "score": 62,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju5bevb",
   "message": "Beware the quiet man.",
   "created_utc": 1690766928,
   "score": 7,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju52vgw",
   "message": "Drunks. Drug people. Or anyone drugs or drunk adjacent. Its just not worth it to waste any time.",
   "created_utc": 1690762828,
   "score": 15,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju53904",
   "message": "I AINT FUCKIN WIT UUU!!!",
   "created_utc": 1690763003,
   "score": 16,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju54n4w",
   "message": "Crazy people who fight the air.",
   "created_utc": 1690763671,
   "score": 7,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju547hd",
   "message": "\"Crazy\"\n\nThe type of person who lacks impulse control and the fear of consequences.",
   "created_utc": 1690763460,
   "score": 12,
   "submission_id": "15dye06"
  },
  {
   "comment_id": "ju59ma9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15dye06"
  }
 ]
}