{
 "submission_id": "15dzpl1",
 "title": "What was the root cause of your sexless relationship?",
 "selftext": "",
 "created_utc": 1690759113,
 "permalink": "/r/AskReddit/comments/15dzpl1/what_was_the_root_cause_of_your_sexless/",
 "score": 37,
 "url": "https://www.reddit.com/r/AskReddit/comments/15dzpl1/what_was_the_root_cause_of_your_sexless/",
 "comments": [
  {
   "comment_id": "ju59ulq",
   "message": "Lexapro",
   "created_utc": 1690766174,
   "score": 61,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5b55b",
   "message": "My relationship was sexless. My ex wife's sure wasn't.",
   "created_utc": 1690766796,
   "score": 157,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5f6rr",
   "message": "Our nineteen year old son killed himself 4 years ago.  Depression and medication killed our sex life.",
   "created_utc": 1690768764,
   "score": 145,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju56dvi",
   "message": "My antidepressants have killed my sex drive completely.",
   "created_utc": 1690764505,
   "score": 98,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5c0kf",
   "message": "When things are not good in other areas of the relationship it tends to affect that part.",
   "created_utc": 1690767221,
   "score": 46,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju562sd",
   "message": "Lack of a functioning penis.",
   "created_utc": 1690764358,
   "score": 243,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju4xd3k",
   "message": "Kids are an antidote to mom-and-dad's \"alone time\".  Funny how that works.",
   "created_utc": 1690760230,
   "score": 215,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5fpdf",
   "message": "Menopause. (After several years I haven’t had sex in so long I’ve forgotten who gets tied up)",
   "created_utc": 1690769012,
   "score": 249,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju6777l",
   "message": "After many conversations and education and practice, my boyfriend still refused to even try to give me an orgasm. He wouldn't use a vibrator because he \"didn't want me to think he wasn't trying.\" So he just did... Nothing.. instead. So I avoided any situation that could even slightly lead to sex for months and he never said anything",
   "created_utc": 1690785596,
   "score": 33,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju54u6s",
   "message": "It's not sexless now but we went through a dry spell. It was a mixture of depression, stress, body changes, lack of sleep. He was fighting through a tough depressive episode, we were both stressed with work and finances, neither one of us was sleeping well (him with sleep apnea, and I couldn't handle is snoring or sleep comfortably on the couch), and I had gained weight and was at my heaviest and I was uncomfortable and self conscience in my body.",
   "created_utc": 1690763765,
   "score": 189,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5ezpr",
   "message": "Metastatic breast cancer. My bits don't work, and even if they did, I have no interest in sex.\n\nMy husband is very patient. He gets naked cuddles in bed and I have my ways of satisfying him.",
   "created_utc": 1690768670,
   "score": 226,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5xs7l",
   "message": "I don't know, but it legit makes me really depressed, because I feel uninteresting, and undesirable.",
   "created_utc": 1690778896,
   "score": 85,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju6gdi8",
   "message": "Dating, not married. SO works overnights, I work 7-4. She recently moved in with me because her new place won’t be ready for a month (delayed due to new contradiction holdup). \n\nI’ve asked her not to wake me up when she returns home around 3:30 because I wake up at 5 and I would like to get a full nights sleep. But I don’t fall back asleep when she wakes me up. \n\nIt’s not like her crawling into bed wakes me up. Oh no. She comes to my side of the bed, turns on the bedside lamp and intentionally wakes me up to either tell me about something her night at work, or something menial like hey did you mean to leave the light on in the garage? Or hey, did you eat the leftovers I put in the fridge for you? Or hey I just wanted to tell you I made it home. \n\nI’ve repeatedly asked her to stop doing this. She does not stop. I’ve resorted to sleeping with an eye mask and ear plugs to try and remain asleep, but she will rub my shoulder or poke me arm until I am awake. \n\nIt’s been a complete turn off. I don’t want to be intimate with her. I feel like she is blatantly ignoring my needs for sleep. In the course of 3 weeks she’s woken me up at least 9 times. \n\nSo yeah, that’s why we aren’t having sex. And that’s why I’m posting this at 3:45 am.",
   "created_utc": 1690792969,
   "score": 30,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5q254",
   "message": "Both of us are on antidepressants. But when we want some naughty time, we take a few hours and audit each others taxes.",
   "created_utc": 1690774319,
   "score": 87,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5jkz5",
   "message": "Being mostly ignored and treated like I don’t matter for years. Resentment is a hell of a mood killer.",
   "created_utc": 1690770920,
   "score": 22,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5awns",
   "message": "Just kinda became that way after the kids. And I just couldn’t be attracted to someone that was emotionally and mentally abusive. He’d call me a stupid bitch or a worthless leech (I was a SAHM) and an hour later try touching on me asking if I wanted to go upstairs in the middle of the day  while the kids were up and about. And then when we did do the act, there was no real connection. No kissing, no touching, no foreplay… and most clothes still on. Just straight to it and done. I lost all interest.",
   "created_utc": 1690766680,
   "score": 102,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju58oc2",
   "message": "[deleted]",
   "created_utc": 1690765606,
   "score": 6,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5yp6s",
   "message": "I just turned 41. We just celebrated our 19th wedding anniversary and we've now been together 21 years. The first year or so of our relationship we were sex crazed kids doing it everywhere and anywhere. Then ironically about the time we got married two years into the relationship she started to become a bit disinterested in sex. \n\nI started asking her why. She said she needed more help with laundry. We had previously split the chores to where I was doing dishes and trash and she was doing laundry. We agreed that maybe laundry was the bigger chore so I started helping her with that. We were married and didn't have a lot of money both of us pretty much worked minimum wage jobs. After I started contributing to laundry then she told me money was an issue for her. So I took a higher paying job in a field I didn't enjoy to fix our money problems. Sex still wasn't happening very often and then she said it was because we rent and don't own. Thats a mountain that I couldn't really climb so I decided we would just rent a large house instead of a small apartment I didn't have the credit or capitol to own a house at that time. Now a few years have gone on and she's gained weight and she tells me that its because she doesn't like how she looks. Each time I'd pass a hurdle our sex life would tick up for a week sometimes if I was lucky two weeks. \n\nShe had always been a big book nerd which I thought was awesome. I loved to read as well. About a decade into our relationship she had this new moms group on facebook. They all started reading this book series and she thought she'd give it a try. So she reads the first book of Fifty Shades of Grey and like some other women that read it they decided that was what they wanted. So our sex increased for a few months while she was in the afterglow of this book series but it inevitably fell again. She kept telling me how she wanted this relationship where I make the decisions and I tell her what to do. I was never comfortable with it. I like making decisions and I'm good at it so I decided to roll with it. But of course any time I would make a decision she didn't like she'd balk at it. Completely defeating the idea of the relationship that I didn't want to do in the first place. \n\nWe had another uptick in sex that lasted for some good months when she decided she wanted us to try for a third kid and I agreed. We had an early, often and active sex life for about three months while we tried. After she got pregnant the sex obviously went dark again and stayed so. I was really understanding. I started asking if we could see a counselor and she always refused. \n\nEvery time I bring it up she'd spark back up with sex for a week or two to kind of quiet down the talk. Then of course things would go dark for a few months again. Finally in 2018 after 16 years of marriage and 18 years of being together and our sex life being spotty I still didn't learn. I finally bought her a house. I saved up, I paid a massive down payment to get our monthly payment low and moved our family of five into the new house. This was her ultimate goal always and I accomplished for her. Around this time she got to be a stay at home mom as well since I got promoted multiple times at work and was making more than both of us combined made just a few years prior. She had the house she wanted, she had the job she wanted and I thought the sex would come. It didn't. Earlier this month we went on our first vacation as just a couple since we started having kids. The buildup to this was hyped up. She was talking about all of this stuff she wanted to do and I thought she's on a tropical island, on vacation, away from all distractions including our crazy kiddos. We get off the plane and she asks to take a nap. After the nap we out to this great place to eat, the service was fantastic, the view even better. She comes home and lays down and I massage her for 45 minutes. I start to try and get things started and she told me she was really sleepy and needed to go to bed. \n\nShe won't see a counselor about it, my dick don't work as well as it used to, I love her and the kids too much to leave and so after 20 plus years I finally accepted after vacation that things are never going to be better and that I can accept that and love the other aspects of her or I could leave. I love her and the kids too much so I'll just accept sex isn't a thing for us. She's made mention of growing up and her mom really making her self conscious about sex and her body and the very amateur counselor in me suspects her hang-ups with sex come from this and maybe if she would have seen a counselor any of the times I suggested it we could have gotten past it but her parents are both very big at closing up in a discussion and she follows suit so I suspect the only thing more awkward than dealing with her sex life was talking to a stranger about dealing with her sex life. Its a long post nobody will read but typing it out brought me a little bit of closure to a subject I've struggled with emotionally for two decades.",
   "created_utc": 1690779481,
   "score": 168,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju4v4d8",
   "message": "I'm browsing new on AskReddit. If it doesn't get any more obvious than that I can't help you.",
   "created_utc": 1690759198,
   "score": 101,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5m6uk",
   "message": "Being so single that even the thought of going on a date scares the living shit out of me",
   "created_utc": 1690772245,
   "score": 28,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5kvk6",
   "message": "Children.  Professional cockblockers",
   "created_utc": 1690771572,
   "score": 87,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju58nxt",
   "message": "For us, we're still im this place- depression,  horrible stress,  physical illnesses for both of us, weight gain. The past couple of years have been very difficult for us.  However, we're still very affectionate and still are \"handsy\" with each other. We just are both in a bad place with our own bodies and minds.\nPlus we're older now and I am now in full blown menopause.",
   "created_utc": 1690765601,
   "score": 153,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju4vacj",
   "message": "getting old and fat is naturally anti-sex",
   "created_utc": 1690759272,
   "score": 173,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5p3r8",
   "message": "My wife's time in the navy severely screwed-up her lower back. So much so that she has had multiple health care providers estimate that if she were to become pregnant, having the child would cause her to become wheelchair-bound possibly for life.\n\nMy time in the Marines exposed me to some of humanity's darkest personality traits. Things I wish I never saw and could more so forget... but can't. As a result, I have psychological ED.",
   "created_utc": 1690773788,
   "score": 44,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju62q71",
   "message": "Partner has no sex drive, plus refuses to initiate. Currently feel depressed about feeling unwanted and now also don't want to have sex with her.",
   "created_utc": 1690782256,
   "score": 123,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju58tg9",
   "message": "Differences in drive, medication side effects, other priorities in life, and not being in our 20s any more.",
   "created_utc": 1690765675,
   "score": 63,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju4ynip",
   "message": "Just growing apart/evolving out and different interests or wants and needs.",
   "created_utc": 1690760832,
   "score": 79,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju642fg",
   "message": "Toddler.\n\nMy wife is smeared with peanut butter and boogers on a daily basis. The only thing she wants at night is for me to not lay a finger on her.",
   "created_utc": 1690783227,
   "score": 59,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5tb2z",
   "message": "1) My wife and I have a 9 month old daughter and can’t find much time.\n2) I work approx. 60 hours a week as a corporate slave on top of a 1 hour commute each way to the pharmaceutical plant. \n3) I have MDD and experience suicidal ideations regularly making it practically impossible to go through everyday life with any semblance of joy or even mild comfort.\n4) My wife is still is in moderate pain from the emergency C-section.\n5) My wife took birth control for years prior to our marriage and it basically nuked her endocrine system and she has practically no libido among other issues (out of respect for her I won’t list them).\n6) We are drowning in debt because I’m the only income source (not her fault and I don’t resent her in any way) and the medical bills for the birth and my in patient stays (5150 holds) in the past were put on CC’s because we simply just didn’t know what to do and were ignorant. \n7) I eat SSRI’s like candy are have no libido. \n\nI genuinely and truly don’t want to be alive anymore and the only reason I haven’t eaten every pill in our home is because I have a responsibility to my family to do everything possible for them to live as fulfilled a life as possible until they don’t need me anymore. Once I’m absolved of that responsibility I’ll finally be able to go back to the mountains I grew up in and OD on sleeping pills in the hammock I used to love.  My literal only reason for existing is to provide, regardless of whatever platitudes (I think that’s the right word) my wife says about how that’s not the only reason. \n\nFuck.",
   "created_utc": 1690776159,
   "score": 67,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5fyso",
   "message": "Not sexless,but very near. We have hurt each other too much to really feel Interested",
   "created_utc": 1690769139,
   "score": 78,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5dux6",
   "message": "My wife is asexual.",
   "created_utc": 1690768124,
   "score": 167,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5h0qr",
   "message": "She sustained major back and hip injuries in a car accident.",
   "created_utc": 1690769649,
   "score": 46,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5e4a8",
   "message": "Marriage, getting older, both of us getting fat and not taking care of ourselves, kids. I could go on and on.",
   "created_utc": 1690768248,
   "score": 96,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju4wo4r",
   "message": "Mutual anxiety surrounding being lovable.",
   "created_utc": 1690759908,
   "score": 21,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5le82",
   "message": "Mostly stress, work-life imbalance, depression. That general combo and the grind is exhausting. I know I should want to want to be physical more, but…I also really need alone time. I’m an introvert. My batteries get low.",
   "created_utc": 1690771840,
   "score": 27,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju55yyu",
   "message": "The 3mo finally sleeping on me in a rocking chair.",
   "created_utc": 1690764308,
   "score": 103,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju57dbl",
   "message": "He decided video games, anime, and porn were more valuable.",
   "created_utc": 1690764971,
   "score": 181,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5ll1p",
   "message": "I don't have the issue anymore but for about 6 months whenever things were gonna pop off with my old lady I'd get performance anxiety every single fucking time...my guy would just go from ready to go to shrinking and then my heart would start pounding and I'd overthink it and that was it. Eventually started doing some breathing exercises when I found myself getting in my own head. was so frustrating and infuriating",
   "created_utc": 1690771934,
   "score": 56,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5nizm",
   "message": "Zero appreciation, zero credit, constant criticism and insults. I’d muster up enough in me to bang her out and leave her thoroughly satisfied for my own sanity and in our brief moments of intimacy- with a small glimmer of hope to rekindle things- she would promptly complain about how we don’t have enough sex. \n\nFinally done and I am so fucking grateful.",
   "created_utc": 1690772941,
   "score": 139,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5k0u3",
   "message": "Wife doesn't like sex because of some previous trauma (she was date-raped prior to me), so we don't have sex. It's not a big deal, TBH. I'd rather not have sex with her than have sex with her if she doesn't feel right about it.\n\nShe's working on her issue, which is all I can ask of her.",
   "created_utc": 1690771140,
   "score": 71,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5w5vi",
   "message": "My body realized before my brain did that I wasn’t attracted to them anymore",
   "created_utc": 1690777873,
   "score": 61,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5611c",
   "message": "His crippling depression",
   "created_utc": 1690764335,
   "score": 30,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju6ibbk",
   "message": "Two bottoms don't make a top",
   "created_utc": 1690794556,
   "score": 30,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5u3d6",
   "message": "Not sexually attracted to guys who turn out to be abusive man children.",
   "created_utc": 1690776624,
   "score": 61,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju59k3x",
   "message": "She used it as a means of control-like everything else.  We had countless conversations where I told her it would be nice if she initiated every once in a while.  Since she didn't and I did, I was the one that was getting rejected.  After awhile, I quit asking, then when I decided it was over, I moved to the couch, then took over the den.",
   "created_utc": 1690766032,
   "score": 104,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5ef9s",
   "message": "Long distance 😞",
   "created_utc": 1690768394,
   "score": 13,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju663xv",
   "message": "We were both tops",
   "created_utc": 1690784750,
   "score": 15,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5ahfo",
   "message": "She turned out to be a lesbian",
   "created_utc": 1690766477,
   "score": 36,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5kziy",
   "message": "Loss of excitement, lack of enticement from partner, partner sex skills aren’t great, depression.",
   "created_utc": 1690771628,
   "score": 39,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5skcy",
   "message": "My wife has no drive. Most people see something or think a sexy thought and that gets them in the mood and they want more.\nFor some people they need to be actually touched to get in the mood.\nSo the problem becomes, they are not in the mood so don't touch me.\nIt took me 20 years to figure it out.\nThen another 10 to get her to let me try.\nAfter 30 years of marriage I've cracked the code. It turns out it's a real medical condition. The trick is reminding her that she likes to have sex. And getting her to allow you to try and turn her on.\nImagine how difficult it would be to convince you to have sex if you really were too tired or thinking about work tomorrow or pissed off about something that the kids did.\nImagine you want to relax or want to be left alone.\nIt might take a herculean effort to get you in the mood even with being touched.\nAnd you can't just tell her what you want to do to her. It doesn't work that way. You HAVE TO TOUCH HER. She has to be stimulated. And as much as it works, like nearly every single time, at the moment you begin, it's NOT working.\nSo everything inside her is literally saying no I don't want this.\nEven though she KNOWS it will work if she just let's it.\nSo that's where we are at. She will even recognize when it's a good time to try.\nSo that's been my job. I make sure the time is right. If I can I try to make the environment one where she can relax. I make the suggestion early enough that we aren't waiting till very late to try.\nI don't piss her off about anything stupid.\nTry to make sure I don't leave some mess for her to deal with.\nI take a look at my honey do list and knock something significant off of it.\nMy suggestion to anyone reading this is start early.\nThe problem for me is that after 30 years of marriage and begging for sex...... I'm not able to perform very well because of health problems.\nSo now I'm the one with issues.....\nTrying to work through those now.\nThe moral of the story is talk it out. Get some help if you can. Listen to your partner.\nThere's a way to sort it out if you want to.\nBut you  BOTH have to want to.\nIt can be pretty incredible having sex with someone you have been with for a long time.\nEspecially if you can really talk to each other about it.\nGood luck.\n\n\nEdit: Sorry folks. When i typed it it WAS in paragraphs with double spacing. No Idea why it looks like this.\nEven as I edit it, there are many paragraphs....",
   "created_utc": 1690775728,
   "score": 109,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju59d8q",
   "message": "Resentment. It had been growing for years. It also could've been because I was unhappy not traveling like I used to. Divorced now.",
   "created_utc": 1690765939,
   "score": 45,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5pgkk",
   "message": "My asexuality, I guess?",
   "created_utc": 1690773985,
   "score": 48,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju58p1f",
   "message": "Depression.",
   "created_utc": 1690765616,
   "score": 26,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5aa01",
   "message": "My husband decided he liked someone else better.",
   "created_utc": 1690766377,
   "score": 26,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju70q81",
   "message": "She likes sex at night when I’m tired and I prefer in the morning when she likes to sleep.",
   "created_utc": 1690806660,
   "score": 26,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5mj2s",
   "message": "Religious trauma and being indoctrinated from growing up in purity culture",
   "created_utc": 1690772421,
   "score": 12,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5htqi",
   "message": "Stage 4 cancer",
   "created_utc": 1690770045,
   "score": 13,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5i66e",
   "message": "Porn addiction.",
   "created_utc": 1690770215,
   "score": 46,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5ekb3",
   "message": "Would love to see both perspectives here. I wish I knew. I think most of us can only assume what’s made it that way but who really knows what our partner is thinking.",
   "created_utc": 1690768462,
   "score": 23,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5j1mf",
   "message": "He was horrible in bed and it wasn't worth the trouble.",
   "created_utc": 1690770652,
   "score": 18,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju6kxmf",
   "message": "To signal her arousal, she would whisper to me,'my vagina smells'. \nWhen I told her that it had the opposite effect on me, she refused to stop and told me I would just have to deal with it. Even went as far as to tell me she was going to sit on my face the next time she smelt down there",
   "created_utc": 1690796682,
   "score": 20,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju60csc",
   "message": "His nonexistent libido",
   "created_utc": 1690780589,
   "score": 11,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju6kecn",
   "message": "My wife's low libedo.  Then breast cancer followed by anti-hormal drugs. Forced early menopause killed what little was there for good.  I love her..she's a terrific wife, but the latent sexual frustration makes me unhappy.  Alas, I'm 60 and \"blessed\" with still fully functional equipment and no way to use it without destroying the rest of what we have.\n\nNext week our son is moving 1/4 of the way around the globe and out of our lives.  Despite being supportive, I have a terrible gut feeling he's doing the wrong thing.  Pervasive thoughts of ending it all have become more frequent.",
   "created_utc": 1690796254,
   "score": 8,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5jd7d",
   "message": "Betrayal. Not infidelity, it was something else. My then wife violated my trust on something.\n\nI didn't believe a single word that came out of her mouth after that. When you don't trust someone enough to accept what they say at face value, how are you supposed to trust them with sex?\n\nMy marriage died almost instantly the day after the wedding. We didn't have very much sex ever even tho we were married for a few years.",
   "created_utc": 1690770813,
   "score": 41,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju6365t",
   "message": "Cheating, kind of hard to want to be intimate with someone you feel you can't trust.\n\nEdit: kind of hard lol",
   "created_utc": 1690782574,
   "score": 7,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju6t43w",
   "message": "Refusing to have sex, turns out he was gay.",
   "created_utc": 1690802399,
   "score": 9,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5f01f",
   "message": "Pelvic pain, stage 4 endometriosis and severe depression. Luckily, i have a husband who understands this but I feel so guilty. Hoping things change soon. It’s very hard.",
   "created_utc": 1690768674,
   "score": 34,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5ocbj",
   "message": "Past relationship,but it was because he wouldn't clean up. At all, ever. Killed everything I ever felt for him when he Mom-zoned me like that. Of course, despite multiple conversations about it, he will still tell you there was \"no reason at all,\" and it totally came out of left field because \"women are crazy.\"",
   "created_utc": 1690773373,
   "score": 16,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5fs8k",
   "message": "I wish I knew. Got together 2.5 yrs ago. First time was last time. Now he's sick and he has no outlook for a physical relationship. We don't touch, never have. I transitioned from girlfriend to caregiver and that's all I've  been now more than a year. A non-paid caregiver that's going broke and if I suggest we separate (it's my house), I'm irrevocably criminal.",
   "created_utc": 1690769050,
   "score": 23,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju6hoan",
   "message": "He made me feel so unsafe by assaulting me in my sleep and got off on choking me unconscious. So glad I got out",
   "created_utc": 1690794036,
   "score": 15,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju6lzp0",
   "message": "Haven't seen a lot of younger couples without kids answering, so here I go. My partner (30) and I (25) are both dealing with some difficult life circumstances at the moment. He's got a lot of debt, and both his parents recently got really sick; alzheimers and stroke. Around the same time, I found out that I'm also sick (chronic illness).  \n\nHis financial situation will hopefully change soon now that's he's graduated and got a job. But still, due to the progression of the alzheimers disease, he's basically just watching his mom disappear in front of his eyes. Sex is just not a priority right now and hasn't been the top priority for a couple of years. We do try to show our love for each other in different ways.",
   "created_utc": 1690797501,
   "score": 7,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5m08u",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15dzpl1"
  },
  {
   "comment_id": "ju5qy75",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15dzpl1"
  }
 ]
}