{
 "submission_id": "15dzme3",
 "title": "What's the most hurtful thing someone has ever said to you?",
 "selftext": "",
 "created_utc": 1690758878,
 "permalink": "/r/AskReddit/comments/15dzme3/whats_the_most_hurtful_thing_someone_has_ever/",
 "score": 27,
 "url": "https://www.reddit.com/r/AskReddit/comments/15dzme3/whats_the_most_hurtful_thing_someone_has_ever/",
 "comments": [
  {
   "comment_id": "ju5159h",
   "message": "\" I cheated on you, and the only reason I'm telling you is because I'm pregnant. \"",
   "created_utc": 1690762007,
   "score": 39,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju56nov",
   "message": "When I was younger, my mom was diagnosed with breast cancer. My siblings and I shaved our heads to support her. This kid told me that “he hopes my mom dies” and that I looked like I was in the holocaust. She has been cancer free for 13 years, but fuck that kid.",
   "created_utc": 1690764634,
   "score": 241,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4vnv0",
   "message": "When I was young, my mom said holidays are better without me.",
   "created_utc": 1690759441,
   "score": 91,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4z1pd",
   "message": "\"You'll never be loved or cherished because you look like me. You will never belong anywhere, no one cares about you enough to actually be there for you. You will be a burden to everyone else.\" - From Dad to 11 year old me after we argued about how he missed my birthday(again)\n\n\nBut looking back, I laugh because.... it seemed like he was projecting his own insecurities onto me. Lol😂",
   "created_utc": 1690761016,
   "score": 100,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju52keh",
   "message": "Locked in the bathroom, naked. \n\"Just look at you! You're fat and ugly. Nobody will ever love you the way I do.\" - ex-husband \n\nHe was right, I married someone who does love me, just not the way he 'loved' me. Thank God",
   "created_utc": 1690762679,
   "score": 127,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju53uel",
   "message": "\"You are nice but damn, I have rarely seen someone as ugly as you\". \n\nFor context, teenagers summer camp, I was 17. This guy was supposed to be someone I was getting along with quite well (the whole group but we were a few being always together). \n\nI was seated chatting with the whole groupe and he came to say that randomly. \n\nI wasn't even interacting with him. Like, he said my name so he could have my attention. \n\nIts like he NEEDED to say it in front of everyone and he didn't feel like he was saying something wrong. \n\nWhat was weird is that, he wasn't even laughing. Its not like someone or some people were trying to make fun of me. \n\nIt was so harsh that people were speechless. No one laughed. At all. I think they were as much confused as I was. \n\nI appreciate no one jumped on that after those \"wtf\" 20 seconds, they all went like nothing happened. \n\nI am 35 and still remember this. Knowing how teenagers can be cruel, I hate this had a huge impact on me but I remember people really tried to not make it a big deal. The group didn't fall into that shit and they were between 15-17 years old. \n\nI think someone even said to the guy \"are you being serious right now??\".\n\nBut I am not sure. I was really trying to swallow the humiliation.\n\nEdit : I posted yesterday my night here just because I felt like to and was not waiting for any answers at all. I woke up and saw your comments and was again confused why so many people gave attention to my post. \n\nThanks for your support. I feel fine today and I know I am cute and most of all nice, funny, loyal and people want to be around me. \n\nBut your biggest weakness being exposed in front of a group when you are a 17 I think is something you never forget.\n\nDon't hesitate to share your story. I read all comments.",
   "created_utc": 1690763286,
   "score": 106,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4zhsv",
   "message": "Took my math book up to the teachers desk with a question. I wasn’t grasping it. He slams my book on his desk and asked me if I was stupid or what.\n\nSmall town school about 30 years ago. If I ever run into that prick I have a few things to show and tell him.",
   "created_utc": 1690761224,
   "score": 72,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju50u9p",
   "message": "I have a daughter with an extremely complicated illness. Almost lost her to it twice when she was almost 3 and again 6 months later. In-between, this was 15 years ago, I broke down and wept, being so worried about her and also how distant my wife had become from me as well. After I settled down my wife told me that me crying like that had made me less attractive.\n\nMy daughter is very stable now and I've been divorced for several years.",
   "created_utc": 1690761862,
   "score": 198,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju508v8",
   "message": "\"You're a stupid diaper wearing cripple and the world would be better off without you.\" - my middle school bully.  \n\n\nFor context I have spina bifida and suffer from total incontinence due the nerves not working right.",
   "created_utc": 1690761580,
   "score": 100,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju527bo",
   "message": "I had a theatre teacher/“director” pull me aside after a show that I totally spaced a queue/line (it honestly was a super insignificant line, and the other actor improvised very well) and she straight up told me \n\n“Putting you in this show was the biggest mistake I’ve ever made. You’re a disappointment”\n\nShe got fired 2 years later and went to jail for a couple of years for banging my best friends cousin who was a 15 year old student. \n\nI wonder if putting me in a play with one line was the biggest mistake she’s ever made.",
   "created_utc": 1690762505,
   "score": 136,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4zisd",
   "message": "I had struggled with infertility for years. At my dad's funeral my step sister said \"I bet you feel bad that you never gave him any grandkids.\"",
   "created_utc": 1690761236,
   "score": 44,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju5253w",
   "message": "My dad one time told my mom over the phone while I could hear that he didn’t want a relationship with me anymore\n\nEdit- okay so I definitely didn’t expect that to blow up as much as it did or to receive any awards, but thank you so much guys ❤️ don’t worry, I’ve commented the full story below and things are a lot better now❤️",
   "created_utc": 1690762475,
   "score": 19,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju51xse",
   "message": "My mum once said to me \"I love you, you're my daughter. But I don't like you. I would never seek you out as a friend.\" I was 21 and it was 40 years ago. I will never get over that, it hurt so much.",
   "created_utc": 1690762380,
   "score": 26,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju518h9",
   "message": "You should do everyone a favor and kill yourself.  Cut across for attention and down for results.  -A person who I called Dad at 12 years old",
   "created_utc": 1690762049,
   "score": 142,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4zf5n",
   "message": "\"You're ugly and under developed.\" I was 10 years old and to this day it still gets to me.\n\nEdit to clear things up: This was said to me by a family friends daughter, she was like 14.",
   "created_utc": 1690761190,
   "score": 27,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju50bpe",
   "message": "Dad to 12 year old me for forgetting to close a gate at the end of a 12 hour work day, \"YOU ARE A WORTHLESS PIECE OF SHIT\"",
   "created_utc": 1690761618,
   "score": 184,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4xp6s",
   "message": "From my boss from my previous job: \"You're a headache to deal with, and I regret hiring you. I wouldn't surprise you don't give your girlfriend, friends, and family a headache\"\n\nI was hired with this guy fully knowing I had little experience with the position I was hired for. I didn't lie during the interview.",
   "created_utc": 1690760387,
   "score": 120,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4zhjy",
   "message": "\"No one will ever love you. \"\n\nThat's the closest i ever got to actually killing myself because i truly believed these words.",
   "created_utc": 1690761220,
   "score": 231,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju537gl",
   "message": "After what I thought was a good relationship in my 30's with my dad, I was having trouble accommodating his wife's son's wedding and my lifelong friends wedding in the same week in two different states in the northeast (I'm on the west coast). I brought up the fact that I was having trouble and my dad tried to fight me (has never in my life been physical before), called me a narcissist, that I'm a piece of shit since I was 17, and that I'm not to talk to him ever again and if he ever sees me again, he will kill me. I didn't even meet my \"step-bro\" until my 30's and spoke to him previously about my difficulty finding flights. Anyway, at the time of the fight I was still trying to find flights to accommodate both, but my dad telling me those things made up my mind for me. It's a shame, he's 71 and I probably will not talk to him ever again. I'm willing, but he is not. His white knight meter is out of calibration to say the least. So dumb...",
   "created_utc": 1690762983,
   "score": 107,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju50k14",
   "message": "My mom denying her abuse towards me even almost a decade later has fucked me up more than I thought. She's way better nowadays, but she's still a narcissist.",
   "created_utc": 1690761727,
   "score": 226,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju501ub",
   "message": "Saw a FB post from my dad and step mom referring to their son as their favorite. My dad and I don’t have a relationship (my choosing after he was a ass my whole childhood). It still hurt seeing that. Especially since he is pretty much father of the year to my stepsister and half brother.",
   "created_utc": 1690761488,
   "score": 65,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4vl7n",
   "message": "\"Inspite of not being good looking, you are so good at studies\". I don't know whether I must feel hurtful or not.",
   "created_utc": 1690759408,
   "score": 167,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju5044y",
   "message": "“You’re just a little girl. No one likes you, no one wants you around. You’re annoying, over the top and loud. Stop being so fucking annoying and maybe someone will want to be with you”\n\nEdit to add another one: “it’s a boy or it’s abortion. I’m not raising a daughter.” I miscarried two days later.",
   "created_utc": 1690761518,
   "score": 235,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4zd94",
   "message": "'People like you are a statistic. Once you fail once you'll keep on failing': head of school when I had to repeat a year in undergrad, consequence of being naive and finding myself in a shitty abusive relationship.\n\nI refused to shake hands with him after my final performance and told him that no, I wouldn't go to graduation because I'd have to shake his hand, when he asked if I was attending. Also quite enjoyed sending copies of my 3 following degree certificates, and signing the letter Dr ... . Prick.",
   "created_utc": 1690761166,
   "score": 214,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju54kfm",
   "message": "My stepmom wrote me a letter when I was in my mid 20s, had 2 kids and happily married saying I had the morals of a alley cat, I was an unfit parent and my husband should divorce me. I was literally Cinderella starting from age 5. She even locked me in a cage.",
   "created_utc": 1690763635,
   "score": 152,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju51sey",
   "message": "The night before my wedding my mother drunkly told me ‘what a horrible,  selfish daughter I was. That my wedding was a fucking circus (it was tented with cafe lights) and she can’t believe what an awful selfish person I am.” Because I had my wedding in the state I had lived in for 6 years and none of her friends/family decided to travel to it. Oh and she decided she would throw her own reception the next week (the reason no one decided to come to the actual wedding) which forced me to forgo a honeymoon and instead travel to my hometown to attend her second reception.\n\nFollowed closely for when I tried to hang myself at 11 in my closet and the rack and shelf fell instead and she told me “you are too fat to hang yourself.”",
   "created_utc": 1690762310,
   "score": 86,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju51uad",
   "message": "My mom told me this when I was 14, and it lead to my first suicide attempt: \"you are a disappointment to me, and everyone who knows you.  I should've just given you up for adoption.\"",
   "created_utc": 1690762333,
   "score": 42,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju5206j",
   "message": "It was the truth, but it was that I was an alcoholic. Hurt bad.",
   "created_utc": 1690762411,
   "score": 12,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4y7qg",
   "message": "Probably the first time my mom said “have a nice life.” Took about 10 more disownings before I said enough’s enough and cut ties. I’m still kind of bitter but have come to terms with it. She still doesn’t understand why I don’t wanna let her back in. Last I heard she disowned my sister (again) too.",
   "created_utc": 1690760628,
   "score": 203,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4ys3r",
   "message": "\"You're too ugly for this industry\" - when I tried to be a hairdresser\n\n\"Just fucking do it\" - my own mother telling myself to kill myself when I was having a bad day\n\nETA: Wow! Didn't expect so much attention from AskReddit of all places. I'm okay - as okay as can be, anyway. I've made as much peace as I'm going to in my situation with my mother. Haven't made much progress in the work thing but at least I'm taken care of. Thanks for all your concern and encouragement, lovely Reddit people! My love to you all \u0026lt;3",
   "created_utc": 1690760892,
   "score": 217,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju51p4m",
   "message": "During a fight my mother called me an \"unwanted bastard child\" because I calmly asked her why she thought it was okay to scream at me in public.  The whole neighbourhood probably heard.",
   "created_utc": 1690762267,
   "score": 123,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4ysms",
   "message": "I’m meant to be alone.",
   "created_utc": 1690760899,
   "score": 11,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4utaq",
   "message": "I posted it earlier.\n\nMy dad told me that dad's often SA their kids because it's \"normal\"....:-(\n\nHe had been SA me n my little brother for years....:-(",
   "created_utc": 1690759056,
   "score": 212,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju51znz",
   "message": "\"She's a fat lazy cow.\" Said by step brother and agreed on by full brother.",
   "created_utc": 1690762404,
   "score": 122,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju52yuk",
   "message": "My father had dementia due to diabetic strokes.  I went to visit him 6 days a week.\n\nA co-worker said, \"I don't know why you go so often...he's not going to remember you were there.\"",
   "created_utc": 1690762871,
   "score": 134,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4x4li",
   "message": "Looking at a picture of myself that my daughter drew.  She *really* has an eye for detail!",
   "created_utc": 1690760120,
   "score": 210,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju513ck",
   "message": "\"Where are your friends? You don't have any friends\" - My Father",
   "created_utc": 1690761982,
   "score": 39,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju53kh8",
   "message": "\"You don't know trauma. You're making it up.\" Mom mocked me, because I thought I had PTSD from childhood trauma. Turns out, I was right.",
   "created_utc": 1690763153,
   "score": 198,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju511df",
   "message": "After I was assaulted by a classmate as a teenager and obviously acting kind of down and moody at home, (24 hours after it happened) my mom looked at me with disgust in her face bc of my attitude and asked “what’s wrong with you?!”\nShe also told me I was an embarrassment to the family when I was 12 and entering my goth phase.\nI have minimal contact with her now as a mid 30s adult lol both my parents are sub par people",
   "created_utc": 1690761956,
   "score": 174,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju53fni",
   "message": "When I was married to my first wife met younger friends at work and started going out on the weekends and then one-day she left before I got home from work without saying where she was or when she was coming back........ I called about midnight to see if I can make sure she was alright and she answered screaming \"what do you want from me!\" I knew at moment it was over.",
   "created_utc": 1690763090,
   "score": 12,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4wetf",
   "message": "\"You look like you've gained 30 pounds since you moved out.\" This was a month after said move. And it was only 5 pounds.",
   "created_utc": 1690759790,
   "score": 153,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju52d2h",
   "message": "Ok so I’ve actually never told anyone this but here goes. \n\nWhen I was younger my parents were going through a very rough custody battle with me right in the middle of it. I lived with my mom and My dad was very emotionally and verbally abusive, he would literally interrogate me so he could have something to take my mom to court with. My mom fought like hell to keep me and I wanted to be with her my dad however thought otherwise. He would take her to court so many times (I’ve only ever been present once at these court sessions) but this one day ( I forget what exactly was going on ) but we were at home and my mom was venting and she said “I won’t deal with this again (talking about court) I’ll just pack your bags for you and you can go live with him.” I remember being very hurt but I didn’t show it. I felt like she didn’t care what she would be sending me too, that I wasn’t worth all the time she spent trying to keep me away from him. I questioned her love for me and if that love had faded, I remember it but we haven’t talked about it since, I don’t even know if I want to talk about it.\n\nEdit: she never actually followed through with what she said",
   "created_utc": 1690762582,
   "score": 224,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju54b10",
   "message": "Ok, I was gonna make a snarky comment. But after reading comments, holly fuck. I wanna give a group hug. Damn I’m tearing up.",
   "created_utc": 1690763507,
   "score": 82,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju53x9a",
   "message": "A teacher told me that with my poor handwriting, I should be working for a trash or waste disposal company.\n\nI took that comment and ended up receiving consistent tutoring for my penmanship and reading comprehension, and I’m now an English/Language Arts teacher.",
   "created_utc": 1690763323,
   "score": 80,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju52ja5",
   "message": "You’re too disgusting to be my girlfriend but I own you, so I can do what I want to you. You’re impossible to love. If I kill myself it will be your fault.",
   "created_utc": 1690762664,
   "score": 93,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju5212p",
   "message": "As a survivor of SA \"if people keep coming onto you then that's something you should work on\"",
   "created_utc": 1690762422,
   "score": 3,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju54w7g",
   "message": "Yo big shoutout to OP for replying to and reassuring everyone!",
   "created_utc": 1690763792,
   "score": 20,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju51r73",
   "message": "My mom told me it was my fault after SA",
   "created_utc": 1690762294,
   "score": 234,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju50rrq",
   "message": "\"You're lying\"...after saying I was S. Assaulted.",
   "created_utc": 1690761829,
   "score": 204,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju517kr",
   "message": "\"I'm glad we never had kids. I wouldn't want them to inherit your mental problems.\" - my ex-wife while I was in treatment for severe depression.\n\nEDIT: For context. We were already breaking up after 13 years together. I'd always wanted to be a father because my own had passed away when i was very young from cancer. We spoke about having children for years.\n\nI had been struggling with depression for a few years before I started treatment, but I was attacked randomly by 4 men on the street and run over by their getaway car which left me with acute PTSD and anxiety. During this time, my ex-wife cheated on me because I was no longer able to emotionally support her.\n\nHer saying that was in the final days of our divorce. It was only meant to hurt me because she knew how badly I wanted a family. I'm glad to be rid of her.",
   "created_utc": 1690762037,
   "score": 149,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju52moy",
   "message": "\"I'm not your mother and I don't want this (a piece of art I spent a month making just for her just for her to throw it back in my, then 8 year old, face) Now go away.\" \n\n~My birth-giver the day I first met her",
   "created_utc": 1690762709,
   "score": 78,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju53aat",
   "message": "\" No wonder your birth parents didn't want you\" - my foster mother",
   "created_utc": 1690763020,
   "score": 220,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju53nx1",
   "message": "“I don’t think you have ADHD, you aren’t hyperactive, I think you’re just lazy, unmotivated, and you don’t care.”\n\nMy ex when I brought up thinking I had it. Years later, guess what I was diagnosed with.",
   "created_utc": 1690763199,
   "score": 56,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju53u0s",
   "message": "To this day, they do not realize how hurtful what they said to me was or how it impacted my whole life. \"It was just luck.\" When I fixed a stereo system my dad was trying to fix. It wasn't luck...but from that point on I felt so stupid. I quit school in the 6th grade and was self taught on everything so that made it worse. \n\nI went to college and got an Associate's. Now, 15 years later, I'm returning to college at 35 to get an (unrelated) bachelor's degree. I start in September. I am not stupid and it's not just luck...",
   "created_utc": 1690763281,
   "score": 61,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4zemd",
   "message": "“You’re annoying” - my best friend (at the time) told me this in middle school and it was her only reason for bullying me. Those words were the end of our friendship and the beginning of my many current insecurities 🙃",
   "created_utc": 1690761183,
   "score": 180,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju52ecn",
   "message": "as the love of my life was walking away, i said i love you.   \n\nshe said - i know you do.\n\nand she was gone.\n\n30 years ago and she still pops up in my dreams a few times a year.   love stinks.  :)",
   "created_utc": 1690762598,
   "score": 143,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju50pgt",
   "message": "When I got out of the psych ward for attempted suicide both my grandmothers said if I was going to do it, to just do it.",
   "created_utc": 1690761798,
   "score": 134,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju52wrt",
   "message": "Not necessarily to me, but to my parents about me.  I have a disability and several years ago a doctor tried to convince my parents that it would be best to put me in a group home and forget about me.  Luckily my parents, with the counsel of my step-grandfather. decided to go against the doctor's advice.",
   "created_utc": 1690762845,
   "score": 72,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4uy0m",
   "message": "All I ever asked for was a son.  You’re useless.\n\nedit: this was my dad to me. I’m the youngest kid - all girls.  I was his last chance at a boy, so I failed at life the moment I was born.  He never forgave me for not being the son he always wanted.  That being said, I never forgave him for being an awful person, so I guess we were even ROFL.  He died almost 30 years ago.  Ta ta, motherfucker….",
   "created_utc": 1690759115,
   "score": 180,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju5394z",
   "message": "My “friend” to me not long after a childhood friend died (like days after):\n\n“You’re like a black hole and spread depression everywhere you go”",
   "created_utc": 1690763004,
   "score": 218,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju51zrq",
   "message": "My husband just tonight told me he doesn’t love me and Im a fucking idiot. Its not the first time and likely wont be the last.",
   "created_utc": 1690762405,
   "score": 52,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju5452u",
   "message": "When I was 10 my mom told me I was the reason my dad was dying of living cancer… he died a few months after that. I am 31 now and suffer from death anxiety.. always thinking the ppl I love will die everyday. Its hard.",
   "created_utc": 1690763427,
   "score": 208,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju55wzk",
   "message": "I had an old “friend” tell me that I could never be a teacher because I wasn’t charismatic enough. I’m now graduated with my credential and masters in education and been teaching for over 4 years. So she can kindly suck it.",
   "created_utc": 1690764281,
   "score": 145,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju533u0",
   "message": "My mom told me I am a disappointment. And never being told “ I’m proud of you” \nShe said it once just because she was drunk\n\nBut she’s a terrible alcoholic and I had to grow up seeing her and also seeing her getting beat my my dad and hearing her scream. And honestly drunk people scare me and I know have ptsd to drunk people and people yelling. \n\nBut I am now 20 and I am in college and my life is going good while she is still a alcoholic.",
   "created_utc": 1690762935,
   "score": 48,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju52kix",
   "message": "Not said directly to me (stuff that's said directly to my face tends to not even bother me a little, for some reason. I'm just used to it.) but my ex, who was physically abusive to me and I stayed with for a long time anyway because I had nowhere else to go and had convinced myself that I loved him, said it to his brother. It was Thanksgiving, dinner was over and I was clearing the table while his family were out in the living room chatting (I got stuck with cleanup duty a LOT, I was the live-in unpaid maid basically) I couldn't lift the turkey platter so I went to ask him for help. He was on the phone with his brother, I heard him say \"Yeah, I wish I could say I love her, but I really don't.\" when I was in the hallway, where he couldn't see me.   \n\n\nEnded up breaking up with him that night, though I should have a LONG time ago with how violent he got when he was irritated about even small things. I felt bad for his mother though, she was in tears a lot of the time, especially around holidays, and once said she didn't know what she'd do if I wasn't there to help her.",
   "created_utc": 1690762681,
   "score": 167,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju53fk6",
   "message": "My ex boyfriend told me I “used to be hotter” while we were having sex.",
   "created_utc": 1690763088,
   "score": 93,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju531ph",
   "message": "My dad has been dead for five years, the “damn your lucky” or “I wish my dad was dead too” is some of the most insensitive thing to ever say to a person right after they let you know their dad is dead.",
   "created_utc": 1690762908,
   "score": 163,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju4zvgi",
   "message": "My first kid has Down Syndrome. Some lady at work asked me when I was pregnant for number two if I would do prenatal testing this time around so I could get rid of it if it turns out like the first one. Exact words. Geez, I hated her.",
   "created_utc": 1690761403,
   "score": 117,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju59n5h",
   "message": "“I can’t love you anymore. I don’t want to go to hell, like you.” My mom, after I came out. My dad agreed. Nothings ever been the same since.\n\nEvery day is a struggle to stay alive.",
   "created_utc": 1690766074,
   "score": 192,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju51k60",
   "message": "Did poor at Physics once and the teacher said, “Such a tall boy, no wonder his brain is in his knees.”",
   "created_utc": 1690762202,
   "score": 145,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju52vfy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju537mf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju50g88",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15dzme3"
  },
  {
   "comment_id": "ju5uw1a",
   "message": "This post is fucked up. \n\nAs a new parent thanks for the extensive guide on how not to be an absolute piece of shit. Sorry ya’ll had to deal with these awful people.",
   "created_utc": 1690777099,
   "score": 44,
   "submission_id": "15dzme3"
  }
 ]
}