{
 "submission_id": "15e2lyl",
 "title": "What happened to the first person you had sex with?",
 "selftext": "",
 "created_utc": 1690767138,
 "permalink": "/r/AskReddit/comments/15e2lyl/what_happened_to_the_first_person_you_had_sex_with/",
 "score": 76,
 "url": "https://www.reddit.com/r/AskReddit/comments/15e2lyl/what_happened_to_the_first_person_you_had_sex_with/",
 "comments": [
  {
   "comment_id": "ju5vwj3",
   "message": "We had to run and grab plan B, then she ghosted me. A month or so later I'm driving with a friend and I get a text so I have my friend read it out (responsible driving and all). It's from the girl and says \"hey PorkSoda, sorry I haven't texted you in a bit, I've been in a mental institution for the last month after trying to kill myself twice. Sorry\" \n\nWhat a text",
   "created_utc": 1690777713,
   "score": 154,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5lnc0",
   "message": "High school sweethearts. She broke up with me after two years for a guy she met in class. They’ve been married for 20+ years and have three kids. Best decision for both of us.",
   "created_utc": 1690771967,
   "score": 65,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5gby7",
   "message": "She is a teacher at the same high school we banged it out in the parking lot",
   "created_utc": 1690769316,
   "score": 18,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5go79",
   "message": "She ran away from home, shaved her head, came back, tried to kill herself, was committed for 45 days, was released to a group home, ran away from the group home, got caught at a trap house during a bust, sent back to group home, group home sent her to rehab, tried to kill herself in rehab, recommitted for 45 days…\n\nLong story short, she’s married to someone equally unstable, they have 3 children together that somehow have had to raise their parents.",
   "created_utc": 1690769481,
   "score": 76,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5etzo",
   "message": "[deleted]",
   "created_utc": 1690768593,
   "score": 216,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5dzuj",
   "message": "What I know is that she died at age 29, on the same day as her infant daughter's funeral.\n\nI actually just found out more by regoogling.  She (Susan) was about a month shy of 29.  Her daughter was 3, so older than I thought.  It was a car accident!  The baby died first.  I had assumed suicide.",
   "created_utc": 1690768189,
   "score": 236,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5icd6",
   "message": "She got leukemia\n\nAnd, no shit, the SECOND girl I had sex with ALSO got leukemia \n\nThe rest haven’t…yet\n\n(Both girls beat leukemia)",
   "created_utc": 1690770300,
   "score": 133,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5fm5f",
   "message": "I recently tried to track here down after 45 years and discovered that she died when she was 33.  She had a daughter who is married.  Its all starting to slip away",
   "created_utc": 1690768968,
   "score": 155,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5exki",
   "message": "Lost track of him for about ten years. Next I heard about him he had murdered his girlfriend and killed himself two apartments down from my best friend's place.",
   "created_utc": 1690768640,
   "score": 59,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5eq51",
   "message": "She died a couple years ago. \n\nFuck cancer.",
   "created_utc": 1690768541,
   "score": 119,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5esjg",
   "message": "She got married to a man who has the same name as me, has a beautiful daughter and knits as a hobby. She appears to have a very good life. 🙂",
   "created_utc": 1690768573,
   "score": 177,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5dtta",
   "message": "I married her. We've been together for 35 years now.",
   "created_utc": 1690768109,
   "score": 25,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5f2lh",
   "message": "She married me, the damn fool.",
   "created_utc": 1690768708,
   "score": 0,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5ej8p",
   "message": "My first time was in a cemetery with a goth girl I was in high school with.\n\nWe went separate ways after graduating and attended different colleges. She went full furry and is currently some kind of extremely senior network admin at Akamai or one of those huge internet backbone companies, living her best life as one of \"the furries who run the internet\".",
   "created_utc": 1690768448,
   "score": 28,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5eaee",
   "message": "We went our separate ways and reconnected 19 years later. Getting married later this year.\n\nEdit: a little more for y’all - We dated for a few months in high school. Ended things on good terms, neither one of us knew what we were doing. \n\nIn 2018 I found a mixed cd she made me and hit her up to see how she was doing, honest check in. And we just kept talk and fell in love.\n\n2nd edit: I showed my partner the post and we are super grateful for all the love and support. Reading other people’s similar stories in the comments has been a true joy this morning. Wish each and every one of you happy and healthy relationships in your life (romantic and otherwise)  ❤️",
   "created_utc": 1690768328,
   "score": 197,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5dex7",
   "message": "He died in a car accident our senior year. Drinking and driving does not mix.",
   "created_utc": 1690767908,
   "score": 253,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5e2es",
   "message": "We broke up, I got to keep the kids, she got to keep acting like one.",
   "created_utc": 1690768223,
   "score": 119,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5epbs",
   "message": "No idea and don’t want to know.",
   "created_utc": 1690768530,
   "score": 74,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5c34l",
   "message": "He was deployed to Syria and never came home.",
   "created_utc": 1690767257,
   "score": 117,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5f7fe",
   "message": "She has 3 kids from 2 guys and her Facebook updates are almost always pictures of her with a new boyfriend with captions saying she's so glad she finally found a real man. Comments are always \"I'm so happy for you girl!!! You deserve this!!\". She's 34.",
   "created_utc": 1690768773,
   "score": 157,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5etbp",
   "message": "We were 19. About a year later she made up a random excuse to break up with me so she could start dating some other guy without having to be honest about it. Common enough at that age of course, I'm not mad about it now although I sure as hell was confused at the time.\n\nShe had an unusual name so I just googled her thanks to this thread. I found her obituary, apparently she died in a car accident in 2016 and was divorced with three kids. The obit mentions enough about her surviving relatives to tell me that yep, it was her.",
   "created_utc": 1690768583,
   "score": 159,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5gn96",
   "message": "She's married, has a child, and works as an EMT. I'm proud of her.",
   "created_utc": 1690769468,
   "score": 102,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5cmja",
   "message": "Never heard from him again lol.",
   "created_utc": 1690767522,
   "score": 36,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5rq23",
   "message": "She died in a car accident I had. I found out about it just over a month later when I woke up from a coma.\n\nEDIT: Thanks for the rewards. This is the most comments and traffic any of my comments have gotten. If anyone has a question don't be afraid to ask. I have gotten this far by talking about it. That is what I did for my own personal therapy. Thanks again to you all, love you all",
   "created_utc": 1690775251,
   "score": 191,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5jdc6",
   "message": "We broke up less than a month ago after 2+ years. She appears to be recovering quicker than I am. It’s hard and because it is my first and only breakup, it hurts. I hope she takes care of herself.",
   "created_utc": 1690770815,
   "score": 99,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5gxwz",
   "message": "She’s currently sitting on the couch next to me. After a decade apart and living our own lives, we ended up back together. Our third anniversary is this year.",
   "created_utc": 1690769611,
   "score": 202,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5eymv",
   "message": "We broke up 10 years ago. Now he has a wife and two kids and is working his dream job. I am currently unemployed, single and heartbroken af but sincerely happy for him, he deserves to be happy\n\nEdit: thank you so much everyone, you are all awesome people you're gonna make me cry 🥲 and it was not clear in my post but I am not heartbroken over him, I lost feelings for him even before we broke up. Its actually because of very recent situations",
   "created_utc": 1690768655,
   "score": 241,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5c13c",
   "message": "She’s curently living her best life with a better man.",
   "created_utc": 1690767228,
   "score": 106,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5gsp3",
   "message": "He’s sitting next to me, we just finished watching our 14 year old play through all of RE4.",
   "created_utc": 1690769542,
   "score": 17,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5f28e",
   "message": "He's in jail, because his pattern of rape turned even more violent.",
   "created_utc": 1690768703,
   "score": 20,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5feh1",
   "message": "No idea.  Haven't heard of her in 30 years. I hope she grew up happy and is surrounded by a large, loving family.  She deserves that much.",
   "created_utc": 1690768866,
   "score": 58,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5fpje",
   "message": "He has a wife and 3 kids. He’s a great dad and we’re still friends 20 years later and I love his wife. \n\nHe was my first kiss, first sex, and first serious relationship. I’m thankful for him giving me very positive “firsts”.",
   "created_utc": 1690769014,
   "score": 112,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5g0d1",
   "message": "Her mom spoon fed her Vicodin and other drugs until she became severely addicted to heroin. She ended up in and out of rehab. Last time I talked to her she was working at GameStop and living on a friend’s couch in Compton but she was clean. She then shaved her head and deleted all of her social media and fell off the face of the earth. I hope she’s okay.",
   "created_utc": 1690769160,
   "score": 40,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5eiy9",
   "message": "Slept with everyone in the near galaxy",
   "created_utc": 1690768444,
   "score": 252,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5g1ed",
   "message": "It's been 20 years, he lives with his mother, has a low paying job and regularly calls me every few months drunk to try and reminisce even though I haven't seen him in person in over 15 years and I have happily moved on. Blocking him only puts the pistol two inches closer to his mouth so I wait for the call, talk for two minutes and then move on with my day.",
   "created_utc": 1690769174,
   "score": 19,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju665mb",
   "message": "My vag swallowed them whole, never to be seen again.\n\nNah, we broke up and then I didn't speak to him for a long, long time. We speak and now he's a few months away from having his first child and I'm super happy for him :)",
   "created_utc": 1690784786,
   "score": 4,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5hb2o",
   "message": "My wife as of last weekend!",
   "created_utc": 1690769792,
   "score": 174,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5gyzt",
   "message": "First girlfriend at 17. Last time I saw her was in my rearview mirror as she chased my car in a full terminator sprint wearing flip-flops. Never did get curious enough to check on that psycho’s status later in life, tbh.",
   "created_utc": 1690769625,
   "score": 247,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5evg9",
   "message": "She’s sitting on the couch with me. We’ve been together for 16 years, married for 9 of those, and we just had our first child two weeks ago.",
   "created_utc": 1690768612,
   "score": 240,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5fuh6",
   "message": "After 47 years, she and I still keep in touch. I'm 66, she is 64.",
   "created_utc": 1690769081,
   "score": 67,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5fgx6",
   "message": "Shes a herdy gerdy playin shoeless hippy photographer extraordinaire. Havnt seen her in years shes cool as hell tho.",
   "created_utc": 1690768898,
   "score": 34,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5jps0",
   "message": "Prison. Where pedophiles belong, even female ones",
   "created_utc": 1690770985,
   "score": 45,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5ebz2",
   "message": "she married /u/eclipse454",
   "created_utc": 1690768349,
   "score": 80,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5jkrk",
   "message": "Some say she's still having sex to this day",
   "created_utc": 1690770917,
   "score": 83,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5i9h9",
   "message": "Sooooooo.... the first girl I ever had sex with apparently later in life helped her boyfriend kill his parents. She's doing some time 😬 just found out about it recently",
   "created_utc": 1690770261,
   "score": 208,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5ezqy",
   "message": "Still waiting",
   "created_utc": 1690768670,
   "score": 100,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5enh4",
   "message": "Became an addict, lost a child, ended up in jail, and eventually passed away.",
   "created_utc": 1690768505,
   "score": 132,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5d0zd",
   "message": "Still see him at family parties",
   "created_utc": 1690767717,
   "score": 86,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5frxe",
   "message": "We got married and later learned she’s been in the closet most of her life.",
   "created_utc": 1690769046,
   "score": 31,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5fj1y",
   "message": "She’s been married and divorced a couple of times and has 4 kids.  Her oldest got a girl pregnant when he was like 14 and made her a grandmother at 35.  She’s spent most of her adult life so far raising her kids and now grandkids alone.  Kinda sad.",
   "created_utc": 1690768927,
   "score": 170,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5vbsm",
   "message": "He married a really nice lady and had a couple lovely kids. Went to medical school became an incredible doctor and still can “get it”\n\nThat really nice lady is me, by the way.",
   "created_utc": 1690777359,
   "score": 191,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5gwja",
   "message": "He’s sitting right next to me, found our way back together and it’s going to be 5 years next month ❤️",
   "created_utc": 1690769592,
   "score": 80,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5fi5w",
   "message": "She was extremely disappointed and became a lesbian after me",
   "created_utc": 1690768915,
   "score": 128,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5er8y",
   "message": "She hates me.",
   "created_utc": 1690768556,
   "score": 145,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5i36m",
   "message": "We got engaged, but I walked in on her in bed with someone else later that year. It wrecked me for the summer that was just beginning, but I grew a lot and in a way I never felt so alive as I did during those horrible post-break-up months. The grief was truly like someone died. \n\nI’m now married and have a kid and a great job and couldn’t be happier.",
   "created_utc": 1690770174,
   "score": 95,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5ee35",
   "message": "I actually had sex with her again many years later, and the thought popped in my head, The last person I fucked was also the first, My coworker thought it was pretty deep, she was actually cheating on her beefy redneck Welder husband so we don't talk anymore.",
   "created_utc": 1690768378,
   "score": 127,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5e8rk",
   "message": "She was killed by her boyfriend.  RIP NB.",
   "created_utc": 1690768306,
   "score": 179,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5eo3h",
   "message": "He’s literally trying to get me to come over right now, via text, with promises of things we did just this morning.\n\nOur last exchange went like this:\n\n**Me: you’re so full of yourself**\n\n**Him: bet you’d like to be full of me too**",
   "created_utc": 1690768513,
   "score": 7,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5fvfr",
   "message": "Oh this is the perfect question for me right now!! So my ex who dumped me literally right after sex (i was still naked), cause he wanted to go after another girl, tried to get back together with me after 2years when i saw him at a grocery store. Just an hr ago, my bf and i saw him at Mcdonalds taking our order. That was kinda funny to me since back then he used to make fun of me for have mcdonalds as a first job and used to always put me down cause my family didn not have a nice house like his. Now i own my own with my bf and were about to have a baby ❤️.",
   "created_utc": 1690769094,
   "score": 116,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5g6hp",
   "message": "She's in the kitchen making dinner for our 3 adult children at the moment.",
   "created_utc": 1690769243,
   "score": 13,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5fs4a",
   "message": "U guys had sex?",
   "created_utc": 1690769049,
   "score": 155,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5esxr",
   "message": "No clue, and I prefer it that way.",
   "created_utc": 1690768578,
   "score": 178,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5f6z4",
   "message": "Dunno, I think she stayed in her small town forever",
   "created_utc": 1690768767,
   "score": 51,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5ht3h",
   "message": "After recovering from drugs, alcohol, sex and gambling addictions, he is now a psychologist.",
   "created_utc": 1690770037,
   "score": 61,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5c3pb",
   "message": "Never heard from her again lmao",
   "created_utc": 1690767265,
   "score": 170,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5el89",
   "message": "She became a prostitute",
   "created_utc": 1690768474,
   "score": 100,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5fiub",
   "message": "She’s rich as fuck and traveling the world. Fumbled the bag",
   "created_utc": 1690768924,
   "score": 163,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5ho4k",
   "message": "He came out of the closet, got married and adopted a child. When we first dated in 7th grade his mom didn't like me so she transferred him to a Catholic high school. We secretly got back together in 10th grade and were together through our sophomore year of college. We broke up because it was too hard to see each other and communicate (early 1980s- before cell phones were a thing). Somewhere in the 1990s he sent a Christmas card to my parent's home and we've been exchanging Christmas cards ever since.",
   "created_utc": 1690769970,
   "score": 157,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5hho5",
   "message": "Celebrated 30 years last month.",
   "created_utc": 1690769882,
   "score": 92,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5dv48",
   "message": "Dropped out of college and moved to Bakersfield.",
   "created_utc": 1690768126,
   "score": 116,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5hg8j",
   "message": "Hahaha. She’s married to my brother.",
   "created_utc": 1690769862,
   "score": 54,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5vk8b",
   "message": "She was given a pill by a friend that had 4× the lethal dose of fentanyl. She died in the parking lot outside her apartment very shortly after taking it.",
   "created_utc": 1690777502,
   "score": 53,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5dsh9",
   "message": "No damn clue. Wanna keep it that way. Good riddance",
   "created_utc": 1690768092,
   "score": 71,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5cd97",
   "message": "[removed]",
   "created_utc": 1690767397,
   "score": 133,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5epox",
   "message": "We're still doing it 39 years later.",
   "created_utc": 1690768535,
   "score": 157,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5fust",
   "message": "iirc she took like 11 different dudes in an outhouse at a party one night\n\nEdit: inb4 “were you one of them”. Yes of course",
   "created_utc": 1690769086,
   "score": 123,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5g0l5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5ej8v",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju6cgsq",
   "message": "It was with my first serious girlfriend in high school. She was so easy to be with and the whole experience was unforgettable. I think about it all the time to this day.\n\nWe dated until we were into our twenties but I think she got bored of being my girlfriend and wanted something more serious. \n\nNow she's my wife and we're coming up to our 18th year together. She's just as charming as the day I met her, never fails to make me laugh and we always reminisce about those early fumblings.",
   "created_utc": 1690789766,
   "score": 81,
   "submission_id": "15e2lyl"
  },
  {
   "comment_id": "ju5ghje",
   "message": "Broke up with me said she wanted to be friends, we were friends on social media but didn’t talk, after a few months I went on a trip with another girl, after the trip noticed I was blocked on everything, mutual friend said I was supposed to reach out not move on.",
   "created_utc": 1690769391,
   "score": 28,
   "submission_id": "15e2lyl"
  }
 ]
}