{
 "submission_id": "15e8szr",
 "title": "What is the worst thing about being your current age?",
 "selftext": "",
 "created_utc": 1690787394,
 "permalink": "/r/AskReddit/comments/15e8szr/what_is_the_worst_thing_about_being_your_current/",
 "score": 156,
 "url": "https://www.reddit.com/r/AskReddit/comments/15e8szr/what_is_the_worst_thing_about_being_your_current/",
 "comments": [
  {
   "comment_id": "ju6isy0",
   "message": "71.   Body is beginning its inevitable slowdown.  Not happy.\n\nEDIT: Thanks for all the kind responses.  I still try to keep fit (do some jogging, some stationary bicycling and some really light lifting), but it sure takes a lot more effort than it did previously, and keeping the extra pounds off is really difficult.\n\nAlso had a bout with prostate cancer (which happens to just about every man sooner or later; the saying is that you either die with prostate cancer or from it...) which was successfully dealt with by surgery but which has left me, well, half the man I was before (the spirit is willing, but the flesh is weak, as the expression goes).  Once the plumbing begins to fail, the rest follows.  \n\nStill hope to be Redditing for a while, though.",
   "created_utc": 1690794961,
   "score": 107,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6kkht",
   "message": "29 - last year of being in that fruitful 20s stage. people expect that you should know by now. people also expect that you should get married and have kids or else whatever. \n\nspoiler alert: i get tired just by existing",
   "created_utc": 1690796390,
   "score": 244,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju69pyb",
   "message": "34 - just old enough to start thinking about getting old and no longer feeling young.",
   "created_utc": 1690787542,
   "score": 16,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju69o2e",
   "message": "19- I have no idea what to do with my life",
   "created_utc": 1690787501,
   "score": 151,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6a0gt",
   "message": "24-empty wallet.",
   "created_utc": 1690787769,
   "score": 144,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6ki1u",
   "message": "33 — feeling simultaneously young and healthy and old and broken down. there are days i wake up refreshed and crush it in the gym, and there are days i feel like i tweak my back washing dishes or some shit",
   "created_utc": 1690796336,
   "score": 175,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6hi5i",
   "message": "44  - I only have about 40 years left, if I'm lucky. Half of my life is already gone.",
   "created_utc": 1690793896,
   "score": 43,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6c19k",
   "message": "33 and you have to decide whether you want kids or not… but just want to enjoy life 🫠",
   "created_utc": 1690789412,
   "score": 183,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6mjg8",
   "message": "36 - I'm single and don't want kids, and finding someone my age who is single and doesn't already have kids is proving difficult",
   "created_utc": 1690797920,
   "score": 77,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6o93u",
   "message": "Being 28 feels like I'm running out of time",
   "created_utc": 1690799183,
   "score": 71,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6i53z",
   "message": "31. Having had zero relationship experience.\n\nAlso having accomplished nothing in life and feeling like it's too late for basically everything.",
   "created_utc": 1690794416,
   "score": 21,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6hz7s",
   "message": "17 - not sure if this applies to everyone, but I have the expectations of an adult with the rights of a child. I have to go to school for 8 hours a day, then work for 3 to 5 hours, and manage all of my current responsibilities, while maintaining good grades to stay on the path of long term educational and financial success. But I also have to ask permission to go to the bathroom.",
   "created_utc": 1690794284,
   "score": 160,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju69nqt",
   "message": "At 47 I had to give up a few sports that I can no longer play safely. Besides that, nothing, I appreciate the wisdom that comes with age.",
   "created_utc": 1690787494,
   "score": 129,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6ljy1",
   "message": "27.\n\nWorried about my future, feel like my life has been wasted so far and that I'm going to wake up tomorrow and I'll be 80 and nothing will have changed in my life and I'll have just spent my life rotting in this stank ass horrible limbo I'm trapped in.",
   "created_utc": 1690797162,
   "score": 152,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6hjvj",
   "message": "68.  Slowing down, but still having max fun",
   "created_utc": 1690793935,
   "score": 182,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6r73h",
   "message": "57. The realization that I'm 13 years away from 70 is wild. My parents are gone, my cousins are all in their mid 60's (only child) it's wild to think about the life we've lived.",
   "created_utc": 1690801187,
   "score": 121,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju7dyyv",
   "message": "40. Everything is harder now except my penis.",
   "created_utc": 1690812663,
   "score": 113,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6c81p",
   "message": "42 here, life is the best it’s ever been yet I’m probably halfway through or past halfway already. Time flies.",
   "created_utc": 1690789563,
   "score": 17,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6rv08",
   "message": "39 m. I've finally arrived at the age where I can't get rid of this damned abdominal weight. I swear my stomach is in full blown Manifest Destiny mode and is spreading to my back in an attempt to stretch coast to coast.",
   "created_utc": 1690801612,
   "score": 104,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6jyia",
   "message": "At 43 it's watching the younger generation struggle. It started to get bad in the later 90s, but at least I could afford a studio as a young man.\n\nNow you need two or three roommates to afford rent in a one bedroom and you're never going to make enough to buy a house, unless you stay with your parents until you are in your later 20s or early 30s and save up.\n\nCollege does not guarantee a good paying job anymore and if you do find a job, you have a mountain of college debt to pay off.\n\nI think it sucks watching the young men and women today struggle in the American nightmare.",
   "created_utc": 1690795902,
   "score": 217,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6aqar",
   "message": "27\nThe existential crisis and feeling like your running out of time and your life ends at 30\n\nEdit: wow I can't believe I'm waking up to all these replies. Thank you everyone so much for your input it really helps ease my worries a lot",
   "created_utc": 1690788341,
   "score": 94,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6cnic",
   "message": "17 and strung out on confusion",
   "created_utc": 1690789918,
   "score": 74,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6jmbp",
   "message": "grades. I’m 16.\n\nI like to imagine dating gets better when you’re older. Praying it does",
   "created_utc": 1690795619,
   "score": 70,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6m5uc",
   "message": "I’m 23 and I have friends with degrees, friends traveling the world, friends married with kids, and then there’s people like me who are like wtf am I doing???",
   "created_utc": 1690797632,
   "score": 114,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6bok5",
   "message": "16 - i didn't know what to do after high school so I'm going college because gives me 2 more yrs\n\nEdit: I live in UK - college is free",
   "created_utc": 1690789122,
   "score": 186,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6q5l1",
   "message": "18 , thinking about what to do in the next 10 years of my life",
   "created_utc": 1690800492,
   "score": 55,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6bcg1",
   "message": "24- Will I die from student debt or not",
   "created_utc": 1690788849,
   "score": 125,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju69lqy",
   "message": "23 here People don't take your opinions seriously until you're about 30.",
   "created_utc": 1690787450,
   "score": 176,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6m9ra",
   "message": "44 and just went through the worst year of life yet. Lost dad. Mental health declined due to my mother declining alzheimer's (stage 6 of 7) lost job after not dealing with this well. I say lost but I was bullied out by two women. One of those women died days after sacking me (natural causes). I live in a small dreary town where people are two faced. I turned to weed big time and my relationship took a nosedive. Health took a bigger nosedive.\n\nBut...\n\nI feel like I'm coming through the worst. I got stronger and determined to chase my dreams of being a writer. I placed in the top 1% of a screenplay contest with the BBC recently and have been placed on their radar as a writer and have two labradors who get me out the house. I stopped smoking and started looking after me and honestly. The future looks okay.\n\nEDIT: thank you for the kind messages. I just to add that yes I was on the verge of ending it all and without a consultation with local help I may have.\n\nIf you're in the dark, reach out. I promise people want to listen and want to help. You don't have to go through it alone. Even if it's reddit. People care. You matter.",
   "created_utc": 1690797714,
   "score": 117,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6azv7",
   "message": "23, you're expected to have so much ambition in life. Bonus if you're a female, you're expected to have a partner and are questioned if you don't.",
   "created_utc": 1690788559,
   "score": 3,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6a4pm",
   "message": "Fun is too far in the past, and death is too far in the future",
   "created_utc": 1690787865,
   "score": 103,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6kmjz",
   "message": "58, I’m still 16 at heart, and not in bad shape, but man my knees and back are fucked!",
   "created_utc": 1690796439,
   "score": 69,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6eo5a",
   "message": "35m. Ability to gain weight, and lose hair increasing at a terrifying rate.",
   "created_utc": 1690791565,
   "score": 38,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6ksne",
   "message": "Everyone else my age is old",
   "created_utc": 1690796575,
   "score": 38,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6f2cb",
   "message": "Well, I will be 30 next month, so in gay years, I will be an old washed out gay.",
   "created_utc": 1690791885,
   "score": 99,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6ibza",
   "message": "I'm closer to the end instead of the beginning",
   "created_utc": 1690794572,
   "score": 31,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju73ohk",
   "message": "27 - pressure/social expectations of having a stable full time job, being in a relationship, thinking about buying house and having kids. \n\nWhile I feel perfectly comfortable being single, childless and renting apartment.",
   "created_utc": 1690808110,
   "score": 29,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6l80a",
   "message": "I'm the same age as my favourite grandfather was when he died. I don't feel my age, I still feel like an older teenager. It breaks my heart that my grandad,  despite his major health problems, probably felt as I do now. He really was far too young to die. I hate the fact that by my next birthday, I will be older than he got to be.",
   "created_utc": 1690796909,
   "score": 28,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6lewy",
   "message": "25 - Feeling like you should have it all figured out and comparing yourself to your peers",
   "created_utc": 1690797056,
   "score": 29,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6lmnt",
   "message": "Nothing. Everything is nifty being 50.",
   "created_utc": 1690797222,
   "score": 24,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6mx4y",
   "message": "25. Not old enough to be treated like an adult, and not young enough to be treated like a kid.",
   "created_utc": 1690798206,
   "score": 28,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6npg5",
   "message": "Staring death in the eye. Just turned 53. My dad died at 54. And I wake up tired and achy every day.",
   "created_utc": 1690798790,
   "score": 41,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju73fvx",
   "message": "32 - have a degree, a title, and a “grown up” job, but have less money and more stress than I did while working at my “childish” restaurant job. Too old to not know what’s going on anymore, too young to have any real impactful resources.",
   "created_utc": 1690807994,
   "score": 18,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju7l3uz",
   "message": "29. Realizing I spent my entire 20’s not living for myself and am desperately trying to figure out who I am before I’m 30. I feel like as a female too I hit a point in my late 20s where I realized I don’t want to dress like I’m 21 anymore but I also don’t want to dress like I’m 30.. so I never know what to wear. Existential crisis, if you will.",
   "created_utc": 1690815504,
   "score": 17,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6iub2",
   "message": "Seeing others my age be the dumbest and most annoying generation yet.",
   "created_utc": 1690794993,
   "score": 33,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6dk9t",
   "message": "22- my only hope to have nice things in the near future is debt or winning the lottery.",
   "created_utc": 1690790660,
   "score": 13,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6foqa",
   "message": "26- somehow we’ve managed to misconstrue basic things you’re supposed to do as an adult in life as achievements that make you better than others???? \n\nIdk where we went wrong but if you’re able to have a career, get married, buy your own house and have a child before 30, I guess that means you’re better than everyone else. I don’t get how we got here but I hate. \n\nStop bragging about shit you’re supposed to do as a regular adult.",
   "created_utc": 1690792402,
   "score": 38,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6ccs9",
   "message": "16- everyone expects you to act like an adult but still treats you like a child",
   "created_utc": 1690789671,
   "score": 46,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6l6dl",
   "message": "26, great age for many things but should have started earlier",
   "created_utc": 1690796873,
   "score": 16,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju73h7o",
   "message": "Starting over in a new career track at 47.  I went from being the guy who could navigate any problem to the new guy.  Being the FNG hits different when most of your coworkers are younger than you.",
   "created_utc": 1690808012,
   "score": 12,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6a1sx",
   "message": "[deleted]",
   "created_utc": 1690787799,
   "score": 36,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju77s6p",
   "message": "I just turned 42 and I still think like I’m in my mid-twenties, I feel like I should be more mature.",
   "created_utc": 1690810023,
   "score": 13,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6iaxi",
   "message": "Ageism.",
   "created_utc": 1690794547,
   "score": 23,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju75jr9",
   "message": "As a middle aged white man, it’s hard having everyone assume you’re a pervert. What’s also hard is seeing how so many of my middle aged white male brethren are perverts.",
   "created_utc": 1690809009,
   "score": 21,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6p4v0",
   "message": "61m- dating.",
   "created_utc": 1690799807,
   "score": 11,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6rscn",
   "message": "I'm turning 17 soon, i can already drive, not unlocking anything new sucks.",
   "created_utc": 1690801565,
   "score": 9,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6tr1n",
   "message": "33, being at your prime in life and still being undateable. I don’t want to do this anymore",
   "created_utc": 1690802788,
   "score": 10,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6yxsh",
   "message": "16, everyone makes such a big deal of romance and sexual stuff, since I’m aromantic and asexual, I’ve never been in a relationship or even kissed anyone. Anytime I tell anyone this, they make such a big deal out of it, they act like im weird af, they cringe and say all the shit they’ve done. Like idc? It’s my choice, I’ve had opportunities in the past to kiss but I’ve said no. Everyone expects people to focus on relationships and stuff, it’s just really frustrating",
   "created_utc": 1690805746,
   "score": 8,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju77uk9",
   "message": "26- \nGoing back to school.\n\nBack in 2020 after finishing up my Associates, I then made the decision to further my education at a University. \nI have family asking if and when, I will complete my Bachelors however talking with them feels uncomfortable.\n\nIs this normal?",
   "created_utc": 1690810052,
   "score": 10,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6nqvw",
   "message": "I’m 27 and I’m not young anymore.",
   "created_utc": 1690798819,
   "score": 8,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju73iax",
   "message": "19- In this weird limbo where I’m supposed to act like an adult but no one will treat me like one.",
   "created_utc": 1690808027,
   "score": 10,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju7c8ds",
   "message": "26- I'm at the stage where half of the people I know expect me to settle down, get married have kids and the other half wants me to party with them, hang out all the time, enjoy my youth while it lasts and says it's all going too fast and I am too young to settle down. It's like people are expecting me to be one way or the other, as if I am to choose sides.",
   "created_utc": 1690811948,
   "score": 9,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6mulx",
   "message": "Turning 29 this September. I’m single and most people at my age are ready to settle down. There is nothing wrong with that, I’m just not ready.",
   "created_utc": 1690798153,
   "score": 8,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju79xvf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15e8szr"
  },
  {
   "comment_id": "ju6gfjh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15e8szr"
  }
 ]
}