{
 "submission_id": "15ed2ny",
 "title": "What happened to the bully in your class?",
 "selftext": "",
 "created_utc": 1690801496,
 "permalink": "/r/AskReddit/comments/15ed2ny/what_happened_to_the_bully_in_your_class/",
 "score": 65,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ed2ny/what_happened_to_the_bully_in_your_class/",
 "comments": [
  {
   "comment_id": "ju75gr3",
   "message": "He was killed shortly after being released from prison. He apparently had a beef with someone and went to their house with a gun, kicked in their front door, and was immediately shot and killed.",
   "created_utc": 1690808970,
   "score": 226,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju75x7d",
   "message": "In jail for strangling his girlfriend. Thankfully she survived",
   "created_utc": 1690809184,
   "score": 249,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju75vai",
   "message": "He died the summer after graduating high school. Mixed too many drugs and alcohol at a party. Very sad for his younger brother who was a great person despite his brother.",
   "created_utc": 1690809158,
   "score": 147,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju77yj2",
   "message": "I kid you not, we had a 5 foot tall bully in our school. He gained favor with some of the bigger bullies, and I suppose that afforded him carte blanche to act like them. Anyways, a few short years after HS, he fucked with the wrong dude at a party and they followed him home and shot him dead on his mom's front lawn.",
   "created_utc": 1690810101,
   "score": 102,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7apgk",
   "message": "The kid who used to beat me up every day in third grade I heard crashed a motorcycle and lost both his testicles. So he’s got that going for him, which is not nice.",
   "created_utc": 1690811302,
   "score": 184,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7321c",
   "message": "He now owns his father’s huge, massively lucrative construction co.  Which is exactly what he said he was going to do and also let us know how much richer he was going to be than us. So yeah it sucks bc it came true.",
   "created_utc": 1690807810,
   "score": 101,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju77vkd",
   "message": "The boy bully married the girl bully, they had a kid then divorced. Shocking",
   "created_utc": 1690810064,
   "score": 228,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju73qlg",
   "message": "He is in Leavenworth serving a life sentence for murder. No one was surprised when they found this out.",
   "created_utc": 1690808139,
   "score": 216,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju6xd2i",
   "message": "Prison for killing people by lighting a diner on fire",
   "created_utc": 1690804877,
   "score": 8,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7a9c1",
   "message": "His father was caught stealing millions from the community.  Dad was a wealth manager and all his clients were friends and neighbours in a sort of small town.  The family was really put through the wringer of embarrassment and the bully was a wreck for a long time.  I guess he realized all the wealth (and arrogance) that he grew up with was stolen from everyone he knew.  I saw him years later and  it was like seeing a different person.  He had changed his name, walked differently and held himself with a different posture.  We spoke for a few minutes and it was almost like he was genuinely interested in me.  He didn't go out and say sorry for what he had done but it seemed like he wanted to but though it would be tacky Maybe I'm reading too much into that interaction but it was a little weird.  It was like he had been forcing himself to be an actual nice guy.",
   "created_utc": 1690811109,
   "score": 60,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju6ukof",
   "message": "Beat a fellow drug dealer to death during a transaction gone bad.\n\nSentenced for murder but then somehow it was downgraded to manslaughter.\n\nServed about ten years and judging from his FB posts (I know his brother), he has a girlfriend, a job, and has cleaned up his act.\n\nEdit to add what happened. Just looked up the story. \n\nHe was convicted of 2nd degree murder with depraved indifference. Then the State Court of Appeals changed the law interpreting the definition of the charge.\n\nThe federal court vacated the conviction finding that the defendant was factually innocent of depraved indifference murder.\n\nHe agreed to plead to the lesser charge of manslaughter. \n\nSo he had already served ten years and was released after the plea to manslaughter.",
   "created_utc": 1690803286,
   "score": 29,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7gb5u",
   "message": "After years and years of being bullied in middle and high school by one particular guy. I took my dad's lawnmower in to get serviced and look who we have here. Good ol racist fuck boy Shaun walks up to the counter covered in dirt and oil and sweat. He immediately knew who I was. Funny thing is I hated this dude for so long, I even had a vision on snatching him by his shirt over the counter and beating his face into the ground( I was skinny skater punk now)\n\nNothing was said between us during that interaction other than the services I needed  When I went to go pick the lawn mower up a week later he asked me to step outside. In my mind, I'm thinking this is it, I'm going pumble this dude. He lit up a cigarette  and for about 15 minutes, apologized for how he treated me in middle school and high school. He told me about how he was brought up and he's never been as tough as he came up. \n\nAfter high school he went in the military and was forced to work with other races. He even explained that his hatred towards people that weren't white faded away bc of the Marines. He said he had been fucked over more by his own race then others and started to think about his ideology. He is a humble guy now, with regret, but is man enough to admit his faults. We shook hands and even hugged. I haven't seen him in about 10 years but, if I do see him again I still shake his hand.",
   "created_utc": 1690813608,
   "score": 123,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju6ru5k",
   "message": "For whatever fucking reason, he asked me out a few years after graduation. \n\nHe bullied *me.*",
   "created_utc": 1690801597,
   "score": 128,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju770cv",
   "message": "One is long dead from a drug deal gone bad.  Another is a big bellied deputy sheriff who was kicked off the force after decades of questionable behavior.",
   "created_utc": 1690809675,
   "score": 12,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju70xsh",
   "message": "My middle school bully from my class got hit by a car and didn’t go to school for a whole year, then he skipped school for the next year, LITERALLY the entire year. Then he finally got expelled and I never saw him or heard anything about him",
   "created_utc": 1690806766,
   "score": 236,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju77ru8",
   "message": "She became an \"Influencer\" and have tons of followers because people think she is really funny because of how stupid she is. She kinda have a \"Paris Hilton\" persona going on. Very spoiled rich girl pretending to be stupid and know nothing about the world",
   "created_utc": 1690810018,
   "score": 92,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju6rtn6",
   "message": "They murdered someone and are now In prison",
   "created_utc": 1690801588,
   "score": 0,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju73opz",
   "message": "Her father got sued and they lost EVERYTHING, house, cars, drained their money, all of it. Last I heard she was living in a run down apartment and working at a small gas station.",
   "created_utc": 1690808113,
   "score": 137,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7d59v",
   "message": "I was only ever bullied in elementary school in Texas. I moved to Ohio during 5th grade. At some point in late middle school or early highschool I heard the guy who used to bully me got mad at his parents because they wouldn't let him go to a concert, so he took his dad's shotgun and killed himself.",
   "created_utc": 1690812329,
   "score": 238,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju792kx",
   "message": "I saw him rush the field at an NFL game and get arrested. Good times!",
   "created_utc": 1690810596,
   "score": 123,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju6wqfm",
   "message": "Opened a really stupid store in an overpriced mall in the 90s.  Lost a crap ton of cash and killed himself.",
   "created_utc": 1690804528,
   "score": 192,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju6rw1b",
   "message": "He became the CEO of the company he started in after collage. He is the Chairman of the local football team and runs the beach cleanup crew every month. Always has a smile and has clearly just kept on growing up.",
   "created_utc": 1690801630,
   "score": 54,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju74crp",
   "message": "My bully from elementary school through high school served prison time for embezzlement.",
   "created_utc": 1690808443,
   "score": 97,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju70ubt",
   "message": "arrested for attempted rape on a girl from another class.",
   "created_utc": 1690806718,
   "score": 201,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju6rti3",
   "message": "he became the owner of the restaurant",
   "created_utc": 1690801585,
   "score": 150,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7stey",
   "message": "The autistic kid beat him in Spanish class within an inch of his life — flipped over the desk, picked this dude’s body up and slammed him, kidney’s first, into one of the legs. \n\nJohnny was just your normal, happy go-lucky video game fan. We went to see the original Mortal Kombat movie in theaters when it came out. It was my second movie going experience. I was just a newly transplanted immigrant and Johnny was the only kid who didn’t pick on me. He was cool. Johnny was heavy set, with glasses. \n\nJuan was a gang banger. Real cholo looking dude. He and his friends were pretty terroristic. In retrospect, I’m sure Juan had a terrible upbringing because he took it out on everyone around him. For months he kept picking on Johnny. Months. Juan was a scary guy, and I had gotten into my share of scraps, but I wanted no part of this guy. This abuse went unchecked. Juan broke John’s glasses and it was just persistent… I don’t remember all of it, other than Johnny just became more and more reclusive with time and he was always bruised in some way shape or form.\n\nOne day, in Spanish class, Juan said something to Johnny about his mom. This was before the bell rang for class to start. This was the final straw. I remember John letting out this guttural, primal scream and lunging from his desk toward Juan. Johnny began hammer fisting Juan all over the head, his shoulders, arms… like fucking Goro would in MK. Just unleashing everything he had on this asshole gang banger. There came a point when Juan looked out of it, like a limp noodle, and that was when John… still possessed by this unrelenting rage… flips the desk over, and underhand flips/bodyslams Juan into one of the legs of the desk. Juan let out this horrible cry of agony and that was that… the teacher walks in, they call the campus police and the rest is a blur. \n\nI don’t remember what happened to John after this as I never saw him again, but I do remember hearing from an acquaintance back several years that Juan was in jail for aggravated robbery. Guess he didn’t learn his lesson. \n\nThank you Johnny for being a friend and for not judging me while I learned the language here and adjusted to my new life. I hope all is well with you.",
   "created_utc": 1690818466,
   "score": 49,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7aelp",
   "message": "I saw him walking in front of my family's house (certain he was passing by) while I was playing with my daughter and her cousins. He gave me a little wave and I thought I just wave back to be nice. \n\nHe messaged me later on Facebook and said he's glad I'm doing better than him. Long story short, he told me his ex wife and him are having a serious custody battle with their kid and recently got a DUI which got him in a deeper hole. He basically said don't end up like him. \n\nAs much as I hope he gets better, karma really is a bitch",
   "created_utc": 1690811172,
   "score": 227,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju6rrbn",
   "message": "He dead\n\n\n\nEdit for visibility\n\nMy bully died of an overdose - don’t be a bully, get help in your area. If you go somewhere and they don’t seem helpful, find another organization, or walk into an emergency department and ask for help. There are good people out there working towards pro-social means, don’t give up.\n\nSAMHSA Substance Abuse and Mental Health Service Administration (Nationwide)\n\n1-800-662-HELP (4357)",
   "created_utc": 1690801547,
   "score": 162,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju6rtdk",
   "message": "Many years after graduation, I found out that he became a local cop in the town we grew up. It was the least surprising thing to everybody.",
   "created_utc": 1690801583,
   "score": 27,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju75x42",
   "message": "Local politician",
   "created_utc": 1690809183,
   "score": 98,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju6y3hi",
   "message": "No idea. I left town and never looked back.",
   "created_utc": 1690805284,
   "score": 106,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7akze",
   "message": "He’s a local loser , fuck him",
   "created_utc": 1690811248,
   "score": 196,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7n0m9",
   "message": "Hey drove drunk, got in a wreck, and is now paralyzed from the waist down.  \n\nHe is still a bully, but now he's an online bully.  The accident seems to have made him feel even more justified in being a prick.",
   "created_utc": 1690816251,
   "score": 228,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7b3v0",
   "message": "He's selling mobility scooters and supporting his stepchildren.\n\nHe was abused at home, and I was an easy target. Back then I fantasised about murdering him, now I appreciate that he was crying out for help. I'm never going to be best friends with him, but I'd shake his hand and wish him well any day.",
   "created_utc": 1690811474,
   "score": 130,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju77ujn",
   "message": "He ended up being my direct manager at a serving job, and tbh he was one of the best managers I've ever had.\n\nEdit: woah 1.8k in 4 hours, normally I have to write some truly horrfiying shit to get that kind of traction",
   "created_utc": 1690810051,
   "score": 6,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju763q1",
   "message": "He became good and now we are not beefing",
   "created_utc": 1690809268,
   "score": 73,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju72c08",
   "message": "Got shipped off to Baghdad in the early 2000s and never came back.",
   "created_utc": 1690807458,
   "score": 140,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7od3w",
   "message": "He’s on Facebook constantly crying about how unfair life has been to him.  He also said he won’t go to our 10 year HS reunion because he was bullied by the “assholes” that are now organizing the reunion.  When I commented and reminded him how he bullied me, he just said “at least I didn’t make you suicidal like they made me.”  Completely delusional. I feel bad for him.",
   "created_utc": 1690816739,
   "score": 14,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7x143",
   "message": "She did an insane amount of growing up during college, including having to uproot her whole life to care for her family after her mom died suddenly. She reached out to me and others I know personally and directly addressed the bullying. We went out to lunch (she bought) and she was incredibly honest. Apologizing and acknowledging what she did and why it was wrong. She’s now running a successful animal rescue organization with her long-term boyfriend and I wish her nothing but happiness.",
   "created_utc": 1690820057,
   "score": 231,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju6uqb8",
   "message": "Became the president of a small Christian college",
   "created_utc": 1690803376,
   "score": 106,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju6tdry",
   "message": "Coasts on daddy's cash and is one of many not-too-rich-but-still-rich douches revving a generic 2013 BMW \"M\"320 on all IG stories",
   "created_utc": 1690802563,
   "score": 183,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju760r1",
   "message": "Lives on a farm alone",
   "created_utc": 1690809230,
   "score": 158,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7cble",
   "message": "* The worst one I've ever met in my life never exactly had his own comeuppance. His father was wealthy from being the assistant harbormaster in one of the largest fishing communities in the country, so he never exactly had to work. From what I've heard, he lives off his family's wealth while being a hobbyist photographer. His parents did get divorced and his drug-addicted mother passed away.\n\n* Another little monster who was a year older than me died at 21, when he fell off a 200-foot cliff while hunting with his girlfriend's family.\n\n* This kid who tormented me nonstop at Boy Scout camp enlisted in the Army, was injured and is now partially paralyzed, living a secluded lifestyle under his family's watch.\n\n* The Boy Scout bully's close friend who was very antagonistic was busted four years ago during an FBI dark web sting operation, for trafficking drugs. He's awaiting sentencing.",
   "created_utc": 1690811985,
   "score": 243,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju6ruck",
   "message": "I don’t care enough about them to keep tabs. I’ve grown into a healthier person than I used to be and I like the distance between us.",
   "created_utc": 1690801601,
   "score": 179,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7anfz",
   "message": "Rich kid. Runs the family business now. Happily married with a kid. :/\n\nBut, hey, maybe he atoned and changed?",
   "created_utc": 1690811278,
   "score": 162,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju725wh",
   "message": "My bully and his buddy drowned….and it made me sad I am a foreigner and didn’t speak much English and couldn’t defend myself much so I just took it…this was in the late 90s and I’ve moved on but he didn’t get to….",
   "created_utc": 1690807371,
   "score": 88,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7tnzl",
   "message": "He became a disney channel star, started a youtube channel with creators, exploded, now hes in boxing",
   "created_utc": 1690818789,
   "score": 217,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju761ct",
   "message": "Tried to friend me on Facebook.  Seriously? Go f yourself.",
   "created_utc": 1690809237,
   "score": 171,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7md44",
   "message": "I do fine now. Was a stupid kid that did atupid things to a boy who didnt ask for it. We ended up being friends after he had the courage to call me out, i got suspended, and both our mothers agreed to meet and to force us to spend time together, to know each other. I never was more gratefull to someone than those two women, my mom obviously, but also his mom. She was a tall and fat lady, seemed really cold and severe at first glance (understandable as i had beaten up her son) but ended up being like a 2nd mother to me. She showed me that even trashy humans like me can become better if given a second chance in the right conditions, and that lesson will stick with me forever. Agnes, i miss you",
   "created_utc": 1690815996,
   "score": 163,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7ec6g",
   "message": "They all became nurses",
   "created_utc": 1690812813,
   "score": 94,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju762hq",
   "message": "My elementary school bully (in S. Korea for context) continued being the bully till high school. Somehow he ambushed and beaten this “the untouchable” student while he was alone. It turned that “untouchable” student was korean mafia son. Bunch of black cars park up at his apartment, burly guys armed with metal pipes and bats would constantly waltz around the neighborhood and make the bully’s family life hell. Apartment neighbors got fed up being terrified with the mafia at their neighborhood (cops will not show up until the mafia dispersed) to the point they pressured the bully’s family to move out at once. Never heard what happened after they moved.\nNot entirely sure why the bully did that, maybe due to his pride? Maybe a proof he is the “Jjang”  (old korean term for a student who is the toughest and strongest brawler, who’d constantly challenge or be challenged by other classes and/or other schools)",
   "created_utc": 1690809252,
   "score": 126,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7d4m5",
   "message": "I just looked him up!\n\nHe makes Youtube videos for ‘work’ in the vein of Andrew Tate. He has 212 subscribers and lives in his mom’s house (recognized it from the vids 😅)",
   "created_utc": 1690812321,
   "score": 146,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7cp3g",
   "message": "He was an \"anti-bully\". He was built like a tank and had crazy eyes. Everyone was affraid of him even the biggest, baddest bullies. Yet, he would help anyone in need and hated bullying. If you got messed with, you could ask for his help even if you didn't know him. He was a giant with a heart of gold. Last I heard of him is that he was a private contacter in a war zone and got mixed up in smuggling. He later fell off the face of the earth. Some rumors say that he got gunned down in the middle of nowhere. Other rumors say that he is sipping pina colada on a tropical beach with no extradition treaty.",
   "created_utc": 1690812142,
   "score": 217,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju79b0u",
   "message": "Went to college, got into drugs, lost his scholarship and got kicked out.\n\nLast I saw he's working construction and is making duck faces on his profile pic on Facebook.",
   "created_utc": 1690810697,
   "score": 48,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju79s5h",
   "message": "He's now some sort of spiritual guru.",
   "created_utc": 1690810903,
   "score": 129,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju77r1c",
   "message": "Dagmar became Dagmara and now works admin for a paper company.  \n\n\nBilly has been in more prisons than syphillis.  \n\n\nDavid has finally quit drugs, started a youtube channel about quitting drugs, and seems to be doing fine.  \n\n\nScott is still an utter and unrelenting prick of the highest order.  \n\n\nJoe got a lobe dissection and it seems to have controlled most of his upsetting and violent feelings.",
   "created_utc": 1690810008,
   "score": 75,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju71bat",
   "message": "Wasn't exactly my bully but we had few fist fights... he bullied pretty much anyone else who was afraid of him. He started to take drugs at the age of 13/14... at 18 he had the face of 60 with cancer. He was in prison, rehab, prison rehab... went to prison again because somehow he had a sword and destroyed a kids bike... his parents locked him outside when they weren't at home because he stole and sell everything to have money for drugs... one day... when we were about 17 18 suddenly everyone stopped talking about him (we lived in the same neighborhood) the street that he lived on was quiet, people started to go outside without fear so probably he dead or somewhere very far",
   "created_utc": 1690806953,
   "score": 69,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju74uwz",
   "message": "He went to prison for a time and now he does odd jobs. Pretty sure he still lives with his dad.",
   "created_utc": 1690808690,
   "score": 98,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju78xyu",
   "message": "Got in an argument over a parking spot and got himself stabbed to death.",
   "created_utc": 1690810540,
   "score": 166,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju74l2f",
   "message": "He’s in the Air Force and is one of the cohosts of Cloud City Conversations",
   "created_utc": 1690808556,
   "score": 150,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju73fp6",
   "message": "1 died, trying to bully a big tree while driving 50mph, the tree wasn't impressed and decided to  bully him back by not moving out of the way just before the bully attempt.\n\nI'd like to hug the tree but i don't know exactly where it happened...",
   "created_utc": 1690807992,
   "score": 176,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7cwvw",
   "message": "She's a labour and delivery nurse. And she hasn't changed. I deliberately chose a different hospital than the one she works in when I was pregnant.",
   "created_utc": 1690812232,
   "score": 107,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7eotm",
   "message": "Saw him at a party years later. Hung out and had a great time. Made a comment about how cool it is that here we are, kicking it like old friends when we didn’t get along in school. Dude starts bawling his eyes out and telling me how sorry he was. I… didn’t really like it.",
   "created_utc": 1690812956,
   "score": 68,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7txud",
   "message": "He got drunk, fell asleep in his car,  and froze to death.",
   "created_utc": 1690818889,
   "score": 134,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju706zv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju78q68",
   "message": "Believe it or not, jail",
   "created_utc": 1690810444,
   "score": 172,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju76sgd",
   "message": "Prison for child molestation.",
   "created_utc": 1690809578,
   "score": 176,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju801yu",
   "message": "The main person to bully me was a kid named Jonathan. He was a massive asshole. He bullied me relentlessly from 7th grade to junior year in high school. I was talking to a girl I was friends with and he decided it would be the best time to crush up a pack of cookies and dump it on my head. I had long hair and it sent me into a rage. I was fat which is why he bullied me so I couldn’t catch him but one of my friends saw and tripped him as he ran by. I picked him up and slammed him on the ground then punched him in the face a few times before teachers broke it up. A teacher saw the whole thing and was yelling at him before I even got to him. I didn’t get in any trouble other than a few days of in school suspension. He got suspended for a week. He never even looked at me again. \n\nHe is currently a homeless junkie in my hometown. Every so often he makes the news or a post from the PD on Facebook because he does stupid crimes like stealing scratch off lottery tickets from stores then tries to cash them in. It’s hilarious",
   "created_utc": 1690821190,
   "score": 153,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju89x9i",
   "message": "OH OH I HAVE THE BEST ONE FOR THIS GUYS: promise!!\n\nSo my bully was a guy, I’m a chic, and he was RELENTLESS. From kindergarten through middle school. Peaked in middle school. He would stick his leg out and trip me when I would walk by then laugh. Crap like that. He annoyed everyone. Imposed on your personal space. Would tell lots about me to others so they would not like me. It really bothered me deeply bc I could not understand what I had done to have someone so adamant about humiliating and hurting me. Publicly. \n\nWell. After middle school he disappeared to some other school and I slowly repressed it all and forgot of him in my active thoughts.\n\nThen I get my first apartment with a friend and a real job and going to college. I’m sitting on my new couch in my new place watching to catch a predator. Like every one did back then. \n\n“Next up on to catch a predator: “ and I hear his name. I hear that jerk offs name. AND THERE HE IS WALKING IN TO MEET AN UNDERAGE GIRL HE HAS VERRRRY DISGUSTING TEXT CONVOS WITH. I could not believe it. I stood up and screamed aloud. I felt so, vindicated for the feelings of hatred and inability to forgive him as a younger girl.\n\nJustice served!",
   "created_utc": 1690824849,
   "score": 189,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7c6dd",
   "message": "Mine always Bullied everyone who wasn’t a football player, jock, or “cowboy” he honed in on me because I was a nerd and more feminine. \n\nTurns out he had major major regrets about everything and at his last class reunion (he was two years ahead of me) he tried apologizing to people and a lot of people wouldn’t forgive him for what he did. A lot of it was borderline charges should have been filed type stuff, he made a couple kids suicidal. \n\nWell after a lot of people wouldn’t take his apology I guess he went into a major depression and ended up hanging himself and left a letter stating that he hated who he was, and how he treated people and the pain he inflicted on everyone and that he couldn’t live with himself anymore.\n\nThe really sad thing is I did run into him not too long before this and he did apologize to me (which I’m surprised he recognized me because I am female presenting now) and I accepted it and told him I didn’t hold anything against him. He really seemed sincere and that he changed. \n\nBut I understand how some couldn’t forgive the trespasses he made upon them.\n\nSad all the way around.\n\nThis is why everyone just needs to be nice to everyone, even if you don’t like them, like what they do, or whatever. These stories always end in unnecessary sadness or end of life",
   "created_utc": 1690811925,
   "score": 152,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7e8mf",
   "message": "Full ride scholarship through football to a D1 college, scouted by an NFL team in high school, just had to make it 4 years in college. Sexually assaulted a girl at the college, went on the run, had several warrants, got into an argument back in hometown that led to firearm discharge, and now he's in prison.",
   "created_utc": 1690812772,
   "score": 135,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7ncne",
   "message": "I had a fair number of bulliesin high school which was over 25 years ago so I am well past that. One of them several years ago sent me a facebook friend request. I messaged him back and said...\"You made the time we were in high school together hell (he was a couple years ahead of me in school), why do you think I would want to friend you?\" His response was \"If you are still holding onto that you have problems.\" Which I replied with \"No I dont have problems because I cut assholes like you out of my life.\" and then I blocked him.",
   "created_utc": 1690816370,
   "score": 156,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7r1r2",
   "message": "I met my bully years later on a parkbench at around 5am after a bender. Just heard him calling my name and that he’s going to shoot me right now. I was frightened but also very stoned so I told him that I’m sorry that I am so important to his life that he still thinks about me years later and invited him to sit down and have a beer. He couldn’t say a word for what felt like a very long minute and really sat down, drank a beer and we had an ok talk until I went home, never saw him again.",
   "created_utc": 1690817783,
   "score": 46,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju83k0j",
   "message": "Dead. He abused his girlfriend one time too many, she emptied a clip.",
   "created_utc": 1690822493,
   "score": 137,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju79idu",
   "message": "This was many moons ago, however he kept picking on my fat friend so he got my skateboard at the time across the teeth knocking multiple out. He came in to school two days later and told everyone his step-dad beat him as he couldn't bare the fact it was the nice \"friends with everyone\" guy who did it.",
   "created_utc": 1690810786,
   "score": 1,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7izhx",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju76h30",
   "message": "There were 3.  Dead, Jail, and alcoholic (although I heard he is doing better)",
   "created_utc": 1690809438,
   "score": 115,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju79oi7",
   "message": "Got a girl pregnant, then the cops came because turns out to no ones surprise he was beating her and the kid.\n\nThen got another girl pregnant and married her, rinse and repeat with the beatings and the cops.\n\nThen surprisingly became a born again christian, got another wife and another kid, then got arrested again because he was using the bible as a way to justify beating both of them, kid ended up within an inch of his life. Honestly his social media rants were pretty entertaining during this time, multiple bible verses about how its his right to kill his spouse and child and no one should interfere with it because invisible sky daddy agrees with him. Something something women and children are property and not people so the police shouldn't have gotten involved because hitting women and children is like hitting a tv or a toaster.\n\nAnd you'll never guess what happened after he got out, he dropped the whole born again christian thing but everything else is the same, yet another woman who can change him by giving him a kid, and yet another arrest after he beat them.",
   "created_utc": 1690810859,
   "score": 177,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju785y4",
   "message": "I punched him in the face in 8th grade and he didn’t even look at me for the next five years. No idea where he is now.",
   "created_utc": 1690810194,
   "score": 147,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju79ebn",
   "message": "I really don't care about it, but last I heard he did an apprenticeship and was mad AF that I'm now the one studying law and not him 😂 (he always told me I'm dumber than a dead banana, his words, and now I did my A levels and am in university)",
   "created_utc": 1690810736,
   "score": 145,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7bq4o",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7tov3",
   "message": "I got bullied really bad but it started slacking off in my junior year of high school when most of my bullies got jobs, started planning for college, or found themselves too busy with dating to make my life any more miserable than it was. The exception was Greg: a smirking, insufferable prick who began targeting me in junior high school because I was poor, and then expanded into myriad other reasons—basically anything he could use an excuse to humiliate or terrorize me, along with a bunch of other kids. \n\nThe last memory I have of the guy was him sitting with his buddies and making them all laugh by making fun of me and my Megadeth t-shirt. I was into heavy metal and D\u0026amp;D and horror movies, which earned quite a bit of misery from Greg and his buddies. \n\nAnyway, Greg hanged himself in his garage that year. The school allowed students to take off and go to his funeral, and I was one of a handful of folks who didn’t. \n\nIt’s not that I was happy he killed himself. On the contrary, I thought it was an extraordinarily fucked up and terrible thing that happened. Greg made my life miserable, but I had so many people making me miserable then that I halfway believed I deserved it. He was just one violent snowflake in a blizzard of misery. \n\nWhat I really felt was that it would be extraordinarily hypocritical and disrespectful to show up at this guy’s funeral when he hated me, and I considered him a tormentor in turn. It was crazy to me seeing guys who were regularly brutalized by Greg going to pay their respects. \n\nThey were serious about it, too. This wasn’t just a chance to take off from school. I caught hell from some of these people for not showing up. They just couldn’t understand why I thought I shouldn’t attend the funeral of a person who despised me. Decades have passed now, and I still feel I did the right thing by not going. \n\nGreg’s suicide was a tragedy and I feel deep sympathy for his parents and loved ones, even now. No matter what Greg did to me, there were people who loved him, and the kind of wound any death leaves—especially a suicide—never really heals.",
   "created_utc": 1690818796,
   "score": 127,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7iu73",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju79gyj",
   "message": "He’s a preacher 🙄",
   "created_utc": 1690810767,
   "score": 77,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7ez83",
   "message": "He still takes my money to this day!\n\nHowever, he does pull a good pint so It's all good.",
   "created_utc": 1690813074,
   "score": 75,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju8391o",
   "message": "Used his fathers money to spend 7 years on the other side of the world to complete a 5-year masters degree. Downright slob and a dirtbag who was way more concerned about partying and living large than accomplishing anything in life. \n\nBut the plot twist was that his father only would pay for him when he was a student, so when he landed his first job, a basic entry-level position, and had to pay bills and answer to a superior, he was hit hard in the nuts by reality. Instead of lashing out or coping by drinking, he just went \"time to learn about life and to become a responsible adult\". \n\nNow he has a manager role that pays 75k and lives in a modest apartment, and is one of the nicest, most inclusive guys I know who has no issues admitting his past mistakes and apologize for his behaviour.\n\nPeople can change.",
   "created_utc": 1690822382,
   "score": 38,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7unf2",
   "message": "Fucker went on to serve in the military, recently retired.  Wish I would have broken his arm worse.  \n\nAs one final bully tactic a few days before graduation he and his fucked up friends spike my drinks at a party.   I didn't know i had a condition that my liver doesnt process alcohol right because i didnt party in school. So I drank 8 large solo cups of pink lemonade vodka, and still appeared and sounded completely sober..  I walked out to my car intending to drive home.  A friend of mine comes running out of the house and stopped me.  Told me what the assholes did and drove me to a friend's house to sleep it off.  But we quickly figured out something was wrong. So ER visit.  I was 5 times over the legal limit.   \n\nI could have died or killed someone driving because i didnt know I was drunk off my ass.  And this mother fucker gets to go into the Army with zero repercussions.   Fuck you Nathan Caruso.",
   "created_utc": 1690819157,
   "score": 75,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju735n7",
   "message": "My class in HS didn’t have a bully but the class ahead of me had a few. A couple of them peaked in HS and you see them sometimes but neither of them went on to good things. The other one has serious health issues and is in a wheelchair due to his weight. It’s really odd but they’re all overly nice when you see them.\n\nThe class behind me had a group of mean girls that were awful. All very popular and attractive and all of the (like 6) walked the stage at graduation pregnant.",
   "created_utc": 1690807858,
   "score": 46,
   "submission_id": "15ed2ny"
  },
  {
   "comment_id": "ju7t3eg",
   "message": "Married a high maintenance trophy wife. Had kids. Got a job he hates. Lost his marriage, house, and hair. Kept the job he hates.",
   "created_utc": 1690818571,
   "score": 57,
   "submission_id": "15ed2ny"
  }
 ]
}