{
 "submission_id": "15egmhz",
 "title": "What was your worst \"Sh*t, I forgot\" moment?",
 "selftext": "",
 "created_utc": 1690811047,
 "permalink": "/r/AskReddit/comments/15egmhz/what_was_your_worst_sht_i_forgot_moment/",
 "score": 195,
 "url": "https://www.reddit.com/r/AskReddit/comments/15egmhz/what_was_your_worst_sht_i_forgot_moment/",
 "comments": [
  {
   "comment_id": "ju83bah",
   "message": "\"When you are finished with your final exam, bring it up front and turn it in, along with your term paper.\"\n\n\"...Term ...paper?\"",
   "created_utc": 1690822405,
   "score": 234,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7qli5",
   "message": "I was playing Forza, the racing game. \n\nThe \"bots\" in single player races use the names/cars of your friends in your friend list.\n\nSaw my buddy's name next to me on the starting line, hadn't talked to him for a while, so I gave him a call. \n\nNumber was disconnected, and I realized I forgot he died the year prior.",
   "created_utc": 1690817610,
   "score": 217,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7d8kq",
   "message": "I was a full time photographer for years, mostly newborns. One of the families hired me to also shoot the baby’s baptism. I somehow got the date mixed up, and I was unaware until I got a very stern email from the mother saying, “I don’t know where you were, but!!!!” I was so mortified and upset with myself. Their entire family had shown up for the event. Luckily they ended up forgiving me after initially being very upset, and we staged another (without their family) so they’d at least have pictures. But it sucked.\n\nEDIT 1: \n\nThanks for all the upvotes! Here was the email I got from the mother (an attorney) after missing the baptism. Again, she did forgive me, we did recreate pix of the baptism, and she even went on to hire me for more newborn photos when she had her next child! I was going through a breakup at the time, and I guess I had a major brain malfunction. Definitely the worst mistake I ever made professionally.\n\n“For the record you missed my daughter's baptism and first birthday today, October 11.  It was today, not tomorrow, as clearly indicated in the many emails I exchanged with you.   Needless to say, we were devastated when we arrived at the Church with only our cell phones to use to capture the moment.  It was a once-in-a-lifetime event, to which we had family coming in from Orlando, Miami, Venezuela, and Boston.  It would have been nice to  capture those memories, which of course was the reason we hired you and paid you in advance for the full amount.  \n\nThe opportunity to make this right has passed, so I think it goes without saying that we are making a full demand for the full amount the $500.  If you do not reimburse us immediately, we have no problem filing a lawsuit against you.  I regret to even have to bring up litigation, but you really dropped the ball on this one.  There is no reason to preserve the business relationship because we will never hire you again.  Please consider us a former client only and on behalf of everything Holy, please do not use us as a reference.”\n\nEDIT 2: After several emails of me apologizing, they decided I could give them a partial refund because they wanted to help me out as I said I was so so sorry and I felt terrible etc and had taken on too many obligations and made a grave error. They knew I had just gone through an awful divorce and had three little boys plus had just got broken up with—my first relationship post divorce. \n\n“Hi ______, I want to start this email by apologizing for my harsh words on previous communications. I was extremely upset at all the situation and sent the email in the heat of the moment. \nI am truly sorry about your whole situation specially with your boys. I know in my heart that you are going thru tough times. I can't imagine all the challenges you are facing right now...\nI also know you are a very talented photographer and hence our desire to make this right. We were wondering if you were interested in doing a shoot at the church. It will be basically us in the same outfits and ______ in her baptism gown ( I still have to contact the church to ask for permission and work the logistic) with maybe a switch of outfit for baby _____. \n\nWhat do you think?”",
   "created_utc": 1690812365,
   "score": 229,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7jpvt",
   "message": "I was out on a road trip one summer Saturday evening. Stopped for fuel, snacks and to check my phone. \n\nI had like 5 missed calls from different friends and a bunch of texts. \n\nHit me like a sack of hammers, \"Shit I forgot the wedding was today.\" \n\nGood friend was getting married. Like I'd bought a dress to go. Had made arrangements with a friend to share a hotel room. Was really looking forward to it. \n\nSomehow switched the weekends in my head. Even had touched base with friends the week leading up to it. \n\nDid some highly illegal motorcycling and got there by the time the reception was starting. Looked like a hot mess and my hair was an absolute disaster but I still had fun.",
   "created_utc": 1690814964,
   "score": 133,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju81d8x",
   "message": "My wife loves the All America Rejects and they were putting on a free concert 2 weeks ago in a town a few minutes away. Well we somehow got the dates mixed up and ended up missing it by a week. Had a babysitter come over and everything so when we got to the venue and found it empty we realized our fuck up and went home. Still paid the babysitter for the full night and we played Mario Kart instead",
   "created_utc": 1690821685,
   "score": 150,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7auds",
   "message": "Drove two hours to the airport just to realize I forgot my ID on the kitchen table. Thankfully it was a domestic flight, they felt bad for me and let me on anyway.",
   "created_utc": 1690811361,
   "score": 143,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7jql4",
   "message": "My mum and I loaded up the car and drove a long way to my sister's house for Christmas. We had packed all her cooking. We had forgotten the presents.",
   "created_utc": 1690814972,
   "score": 44,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7uuqa",
   "message": "Turned on the spigot in the barn to fill the water trough. Started cleaning stalls, turned the horses out. Got done, went in the house, went on about my day. Ate dinner, went to bed, got up the next morning. All of a sudden remembered I never turned the water off in the barn. Flooded the dirt floor barn, damn river running out the back door, massive water bill that month.",
   "created_utc": 1690819232,
   "score": 229,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7fh3d",
   "message": "Left my phone on the bus on the last day of school",
   "created_utc": 1690813273,
   "score": 7,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7flki",
   "message": "Second hand but it was crazy.\n\nI spent about 6 months working with a team on a government proposal for funding to build a nursing home. I can't tell you how much effort was spent on it. \n\nWe submit and get rejected almost immediately. \n\nOne of the criteria was that you had to have this specific engineering firm basically thumbs up all the work you got your own architects/engineers to do. It was very specific. And the guy in charge of that just forgot to do it.",
   "created_utc": 1690813322,
   "score": 251,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7b2pu",
   "message": "Scheduled a job interview and then completely forgot about it. Didn't remember until a week later.",
   "created_utc": 1690811460,
   "score": 228,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7x394",
   "message": "Working as an operating theatre orderly at a hospital in the early 90’s I went for breakfast and forgot that I was supposed to take a bone that had just arrived via courier to a surgeon who had just prepped the patient for surgery.",
   "created_utc": 1690820079,
   "score": 60,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7p4lw",
   "message": "I was catching a flight from Germany (military base) back to the US to visit family. The bus ride to the airport was 5 hours. As the bus was just pulling out, I realized that I had left my passport at home. Fortunately, I was the only passenger. The driver drove back onto the base. I a car and retrieved my passport. The whole debacle only took about 20-30 minutes. The driver was able to make up the time on the Autobahn.",
   "created_utc": 1690817037,
   "score": 188,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju86hyj",
   "message": "Sophomore year of college I took Astronomy.  It was a self-paced class, so you went into their computer lab and had 2 tries/day per unit, and sign up for the labs when you have time.  It was across campus and I figured, \"Eh, I'll get around to it next week.\"\n\nTwo months pass and I'm working on a paper for another class and I suddenly realize I've completely forgotten about Astronomy.  My adrenal gland was kind enough to dump its contents then and there.\n\nThus begins my mid October mad scramble to cram an entire course into a few weeks.\n\nBut...I did it.  In fact, I was done by mid-November, completely.  Something came up and I went to drop by the Astronomy building for something the following week and realized that, with lines queuing up around the block, plenty of people had a similar revelation in late-November.\n\nNext year will be my 20th anniversary of graduation and I *still* have nightmares about similarly missing a class.",
   "created_utc": 1690823589,
   "score": 199,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7rcs9",
   "message": "Maybe not my biggest, but one I will always remember, was when I forgot to bring a button down shirt for family photos. \n\nMy wife, step-daughter, and I were scheduled to take family photos together about an hour and a half away from home. I had my suit with me, and assumed that my button down shirt was hanging with it. It was not. I had forgotten it at home, and as I opened the trunk of the car, my heart sank out of my chest as I realized my mistake. My wife had scheduled everything and all I had to do was make sure I had everything prepared. I felt horrible the entire drive back as I was so mad at myself for forgetting it.",
   "created_utc": 1690817902,
   "score": 133,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7ghi0",
   "message": "Forgot to take the chicken out of the freezer and mom just got home.",
   "created_utc": 1690813680,
   "score": 138,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7zb58",
   "message": "I left a bag of milk in my car for 5+ days in the middle of a 30c+ week and wondered what the smell was. Worst smell ever draining that.",
   "created_utc": 1690820910,
   "score": 146,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7t0i0",
   "message": "I was taking care of my sister's cats (6) while she was out of the country. I was supposed to feed them breakfast, supper, and clean their boxes every day. I usually did it before and after work. One of her cats needed a twice per day medication. \n\nOne night, I had to work really late. I was exhausted and went home and fell asleep on the sofa. I woke up around 2am. I realized I had forgotten to check on the cats!\n\nI drove across town and did my kitty aunt duties in the middle of the night.",
   "created_utc": 1690818541,
   "score": 74,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8ljyg",
   "message": "I was heavily pregnant with my second child and my first was a toddler.  It was one of the hottest days of the year and I strapped my daughter into her car seat and then got in the car to turn it on and leave.  I had serious mom brain and forgot my sprinkler was still on, so I got out to turn it off.   As soon as my door shut, I realized I had locked both my daughter *and* my keys in the car.  I *immediately* called 911 and although it only took a few minutes for the fire and police to get to my house, I was extremely scared for my daughter.  I started crying and then she started crying and it was a hot mess.  If the authorities took any longer to get there, I definitely would have smashed a window to get my daughter out. \n\nAnyway, the firemen were able to get my door unlocked and my daughter was a little sweaty, but fine. \n\nThe cop actually had the audacity to say to me, “I’m not going to press charges this time, but if I ever have to come back here, you’re in trouble”.  \n\nWell, that same child is about to start college.  She’s great and I never had any other “oopsies” with either child since, so we’re good.",
   "created_utc": 1690829161,
   "score": 187,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7mxcs",
   "message": "I used to have a pet lizard and her heat lamp was set to a timer to turn on in the morning.  One evening,  I put the lamp on the floor so I could clean her tank (obviously I removed the lizard as well.)  Put the tank back together, put Oly back in her home, but I forgot to put the heat lamp back on top.  I woke up to a weird smell.  Big circular burn in the wood floor of my apartment.",
   "created_utc": 1690816216,
   "score": 16,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7rzq2",
   "message": "Recently?\n\nI went up to the store for a 6 pack and told my wife I'd get her chocolate. I got 5 steps from the front when I realized \"Sh*t, I forgot the chocolate.\" I stood there for about a minute contemplating whether to go back",
   "created_utc": 1690818149,
   "score": 48,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju83vrh",
   "message": "I once witnessed the 30 second deterioration of someone’s mind as they realized they had forgotten to assign referees to an important college athletics event. \n\nThis may not sound important, but imagine two teams one of which has traveled across 6 states, a thousand fans in the stands, and you’re home team waiting seconds before starting time and then everyone is like…hey…where are the refs. \n\nThis person's face fell off their body. No one died. Everyone lived. Nobody got fired. Some people got yelled at a little is all. But the look on the schedulers face was like…it was like they had hit the nuclear launch button only to find out there was no threat.",
   "created_utc": 1690822614,
   "score": 221,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8dk05",
   "message": "Years ago, before cell phones, my mom, dad and myself (8yrs old) were driving to pick my brother up from camp which was several hours out in the country. We stopped for gas and dad agreed to let me sit in the front as he planned on napping in the back. We get gas and all drive off. Over an hour later my mom asks my dad a question and gets no response. We both turn around to an empty back seat.\n\nEdit: thanks for the upvotes. As requested, how it ended. We went back to get my dad and returned to the gas station about 2 hours after leaving him. I remember him calmly sitting at a bench by the entrance reading a magazine. When we pulled up, he nonchalantly put the magazine down and got in the car and just said “I figured you’d come back eventually”. He was generally a\na calm and quiet man but I remember being amazed at how well he kept his cool.",
   "created_utc": 1690826182,
   "score": 138,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7ic1i",
   "message": "I forgot to buy enough Vodka to make it through Sunday in a state that doesn't sell alcohol on Sundays.\n\n\nI ran out late Saturday night.\n\n\nMonday morning 8:50 a.m., I'm sitting in the liquor store parking lot waiting for it to open at 9:00.\n\n\nshaking, gagging, dry-heaving, sweating and shivering, crying and a mental wreck.\n\n9:00 gets here, I get my bottles and one of them is half empty before I even get out of the parking lot.\n\n\n6 years sober",
   "created_utc": 1690814416,
   "score": 222,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7p7s4",
   "message": "Had to drop a dog off to someone 20 minutes away for an important vet appt on my way to work. Got about 5 minutes from the persons house only to realize I forgot the dog.",
   "created_utc": 1690817072,
   "score": 99,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7agc6",
   "message": "I forgot my Student ID at the last day of my final exam 😭",
   "created_utc": 1690811193,
   "score": 224,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7b0mx",
   "message": "When you’re on your way to the birthday party and you forgot to buy a present",
   "created_utc": 1690811436,
   "score": 24,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7mf09",
   "message": "Bought plane tickets to Portugal and rented a nice home on Airbnb. Realised my passport has expired 2 days before the flight and it was too late to get an emergency passport.",
   "created_utc": 1690816017,
   "score": 66,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8l4tf",
   "message": "When I was kid my Grandma called and I picked up the phone. She asked to speak with my mom, and I said \"OK, I'll get her.\" Then I got distracted and forgot. It must have been like an hour or two later when my mom noticed the phone was off the hook. She picked it up and said \"Hello?\" My poor grandma was still patiently waiting on the other end. Maybe not the biggest oops, but it still sticks in my mind for some reason so many years later.",
   "created_utc": 1690829006,
   "score": 114,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7zpo2",
   "message": "Slept in for an exam that got changed from 1 pm to 9 am.Almost didn’t pass intro to statistics.",
   "created_utc": 1690821062,
   "score": 214,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8v9rg",
   "message": "My brother and I were driving to our dad’s funeral. He wakes up from a dead sleep and shouts “FUCK!”. He looks at me and says “I forgot dad’s ashes at home…”. Four states away. After he calmed down I had them overnighted and everything turned out alright. He was pretty upset for a couple hours though. And now we have the joke for the rest of our lives that dad was even late for his own funeral. I consider it a good memory.",
   "created_utc": 1690832767,
   "score": 186,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7kk1x",
   "message": "Mine is probably pretty benign. \n\nMy wife usually picked up our daughter from elementary school and on Wednesdays they went to ballet/dance class and got home around 7pm.\nOne week my wife was unable to do it and I was supposed to pick her up. Well I got really busy at work and I completely forgot her. (Pre cell phone days). The school kept leaving messages on our answering machine but obviously no one was there to get them. I got home at 6:30 to a ton of increasingly angry messages from her teacher.\nBy the time I got her the teacher was ready to kill me. My wife and daughter weren't happy with me either...",
   "created_utc": 1690815289,
   "score": 49,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7mrgs",
   "message": "In a recurring dream where I forgot I had signed up for a class in college, never attended and now it's the end of the semester and I'm about to fail and there's nothing I can do about it. \n\nI'm almost 50 and that shit still pops up from time to time.",
   "created_utc": 1690816152,
   "score": 66,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7weuj",
   "message": "Helping a friend to a automatic to manual transmission swap on a '90s 5.0 Mustang . We were just finishing up connecting everything when I noticed the clutch fork on the garage workbench.",
   "created_utc": 1690819823,
   "score": 130,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7j1sl",
   "message": "I was headed to my college graduation with my wife and kids. We got to the school, 45 minutes away, just in time.\n\nAs I am running to get inline, my wife says to hand her the tix real quick. \n\nMy heart sunk, they were still on the dresser.\n\nLuckily a friend was there with enough extras",
   "created_utc": 1690814700,
   "score": 178,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7umyk",
   "message": "Left my apartment to go on vacation to Japan, I was in the queue for security at the airport when I realized I completely forgot to empty the trash in the kitchen. That was a funky smell when I came back two weeks later.",
   "created_utc": 1690819152,
   "score": 198,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7o9rs",
   "message": "My sister had a fake baby for a week that was heavily sensored based on a crying gesture to alert. \nDuring the day I thought maybe it would be best to take my little sister out to run errands and to of course, keep this fake baby occupied as my sister would struggle. \n\nWe head to the grocery store and we are in a deep conversation. We then make our way out of the vehicle and into the packed parking lot and as soon as we hit the grocery store entrance we then remember that, my sister is a mother to a plastic doll for two more days. \n\nWe run to the vehicle however, there are people now looking at us. Once we get closer to the vehicle, the baby is screaming at us. We then decide to drive off instead of pulling this crying baby out of the vehicle. Embarrassed to say that we had went to another grocery store. \n\nIt’s been 6 years and my parents are still not grandparents. Thank god.",
   "created_utc": 1690816702,
   "score": 230,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7o36z",
   "message": "Finished work did my weeks shopping and got home. Found out I left my door keys at work. Had to hide the shopping then get the bus to work and back again.",
   "created_utc": 1690816639,
   "score": 119,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7s8a1",
   "message": "Not mine, but I wanted to share this for anyone who has felt they are too stupid to live when they did something like this.\n\nThe Argentina national team recently went to play a match in China and Leo Messi, the captain of the national team and probably one of the biggest figureheads for the country these days, *forgot his Argentina passport.* Apparently, he just grabbed the wrong one, he took his Spanish passport but it didn't have his visa in it and he no longer lives or works in Spain.\n\n(He was detained at the airport and the issue was eventually resolved and he was allowed to enter, but it was a bit of an ordeal.)",
   "created_utc": 1690818240,
   "score": 161,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju82b8t",
   "message": "Drove halfway from Texas to Asheville to realize that I had left one of my suitcases home. Ending up having to buy new clothes as it wasn’t worth it to drive back.",
   "created_utc": 1690822038,
   "score": 107,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju80gws",
   "message": "Mine is the stuff of nightmares: I was ambitious in college and did a lot of accelerated courses which were half semester and started in either the early half or late half, and I used this to stack up as many credit hours as possible. One time I forgot entirely about one of the accelerated classes I had enrolled in. I was also working full time and with all the courses I had I just actually completely forgot about this one because I had so much going on and honestly just overlooked it (it was some required course so not one I necessarily was going to have on my radar in terms of interest). I realized it in the last 1/3 time of class and had to drop it as a “W” (stood for withdrawal, from exiting the class too late to have no impact on grade but able to be substituted with the grade I got when I successfully took the course the next semester so the hit to my GPA was limited). I was so embarrassed. I was stacking classes to complete quickly and therefore graduate earlier and make more money in the workforce earlier so the fact I couldn’t get the course refunded was a blow as well. \n\nI told a few people who were in college about this when I was older, not as a cautionary tale but just to mention it, and they always say “that is what I literally have nightmares about” so this is a common nightmare for college kids. \n\nI lived it.",
   "created_utc": 1690821349,
   "score": 149,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7lwhl",
   "message": "I was supposed to order a giant lobster for the grocery store when I was taking over for the department manager and forgot. It was for a weekly contest. We just told everyone that the supplier ran out of big lobsters and skipped a week.",
   "created_utc": 1690815813,
   "score": 80,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7oa1e",
   "message": "I forgot where I put my ex's tax return forms. I was already on thin ice just from being myself and her being her. She told me to grab them for her on her way home. I was already convinced I was useless and this didn't help. \n\nMy first (and hopefully last) ever panic attack... Dry heaving. Sweating/felt warm. Light-headed. Heart racing. Felt like it lasted an eternity. Holy shit.",
   "created_utc": 1690816704,
   "score": 88,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7yx5t",
   "message": "I left my €1000 laptop in a bag in a lecture room and realised on my way to a different building.",
   "created_utc": 1690820763,
   "score": 57,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7gtnx",
   "message": "Wasn't taking my ADHD meds and forgot my dad's 75th birthday.  Still cry about that.",
   "created_utc": 1690813816,
   "score": 169,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7tkio",
   "message": "When I applied for a dual system apprenticeship in Hong Kong I accidentally sent my application from my spam email which had a very funny name to the HR department. When I realised that i started to scream and felt so embarrassed to call the agency...  \n\n\neventually i wasn't accepted",
   "created_utc": 1690818750,
   "score": 77,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7qrhc",
   "message": "I forgot to check the boiler at this Colorado hotel I was winter caretaker for. Didn’t end well.",
   "created_utc": 1690817673,
   "score": 119,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8b9gu",
   "message": "Forgetting a court date. then having cops at my door few days later. Fun times.",
   "created_utc": 1690825338,
   "score": 95,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7mygk",
   "message": "I woke up at the time I had to LEAVE to go to the passport office (1 hour drive away) for my emergency passport appointment and had forgotten to fill out the form the night before. For some reason, I kept thinking I had to fill it out in front of an officer there. Needless to say that my hand was shaking while I filled it out on the way there.",
   "created_utc": 1690816228,
   "score": 52,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7xouu",
   "message": "Forgot my driver's license at the DMV when my Grandma was gifting me her old car as a graduation gift. Poor gam gam waited in that whole line just for me to go \"Whoops guess we have to come back\"",
   "created_utc": 1690820302,
   "score": 59,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7xr0c",
   "message": "Me and my dad were at a cafe, he told me to grab keys from our apartment that is a couple blocks away, i run there but i was super thirsty when i got there, so i drank water and ran back. When i can back he asked....\"where are the keys?!\"",
   "created_utc": 1690820325,
   "score": 74,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7j5jg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju88q3u",
   "message": "I’m on vacation right now, we have a BIG-ASS tv that I brought my Switch to play on, but I forgot my HDMI cord.",
   "created_utc": 1690824409,
   "score": 25,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju805lu",
   "message": "Running shoes for a trail marathon.",
   "created_utc": 1690821230,
   "score": 30,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7tttf",
   "message": "Forgot to buy my mom's return ticket from Vegas.",
   "created_utc": 1690818848,
   "score": 35,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju82fuk",
   "message": "Was on my way to an archery competition. Realized I forgot my bow. Had to drive back home and when I got there my dad was standing outside holding my bow for me with a giant grin on his face 😂",
   "created_utc": 1690822085,
   "score": 74,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8layg",
   "message": "Recently, was boiling a pretty large pot of cut potatoes in order to make mashed potatoes for a potluck. I got busy cleaning house and forgot them. For over an hour. Hours even? There were no potatoes left! They had boiled away to *nothing*! It was just starchy water.",
   "created_utc": 1690829069,
   "score": 71,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8iye5",
   "message": "I was supposed to have a girl over super early in the morning (4am). She couldn’t sneak out late at night only that early in the morning. We were trying to avoid the whole parents thing. So i had to stay up until then because i wouldn’t be able to wake up in time.\n\nneedless to say i fell asleep and forgot she was coming over and she waited down the street for 2 hours calling me. I was such a dickhead for that i completely forgot i regret that",
   "created_utc": 1690828203,
   "score": 13,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8gamj",
   "message": "I had my friend’s expensive camera in my drawstring bag on a train in Amsterdam with loads of pictures from 2 weeks of a Eurotrip. Put it down and forgot I had it, walked off the train and never saw it again.",
   "created_utc": 1690827210,
   "score": 29,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju82lht",
   "message": "Drove 4 hours and forgot the work truck keys I didn’t even remember until my supervisor asked me to fire up the truck I had to drive back again for the dam truck keys. Good thing thoe is that I did all that on company time.",
   "created_utc": 1690822143,
   "score": 9,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8dkm2",
   "message": "Two weeks of missed medication because we went to a different country and I forgot my meds.",
   "created_utc": 1690826189,
   "score": 14,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7al89",
   "message": "\"Shit, I forgot I was on a platform without a swear filter on which I don't need to censor myself.\"",
   "created_utc": 1690811251,
   "score": 39,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7xm86",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju7ttef",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8hov1",
   "message": "Thanks to my ADHD, there's plenty of these. Also thanks to my ADHD, I can't actively remember any of them.",
   "created_utc": 1690827735,
   "score": 41,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8n1tx",
   "message": "Was scheduled for a 6 am flight. Well, I had a drink or two the night before and totally forgot to set my alarm. I did wake up before the flight, by about ten minutes. Charmingly, I lived right under the flight path, so I walked outside and watched it fly by.",
   "created_utc": 1690829709,
   "score": 45,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8dk0h",
   "message": "Forgot the engagement ring before my wife (then girlfriend) and I left for Paris.   \n\n\nNo, I was not going to be stereotypical and propose on the top of the Eiffel Tower, in fact I was going to try do do it at a flower exhibition they were having at the Louvre, but I remembered it as we were in the taxi on the way to airport; we had already been driving for about an hour so there was zero chance of going back to get it.\n\nWe did have a spectacular time in Paris, but the proposal ended up being me asking her when we got back in her apartment after a full day of traveling when we were both exhausted and jet lagged.",
   "created_utc": 1690826182,
   "score": 29,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8i96u",
   "message": "I had an undergrad class that was on Tuesday and Thursday mornings at 10am. It was the week before finals week and the professor let us know that if you’re late to the final, you will receive a zero. Well, knowing me I’m already on campus an hour early so I’d be fine (I lived off campus). \n\nSo up comes finals week, I get to my Monday final and finish that and head back home to get ready for my Tuesday final. I go to sleep that night and set my alarm. I wake up the next morning and no alarm went off. I look at the clock and it says 10:15am. I set my alarm for 8:15pm. I panic and say “Oh shit!”, so start calling everyone I can that might be on campus at that time to run to my professor and tell him some excuse. \n\nBefore I head to class I usually, shower, morning hygiene type stuff. I did not do any of that. I put on whatever clothes were closest to me and ran out the door literally looking like I just got out of bed. Knowing that I lived about 35 minutes away from campus I had to haul ass. I never ran a red light before in my life, but with rush hour traffic just about to end, the freeway meters were still on. I jump into the carpool lane on-ramp and blow past the red (stupid decision). I’m dropping F bombs left and right. But then about 10 minutes on the freeway go by and then I realize I missed one thing my professor mentioned. The final would be on Thursday. I took the next exit, went back home and started texting everyone I tried to call sorry. Then went back to bed and slept. I took a fat L that day. But got the W on Thursday",
   "created_utc": 1690827944,
   "score": 29,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju8n7nf",
   "message": "Not mine but my parents. They were in a rush the day of my baptism, when they arrived at the church they realized they forgot a tiny detail... me.",
   "created_utc": 1690829770,
   "score": 24,
   "submission_id": "15egmhz"
  },
  {
   "comment_id": "ju89f5s",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15egmhz"
  }
 ]
}