{
 "submission_id": "15ehppc",
 "title": "What’s the most overrated tourist destination?",
 "selftext": "",
 "created_utc": 1690813657,
 "permalink": "/r/AskReddit/comments/15ehppc/whats_the_most_overrated_tourist_destination/",
 "score": 172,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ehppc/whats_the_most_overrated_tourist_destination/",
 "comments": [
  {
   "comment_id": "ju7ji91",
   "message": "Hollywood",
   "created_utc": 1690814881,
   "score": 126,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7gjo3",
   "message": "Times Square, New Year's Eve",
   "created_utc": 1690813705,
   "score": 220,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju831v1",
   "message": "Here in Vancouver, tourists flock to the [Gastown steam clock](https://www.atlasobscura.com/places/steam-clock-gastown-vancouver), to the point where they block off almost all sidewalk access to take photos.\n\nThere's nothing special about it. Just a clock powered by steam. And it's not even completely powered by steam – just part of it is. It plays a tune but it's not even at a scheduled or consistent time. It does it whenever it wants to.\n\nA lot of locals don't get the hype around it.",
   "created_utc": 1690822309,
   "score": 164,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8r4s9",
   "message": "I’ve never once heard anything good about Plymouth Rock.",
   "created_utc": 1690831225,
   "score": 154,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8f9eh",
   "message": "Titanic wreckage site",
   "created_utc": 1690826821,
   "score": 217,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7xpux",
   "message": "Niagara Falls  (US side). The place is  a drug-infested dump. (Full disclosure: my home town. I know from whence I speak.)",
   "created_utc": 1690820313,
   "score": 141,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8aqlm",
   "message": "Hollywood Blvd!",
   "created_utc": 1690825147,
   "score": 55,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7wg38",
   "message": "Dubai - a hotter version of Las Vegas but no soul",
   "created_utc": 1690819837,
   "score": 237,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8e22i",
   "message": "Hollywood, specifically the Hollywood Walk of Fame. It’s just a bunch a celebrities’ names on the ground.",
   "created_utc": 1690826367,
   "score": 51,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju828kd",
   "message": "Hollywood \u0026amp; Vine (or Cahuenga?  Both probably) is such a disgusting, ugly, dirty area that gets completely covered over by tents and turned glamorous for the Academy Awards one night of the year. The rest of the time it’s basically Times Square but there isn’t even anything cool or impressive to look at. Times Square sucks but there is a spectacle to it. Hollywood is just like the movies, it’s a trick. It’s the least glamorous place in LA.",
   "created_utc": 1690822010,
   "score": 75,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8gyou",
   "message": "Cairo - the pyramids of Giza\n\nTotally ruined by the ruthless begging and swindling and rubbish",
   "created_utc": 1690827466,
   "score": 100,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8bgld",
   "message": "Myrtle beach. Jealous I never went as a kid because all my friends went every year.\n\nI went 2 years ago and holy hell talk about a redneck dump hole. Redneck Riviera for sure \n\nSpend more money to go to Hilton Head",
   "created_utc": 1690825411,
   "score": 133,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8sx6i",
   "message": "Grassy Knoll in Dallas. Most recently all the QAnon dipshits were waiting for JFK Jr to do something there. The sixth floor museum is really cool, but the grassy knoll is just a hill right next to major downtown roads.",
   "created_utc": 1690831894,
   "score": 34,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7hhok",
   "message": "Mount Rushmore was severely underwhelming.",
   "created_utc": 1690814086,
   "score": 220,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju85jwo",
   "message": "Los Angeles as a whole is pretty dirty and underwhelming. The upsides are food of any variety.\n\nI live in LA. \n\nPeople picture beaches, sun and Disneyland.\n\nIt is mostly homelessness, trash and stuck up people with the worst public transit system for such a large city.\n\nDisneyland isn't in LA.",
   "created_utc": 1690823237,
   "score": 145,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7huy4",
   "message": "The Trevi fountain in Rome. It is beautiful but always so crowded and hot. You can't enjoy it at all.",
   "created_utc": 1690814231,
   "score": 178,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7gnk8",
   "message": "Leaning Tower of Pisa.",
   "created_utc": 1690813747,
   "score": 155,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju812eo",
   "message": "Stonehenge - its some rocks that you are not allowed anywhere near.",
   "created_utc": 1690821571,
   "score": 92,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju81oj4",
   "message": "Benidorm. I mean damn, there are soooo many better places in Spain. Unless what your looking for is fellow Brits to complain about Spanish people with of course.",
   "created_utc": 1690821802,
   "score": 14,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8eujg",
   "message": "Pigeon Forge, TN\n\nIt's mostly just one long stroad with an offshoot that leads to Dolly Parton's theme park. Lots of chain restaurants, goofy tourist trap things like a crime museum. I recommend just passing through Pigeon Forge and going to Gatlinburg instead.",
   "created_utc": 1690826667,
   "score": 21,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju890xo",
   "message": "Little Mermaid, Copenhagen Denmark. Very small, a bit out of the way, opposite of the industrial harbour, so the view is poor. Only one overpriced snackbar close by.",
   "created_utc": 1690824521,
   "score": 40,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7hda1",
   "message": "As a New Yorker, Time Square.",
   "created_utc": 1690814037,
   "score": 68,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7vnuu",
   "message": "I'm surprised Las Vegas hasn't made it on this list. It's overpriced, full of douchebaggery and stupidly crowded.\n\n*Edited for bad spelling due to my fat sausage fingers.*",
   "created_utc": 1690819540,
   "score": 152,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7t8bz",
   "message": "Four Corners. Most everyone there was mildly embarrassed to be seen.",
   "created_utc": 1690818623,
   "score": 47,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8hoc4",
   "message": "Disney World. Jesus fucking Christ. One of the most expensive, crowded amusement parks in the world, and like two of the rides are actually good.",
   "created_utc": 1690827730,
   "score": 71,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7ivpx",
   "message": "manneken de pis",
   "created_utc": 1690814632,
   "score": 36,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8a0um",
   "message": "Nah, there's no valid answer. What you consider over rated is novel and exciting to someone else. Dubai seems like a valid answer, but where else can you find a Dubai? Dubai is the only Dubai in the world, so it's gotta offer something you can't find elsewhere",
   "created_utc": 1690824886,
   "score": 10,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju86ejz",
   "message": "Disneyland. The rides were crowded and we barely got to go on any.",
   "created_utc": 1690823554,
   "score": 60,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8wh82",
   "message": "Currently in København,\n\nMost certainly the little mermaid statue . So many great beautiful sites like Neuhaven or Rosenborg but this in comparison is underwhelming. Its popularity certainly only comes from the fact that it’s in every travel guide or top list of sites.\n\nA beautiful Maritime Monument                                 (Søfartsmonumentet) is maybe 50 feet away standing 30 feet tall with its own plaza and I saw maybe 5 people there in comparison to 200 crowding around this tiny statue.",
   "created_utc": 1690833212,
   "score": 15,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8r161",
   "message": "The Liberty Bell. Jeez what a line for that thing.",
   "created_utc": 1690831188,
   "score": 30,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8hmlm",
   "message": "The Hollywood Walk of Fame. LA has a lot to offer in the tourism department, but that is not one of them.",
   "created_utc": 1690827713,
   "score": 8,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8r0jc",
   "message": "Times Square. Its the most depressing place in the city. I don’t understand why tourists go there",
   "created_utc": 1690831182,
   "score": 13,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8288s",
   "message": "Pier 39 San Francisco.",
   "created_utc": 1690822007,
   "score": 21,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju85e9q",
   "message": "A four-degree lean and  an unstable foundation,  The Tower of Pisa",
   "created_utc": 1690823178,
   "score": 24,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju89wlq",
   "message": "Cancún, México. Some beaches are Beautiful and resorts are fancy but you can find cheaper alternatives with less crowded and polluted beaches in the Yucatan peninsula.",
   "created_utc": 1690824843,
   "score": 36,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju88mqi",
   "message": "India as a whole. Yes there’s some beautiful places there but there’s just so many people there at the exact same time as you it’s hard to even get a look at the destinations",
   "created_utc": 1690824376,
   "score": 41,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju88f1y",
   "message": "Alamo, it's so tiny, but the Ripley's across the street goes hard",
   "created_utc": 1690824298,
   "score": 19,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7gmic",
   "message": "[deleted]",
   "created_utc": 1690813736,
   "score": 6,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8yksi",
   "message": "Loch Ness. It's just a lake. Plenty of other places in Scotland way more worth your time. That includes more beautiful lochs, Loch Lomond is way prettier.",
   "created_utc": 1690833988,
   "score": 5,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7ke45",
   "message": "The Kasbar.\n\nBelieve it or not, we were taken there as part of a high school European trip. We were repeatedly warned about being kidnapped into white slavery and 2 attempts were made.  We were constantly harassed by beggars. 4 of the students were robbed. It's so crowded you can't get into the shops anyway.",
   "created_utc": 1690815224,
   "score": 14,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8hr5f",
   "message": "Fisherman's Wharf in San Francisco.\n\nBecause it's the complete opposite of what San Francisco is about.",
   "created_utc": 1690827759,
   "score": 17,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju89jdb",
   "message": "Spanish Steps in Rome",
   "created_utc": 1690824708,
   "score": 9,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7nzb2",
   "message": "Florida",
   "created_utc": 1690816604,
   "score": 50,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8xl69",
   "message": "Lisbon: did you visit 10 years ago and thought it was an amazing city? Don't taint your lovely memories by going there again. \n\nIt is a tourist infested city, full of tourist traps, scammy taxi drivers, digital nomads, fake influencers, tuk-tuks, traffic jams, and fake *authentic* experiences.",
   "created_utc": 1690833623,
   "score": 4,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8sq9a",
   "message": "This might be a hot take, but honestly? Athens, Greece.\n\nWent to Greece this summer, expecting to live out the Percy Jackson life. I never looked into Greek works in Athens, I just kind of knew about it from classes and shows growing up. I climb up to the Parthenon, and it’s just kind of…there? It’s a ton of columns that are cool for about 3 minutes. What really sucks is that you can’t go into it (for obvious safety reasons that I now know). At least Nashville, Tennessee has a full scale replica. \n\nBut whatever, I see it and I’m like, okay! That was cool, the view of Athens was nice, let’s see the Temple of Zeus! I make the walk and see it’s…three columns, one of which was fallen..\n\nOverall, I’m glad I went, and I think it’s cool to see once, but it is DEFINITELY underwhelming. The history over exceeds the actual structure. \n\nThe Olympic Stadium was very cool though, highly recommend that.",
   "created_utc": 1690831821,
   "score": 11,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7gr7f",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7tjq4",
   "message": "Paris, they have therapy for the shock that occurs when people are disappointed with the reality. it's just a city.\n\n\n\nAlso, Salem Massachusetts on Halloween. I lived there, and holy hell, it's horrible. The town was not designed to have over a million people in it. If you want to have a good time, go the week before or any time in late September or early October, Halloween everday for a months. It's the most pleasant time on the East Coast weather wise, too.",
   "created_utc": 1690818742,
   "score": 40,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8n1ee",
   "message": "As a travel agent, there are so many I could list off. NYC, Chicago, Hollywood, Vegas, etc. Lots of United States locations because honestly there are so many more beautiful and exotic places to go. However, it all depends on your interests. I have a friend who loves her trips to NYC because she loves theater and musicals and street life and would really truly hate being somewhere hot and going to all the beaches and such out of the country. I booked travel for a woman who went to Las Vegas and despite having been all over the world already- it was her favorite travel place because of the \"exotic night life\". It's all dependent on the person and your interests!",
   "created_utc": 1690829705,
   "score": 5,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju7gp8n",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8mgb8",
   "message": "The airport, i don't know what all the fuss is about.",
   "created_utc": 1690829491,
   "score": 4,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8u8n3",
   "message": "Las vegas. I used to live in Vegas and it's only fun when you have money, it is a big place and there are places for you to go that don't require money but it isn't fun. Plus, there are pretty much homeless people everywhere, and I mean everywhere, I wouldn't say it's bad as Los Angeles but it's pretty bad",
   "created_utc": 1690832387,
   "score": 7,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju95omp",
   "message": "The Book of Kells. You pay an arm and a leg, wait in line for hours, then they rush you through a darkened room where you get the briefest glimpse of the book, then out into the gift shop. Go to the National Museum instead.",
   "created_utc": 1690836591,
   "score": 5,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju8tazy",
   "message": "Florida in the summer.",
   "created_utc": 1690832037,
   "score": 7,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju9hdws",
   "message": "Plymouth Rock.",
   "created_utc": 1690841076,
   "score": 3,
   "submission_id": "15ehppc"
  },
  {
   "comment_id": "ju90qiy",
   "message": "The number of tourists that go to cities to try and experience the UK is horrifying, litterally had someone say that the UK was boring, and when I asked where they'd gone, they said London and Birmingham, nowhere else, just there. \nIf you really want to experience the UK, I'd recommend going to more than one city and get out into the country.",
   "created_utc": 1690834778,
   "score": 4,
   "submission_id": "15ehppc"
  }
 ]
}