{
 "submission_id": "15eiqzw",
 "title": "What was something in life you had to learn the hard way?",
 "selftext": "",
 "created_utc": 1690816020,
 "permalink": "/r/AskReddit/comments/15eiqzw/what_was_something_in_life_you_had_to_learn_the/",
 "score": 120,
 "url": "https://www.reddit.com/r/AskReddit/comments/15eiqzw/what_was_something_in_life_you_had_to_learn_the/",
 "comments": [
  {
   "comment_id": "ju7q7fm",
   "message": "Not everyone is a good person. It's super hard to wrap my head around but some people will totally just knowingly and intentionally do the wrong thing, lie, victimize other people, etc.",
   "created_utc": 1690817459,
   "score": 25,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7qpz1",
   "message": "If they're into you, they'll make the time to show you that they're into you.\n\nSpent way too long being interested in people who showed me time \u0026amp; time again that while they were on my A list, I was on their C or D list.",
   "created_utc": 1690817657,
   "score": 123,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7prm7",
   "message": "The world owes you nothing. \n\nTo expand on this, I grew up expecting a certain level of fairness, respect and kindness from others. \nWhile I still believe these qualities are fair to expect from others, I learnt to be grateful for when they appear, instead of disappointed when they weren't.",
   "created_utc": 1690817289,
   "score": 136,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7r9fk",
   "message": "Everyone dies, and the world keeps turning regardless of that fact. I learnt far too young that you should never miss an opportunity to tell your friends how much they mean to you, because one day you could wake up to them gone forever",
   "created_utc": 1690817866,
   "score": 51,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7x9pl",
   "message": "The best investment you ever make is the one in yourself. Not just financially, but what you put your energy, time and/or care into.\n\nThe job that’s running you into the ground is just a job. If you are run over by a bus tomorrow, an ad to fill your position will likely be up by the end of the week (if not the end of the day). No job is worth your mental health. \n\nYour relationship might not be forever. They might wake up tomorrow and decide they don’t love you anymore. Love, but love yourself most.\n\nTake a day to recharge every once in awhile, especially if your body is telling you it needs it. If you don’t, you run the risk of it failing you at the worst possible time.\n\nDoing “your best” isn’t always giving 100%. Sometimes it is more, sometimes it is less. It’s okay for it to be less sometimes.\n\nTake the time for self-care. Not just the bath bombs and candles and spa days, but doing the thing you’ve been dreading so that your lingering anxiety dissipates, or going to the doctor for that check-up you’ve been putting off, or forcing yourself to get out of bed and take a shower for the first time in days. Take the time to do some LinkedIn Learning, or hug your pet, or clean your bathroom. Go to therapy. If it will bring your stress down and make your tomorrow easier while not overwhelming you today, do it.\n\nLife is hard. Being a person is hard. Never lose touch with yourself and what you need. Be proud of what you can do in a day, even if it’s not as much as you think you should be doing. You made it, and sometimes those little victories matter most.",
   "created_utc": 1690820145,
   "score": 49,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju816sq",
   "message": "The only way to keep something secret is to never speak it aloud or write it down.\n\nEveryone you trust has a breaking point and circumstances under which they will relay the information.\n\nIf it matters to you that it never be told: never tell.",
   "created_utc": 1690821618,
   "score": 47,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7ojgd",
   "message": "That my parents aren't, and never were, idiots.",
   "created_utc": 1690816808,
   "score": 36,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju80hed",
   "message": "Reciprocal relationships. You can’t make someone treat you well by treating them well.",
   "created_utc": 1690821355,
   "score": 39,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7qlok",
   "message": "Don’t cheap out on furniture.",
   "created_utc": 1690817612,
   "score": 29,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7qklv",
   "message": "Don't fix people. Don't even try, it's not worth it",
   "created_utc": 1690817600,
   "score": 52,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7tfle",
   "message": "the answers are ***not*** at the bottom of a bottle, the problems are.\n\n\n\n6 years sober",
   "created_utc": 1690818698,
   "score": 23,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7s8ej",
   "message": "Nothing is ever \"on sale\" if you're racking up credit card debt.\n\nI went into debt, I got out of it. Never again.\n\nI have friends who keep getting themselves out of debt only to spiral again. I can't imagine having to deal with predatory interest rates and falling victim again.",
   "created_utc": 1690818241,
   "score": 18,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju811t9",
   "message": "We don't have infinite energy. One day you just can't overdo anymore. We need to respect our own rythm and learn to say no.",
   "created_utc": 1690821565,
   "score": 17,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju839xj",
   "message": "If you wait too long to hit on the person you like, somebody else will.",
   "created_utc": 1690822391,
   "score": 16,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju80tyc",
   "message": "Hot is fun to play with but can make for an absolutely miserable partner, especially if combo w mental health and addiction",
   "created_utc": 1690821484,
   "score": 16,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju84jnq",
   "message": "Cost of opportunity. If I buy some crap, I won't be able to afford nicer crap that I'll eventually need.\nKnowing this prevented me from making impulsive purchases.",
   "created_utc": 1690822860,
   "score": 14,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8lzm3",
   "message": "When it comes to career advancement, there is a game being played with clear rules. If you choose not to play it, you will not advance. It's more than being good at your job, and you need to advocate for your own advancement.",
   "created_utc": 1690829322,
   "score": 13,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju82pkn",
   "message": "No one really cares",
   "created_utc": 1690822185,
   "score": 12,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7tbiv",
   "message": "When your parents/grandparents get old, it's not always they are there one day and dead the next, or sharp as a tack and then they are doddering idiots. \n\nSometimes (and I think it's much more common these days), they are dying in slow motion over many, many years. \n\nAnd everyone experiences some \"cognitive decline\" as they age. Just because they know who the president is and who you are, and maybe can still pay their bills and even do their taxes, they lose the ability to make sensible decisions.\n\nWhen they make bad decisions, it doesn't just blow up all over their lives, it blows up over the entire family. There is often not one thing you can do about it but sit back and watch in apprehension.",
   "created_utc": 1690818656,
   "score": 19,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7wi42",
   "message": "1. If they don’t want help, then you CAN’T help. \n\n2. Real life violence is scary as fuck. Learn to fight.",
   "created_utc": 1690819858,
   "score": 24,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7twjl",
   "message": "Those half priced work boots at walmart will only last a year. Those full priced work boots from Cavenders Boot City lasted me 10.",
   "created_utc": 1690818875,
   "score": 7,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7qcpg",
   "message": "I couldn't breeze through college the way I did high school",
   "created_utc": 1690817516,
   "score": 12,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7sk6r",
   "message": "You don't matter.\n\nYou live life as your own main character but don't realize that most people do not really care how you feel, what you think, or what you do.\n\nBut do your best to find those who do.",
   "created_utc": 1690818367,
   "score": 13,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7zg54",
   "message": "that theres people out there who will steal lie and just cheat every chance they get, not everyone is a good person, but its better to love everyone than to hate everyone",
   "created_utc": 1690820963,
   "score": 7,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju87euz",
   "message": "No matter how physically attracted you and another person are to each other, no matter how strong an emotional connection you have with them, and no matter how many things you have in common…..A relationship cannot work without healthy communication and conflict resolution skills. The person can possess all the traits you desire in partner, but it will never work without those things. It can be quite frustrating.",
   "created_utc": 1690823931,
   "score": 8,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7mq0q",
   "message": "Mentalhealth is important",
   "created_utc": 1690816137,
   "score": 13,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7vv47",
   "message": "Divorce can and will throw your life off for a spin",
   "created_utc": 1690819618,
   "score": 6,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju83erv",
   "message": "That you’ll initially wonder how you’ll ever go on with life when someone passes and then one day it’s been 5 years and you went on living.",
   "created_utc": 1690822440,
   "score": 5,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju884e5",
   "message": "Love isn’t always enough. You can be with someone, love each other more than you ever thought you could and want to spend your life together but sometimes that just isn’t enough. It sucks and hurts like a bitch but it’s true :(",
   "created_utc": 1690824190,
   "score": 6,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7q7ht",
   "message": "Opportunity cost. If I buy some shit then I can't afford better shit that I really need down the road. \n\nUnderstanding this stopped me from impulse buying.",
   "created_utc": 1690817459,
   "score": 7,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju85b4n",
   "message": "How to use a bidet. Was alone in a friend’s house who did not use toilet paper. Just a bidet. Pressed random buttons and ended up with a powerful stream right up my hole. Luckily no one was around to hear the sound that came out of me.",
   "created_utc": 1690823146,
   "score": 5,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8nw81",
   "message": "Way too trusting of people. Ignoring red flags even subtle ones at the beginning of dating someone. Had to get knocked down extremely hard to realize I’ve been settle for crumbs and I deserve so much more",
   "created_utc": 1690830022,
   "score": 4,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7q1cs",
   "message": "If you're unhappy, let go of everything, blank slate your life, and start over.",
   "created_utc": 1690817393,
   "score": 10,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7uvr7",
   "message": "Not to get emotionally invested in other people issues or fight their fights for them.",
   "created_utc": 1690819243,
   "score": 3,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7wz9w",
   "message": "That being educated is perhaps the most important thing in your life.",
   "created_utc": 1690820038,
   "score": 3,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7yvx2",
   "message": "Take the meds.",
   "created_utc": 1690820749,
   "score": 3,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju83bvp",
   "message": "everyone is not going to like you",
   "created_utc": 1690822411,
   "score": 4,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju89626",
   "message": "You attract what you're willing to accept.",
   "created_utc": 1690824572,
   "score": 4,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7t7gu",
   "message": "The hookers don't really think I'm sexy.",
   "created_utc": 1690818614,
   "score": 5,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7t74r",
   "message": "Don't do all the deals even if you're getting stuff for 90% off.",
   "created_utc": 1690818610,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7uud5",
   "message": "That life is a never-ending struggle. But what only matters is how you find ways to live with a conscience.",
   "created_utc": 1690819228,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7vem0",
   "message": "That someone can fall out of love with you, pretend they still love you for a week and a half, and then break up with you when you move into your new apartment alone",
   "created_utc": 1690819441,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7z4pw",
   "message": "Many people are needed in professional life but not in personal life",
   "created_utc": 1690820842,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8384g",
   "message": "That my mother is a Covert Narcissist",
   "created_utc": 1690822372,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju83d7p",
   "message": "To see if an iron is still hot, hold your hand an inch or two away from it.\n\n6-year-old me put my palm flat against it.",
   "created_utc": 1690822424,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju845lj",
   "message": "Credit card debt.   \nAt 18, never had a lick of financial education. Got my first credit card and I maxed it out. Luckily, it was only $300, but still.",
   "created_utc": 1690822715,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju877oy",
   "message": "Advocate for yourself when not one but several doctors reject your desire for a vasectomy as an adult without children.",
   "created_utc": 1690823857,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju87u33",
   "message": "Learn to like yourself for something. Albeit a hobby, weird quirk, looks, whatever. Not a single soul is obliged to like you and it can happen. Sometimes all you have is you.",
   "created_utc": 1690824084,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju884s0",
   "message": "Not everyone has good intentions for children",
   "created_utc": 1690824194,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju88g3j",
   "message": "* Put your own oxygen mask on before helping others. Applies in all aspects of life\n\n* If you see a public toilet, use it\n\n* Whether you like it or not, the boss is the boss",
   "created_utc": 1690824309,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju89593",
   "message": "People can fall out of love",
   "created_utc": 1690824564,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju89bhz",
   "message": "How to love myself and learn to accept my flaws. Also to learn to accept my mistakes and embrace the guilt",
   "created_utc": 1690824628,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju89fu4",
   "message": "It's your friends and family you never know where you truly stand with them. Your enemies on the other hand you can pretty much always bank on what side they are on.",
   "created_utc": 1690824671,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju89mzc",
   "message": "Dom was right: it's always good to have people you can  **always** depend on and who can depend on you.",
   "created_utc": 1690824745,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8a0xp",
   "message": "To always have a purpose with life, especially after accomplishing something",
   "created_utc": 1690824887,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8cf2r",
   "message": "Turns out, not everyone is born with a halo and angel wings! Who knew? 🤷‍♂️",
   "created_utc": 1690825763,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8dupr",
   "message": "Don’t lend people money.",
   "created_utc": 1690826293,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8hw0c",
   "message": "Two things;\n\n‘That I can only rely on myself’.\n\nand\n\n‘Give someone opportunity and they absolutely *will* take advantage’.",
   "created_utc": 1690827808,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8hzvr",
   "message": "Conditioner when having shower alone-time, NOT shampoo.",
   "created_utc": 1690827847,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8jp65",
   "message": "Pay attention to how people act vs what they say.",
   "created_utc": 1690828483,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8k11v",
   "message": "Don't trust the cops, they will absolutely lie to you.",
   "created_utc": 1690828604,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8kkfs",
   "message": "When pulled over, be respectful even if your in the right. It'll always be better to be nice.  Yup it took me years and many trips to the pokey ( when being polite would have gotten different results) before I learned",
   "created_utc": 1690828799,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8ko5a",
   "message": "Actions really do speak louder than words.",
   "created_utc": 1690828836,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8nyqo",
   "message": "Sleep with the door closed.",
   "created_utc": 1690830047,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8o760",
   "message": "That all the \"friends\" I had growing up and even into my 30s now were all pieces of shit in one way or another. That none of them were ever actually anything but \"Fairweather Friends\" or complete dickbags.  I have no patience for toxic people in my life now. Absolutely zero. At this stage, my only friends consist of my girlfriend, because she's my best friend in the world, my cat because he's fucking awesome, and my mother and stepfather.  I've even had to go as far as to cut out my older brother whom I idolized my entire childhood because I discovered that he doesn't give a shit about me after all.  It was hard to come to terms with at first but now, 6-7 months later, I feel much better about my decisions. Still not doing great, but I don't miss any of them at this point.",
   "created_utc": 1690830132,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8p629",
   "message": "You can be “The Bigger Person”, do everything right and still lose",
   "created_utc": 1690830491,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8pdyb",
   "message": "That not everyone is a nice person and not everyone has your best interest at heart",
   "created_utc": 1690830572,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8ptk3",
   "message": "That my life isn’t going to be the same as everyone else’s because of my mental disorders",
   "created_utc": 1690830731,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8rkg7",
   "message": "Parents are not forever. And besides they're just as vulnerable as you are and can get sick or (God forbid) be gone at any moment. For me realizing that marked the start of adulthood.",
   "created_utc": 1690831384,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8rkhd",
   "message": "Stop putting your full trust in someone. They WILL betray you. Maybe tomorrow, maybe in 20 years. But its going to happen.",
   "created_utc": 1690831384,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8wzn7",
   "message": "Don't talk during fights, it just gives the opponent enough time to know how to fuck you up",
   "created_utc": 1690833400,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju9fx5l",
   "message": "Some people are wastes of organs and only exist as a cautionary tale. They have no future, no marketable qualities, and should plant some trees to make up for all the air they waste.",
   "created_utc": 1690840491,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7mprj",
   "message": "Never disrespect my mum otherwise my dad will beat my ass",
   "created_utc": 1690816134,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju834e5",
   "message": "That you can get addicted to porn and mastubation",
   "created_utc": 1690822335,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8gc7i",
   "message": "An easy one: don't co-sign on a credit card with someone (who's not your child) no matter how well you know them\n\nI co-signed for my boss at the time because he had 0 credit.  He was supposed to use it to pay for gas once a month and pay it off immediately, just to build his credit a little.\n\nOver the course of 3 years he racked up $2,000.  He finally paid it down to about $25 and went to the bank to have me removed from the card and they told him he could do it at any time, I just had to be there.\n\nSo he went and spent another $1,500.  We go to remove me and they tell us it has to have a $0 balance to remove someone from it.\n\nNearly 15 years later, his mother dies, he gets an inheritance, and *finally* pays it off.  I removed myself from the account and it was finally over.",
   "created_utc": 1690827228,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7nbsk",
   "message": "Struggle is inevitable.",
   "created_utc": 1690816362,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju86nzf",
   "message": "Men only care about looks",
   "created_utc": 1690823652,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7mp2t",
   "message": "life solution",
   "created_utc": 1690816127,
   "score": 0,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7t4m3",
   "message": "I'm the second choice.",
   "created_utc": 1690818584,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7uroo",
   "message": "Alcohol has a mean streak.",
   "created_utc": 1690819201,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7v93t",
   "message": "wife and mother-in-law can never live in the same house",
   "created_utc": 1690819383,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju7xjg6",
   "message": "Not everyone is going to treat you fairly",
   "created_utc": 1690820246,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju806nb",
   "message": "How many hot wings I can eat before dumping brown magma into the toilet bowl",
   "created_utc": 1690821241,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju80jep",
   "message": "Fireworks do not detach from the stick when launched, so jamming them forcefully into the ground and lighting them is a bad idea. Spectacular. But bad.",
   "created_utc": 1690821376,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju81ewl",
   "message": "The only person who has your best interest at heart is you. Period.",
   "created_utc": 1690821702,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju81rqv",
   "message": "I’m not the only one struggling. It took antidepressants and years of therapy to realize that.",
   "created_utc": 1690821835,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju83b31",
   "message": "That I have to make changes myself. No one is going to come and do that for me.",
   "created_utc": 1690822403,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju83jd3",
   "message": "Be careful of the friends you pick as some want to help while others can harm you.",
   "created_utc": 1690822487,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju83mt6",
   "message": "That when people say \" i love you \" they dont mean it like your mother did",
   "created_utc": 1690822522,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju83ri3",
   "message": "Once the trust is broken in a relationship, it can’t be restored. You live with it or you end it.",
   "created_utc": 1690822570,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju84cjy",
   "message": "Better don't have friend at all or a few friends only because I have been abandoned by people that I thought are my best friend. Even I loan them money when I barely have money but in return they kept treated me sh*t",
   "created_utc": 1690822786,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju853wp",
   "message": "Don't commit crimes involving stealing form criminals who have no problem killing you",
   "created_utc": 1690823072,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju85a3j",
   "message": "Felatio.",
   "created_utc": 1690823135,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju862wa",
   "message": "Life itself",
   "created_utc": 1690823433,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju867qn",
   "message": "Not everyone has the best intentions.",
   "created_utc": 1690823484,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju86qiz",
   "message": "Never take anything for granted\n\nyou never know when you will lose someone",
   "created_utc": 1690823679,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju883p0",
   "message": "To not trust people",
   "created_utc": 1690824183,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju88431",
   "message": "Chinese food never keeps.",
   "created_utc": 1690824187,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8bss2",
   "message": "Lot of them are bad and plain greedy, the richer they are chances are they are bigger douchebags",
   "created_utc": 1690825535,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8cam0",
   "message": "Just because you overthink shit, it doesn't mean you're mentally prepared for what might happen.",
   "created_utc": 1690825718,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8eoxl",
   "message": "Heroin is bad for you",
   "created_utc": 1690826607,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8f5rd",
   "message": "Music is not a meritocracy. Chances are you don't know the best players.",
   "created_utc": 1690826784,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8ga4e",
   "message": "Being an adult. Both my parents died when I was young.",
   "created_utc": 1690827205,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8iz92",
   "message": "It hurts like hell to be dumped by someone you loved and cherished.",
   "created_utc": 1690828212,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8j1g7",
   "message": "Life mostly all of it the hard way.",
   "created_utc": 1690828235,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8k8j0",
   "message": "Never give ur whole trust to someone.",
   "created_utc": 1690828680,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8lw61",
   "message": "That my personal problems are not my works problems. I’m responsible for myself…",
   "created_utc": 1690829287,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8mtcp",
   "message": "Heroin is bad for you",
   "created_utc": 1690829622,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8n27i",
   "message": "That people will immediately screw you over if they realize you have no experience in whatever business you're trying to conduct with them. Basically there's no human decency when money shows up.",
   "created_utc": 1690829713,
   "score": 2,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8n6f3",
   "message": "Free always comes with a price.",
   "created_utc": 1690829757,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8p4vt",
   "message": "You can do everything right and still lose. Doesn't mean you are a failure, it's just life.",
   "created_utc": 1690830478,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8pj4j",
   "message": "languages",
   "created_utc": 1690830624,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8pot8",
   "message": "Moderation is key.",
   "created_utc": 1690830683,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8q6f6",
   "message": "That life isn't fair. You don't always get what you deserve.",
   "created_utc": 1690830865,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8qhhy",
   "message": "you can't force love",
   "created_utc": 1690830982,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8qw2y",
   "message": "Others usually want to help you if you work hard toward a goal",
   "created_utc": 1690831134,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8r8ns",
   "message": "There’s no prize for drinking the most alcohol",
   "created_utc": 1690831264,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8rafe",
   "message": "So many I wouldn't even know where to start.",
   "created_utc": 1690831282,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8rs2u",
   "message": "Words are meaningless,  actions are everything.  Apologies without changed behavior are empty.",
   "created_utc": 1690831463,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8rwn7",
   "message": "People suck.  Most are selfish and couldn't give a rats ass about you.",
   "created_utc": 1690831510,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8tlvb",
   "message": "alcohol is not for everyone!!!! 1.5 years sober n feelin groovy",
   "created_utc": 1690832152,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8txgo",
   "message": "Money comes and goes. Family is forever.",
   "created_utc": 1690832272,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8ua68",
   "message": "Appearances do matter. A lot.",
   "created_utc": 1690832402,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8v638",
   "message": "Not to trust a cheater again. Every betrayed partner that says \"they see now how painful this is for all of us, they won't do it again\" learns the hard way that they will in fact do it again.",
   "created_utc": 1690832729,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8vx4s",
   "message": "Sometimes the secret to dealing with an ex and a dysfunctional family is move far away",
   "created_utc": 1690833008,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8w4gh",
   "message": "Sometimes, your parents just aren’t that good of people. Learning that and having to learn how to do things in a way that makes you a good person without the guidance of your parents can be hard at a young age.",
   "created_utc": 1690833082,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8wtin",
   "message": "Blood doesn't make you family. And just because someone is related to you, doesn't mean you have to keep toxic people in your life",
   "created_utc": 1690833337,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8wz8e",
   "message": "I learned what's real political autonomy. My government often get described perfect, peace lover. But I questioned how can a nation mostly use emotions to decide rather that logic stay like that for so so so long. Chauvinist always say every country has corruption and greed but I've seen some people got bad endings after not giving \"they\" money",
   "created_utc": 1690833396,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8x89t",
   "message": "I had to teach myself how to be responsible man.",
   "created_utc": 1690833490,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8xkoh",
   "message": "Turns out, not everyone got the 'Be excellent to each other' memo.",
   "created_utc": 1690833618,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8xoef",
   "message": "Not to trust everyone who is \"friendly\"",
   "created_utc": 1690833655,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8xr4l",
   "message": "Not everyone is mature enough for a relationship to end, and most will try to ruin your life when it comes to the end. Thanks ex girlfriend!",
   "created_utc": 1690833684,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8xzth",
   "message": "That luck (or the lack thereof) is real, that timing is ultimately everything, and that we have a lot less control over anything than we think.\n\nThat very few people actually truly care about you and that finding people who you can 100% be yourself with is exceptionally rare. So if you find that, hold on because yes, some things are worth fighting for.\n\nThat by and large, humans want the same things and at our core, we are nowhere near as different from each other as we are led to believe.",
   "created_utc": 1690833774,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8y7l4",
   "message": "People don’t need a motive to spread rumors. Like? I don’t understand: y’all js woke up and decided to lie to little Becky for attention and now everybody has their own twisted version of your attempt to get attention??",
   "created_utc": 1690833852,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8z1o3",
   "message": "That parents are also humans with flaws.",
   "created_utc": 1690834160,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8zfkv",
   "message": "All those credit card tents on college campuses are predatory, and they are not worth the free BS that they tempt you with.",
   "created_utc": 1690834300,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8zhpu",
   "message": "luck is a real thing",
   "created_utc": 1690834322,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8zq1z",
   "message": "Everybody is self-preserving above all else, and in that self-preservation, a lot of people are malicious towards others. People having bad intentions towards you is less about you than it is about whatever they feel like you threaten within them.",
   "created_utc": 1690834407,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju8zqu9",
   "message": "Never live with friends.",
   "created_utc": 1690834415,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju90czm",
   "message": "You can be the most competent, informed, and capable person at a job, but you will find incompetent, layabouts who will get paid more than you while having no idea about what their profession actually is.",
   "created_utc": 1690834639,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju90q34",
   "message": "Flammable and inflammable mean the same thing",
   "created_utc": 1690834774,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju90wct",
   "message": "The importance of anticipation for precipitation. Setting aside an emergency fund is extremally important. When it rains it pours my friend.",
   "created_utc": 1690834836,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju91i5s",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju91iuh",
   "message": "You can't always count on your friends\n\nWhether it's fixing the leaks in your roof like you paid them to, or just when you're having a bad time, they're not always gonna be there for you. They have their own shit to deal with too. Or maybe they're just not as good at their job as you thought they would be, and that's why the house is still leaking",
   "created_utc": 1690835061,
   "score": 1,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju91zb3",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju9b116",
   "message": "You can't trust anyone... not even your wife...",
   "created_utc": 1690838595,
   "score": 3,
   "submission_id": "15eiqzw"
  },
  {
   "comment_id": "ju90wrk",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15eiqzw"
  }
 ]
}