{
 "submission_id": "15ewwfx",
 "title": "What's the most interesting revelation you've had about the opposite sex?",
 "selftext": "",
 "created_utc": 1690849339,
 "permalink": "/r/AskReddit/comments/15ewwfx/whats_the_most_interesting_revelation_youve_had/",
 "score": 106,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ewwfx/whats_the_most_interesting_revelation_youve_had/",
 "comments": [
  {
   "comment_id": "jua2qxi",
   "message": "Every guy I have asked says it's true, and I find it amazing and interesting. Apparently, men can actually sit and think about absolutely nothing. Like they can have a completely blank mind and space out on nothing for like 10 minutes or more. I wish I could do that. Even meditation and deep relaxation doesn't fully blank out my mind. How do guys do it?",
   "created_utc": 1690849937,
   "score": 198,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua439s",
   "message": "That sometimes a woman’s fart enters her vagina. I just learned it from Reddit. Blew my mind",
   "created_utc": 1690850520,
   "score": 69,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua61b6",
   "message": "I (51 yr old M) have heard for a long time from women (friends and strangers writing op-eds) about the notion that hetero men THINK they want to partner with a strong woman...but they don't, actually. Many men want a fantasy version of a strong woman, someone who is strong when it's convenient, but who is still available to be what a man needs/wants her to be when he needs and wants it. And honestly I think this dynamic is true in a lot of relationships I've observed (and, sadly, I've realized it's been true in some of my own, as I've learned and grown).\n\nHowever, there's a dynamic that goes the other way that I also think is common, and not much talked about. Hetero women THINK they want to partner with a man who can express his emotions and be vulnerable...but they don't, actually. Many women want a fantasy version of an expressive man, someone who expresses emotions and vulnerabilities that these women know how to handle, when it's convenient for them to be expressed. Many women are not really prepared for actual masculine vulnerability, which is often at odds with the fantasy of \"Strong, supportive male partner who always has a shoulder available for crying on.\" Actual masculine vulnerability is often about how burdensome and tiring it can be to BE that person. And many (not all, but many) hetero women find that threatening, in the same way that men are threatened by the actuality of feminine strength.\n\nI don't mean this in an accusatory way, but I think about it a lot--especially when I hear the growing sentiment these days (from op-eds and comedians and SNL skits) that men NEED MORE MALE FRIENDS. That may be true for some men--but I suspect these sentiments are also a byproduct of men actually trying to communicate with their partners in ways they thought they'd been encouraged to, only to find their partners resistant or even repulsed.\n\nTL;DR: gender roles are more powerful and restrictive than people suppose--even those who try to break out of them.\n\n(minor edits for clarity)\n\nLater: well, this blew up into a much bigger thing than I'd have ever guessed. Thanks for your comments, everyone. I'm leaving this as I wrote it, but I would stress that I don't mean ALL women and ALL men are like this, or that ALL relationships are subject to these dynamics. I do think a lot of hetero American relationships are, and probably more than we realize, even when we're trying to be good and open and loving with one another. That's the TL;DR I should have gone with.",
   "created_utc": 1690851366,
   "score": 41,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua7eak",
   "message": "It was decades ago, but until I lived with a woman I had no clue how expensive bras were. I honestly thought they were like underpants -- maybe $10 for a three-pack.",
   "created_utc": 1690851967,
   "score": 13,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua2320",
   "message": "They can withstand you lying on top of them",
   "created_utc": 1690849648,
   "score": 129,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua6eeg",
   "message": "I believe it was learning that girls/women actually desire sex just like guys.\n\nFor some reason while growing up many guys are under the impression, they have to try to figure out how to get women to have sex. Women get horny and masturbate too!",
   "created_utc": 1690851527,
   "score": 233,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua8sce",
   "message": "I honestly cannot answer this question because for every man I think my thought about is true, there is another one for who it’s wrong. \n\nSame holds true for women. \n\nHumans are far too complex to make revelations about a whole gender as if they are a distinct, unicellular species.",
   "created_utc": 1690852589,
   "score": 243,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua7tzk",
   "message": "I think I was a teenager when I realized that my assumption - 95% percent of women think they're beautiful - was actually the inverse of reality. I have no idea why I thought that was the case, but I did. When I started understanding people's insecurities about their appearance, men included, it changed the way I interacted with them.",
   "created_utc": 1690852160,
   "score": 132,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua1uxu",
   "message": "That at the end of the day, we’re all just human, having a human experience.",
   "created_utc": 1690849550,
   "score": 153,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua3zzb",
   "message": "that they care a lot more about the seemingly inane details or little gestures than I do. Fellas, just get her flowers and go to the restaurant she wants to go to, i promise she cares more than you do",
   "created_utc": 1690850480,
   "score": 5,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaeqrf",
   "message": "Vaginas are farther down than I expected.",
   "created_utc": 1690855279,
   "score": 104,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua3ntj",
   "message": "That they think about and want sex just as much as you do.",
   "created_utc": 1690850334,
   "score": 87,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juah8m5",
   "message": "Women just want lunch and dresses with pockets",
   "created_utc": 1690856428,
   "score": 10,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua1z68",
   "message": "That I’m not attracted to them.",
   "created_utc": 1690849600,
   "score": 40,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua59fw",
   "message": "How shitty and dumb people behave around men and kids.\n\nMen actually think twice or even more before waving at a kid - God forbid helping a crying child. Because other men, and women, will see them with the crying child, short circuit and attack. Verbally or physically.\n\nAnd that doesn't even touch the whole \"He likes to be around kids, must be a pedophile\" issue...",
   "created_utc": 1690851030,
   "score": 152,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua8drj",
   "message": "That men are nothing like I was told they were by feminist teachers and most female influences in my life. That they are straight forward WHEN they speak about something they're going through or something they need. And that most of society does not give a single solitary fuck about them or their well being.",
   "created_utc": 1690852407,
   "score": 117,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juae7vm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juag6f4",
   "message": "Women are messier than men.",
   "created_utc": 1690855937,
   "score": 39,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juabe6e",
   "message": "Ehhh, I would argue that the only real 'revelations' are things about male anatomy - in terms of emotions and needs and most other things, many people grossly exaggerate how different we are - because actually asking my guy friends about that sort of thing has never been something I'm comfortable with, and obviously sex education is a joke, so I just sort of... find out new things now and then and go 'wait really?' \n\nA recent one (ngl I'm still not sure if this guy was trolling or not because I haven't tried to verify it) was that apparently uncircumcised dudes need to maintain/stretch their foreskins during puberty for them to be properly functional during sex. Even if it's not true, the revelation is that *jfc I don't know anything about dicks.*",
   "created_utc": 1690853764,
   "score": 12,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juabky8",
   "message": "That men and women have hairy ass and butthole",
   "created_utc": 1690853848,
   "score": 78,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaflby",
   "message": "That women are not vending machines you can put Kindness Coins into and expect Sex to come out.  I narrowly avoided the incel/redpill trap.",
   "created_utc": 1690855667,
   "score": 157,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaggxw",
   "message": "Men are just as emotional as women, if not more.",
   "created_utc": 1690856073,
   "score": 203,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juagntq",
   "message": "If you think that having sex with a guy you’re interested in/talking to will be the make or break whether they stick around… it’s not worth it. It took me about 16 years to realize this",
   "created_utc": 1690856162,
   "score": 89,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juagis5",
   "message": "After watching my wife give birth this week I realized she's way way way tougher than I am.",
   "created_utc": 1690856097,
   "score": 172,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juahk6p",
   "message": "Chicks are waaay dirtier than dudes.",
   "created_utc": 1690856575,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juafqjg",
   "message": "Don't try to understand women. Women understand women, and they all hate eachother.",
   "created_utc": 1690855734,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua22x1",
   "message": "They either put to much cologne on or not enough there's rarely a in between",
   "created_utc": 1690849647,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juafr58",
   "message": "I truly thought the hoodies were mine….",
   "created_utc": 1690855741,
   "score": 83,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juagme8",
   "message": "Their pants don’t have a waist size and leg length. Just an arbitrary number. The fuck is a size 3?",
   "created_utc": 1690856144,
   "score": 120,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaeb4r",
   "message": "How many women I have noticed if their toes are inward or not. Quite a lot more than I thought. Also \"Women can't drive\" was a joke I started with my sister but was surprised how true it was. I started to even call what gender the driver's was just by observing their driving. \n\nAccuracy: 90%\n\nScientific Conclusion: Women drive dumb, Men drive aggressive. Only applicable at the extremes. Older men tend to have less driving skills overall. Old ladies drive slow.\n\nSource: Trust me bro! But on the real a lot of experience.",
   "created_utc": 1690855085,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juad9ud",
   "message": "It is crazy how many women do not view or respect men as human beings. Goes the same the other way I suppose",
   "created_utc": 1690854614,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jua2836",
   "message": "that all of them wear make up because they're insecure about their looks",
   "created_utc": 1690849710,
   "score": 242,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaf473",
   "message": "Most people are stupid and promiscuous. Your wife probably will be too...",
   "created_utc": 1690855450,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juafmmi",
   "message": "Most “men” are spineless bullies",
   "created_utc": 1690855683,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juabii5",
   "message": "i always found it hard to trust something the bleeds once a month and dose not die  :)",
   "created_utc": 1690853817,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juadvti",
   "message": "In early high school, I learned that female has 3 holes for each purpose of poop, birth and pee. That fact blew my mind since I was kind of a smart boy at least that what I thought  myself to be back then, I had never seen woman's part then so I just thought that there were only 2 holes like male so birth and pee are the same one and an anus because all mammals have 4 limps because of common ancestor there for you can't have another bodypart from nowhere even the hole on whale's head is its nose merged and moved up, not a new one.",
   "created_utc": 1690854893,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaelpt",
   "message": "Most the time if I get up for school and it's cold in my room when I'm getting ready and I'm till really tired I will space out really easily and think about nothing, it also happens when im user bored and tired",
   "created_utc": 1690855216,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juagbyv",
   "message": "That they are not impossible to figure out. Just requires a different perspective and understanding how they process things differently.",
   "created_utc": 1690856010,
   "score": 142,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juagnrl",
   "message": "That all women even Amanda Peet thinks that D and D ruined the fuck out of the show Game of Thrones.\n\nThis also applies to all men including Amanda Peet's husband and his talentless buddy.",
   "created_utc": 1690856161,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juagvo4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juahbmg",
   "message": "Borderline personality disorder.",
   "created_utc": 1690856466,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juahoz7",
   "message": "Took me a couple years of marriage to realize, but for women crossing 2-3 things off their to do list = foreplay.",
   "created_utc": 1690856637,
   "score": 133,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juahzaz",
   "message": "When I was a kid, a BIG revelation for me was that women also pooped.",
   "created_utc": 1690856772,
   "score": 11,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juai7ft",
   "message": "That they don’t care much about our flaws like we think",
   "created_utc": 1690856880,
   "score": 194,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaib6b",
   "message": "Aparently women just want to vent and don't want you to fix their problems. Just listen to them and tell them you understand how it is frustrating.",
   "created_utc": 1690856930,
   "score": 140,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaie0n",
   "message": "[deleted]",
   "created_utc": 1690856966,
   "score": 11,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaiosq",
   "message": "Women like to have a plan/schedule, and like to stick to the plan/schedule. As an extension of this, they expect men to \"keep their word\" about things they are going to do. \n\nThis can cause friction. Men will say things like \"We should go see a movie this weekend\". Women will - justifiably, but mistakenly - take this to mean \"We are going to see a movie this weekend\".  But men don't think that way. They're just \\*suggesting\\* things that might happen, or might be a good idea. The plan may change. A better activity might present itself. Or, they might decide they just aren't up for a movie when the weekend comes.\n\nWomen \\*hate\\* when the plan changes. HATE IT.  As a man, if you say you are going to do something, women expect it to be done in the near future. And if you give an actual DATE or TIME? You better execute on schedule.\n\n I don't know any men that are serious \"planners\". Hell, most of them aren't even planners \\*at work\\*. But women...they have calendars and reminders, and the plan WILL BE EXECUTED, even if it's a pain-in-the-ass, and even if they don't really want to follow the plan anymore. Plans are sacred.\n\nI'm not sure why men hate plans and women love them. But it seems to hold true for almost everyone I know.  Not that men can't make plans, and that women aren't up for some improvisation. But it's not their natural state.",
   "created_utc": 1690857107,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaisyw",
   "message": "Women aren't as complex as you think. The majority just want confidence, the ability to make decisions and pockets... lots and lots of pockets.",
   "created_utc": 1690857162,
   "score": 71,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaivpu",
   "message": "Women want the opposite of what they say they want.",
   "created_utc": 1690857199,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaj35x",
   "message": "Lies.",
   "created_utc": 1690857299,
   "score": 1,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juan6mo",
   "message": "Women really want to be found interesting, by someone who isn’t trying to sell them something or get them into bed in the next few hours.",
   "created_utc": 1690859302,
   "score": 145,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juajpm0",
   "message": "After being raised with the idea that all women wanted to work full time and be independent, I was startled by the huge number of even young self proclaimed feminists who craved being a stay at home girlfriend or wife. Seems what women really want is to be able to choose that lifestyle as opposed to being forced into it.\n\nOn a sexual note, the large percentage of women who have CNC fantasies also caught me by surprise. Again, as long as they can choose who to have it with.",
   "created_utc": 1690857597,
   "score": 248,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaj7kh",
   "message": "Women can talk about their problems for hours with no intention of looking for a solution. They just want you to listen, not fix it.",
   "created_utc": 1690857357,
   "score": 221,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juakqxx",
   "message": "Shirt buttons are on the other side? But, why?",
   "created_utc": 1690858098,
   "score": 69,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juakv2g",
   "message": "Sometimes, women just wanna nut \u0026amp; go too 😂",
   "created_utc": 1690858155,
   "score": 248,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juao6kc",
   "message": "That men \u0026amp; women are way more similar that we are lead to believe. Men can have just as much anxiety and insecurities as women. They just express them differently.",
   "created_utc": 1690859816,
   "score": 12,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juajknk",
   "message": "I recently learned that there is apparently a large subsection of women that do not know you CAN NOT flush tampons. I really thought this was common knowledge, as I have seen the signs in every unisex bathroom I have been in that say “Do Not Flush Hygiene Products”. \nIt seems to me that even if no one told you not to do this, the regular plumbing issues you must encounter would correct the problem on its own. Seems wild to me.",
   "created_utc": 1690857530,
   "score": 193,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juajh8w",
   "message": "She hates shaving",
   "created_utc": 1690857484,
   "score": 78,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juapc1v",
   "message": "The amount of hair they shed is astounding",
   "created_utc": 1690860416,
   "score": 200,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaon4d",
   "message": "I learnt on Reddit that they don't stick those pad things to themselves 🤯 They stick it to their underwear. I guess it's obvious in hindsight",
   "created_utc": 1690860056,
   "score": 19,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juakth6",
   "message": "A large majority of women are really mean to other women.  Especially 40 year old women to 20 something year old women. The jealousy runs deep",
   "created_utc": 1690858133,
   "score": 14,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaju2i",
   "message": "Boobs feel like water balloons. I never would have known if my one camp friend hadn't grabbed my hands to show me.( She had huge DDD boobs on a 5''1\"ish frame and couldn't wait to be old enough for reduction surgery.)",
   "created_utc": 1690857657,
   "score": 13,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juamz53",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juapcmv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jualxob",
   "message": "That women don't need any kind of actually stimulation in order to masturbate. I've asked a lot of my friends and some of them claim that they're not even thinking about anything remotely erotic when they're rubbing one out.",
   "created_utc": 1690858682,
   "score": 11,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juakzrs",
   "message": "That too much attention can scare men off. I was always told that “men don’t get enough compliments” and that “men are DYING for positive reinforcement!” But it really blew up on my face when I connected with a guy who couldn’t take all the positivity. It taught me that men don’t always want from me what I want from them.",
   "created_utc": 1690858219,
   "score": 23,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jual0fo",
   "message": "No matter how much love an attention and time you give someone, they can and do sometimes choose to cheat on you.",
   "created_utc": 1690858228,
   "score": 136,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jualau3",
   "message": "Seeing the societal pressures women go thru around pregnancy, childbirth, infants, and children. An expectation of perfection in a sea of conflicting guidance.",
   "created_utc": 1690858368,
   "score": 58,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juajtwa",
   "message": "Girls get mad at guys for not lowering the toilet seat not because they fell it looks better, equality or anything like that but because they they use it at night they don't turn on the light and have a tendency to fall in.\n\nI kid you not!",
   "created_utc": 1690857654,
   "score": 8,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juamr9c",
   "message": "That extremely hot females find perceivably mid-looking guys also extremely hot.\n\nSource: I feel that my girlfriend is out of my league but she, her family and friends all disagree.\n\nIt makes no sense. When I first saw her, I immediately thought, “She’s the mean girl.”\n\nWrong. Very wrong. And takes care of me. Was also very wrong about thinking otherwise on that front.\n\nedit - To hell with you, Western media. You’ve corrupted my mind and I take no accountability for it.",
   "created_utc": 1690859091,
   "score": 16,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juatcs3",
   "message": "That guys don't talk about their sex life with each other. I grew up watching all these movies where guys were in locker rooms describing their sexual encounters. So I thought all guys did this. I was surprised to find out that they hardly ever do this, and a lot don't want you discussing it at all with anyone.",
   "created_utc": 1690862602,
   "score": 196,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaouey",
   "message": "As a dude I grew my hair really long and the amount of hair I had to pull outta my butt while showering was shocking. Crazy that all the long haired ladies had been pulling hair out their butts most their lives.",
   "created_utc": 1690860160,
   "score": 222,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jual2yw",
   "message": "They don't all despise me, I just grew up with a lot of fuckers.",
   "created_utc": 1690858263,
   "score": 235,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juatn1j",
   "message": "My contribution is that women \"out of your league\" may not be looking for some Andrew Tate Alpha Male who drinks Bull Piss™️ and gets into fights. She may actually have a crush on you and be just as shy to approach as you are. \n\nImagine my shock when I was on a manic high and spoke to a women I knew would never associate with my ass and she was the exact type of person I was looking for and I happened to be the EXACT type she was looking for! Next month will be 12 years of marriage",
   "created_utc": 1690862761,
   "score": 133,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juatplu",
   "message": "Ladies, message him \"I'm proud of you\" no clue why it does what it does to a guy, but they love that shit.",
   "created_utc": 1690862800,
   "score": 132,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juausui",
   "message": "If you treat them right they will take care of you when you’re disgusting. I can’t get off the pot right now and we’re a little scared we might have to call an ambulance. She brought me a small glass of wine, a water bottle, and some crackers. She sitting by the door… that’s love.",
   "created_utc": 1690863419,
   "score": 213,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juamrjx",
   "message": "Long winded, bear with me. When I lived with male roommates and would clean the bathroom; yeah everything was always covered in a thin sheer of beard hair which like whatever, price of admission of living with men. But the dust and hair around the base of the toilet was always immune to a broom so I would have to get down and scrub, which again nbd you should be scrubbing your bathroom anyways.\nBut then I moved in with my girlfriend, and just my girlfriend. I took my first bath, and my cat walked near the base of the toilet and I was like buddy no I haven’t mopped down there yet! And I looked. And it was a little dusty but it didn’t have that sticky gross dust. And I realized. It’s piss splatter. The dust is sticky and caked to the floor because of piss splatter. I felt so stupid for not realizing until that moment and also so grossed out for every time I personally scrubbed my roommates’ piss off the floor.",
   "created_utc": 1690859095,
   "score": 214,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juas856",
   "message": "I was once at a party, chatting with friends, when another man who is much larger and stronger than me did that flirting move where you put your hand on someone else's arm. Later in the party, I was alone in the kitchen when the same guy walked in, and he tried to be flirty with me. All I could really think was, jeez, this guy is way bigger than me and I hope this conversation doesn't head south.\n\nA few days later I realized: oh, that's how women feel when men they aren't interested in try to flirt with them.",
   "created_utc": 1690861966,
   "score": 59,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juap3dk",
   "message": "That nothing stands the test of time in a relationship more than kindness. It can’t be faked long term. It’s literally the most important quality in a mate.",
   "created_utc": 1690860290,
   "score": 129,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juapbdx",
   "message": "That there actually are women for whom the awkward, short, skinny, shy dude who gets nervous around them is their exact type. More than you’d think. You just have to be willing to earnestly look for them and not fall into toxic ideas.",
   "created_utc": 1690860406,
   "score": 204,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juapkfz",
   "message": "Nuts move all on their own.  Like the skin flexes and shifts and like crawls up and down twitching.  I read it on reddit, called bullshit and went and inspected the spouse, was very very surprised.   I learned it in the last few years, I'm not a young person...",
   "created_utc": 1690860540,
   "score": 136,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juas0kr",
   "message": "I am a man, but something I realized until recently is that we all have some kind of anxiety when we are alone on the street and a woman approaches or is in front of you, the nerves of not looking like a pervert or a creep are high.",
   "created_utc": 1690861851,
   "score": 35,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaoi9r",
   "message": "Somewhere around 16 or 17 I found out that the girls were just as horny as we were. My first GF was more aggressive than I let myself be, I figured I'd better behave or I'd run them off. While we were making out she asked \"don't you want to touch me?\"\n\nI didn't want to be a rapist, but I was safe to step my game up a few notches. Damn Catholic guilt. Can you believe girls masturbated too? Shock!",
   "created_utc": 1690859986,
   "score": 170,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaupwo",
   "message": "It's all fun and games until you put her favorite bra in the dryer, even accidentally.",
   "created_utc": 1690863371,
   "score": 221,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juarbbs",
   "message": "They are still attracted to women after they have children, get older, etc etc. I spent all my teens and twenties completely nervous that I was not attractive  enough and completely insecure after I had kids only to find out men don't care about stretch marks, gray hair, or a little bit of a soft tummy. Men dig confident and happy women. The stuff we are insecure about does not stop them from thinking we are sexy. Such a revelation. 😅",
   "created_utc": 1690861467,
   "score": 17,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jub44yu",
   "message": "Men really do sit there and think about the most random things. You think they’re mad at you, but they’re seriously just contemplating what would happen if oxygen just suddenly disappeared for a brief moment.",
   "created_utc": 1690869391,
   "score": 140,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juayxas",
   "message": "Men don't care about the size of boobs half as much as I (F) thought they do.",
   "created_utc": 1690865908,
   "score": 78,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaunes",
   "message": "Girls are actually just normal people. I have nothing to be afraid of. 💪🏼🥲",
   "created_utc": 1690863333,
   "score": 159,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juauwbv",
   "message": "Not all women are looking for a prince, just a nice person.",
   "created_utc": 1690863475,
   "score": 70,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juaq7iw",
   "message": "If you listen to a woman without giving advice, she will listen to you",
   "created_utc": 1690860877,
   "score": 73,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jub7p4m",
   "message": "I was 16/17 when I found out periods happen over time, not an instant gush of blood that comes out at some random point over a one week time period. \n\nI blame adverts for panty liners where they poured all the blue liquid out at once.",
   "created_utc": 1690872026,
   "score": 170,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juayf7v",
   "message": "How wet she is can be totally unrelated to how horny she is.",
   "created_utc": 1690865588,
   "score": 69,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jub1mtc",
   "message": "They may get fascinated by a piece of cheese",
   "created_utc": 1690867683,
   "score": 93,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "jub1pa1",
   "message": "most guys cannot stop once they started peeing bc it's either very uncomfortable or even hurts . blows my mind to this day^^",
   "created_utc": 1690867729,
   "score": 48,
   "submission_id": "15ewwfx"
  },
  {
   "comment_id": "juauyit",
   "message": "They can be just as horny as guys",
   "created_utc": 1690863509,
   "score": 33,
   "submission_id": "15ewwfx"
  }
 ]
}