{
 "submission_id": "15ezvyd",
 "title": "What are some sex facts that not a lot of people know but should?",
 "selftext": "",
 "created_utc": 1690857535,
 "permalink": "/r/AskReddit/comments/15ezvyd/what_are_some_sex_facts_that_not_a_lot_of_people/",
 "score": 71,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ezvyd/what_are_some_sex_facts_that_not_a_lot_of_people/",
 "comments": [
  {
   "comment_id": "juatbnb",
   "message": "dont expect to have a good time if you dont communicate. seriously. and its not that hard if you're with a partner who you love and who loves you back. you should be communicating anyways.\n\nedit: i wrote this about both/all parties that are \"getting in the mood\",, just because one person finished off strong doesn't mean it was a good time for the other(s). also, body movement and energy is a type of communication IMO, but not everyone is going to take the hint (kudos to you if you and your partner(s) have a banger of a time just following the energy, especially on the first time.. pun intended)",
   "created_utc": 1690862584,
   "score": 193,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juaoj83",
   "message": "Doctor here. If you experience an erection for more than 4 hours, your penile tissue is at risk of damage from lack of oxygen due to lack of blood flowing out of the penis. This is a medical emergency and you should go to an emergency department right away or you risk losing your penis.\n\nCauses include medication reaction/side effect to certain medications such as viagra, cialis, or Levitra, but also some lesser known medications not prescribed for erectile dysfunction such as trazodone. Other causes can include recreational drugs such as cocaine, spinal cord injuries/lesions, or certain scorpion stings.\n\nThe treatment usually involves sticking a needle into the penis and aspirating the blood out.",
   "created_utc": 1690859999,
   "score": 187,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juap728",
   "message": "You can’t get pregnant in the butt",
   "created_utc": 1690860343,
   "score": 112,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juano20",
   "message": "If you jerk off with conditioner and don't wash it off properly, your dick skin will dry out and turn scab like for about 5 days. Scares the hell out of you. \n\nIt will eventually flake off and your dick skin will be good as new and smoother than before.",
   "created_utc": 1690859548,
   "score": 248,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juamaju",
   "message": "50-80% of people have HSV-1 and 1 in 6 people have HSV-2. It is possible to transmit with or without barriers, with or without symptoms, and it is possible to have it and never know. It is also possible to catch type 1 genitally from someone who gets cold sores. Also, standard four panel STD tests do not test for either type so it’s usually not on papers.",
   "created_utc": 1690858861,
   "score": 176,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juaql4t",
   "message": "Asking for a prostate massage is not as easy as it sounds.",
   "created_utc": 1690861076,
   "score": 54,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juanfml",
   "message": "Your step-parent and/or step-sibling do not want to fuck you. Go away.",
   "created_utc": 1690859429,
   "score": 200,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juaod50",
   "message": "Don’t make a playlist for sex without asking your partner if they approve…especially that song.",
   "created_utc": 1690859912,
   "score": 100,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub0jo8",
   "message": "Tightness is not necessarily a good sign.",
   "created_utc": 1690866959,
   "score": 48,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juakz6j",
   "message": "Porn is almost nothing like real sex.",
   "created_utc": 1690858211,
   "score": 126,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juakm0e",
   "message": "Not all women orgasm through penetrative sex. It has nothing to do with the guy or your ability.",
   "created_utc": 1690858032,
   "score": 246,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub2h6g",
   "message": "Slow is good",
   "created_utc": 1690868255,
   "score": 88,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juajxad",
   "message": "Not everyone’s a sex god, your best buddy that brags about lasting a half hour in fact might only last half of a minute",
   "created_utc": 1690857698,
   "score": 115,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juakdhe",
   "message": "Erogenous zones - Apart from the obvious erogenous zones, many areas on the body can be sensitive and contribute to arousal and pleasure when stimulated, including the ears, neck, back, and feet.",
   "created_utc": 1690857914,
   "score": 25,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jualney",
   "message": "The clitoris is at the top.",
   "created_utc": 1690858540,
   "score": 37,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub20rs",
   "message": "If your partner says \"Ow\" or \"ouch\", stop doing that.",
   "created_utc": 1690867947,
   "score": 96,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juakj3h",
   "message": "Getting fisted while listening to classical flute will make you think you created the universe. Same goes for guys",
   "created_utc": 1690857991,
   "score": 115,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juaoehl",
   "message": "Serious sex is a performance art.",
   "created_utc": 1690859931,
   "score": 78,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jual0m1",
   "message": "That it takes more than two people to fuck an ostrich",
   "created_utc": 1690858231,
   "score": 55,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juavdea",
   "message": "11 year olds shouldn’t try to learn this shit on Reddit",
   "created_utc": 1690863743,
   "score": 22,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juatwot",
   "message": "Anal isn’t as cool as everyone makes it out to be. Sometimes something will poke back at you.",
   "created_utc": 1690862908,
   "score": 181,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juamu0j",
   "message": "The clitoris is the only organ in the human body in which its sole purpose is pleasure",
   "created_utc": 1690859129,
   "score": 196,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juax06w",
   "message": "Gonorrhea can infect the throat, have little to no symptoms there if it does, and is harder to cure in there. Also, deep making out can spread it just the same as oral sex does.",
   "created_utc": 1690864720,
   "score": 53,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub09xl",
   "message": "Going for the clit makes sex 1000 times easier. Just go for the clit it isn't hard.",
   "created_utc": 1690866785,
   "score": 48,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub7p9q",
   "message": "If you do foreplay right she'll fuck the hell out of you!",
   "created_utc": 1690872028,
   "score": 202,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juani8k",
   "message": "There is no G spot. That's just the clitoris but on the inside. The clitoris is a big wishbone that connects at that dot above the vagina opening.",
   "created_utc": 1690859466,
   "score": 68,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub35eo",
   "message": "Cold sores are actually herpes that can transfer to your genitals from oral sex",
   "created_utc": 1690868712,
   "score": 31,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juavab9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juawwqt",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juanec9",
   "message": "[deleted]",
   "created_utc": 1690859410,
   "score": 23,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub1o9e",
   "message": "Most women don't orgasm from penetration and need a combination of foreplay on clitoris to orgasm.",
   "created_utc": 1690867711,
   "score": 137,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juakia9",
   "message": "If your vision is blurry and you suddenly see bill Cosby it much too late",
   "created_utc": 1690857980,
   "score": 184,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub7zua",
   "message": "For women, peeing after sex can help prevent urinary tract infections.",
   "created_utc": 1690872254,
   "score": 217,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub2c7j",
   "message": "A woman’s general private area is not to be labeled “vagina”. The vagoo is the actual birth canal. The outer visible part … “peach”, “clam”, etc is called the vulva.",
   "created_utc": 1690868164,
   "score": 97,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub6iza",
   "message": "Circles. Lots of circles.",
   "created_utc": 1690871130,
   "score": 5,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub77ap",
   "message": "Don't get soap in your pee hole",
   "created_utc": 1690871647,
   "score": 104,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub4edm",
   "message": "some women can orgasm by squeezing their legs together really tight and essentially cutting off their blooodflow to their clit. I used to do it sitting in class and it is *intense* lmao",
   "created_utc": 1690869577,
   "score": 96,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub62ea",
   "message": "Gay guy here, for the straights who aren’t in the know, most gay couples would only have anal sex once in a while since it is a trial to “prepare” on the regular (pun intended). Most of the time we just have really sensual make-out sessions and suck each other off.",
   "created_utc": 1690870796,
   "score": 85,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juarv5p",
   "message": "Squirt is pee.",
   "created_utc": 1690861769,
   "score": 32,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub47gz",
   "message": "Porn is not sex",
   "created_utc": 1690869440,
   "score": 6,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juap1bt",
   "message": "Toys are the best tool to satisfy the other person",
   "created_utc": 1690860260,
   "score": 17,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub7nmk",
   "message": "A  common sex injury to your dick is done during reverse cowgirl. Dont ask me how I know….",
   "created_utc": 1690871993,
   "score": 120,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub8tms",
   "message": "In 2004, porn star Lisa Sparxxx had sex with 919 guys in 12 hours.",
   "created_utc": 1690872884,
   "score": 3,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubasdr",
   "message": "Sex is kind of like cooking, in a way. It can almost always be better; using new items, techniques, spending more time, doing research, etc. But it can only be as good, as the amount of time and energy you are willing/able to put into it on any given day. Some days you want and will make a three course dinner, other days you'll be content with insta-ramen, and both of these scenarios are perfectly valid and enjoyable.\n\nJust because something *can* be better, it doesn't necessarily mean you want it to be, or can be arsed every time.\n\nAlso pee after sex, regardless of your downstairs plumping. Nobody enjoys a UTI.",
   "created_utc": 1690874426,
   "score": 1,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juakna9",
   "message": "If you like your own penis then you're gay",
   "created_utc": 1690858049,
   "score": 18,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub4xiv",
   "message": "Some birth controls dry the girl up. Not all, but some. And a couple drops of lube in the beginning isn’t enough. Keep applying. And apply again. And then again. No such thing as too much slippery during sexy time",
   "created_utc": 1690869964,
   "score": 253,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub0qcj",
   "message": "Women are just as horny \u0026amp; freaky as men.",
   "created_utc": 1690867083,
   "score": 18,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub3llq",
   "message": "Its messy. Prepare beforehand.",
   "created_utc": 1690869022,
   "score": 5,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juao2qs",
   "message": "every penis is a modified vagina and everyone started off female in the womb. the sensations are largely the same depending on what used to be where. for example, the sensations a male feels on the ball sack are pretty much identical to the sensations of the labia majora. understanding how we are alike can help a great deal in pleasuring others.",
   "created_utc": 1690859760,
   "score": 35,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jub4vhn",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubh5sa",
   "message": "Toys are allies, not competition. Working together will sometimes get you further than being alone.\n\nThis is a little more common knowledge now but still some people who think toys are gonna replace them.",
   "created_utc": 1690879454,
   "score": 108,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubfuf0",
   "message": "To my fellow men, clip your fingernails regularly. The ladies know what I'm talking about.",
   "created_utc": 1690878395,
   "score": 211,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubf1ik",
   "message": "The size of a woman’s vagina is not affected by how much sex she has, how many partners; or the size of their penis’. Like penis size, vagina size is genetic, so a virgin can have a large one, and a hooker with 6 kids can have a tight one. I don’t know why this myth continues to persist. \n\nAlso, when a woman is very turned on and close to orgasm the vagina actually expands temporarily to accommodate pooling of sperm below the cervix, and orgasm contractions actually “dip” the cervix into the pool. Once orgasm is over the vagina slowly goes back to its normal size (about 5-15 mins). So guys…if your partner feels “loose” it could be simply that she turned on. This is good. As a matter of fact if your partner feels very right the whole time? She’s probably not turned on",
   "created_utc": 1690877762,
   "score": 129,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubbnca",
   "message": "After puberty, sometimes your vaginal fluids can cause \"bleaching\" in your underwear. If this happens to you, it's normal. It means the ph balance of your vageen is slightly acidic. No, you don't need to try to correct it. The vageen is a self-cleaning machine. You shouldn't use anything other than water to clean your folds.",
   "created_utc": 1690875100,
   "score": 232,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubrkja",
   "message": "Sex isn’t that serious and is silly as hell. It’s not an hour of what seems like two people staring deeply into each other’s eyes as they make all the most appropriate, serious sounds. It lasts 10 minutes at most and is goofy af. \n\nIt’s okay to take sex less seriously; it doesn’t need to be a declaration of an intense romance every time you do it!",
   "created_utc": 1690887242,
   "score": 118,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubz8fu",
   "message": "When your partner is orgasming, if you push both their ears in, they will take a screenshot and cherish this moment forever.",
   "created_utc": 1690891774,
   "score": 225,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubam95",
   "message": "Foreplay starts way before you hit the bedroom. Sometimes even days before.",
   "created_utc": 1690874293,
   "score": 83,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubki48",
   "message": "Having a large penis isn't actually all that great. It's no fun hitting the cervix when you're having sex.",
   "created_utc": 1690882076,
   "score": 186,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubyn7f",
   "message": "The difference between squirting and cumming. It’s not the same. 😫",
   "created_utc": 1690891452,
   "score": 8,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubettv",
   "message": "The female orgasm has actually got a biological advantage and helps conception dramatically.",
   "created_utc": 1690877589,
   "score": 15,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubc6sv",
   "message": "If you can smell it by the time you get to the belly button, don’t go any further.",
   "created_utc": 1690875519,
   "score": 193,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juc0ex3",
   "message": "If you want to put something in your butt, it should have a flared end to prevent it from getting sucked in too far and getting stuck. Safety first!",
   "created_utc": 1690892396,
   "score": 169,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juc6fal",
   "message": "When you have constant non-protective sex, a side effect may occur where you have more kids than you can afford.",
   "created_utc": 1690895279,
   "score": 106,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juc404b",
   "message": "Women are more likely to orgasm if their feet are warm.",
   "created_utc": 1690894154,
   "score": 25,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juc1evy",
   "message": "You shouldn't push or blow air into your or your partners vagina intentionally as it can cause air to get trapped in your blood vessels (air embolism)",
   "created_utc": 1690892897,
   "score": 188,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jucht9k",
   "message": "A past gf of mine swore she only used water to clean down there. Anything else used, like soap, could upset the pH balance and result in weird smells. \n\nOut of all my gfs, hers was the one that had almost zero odor.",
   "created_utc": 1690900094,
   "score": 141,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juc5ehm",
   "message": "If your parents never had sex there’s a good chance you won’t either.",
   "created_utc": 1690894806,
   "score": 105,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubha1v",
   "message": "Here's one for the heterosexuals: [PrEP](https://www.burnettfoundation.org.nz/learn/staying-safe/prep/) taken every day reduces the risk of acquiring HIV by up to 99%. Coupled with treatment for HIV that makes someone's viral load undetectable and therefore untransmittable - we can effectively end HIV.",
   "created_utc": 1690879550,
   "score": 106,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jublchl",
   "message": "The reason why quality sex toys are so expensive, is because cheap plastics can degrade from vaginal fluids, causing chemicals to be absorbed into the vagina, this can cause infection and cancer in the long term.\n\nAlso, always use the toy specific cleaning solutions, and clean your toys before and after every use, otherwise risking infections and other issues.",
   "created_utc": 1690882729,
   "score": 116,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubm9w1",
   "message": "Learn your partner. You’ll have the best sex of your life if you know who you’re sleeping with and what turns them on. For some people that comes naturally and there are clear signs (i.e. your partner finishing). For others it’s harder and that’s where I suggest you communicate and take notes as well as put your ego aside. If you think you give the best head but your partner never finishes then clearly you don’t to them. Listen to what they need and if they’re someone you love then you’d work on it. If you think you can make any woman finish but your current partner uses a toy after you’re done then you didn’t make them finish. Learn where they focus their toy and aim for those spots because they know what their body needs more than you. Also a lot of dudes overlook foreplay. Don’t do that, making your partner feel desired and stimulated prior to insertion is a great way to make them finish fast and continually. This includes flirting, not all foreplay happens in the bedroom.",
   "created_utc": 1690883447,
   "score": 95,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juc0a9m",
   "message": "coconut oil can wear down condoms and make them break easier",
   "created_utc": 1690892329,
   "score": 64,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jucc71n",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juci9z2",
   "message": "Sex and any intimacy at all should be FUN. I dated a guy with THREE kids and he thought it was amazing we'd laugh during sex, in a good way.\n\nDon't get me wrong, he was a great guy. But that just gobsmacked me when he told me he'd never laughed or goofed off or had FUN during sex before. Only didn't work out due to distance and him wanting to focus on his kids, which is great, I'd have thought less of him if he ignored his kids for me.",
   "created_utc": 1690900281,
   "score": 130,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jud0wsr",
   "message": "Birth control pills serve other purposes besides preventing pregnancy, such as regulating menstrual cycles, reducing cramps, clearing up complexions, just to name a few.\n\nViagra also offers other health benefits, such as decrease in risk of heart and cardiovascular disease, lowering blood pressure, and regulating glucose levels.",
   "created_utc": 1690907422,
   "score": 100,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubq7zb",
   "message": "You have to give pleasure also",
   "created_utc": 1690886340,
   "score": 20,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jucev92",
   "message": "Don't get cum in your eyes - it burns worse than soap.",
   "created_utc": 1690898902,
   "score": 87,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jud5sm1",
   "message": "Good cardio goes a long way in making you and your partners sexual experience better.\n\nLearn good fingering technique and don't just go digging around like a fat kid trying to get the last cookie out of the jar.\n\nLearn to whistle. The better you get at it the better tongue stamina and maneuverability you'll have.\n\nNever underestimate the power of a good tease and a little denial of pleasure during sexy time.\n\nWash and keep things neat downstairs, it makes the start of the process easier (don't have to worry about any stank) and makes clean up easier\n\nIf you get cum on your skin/hair/clothes use cold water to clean it off, hot water makes it stickier",
   "created_utc": 1690909235,
   "score": 68,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juc5r2p",
   "message": "You can over stimulate the clit. Then sex is usually just over. No matter what you do it just won't feel good anymore. Learned this while trying new things and including toys in the bedroom routine .",
   "created_utc": 1690894971,
   "score": 67,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juc83gt",
   "message": "First, have an emotional connection with your partner. Second, make sure you pleasure your partner first, and you will be reciprocated 10 fold.  This has been my experience over the past 60 years.",
   "created_utc": 1690896032,
   "score": 49,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juc6sn4",
   "message": "Certain antibiotics can affect the effectiveness of birth control pills. Please note, I am in no way a medical professional and in fact pulled this off the internet just to have an answer for this question.",
   "created_utc": 1690895446,
   "score": 25,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubzhcu",
   "message": "Not finishing isn't something you should be ashamed or afraid of, and that goes both ways. Its natural with the building of tension, anxiety, and other factors. Even the way you masterbate can lead to stuggling with climax, due to your body being used to a certain type of speed and feeling, whether thats stroking or rubbing. It isn't something to be afraid of, and it will come with time. It also helps to foreplay and try different things, rather than relying completely on vaginal intercourse.",
   "created_utc": 1690891905,
   "score": 31,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubsrtj",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jud1ier",
   "message": "You cannot fuck a girl unless she's wet for you, otherwise that's painful sex",
   "created_utc": 1690907649,
   "score": 27,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jucbgbw",
   "message": "That the male determines the sex of the baby.\n\nThat mutations can result in a baby having a very different skin complexion and eye color than the parents.\n\nThat it's possible to get pregnant even if the male hasn't had an orgasm.",
   "created_utc": 1690897491,
   "score": 28,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jud8may",
   "message": "Alright, so it's not the kind of sex fact you're looking for, but still.\r  \n\r  \nThe velociraptors' sound effects in *Jurassic Park* were tortoises having sex.",
   "created_utc": 1690910296,
   "score": 34,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juc288n",
   "message": "Hyenas give birth through their clitoris.",
   "created_utc": 1690893307,
   "score": 40,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "jubrv9k",
   "message": "Don't blow air into a vagina. Apart from that fact that that air is going to have to come out and usually that'll be back into your face, it can actually be deadly.",
   "created_utc": 1690887438,
   "score": 23,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "juc327p",
   "message": "If you’re exposed to HIV during intercourse, you can go to the doctors and take post exposure prophylaxis. This is very likely to stop you contracting HIV yourself. The sooner the better. I think most people know this know nowadays but there are a LOT of people with HIV because the government didn’t think to publicise that this existed for years. So Thought I’d mention it. \n\nBTW it can cause very unpleasant side effects so this isn’t something you take just in case, but it’s better than contracting HIV and having to be medicated forever.",
   "created_utc": 1690893707,
   "score": 27,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "judurxq",
   "message": "No amount of posting sex-related questions on Reddit will result in actual sex.",
   "created_utc": 1690918537,
   "score": 19,
   "submission_id": "15ezvyd"
  },
  {
   "comment_id": "judh7lg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ezvyd"
  }
 ]
}