{
 "submission_id": "15f1kw6",
 "title": "What’s the most underwhelming way you’ve gotten a scar?",
 "selftext": "",
 "created_utc": 1690862516,
 "permalink": "/r/AskReddit/comments/15f1kw6/whats_the_most_underwhelming_way_youve_gotten_a/",
 "score": 96,
 "url": "https://www.reddit.com/r/AskReddit/comments/15f1kw6/whats_the_most_underwhelming_way_youve_gotten_a/",
 "comments": [
  {
   "comment_id": "juaten8",
   "message": "Scratching a mosquito bite too hard…",
   "created_utc": 1690862632,
   "score": 90,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juatjmg",
   "message": "I have stretch marks where my limbs connect to my torso because I grew so fast.",
   "created_utc": 1690862709,
   "score": 124,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juayqux",
   "message": "My dad told me that he was bringing me home a chocolate bar, I danced about it, tripped, and cut my face on a door frame.",
   "created_utc": 1690865793,
   "score": 63,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaxalc",
   "message": "I was deployed to Afghanistan about 10 years ago, I hadn't whacked it in a few weeks, so I picked a guard tower that was usually empty. It had a door facing the rest of the post, so I figured nobody would find me, and anyone outside the outpost would be none the wiser. Well I heard some footsteps coming up, and tried to tuck my junk away, and in my haste I tripped and fell on a wooden bench that we were using as a step stool, and tore up my shin. I still have a gigantic scar there. And nobody ever came up. Guy just went halfway up the stairs to get better cell reception. \n\nSo I went to war and did all this stuff and my only scar is from trying to interrupt a spank session.",
   "created_utc": 1690864897,
   "score": 10,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juavtk0",
   "message": "I took a pair of safety scissors to my wrist because 4 year old me wanted to know how safe they really were.",
   "created_utc": 1690864008,
   "score": 241,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaurv0",
   "message": "Blockbuster was throwing away a poster featuring the Lion King's antagonist - and I was like, can I have that?",
   "created_utc": 1690863402,
   "score": 127,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juata18",
   "message": "Burned myself in the oven making a pizza",
   "created_utc": 1690862559,
   "score": 123,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub03ry",
   "message": "I was attacked by a chicken",
   "created_utc": 1690866670,
   "score": 101,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaz9u2",
   "message": "Cut myself with a blade of grass…",
   "created_utc": 1690866130,
   "score": 101,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juatjpf",
   "message": "tied my skates too tight",
   "created_utc": 1690862711,
   "score": 47,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juayvy2",
   "message": "Tried untying a knot with a fork",
   "created_utc": 1690865885,
   "score": 61,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juavpwg",
   "message": "tripped over my shoelace playing tennis (well while i was walking to get water)",
   "created_utc": 1690863948,
   "score": 46,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub4y7v",
   "message": "Shaving",
   "created_utc": 1690869977,
   "score": 32,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juax8js",
   "message": "Racing my friend for a holographic pikachu. \nMy shin will never let me forget the tragic loss that befell me that day.",
   "created_utc": 1690864861,
   "score": 43,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juay0y3",
   "message": "Pillow fight",
   "created_utc": 1690865342,
   "score": 28,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaw08e",
   "message": "Edge of a CD I was spinning out of boredom, flew off and somehow managed to slice my left arm.",
   "created_utc": 1690864117,
   "score": 51,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaw589",
   "message": "I have a burn scar on my pinky from overheated hot glue.",
   "created_utc": 1690864200,
   "score": 27,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juavw1j",
   "message": "I was on leave for 2 weeks while living in Japan and decided to go to the skatepark day one. I try to do a board slide on a obstacle a little higher than ankle height and somehow I fell and my foot didn’t flex and rolled my ankle/gashed the hell out of my leg . I literally couldn’t walk and was peddling my bike home with one leg up hill… I couldn’t do anything for the rest of my vacation…",
   "created_utc": 1690864049,
   "score": 24,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub06om",
   "message": "I worked at a hardware store for years... I was putting out pallets of stock, and was opening boxes of caulk. We used to cut the box so that the tube could stay upright in it and not fall over... But you had to be careful not to cut the tubes. I am using my \"safety\" box cutter where the blade snaps back in when you let it go, but it didn't save me. That fucker zipped around the corner of the box and out of the cardboard, right into my calf. I stabbed myself about half an inch into the meaty part of my calf, through my jeans and i had to pull it out.\n\nI left a blood trail to the first aid box at my paint desk as customers flocked to me like sharks smelling blood. I had to tell them \"Give me a moment I am bleeding here!\"",
   "created_utc": 1690866725,
   "score": 15,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juazls5",
   "message": "My friend stepped on a twig at a park and for some reason it whipped him and he had to get 14 stitches that day.",
   "created_utc": 1690866346,
   "score": 28,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaw904",
   "message": "Brushed up against some type of needled cactus/fern hybrid that had only one spine on the very end of the leaf and it hardly scratched me. Never even drew blood. Had a purple scar since 2011 from it.",
   "created_utc": 1690864261,
   "score": 22,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juayeqb",
   "message": "rubbing an eraser on my hand",
   "created_utc": 1690865580,
   "score": 15,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0i71",
   "message": "Ran and tripped head first right into a table while running over to tell my mom about a cut I had from running into a table.\n\nI not smart.\n\nEdit: I also have not one but TWO scars from jumping on beds. I went hard as a kid. This is why parents tell you not to jump on beds.... it actually IS dangerous.\n\nI've had several hundred stitches all over my body. No joke.\n\nAt some point I just learned to give myself stitches. Basically a pro at this point.\n\nScars everywhere.\n\nAlso my younger brother shot my youngest brother point blank in the head with a BB gun just to see what would happen.\n\nTurns out brain surgery is what happens. He's fine though. The BB is framed on a wall in his house. He's got the scar to prove it.",
   "created_utc": 1690866932,
   "score": 22,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juawhgd",
   "message": "My sister got a little graze on her knee in a parking lot, and then spent 10 hours in the pool every day for two weeks (we were on holidays), so her scab kept falling off. She ended up with a big permanent scar",
   "created_utc": 1690864401,
   "score": 17,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juawmro",
   "message": "My dog stepped on my toe.\n\nAnd now I have a small scar there because of it.",
   "created_utc": 1690864492,
   "score": 16,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juauvim",
   "message": "I fell off my bike",
   "created_utc": 1690863462,
   "score": 4,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juawnuv",
   "message": "Was trying to bathe my dog and she tried to escape the tub and clawed my arm. I have like a 3 inch scar on my left arm now.",
   "created_utc": 1690864510,
   "score": 12,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juay0w5",
   "message": "I got a scar on my leg from crossing a barbed wire fence",
   "created_utc": 1690865341,
   "score": 6,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juayy6x",
   "message": "A yo-yo 😂",
   "created_utc": 1690865924,
   "score": 11,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub24li",
   "message": "I play guitar, and i was changing my strings one day. After i finished the string change i had a bunch of excess string that i needed to throw away, but i decided to leave one of the thicker strings out just as a little fidget toy.\n\nWell, the backside of my hand got really itchy, and while holding the excess guitar string i decided the best thing to do would be to scratch my hand with the guitar string because “it probably scratched better”\n\nIt definitely did, and when i stopped scratching i found that not only did it satisfy the itch, but it gave me a ridiculous amount of small cuts that eventually turned into horrible scars all over the back of my hand.",
   "created_utc": 1690868021,
   "score": 9,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juate73",
   "message": "Surgery.",
   "created_utc": 1690862625,
   "score": 19,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juav8re",
   "message": "My father dropped a roll of steel wire fence, because he got scared when it popped up.",
   "created_utc": 1690863669,
   "score": 7,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juawt1g",
   "message": "Dog bite",
   "created_utc": 1690864598,
   "score": 4,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaxjzo",
   "message": "I was walking alongside my mother outside while she was holding a cigarette down by her side. Like an idiot, I was swinging my arms while I was walking…so, I stamped it out on my wrist.",
   "created_utc": 1690865054,
   "score": 7,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaxrs3",
   "message": "My younger brother and I were arguing about something, and he picked up a battery and hit me in the forehead head with it.  I still have the scar.",
   "created_utc": 1690865185,
   "score": 4,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaxuc9",
   "message": "Dropped the vacuum cleaner on my bare foot, which took a divot out of it.",
   "created_utc": 1690865228,
   "score": 7,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub03ko",
   "message": "A kid at school poked me with a pen. I have a small tattooed scar on my upper right arm since then.",
   "created_utc": 1690866666,
   "score": 8,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub07ng",
   "message": "I was trying to peel a plum with a razor blade when my junky parents were passed out when I was like 3 and sliced my hand up.",
   "created_utc": 1690866743,
   "score": 4,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0jhj",
   "message": "Bull ant bit me between the fingers. I ripped his body off and his head was continuing to burrow into my hand. Ended up scarring.",
   "created_utc": 1690866956,
   "score": 6,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0k48",
   "message": "I hit my leg on a cardboard box",
   "created_utc": 1690866967,
   "score": 6,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0pjz",
   "message": "Cut my finger open setting up a fake Christmas tree",
   "created_utc": 1690867068,
   "score": 4,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juav754",
   "message": "Lipoma removal on my forehead",
   "created_utc": 1690863645,
   "score": 4,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juayhk5",
   "message": "I walked face first into the corner edge of a wall in the hallway of my house that I've walked down a thousand times before and cut open my right eyebrow. Sure, it was dark but not that dark and I wasn't even high.",
   "created_utc": 1690865628,
   "score": 6,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaywwv",
   "message": "I had a Great Dane, and he reached up to “shake” and his claw caught the top of my hand. I have a huge ugly looking scar about 7 inches long from my wrist down the top of my hand. I tell people I was in a knife fight.",
   "created_utc": 1690865902,
   "score": 5,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaz3dd",
   "message": "I have a wicked looking scar on my foot from jumping a fence barefoot and landing on a big ass lumber nail when I was a kid.",
   "created_utc": 1690866015,
   "score": 4,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaz4fo",
   "message": "Scratching my arm on the screws poking through a wardrobe door",
   "created_utc": 1690866034,
   "score": 5,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juazbww",
   "message": "Pretty cool looking grid scar from the French fry machine working at McDonalds.",
   "created_utc": 1690866168,
   "score": 3,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juazm5c",
   "message": "I fell on a stiff piece of dried grass. Left a triangle scar under my knee",
   "created_utc": 1690866352,
   "score": 3,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juazqd4",
   "message": "I was walking downstairs when I was 5 years old wearing a too-long nightgown and holding my older sister’s hand. Tripped on the last step, got scratched pretty badly right between my eyebrows, and still have the scar years later!",
   "created_utc": 1690866427,
   "score": 3,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juazwy2",
   "message": "Like 6 years ago I tripped on the battery display case in front of the Walmart checkout lanes. Now I have a chunky scar on the inside of my ankle.",
   "created_utc": 1690866546,
   "score": 3,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub04re",
   "message": "Chicken pox! \n\nIdk when the chicken pox vaccine became a thing but it sure wasn’t mainstream in the 90s.",
   "created_utc": 1690866689,
   "score": 3,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0njj",
   "message": "My friends and I used to race around my friend’s freshly-paved asphalt driveway on our bikes. That was when I found the limits of traction on bicycle tires. One day, I went past that limit, and hit the ground, leaving small scars on my right wrist and left knee. Undaunted, I did the same thing turning the other direction about a half hour later, which gave me the matching set of scars on the other side.\n\nI’m still surprised I didn’t die as a kid.",
   "created_utc": 1690867030,
   "score": 3,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0pt3",
   "message": "The eraser challenge",
   "created_utc": 1690867073,
   "score": 3,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaz8tm",
   "message": "I don’t know, wasn’t whelming enough to remember",
   "created_utc": 1690866112,
   "score": 7,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juauhh2",
   "message": "Small scratch that I kept picking and eating the scab, which made it bigger and worse",
   "created_utc": 1690863237,
   "score": 6,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaz1f9",
   "message": "So underwhelming that I don't even know. Get asked about it and have absolutely no idea. (Not a drunken can't remember either)",
   "created_utc": 1690865982,
   "score": 4,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juavfcd",
   "message": "Got a small shallow cut on my forearm moving furniture.  It got infected even though I put neosporin on it. It left a very noticeable scar, looks like I was cut deep with a knife.",
   "created_utc": 1690863776,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juawpzs",
   "message": "Chicken Pox. Pretty bad ones.",
   "created_utc": 1690864546,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juax7wn",
   "message": "Broke the bottom part of a cup and my hand went through it",
   "created_utc": 1690864850,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub03rz",
   "message": "Cat",
   "created_utc": 1690866670,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0qcp",
   "message": "Reaching into a washing machine to get some clothes. Scratched the back of my hand so deep that it left a permanent scar. Straight up looks like I got it in a knife fight, but no, I got it doing laundry.",
   "created_utc": 1690867083,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0rfk",
   "message": "Recently got a scar from my ankle to near my knee where the skin pretty much flapped.\n\nI was standing on a step and it gave way, one second I was standing around 4 feet in the air and the next I was standing on the ground.\n\nThe screw dug into my skin and pulled along it.\n\nI put duct tape on it and it healed flat, lets gooooo.",
   "created_utc": 1690867103,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0roq",
   "message": "Fell off a sled into lovely, soft, deep powder snow. Long story short, I now have a six inch scar on the outside of my right ankle (with the added bonus of six visible screw heads) and a two inch scar on the inside of same ankle.",
   "created_utc": 1690867108,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0unh",
   "message": "Bike.",
   "created_utc": 1690867162,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0z7t",
   "message": "Woke up from a nap with a headache to go to a dentists appointment. Was woozy and got up and moving too quickly. Walked right into the corner of the wall and closet, small vertical scar on my forehead.",
   "created_utc": 1690867245,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub13zq",
   "message": "well it wasn't underwhelming to my family ....but it was to me\n\ni got a 4 inch stab wound on my stomach ,and a 3 inch one on my arm and leg\n\n\u0026amp;#x200B;\n\nthere from some idiot at the mall",
   "created_utc": 1690867333,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub153z",
   "message": "Old friends of mine had a per Budgy bird and I was hoping it on my hand, the damn thing pecked my finger and left a scar on my knuckle",
   "created_utc": 1690867353,
   "score": 3,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub1rnn",
   "message": "Somehow trippee and fell over carrying a plate with a cupcake on it  The plate shattered on the ground and the shrapnel somehow cut me as I tried to catch the cupcake. Swatted it a few times, sister said it looked like I was a literal bloody juggler.",
   "created_utc": 1690867774,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub1wl8",
   "message": "tried to rescue my cat on the upper shelf by standing on my bike handles.  fell off and scraped by hand.  cat was still there.",
   "created_utc": 1690867869,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub2ixt",
   "message": "Bonked my head on the corner of a windowsill when I was 5 years old. Hurt like a bitch at the time, but I mostly forgot about it. Until, at age 16, I decided to rock a buzz cut. Boy, was I surprised when I found out I had a tiny bald spot right where I had hit my head 11 years earlier!",
   "created_utc": 1690868287,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub2kzw",
   "message": "Opened a can of cat food and the metal sliced the skin off my pointer finger pad.. I don’t have a pointer finger print anymore.",
   "created_utc": 1690868327,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub2mg8",
   "message": "Cut myself on accident trying to cut watermelon like a professional dumbass.",
   "created_utc": 1690868355,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub32jl",
   "message": "I was like 10, our heat was out--but I had to shower for school.  My mom set up a little space heater on the bathroom sink, but it was still bitterly cold.   \n\nI vigorously dry as best as I can, but in an effort to feel a little less like a popsicle, I backed my little pale butt up to the heater... and promptly branded myself with the hot metal screen.\n\nI'm about to turn 38, and I still have a small patch of honeycomb burn scars on my right asscheek.",
   "created_utc": 1690868656,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub34ns",
   "message": "Fell asleep on some Christmas lights while they were on so one of the bulbs burned my leg.",
   "created_utc": 1690868698,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub3a2z",
   "message": "I had a mole removed.",
   "created_utc": 1690868801,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub3pu9",
   "message": "Opening a bag of carrots",
   "created_utc": 1690869101,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub3x4x",
   "message": "I accidentally stabbed myself in a taco bell",
   "created_utc": 1690869238,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub4hkk",
   "message": "Campbell's soup can incident of 2021.",
   "created_utc": 1690869641,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub58nz",
   "message": "When i was a baby my cousin threw a plastoc shovel at my face because ge said he didn't like girls. But i can lie to people and say it's from something cool! It's on my eyebrow! 😊",
   "created_utc": 1690870187,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubdtug",
   "message": "Single knuckle punching through the foil under a new vitamin bottle cap.",
   "created_utc": 1690876804,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubduzc",
   "message": "Caught my hand on the microwave door while closing it… 12 stitches.",
   "created_utc": 1690876827,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubdvw0",
   "message": "I chipped my tooth trying to bite the diving board at my aunt's pool from the water pretending i was jaws.",
   "created_utc": 1690876847,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubdyjg",
   "message": "Messing around in the bath tub as a kid. I have a square, faucet-shaped scar on my ass cheek from playing waterslide in the tub. I never got any smarter with time.",
   "created_utc": 1690876905,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jube0hv",
   "message": "I have a scar on my hand from when I was 17 and worked on a checkout till at a supermarket. I accidentally grazed my hand on the conveyor belt. No Biggie. Wasn't even a big cut, barely any bleeding. \n\nI'm 41 now and the scar remains.",
   "created_utc": 1690876946,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jube26e",
   "message": "ripped my leg open on the chain wheel of my bike",
   "created_utc": 1690876983,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juaz7b5",
   "message": "Frying bacon topless. Pan got too hot and like popped up from the burner, and the bacon grease jumped and landed all over my stomach.",
   "created_utc": 1690866085,
   "score": 3,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juazhib",
   "message": "I was holding a broken music box that spins and a piece dug into my hand and left a scar",
   "created_utc": 1690866270,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juay1yk",
   "message": "Self surgery",
   "created_utc": 1690865360,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0ajj",
   "message": "cut myself… during my emo phase",
   "created_utc": 1690866796,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0l0x",
   "message": "Chased a girl over a counter and slipped. Took off 3\" of skin from my shin in an ice fight at a movie theater.",
   "created_utc": 1690866983,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0qw1",
   "message": "I reached into my pocket. I forgot I had put a pencil in there and it was point side up.",
   "created_utc": 1690867093,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub0vlr",
   "message": "Got a deep cut from a nail in my foot.",
   "created_utc": 1690867179,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub16e3",
   "message": "Stabbed myself in the leg. Looking at my friends new knife, had the knife in my hand. I used that hand to leverage myself to turn and talk to someone behind me. Took a chunk out and had 6 stitches to close up a deep wound",
   "created_utc": 1690867376,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub16r7",
   "message": "Boo!!! AAAAA!!!!! That's how I got scared.",
   "created_utc": 1690867382,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub19j5",
   "message": "I don't really scar. I have so much collagen type IV that my scars usually disappear in  2 or 3 years. The only scars I have happened before I was 10. I ran into the corner of a table when I was 2 and have a scar right along the lower edge of my eyebrow. I have a small pigment scar you can barely see from the time I fell and scraped my knee really badly. I have to point it out to other people if they ask if I have any scars.",
   "created_utc": 1690867435,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub19jn",
   "message": "Tried to catch a boomerang",
   "created_utc": 1690867435,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub1feo",
   "message": "Huge burn taking bacon out the oven at Wendy's. My skin was wet from doing dishes so it just came right off. I read all of these. Life is crazy",
   "created_utc": 1690867545,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub1i25",
   "message": "Was born with a 3rd nipple. It was tiny but I wanted it removed. Went to some wack doctor who did a really shitty job and now I have a giant scar under my boob that looks like a centipede, because you can see all the stitches.",
   "created_utc": 1690867593,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub1mup",
   "message": "I forgot I was holding a powered on sander. It sounds bad but it didn’t really hurt for some reason.",
   "created_utc": 1690867684,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub1sxb",
   "message": "Opened a short pull-ring can of tuna and slipped holding it, my grip shifted and I ended up gripping down on the sharp lid. Cut my finger to the bone and got a nerve. Now I have a neat crescent scar on the side of that finger.\n\nTell you what, the doctors laughed their arses off. I had spilt tuna all down me, so I came in smelling of fish. Doctor asked me what the fuck I stuck my finger in. :/",
   "created_utc": 1690867799,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub1u4g",
   "message": "Got stabbed on my thumb by a dry piece of grass",
   "created_utc": 1690867822,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub1xct",
   "message": "Idk if this counts as scar, bc it happened less than a year ago, but I can still see the mark when a typical scratch would've healed by now.\n\nI was creating a robot puppet costume for a college theatre show. I was cutting a thick foam with an exact-o-knife. I had the knife in my right hand, and held the foam with my left. Once my right hand was done cutting, my left hand flew and deeply scratched just below my right wrist. I felt the layers of skin come off and I started bleeding immediately. \n\nTLDR: I got a scar because I accidentally scratched myself too hard.",
   "created_utc": 1690867884,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub202n",
   "message": "Cat sliced up my right index finger, no scar except for a tiny bump on the palm side of my finger.",
   "created_utc": 1690867934,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub20wo",
   "message": "Wearing vans……",
   "created_utc": 1690867950,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub2189",
   "message": "A big piece of hay stuck me in the side of my foot like a monster splinter. Have a circle shaped scar from that. Don’t chore in sandals lol",
   "created_utc": 1690867956,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub21cu",
   "message": "My sister’s senior chihuahua with no eyes and teeth somehow managed to take a sizable chunk out of my arm\n\n(If you’re wondering about the situation around it its also underwhelming, the dog was taken from a hoarding situation. And we’re assuming that I somehow remind her of the main hoarder guy, so she’d gladly rip my jugular if she could-)",
   "created_utc": 1690867958,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub23wp",
   "message": "Girl Scouts was teaching how to safely carve soap. I was too into trying to carve SpongeBob and not listening. They used me to show how to do first aid. It was hilarious though.",
   "created_utc": 1690868008,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub27jr",
   "message": "Lol my hairline has a scar that’s more like divot that occurred when I was born. First broken bone was collarbone - also occurred at birth.",
   "created_utc": 1690868077,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub282n",
   "message": "Was moving a couch downstairs , person up top decided to drop said couch. Hand got caught, gnarly \n scar",
   "created_utc": 1690868086,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub2ahf",
   "message": "tripped on a stick",
   "created_utc": 1690868132,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub2atb",
   "message": "My dog jumped on me for kisses. Completely unaware of her very sharp claws 😭",
   "created_utc": 1690868138,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub2eup",
   "message": "Tried to open a beer bottle with a lighter",
   "created_utc": 1690868213,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub2mfz",
   "message": "Fell off a couch, hit my head on the corner of a coffee table.\n\nScar is still visible 12 years later.",
   "created_utc": 1690868355,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub2nwp",
   "message": "Trimming bushes while high with an electric hedge trimmer and grabbed the business end too soon after I let off the trigger.  I'm stunned I didn't lose a finger.",
   "created_utc": 1690868383,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jub2ru8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubdt9o",
   "message": "I slipped with a Julienne Peeler (cuts vegetables into thin strips) and it Julienne-d part of my left thumb (the cut part was barely still attached).\n\nHad to go to the ER because after 4h it was still bleeding, they just put operating room holding plasters over and it healed in two weeks but you can still see the seam.",
   "created_utc": 1690876792,
   "score": 3,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubdmxn",
   "message": "Melting a piece of scotch tape over a candle. It hurt like hell for days, but I rationalized sucking it up would be easier than explaining why I was doing that.I still don't know.",
   "created_utc": 1690876653,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubdnhy",
   "message": "I currently have acne, bad acne, it’s progressively getting better",
   "created_utc": 1690876666,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubdo61",
   "message": "Tore down a barbed wired fence on an atv",
   "created_utc": 1690876680,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubdov6",
   "message": "Got scratched in a thumb war.\n\nI won covered in blood.",
   "created_utc": 1690876696,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubdp99",
   "message": "Picked up my dad’s razor at the wrong end",
   "created_utc": 1690876704,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubdpw0",
   "message": "Slashed my left palm open while trying to cut a watermelon in half",
   "created_utc": 1690876719,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubdqnd",
   "message": "Cat scratch. I've lived all my life in a cat household and that means scratches sometimes. Once it gave me a scar.",
   "created_utc": 1690876735,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubdrzw",
   "message": "I have super sharp fingernails. I was wearing shorts while I was driving. Swing my hand down from the steering wheel and nicked my leg. Not a permanent scar, but lasted for years. Finally faded.",
   "created_utc": 1690876763,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubgyqf",
   "message": "trying to find a spot to shit in the wild. I'm telling you these rocks were huge and extremely hard to navigate through. At some point I decided I'd jump from one, to another. bad idea. scarred my whole arm by scratching on a big rock while jumping. needless to say that I came back to the camp like I had fought a pack of bears only to announce that I was looking for a spot to take a shit.",
   "created_utc": 1690879295,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubk43l",
   "message": "I had a big ass Australian ant bite me on my foot. The scar has been there for over 15 years and I’ve had multiple previous partners inquire about it - it’s somehow quite noticeable.\n\nEdit: It was a bull ant, one of the largest and most ‘venomous’ ant species in the world. There’s been a couple of deaths from em’ https://australian.museum/learn/animals/insects/bull-ants/\nBut it’s still such a stupid scar. I was trying to eat it.",
   "created_utc": 1690881766,
   "score": 2,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "jubmslq",
   "message": "I stood on a tiny fence that wasnt secured to get over the other side quicker. Fell off the fence smashed my head on concrete cut my ass cheek on a gas bottle and needed stitches",
   "created_utc": 1690883841,
   "score": 1,
   "submission_id": "15f1kw6"
  },
  {
   "comment_id": "juatu5j",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15f1kw6"
  }
 ]
}