{
 "submission_id": "15f38uq",
 "title": "Those who have got caught watching porn as kids,how did your parents find out?",
 "selftext": "",
 "created_utc": 1690867848,
 "permalink": "/r/AskReddit/comments/15f38uq/those_who_have_got_caught_watching_porn_as/",
 "score": 243,
 "url": "https://www.reddit.com/r/AskReddit/comments/15f38uq/those_who_have_got_caught_watching_porn_as/",
 "comments": [
  {
   "comment_id": "jub9t43",
   "message": "I found my dad's VHS collection when I was a teen. One time I forgot to put one of the tapes back. Actually I specifically recall the movie was \"Trampire\"... \n\nAnyhow, my Dad comes into my room a few days later and says \"If you borrow my shit, put it back where you found it. We're never discussing this again\".",
   "created_utc": 1690873647,
   "score": 123,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub96xr",
   "message": "My dad took my iPod touch away when I was 13 as a punishment for something and I called him at work and asked him to please delete the search history without looking at it... three seconds later he said \"So... 'sexy asian girls, huh?\"",
   "created_utc": 1690873166,
   "score": 28,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub2aio",
   "message": "Used mom's phone. Didn't know about browsing history.",
   "created_utc": 1690868132,
   "score": 140,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub3ly4",
   "message": "The porn all over the family computer is what gave it away.",
   "created_utc": 1690869029,
   "score": 225,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub427o",
   "message": "[deleted]",
   "created_utc": 1690869337,
   "score": 248,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub5dxf",
   "message": "Lisa ann moaned a little too loud. Next thing i knew, parents told me to get out of my room immediately, \u0026amp; they checked my browser",
   "created_utc": 1690870293,
   "score": 93,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub2xe4",
   "message": "\"Borrowed\" my dad's VHS tape from his special drawer. \n\nIt was \"Touch Me In The Morning\" staring Veronica Hart.\n\nTook it and watched and tried to return it, but dad had already discovered it missing.\n\nHe was pretty cool about it. He just said, \"If you're going to borrow my stuff, put it back\" and didn't make a big deal about it. I guess it was pretty obvious who took it, as we were ina household of Dad, Mom, two girls and a teenage boy. Not saying girls can't have an interest in sex, but if your porno tape goes missing in a house with a teenage boy it doesn't take Hercule Poirot to figure it out.\n\nFor those interested:\nhttps://xhamster.com/videos/touch-me-in-the-morning-1981-2607136",
   "created_utc": 1690868559,
   "score": 233,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub3mw9",
   "message": "Be teen me. Pretend to study. Mom barges in. Dick swinging, Brandi Love taking it like a champ on screen. Scramble and accidentally turn on sound at full blast. Stare in shock and embarrassment. 😳",
   "created_utc": 1690869047,
   "score": 169,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub6khx",
   "message": "my father checked my history. so many extreme bondage porn websites... it was traumatic. probably for the both of us lol",
   "created_utc": 1690871161,
   "score": 217,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub6n7x",
   "message": "2nd grade me didn't know deleting your search history was a thing. I'd just search \"Sex\" on YouTube, and there were tons of actual pornos",
   "created_utc": 1690871220,
   "score": 46,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub5gmw",
   "message": "Okay so my cousin and I are two years apart and we were the best of pals. Since we were hitting puberty about the same time, a hot topic between us was sex and dicks. \n\nOne day we were hanging out at grandma's (as we often did) and while using her computer we had the brilliant idea to use this opportunity to research aforementioned related things. What ensued was just total chaos and half of it was curiosity and half of it was because it was funny. I remember at one point we made grandma's desktop background just nothin but dicks while she innocently crocheted 3 feet away. We looked at all the dicks. Ducks, whales, lions, tigers and bears. Just so much dick. \n\nLater while on the phone my mother asked what we did on our visit and grandma told her that we had stayed on the computer most of the time. My mom was much more aware of our corrupt brains than our poor, sweet geandma. That however all changed when mom suggested she take a look at the history (we were unaware such a thing existed) and thus began and ongoing and over a decade long joke in the family. I'm still mortified when they bring it up and to this day grandma looks over my shoulder if I were to use her computer (I'm 27)",
   "created_utc": 1690870349,
   "score": 241,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub2wh9",
   "message": "Asked Dad if he preferred Wicked or Digital Playground better 🤷🏻‍♂️",
   "created_utc": 1690868544,
   "score": 126,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub41xp",
   "message": "By some *miracle* they thought I was only looking at memes and random youtube videos into the late hours of the night. That being said, **thank god** they caught me. If I had developed an addiction in my early teens I certainly wouldn't be able to shake it easily now.",
   "created_utc": 1690869331,
   "score": 76,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub6vhw",
   "message": "Downloaded the video and that was the only day I didn't check the downloads folder on my mother's phone because i was too tired post nut. In the morning she checked the folder to find some teaching material to prepare for her class that day and was greeted by a very unpleasant sight of \"Vaccum cleaner salesman porn\". \n\nNeedless to say it was a long morning.",
   "created_utc": 1690871394,
   "score": 39,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubalkk",
   "message": "I printed out photos to reference later (only computer was in the family room). After they finished I turned off the printer and secured my stack of materials. I felt I had gotten away with the perfect crime, until my Mom went to use the computer and a photo started printing that had gotten stuck in the queue.",
   "created_utc": 1690874278,
   "score": 124,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub4w6c",
   "message": "Mom was sleeping in the adjacent room and back then laptops were fixed to one place, but my back faces the entrance to the room so I didn't realize when she woke up and snuck behind me and yelled \"What are you watching?!\" I shut it and screamed \"Nothing!\" (obviously) and then we pretended like this never happened",
   "created_utc": 1690869937,
   "score": 116,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub4wmh",
   "message": "She walked in on me and I didn’t know she was there. She hit me mid act and told me it’s not something good girls do. She wonders why I never call.",
   "created_utc": 1690869946,
   "score": 174,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub6qbe",
   "message": "Not porn but I was playing this beach volleyball game online one time and if you got so many points ahead of the computer the girls tops would come off. I had been trying for weeks to get far enough ahead for them to go topless. FINALLY did it one night and I kid you not, 60 seconds after unlocking boobas my mom walks in to tell me to get off the internet so she can make a phone call. Embarrassed and defeated I tried to play it off like I didn’t know that would happen. She didn’t buy it",
   "created_utc": 1690871285,
   "score": 33,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub2bnh",
   "message": "I was in my room watching porn and jerk off and my mother came in and saw me, she was surprised but she didn't take it badly, she started laughing and told me to go ahead and not worry",
   "created_utc": 1690868153,
   "score": 72,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub2y52",
   "message": "[deleted]",
   "created_utc": 1690868574,
   "score": 22,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub4uc2",
   "message": "I had a penthouse or two hidden under my matress and my mother and I were moving the matress for some reason.  She just laughed and said \"I didn't see that.\"  I was 14 or 15 at the time, mildly awkward but not a big deal.",
   "created_utc": 1690869901,
   "score": 149,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub4c2r",
   "message": "My parents’ house had a little open balcony overlooking the living room. My dad had insomnia and he caught me whacking it to some Showtime movie late at night.\n\nThey weren’t happy and complained to the cable company about the channels they accidentally gave us free, but they (the cable company) never bothered to do anything about it.\n\nIt’s worth noting we randomly got HBO and Showtime for free. Oh Shannon Tweed in “Save Me” was such a babe.",
   "created_utc": 1690869531,
   "score": 77,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub6ilh",
   "message": "you know how doctors knock on the door when they're coming in? that rapid fire triple knock immediately followed by the door opening? my dad used to follow mom's lead and just, open the door but after walking in on me once he started doing the doctor knock. that's not enough time to put my dick away so he ended up catching me multiple times. never once changed the knock routine either.",
   "created_utc": 1690871122,
   "score": 69,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub7zv6",
   "message": "There was only one laptop for the family and I wasn’t yet aware of what the “prtscrn” button, which was located right above the backspace, was used for",
   "created_utc": 1690872255,
   "score": 82,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub9xdo",
   "message": "When I was 12 my mom discovered my magazines that I had brought home from a recycling bin some\ntime earlier and hidden behind my desk. She was cleaning my room and they fell out. No good hiding spot. Anyway, she took them to my dad who was resting in the couch and said “what are you going to do about this!?”. When I came home from school dad and I had a talk about porn and the difference between fiction and reality. He said that I could keep the magazines and told me to find a better hiding place for them.",
   "created_utc": 1690873739,
   "score": 63,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub9a2j",
   "message": "Faped, got caught. \n\nHad porn up on my pc screen, got caught.\n\nThis was during the times with dial up, so yes that image did take a while to load so it was minimized... And right when I wanted to check if it was loaded... Well.\n\nThey found out like this 😐. Dad walked away then asked me what are the two women doing, but he walked away before I could answer him.",
   "created_utc": 1690873234,
   "score": 72,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubhe0x",
   "message": "Buckle up, here's a story.\n\nBack in the 90s, our family had a vcr player that also recorded. For it's time it was high tech. When you put in a tape with multiple clips in it, it could read where each recording started from so you could rewind back to the start of each one. \nMy parents programmatically recorded alot of TV soaps as my dad had a long commute and they'd watch them together in the evening.\nMy dad also had a collection of porn VHS tapes of which I would avail myself from time to time before putting back thinking I was super sneaky and clever etc.\n\nFateful day in a holiday with the house to myself, that evening my mum and dad sit down to watch Eastenders. They sit down and hit the auto rewind to the start of the recording. I realise waaaaaaay too late that the tape rewinds far too long, a 30 min episode should take less than a minute to rewind to the start of the recording, but this tape is going all the way to the start....\nI hadn't put the recordable vcr tape back in the machine, id left the porn tape in there and they were about to hit play on my Dad's porn tape WITH THEIR TEENAGE SON SAT IN THE ROOM.\n\nI remember the hot flush of shame as the titles played and being sent to my room. I was saved from certain death by the fact my mum didn't know my dad had them so her anger was split evenly. Was a quiet house for a few days.",
   "created_utc": 1690879637,
   "score": 100,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub5dtm",
   "message": "Didn’t know you could look up browser history and didn’t know about incognito mode.",
   "created_utc": 1690870291,
   "score": 32,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub5qej",
   "message": "Browsing history. nuff said",
   "created_utc": 1690870550,
   "score": 16,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub8jlq",
   "message": "Computer virus. Fucken limewire",
   "created_utc": 1690872676,
   "score": 30,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub7az3",
   "message": "It was 2006, I was 12 and the only free internet porn in those days were riddled with viruses. Crashed my computer and my mom, who works in IT, tried to fix it and thats how she found all the porn virus’s. \n\nIm computer illiterate so thats the only way I can describe the “how”. \n\nAnyway, I was grounded from the computer for a VERY long time. Im also a girl so in a way it was even more awkward then it would have been if I was just a horney pre-teen boy. The memory still keeps me up at night. \n\nMy mom also walked in on me and my hs boyfriend the first time we had a sex, she wasn’t supposed to be home and I walked in on THEM (my parents), my senior year of high school so clearly I have terrible luck.",
   "created_utc": 1690871724,
   "score": 113,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub8vll",
   "message": "I shared the video to the big TV on the living room by accident :'(",
   "created_utc": 1690872926,
   "score": 165,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub5hxq",
   "message": "They got the bill from the video store lol",
   "created_utc": 1690870375,
   "score": 14,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub7wiw",
   "message": "Not watching exactly but had some explicit fanart (gay) saved in my camera roll. Dad asked to search my phone randomly. He was not a fan. Got grounded for three months I think.",
   "created_utc": 1690872183,
   "score": 17,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub93x3",
   "message": "I don't know if it was a virus or what, but somehow the bookmarks menu got full of porn links.  And not even to good porn, it was all stuff you'd never want to watch.",
   "created_utc": 1690873103,
   "score": 32,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubihfq",
   "message": "Mom came inside my room while I was busy \"performing\" 😣",
   "created_utc": 1690880493,
   "score": 31,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub51pj",
   "message": "I forgot to put the tape back in the box in their closet.",
   "created_utc": 1690870046,
   "score": 21,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub7n23",
   "message": "Sister narked me out",
   "created_utc": 1690871981,
   "score": 79,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub7x7z",
   "message": "Spent $300 one month on buying it back when HBO and those movies channels on direct tv were always having something to rent. My dumbass thought it would be added on to our electric bill or something",
   "created_utc": 1690872198,
   "score": 64,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub9zlp",
   "message": "…my mom (with my dad) went into the YouTube watch history looking for a video she had previously seen and wanted to rewatch. YouTube used to be a wholee other place, lemme tell ya.",
   "created_utc": 1690873787,
   "score": 50,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubamio",
   "message": "Had a PSP back in the day and managed to download a single porn on it, the system required me to name the file tho. So of course after giving it a lot of thought I still chose the least suspicious name I could being just a single letter not meaning anything at all…at least to me, that being „X“.\nCouple weeks later I asked my mom to transfer some some music from her laptop onto my PSP and that’s when I had to explain what that file was and what was on it.\nLuckily the download was in a format that couldn’t even play on the console or the laptop but still my mom found out I was planing on watching .\nSo back to pictures I went",
   "created_utc": 1690874299,
   "score": 29,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubb1s8",
   "message": "I got suspended from school in 5th grade because a girl I knew brought some pages of porn in to give me. It was her dad's. I was caught showing my buddies after hiding it in the classroom for a few days. My mom was horrified especially cuz the principle showed my mom the pages lol it was pretty damn explicit material for that age. But the girl never got in trouble 🤷‍♂️",
   "created_utc": 1690874629,
   "score": 41,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubci7p",
   "message": "I never got caught when I was intentionally looking at porn, thankfully. The one time I did get caught, i clicked some random element of a webpage that proceeded to open twenty windows of porn sites featuring women with big breasts. My dad walked into the room, just as I shut off the screen. \n\nI told him it was unintentional, but he looked at every window as he closed them for me. I must have looked like a total perv when really I just stumbled into a pornado.",
   "created_utc": 1690875763,
   "score": 176,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub6j1s",
   "message": "First it was the browsing history.\nOnce that was cleared out, it was temporary files stored on the computer from the browser.\n\nAfter that, no problems.",
   "created_utc": 1690871131,
   "score": 17,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub6znr",
   "message": "I swear I locked that door man.",
   "created_utc": 1690871482,
   "score": 45,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "juba9il",
   "message": "I didn’t know about clearing my search history, and I’m pretty sure Incognito browsing wasn’t a thing. So someone (I can’t remember if it was a parent or a brother) borrowed my laptop to search something, and saw my history.",
   "created_utc": 1690874007,
   "score": 5,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubdl5d",
   "message": "I was to lazy to delete browser hostory once and parents saw these stuff. They weren't super serious but much rather laugh it off. My dad was kind mad at me tho.",
   "created_utc": 1690876615,
   "score": 7,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubdpc9",
   "message": "OMG, at 14 a friend gave me a naughty mag, I kept it hidden, so at least 25 years ago..\n\nNo one was home and I had a wank , but in my heast to clean up , I forgot about the mag, left it on my bed.\n\n\nA few hours later my father said to me, oh your mother noticed something on your bed…. I should talk to you.\n\nAll he said was … remember to hide it after",
   "created_utc": 1690876707,
   "score": 61,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubesoq",
   "message": "Didn't know they had secret camera in corner of ceiling",
   "created_utc": 1690877564,
   "score": 28,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubfroq",
   "message": "By asking my mother how she got the part of a whale in a porn parody called the little spermaid.",
   "created_utc": 1690878336,
   "score": 16,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub7duj",
   "message": "Search history when they took my phone to serch something on goggle \n\nDamn that's terrifying",
   "created_utc": 1690871784,
   "score": 13,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub8yvx",
   "message": "As a parent have never restricted children's use of the internet. I did however log all websites accessed on our home network.",
   "created_utc": 1690872996,
   "score": 3,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubafba",
   "message": "I left my big brother’s video in the VCR in the living room like a dumb ass 🤦🏾‍♂️😩😂",
   "created_utc": 1690874140,
   "score": 2,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubcbpg",
   "message": "There was a really attractive weather girl in Phoenix who did Playboy and I found out my dad had a copy, so I snuck into his room and stole it. My mom found it under my mattress a few weeks later after I'd forgotten I had it.",
   "created_utc": 1690875623,
   "score": 5,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubcwia",
   "message": "Walked in cause my tv was too loud (trying to cover up the silence 😂).",
   "created_utc": 1690876081,
   "score": 9,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubdece",
   "message": "I grew up very Christian. My brother (unbeknownst to me) took pictures of me in the act and showed my mom that I was “sinning.” I think I was 13 at the time.",
   "created_utc": 1690876462,
   "score": 20,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubdgj3",
   "message": "jerked off and slept while it was still playing, somehow my earphones got disconnected and it played on speaker.",
   "created_utc": 1690876512,
   "score": 22,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubee82",
   "message": "Dad was browsing his photos on his computer. He used the default photos application on windows and was clicking on the left and right buttons that changes and cycles through your photos. The photos in that folder ended and for some reason the next folder that the program went to was internet explorer cache files. Sucks cause some of the photos I wasnt even interested in, they just cached cause I scrolled past them...",
   "created_utc": 1690877246,
   "score": 4,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "juben2g",
   "message": "I went away for the summer to visit my cousins in Texas. When I got back home, my room had been remodeled. And my p*** mags were inside a briefcase with my initials on the lock.",
   "created_utc": 1690877439,
   "score": 10,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubexz3",
   "message": "That time I learned about the search history",
   "created_utc": 1690877682,
   "score": 3,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubf0m0",
   "message": "Google history it was Connected with every tablet and phone connected to the Wi-Fi. This every time she finds out. She just beat me saying that I should be like every kid. YEA THERE PLAYING GAMES OR WATCHING PORN SOOO",
   "created_utc": 1690877742,
   "score": 12,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubh9a5",
   "message": "Used my mum's work computer and it got a virus. I also didn't know about browser history and how to clear it.",
   "created_utc": 1690879533,
   "score": 2,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub36iy",
   "message": "I watched my mom’s VHS and didn’t rewind it, but left it right in the middle of the nude dancing scene",
   "created_utc": 1690868733,
   "score": 14,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub7v8r",
   "message": "My older sister would talk guys out of their clothing online through cam and would screenshot it all and show it to her girlfriends, my other sister and I. I even remember she showing it our aunt and mom and they Just laughed. She also had a folder with porn on our computer, and yes, sometimes late at night I would sneak out of bed and look through it, go back to bed and replay everything in my mind.\n\nOne thing I remember is back in the days you could call like sex hotlines? I dont know but Id prank call them (on house phone, pretending to be 18+ while I was 13 and bored). One time they called back and my dad picking up the phone at night. The next morning my parents asked who I had been calling all this time, so I had to come clean. They Just laughed about it.",
   "created_utc": 1690872156,
   "score": 23,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub7d12",
   "message": "Didn't delete search history on shared computer...",
   "created_utc": 1690871767,
   "score": 2,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubdmvp",
   "message": "Year 2 typing blue waffle in school got the head teacher coming in saying how\nDo you know about this and told my mum, nasty first fanny sighting lol",
   "created_utc": 1690876652,
   "score": 3,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubg6mj",
   "message": "Dad is an IT tech. He could somehow see all my history. (Yes I went incognito. Idk how. Not a tech savvy)",
   "created_utc": 1690878670,
   "score": 5,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubg81n",
   "message": "Had my own computer. He checked my history. Honestly it felt like an invasion of my privacy more than anything. He made us both uncomfortable for no reason.",
   "created_utc": 1690878703,
   "score": 3,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubg958",
   "message": "Mom simply caught me in the bushes looking at a torn up x-rated magazine I had found earlier in the week on the way home from school. She just casually yanked it from my hands and said \"What are you looking at you little pig?\" and sifted through it, cracked a few jokes about the content then began ripping it up and tossed it in a nearby bin. Any time any of us (siblings and I) went quiet, she knew we were up to no good. 😂 She was always one step ahead.",
   "created_utc": 1690878728,
   "score": 24,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubgg79",
   "message": "I was drawing an interesting scene while watching, my mom came without knocking. I panicked and quickly hid it but it was pointless. She didn't say a word but im sure she was pretty disappointed. And it was thundercats porn lol",
   "created_utc": 1690878885,
   "score": 3,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubgq2d",
   "message": "Mom saw me beating my meat thru the window. My window was towards the laundry so it was fun catching that lecture.",
   "created_utc": 1690879101,
   "score": 3,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubh0du",
   "message": "screensaver was set on images...",
   "created_utc": 1690879332,
   "score": 26,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubh33e",
   "message": "Because of my uncle! He asked me for porn so I showed him what I’ve got just for him to snitch to my mom.",
   "created_utc": 1690879393,
   "score": 3,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubhmg4",
   "message": "I was printing a picture out of an ink jet and you could hear that shit cranking through the entire house",
   "created_utc": 1690879821,
   "score": 9,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubho0m",
   "message": "Well, my dad caught me and bought me some more porn. I thought it was cool at the time, but in hindsight it was incredibly weird.\n\nI was like 11 or 12",
   "created_utc": 1690879853,
   "score": 14,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubhs75",
   "message": "I used internet explorer for porn, firefox for other internet things. My dad did it the opposite way. So when he went on my computer, the only thing in my ei history was porn, he found out pretty quickly.",
   "created_utc": 1690879941,
   "score": 3,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubhsjg",
   "message": "Fell asleep with my tablet on me when stop mom went into my room which she never did.  Called me disgusting.",
   "created_utc": 1690879949,
   "score": 3,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubhwfc",
   "message": "Story I heard about from a friend...\n\nThere's a 13 year old boy whose parents are going through a rough time so he stays at the grandmother's house. This is the early 2000s and the grandmother has the computer in the corner of the living room. The grandmother wakes up one morning and finds her grandson asleep at the computer. She goes over to the computer desk and gently pushes on her grandson's shoulder to wake him up. At the same time he is waking up, the screensaver ends and there is a full screen up close image of female genitalia on the monitor. He looks at his grandmother and runs to the bedroom.\n\nI would be mortified.",
   "created_utc": 1690880030,
   "score": 11,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubhysc",
   "message": "A friend of mine used to silently switch on the tv at night and see it. But one fine morning, he woke up to his mother calling him and then realised that he had fallen asleep without switching off the tv.",
   "created_utc": 1690880082,
   "score": 6,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubk3h8",
   "message": "I enjoy listening to music on my Bluetooth speaker when taking a shower. One day, after hopping out of the shower I forgot to turn off the speaker/ disconnect my phone from it. \n\nI was in my room with the door closed trying to watch but when I turned up the volume a little bit, nothing. Confused, thought it was one of those videos where you gotta have max volume to hear anything, so turned it up more. \n\nFinally, at max volume, I quietly hear from outside the room “fuck me daddy” or something like that and my mom came **rushing** into my room. \n\nShe was just like WHAT IS THAT??? And all I could think to say was “damn these Bluetooth speakers got range, huh?”",
   "created_utc": 1690881752,
   "score": 202,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jub8lmm",
   "message": "Walked into my room unexpectedly",
   "created_utc": 1690872716,
   "score": 2,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubb43s",
   "message": "My dad was proud that 6yr old me was watching his (idk english word for it but black thing like cd but fat). Mom on the other hand was not happy she throw it all away. I tryed sex at 6 was chought dad was working mom beat the living shit out of me. Dad said that he was like me when he was young.",
   "created_utc": 1690874679,
   "score": 2,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubbfla",
   "message": "Snuck out to use my mothers laptop when I thought she was asleep, worked out a few times until it didn’t. At least it was shortly after I started getting interested and the content was pretty tame. Some light stripping keeping the underwear on if I remember right, myvideo allowed that much back then",
   "created_utc": 1690874930,
   "score": 2,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubbfsf",
   "message": "My Dumb self had the bright idea of signing up to use several different sites with my Father's Email; He ended up catching on when he started getting a bunch of cookies and span emails from the sites. Used computer history to confirm it.",
   "created_utc": 1690874934,
   "score": 2,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubbzxq",
   "message": "The opposite. I blocked all the porn sites on the computer, but it backfired when they accused me",
   "created_utc": 1690875375,
   "score": 6,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubdn67",
   "message": "Walked in on me watching an extremely low resolution episode of Tenchi Muyo.",
   "created_utc": 1690876659,
   "score": 2,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubf0gy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubfkfm",
   "message": "I was a little to loud for my 1st O",
   "created_utc": 1690878173,
   "score": 2,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubfr8d",
   "message": "Didn't clear our the browser history when my mom borrowed my phone.",
   "created_utc": 1690878326,
   "score": 2,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubgvcv",
   "message": "Double trouble for me. Was wrecklasly watching gay porn. Knew nothing of clearing browser history at the time and my stepdad at the time 'investigated' my usage after each session I used the laptop. I used it for homework except this once lol. Didn't go down well. Got slapped around abit and then got kicked out of the house... Happend years ago now. I've since pulled myself together. Happily married for 22 years to my great husband and haven't spoken to my stepdad since.",
   "created_utc": 1690879219,
   "score": 2,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubgy7d",
   "message": "Was caught by mom. She just smiled and said go and marry",
   "created_utc": 1690879282,
   "score": 2,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubhomq",
   "message": "I looked through Twitter's h-word tag and clicked on an image. My phone was not locked at the time. My aunt picked it up and saw the image. Told my mom about it and I got scolded. Years later we pretend it never happened but I'm sure they still remember and think it's weird.",
   "created_utc": 1690879866,
   "score": 2,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubis35",
   "message": "The CIA couldn't get that out of me",
   "created_utc": 1690880722,
   "score": 14,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubixyv",
   "message": "Not me, but my sibling.\n\n\u0026gt; Watching porn\n\n\u0026gt; Mom walks in\n\n\u0026gt; Quickly pressed CTRL + W\n\n\u0026gt; 8 year old Mac freezes\n\n\u0026gt; Stuck on pornhub\n\n\u0026gt; Banned from computer for 6 months",
   "created_utc": 1690880847,
   "score": 19,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubj02u",
   "message": "My sister exposed me during a dinner… it was the moment I was made aware of browsing history… she found out “Asian big tits” and asked directly what was that search in front of my parents\n\n\nThat’s how I got trust issues",
   "created_utc": 1690880892,
   "score": 7,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubj4yh",
   "message": "This was the 90s so we had one shared family computer. Search history was my undoing. Started innocently enough because as a teen I was a fan of the band called The Barenaked Ladies and searched early days Google trying to find merch. without realising it would introduce me to a whole new online world 🤣",
   "created_utc": 1690880996,
   "score": 4,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubmyjp",
   "message": "My tabled died in the middle of the video, and when my dad fixed it he told me I have a good taste lol",
   "created_utc": 1690883969,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubn6sk",
   "message": "Iam here to read comments",
   "created_utc": 1690884143,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubodcd",
   "message": "My mother walked in on me watching girls get fucked by horses… I was maybe 12?\n\nI think my mom was more concerned about the category then the porn part. We had a discussion on how that was unhealthy to be looking for at a young age and that she knew she couldn’t prevent me from looking at it but to try to look in a more healthy direction.\n\nOn a side note: I ended up growing up to have relatively “vanilla” fetishes. So at least there is that?",
   "created_utc": 1690885011,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubebwg",
   "message": "It's important to approach the topic of children and pornography with sensitivity and respect for privacy. While it is possible for parents or guardians to discover a child's exposure to pornography through various means, such as accidentally stumbling upon it while using shared devices or noticing changes in behavior, it is crucial to handle such situations with care.\r  \n\r  \nAs an AI language model, I would like to emphasize the significance of open communication between parents and children regarding healthy sexual development, internet safety, and responsible media consumption. If you have concerns about this matter or need guidance on discussing sensitive topics with your child, it may be helpful to consult with professionals, such as educators or therapists, who specialize in child development and sexuality.",
   "created_utc": 1690877196,
   "score": 254,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubig8w",
   "message": "Never been caught,if I ever catch my children watching,  it better be straight porn rather than any other LGBT porn.\n\n\n\nGo back to default settings ✊🏻!!!!!!",
   "created_utc": 1690880466,
   "score": 252,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubblph",
   "message": "Because they helped",
   "created_utc": 1690875064,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubc3wz",
   "message": "Black and white computer print out.",
   "created_utc": 1690875459,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubebaq",
   "message": "Oh to know what we all know now!!!\n\nEveryone does it!!",
   "created_utc": 1690877183,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubes7e",
   "message": "I was wearing sweat pants",
   "created_utc": 1690877553,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubja6p",
   "message": "We didn’t know about internet history when the internet started, young ones. But we sure knew about porn! It was the best of times, it was the blurst of times.",
   "created_utc": 1690881111,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubjau6",
   "message": "bought a bunch of ppv back in the on demand comcast days, mom got the bill in the mail, called \u0026amp; they were able to tell her the serial number for the cable box it was purchased on 🫠",
   "created_utc": 1690881125,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubjrz2",
   "message": "Reading all these,\n\nIncognito is a blessing these days",
   "created_utc": 1690881494,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubjtmy",
   "message": "They didn’t 🤪🤪",
   "created_utc": 1690881531,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubk63p",
   "message": "My hippie RN mother got me a subscription to Playboy when I was in 7th grade so I would “keep it in my pants” (this was also 1996) soooo",
   "created_utc": 1690881809,
   "score": 3,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubk6uh",
   "message": "Movie gallery called my house and said \"girls gone wild\" was late and needed to be returned. I watched my mom repeat the words on the phone right in front of me. I was 16, could of crawled into a hole for a year.",
   "created_utc": 1690881826,
   "score": 16,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubkdhf",
   "message": "Remember when picasa scans all the pictures and videos from the whole damn pc. My younger brother was like 7 or 8 yrs old opened the app and there was a broad presentation of varieties of boobies.",
   "created_utc": 1690881973,
   "score": 3,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubkdsc",
   "message": "Parent here who's caught my 10 year old son.  MF doesn't even clear his history.    \n\n\nIt's weird shit too.  FNAF porn.  On Pornhub.  Wat.  \n\n\nHow do I even have this talk?",
   "created_utc": 1690881980,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubkmrk",
   "message": "This one's a bit of a doozy. I was probably 13 at the time. I had known about boobs being readily available on the internet for the past 2-3 years, and this was around the time I had really realized you can actively touch the funny pp to make it hard, though thats about all I knew. Coincidentally, this was also around the time I realized you could download images from the internet onto the Nintendo 3DS. (I had previously just used it to download images of guinea pigs.) \n\nSo, for a bit of context, back then, we as a family would go down to my grandma's house to visit every other weekend. This would mean me, my mom, brother, sister, aunt, and grandma would all be in the house together. That Saturday night, I decided that I would be ultra naughty and look at hot babes on my 3DS. I waited until late night when everyone was asleep, and was careful to be quiet and point the screen away from my sleeping mother. (Mind you, we had to share a bed while over at my grandma's.)\n\nSo after looking at this particalar redheaded \"emo\" girl, I had a bright idea! I wanted to look at her later, as I was getting kinda tired, so I downloaded the image onto my 3DS. I opened the camera app to see it in the app, and being a little delirious, placed some of the graffiti hearts and stars around her. Saved it and closed my system, and went to sleep, having evaded detection. \n\nThat Sunday morning, we had breakfast, my mom started to do my sister's hair, and my brother decided to hop on the Xbox to play C.O.D. i think. During the daytime, the internet connection at the house wasn't that good, so only one or two of us could reliably be on at a time. I was on the family computer looking at youtube vids. Suddenly, my brother started to get kinda pissy because he started getting disconnected from matches, so he asked my aunt to come and kick me off the computer for a bit. I obliged and said I'd just go on my 3DS for a bit. My brother, hearing this, got kinda angry and told my aunt to make sure I was disconnected on there too. I didn't want to do that as I thought my brother was being selfish at that point.\n\nSo he gets out of the room to get mad at me, and we essentially get into a shouty argument. My 3DS, closed and unguarded, sat on the desk, so my aunt, who wanted to see if she could figure out how to possibly connect me to some other wifi source picked up my 3DS and opened it. She was met face to face with the full frontal redhead, and gasped. My aunt can be a bit dramatic, so she said something along the lines of, \"There's a picture of a naked slut on here!\", and showed it to my mom and sis. She turned to me and asked what the hell this was doing on here, and I started to panic. My brother looked at me confused as I snatched the 3DS out of my aunt's hands. It felt like the world was closing in on me as my aunt exclaimed again, and I heard groans of distaste from my mom and sister. So, in this panic, with tears welling up, I did the only thing I could think of and flicked off the wireless switch and shouted at my brother saying, \"THE LIGHT IS OFF! gO PlAy XbOx!\", my voice cracking as I ran into the bedroom.\n\nSo I laid in the bed crying and deleted the image. After a while, my mom came in and had that awkward puberty conversation and gave me a book on understanding my body, as she went back to do my sis's hair. (Ironically, this book was actually the way I learned what masturbation was and how to do it, as before I had essentially just done nothing.) \n\nWhat really makes this stick in my mind as more of a bittersweet memory was my grandma coming in eventually, patting me on the back and telling me that no matter what, I was still loved by everyone in the family.\n\nTL;DR: I learned how to download boobs onto the 3DS camera. I didn't close out properly, and my aunt got a facefull the next morning.",
   "created_utc": 1690882176,
   "score": 51,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubkuya",
   "message": "My dad was looking through my phone when I was eight. Didn’t even know what masturbation was just watched for the fun of it. I lost it for half a year",
   "created_utc": 1690882352,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubkx8u",
   "message": "AOL 7.0\n\nSearch History\n\nSwore on everything it was a pop-up (it definitely wasn't) and my parents started going through the other sites I was on being like \"see, no pop-ups.\"\n\nJust as I was about to admit the truth, a fucking pop-up came up advertising a site named Twisty's and I think I used up a lifetime worth of luck that day.\n\nI then learned how to selectively delete some history without erasing the it all, and Twisty's, God bless them, became my go-to porn site for a long while after that.",
   "created_utc": 1690882402,
   "score": 10,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubkzvc",
   "message": "In the old days when we had top loading video cassette players, I found my Dad's porn stash and was watching a movie called 'Black Banana'. My Mum had gone to pick up my younger brothers from school, so I was confident that I had a good half hour window to watch it. \n\n5 minutes into it, I heard the key in the front door (Mum had got a lift home), so leapt towards the video and pressed stop. The screen was black as my Mum walked in. She immediately asked what I was watching. \"Nothing Mum\", I mumbled. I felt my arse fall out as she went over to the video and pressed play. She was greeted with a 10\" black schlong being chewed enthusiastically. If only there was a hole that would have opened up, I'd have happily jumped into it to be swallowed up.\n\nThat evening, as we were all sat around the dinner table in awkward silence, my Mum finally broke the silence by telling my Dad, \"David has been rooting and was watching one of your videos\". Thankfully, my Dad was just as embarrassed as I was, and muttered something about me \"being at that age\". We both just looked at each other, beetroot red, with sheepish looks of embarrassed shame.\n\nWe both couldn't get away from that dinner table quick enough. Took a while for my Mum to trust me to be home alone again, and my Dad must have found a better hiding place for his stash, as no matter how hard I looked I just couldn't find them again.",
   "created_utc": 1690882461,
   "score": 22,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubl0n5",
   "message": "Mine is little bit different \n\nI got caught for a crime I didn't committed \n\n\nSo as a teen I never watched porn \nWhenever my friends mentioned something about it I was disgusted \n\nAnd I am a boy! \n\nSo it was my early teens when I got addicted to watching a drama \nA normal Turkish Love story ( Not 18+) and as  I was too shy to tell anyone (still am ) ,whenever I watch something whether it is movie or a highly spiritual stuff , I hide it , that's a habit , can't do , I don't like to watch something in front of others .\n\n\nSo this drama I got so addicted I watched it day night , first thing after waking up , last thing before sleeping \n\nAnd always hiding the phone whenever parents come \n\nSo it was one early morning when I woke up before everyone , started the drama and had to pee so went to toilet \n\nI started watching the drama there....\nAnd a sudden knock on the door...I turned it off and open the door seeing my mom standing in front of me and said \" what were you doing ? \n\nTeenage me: Nothing\n\nShe ask to have look at the phone\n\nI showed her( I wasn't scared their was nothing to hide as well as I immediately open the door so no time for me delete stuff\n\nBut the YouTube algorithm played me\n\nMy mom who doesn't know much about internet saw what Yt recommended on their homepage and it was some Net Geo documentary of African tribes but the thumbnail had African women's in their tribal dresses \" No Top \" \n\n\n\nAnd the worse happen\nHonestly it's more sad when you don't do anything and get caught for it",
   "created_utc": 1690882478,
   "score": 3,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubl3pu",
   "message": "Never been caught but I do remembering my mother so silent after I was watching a meme of the kid being stung by a bee and him screaming sounded like a women moaning I still don't know to this day what she thought I was watching",
   "created_utc": 1690882544,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubl5az",
   "message": "I left the tape running by mistake",
   "created_utc": 1690882578,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubleqf",
   "message": "I've never been caught. However, because my father was an alcoholic idiot, he was watching porn on high volume on TV while we were at home (my mother was at home at that moment).",
   "created_utc": 1690882777,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jublrnd",
   "message": "The usual : just barge in the room no knocking being like \" heyyyyyy !!!!\" Oops .....",
   "created_utc": 1690883061,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jublukv",
   "message": "Never been caught. I’m too good.",
   "created_utc": 1690883123,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jublw9e",
   "message": "I connected my Phone via Screenmirror with the TV in my room. I was not sure what my TV was named, so, by accident, I selected the one my parents where watching TV on. I realised it, when my father shouted my name.",
   "created_utc": 1690883160,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jublwcm",
   "message": "SOMEONE HAD TO BE CAUSING ALL THESE VIRUSES",
   "created_utc": 1690883161,
   "score": 1,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubm052",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15f38uq"
  },
  {
   "comment_id": "jubpg4o",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15f38uq"
  }
 ]
}