{
 "submission_id": "15fa4pl",
 "title": "What’s the worst physical pain you ever felt?",
 "selftext": "",
 "created_utc": 1690890161,
 "permalink": "/r/AskReddit/comments/15fa4pl/whats_the_worst_physical_pain_you_ever_felt/",
 "score": 19,
 "url": "https://www.reddit.com/r/AskReddit/comments/15fa4pl/whats_the_worst_physical_pain_you_ever_felt/",
 "comments": [
  {
   "comment_id": "jubwi7s",
   "message": "Kidney stones and it’s not close\n\n\nEdit:  hijacking my own comment because people are asking about prevention: drink more water than you do now. Just hydrate, hydrate, hydrate.",
   "created_utc": 1690890264,
   "score": 198,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jubz8w8",
   "message": "Abscessed tooth.\n\nBut wait, let me finish.\n\nAbscessed tooth after the dentist removed the wrong tooth, the one next to the abscessed tooth, on the way home when the local wore off.  \n\n\nEDIT: By far my most popular comment over, damn. Thanks!  \n\n\nSo, a lot of people asking about lawsuits. Unfortunately, that was not an option. This was a low-income state-sponsored thing that the dentists volunteered for, and part of getting them to volunteer was a no-liability thing. Plus at the time I kind of figured I'd probably explained which tooth wrong rather than him just pulling the wrong one. I'm guessing I probably could have held the state liable, but at the time I was much younger and not very savvy, so I never pursued it.  \n\n\nI've noted a couple of people say that kidney stones are more painful than abscessed teeth. Now I've had kidney stones, and I'm guessing you didn't let me finish:P Also, abscessed teeth can vary in pain intensity, as can kidney stones.  \n\n\nAnyways, I can't keep up with all the replies to save my life, but I appreciate the discussion from everyone!",
   "created_utc": 1690891780,
   "score": 221,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc0l11",
   "message": "Pilonidal Cyst (right on your tailbone) from snowboarding and then having to sit on a four hour flight.  Doesn’t sound like much, but if you’ve had one, sitting upright was hell",
   "created_utc": 1690892484,
   "score": 120,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc4twx",
   "message": "Testicular torsion. I was seventeen and didn't know what it was (thought it might be blue balls?) so waited until it was the size of a grapefruit and in excruciating pain and had mom take me to the ER.\n\nHalf my testicle was dead but I got a Demerol drip and all was good after that, but oh boy, that pain was significantly worse than the kidney stones.\n\nEdit.  Wow, didn’t realize there were so many members of the Twisted Nut Club!  Like I said, mine happened at 17 and wasn’t addressed until day three.  At that point I couldnt sit down or drive due to the MASSIVE NUT that WS preventing me from closing my legs. \n\nAnyhow much of the tissue (organ?) was not savable so the surgeon had to remove a fair amount.   Now I’ve got some testicle left and also a whole bunch of scar tissue.  It’s gross and I had low sperm count for awhile, but now I’ve got two kids so 🤷‍♂️\n\nGood thing is when they opened me up the doc said he’d “lasso” the other testicle (my right one in this case) to the side so it wouldnt face the same fate as the dead left nut. \n\nBut guess what? Two years later I woke up one morning and felt a familiar pain. I was boarding a plane that morning but I knew WTF was going on so I called ahead and had it operated on later that day.  I probably shoulda sued the original surgeon for testicular negligence but I never pursued it.  Meh.  \n\nYears later, (about 10 years ago now) my wife and I headed down the coast so I could race a 50k in SLO. Woke up w what I thought were butterflies and went thru the whole process.  Ended up barfing and passing out and my wife drove me (gingerly but still painfully!) to the ER where they looked at me and said “we’ll he’s either in labor or he has a kidney stone.”  Yep, a hefty 3mm stone lodged in my ureter. That sh’t was painful but still nothing comparedto the twisted nut.\n\nEdit 2 Typis",
   "created_utc": 1690894538,
   "score": 96,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucc2io",
   "message": "Opened up a pressure cooker while it was still on the stove back in the 90's... 40% of skin surface burned and my heart is now shit on a stick",
   "created_utc": 1690897744,
   "score": 35,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc2gvq",
   "message": "Shingles and cervical spinal stenosis.",
   "created_utc": 1690893422,
   "score": 247,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucatyl",
   "message": "Gout. I thought lovingly about removing my foot with a hacksaw.",
   "created_utc": 1690897222,
   "score": 241,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc9pt8",
   "message": "Ovarian torsion from a giant cyst. Worse than a broken neck and childbirth.",
   "created_utc": 1690896743,
   "score": 244,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc51so",
   "message": "Sneezed and herniated a disc in my back. Couldn’t walk for five days. This was almost two months ago and I can still barely stand for longer than five minutes at a time.\n\nEdit to add: after reading some of the replys to my comment, I am one of the lucky ones apparently. I feel bad for all of you and sorry but, I hope I don’t have this problem as long as all of you have",
   "created_utc": 1690894641,
   "score": 42,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc7dns",
   "message": "Gallbladder attacks.",
   "created_utc": 1690895710,
   "score": 216,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucuzon",
   "message": "Hockey puck at 80km/hour vs my right testicle. Resulting in a testicular rupture and a surgery 2 days later and didn't lose it either.",
   "created_utc": 1690905191,
   "score": 50,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucbf0d",
   "message": "Stepping on a string ray. And I've given birth before.",
   "created_utc": 1690897476,
   "score": 101,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juclenq",
   "message": "A wasp once got trapped under my eyelid whilst I was out walking, not sure how many times it stung me but it was horrific. Pretty much shut me down for an hour.",
   "created_utc": 1690901512,
   "score": 198,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc6lkb",
   "message": "Trigeminal Neuralgia. Excruciating stabbing pains triggered by any and everything. You can’t touch your face, brush your teeth, eat, kiss, lay on your side - nothing involving your mouth. It’s like a relentless ice pick stabbing you or a million electric shocks. Sooner or later, you will want to die. That’s why they call it suicide disease.",
   "created_utc": 1690895358,
   "score": 27,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jubwz0n",
   "message": "Pleurisy . Pain in lungs, hit to stand up. Lay down, sit, it did not matter",
   "created_utc": 1690890529,
   "score": 31,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc64xq",
   "message": "I woke up during my first wisdom tooth surgery to the dentist drilling the teeth but still couldnt move. I managed to make a noise when she started scraping out the tooth chips. Turns out she didnt have anesthesia and used a high dose of vicodin iv and i had a high tolerance for pain meds because of recreational use with my buddies. I remember her finally noticing and looking into my eyes and her face just went pale and she looked so scared i cant imagine what i must have looked like.",
   "created_utc": 1690895149,
   "score": 156,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc2anf",
   "message": "Decided to take about a dozen NoDOz because someone online said it would feel like cocaine. I spent the night with my head crammed into the corner of a room because I could have sworn the swelling in my brain was going to crack my skull open.",
   "created_utc": 1690893340,
   "score": 80,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucg05l",
   "message": "Appendicitis",
   "created_utc": 1690899370,
   "score": 157,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucino6",
   "message": "IUD insertion hurt worse than my miscarriages and one of those came with an infection",
   "created_utc": 1690900436,
   "score": 154,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jubxhv1",
   "message": "Had my wisdom teeth cut out. Half way through one tooth the medicine wore off. They couldn't renumb it as it was halfway hanging out of my mouth. So I felt everything as they finished removing my wisdom tooth.",
   "created_utc": 1690890816,
   "score": 231,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucfucx",
   "message": "Ovarian cyst. Apparently that stuff can kill you, and I've only had it twice ever, but it's worse than anything else I've ever dealt with, and I am not a clever gal, so I've dealt with my share of pain.",
   "created_utc": 1690899303,
   "score": 149,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc55hs",
   "message": "Most recently, swollen and clogged milk ducts.",
   "created_utc": 1690894689,
   "score": 145,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc18am",
   "message": "Cluster headaches and migraine",
   "created_utc": 1690892806,
   "score": 3,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc1ayl",
   "message": "Shingles",
   "created_utc": 1690892843,
   "score": 122,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc58fz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc2jy6",
   "message": "A combination of kidney stones + kidney infection +  septic shock + kidney stents placed incorrectly. Boy, was that a hell of a time. I ended up having 3 surgeries in 3 months for that nonsense, and I was in hospital almost the entire time.",
   "created_utc": 1690893463,
   "score": 16,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jud2rlw",
   "message": "Period cramps that I had at age 16-17. They were worse than giving birth, appendicitis and kidney stones. The pain would cause me to faint while sitting down in school and I once had a set of cramps so brutal that I was screaming at the top of my lungs in excruciating pain literally thinking I was going to die. It felt like my lower stomach was on fire, being stabbed, kicked and twisted repeatedly while being stung by a million wasps. My dad was there and this is one of 2 times I’ve ever seen him cry or show fear.",
   "created_utc": 1690908121,
   "score": 24,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc37u8",
   "message": "Burst eardrum, worse than a broken collar bone",
   "created_utc": 1690893782,
   "score": 238,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juca1wc",
   "message": "I can’t remember which was worse. I think the second to the worse was the hip pain being very along pregnant with twins and the very worse was recovering from brain surgery when they wouldn’t give me anymore pain meds. I’ll never go through either of those ever again.",
   "created_utc": 1690896895,
   "score": 71,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucnavh",
   "message": "Diverticulitis flare with a perforated colon. Imagine the feeling of diarrhea. Then imagine that in addition to a searing hot knife being pushed from the inside out. Fucking brutal.",
   "created_utc": 1690902252,
   "score": 154,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucc0qf",
   "message": "When my dad passed away a couple months ago, my heart and chest hurt so much. It was unbearable. Haven’t felt pain ever since.",
   "created_utc": 1690897724,
   "score": 13,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc3g96",
   "message": "Childbirth (traumatic labour) and my hernia repair operation.",
   "created_utc": 1690893894,
   "score": 54,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juciv0l",
   "message": "Tooth abscess, horribly painful, not as stuff like kidney stones but it usually lasts longer and you can basically do nothing to make it pass until the antibiotic takes effect. I almost destroyed my stomach with anti-pain and it didn't do shit, I hated it. After some days the abscess finally broke and it was the most relieving and disgusting feeling at the same time: blood and pus all over the mouth, but the pain stopped\n\nEDIT just to explain further: the dentist told me that he couldn't extract the tooth till the infection was over, I had Quaigmire-tier jaw for some days",
   "created_utc": 1690900519,
   "score": 108,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc3gm5",
   "message": "2nd degree sun burn and the healing was the worst part. Like a thousand electrical shocks per minute I couldn’t itch away. Hell.",
   "created_utc": 1690893899,
   "score": 20,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc3ko7",
   "message": "Stomach cramp I had once.  So bad I blacked out",
   "created_utc": 1690893954,
   "score": 44,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucvdou",
   "message": "I had a pulmonary embolism and I would say that was both the worst pain and the scariest pain I’ve experienced",
   "created_utc": 1690905336,
   "score": 73,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc5qh5",
   "message": "Currently in the process of a big ass bump right above my groin (the pouch area) and it hurts to even move. Should probably get it looked at. Edit After The Fact: Thank you all for the suggestions and concerns. Thankfully, it is not a hernia or a burst appendix. Just an abscess from ingrown hair after shaving the area down under and my pouch area. Seems I was a bit careless in cleaning the clippers/after-care of said pouch area. Currently waiting to get drained of the bastard, and since I've been through this before, I'm not 100% looking forward to it. But it's better than suffering.",
   "created_utc": 1690894964,
   "score": 85,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucn6j1",
   "message": "Get my IUD put in and taken out. I love my IUD and am on my second one, but it is ridiculous that the doctor didn't put me on some kind of pain meds. I'm glad more people are talking about the pain and advocating for pain management options. \n\nThe pain only lasted a few seconds, but I almost passed out getting my new IUD put in a few years ago. I'm heavily tattooed in painful spots and have several piercings. I have a high pain tolerance, and that IUD nearly took me out.",
   "created_utc": 1690902203,
   "score": 250,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jud2nzr",
   "message": "I have endometriosis, so that's pretty bad. I ignored kidney stones because I thought they were just kind of moderate cramps. I ended up getting a UTI from passing the stones or something? And ignored that, too, because urinary issues are common with endo. The infection spread to my kidneys and I had to be hospitalized. That kind of sucked. \n\nI also have this left sided pain. Not sure if it is my stomach or my spleen. Hurts so badly sometimes want to curl into a fetal position while also removing my flesh lmao",
   "created_utc": 1690908082,
   "score": 228,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc4k0d",
   "message": "Double dislocated shoulders.",
   "created_utc": 1690894408,
   "score": 70,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc7fqf",
   "message": "Close call between kidney stones and gallbladder.",
   "created_utc": 1690895737,
   "score": 75,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucaes1",
   "message": "Ear infection, and I have herniated discs that leave me in crippling pain every day.",
   "created_utc": 1690897045,
   "score": 70,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juc3e43",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucwg5j",
   "message": "Getting an IUD inserted - I had just turned 20 and never had kids (still haven't) and it felt like my cervix was being gutted with a knife. Then the worst cramps of my entire life came instantly and didn't stop for a couple months. On the bright side I didn't have to deal with hardly any periods for the next 5 years - it was like I got all the cramping pain of the up coming 5 years consolidated into a couple months as a trade off to no periods for 5 years. Having no periods was nice, but the pain was not worth it and I did not get another one.",
   "created_utc": 1690905741,
   "score": 16,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucbc1z",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucio4v",
   "message": "Doc pulled my tooth (after 8(!!!) Injections of anasthetics). I felt everything. He removed the nerve. Then scraped the inflamed jaw bone under the tooth with some metal thing. \nI couldn't stop crying.",
   "created_utc": 1690900441,
   "score": 33,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucw34x",
   "message": "1st pregnancy: When the epidural wore off during the emergency C-section. My husband confirmed that my guts were outside of me when that happened. I screamed and they figured out what was happening when I tried to reach my guts. There is a reason they strap down your arms during a C-section. \n\n\nOr\n\n2nd pregnancy: carpal tunnel syndrome, which right after that C-section was so bad that none of the post-op drugs eased the pain, and I couldn't lift my baby to latch her on to breastfeed. A nurse had to prop baby in place. I don't remember ANY pain from the C-section at all.",
   "created_utc": 1690905603,
   "score": 90,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucbwvk",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jud80ke",
   "message": "Endometriosis. I’ve had kidney stones, and the pain of Endo has been insurmountably worse.",
   "created_utc": 1690910071,
   "score": 71,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "judoloe",
   "message": "I was in a fire 13 years ago.   I spent 2 weeks in a chemical coma, 3 or 4 surgeries (I think it was 4 but…).  I had 14% of my body re-skinned.    In the burn unit for a mint and 8.5 months of rehab.",
   "created_utc": 1690916224,
   "score": 93,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "juct2ri",
   "message": "Severe withdrawals",
   "created_utc": 1690904471,
   "score": 54,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "judwepr",
   "message": "Necrotizing pancreatitis. Basically, my pancreas burst, and the enzymes that usually digest the food in my stomach instead started digesting me. I was eating myself from the inside out. The pain is indescribable. It took a month long stay in ICU (during which time I died three times from the sepsis) followed by three months in a hospital bed. I lost over half of my body weight, had to relearn how to walk, talk and eat. It's been nearly two years and I'm finally off my pain meds and just about recovered, but I'll never be the same again.",
   "created_utc": 1690919144,
   "score": 52,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jue6m3n",
   "message": "Might sound stupid next to all of those other comments, but the pain I felt in my heart when I saw my father laying dead on the ground in our kitchen. Broke my arm before and that was nothing compared to that",
   "created_utc": 1690922903,
   "score": 44,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jucqe3c",
   "message": "A lot of women/girls will understand this one but period cramps. i’m not usually one to get horrific period cramps: they’re usually bad but not unbearable. well i was at school one time and i was sitting in my class in excruciating pain, sitting in my lesson in tears where i had to go to the matron (school nurse) and she gave me some water and a sick bowl. after about 45 minutes she sent me back to class but i was in so much pain i had no choice but to beg to go home: she didn’t let me. i went to my next class and again, burst into floods of tears since it was just so unbearable when my teacher advised me to visit the matron again, still not being allowed home. in the end i went to my head of year where she called the matron telling her i was to be sent home since i’ve never been like this in my 5 years of being at that school, meaning it was so strange for me to be in such amount of tears that she was quite concerned for me. i’ve never been in such pain in my life and i would never wish the way i felt that day on anyone.",
   "created_utc": 1690903450,
   "score": 43,
   "submission_id": "15fa4pl"
  },
  {
   "comment_id": "jud1dn5",
   "message": "Getting my iud inserted. Can’t explain that pain, it gives me shivers every time I think about it",
   "created_utc": 1690907598,
   "score": 39,
   "submission_id": "15fa4pl"
  }
 ]
}