{
 "submission_id": "15fauow",
 "title": "Would you agree to support a mandatory retirement age of 75 for US House, US Senate \u0026amp; US Supreme Court Justices and if not why?",
 "selftext": "",
 "created_utc": 1690892042,
 "permalink": "/r/AskReddit/comments/15fauow/would_you_agree_to_support_a_mandatory_retirement/",
 "score": 24,
 "url": "https://www.reddit.com/r/AskReddit/comments/15fauow/would_you_agree_to_support_a_mandatory_retirement/",
 "comments": [
  {
   "comment_id": "jubztzv",
   "message": "Yes. We have age minimums. We need maximum age limits these people are making decisions for a future they won't be involved in.",
   "created_utc": 1690892091,
   "score": 27,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc00rh",
   "message": "I am 82 years old. Personally, I feel that anyone my age who still gets off on power needs to be kept away from normal people. But to the point of this post, the world has been run by old people since the beginning of our species, and just look at the place!\r  \n\r  \nYes, if you were intelligent to begin with your wisdom and common sense will increase with age, but so will your cynicism. If you were a young jackass, you will become an old jackass — and a hide-bound prejudiced old jackass at that.\r  \n\r  \nGive them a nice pension at 70, with the condition that if they mess with politics or government again they lose the pension.",
   "created_utc": 1690892190,
   "score": 25,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jubzu3t",
   "message": "No. Should be younger.",
   "created_utc": 1690892092,
   "score": 22,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc1mts",
   "message": "For any position, in any industry, a person should re-qualify through a cognitive test at 70, 75, again at 77, and at 80, with voluntary retirement at any time, and required retirement (with full benefits) by 80.  \n\nI also believe persons should be re-tested for driving at 70, 72, and every year after for driving, with required revocation at 80 (but are provided free transport services).",
   "created_utc": 1690893009,
   "score": 9,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc2yi3",
   "message": "I'd support an age limit at 80.  If your term would run past your 80th birthday you're no longer eligible.  \n\nI think you can be sharp past 80, but the odds aren't in your favor.  I'd hate to lose all that experience, but I'd like to turn the elected officials over more.  I think this should apply to every elected position, and every federal post.",
   "created_utc": 1690893657,
   "score": 5,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jucap9b",
   "message": "Follow the social security guidelines. 67 and your ass is out the door!",
   "created_utc": 1690897167,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc044b",
   "message": "Supreme court justices should just have fixed terms, I don't care about maximum or minimum ages.\n\nNo for elected politicians, people still seem to prefer older politicians, just vote younger people instead.",
   "created_utc": 1690892239,
   "score": 7,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc54za",
   "message": "I'm confused why the US would need max age limits, while in other countries they don't. What is it that stops an old politician retiring?\n\nMoney? Do you think politicians in other countries don't make money?",
   "created_utc": 1690894683,
   "score": 2,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc6l29",
   "message": "Sure.\n\nThe big problem, though, is that the only way to implement this is to get those septuagenarians in the Senate and House to pass a law to make it happen. And they're not going to pass a law that kicks them out of power.\n\nI would also note that none of the current Supreme Court Justices are over 75. The oldest, Thomas, is 74. And only 1 other, Alito, is over 70. More than half the Court (5 Justices) are under the traditional retirement age of 65.",
   "created_utc": 1690895352,
   "score": 2,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc9ryl",
   "message": "We should have term limits for these biggest positions, whether elected or Senate confirmed. Guess who's not voting for age or term limits, though? \n\nNobody on the current Supreme Court is *really* old, which ironically is the real problem, and is a symptom of the overall problem. Everyone's figured out that selecting judges and justices in their 40s and 50s is the best move, as then you get 30-40 years in that seat.",
   "created_utc": 1690896771,
   "score": 2,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juccpe9",
   "message": "No, it should be lower.",
   "created_utc": 1690898007,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc0aho",
   "message": "Yes, we need people who are in good mental shape to lead the country, and at around that age cognitive decline becomes more noticeable in many people",
   "created_utc": 1690892332,
   "score": 2,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc4nxi",
   "message": "I'd probably make it eighty since these days, there are plenty of healthy, sharp seventy-five-year-olds, but I'd definitely take it as a compromise.",
   "created_utc": 1690894459,
   "score": 2,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc5x2o",
   "message": "I’d much prefer term limits over some arbitrary age limit that doesn’t really accomplish anything except discriminate on old people.",
   "created_utc": 1690895049,
   "score": 2,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc6qny",
   "message": "people keep coming up with these ridiculous limits and rules when the obvious answer is just dont vote them in",
   "created_utc": 1690895421,
   "score": 2,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc1ulz",
   "message": "Make it 60 or 65 and we got a deal.",
   "created_utc": 1690893119,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc4dcb",
   "message": "Definitely not in the house or senate.  Those are elected positions.  People can decide if they want the person to continue or not.\n\nSupreme Court is a trickier one.",
   "created_utc": 1690894321,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc4irb",
   "message": "I’d rather have a cognitive test.  Some folks are still sharp as a tack at 85 and some are dumb as a rock at 70",
   "created_utc": 1690894392,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc4uf2",
   "message": "No.\n\nAge limits take power away from voters. Do your fucking jobs and vote. Stop making up rules to absolve yourselves of responsibility.\n\nAs for SCOTUS, I’d be in favor of a fixed 10-year term with possible reappointment.",
   "created_utc": 1690894545,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc93m6",
   "message": "And who is going to make this law?\n\nThe same old people you want out?\n\nVote for younger people then…\n\nWomen “earned” (I don’t know a better word) the right to vote, so did African Americans, they didn’t do it by sitting home and hoping someone else would do it. They actively lobbied and got people on their side.\n\nIf you want younger people you have to vote for them…every younger person but most stay home and the seniors who have nothing better to do keep getting the same people elected",
   "created_utc": 1690896474,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc3988",
   "message": "Nah just do a civics and/or cognitive test each year instead. Age is just a number after all and some septuagenarians and octogenarians are sharp while others are dull.",
   "created_utc": 1690893801,
   "score": 255,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc4u6q",
   "message": "Make it 60.\nI fell for the age=experience=good.\nI’m done.",
   "created_utc": 1690894542,
   "score": 0,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc60fn",
   "message": "no, what if trump wants to be senator",
   "created_utc": 1690895092,
   "score": 0,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc6k8r",
   "message": "Why do you hate democracy?",
   "created_utc": 1690895342,
   "score": 0,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jucatxx",
   "message": "No, I pretty much oppose all attempts to limit who people can legally vote for.\n\nI understand Reddit skews very young and doesn’t think an older person represents their best interests but the answer is to organize and vote for younger candidates.  Not to just ban the ones you don’t want.",
   "created_utc": 1690897222,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc94v9",
   "message": "Only for house and senate.",
   "created_utc": 1690896488,
   "score": 255,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc5ruk",
   "message": "No.  But I’d support a mandatory retirement age of 70.",
   "created_utc": 1690894982,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc5u8s",
   "message": "minimum age to get it.\n\nlimited terms, 2 to  3 or 4 max for all offices.       no lobbying or involvement afterwards. \n\nyou \"serve\" and then you're gone.",
   "created_utc": 1690895013,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc69kr",
   "message": "I think as you get older the risk of age related illnesses gets bigger, but at the same time not everyone suffers from them, and you miss out on some potentially great candidates by doing this, especially as the field of medicine continues to advance.  I think there are better solutions to this problem.  \n\nA better solution is a combination of term limits (should be a thing anyway), and required medical screenings. That would raise privacy issues, but I think you lose the right to privacy when you decide to be such a public figure as well as a public servant.",
   "created_utc": 1690895208,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc7o7l",
   "message": "Yes. At that point people are too old to be deciding policy",
   "created_utc": 1690895843,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juc9bsu",
   "message": "Should be 55",
   "created_utc": 1690896573,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jucbd46",
   "message": "72 at the oldest.  ERISA mandates pension plans must pay a participant as of (needlessly complicated language that boils down to) age 72, so congress at least used to understand that thats an age you shouldn't have to keep working past. Boom, apply it to them. Easy peasy.",
   "created_utc": 1690897453,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jucbeco",
   "message": "AS long as someone can do the job age does not matter, only physical and mental abilities are the determining factors and that is generally determined by the person not your doctor and not some weird ass bureaucracy designed to commit murder against someone LEGALLY.\n\nN. S",
   "created_utc": 1690897468,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juccgph",
   "message": "Yes...definitely maybe 60 tho... They have prudent time and time again that their views on policies and legalities are antiquated and biased",
   "created_utc": 1690897908,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jucdhb7",
   "message": "No. How are they gonna support themselves and pay for anything? They government isn’t gonna pay/j. \nOn a more serious note. I would be okay with this, as long as we had rules to come with it. \n1- you cannot vote. If you aren’t in the work force or contributing you don’t need to vote. It’s like a free pass. \n2- there needs to be government made housing for the elderly that they don’t have to pay for/ can rent for cheap. This way they are safe and affordable. \n3- driving test every year. I don’t think I need to explain this one. This is also good for making sure that the person is alive and their family aren’t just cashing checks in their behalf.  \n4- cannot run for office and cannot help in any political campaign. Once you retire that means no work. No work. \n5- cognitive tests every 2 years. Make sure they are able to take care of themselves, in healthy environment and not in any abuse from family/ living situation. \nThere would be more to help make it easier to transition to retirement once that happens. I just can’t think of more atm.",
   "created_utc": 1690898325,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jucdvfc",
   "message": "We need a strong code of ethics for all individuals involved in government. Now I worked civil service for the state and was required to make complete financial disclosures every year for both state and federal government. If we just made everyone invoked do that problems would be solved. It’s amazing their is No code of ethics for the court and is disregarded by the others houses of government!",
   "created_utc": 1690898489,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juce48s",
   "message": "75? It should be 65.\n\nAt that age,  they are out of touch with current events but also still yern for things to never change.",
   "created_utc": 1690898591,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jucewn3",
   "message": "Why not younger?",
   "created_utc": 1690898918,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jucexwa",
   "message": "There are more young people than old people. \n\nJust vote them out.",
   "created_utc": 1690898932,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jucfqop",
   "message": "A hard age limit like that would be bad, just like a hard minimum wage is bad. Instead make it a percentage of the average US life span. Want to stay in office longer? Increase your citizens' life spans by increasing their quality of life. This would also allow it to keep pace with innovations in medicine and technology.\n\nI don't support cognitive tests. Who makes the test? How do they eliminate bias? You could end up in a situation where the person who's making the tests is deciding who's in office, rather than the voters.",
   "created_utc": 1690899261,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jucfs5i",
   "message": "No, but I do support a mandatory health screening for all politicians every election, regardless of age.  McConnell's recent health scare should have resulted in him immediately being suspended until a full investigation can be done to clear him.",
   "created_utc": 1690899278,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jucg1pl",
   "message": "I'd go one step further. I'd make the mandatory retirement age 70 for these people, AND require them by law to donate 10% of their retirement funds to the communities they were elected to represent.",
   "created_utc": 1690899388,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jucgnrz",
   "message": "They do seem to be slipping around 80. \n\nI don't support blanket age limits, but term limits and a cognitive test might help. And, it would also help if voters would weed out dysfunctional politicians.",
   "created_utc": 1690899635,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "jucgpy1",
   "message": "I don't really think age is the issue. It is a very large part of it. I'd support term limits for all of them. President only gets 2 terms. Everyone else should only get 2 terms. We should have justices that ride the bench like Kavanaugh will. He's what 40 something? He could potentially be there for 40 years. I think we should elect Supreme Court justices. They're no bi-partisan so let us put them there. They wanna pick sides then fine, deal with it. Also, people like Biden or Glitch McConell. They both served 36 and 38 years respectively. That's way too long. The senate and house were never meant to be life long careers. They were elected positions from a community that went to trusted people to vouch for their constitutes. Nobody does that anymore. They just collect their pay checks, shit their pants, get side money from lobbying, and have 2 extended leaves in the year. What job gets 2 vacations guaranteed a year? Teachers get the summer off and a Christmas break, but they also get paid like shit. Which is a problem in and of itself already. I'm 32 years old. My BiL just turned 18. He's a zoomer and gets to vote in the upcoming election. I asked if he had thoughts or questions and he said \"I don't think I should vote. Texas is red and it won't matter with a winner take all\" I was surprised. I didn't think he had thoughts like that. I told him millenals have neen shit on every 10 years since 2000. We couldn't make change. GenZ is in a perfect spot to make real lasting changes and I'm at least happy that my kids (Gen Alpha) may inherit a better country than we were handed.",
   "created_utc": 1690899658,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juch927",
   "message": "No. Elder Americans need representation in government too.",
   "created_utc": 1690899868,
   "score": 1,
   "submission_id": "15fauow"
  },
  {
   "comment_id": "juchpi7",
   "message": "I would not. I think it should be 70.",
   "created_utc": 1690900052,
   "score": 1,
   "submission_id": "15fauow"
  }
 ]
}