{
 "submission_id": "15fif65",
 "title": "Do you believe in the existence of aliens? If so, what is your reasoning? Have you had any experiences with them in your life?",
 "selftext": "",
 "created_utc": 1690909650,
 "permalink": "/r/AskReddit/comments/15fif65/do_you_believe_in_the_existence_of_aliens_if_so/",
 "score": 121,
 "url": "https://www.reddit.com/r/AskReddit/comments/15fif65/do_you_believe_in_the_existence_of_aliens_if_so/",
 "comments": [
  {
   "comment_id": "jud7olv",
   "message": "Yes, the universe is vast and far beyond human comprehension. It’s peak arrogance to think that we’re the only intelligent life that exists.",
   "created_utc": 1690909945,
   "score": 152,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jud80oi",
   "message": "Billions of galaxies with billions of stars and billions of planets. No way we’re alone.",
   "created_utc": 1690910073,
   "score": 136,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judhkjq",
   "message": "The truth is that our definition and understanding of life is somewhat narrow and defined largely in anthropocentric terms, look at how long it took us to discover so many diverse non-human lifeforms on Earth in biomes we had thought uninhabitable. However, this anthropocentric view of life also extends to the likelihood of the existence of extraterrestrial life. The universe is still fairly young, in relative terms, and we are thus far the only case study that we are familiar with for life (both complex and basic). So people point to our existence and the vastness of the universe as evidence that there must be more. However, life may be rarer than we suspect and it might last for a short universal period. In this case Life may have existed in the past tense and could exist in the future but is not guaranteed to exist simultaneously with us. Conversely it is just as anthropocentric to assume their is no life at all. The sheer number of planets does seem to favour the idea of life beyond our own but does not prove it.\n\nPersonally I do believe that there are aliens, however I also suspect that it life is currently quite rare and we maybe reasonably alone within the Galaxy though not likely within the Universe. I also think as the Universe ages life will become more commonplace but by that point if anything remains of humanity it will not necessarily be recognizable to us as Human. As for advance alien societies, I feel a little more sceptical about particularly the notion of interstellar travel but I would never rule it out as a possibility.",
   "created_utc": 1690913613,
   "score": 90,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judxrn9",
   "message": "Yes. There is NO WAY that with all the different galaxies that exist that there isn't many other planets just like ours or other planets with forms of life on them.",
   "created_utc": 1690919649,
   "score": 48,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jue40yl",
   "message": "Do I think aliens exist? As in life on other planets.. ? Yes, definitely.  \n\nDo I think they visited us? Not really. Distances are too long, time too short for it to be plausible.  \n\nIf they somehow still managed to cross the void, I think they \"visited\" us as much as we visit an ant hive when we walk by.",
   "created_utc": 1690921942,
   "score": 96,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jud74p0",
   "message": "Yes there’s lots of aliens. Just a few weeks ago one of my buddies got a liens on his house.",
   "created_utc": 1690909738,
   "score": 25,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judb35r",
   "message": "Yes. \n\nThe universe is infinite in all directions, to think intelligent life only exists on our planet is ridiculous. \n\nNo.",
   "created_utc": 1690911209,
   "score": 25,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judalik",
   "message": "Yes, because:\n\n1. Experiments have found that amino acids, the basic building blocks of life, can form naturally in the conditions we believe early Earth had.\n\n2. We have found similar amino acids in the tails of comets, meaning they can form elsewhere in the universe, not just on Earth.\n\n3. The universe is really frikkin' big.\n\nThere are likely billions of planets out there with similar conditions to our early Earth, within the habitable zone of their system, existing for billions of years. The idea that *none* of them ever developed life like Earth did seems ridiculous.",
   "created_utc": 1690911025,
   "score": 61,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judb41a",
   "message": "I can't remember the exact reasoning, but I believe it's more likely than not? I'll link a video. https://www.youtube.com/watch?v=KRGca\\_Ya6OM",
   "created_utc": 1690911218,
   "score": 8,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judkdxf",
   "message": "I'll be very surprised if there isn't. But would you want them to visit?\n\nIf any species that has the technology for travel over such a distance, why would they visit us? For any species to take such a trip it will be at a significant cost to them in some way. They aren't here just to shake hands. It will be because there is something of value to them on this planet.\n\nOur technology will be second to theirs. Possibly our intelligence too. They would very likely be here to take something and we will very likely struggle to stop them.\n\nSo the big three questions are 1. Have they already been here? 2. Are they planning on coming back? 3. If so, why?",
   "created_utc": 1690914658,
   "score": 8,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judfzhr",
   "message": "Aliens exist. Might be here, might not.\n\nBut something is here, and the senate wants to declassify its technology.\n\nhttps://www.democrats.senate.gov/imo/media/doc/uap_amendment.pdf",
   "created_utc": 1690913023,
   "score": 16,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jue5ms1",
   "message": "The odds of aliens existing somewhere else in the universe is approximately 100%\n\nThe odds of alien life locating and then travelling to Earth is approximately 0%\n\nAliens are out there, they're just not here... probably",
   "created_utc": 1690922537,
   "score": 19,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judcfsq",
   "message": "I use to believe in aliens until our government just announce they're real. I don't trust them so now I don't think they're real.",
   "created_utc": 1690911711,
   "score": 14,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juda0l0",
   "message": "Yes, but there are degrees to this - intelligent life is probably exceedingly rare. I'm starting to doubt there's any other in our galaxy at the moment, and other galaxies are way too far away for us to ever detect.\n\nSo... I think it is likely that we'll never see any signs of intelligent life out there, although with as many galaxies as there are, it would be very unlikely for none of them to have intelligent life.",
   "created_utc": 1690910809,
   "score": 6,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judxrah",
   "message": "I don't believe in anything for which there is not tangible evidence. But statistically it's likely there's other life in a very large universe. Not a guarantee though.",
   "created_utc": 1690919646,
   "score": 2,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jue2s2p",
   "message": "“We swear us bringing up aliens every time the current administration does something stupid is a coincidence!”",
   "created_utc": 1690921479,
   "score": 3,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juddmph",
   "message": "The UAP news recently has me a little less skeptical. \n\nI've looked for ghosts and aliens for 20 years and have never seen anything. They don't want to show themselves to me even though I'm ready to believe more is out there. I just need to see it for myself.",
   "created_utc": 1690912152,
   "score": 4,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judgily",
   "message": "Did you notice that everyone said \"no\" to the last question? Is it just us in this discussion?",
   "created_utc": 1690913220,
   "score": 2,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jud9t5q",
   "message": "Because this has come up a lot more recently, got me thinking... what if WE are the aliens that landed on this planet and took it over??",
   "created_utc": 1690910732,
   "score": 2,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judzb51",
   "message": "Given our existence, the odds literally favor other life given the vast number of other galaxies, systems and stars",
   "created_utc": 1690920214,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judesxs",
   "message": "A friend and I summoned a UFO once by meditation when we were camping.",
   "created_utc": 1690912583,
   "score": 250,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judkdzq",
   "message": "I don't believe so because there is no concrete evidence to support their existence.",
   "created_utc": 1690914658,
   "score": 250,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judeg6v",
   "message": "there are intelligent beings out there. but they're not coming here.\n\njust think, we're always supposedly recovering crashed craft.\n\n\nthey flew many, many light years or found a wormhole or whatever, to get here. then they crash.\n\nwhat are they doing? letting the female aliens drive the last leg of the trip?",
   "created_utc": 1690912453,
   "score": 251,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jud790o",
   "message": "I just hope they're made out of flesh and blood so we can easily destroy them if need be",
   "created_utc": 1690909783,
   "score": 255,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jud7jcd",
   "message": "They're 'Xeno-Americans'! Get your pronouns right or be canceled!",
   "created_utc": 1690909891,
   "score": 251,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judact4",
   "message": "I don’t only think they’re real… I believe they have bases in the United States and agreements with the US government.",
   "created_utc": 1690910935,
   "score": 0,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judclyv",
   "message": "Not really. I believe it's guaranteed that there is life in some form outside of Earth, but I think it's really weird how many people just *assume* intelligent life much exist elsewhere just because the universe is so big, when we actually know absolutely nothing whatsoever about how common life is. It could be a complete fluke. It could be that it's infinitesimally rare for life to evolve into intelligent civilizations. No one knows. People claim it's arrogant to think we're unique, but I think it's equally arrogant to assume we're not. We have absolutely no evidence that justifies that assumption.\n\nRegardless, I also think the universe is simply too big for this to matter. People assume that Star Trek technology is a near-certainty, and I think that's also an unfounded assumption. It may well be the case that it's simply impossible to productively communicate with other intelligent races who are millions of light years away.",
   "created_utc": 1690911775,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judckfo",
   "message": "Like, fully functional, almost human like creatures? No, I could see how there could be another planet like ours out there, and, there probably could be another human like species, but, I don't really think there is that advanced kind of life forms out there.\n\nNow, microorganisms, for sure, they're out there, bacteria, definitely, but, it's all, from what I understand basic forms of life, at least that's what I've heard, and, I don't know if it's really true or not, but, I believe it, even if it isn't an actual fact.\n\nBut, I don't believe we have another life form controlling metal objects flying around our planet, and, experimenting on people, that would seem illogical, and a little stupid. But, then again, you never know, shits crazy, and, nothing makes sense.",
   "created_utc": 1690911759,
   "score": 255,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judc93o",
   "message": "Yeah they are fixing the sprinklers right now",
   "created_utc": 1690911643,
   "score": 250,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jud71kf",
   "message": "Yes, because I don’t think humans are special enough to be the only beings. We don’t deserve to be that special.",
   "created_utc": 1690909705,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juddfcq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jud7523",
   "message": "Yes, I do. The universe is surely too big for it to just be us. No, I have not.",
   "created_utc": 1690909742,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jud76it",
   "message": "The universe is big, and the stuff to make life is common, so aliens exist with certainty. I doubt intelligent life is particularly close to earth though.",
   "created_utc": 1690909757,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judc07w",
   "message": "1. Yes\n2. Because of the drake equation\n3. Of course I haven't",
   "created_utc": 1690911550,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judcyp0",
   "message": "I believe the probability of life elsewhere in the entire universe is large.\n\nI also believe the probability or said life to make the very long trip to us is very low. So there probably is something alive out there but it's likely we'll never meet.",
   "created_utc": 1690911905,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juddov0",
   "message": "I think it's utterly inconceivable with the vast size of space that there is not life out there somewhere.\n\nI also think that it's utterly inconceivable with the vast size of space that life from another planet has ever visited Earth.",
   "created_utc": 1690912175,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jude3ib",
   "message": "There is a very large difference in populations of people who believe in the existence of aliens, and people who believe there are extraterrestrial who have traveled the stars to Earth and have  interacted with or been discovered by humans.",
   "created_utc": 1690912323,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jude90j",
   "message": "We are one galaxy in a universe that is infinite. I have a hard time believing that we are the only form of life out there.",
   "created_utc": 1690912380,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judeqq5",
   "message": "Yes. It seems impossible that in all the planets, in all the solar systems in all the galaxies in the universe that our tiny little planet is the only one with life on it.",
   "created_utc": 1690912561,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judevyp",
   "message": "Life is common. Complex life is rarer. Intelligent life is rarer still. And technologically advanced intelligent life is extraordinarily rare. \n\nAliens on the level of being able to transit between stars might and probably do exist - among hundreds of billions of galaxies, the odds are in their favor. We're just highly unlikely to ever meet them because we are separated by vast distances and time. Intelligent aliens exist and we'll probably never be able to prove that before our own species dies, whether sooner or later, probably sooner.",
   "created_utc": 1690912614,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judexyd",
   "message": "We are technically aliens, so yeah. But no experiences with them.",
   "created_utc": 1690912634,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judg56p",
   "message": "Yes and Yes.",
   "created_utc": 1690913082,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judgoty",
   "message": "No, because they don't exist, yes.",
   "created_utc": 1690913283,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judgv2z",
   "message": "It is likely that other life exists in the universe, but our science has not yet, and might never, be able to find or prove the existence of other life due to the sheer amount of engineering/science/physics required to do so.\n\n10,000 years from now we might ask this same question with the same exact guesses.",
   "created_utc": 1690913347,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judh1k8",
   "message": "Yea, most likely they're single cell organisms, or something like that. \n\nEither were the most advanced, least advanced, or alone, all equally possible.",
   "created_utc": 1690913415,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judh1q1",
   "message": "The existence? Yes. The universe is simply so large that it seems highly unlikely to me that life exists only on Earth. \n\nHave little green men visited our planet to mess with some bumpkin on a country road in the middle of nowhere? No.",
   "created_utc": 1690913417,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judhf0p",
   "message": "No evidence or proof = NO.\n\nMeanwhile the planet boils.",
   "created_utc": 1690913555,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judhf5i",
   "message": "I think aliens certainly exist somewhere. But I believe technology will never get us to the point of traveling to them.",
   "created_utc": 1690913556,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judhoxh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judi2tm",
   "message": "To think we’re the only living organisms in the never ending universe is by far the craziest thing  to even think is true. \n100000% things out there that we probably won’t see in our life time unfortunately",
   "created_utc": 1690913801,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judi85l",
   "message": "Ive seen the movie fire in the sky, i believe",
   "created_utc": 1690913857,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judiaam",
   "message": "There is aliens. But Either we can't find them, either they.",
   "created_utc": 1690913879,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judihf0",
   "message": "The universe is too big not to",
   "created_utc": 1690913953,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judiw81",
   "message": "At this point and from what we know, which is so much more than we do about our own ocean, I honestly believe there is no way with how vast space is that there isn’t alien life or even another earth. Maybe billions of planets just like ours.",
   "created_utc": 1690914105,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judjfpv",
   "message": "would u people leave us alone already , u suck",
   "created_utc": 1690914304,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judji2j",
   "message": "It seems unlikely that there is no other place where life developed in this massive universe. I'm skeptical that there has been any contact with them, but I'm open to changing that in the future.",
   "created_utc": 1690914328,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judjodl",
   "message": "Somewhere in the fullness of space? Unquestionably. \n\nInteracting with humans on Earth? Completely different box of frogs. \n\nAdmittedly, recent news congressional hearings has a way of capturing the imagination, but publically we still haven't seen anything you could call proof.",
   "created_utc": 1690914392,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judjwdy",
   "message": "It's pretty self-centered of humanity to think they're the only intelligent life in the universe. It's unimaginably large. I'm certain intelligent life exists out there\n\nI doubt it has much interest in humanity; if it's intelligent enough to cross light-years it's too intelligent to fuck with a species that still hasn't decided whether or not to destroy itself",
   "created_utc": 1690914476,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judjxzx",
   "message": "Aliens exist, no question about that. \n\nWill there evr be First contact? I highly doubt it. Even at the speed of light, stars are just too far away. And yeah, wormholes could exist. Emphesis on could.",
   "created_utc": 1690914493,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judka02",
   "message": "The fact that Earth has the perfect conditions for life, and the billions of galaxies in space suggest there is a probability there may be some conditions similar to earth or maybe even something different that we havent discovered, but still allows for life.",
   "created_utc": 1690914617,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judkbdt",
   "message": "I like to think we are just in a bad spot here in the southern tip of the Orion arm of the Milky Way.\n\nLike, yes their out there. We're just in a really obscure part of the Galaxy.",
   "created_utc": 1690914631,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judkfc3",
   "message": "Anthropomorphic aliens? No. For me, claiming the size of the universe as evidence is akin to claiming the universe it was created by a god. If my understanding is correct, neither are falsifiable.",
   "created_utc": 1690914672,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judkik5",
   "message": "They are of course out there, but our own self importance will always make us think they would interact with us, when in reality, we are too insignificant to even be worth a visit.",
   "created_utc": 1690914704,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judl7bk",
   "message": "Yes, due to a shared event my best friend and I experienced together in 1992, and later a shared event with my partner, in 2018. \n\nIn 1992: As wild as it may seem, we were both compelled in the middle of a conversation, to go to a nearby window and observe a light in the night sky. There was no sound and we couldn’t see it from the angle we were sitting before, and the thought interrupted us mid-sentence.\n\n2018: my partner and I were heading north on hwy 59/69 in north Houston. We observed a reflective tictac about the size of a passenger plane fuselage over IAH. I had thought it was a plane because I was driving and just saw a shine, but my partner pointed out it wasn’t moving. That continued stationary placement had been nagging me in the back of my head, but I was kinda zoned out on the road. It was a partial cloudy day and we had a sunny rain at the time. The clouds would blow by the UAP, obscuring it, and it wouldn’t move at all. After a few mins, it took off west. I had glanced down because of driving and when I looked back up it was in the distance, and seemed to be the same elevation. It continued out of sight.\n\nThe 1992 event was the most profound for me, due to the telepathic thought. It wasn’t a voice, just a concept, an idea. My friend and I just stopped, looked at each other, and kinda nodded toward the window, as we both knew what to do. I didn’t feel any malice or uneasiness, just surprise. \n\nI don’t feel much fear of them at this point, as long as they remain docile.",
   "created_utc": 1690914962,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judl81l",
   "message": "I did, then our government said they were real. So now I don’t.",
   "created_utc": 1690914969,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judlh8j",
   "message": "Yes, space is huge, possibly infinite, theres just no way we're the only ones",
   "created_utc": 1690915062,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judlilg",
   "message": "Yes but why would they bother with us?\n\nYou can travel the universe, which is basically time travel, you have tech way beyond the need for our stuff.\n\nWhat would humans be, pets?",
   "created_utc": 1690915075,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judlmkc",
   "message": "Yes, but I don’t believe they’ve ever been to earth, nor will they ever visit. Too small a chance that life didn’t crop up somewhere else out there, but with the universe expanding and being infinitely large, chances are we won’t meet.",
   "created_utc": 1690915115,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judm31v",
   "message": "As others have said, there's just way too much space for us to be the only ones in it. Whether we have or will exist at the same time as any of them, or if we're at a distance where it's possible for us to ever know about each other is a different story.",
   "created_utc": 1690915286,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judmde2",
   "message": "Sure, space is vast and I feel it’s very unlikely it’s just us. Never experienced anything though",
   "created_utc": 1690915391,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judmnm9",
   "message": "Besides the sheer number of stars, we see the same stuff that makes us \"out there\".",
   "created_utc": 1690915499,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judnnfw",
   "message": "Mathematically they should exist",
   "created_utc": 1690915870,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judnplc",
   "message": "Nope. I don’t",
   "created_utc": 1690915893,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judnxyw",
   "message": "I believe the likelihood of aliens existing is higher than them not existing. To put it simply; the universe is big.\n\nI do not currently believe they exist, because I have not been shown satisfactory evidence that they do exist. That is not to say I think they don’t exist. I just don’t currently believe that they do.",
   "created_utc": 1690915982,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judoehv",
   "message": "Yes, my reasoning is that the universe is way too large for us to be the only habitable planet to have intelligent life forms on it. \n\nHave they ever visited our planet, though? It could be possible but I lean towards no just based on how far they'd likely have to travel to reach us. It's possible that some alien civilization out there is so far advanced in technology that they've come up with some crazy worm hole travel process or something, though, so I'm not 100% saying they've never visited us and never will. \n\nAnd no, I don't believe I've ever had any experience with extraterrestrials in my life.",
   "created_utc": 1690916150,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judohe5",
   "message": "I believe there is life in the universe.\n\nI also believe the chances of us ever interacting with it are so infinitesimal that it may as well be zero. Our star is so dim almost none of the stars we can see in the night sky can see us back.",
   "created_utc": 1690916180,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judoiyh",
   "message": "I believe there are. Whether they're near enough to us for us to ever interact meaningfully, I'm not sure. Of all the billions of stars we can see, and the hundreds of millions of planets orbiting those, we can only see a fraction of a fraction of the universe.\n\nFor us to be the only one, life must be so impossibly rare that it defies reality. Plus I personally find it more comforting to believe that we aren't alone.",
   "created_utc": 1690916196,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judoq5h",
   "message": "Do they exist? It's more than probable.\n\nWill we meet them? Not as probable.\n\nSpace and time are big. Space is so big that it takes a lot of time for light to travel across it. We can look at that light with telescopes like the JWST, but the light we see is millions and billions of years old.\n\nWe are looking at the past.\n\nAliens could be building massive structures like Dyson spheres,  orbital stations, and space ships right now, But we won't see the light from those objects for another million years.\n\nWe will likely never make meaningful contact with living aliens over the course of all of human existence. The oldest evidence of human-like fossils/remains is at most 300,000 years old. Assuming the oldest and most distantly  viewed galaxy cluster is 30 billion y/o, we have only been here for 1/100,000th of existence and might be around for another 1/100,000th or two.\n\nAliens could've evolved into a massive empire spanning many stars and galaxies, rose to technological heights that we couldn't fathom, and eventually crumbled away into dust and leaving nothing behind for us to find.\n\n Hopefully as our technology advances we develop a way to detect the remnants of such ancient aliens. This is likely the only way we would ever come into contact with aliens, we find what's left of them or they find what's left of us.",
   "created_utc": 1690916269,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judp1to",
   "message": "About 15-18 yrs ago in broad daylight. Small lights transform a triangle shape. It was very vast and way up in the sky. The lights were too bright since it was still visible in the clear sky under the scorching sun. It was moving very slowly and stayed up for about an hour or so and then suddenly disappeared.\n\nI still sometimes think that it was my imagination or something but I wasn't the only one who witnessed it. I still remember the conversation about that I was having with my family members about that thing while it was floating up in the sky.",
   "created_utc": 1690916388,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judpjgz",
   "message": "Yep, I don't believe in xfiles/Roswell type aliens tho.  If life happened here it has to be elsewhere.  The universe is just too big.",
   "created_utc": 1690916570,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judq3zw",
   "message": "Yup. Universe is too big for there to not be other intelligent life out there somewhere.",
   "created_utc": 1690916784,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judqors",
   "message": "I don't believe in space aliens. I feel that interdimentional travelers (both intentional and accidental) are what is responsible for the aliens (and 90% of criptids)",
   "created_utc": 1690917004,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judqum2",
   "message": "Extraordinary discoveries needs extraordinary proof. Hell nah, at least not on this planet.",
   "created_utc": 1690917065,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judr60z",
   "message": "A) Of course!\n\nB) Given the scale of the observable universe, it is statically impossible for us to be alone, even in our own galaxy.\n\nC) Not that I'm aware of.",
   "created_utc": 1690917183,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judr7er",
   "message": "do they exist? No doubt. Have they visited us? Maybe, but probably not.\n\nAn interesting and slightly terrifying answer to the Fermi Paradox is that the Galaxy IS full of life and we HAVE found it, but that information has been kept from the public for some reason. That being said, I've never seen any compelling evidence that this is the case.\n\nI think it's far more likely that whatever is out there doesn't know we exist.",
   "created_utc": 1690917198,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judr7j5",
   "message": "Yes, I figure that with as large as the universe is, there has to be something else out there.",
   "created_utc": 1690917199,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judr9vb",
   "message": "I do mainly because it seems impossible given the vastness of space and the length of time that the universe has been estimated to exist (which was recently considered to be double the age what we originally estimated)27billion years, that earth and human were the only place in all of known creation that developed intelligent life  , in a blink of an eye’s time relative to the entire range of time.",
   "created_utc": 1690917224,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judrb1g",
   "message": "Yes. Regardless of the selfish concept that humans are the only intelligent life in the universe I (and my brother) had an UAP experience when we were mid teens in Spain. A fuzzy, yet somehow solid bright white object (bulged oblong shaped) swooped down upon us and the kids we were with at the time, fast, from the sky, and then back up again. Later on (about 1 hr later) we saw it floating static in the sky, but seemed much larger and further away. \n\nWhen it swooped down, it was no more than maybe a few feet wide.  When we saw it in the sky later it was much further away and maybe a hundred feet wide.",
   "created_utc": 1690917236,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judri0b",
   "message": "Just look at the universe and the sheer size and scale of it.\n\nNo way we're alone.\n\nNow whether these things came to Earth to study us or are already \"among us\" is highly debatable if not ridiculous.",
   "created_utc": 1690917309,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judrrrs",
   "message": "Due to the sheer size of the universe, other intelligent life almost certainly exists.\n\nDue to the sheet size of the universe, no two intelligent lifeforms will ever detect each other.  Every intelligent lifeform that ever exists will think they're alone in the universe.",
   "created_utc": 1690917411,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juds1m4",
   "message": "Yes. Just playing the odds with the size and scope of the universe. I’ve personally seen a UFO in the forests around Colorado Springs (triangular, hovering, no sound, disappeared in a flash), but thankfully no close counters of the third kind.            \n\nI also tend to leave open the possibility these crafts or entities aren’t necessarily from outer space, but from an alternate dimension/reality. There’s just a lot we don’t know. And may never know.",
   "created_utc": 1690917514,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judsov0",
   "message": "Math - add it up.\n\nMay have visited in the past, but I think the orbs, UAP’s, UFO’s and the WTF’s are a combination of time and/or dimensions travelers and/or past civilizations unable to adapt to today’s environment due to germs, viruses, bacteria, weather, and wild, destructive, unpredictable animals known as humans",
   "created_utc": 1690917753,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judstcf",
   "message": "It's a numbers game. It is statistically impossible that Earth is the only planet that developed intelligent life.",
   "created_utc": 1690917800,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judt28u",
   "message": "On Earth? No.\n\nBut with so unfathomably huge the universe is, I find it hard to believe there isn’t at least one other intelligent species out there somewhere.",
   "created_utc": 1690917894,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judtfnd",
   "message": "Yes I do. Mostly comes down to the idea that the universe is nearly infinite and to assume we are the only intelligent life form in it is pure arrogance.",
   "created_utc": 1690918034,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judtjer",
   "message": "Skin mites exist, on every human. Sorry what was the question again?",
   "created_utc": 1690918073,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judtjlq",
   "message": "Yes I do. Mostly comes down to the idea that the universe is nearly infinite and to assume we are the only intelligent life form in it is pure arrogance.",
   "created_utc": 1690918074,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judto9r",
   "message": "I believe it is statistically probable.  I do not believe we have had any contact with them. \n\nI have had no experiences with them. \n\nI do believe that if we do come into contact with \"alien\" life, it will be more like bacteria, fungus, or some other weird alien equivalent than little green men.",
   "created_utc": 1690918124,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judu1yr",
   "message": "I doubt humans will ever discover complex life unless they have a common nearby source.   The conditions for developing the first cell are so unlikely that it is \n\nSome of the UFO reports (the glowing spheres) seem to be electromagnetic phenomenon related to ball lightning This includes foo fighters.  Some of the more recent ones are most likely drones.  Some are untrustworthy eye witness accounts of the same kind that have existed for centuries. \n\nTiming of hearings is usually important.  Conspiracy theorists have said for decades that the ace in the hole for an administration trying to distract the public is aliens.  The government hearings seem like an attempt to be tantalizing.   It is easy to believe that the administration may be trying to create a false impression of alien contact as a political distraction.",
   "created_utc": 1690918266,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judubee",
   "message": "No way we’re alone in the universe.\nVery unlikely some of them ever visited us.",
   "created_utc": 1690918364,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judul6l",
   "message": "I can see the moment now...\r  \n\r  \nThe aliens, tired of waiting, finally decide to take over all broadcast and digital media on the planet to make contact once and for all. Governments and church leaders around the world are terrified, with a collective every possible step to protect you from this have been exhausted. The ships, massive and bright, silently blanket the major global city centers, with smaller ships hovering over even small rural towns. In one coordinated moment, all the lights fade away, leaving the ships hovering in dark and blue skies alike. Even the birds and insects fall silent for the imminent announcement from the skies. A small digital pop comes across every speaker on Earth, followed by a nearly inaudible hiss making it clear that the channel is now open. There is a pause, then a sound—perhaps a being behind some alternate form of a microphone, taking a deep breath to prepare for these first historic words. And then, a voice, which could neither be human nor machine, resonating in harmonics and impossible chords, breaks the barrier of millennia of silence between our incomprehensively disparate biologies: \"People of the Earth... we have been trying to reach you about your car's extended warranty.\"",
   "created_utc": 1690918467,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juduy1h",
   "message": "This is super interesting:\n\nhttps://www.scientificamerican.com/article/how-many-aliens-are-in-the-milky-way-astronomers-turn-to-statistics-for-answers/?amp=true",
   "created_utc": 1690918601,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judv6de",
   "message": "Aliens exist 100% no matter what. If not that means either:\n\nWe are the *first* or we are the *last*",
   "created_utc": 1690918688,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judv7m3",
   "message": "If we exist then it seems likely something else does.",
   "created_utc": 1690918701,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judva3j",
   "message": "Exist? Yes. Been here? No.",
   "created_utc": 1690918727,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "judvapf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juep617",
   "message": "Yes BUT it’s irrelevant \n\nI don’t believe any alien life has visited or will likely ever visit the earth \n\nThey may have existed a billion years ago or two or ten, or may exist similarly billions of years in the future \n\nAnd maybe they exist so far away they we’ll never realize it because the universe is expanding faster than the speed of light \n\nImagine parasites on a grain of sand in America curious if other grains of sand have parasites, maybe, but maybe those other parasites are on a grain of sand in the Sahara so does it matter?",
   "created_utc": 1690930186,
   "score": 13,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juerldb",
   "message": "It’s not something to believe in, they 100% exist. The universe is immeasurably big with a shitload of planets in our galaxy alone that would support life. Somewhere out there, there absolutely is, has been or will be other life. So aliens do exist; but I do think they will certainly remain very separate and very irrelevant to us long after humanity is gone.",
   "created_utc": 1690931215,
   "score": 2,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juewbp5",
   "message": "There is no chance in hell we are the only living thing in this vast universe",
   "created_utc": 1690933219,
   "score": 3,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juewggm",
   "message": "Is this tagged NSFW because of probing?",
   "created_utc": 1690933277,
   "score": 9,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juewhos",
   "message": "Common sense. How many plants are there in the universe? I doubt we are the only one with life on it. Hell, there might even be intelligent life somewhere out there cause I'm questioning earth more and more each day 🤣.",
   "created_utc": 1690933292,
   "score": 2,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juerndm",
   "message": "The observable universe is big but the whole universe is almost certainly infinite. Therefore there are not only aliens but an infinite number of planets just like this one, with someone just like you, and an infinite number where that person has had the most amazing luck their whole life.",
   "created_utc": 1690931238,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juergbk",
   "message": "I was between the ages of 20-21. It was the night before I started the first day of my career in construction and it was stinking hot up stairs so I went to the basement to sleep. At about 3:30 am a brilliant light woke me up. At first I thought, “why the fuck is one of my family members down here turning lights on at this time?” So I sat up and opened my eyes to see three VERY tall bi-pedal beings clearly not from earth. I estimated their heights to be just over 8ft, 7 and the third was like 6.5. I got these numbers because I know the ceilings in the basement are 8 ft and the tall boy was ducking. Anyways, they were standing in front of what I can only describe to be a portal. It had to be a portal because they didn’t walk through a solid concrete wall 5 inches thick. It had a light blue shimmering perimeter and the inside of it was darker than black. I sat there in utter amazement as the first two walked through and that’s when I said, “holy shit!” The third one heard me and it stopped to turn around and look at me. This image of its face is burned into my mind and anytime I close my eyes and think back I can see it as clear as day. At this point I jumped up because well, I have questions. It was all over as quickly as it started and they were gone. The only reason I could come up with after thinking about this all these years is they were there for genetic material or they put something in me and I’m my own Truman show. It was the most incredible and perspective shifting experience I’ve ever had.",
   "created_utc": 1690931156,
   "score": 255,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jue1w9w",
   "message": "There isn't enough information to even guess. People point to the incomprehensible large size of time and space, but that doesn't tell us anything without knowing the probability of life forming if given the opportunity. We have absolutely no basis for determining that factor,  and without it we can't even begin to guess. Anyone claiming to have a viable conclusion misunderstands the evidence.",
   "created_utc": 1690921161,
   "score": 3,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juf3bnh",
   "message": "Yes I believe, because of the vastness of the universe and everything in it. No, I doubt any of us will have experiences with them because of the vast space between everything in the universe. Also, Dark Forest theory",
   "created_utc": 1690936248,
   "score": 2,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juf57tr",
   "message": "Earth, a planet made of dust floating randomly in  space in a random corner of the universe. There’s no such thing as coincidence, as long as certain conditions are met, there’s guaranteed life. They’re just like us, living in a different planet made from dust in a different corner of the universe.",
   "created_utc": 1690937083,
   "score": 2,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jufdw77",
   "message": "As in, life on other planets? Yes.  Reason: Life is everywhere in every environment here on Earth.  I find it hard to believe it wouldn't evolve everywhere else.  Caveat: Will be so strange and so alien it will be of interest only to xenobiologists.  For example: It may operate so fast it evolves, comes and goes in the span of a second, or the opposite, it may operate so slowly that it takes a study team to realized it moved at all.  If by some incredible coincidence they are intelligent, tool-using, sentient and space-faring, at the very least we'll likely have missed them by 10,000 years, i.e., we'll find ruins that they once existed, or vice versa.\n\nDo I believe there are pretty, blue, humanoid, alien girls who will have sex with every nerd on this planet? No.",
   "created_utc": 1690940946,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "jueu3a9",
   "message": "I believe the odds of life on other planets is very high. The Fermi paradox explains why we haven't encountered them.",
   "created_utc": 1690932266,
   "score": 1,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juevs06",
   "message": "Yes, God (Generate, order, destroy, GOD) (not a judgemental sky daddy but a field of infinite intelligent energy with both divine masculine and feminine with infinite Unconditional love) cannot destroy itself ever...so that means it has forever to live out any reality it so thinks of, so why not try out different forms (bodies). the human form is a unique level of spiritual evolution (be grateful for yours) but also animals,birds, sea life even planets, Galaxies, for there is nothing to restrict itself. that can include angels, archangels, demons, reptilians, lyran (cat/tiger humanoid) wolf/humanoid forms, and beyond. Hearing how lifetimes scale in higher dimensions was crazy to me, we humans can live up to 130 yrs (so far), other forms can live to 1000yrs, 10k yrs, 100k years, 1 million year long lifetimes...like fuck simulation theory...we are in Creation so Anything is possible in terms of how life can take form and exist....we humans are the ONLY thing life could come up with and thats it? that would be pathetic and pretty limp dick if that is truly the case imo. Enjoy Chpt 5 from The Kybalion my fav chpt.   https://www.youtube.com/watch?v=JiidjtSg2m8\n\nalso with all this news on alien life coming from govt's, buckly up for probably the biggest and dumbest false flag operation in humanity's history ever https://www.youtube.com/watch?v=PluQETAk9u4",
   "created_utc": 1690932988,
   "score": 0,
   "submission_id": "15fif65"
  },
  {
   "comment_id": "juf9kdq",
   "message": "My reasoning for believing is the US government literally confirmed the existence of non-human extraterrestrial beings and alien technology.",
   "created_utc": 1690938995,
   "score": 0,
   "submission_id": "15fif65"
  }
 ]
}