{
 "submission_id": "15fnz0c",
 "title": "[Serious] What is the scariest, most dreadful, horrifying, stomach churning thing that has ever happened to you?",
 "selftext": "",
 "created_utc": 1690922087,
 "permalink": "/r/AskReddit/comments/15fnz0c/serious_what_is_the_scariest_most_dreadful/",
 "score": 52,
 "url": "https://www.reddit.com/r/AskReddit/comments/15fnz0c/serious_what_is_the_scariest_most_dreadful/",
 "comments": [
  {
   "comment_id": "jue4f0s",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1690922088,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue565y",
   "message": "When my car skidded off an icy road and rolled onto its roof. I was eight months pregnant and my two year old was in his car seat in the back. We ended up hanging upside down. If not for my seat belt and that car seat, it would have been bad news.",
   "created_utc": 1690922367,
   "score": 69,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue7s1s",
   "message": "After not swimming in years and remembering how good I *used* to be, I went swimming in a lake last summer. I was trying to swim over to one of those giant logs that separates the water into boating and non boating areas. Got about half way and I got tired. Looked forward, not that close. Looked back, not that close. Started panicking and swallowing water for a sec until I remembered that if I calm down and lay back I could float and sorta slowly swim to it.",
   "created_utc": 1690923329,
   "score": 65,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juel7rv",
   "message": "Home alone for one of the first time. I was 14, parents were gone for 2 nights for their anniversary. Got up at 2am to use the bathroom as i was washing my hands there was foot sliding sounds right outside the door. *fffffft ffffffft ffffffft* i held my breath and went white as a ghost, i stood in dead silence for what felt like minutes. The sounds didnt stop. I finally noticed above the mirror was a moth its wings was the fffffff sound and it was bumping into the wall and lights for the step sound. That feeling of relief is unforgettable.",
   "created_utc": 1690928530,
   "score": 60,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue92o9",
   "message": "When I was 5 I had appendicitis but Dr’s thought I was lying about my stomach pain so they sent me home. \n\nMy parents brought me back to the ER that night with excruciating abdomen pain. The nurse only gave me a warm pillow for my stomach.\n\nTurns out My appendix ruptured and I was rushed into surgery. \n\nI now have a 5.5 inch scar down the middle of my stomach and I don’t remember much from that night. \n\nI think I almost died but my parents don’t mention that part.",
   "created_utc": 1690923812,
   "score": 53,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juee0qj",
   "message": "I was molested as a child for years. Its been over 20 years, but I can still see, hear, smell and feel everything. No therapy and no medication will ever make me function again. Second to that is witnessing my dad convulsing on the floor, he couldnt stop drinking. He died a little while later in the hospital, I was 10 and coudlnt say goodbye.",
   "created_utc": 1690925694,
   "score": 54,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juek2gc",
   "message": "I had a near heart attack. \n\nI was on the floor in our garage screaming in pain. And like a fool, when the pain subsided I got up a drove 2 1/2 hours for Christmas. My wife’s friend, a nurse, urged me to go to the clinic, the clinic sent me to the ER ‘as fast as you can get there’, and I ended up having quintuple bypass surgery. \n\nThe surgeon wasn't amused.",
   "created_utc": 1690928067,
   "score": 37,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jueow2y",
   "message": "I had migraines for about 6 months which were getting progressively worse. MRI came back negative for brain tumors, doctor tried several medicines before putting me on Imitrex. \n\nHe said if I felt a migraine coming on, take one and lay down. So one day I got home from work and my head began to spin so I took one. \n\nThe headache never subsided. I first noticed my heart began beating erratically, out of control. I almost grabbed my chest…..but was completely paralyzed. I could not move my body in any way shape or form, to dial a phone or alert anyone (I lived alone at the time). The muscles on the sides of my neck and my legs began to pulsate very fast and hard, spasming over and over again but again, I could not move. For and full minute, my lungs stopped working and I couldn’t draw breath. Finally, I could draw breath, the spasms stopped I could move. Called my doctor immediately wondering if I needed to go to the ER and he said to never take one again and would mark me as allergic. I laid there until everything was working fine again. \n\nI will never take that shit again. It was the first time in my life I felt like I was truly dying and there was nothing I could do.",
   "created_utc": 1690930068,
   "score": 39,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juempki",
   "message": "My best friend drank a concoction before school that he thought was only liquor. (Admittedly not good, but normal for him.) The guy who gave it to him also added codeine without him knowing. Long story short, he threw up in class and passed out in his vomit. I had to perform CPR while the medics came, I thought he was going to die. I was shaking and holding back tears for the rest of the day. Failed my math test lol. He was in a coma for a week and went through like 4 IV bags. I had given him a breakfast taco that morning, which the doctor said caused him to vomit and likely saved his life. His BAC was well above the lethal amount. He now has a tattoo on his shoulder of the drake hands (from the cover of “if you’re reading this it’s too late”) holding a taco. He was scolded by my friend group and I and had to go to juvie for awhile, with the guy that drugged him. He’s doing good now.",
   "created_utc": 1690929150,
   "score": 32,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juebbhd",
   "message": "had a stroke.\n\nmy face drooped, I couldn't talk right, words were slured and jumbled.\n\nleft arm and leg gave out on me. I hit the floor.\n\nPT helped but I still have a weak left side and somehow developed a stutter.",
   "created_utc": 1690924660,
   "score": 23,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue6u8a",
   "message": "I was 3. My babysitter's BF took me to a man who orally raped me. At a \"party\".",
   "created_utc": 1690922987,
   "score": 37,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juebref",
   "message": "Being told at school that my friend had just tried to commit suicide and that they were hospitalised. I still get nightmares about the moment I was called out of class to the counsellors office. Worst part was, no one thought they were gonna make it and I wasn’t allowed to leave school to go see them. They’re okay now, thank god, but nothing in my life has ever topped that moment as the worst day of my life",
   "created_utc": 1690924830,
   "score": 16,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jueyc10",
   "message": "A man came to my secluded home when my parents were at work. He told me that my mother had left a check for him for charity, and if I let him in he could find it quickly and leave. I was 11 years old and incredibly naïve and I almost let him in. The only thing between us was a thin screen door with a weak lock, which he began to pull at and test.\n\nMy usually sweet, nervous lab began to growl at him, and two friends I had brought  home with me, against explicit instructions, came into the room to join me.\n\nI guess three kids and a furious dog were too much risk, because he muttered something and left. I try not to think about his plans for me, or about the other man that was waiting in his truck the whole time.",
   "created_utc": 1690934081,
   "score": 17,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jueveb3",
   "message": "I handle surprises and traumas pretty well, weirdly enough, despite my PTSD lol. My ex tried to hurt/kill me, my dad was dying, I’m a survivor of CSA, I’ve just *dealt* with things. But there was one time something happened that I was totally NOT chill about. \n\nMy parents and I lived in a single trailer home, so sound travelled fairly easily. It was the middle of the night, completely dark, and I heard the front door slam. I knew for a fact my brother was away, and both my parents were home and in bed and hadn’t left. Then I heard fast stomping coming down the hallway and I thought we were getting fucking robbed! I was SICK and I started to panic. \n\nSomeone then started shouting “BRIAN!” which is my dads name, and slamming my parents door open. \n\nThis man shouted “Brian get up, I’m having another heart attack and you need to take me to the hospital.” \n\nTurns out it was our family friend who lived right behind us having his second heart attack, lol. I went from “holy shit someone is robbing us and I might die” to “holy shit family friend is going to die” and it was crazy whiplash and I’ll never forget how physically sick this whole less-than-a-minute ordeal made me feel. \n\nFamily friend is ok :) he lived. He was fine. Still haven’t forgiven him for scaring the shit out of me though.",
   "created_utc": 1690932826,
   "score": 15,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jueyqa3",
   "message": "I know I keep repeating myself, but this is true. My wife divorcing me. She was a lying, cheating, thieving, good for nothing, but I loved her. Still is the worst pain ever.",
   "created_utc": 1690934250,
   "score": 15,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juei6q3",
   "message": "Added olive oil to a stainless steel pot that was way too hot, caught on fire and I flipped out. Thought the fucking house was going to burn down.",
   "created_utc": 1690927315,
   "score": 13,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue808c",
   "message": "Watching the Russian lathe accident.",
   "created_utc": 1690923413,
   "score": 9,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue8vtl",
   "message": "Took a right on red without checking when i was a dumb teenager. There was a UPS truck coming at 50mph that luckily had just enough time to swerve around me into the oncoming traffic lane. Likely would've been dead or life-altering injuries if that driver hadn't been paying attention.",
   "created_utc": 1690923740,
   "score": 10,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juebcis",
   "message": "My partner and I were targeted in a homophobic hate crime. It happened on a bus and no one, including the driver helped - even though the guy was threatening to stab us. We got off the bus and had to run and hide as he also got off and tried to follow us. We went straight to the police and they did nothing, despite confirming they would be treating it as a hate crime.",
   "created_utc": 1690924671,
   "score": 16,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juevn7e",
   "message": "My husband becoming severely bipolar at 50 after taking a big dose of shrooms. The man I married is gone and I have a scary, angry, loud, violent man in his place.",
   "created_utc": 1690932932,
   "score": 16,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf12te",
   "message": "I was thrown in a pit dug in the ground high in the Sierra Mazateca in Mexico for 4 days back in 1977. The Mexican army, which used it as a jail and holding pen, covered the top with branches at night but we still got soaked when it rained and had to do our business there in the mud where we slept.",
   "created_utc": 1690935273,
   "score": 5,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf3oc3",
   "message": "Being chronically I’ll for the last twelve years and all the things I’ve had to do to survive because of it. Poverty is not joke nor is feeling like shit and helpless all day every day. So many insanely stressful moments at this point.",
   "created_utc": 1690936402,
   "score": 5,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue4occ",
   "message": "Lying on the floor bleeding out  and knowing I was going to die.",
   "created_utc": 1690922182,
   "score": 12,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue7z3r",
   "message": "This afternoon, I cut my finger when I dropped a laundry basket basket, slicing into the skin good, but no stitches needed. Hubby bandaged it up, and I was fine wne went on. Jump ahead a few hours to get ready for work, I wanted to rebandage it. I went weak, felt sick, my ENTIRE body perspired. Like everywhere, even the tops of my hands had glistening sweat, my scalp, everything. Paired with the nausea and dry heaving while my husband was just trying to put another bandage on was worse than any anxiety attack or post giving birth scar care. It's definitely my most stomach churning thing.",
   "created_utc": 1690923401,
   "score": 10,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf0cb5",
   "message": "this is not the only “worst” pains i’ve had, but it’s up there.\n\nwhen i was 9 years old i was jumping on a friend’s trampoline and fell, ribs-first, directly onto the springs. it felt like i smashed a rib but i went on playing. a few days later my side is aching and incredibly sensitive to touch. my elementary school nurse sent me home, where my mother then took me to the hospital.\n\nmy doctor had a very strange hunch and sent me to get an ultrasound the same day. i ended up being there for many hours because they “found something.” my mother was literally crying and shaking with how worried she was (i was somewhat tame).\n\na few hours and many ultrasounds later they found what’s called a mega-ureter (the tube from one of my kidneys to my bladder was inflamed and slowly destroying said kidney). it was complete luck that they found it. \n\nit’s a birth defect that affects, i think, less than 1% of people, and i had backed up urine in my kidney, which caused the intense pain. if untreated, it could’ve killed me eventually (not before showing itself through pain). i had the longest recovery from surgery and it defined my childhood. i still have both kidneys but one doesn’t work as well. luckily i didn’t lose it.",
   "created_utc": 1690934948,
   "score": 4,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf2w51",
   "message": "A couple months ago it was the first day of a two week family vacation in South America. My dad, mom, girlfriend, and I were sitting outside at a restaurant for lunch. After we were done eating I got up to use the bathroom and was gone for like 2 minutes. When I got back from the bathroom, all hell was breaking loose and my dad was on the ground having a seizure and turning very blue. I thought for sure I was watching him die and it all felt so surreal. Like a terrible nightmare. Luckily he ended up being ok after a night in the hospital, but I still can’t get the image out of my head.",
   "created_utc": 1690936058,
   "score": 6,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juexxuc",
   "message": "Thinking back, it was probably the years from age  9-20. While home was fine, everywhere else was horrible, getting beaten and bullied on an almost daily basis  and living in fear for my life.\n\nI was threatened with knives, nooses and burned with cigarettes and more.\n\nMessed me up so bad that I went into lines of work putting me in similar situations just because it was everything I knew. (And I could help protect others from it)",
   "created_utc": 1690933913,
   "score": 3,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf5kwj",
   "message": "My friends burning alive inside a warehouse while I was helpless to do fucking anything at all.\n\nObviously, still have nightmares to this day. I'll never forget once the sun came up and everyone's cars were just sitting around, as if our friends could still just walk over to their vehicles.",
   "created_utc": 1690937242,
   "score": 3,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufa7w0",
   "message": "My dog pissed on his puke and then ate it",
   "created_utc": 1690939290,
   "score": 4,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juesefx",
   "message": "it happened 3 days ago.\n\ni was being stupid with a friend \u0026amp; i ended up being sprayed by a skunk. just purely embarrassing \u0026amp; gross.",
   "created_utc": 1690931555,
   "score": 5,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juevzuq",
   "message": "I almost got run over by two cars once. I stepped backwards to avoid getting hit by the first one and then forward again to avoid the second one. They crashed each other, after they didn't stop at a red light. I was still high on adrenaline when I got to my mom's workplace and promptly broke into sobs when I saw her.",
   "created_utc": 1690933080,
   "score": 3,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf1s18",
   "message": "Nearly being hit head-on in my car by another which jumped a rise in front of me airborne. I had to pull off the road and sit a little while.",
   "created_utc": 1690935576,
   "score": 3,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf5k0a",
   "message": "When I had my seizure probably. I don't remember much really. I was arguing with my mom before my vision went dark. I told her I couldn't see so she just walked closer to me so I shouted \"No, mom I can't see.\" And then a swirl. Like I was dreaming. It was some sort of loop of the characters on Ouran Highschool Host Club running while roses fell behind them (I had watched that show that day) all while reassuring myself id be okay. I woke up on the floor and my mom shaking me yelling my name while my sister was crying. I then stood up and said \"I feel tired. I think I'm gonna take a nap.\" As if nothing happened. My mom looked at me in shock and explained that I had suddenly collapsed before my eyes rolled in the back of my head and I began to gasp for air suddenly. \n\nAnytime I even sorta feel those symptoms before it happened I start panicking.",
   "created_utc": 1690937232,
   "score": 3,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf5kll",
   "message": "Fleeing my home due to war.",
   "created_utc": 1690937239,
   "score": 3,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufa59e",
   "message": "I found out my pregnant wife was talking to her estranged ex husband (everyone thought he was dead for 10 years). Took on her step kids, and was prego with our first. \n\nThat shit changed me forever. Never ever felt…so hurt, or betrayed.",
   "created_utc": 1690939258,
   "score": 3,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufahqk",
   "message": "Almost raped by ex's friend when I was 18. He came to pick me up from one party to another party that my ex was at. Took a swig of rum from a bottle he handed to me and woke up in a hotel room half naked and the dude was in the shower. somehow was able to get up, grab my bag and run out the hotel because i knew if i didn't leave now something bad would happen. \n\nlearned from a very sweet homeless man who asked if i was ok that the closest metro station was 30 min by CAR and i had no cellular battery and was an international student so i had no family in the country either",
   "created_utc": 1690939412,
   "score": 3,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufcvsb",
   "message": "Sleeping over at Grandma's, one of her Jesus statuettes turned its fucking head to lean the opposite way. Thought I was tripping but my brother saw it too and ran tf out of the room. 😂. I never ever went back to her house till the day she died.",
   "created_utc": 1690940491,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufdpdw",
   "message": "I got up too quickly after lying down from a long tiring day at the cottage … and passed out. \n\nTo me, I went into a kind of dream state. When I woke up, I was an the floor and everyone was screaming and carrying on. I wasn’t in pain exactly, but for some reason I was all wet. \n\nI soon realized the wet was blood, pouring out of my face. I had fallen, and hit my head on a cast iron stove, which came very close to killing me. \n\nThe ambulance came - it was pretty remote, so I was impressed they made it down the dirt road. I was lucky: no bleeding in the brain, no permanent disfigurement. But it was pretty terrifying.",
   "created_utc": 1690940862,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juefy17",
   "message": "Sleep paralysis",
   "created_utc": 1690926444,
   "score": 4,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf1e6h",
   "message": "I was molested as a 5-6 year old by my dad’s best friend. I don’t know how many times, I’ve blocked it out for the most part. I was also molested repeatedly by my karate teacher for years, my mother knew about it and continued to force me to attend so she could have some “me time”.",
   "created_utc": 1690935409,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf3qct",
   "message": "Based on number of nightmares since - falling through the ice on a river one night.\n\nKnew the ice wasn't likely thick enough yet, but... I tried to scoot across anyway.   Even took my coat off to save weight.\n\nBroke through, and the current pulled me downstream from the hole, so - I was on the wrong side of the ice.  Luckily, not a big river or too deep, so I went for the bank and stood up to break back through.\n\nI wasn't actually scared during it, mostly I was in overdrive until I was out.\n\nThen it all hit me.",
   "created_utc": 1690936426,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf7yj3",
   "message": "When my mom found out about my SH and forced me to show her both of my arms while I begged her to stop and screamed at her and sobbed",
   "created_utc": 1690938282,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufa5aj",
   "message": "When i sat in hospital in the intensive care facility, i already knew about my life changing health issues for a couple hours at this point, but when i had some minutes for myself and really think about what it meant... Shit man, you always think it can happen to anyons, but you usually don't think that \"anyone\" could be you...",
   "created_utc": 1690939258,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juffc7m",
   "message": "Had a guy pull up in his car and point a gun at me and start yelling at me",
   "created_utc": 1690941596,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf4gx1",
   "message": "Running from the Sheriff on my GSX-R.. 17 years ago..",
   "created_utc": 1690936757,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufgzkn",
   "message": "Finding out that I had breast cancer.\n\nI almost didn't have the biopsy, because the doctor (a woman BTW) said it looked to her like scar tissue.",
   "created_utc": 1690942356,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufh12l",
   "message": "i was biking home from tennis practice, when i lose control of the bike and veer into the road.  car slams on the brakes, i go flying, break my collarbone and my bike along with a large gash along my leg.  the car was going 50 in a school zone.  america moment.",
   "created_utc": 1690942376,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufh2q7",
   "message": "I was working in a facility that served the houseless and mentally ill. Two men got into a minor (sounding) argument while they were walking down the stairs. The larger of the two picked the other guy up, lifted him over his head, spun him and threw him head first down two flights of stairs, His head hit the wall before hitting the concrete.",
   "created_utc": 1690942397,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufi8uk",
   "message": "Watching my mom die in the hospital. 15 days ago.",
   "created_utc": 1690942940,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufio4r",
   "message": "I thought the love of my life was dead for a few seconds.",
   "created_utc": 1690943137,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufis8t",
   "message": "My husband dragging our toddler off the bottom of our pool",
   "created_utc": 1690943191,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufjeb5",
   "message": "Knocked over a propane tank that cracked and started spraying in my garage. Gas water heater. Made it through the door about a half-second before ignition. Do not recommend.",
   "created_utc": 1690943479,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufjh9o",
   "message": "Bipolar disorder. Psychosis is dreadful, I wouldn’t wish it on my worst enemy.",
   "created_utc": 1690943520,
   "score": 1,
   "submission_id": "15fnz0c"
  }
 ]
}