{
 "submission_id": "15fnz0c",
 "title": "[Serious] What is the scariest, most dreadful, horrifying, stomach churning thing that has ever happened to you?",
 "selftext": "",
 "created_utc": 1690922087,
 "permalink": "/r/AskReddit/comments/15fnz0c/serious_what_is_the_scariest_most_dreadful/",
 "score": 68,
 "url": "https://www.reddit.com/r/AskReddit/comments/15fnz0c/serious_what_is_the_scariest_most_dreadful/",
 "comments": [
  {
   "comment_id": "jue4f0s",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1690922088,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue565y",
   "message": "When my car skidded off an icy road and rolled onto its roof. I was eight months pregnant and my two year old was in his car seat in the back. We ended up hanging upside down. If not for my seat belt and that car seat, it would have been bad news.",
   "created_utc": 1690922367,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue7s1s",
   "message": "After not swimming in years and remembering how good I *used* to be, I went swimming in a lake last summer. I was trying to swim over to one of those giant logs that separates the water into boating and non boating areas. Got about half way and I got tired. Looked forward, not that close. Looked back, not that close. Started panicking and swallowing water for a sec until I remembered that if I calm down and lay back I could float and sorta slowly swim to it.",
   "created_utc": 1690923329,
   "score": 82,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juel7rv",
   "message": "Home alone for one of the first time. I was 14, parents were gone for 2 nights for their anniversary. Got up at 2am to use the bathroom as i was washing my hands there was foot sliding sounds right outside the door. *fffffft ffffffft ffffffft* i held my breath and went white as a ghost, i stood in dead silence for what felt like minutes. The sounds didnt stop. I finally noticed above the mirror was a moth its wings was the fffffff sound and it was bumping into the wall and lights for the step sound. That feeling of relief is unforgettable.",
   "created_utc": 1690928530,
   "score": 111,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue92o9",
   "message": "When I was 5 I had appendicitis but Dr’s thought I was lying about my stomach pain so they sent me home. \n\nMy parents brought me back to the ER that night with excruciating abdomen pain. The nurse only gave me a warm pillow for my stomach.\n\nTurns out My appendix ruptured and I was rushed into surgery. \n\nI now have a 5.5 inch scar down the middle of my stomach and I don’t remember much from that night. \n\nI think I almost died but my parents don’t mention that part.",
   "created_utc": 1690923812,
   "score": 248,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juee0qj",
   "message": "I was molested as a child for years. Its been over 20 years, but I can still see, hear, smell and feel everything. No therapy and no medication will ever make me function again. Second to that is witnessing my dad convulsing on the floor, he couldnt stop drinking. He died a little while later in the hospital, I was 10 and coudlnt say goodbye.",
   "created_utc": 1690925694,
   "score": 171,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juek2gc",
   "message": "I had a near heart attack. \n\nI was on the floor in our garage screaming in pain. And like a fool, when the pain subsided I got up a drove 2 1/2 hours for Christmas. My wife’s friend, a nurse, urged me to go to the clinic, the clinic sent me to the ER ‘as fast as you can get there’, and I ended up having quintuple bypass surgery. \n\nThe surgeon wasn't amused.",
   "created_utc": 1690928067,
   "score": 144,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jueow2y",
   "message": "I had migraines for about 6 months which were getting progressively worse. MRI came back negative for brain tumors, doctor tried several medicines before putting me on Imitrex. \n\nHe said if I felt a migraine coming on, take one and lay down. So one day I got home from work and my head began to spin so I took one. \n\nThe headache never subsided. I first noticed my heart began beating erratically, out of control. I almost grabbed my chest…..but was completely paralyzed. I could not move my body in any way shape or form, to dial a phone or alert anyone (I lived alone at the time). The muscles on the sides of my neck and my legs began to pulsate very fast and hard, spasming over and over again but again, I could not move. For and full minute, my lungs stopped working and I couldn’t draw breath. Finally, I could draw breath, the spasms stopped I could move. Called my doctor immediately wondering if I needed to go to the ER and he said to never take one again and would mark me as allergic. I laid there until everything was working fine again. \n\nI will never take that shit again. It was the first time in my life I felt like I was truly dying and there was nothing I could do.",
   "created_utc": 1690930068,
   "score": 198,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juempki",
   "message": "My best friend drank a concoction before school that he thought was only liquor. (Admittedly not good, but normal for him.) The guy who gave it to him also added codeine without him knowing. Long story short, he threw up in class and passed out in his vomit. I had to perform CPR while the medics came, I thought he was going to die. I was shaking and holding back tears for the rest of the day. Failed my math test lol. He was in a coma for a week and went through like 4 IV bags. I had given him a breakfast taco that morning, which the doctor said caused him to vomit and likely saved his life. His BAC was well above the lethal amount. He now has a tattoo on his shoulder of the drake hands (from the cover of “if you’re reading this it’s too late”) holding a taco. He was scolded by my friend group and I and had to go to juvie for awhile, with the guy that drugged him. He’s doing good now.",
   "created_utc": 1690929150,
   "score": 139,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juebbhd",
   "message": "had a stroke.\n\nmy face drooped, I couldn't talk right, words were slured and jumbled.\n\nleft arm and leg gave out on me. I hit the floor.\n\nPT helped but I still have a weak left side and somehow developed a stutter.",
   "created_utc": 1690924660,
   "score": 221,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue6u8a",
   "message": "I was 3. My babysitter's BF took me to a man who orally raped me. At a \"party\".",
   "created_utc": 1690922987,
   "score": 80,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juebref",
   "message": "Being told at school that my friend had just tried to commit suicide and that they were hospitalised. I still get nightmares about the moment I was called out of class to the counsellors office. Worst part was, no one thought they were gonna make it and I wasn’t allowed to leave school to go see them. They’re okay now, thank god, but nothing in my life has ever topped that moment as the worst day of my life",
   "created_utc": 1690924830,
   "score": 95,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jueyc10",
   "message": "A man came to my secluded home when my parents were at work. He told me that my mother had left a check for him for charity, and if I let him in he could find it quickly and leave. I was 11 years old and incredibly naïve and I almost let him in. The only thing between us was a thin screen door with a weak lock, which he began to pull at and test.\n\nMy usually sweet, nervous lab began to growl at him, and two friends I had brought  home with me, against explicit instructions, came into the room to join me.\n\nI guess three kids and a furious dog were too much risk, because he muttered something and left. I try not to think about his plans for me, or about the other man that was waiting in his truck the whole time.",
   "created_utc": 1690934081,
   "score": 215,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jueveb3",
   "message": "I handle surprises and traumas pretty well, weirdly enough, despite my PTSD lol. My ex tried to hurt/kill me, my dad was dying, I’m a survivor of CSA, I’ve just *dealt* with things. But there was one time something happened that I was totally NOT chill about. \n\nMy parents and I lived in a single trailer home, so sound travelled fairly easily. It was the middle of the night, completely dark, and I heard the front door slam. I knew for a fact my brother was away, and both my parents were home and in bed and hadn’t left. Then I heard fast stomping coming down the hallway and I thought we were getting fucking robbed! I was SICK and I started to panic. \n\nSomeone then started shouting “BRIAN!” which is my dads name, and slamming my parents door open. \n\nThis man shouted “Brian get up, I’m having another heart attack and you need to take me to the hospital.” \n\nTurns out it was our family friend who lived right behind us having his second heart attack, lol. I went from “holy shit someone is robbing us and I might die” to “holy shit family friend is going to die” and it was crazy whiplash and I’ll never forget how physically sick this whole less-than-a-minute ordeal made me feel. \n\nFamily friend is ok :) he lived. He was fine. Still haven’t forgiven him for scaring the shit out of me though.",
   "created_utc": 1690932826,
   "score": 98,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jueyqa3",
   "message": "I know I keep repeating myself, but this is true. My wife divorcing me. She was a lying, cheating, thieving, good for nothing, but I loved her. Still is the worst pain ever.",
   "created_utc": 1690934250,
   "score": 34,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juei6q3",
   "message": "Added olive oil to a stainless steel pot that was way too hot, caught on fire and I flipped out. Thought the fucking house was going to burn down.",
   "created_utc": 1690927315,
   "score": 84,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue808c",
   "message": "Watching the Russian lathe accident.",
   "created_utc": 1690923413,
   "score": 14,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue8vtl",
   "message": "Took a right on red without checking when i was a dumb teenager. There was a UPS truck coming at 50mph that luckily had just enough time to swerve around me into the oncoming traffic lane. Likely would've been dead or life-altering injuries if that driver hadn't been paying attention.",
   "created_utc": 1690923740,
   "score": 75,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juebcis",
   "message": "My partner and I were targeted in a homophobic hate crime. It happened on a bus and no one, including the driver helped - even though the guy was threatening to stab us. We got off the bus and had to run and hide as he also got off and tried to follow us. We went straight to the police and they did nothing, despite confirming they would be treating it as a hate crime.",
   "created_utc": 1690924671,
   "score": 64,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juevn7e",
   "message": "My husband becoming severely bipolar at 50 after taking a big dose of shrooms. The man I married is gone and I have a scary, angry, loud, violent man in his place.",
   "created_utc": 1690932932,
   "score": 136,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf12te",
   "message": "I was thrown in a pit dug in the ground high in the Sierra Mazateca in Mexico for 4 days back in 1977. The Mexican army, which used it as a jail and holding pen, covered the top with branches at night but we still got soaked when it rained and had to do our business there in the mud where we slept.",
   "created_utc": 1690935273,
   "score": 83,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf3oc3",
   "message": "Being chronically I’ll for the last twelve years and all the things I’ve had to do to survive because of it. Poverty is no joke, nor is feeling like shit and helpless all day every day. So many insanely stressful moments at this point.",
   "created_utc": 1690936402,
   "score": 18,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue4occ",
   "message": "Lying on the floor bleeding out  and knowing I was going to die.",
   "created_utc": 1690922182,
   "score": 21,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue7z3r",
   "message": "This afternoon, I cut my finger when I dropped a laundry basket basket, slicing into the skin good, but no stitches needed. Hubby bandaged it up, and I was fine wne went on. Jump ahead a few hours to get ready for work, I wanted to rebandage it. I went weak, felt sick, my ENTIRE body perspired. Like everywhere, even the tops of my hands had glistening sweat, my scalp, everything. Paired with the nausea and dry heaving while my husband was just trying to put another bandage on was worse than any anxiety attack or post giving birth scar care. It's definitely my most stomach churning thing.",
   "created_utc": 1690923401,
   "score": 22,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf0cb5",
   "message": "this is not the only “worst” pains i’ve had, but it’s up there.\n\nwhen i was 9 years old i was jumping on a friend’s trampoline and fell, ribs-first, directly onto the springs. it felt like i smashed a rib but i went on playing. a few days later my side is aching and incredibly sensitive to touch. my elementary school nurse sent me home, where my mother then took me to the hospital.\n\nmy doctor had a very strange hunch and sent me to get an ultrasound the same day. i ended up being there for many hours because they “found something.” my mother was literally crying and shaking with how worried she was (i was somewhat tame).\n\na few hours and many ultrasounds later they found what’s called a mega-ureter (the tube from one of my kidneys to my bladder was inflamed and slowly destroying said kidney). it was complete luck that they found it. \n\nit’s a birth defect that affects, i think, less than 1% of people, and i had backed up urine in my kidney, which caused the intense pain. if untreated, it could’ve killed me eventually (not before showing itself through pain). i had the longest recovery from surgery and it defined my childhood. i still have both kidneys but one doesn’t work as well. luckily i didn’t lose it.",
   "created_utc": 1690934948,
   "score": 37,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf2w51",
   "message": "A couple months ago it was the first day of a two week family vacation in South America. My dad, mom, girlfriend, and I were sitting outside at a restaurant for lunch. After we were done eating I got up to use the bathroom and was gone for like 2 minutes. When I got back from the bathroom, all hell was breaking loose and my dad was on the ground having a seizure and turning very blue. I thought for sure I was watching him die and it all felt so surreal. Like a terrible nightmare. Luckily he ended up being ok after a night in the hospital, but I still can’t get the image out of my head.",
   "created_utc": 1690936058,
   "score": 80,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juexxuc",
   "message": "Thinking back, it was probably the years from age  9-20. While home was fine, everywhere else was horrible, getting beaten and bullied on an almost daily basis  and living in fear for my life.\n\nI was threatened with knives, nooses and burned with cigarettes and more.\n\nMessed me up so bad that I went into lines of work putting me in similar situations just because it was everything I knew. (And I could help protect others from it)",
   "created_utc": 1690933913,
   "score": 14,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf5kwj",
   "message": "My friends burning alive inside a warehouse while I was helpless to do fucking anything at all.\n\nObviously, still have nightmares to this day. I'll never forget once the sun came up and everyone's cars were just sitting around, as if our friends could still just walk over to their vehicles.",
   "created_utc": 1690937242,
   "score": 43,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufa7w0",
   "message": "My dog pissed on his puke and then ate it",
   "created_utc": 1690939290,
   "score": 23,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juesefx",
   "message": "it happened 3 days ago.\n\ni was being stupid with a friend \u0026amp; i ended up being sprayed by a skunk. just purely embarrassing \u0026amp; gross.",
   "created_utc": 1690931555,
   "score": 16,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juevzuq",
   "message": "I almost got run over by two cars once. I stepped backwards to avoid getting hit by the first one and then forward again to avoid the second one. They crashed each other, after they didn't stop at a red light. I was still high on adrenaline when I got to my mom's workplace and promptly broke into sobs when I saw her.",
   "created_utc": 1690933080,
   "score": 30,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf1s18",
   "message": "Nearly being hit head-on in my car by another which jumped a rise in front of me airborne. I had to pull off the road and sit a little while.",
   "created_utc": 1690935576,
   "score": 20,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf5k0a",
   "message": "When I had my seizure probably. I don't remember much really. I was arguing with my mom before my vision went dark. I told her I couldn't see so she just walked closer to me so I shouted \"No, mom I can't see.\" And then a swirl. Like I was dreaming. It was some sort of loop of the characters on Ouran Highschool Host Club running while roses fell behind them (I had watched that show that day) all while reassuring myself id be okay. I woke up on the floor and my mom shaking me yelling my name while my sister was crying. I then stood up and said \"I feel tired. I think I'm gonna take a nap.\" As if nothing happened. My mom looked at me in shock and explained that I had suddenly collapsed before my eyes rolled in the back of my head and I began to gasp for air suddenly. \n\nAnytime I even sorta feel those symptoms before it happened I start panicking.",
   "created_utc": 1690937232,
   "score": 32,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf5kll",
   "message": "Fleeing my home due to war.",
   "created_utc": 1690937239,
   "score": 66,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufa59e",
   "message": "I found out my pregnant wife was talking to her estranged ex husband (everyone thought he was dead for 10 years). Took on her step kids, and was prego with our first. \n\nThat shit changed me forever. Never ever felt…so hurt, or betrayed.",
   "created_utc": 1690939258,
   "score": 41,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufahqk",
   "message": "Almost raped by ex's friend when I was 18. He came to pick me up from one party to another party that my ex was at. Took a swig of rum from a bottle he handed to me and woke up in a hotel room half naked and the dude was in the shower. somehow was able to get up, grab my bag and run out the hotel because i knew if i didn't leave now something bad would happen. \n\nlearned from a very sweet homeless man who asked if i was ok that the closest metro station was 30 min by CAR and i had no cellular battery and was an international student so i had no family in the country either",
   "created_utc": 1690939412,
   "score": 95,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufcvsb",
   "message": "Sleeping over at Grandma's, one of her Jesus statuettes turned its fucking head to lean the opposite way. Thought I was tripping but my brother saw it too and ran tf out of the room. 😂. I never ever went back to her house till the day she died.",
   "created_utc": 1690940491,
   "score": 20,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufdpdw",
   "message": "I got up too quickly after lying down from a long tiring day at the cottage … and passed out. \n\nTo me, I went into a kind of dream state. When I woke up, I was an the floor and everyone was screaming and carrying on. I wasn’t in pain exactly, but for some reason I was all wet. \n\nI soon realized the wet was blood, pouring out of my face. I had fallen, and hit my head on a cast iron stove, which came very close to killing me. \n\nThe ambulance came - it was pretty remote, so I was impressed they made it down the dirt road. I was lucky: no bleeding in the brain, no permanent disfigurement. But it was pretty terrifying.",
   "created_utc": 1690940862,
   "score": 47,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juefy17",
   "message": "Sleep paralysis",
   "created_utc": 1690926444,
   "score": 7,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf1e6h",
   "message": "I was molested as a 5-6 year old by my dad’s best friend. I don’t know how many times, I’ve blocked it out for the most part. I was also molested repeatedly by my karate teacher for years, my mother knew about it and continued to force me to attend so she could have some “me time”.",
   "created_utc": 1690935409,
   "score": 14,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf3qct",
   "message": "Based on number of nightmares since - falling through the ice on a river one night.\n\nKnew the ice wasn't likely thick enough yet, but... I tried to scoot across anyway.   Even took my coat off to save weight.\n\nBroke through, and the current pulled me downstream from the hole, so - I was on the wrong side of the ice.  Luckily, not a big river or too deep, so I went for the bank and stood up to break back through.\n\nI wasn't actually scared during it, mostly I was in overdrive until I was out.\n\nThen it all hit me.",
   "created_utc": 1690936426,
   "score": 29,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf7yj3",
   "message": "When my mom found out about my SH and forced me to show her both of my arms while I begged her to stop and screamed at her and sobbed",
   "created_utc": 1690938282,
   "score": 6,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufa5aj",
   "message": "When i sat in hospital in the intensive care facility, i already knew about my life changing health issues for a couple hours at this point, but when i had some minutes for myself and really think about what it meant... Shit man, you always think it can happen to anyons, but you usually don't think that \"anyone\" could be you...",
   "created_utc": 1690939258,
   "score": 17,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juffc7m",
   "message": "Had a guy pull up in his car and point a gun at me and start yelling at me",
   "created_utc": 1690941596,
   "score": 4,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juf4gx1",
   "message": "Running from the Sheriff on my GSX-R.. 17 years ago..",
   "created_utc": 1690936757,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufgzkn",
   "message": "Finding out that I had breast cancer.\n\nI almost didn't have the biopsy, because the doctor (a woman BTW) said it looked to her like scar tissue.",
   "created_utc": 1690942356,
   "score": 8,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufh12l",
   "message": "i was biking home from tennis practice, when i lose control of the bike and veer into the road.  car slams on the brakes, i go flying, break my collarbone and my bike along with a large gash along my leg.  the car was going 50 in a school zone.  america moment.",
   "created_utc": 1690942376,
   "score": 19,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufh2q7",
   "message": "I was working in a facility that served the houseless and mentally ill. Two men got into a minor (sounding) argument while they were walking down the stairs. The larger of the two picked the other guy up, lifted him over his head, spun him and threw him head first down two flights of stairs, His head hit the wall before hitting the concrete.",
   "created_utc": 1690942397,
   "score": 4,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufi8uk",
   "message": "Watching my mom die in the hospital. 15 days ago.",
   "created_utc": 1690942940,
   "score": 11,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufio4r",
   "message": "I thought the love of my life was dead for a few seconds.",
   "created_utc": 1690943137,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufis8t",
   "message": "My husband dragging our toddler off the bottom of our pool",
   "created_utc": 1690943191,
   "score": 27,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufjeb5",
   "message": "Knocked over a propane tank that cracked and started spraying in my garage. Gas water heater. Made it through the door about a half-second before ignition. Do not recommend.",
   "created_utc": 1690943479,
   "score": 11,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufjh9o",
   "message": "Bipolar disorder. Psychosis is dreadful, I wouldn’t wish it on my worst enemy.",
   "created_utc": 1690943520,
   "score": 20,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufps4q",
   "message": "My girlfriend and I just put our first offer on a house and I've never been this stressed in my life.",
   "created_utc": 1690946585,
   "score": 3,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufkkg1",
   "message": "Fell through a hole in a deck and laid my entire  shin open to the bone in the process. I am also on Xarelto and bled like you wouldn't believe from the wound. I fortunately stopped the bleeding, because I was at least a half hour from any medical help. Would not recommend.",
   "created_utc": 1690944035,
   "score": 11,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufo63r",
   "message": "Camping with my wife, kiddos, and pupper.  Middle of summer, middle of the night. Quiet, not even the slightest breeze blowing. Awakened from a dead sleep to the sounds of trees crashing down right beside the tent. All around us. I was sure that we were all about to get smushed. Apparently one huge one just fell over and brought a few other big ones down with it. I’ve never been as terrified as I was for those few moments. In the morning it looked like a war zone at our campsite. One big honkin tree was about 10’ from the tent. I still can’t believe we all walked away without a scratch.",
   "created_utc": 1690945776,
   "score": 25,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufqn9u",
   "message": "Pedestrian ran into traffic in front of me when I was going 35mph. Pedestrian was hit by the drivers side headlight essentially, right around his knee. Came up over the hood and straight through the windshield head first and on to the dashboard. Within a few seconds he rolled off the hood and onto the ground. This isnwhere the memory gets a bit fuzzy. All I remember is seeing him on the ground, with blood EVERYWHERE and his leg legitimately snapped, compound fracture style. \n\nThe next thing I remember is standing there with my hands over my head freaking the FUCK out as people helped him and screamed at me about what the fuck is wrong with me and what was I thinking. After that point it was entirely fear and dread like I've never felt before. In my mind, it was a forgone conclusion I was going to prison for killing a pedestrian. It looked like there was no way he survived and in my mind you don't just hit a person and get away with it.\n\nLong story short I was found at no fault thanks to security footage from a near by business. I'm still thankful my mind seemed to block out portions of it because the pieces that I do remember seriously fuck me up. I still have pictures of my car afterwards, which I still own as it's my favorite/heavily modified. It honestly ruined the car for me but I can't get rid of it.",
   "created_utc": 1690947023,
   "score": 51,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufqrij",
   "message": "Cancer. It’s gone now, 36 years.",
   "created_utc": 1690947082,
   "score": 43,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufk4z1",
   "message": "I spent 3 days in pain, begging to be taken to the hospital. Ex didn't wanna put his stupid video games down to take me. Finally said either take me or in calling an ambulance. He relented and I was admitted for being septic. Doctor said a few more hours and I would have been in ICU in a medically induced coma. Spent 20 days in the hospital, lost 30 pounds and came home to find the whole house was demolished. Nobody had cleaned anything the entire time I was in the hospital. First thing he said after we got home was \"when are you gonna wash clothes?\" \n\nThat was my breaking point and a few months later I left and divorced him.",
   "created_utc": 1690943831,
   "score": 57,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufk7om",
   "message": "2 things, I was in a dance camp practicing my monolouge but I didn’t know the rest of the group got ice cream from the ice cream truck outside. When I came out of one of the performing rooms and saw no one else in the building I freaked out. I looked EVERYWHERE, and I convinced myself there was an active shooter and they were all hiding or there was some sort of gas explosion. I got myself all worked up so I called the place I was in and they answered. Turns out the moment I called is the moment they came in. I walked out to the lobby and saw everybody with ice cream meanwhile I was sitting there waiting for my death. That happened a long time ago though haha. Oh and the other thing was one time I was hiking with some friends and they wanted to catch a frog on the field. I was confused because it was only just dirt so I stepped to go near the frog. It wasn’t dirt. It was mud. My whole foot got swallowed in it, worse knowing I was wearing white adidas.",
   "created_utc": 1690943868,
   "score": 4,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufohpq",
   "message": "Confusional migraine when I was 16 \n\nImagine having what you thought was an average headache which suddenly turned into you forgetting almost everything you know.",
   "created_utc": 1690945937,
   "score": 7,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufokwb",
   "message": "A guy tried to abduct me when I was 16. I was pumping gas and he tried to push me into a van.",
   "created_utc": 1690945982,
   "score": 12,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufp3dw",
   "message": "Going in and out of consciousness while I was being carted away from a bar after being drugged. he carried my semi limp body which could barely feel to a room/bed and proceeded to not only rape me but also try to murder me by choking. I think because I'm a redhead and metabolised the drugs away faster is why I was able to kick him off and have my legs barely take me to a single stall washroom and lock myself in. his dick was down my throat and hands on my throat too and I couldn't breathe, his whole body on top of me. I spent the night drinking toilet water to recover, while being completely naked. in the morning I somehow peeled myself out of the washroom and by some amazing luck I was in my hotel and just had to find my room vs being in some very off place. found a towel to cover up and miraculously made it without many seeing to get a key and get back into my room. totally shaken and destroyed. rest of the trip my sister was just mad at me for being mopey and being late that morning for nothing important. she isn't the kind of sister I could ever tell about this.",
   "created_utc": 1690946240,
   "score": 17,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufpflc",
   "message": "Coming to my grandfather's home who has long since been dead to bury his son, my dad (56m) to his wake in a third world country and a place I never thought to have had step foot in again. I and my sisters arrived very late 3am being greeted by mourners and my father's family seeing Aunts and Uncles I had not seen since we left my father. I didn't know it was a glass coffin for the wake and my Uncle tooks one by one to see him. \n\nI saw how horrible the funeral home had done to him. It was like they just took him from his hospital room and just dressed him in someone's suit. His face had sunken inwards decaying. It wasn't him, only his hands are what I remembered those were my dad's hands covered in callous, wrinkled and spotted with his bracelets and ring. It was all that was left of being familiar, I remember just walking away. All the way up to the floor where my grandparents' room use to be and across was my father's bedroom. I remember bursting in and saw his lights were on inside then I knew the hallway I was in and I remembered the night we left him. \n\nTurns out my oldest brother (one of seven kids) was inside whether crying or asleep that just shook me back into more trauma than I anticipated from then on the funeral just made thing worse. I'm getting better now but that almost close to death last year this was the hardest.",
   "created_utc": 1690946411,
   "score": 6,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufqkbs",
   "message": "Years ago, my uncle attacked my mom(his sister) with a ball peen hammer. Leaving her hospitalized. Fam did what most do, visited with her, updates from Dr, and visited with each other. Drs kept her over night, to make sure no brain damage/injury, as one strike was behind an ear. Fast forward to 5 am next morning. Mom calls me crying, could barely understand her. Same uncle, went to my parents home. Poured gas along the back door, and lit it. My dad, woke up, saw fire, ran to wake my brother, his fiancée and their 10 month old baby. Brother left first, fiancée with child, then my dad. As my brother stepped off the stairs, my uncle shot at them five times with a shotgun. Striking my brother three times in the back. Dad scoops up my brother, they get in a vehicle to leave. Driving down the driveway, uncle steps out and shoots at the vehicle, busting the windshield.  They then drove two miles to my friend’s parents(the dad is Co sheriff). Grandpa hid the uncle after. While my dad, two living siblings and I, were holed up in my moms hospital room, with police guarding us, until they arrested my uncle. Happened 19 years ago, the anniversary was recently, and it seems like yesterday. (Thanks OP for asking this ??, as getting a chance to talk about my trauma or my bro, can be good for me)",
   "created_utc": 1690946982,
   "score": 121,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufsubj",
   "message": "Worked my overnight call shift at the hospital during residency, checked myself into ED next day with an necrotic, painful testicle. Found out it was cancer that had spread. No sleep, shock, family and wife came to see me. Worst 36 hrs of my life. \n\nSurvived but the wounds still last and am still dealing with complications 5 years later while working full time.",
   "created_utc": 1690948170,
   "score": 10,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juflmos",
   "message": "The anesthetic wore off mid-way through my emergency c-section, (after ~24 hours of labor with a very stuck baby.) \n\nFeeling the doctor’s hands inside of my abdomen while they frantically tried to stop the bleeding and sew me back together was the grossest and wrongest thing I’ve ever felt. They couldn’t stop the bleeding so they paged a better surgeon and knocked me out once my son was out alive.\n\nStill the best day of my life, lol.",
   "created_utc": 1690944543,
   "score": 16,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufmaj5",
   "message": "Holding my breath as I hid from someone in the middle of the night.",
   "created_utc": 1690944857,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufl5bv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "juflbz0",
   "message": "Either one of the many freaky incidents I had growing up because my Dad was physically abusive to me, or getting assaulted at my job (low income/dv housing) by someone who had a foot of height and 6 inches of reach on me",
   "created_utc": 1690944400,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufnaif",
   "message": "i was getting a drink around 3am, im not usually scared of the dark but i was getting a weird feeling. when i started walking towards my bedroom i heard footsteps running towards me and almost shat my pants, it was my kitten",
   "created_utc": 1690945343,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufnha4",
   "message": "I was sexually assaulted at work by a patron in more or less broad daylight. I was able to get away shortly after it began but there's no telling what else would have happened if I couldn't get away. He was a regular at our establishment. We had a newish art piece on display upstairs that he thought was cool, asked me to take his picture next to it with his phone. Just as we got to that spot he whipped around and got me in a bear hug and started to kiss my neck. I yanked myself away, said something I don't really remember well very loudly and scurried back downstairs. My coworkers heard me and dealt with him. He was banned quite quickly and I took the rest of the day off. Hadn't seen him around for months until this morning when he bumbled in trying to get unbanned.(my place has a policy of banning being lifted if they have a sit down chat with our head of security about why they were suspended and assure it won't happen again) I felt my heart drop into my stomach and I ran off to the back.",
   "created_utc": 1690945436,
   "score": 9,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufnoco",
   "message": "One time, I was just kinda walking around and I had one arm in a cast (I broke that one prior to this incident) and I began to fall.\nGiven that my right arm, the dominant one, was in a cast, I had to catch myself with my other arm so I stuck it straight out.\nIf I recall correctly, my arm the sorta stuck out further back than it was supposed to.\nBut the fact that it happened isn't even the worst part. The worst part is that it happened when I was, like, a toddler. So you can probably imagine the absolute horror on my Mom's face.",
   "created_utc": 1690945534,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufpja9",
   "message": "Due to medical things I won't go into detail about I had to have a feeding tube surgically implanted into my small intestine. Naturally I was put under anesthesia when it was implanted. But when it was removed I was fully conscious and lucid when the doctor cut the stitches attaching the intake port and just ripped the entire half a meter long tube out of my abdomen in one go.",
   "created_utc": 1690946462,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufpjpq",
   "message": "Accidentally sending a msg to someone taking shit about them",
   "created_utc": 1690946468,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufqmfe",
   "message": "I played Roblox as a 10 y/o, met someone, had a friend group, one of those people made porn art of my avatar.",
   "created_utc": 1690947011,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufra4i",
   "message": "I beat a guy up at a bush party once. I thought I killed him. He was in a coma for 3 days. I didn't see any punishment for it. \n\nHe deserved every second of it. \n\nBut it was definitely one of those moments in your life that everything changed after it happened.",
   "created_utc": 1690947348,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufriei",
   "message": "Psychosis. I thought I died but something had gone wrong and I was \"stuck\" in my physical body, then thought I needed to kill myself to save the world, jumped off my 2nd floor balcony, then thought the whole world had been raptured except for me and the world was burning... and a million other things. I was hospitalized for 3 days, but didn't come out of anosognosia (lack of insight into depth of my illness) until 2-3 months later. I still can't really wrap my mind around it.",
   "created_utc": 1690947468,
   "score": 8,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufrlyh",
   "message": "I was laying on my bed watching TV on my phone at like 11 o'clock at night when all of a sudden with no sound my TV and Xbox turned on. These do not turn on together. they have to be turned on separately. both were on. my door was also open. I had closed in when I went in. also not the first time something really creepy happened in my room.",
   "created_utc": 1690947519,
   "score": 6,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufrtf3",
   "message": "Either the look on my dad’s face when he was twisting my arm behind my back, or the look on his face when he threatened to leave me in his home country (which we were visiting at the time) after getting me engaged to his brother’s son.\n\nEdit: or maybe the look on his and my mother’s face when they told me I wasn’t allowed to go to university due to being molested as a child- it was proof that I was ‘irresponsible’ and I’d ‘only let it happen again.’",
   "created_utc": 1690947628,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufsbjt",
   "message": "Driving through a tornado (not I wasn't a cast member in Twister). A few years back when my youngest siblings was a kid. Our mother, my two cousins,my Aunt Mary and I were heading up to Fort Wayne to pick up my half brother up (his Dad had custody long story). Anyway it was an awful stormy day violent thunderstorms all that. The minivan our aunt was driving has been bouncing all over the interstate. Well at one point the sky is a greenish black/purplish color and our van feels like it starting to lift up off the road and sort of lift off the road. My Aunt floors it just stay on the road. When She does this our minivan feels like it's about to tilt over but suddenly it rights it's self again at the same time I look up outside the window. I see a funnel cloud going back up and disappearing in the clouds.",
   "created_utc": 1690947894,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufsksg",
   "message": "Having an emergency hysterectomy because my doctor thought I had uterine cancer. By a miracle I didn't.",
   "created_utc": 1690948028,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufso0z",
   "message": "When my work colleague was murdered by serial killer Levi Bellfield",
   "created_utc": 1690948076,
   "score": 4,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufsvam",
   "message": "I was about 7 years old when this happened.\n\nI went to bed like usual but had a lamp on due to a night terror that I had about 2 months earlier (even now, over a decade later I still feel the side effects from it. But thats a story for another time). Went to sleep no big deal. Woke up in the middle of the night and couldn't breathe. Nothing I did helped. I ran to my parents room and was finally able to breath but couldn't speak. After a few minutes I was able to explain what happened. Went to the doctor and it turns out I had a severe asthma attack that was brought on by recent storms. Took me almost 3 years to treat it to where i didn't need my inhaler daily (still use it in emergencies but i am pretty much recovered). We had no idea I had asthma before hand.",
   "created_utc": 1690948184,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufthdv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufu47c",
   "message": "I'm a survivor of CSA, and general parental abuse in forms of physical, emotional, and most of the time neglect (undersocialized and sheltered). Also because of the neglect, I had a borderline violent sexual life with my high school boyfriend (who ended up shattering my body image and self esteem in a way i am still dealing with to this day) and was being groomed on the net since 11 years old. It all almost ruined my life. I was expelled in high school, had a misdemeanor, attempted my life a handful of times. \n\nObviously it was all pretty bad, but the worst thing about it all is seeing a therapist and realizing that nothing will make me feel like a human being at all.\n\nI do not emote most of the time, refuse to have my picture taken, and have aggression issues that I'm thankfully on top of. I am always ignoring the \"I will be paying for this for the rest of my life\" thought that is forever in my mind. \n\nHowever, through pure resilience (and a tiny bit of spite) I am doing really good now. I have a really great therapist, I'm starting college in 2 weeks, live with the love of my life of 4 years, have friends that love me and finally a healthy relationship with the family members that didn't hurt me in a horrible way. I don't love myself at all, but I can't help but love the signs of cosmic support whenever I decide to try for the day. \"It's the little things\" and all that",
   "created_utc": 1690948858,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufu6qa",
   "message": "I was watching \"All in the Family\"with my maternal grandmother (who raised me). It was episode where Edith was almost raped by a salesman? \n   Anyway it is late at night I say 2 or 3 'o'clock in the morning, it is getting to the scariest moment on that episode. When a neighbor who had moved in down the street raps (knocks)on our glass door window pane. Which scares the shit out of both of us. We naturally scream. The neighbor apologized and explained someone just ran over our cat and he had just finished putting it in our yard for us. \n   What a great way to meet a brand new neighbor. Guess who got the task of burying the cat. Yup me.",
   "created_utc": 1690948897,
   "score": 7,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufunvu",
   "message": "Either having the three (3) large pins in my elbow ripped out once the cast on my arm was taken off. I went to the hospital to get my cast taken off and, with NO warning or anesthetic and I don't know what I thought would happen, but not that.               That or breaking that arm. I swerved on my bike while only holding the handlebars with one hand and lost control, braked, flew off, and landed on my arm and snapped my humerus in half and got two greenstick fractures in my radius and ulna. My entire life flashed before my eyes and if I wasn't wearing a helmet, I wouldn't be typing this, four years later. I now can't feel half of my left forearm and hand.",
   "created_utc": 1690949161,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufv87k",
   "message": "Waking up one morning, caring for my late with in late stage breast cancer and finding her, lifeless in her bed.",
   "created_utc": 1690949475,
   "score": 4,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufvm8g",
   "message": "It all started when I was born",
   "created_utc": 1690949693,
   "score": 9,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufvs18",
   "message": "I was in my moms friends rv and I was making faces in the mirror in the bedroom at the end of the rv and out of the corner of my eye I saw a black Smokey tall figure (I mean pitch black) at the corner of the large square door and as soon as I looked at it it was gone. It might have been because I was tired but I saw it.",
   "created_utc": 1690949783,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufvxbk",
   "message": "Seeing my husband (then just best friend) in the hospital shortly after he was in a car accident that paralyzed him from the waist down and left him with multiple broken bones. We were 14 at the time, and seeing him like that was just haunting. He was in so much pain and so scared and I was afraid he was going to die, I had never seen anyone - let alone someone I cared for so much - in that kind of state in the hospital before.",
   "created_utc": 1690949869,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufw31p",
   "message": "Was fishing on one side of a river and my family was camping on the other side. I was 12 at the time and we had been camping and fishing in this area of the river before and we were used to swimming in it. I had swam across to the other side to fish, and heard my dad yelling at me wasn't sure why until I looked down where my ankles were in the water and a 2.5 m salt water croc just out his head out of the water a meter away from me. I jumped back nearly sh*t myself and landed on the bank as the croc missed his shot at me. Dad come over with the canoe to pick me up after but yes that makes my stomach churn still to this day.",
   "created_utc": 1690949961,
   "score": 7,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufwsqn",
   "message": "A house fire across the street",
   "created_utc": 1690950372,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufxbjr",
   "message": "When I was 18, I got way too drunk at a club with some friends. After a couple hours of drinking I couldn't find my friends, I started feeling anxious and decided to walk back to my residence on the campus. I texted my friends and off I went.\n\nIt was pouring and about a 90 minute walk. Halfway through, a car pulls to the side of the road and a guy rolls down the window and says he'll give me a lift back to the college. I get in and after thanking him for the lift, he opens conversation by asking what my sex life is like. I just laughed it off and said I do ok, but he kept pressing. I should note, I'm pretty baby faced. At 18, I looked more like 14-15. And i was absolutely shitfaced, could barely walk straight. This dude was mid forties, overweight, and had this very excited, nervous energy that started setting off red flags.  He kept asking about how many girls I'd had sex with, if I'd done anything with guys, and I started to feel unsafe. As we got close to the college, he did not start to slow down. I said \"hey the college is right here\" and he laughed, apologized, and stopped the car. I left, but sometimes I wonder what his plan was if I was a bit drunker and passed out, or didn't notice that he wasn't stopping at the college.\n\nAlso, my phone was on the fritz and when I saw my friends the next day, they mentioned that none of them actually received my text saying I was walking home.",
   "created_utc": 1690950679,
   "score": 4,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufxf5b",
   "message": "I was followed by a crazy man at night for half a mile at least. When I reached my building and finally entered through the first gate which doesn’t lock, my hand was shaking trying open the second gate when I saw him behind the first gate, he just looked at me and did that sick throat slitting gesture but fortunately left afterwards. I was disturbed for at least a week.",
   "created_utc": 1690950737,
   "score": 5,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufxf97",
   "message": "Watching my exes dogs kill my cat on new years 3 years ago. Her screams will never leave me. We didn’t even live together. And the only way he said he would come over for new years was if the dogs were coming too. My cat was my best friend, and the mother of my other two cats. She didn’t deserve to die like that in such a painful way. I still have ptsd from it and even typing this is a struggle for me to not burst into tears or throw up",
   "created_utc": 1690950739,
   "score": 19,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufz8jo",
   "message": "Being on a dirt road with 2 bear cubs on my right, and mama bear comes out of the woods on my left. I was with my dad and our 3 German Shepards. He grabbed 2 of their collars, I grabbed the other one. Mama bear was snarling, less than 20 feet away. My dad told me to back up, and if we had to let the dogs go in order to protect ourselves, we would. I have NO fuckin idea how we got out of that one alive.",
   "created_utc": 1690951831,
   "score": 6,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jug1wt2",
   "message": "Hit someone going 80 head on with no seatbelt and got ejected from my truck, breaking my legs, kneecaps, one ankle, and cut my ear off. Then coded and was brought back to life in ambulance with the defibulator. I wear my seatbelt before I even start the car now.",
   "created_utc": 1690953519,
   "score": 7,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jug279t",
   "message": "When i couldn’t find my then 13 yr old daughter with mild intellectual disability and more. She was no where to be found not in the park, not in school, no where panic starts sinking in my first thought someone kidnapped my baby.  I called the cops soon as they were going to put an amber alert she turning around the corner I told them I got her, the fucking school made her walk home, she was cold my poor baby now my guard is higher up than before.",
   "created_utc": 1690953709,
   "score": 5,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jug5t1s",
   "message": "My mom had a stroke while on the phone with me. She was talking like normal, then just started stuttering. She knew something was wrong and was frustrated and confused, then scared. I was across town, and I thought the only person home with her was my dad; he's an abusive ass and never takes health problems seriously unless they're his own. I was afraid to hang up on my mom but obviously had to call 911. I called 911 and sped home. Luckily, my brother had gotten home before me and had already called an ambulance. My father had no intentions of calling for help. He tried to blame it on \"drugs.\" He also claimed she was faking it for attention. But the scans at the hospital clearly showed she had a stroke. She's since recovered, but the incident is yet another reason why I don't trust my father.",
   "created_utc": 1690956215,
   "score": 8,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufz82s",
   "message": "I once accidentally grabbed a spider(I'm deathly afraid of them)",
   "created_utc": 1690951823,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jufyau8",
   "message": "Thought I saw a tick climbing up the inside of my jeans, had to get my friend to stop driving up the motorway, strip off, and get the tick. There was no tick. The fear was awful, I have a phobia of ticks. I see them everywhere, and they aren't there. I feel ill typing this , and itchy",
   "created_utc": 1690951259,
   "score": 1,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jue540b",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jug6qbe",
   "message": "I got chased by a coyote through the desert while I was on an evening run. I can't even run at night anymore. It was the most scared I've ever been. I've also never run so fast, so far. I was about half a mile from a populated area, I had to have covered that in about 2 minutes, lol. It was like... snarling and running after me. Agh.",
   "created_utc": 1690956881,
   "score": 7,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jug2mnj",
   "message": "My backyard opened up into a huge field with a hill on it. My bedroom was the only one on the bottom floor of the house and the only one with a window that faces the field. I had always slept with my window open and one night when I was 17 I heard a lot of rustling coming from the field as well as flashing lights, I didn’t think much of it since people were always hanging out there late at night so I brushed it off as people walking with flashlights. \nHowever it became very frequent and the shining lights were preventing me from sleeping so I started closing my window and blinds. But one night I heard the sound of my fence rattling and began feeling like something was wrong I figured I was being paranoid and excused it as someone trying to brace themselves or maybe fell into it. \nUntil, despite having my window closed still, I heard hard footsteps against concrete like someone had just landed on it. \nIt was at that point I got to scared to sleep without checking. We always have our side lights on because our security camera doesn’t have night vision so when I look out my window im able see the silhouette of the stuff in our backyard like our shed or trampoline. But when I peeked through the blinds I didn’t just see our backyard knickknacks but also what was very obviously a man walking slowly through our backyard towards our house. I remember him looking right at me when he saw me open my blinds. He stopped dead in his tracks and he stared at me. he didn’t look caught or scared or anything. He smiled at me like a real honest smile. My felt my eyes get get really big as I began to scoot backwards to go make sure our back door was locked. It was then that I saw him start booking it towards the house. I let out my first scream which alerted my parents. I swung my door open and darted to our back door to make sure it was locked, thankfully it was. I heard my parents footsteps coming down the stairs as I was running back into my room to lock my window because I know I never lock it. When I pushed up the blinds to reach the latch he was right on the other side of it as he had given up on the locked door. Our faces were inches from each other with just the glass window separating us. I was screaming and crying hysterically when my parents ran in. My dad went outside and tackled the man to the ground as my mom called the police. I had assumed it was a random homeless man as they typically seek shelter in the field. But we found out that all that rustling and flashing lights was this man, who lived a few streets down on the other side of the hill who had been stalking our house and taking pictures of me through the open blinds. He told the police he enjoyed watching me sleep and gave them very detailed descriptions of things I had worn or done. He said he had been planning on breaking into the house after I had started closing my window because he loved and missed me. We moved shortly after this and I’ve never been the same thing",
   "created_utc": 1690953995,
   "score": 3,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jug84al",
   "message": "One time my dad called my mom to tell her that my dog had been hit by a bike. Now normally this would be kinda ok because if the bike is going slow it shouldn’t be bad. The person was going really fast downhill on the bike. Thankfully my dad got help and my dog was nice but that was the most terrifying moment in my life. The day my dad died wasn’t as bad as the day I lost that dog too. Every other dog that knew her who regularly visits my house tends to sit in spots she used to sit at and lay in her beds to smell her scent.",
   "created_utc": 1690957910,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jug8j65",
   "message": "Was wave diving. Dove into a wave, started to stand up, a 7-8 ft wave came in right behind it and broke right on top of my head. The undertow of the current coming back to the ocean didn’t allow me to fully stand up, almost pulling me down in a sitting position, so when it hit me I was helpless. I was suddenly upside down and flipping over feet over head with zero control.\n\nMy shoulder hit the floor of the ocean and it tore off 1/2 dozen layers of skin. If my head or neck would’ve hit where my shoulder did, my neck would’ve broke or I’d have been knocked out and drowned.",
   "created_utc": 1690958221,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jugcpo9",
   "message": "Panic attack.",
   "created_utc": 1690961441,
   "score": 2,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jugdcjx",
   "message": "Years ago I had finished mowing my lawn and was trimming when I felt the urge to pee. At the time I didn't know our tool shed had a giant wasps nest in it, and I hadn't yet noticed the considerably higher numer of wasps flying around the back yard.\n\nI lived out in the middle of nowhere, so it was safe to just go pee anywhere, so I set the weed whacker down, and started peeing. A wasp landed on the head of my penis.\n\nNeedless to say, I got urine all over myself, but more importantly, I didn't get stung.",
   "created_utc": 1690961943,
   "score": 4,
   "submission_id": "15fnz0c"
  },
  {
   "comment_id": "jugdcvu",
   "message": "Driving South on I35 in Texas just past the Oklahoma border. I was in the Left lane, semi truck on my right. A car of 5 college age girls was driving Northbound. They swerved to miss something in the road, flew across the median and slammed sideways into the corner of the semi’s cab. The car was torn in half and I watched as the bodies flew out. One, a brunette in a pink dress, landed in front of my car. Bloodied, clothes ripped off, and dead on the road in front of me.",
   "created_utc": 1690961950,
   "score": 6,
   "submission_id": "15fnz0c"
  }
 ]
}