{
 "submission_id": "15fnagy",
 "title": "People who have left the cinema mid-movie after you’ve paid - why did you leave?",
 "selftext": "",
 "created_utc": 1690920532,
 "permalink": "/r/AskReddit/comments/15fnagy/people_who_have_left_the_cinema_midmovie_after/",
 "score": 241,
 "url": "https://www.reddit.com/r/AskReddit/comments/15fnagy/people_who_have_left_the_cinema_midmovie_after/",
 "comments": [
  {
   "comment_id": "jue7zqx",
   "message": "Not me, but my in-laws. FIL was a huge fan of westerns. He was also a conservative Catholic. When \"Brokeback Mountain\" came out, all he knew was that it was a western. Apparently, during the scene where the 2 are going at it in the tent, he starts yelling, \"Oh my God, what are they doing?\" He also was hard of hearing, so even when he wasn't agitated, he was super loud. He and my MIL left after that. \n\nI would have paid a decent amount of money to have been able to be in the theater when that happened.",
   "created_utc": 1690923408,
   "score": 57,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue5m1o",
   "message": "Speaking for my mom: “I didn’t realize a movie with a stuffed bear as a main character would be that inappropriate for my 12 year old”",
   "created_utc": 1690922530,
   "score": 17,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue4vyv",
   "message": "The latest Jurassic World movie was so bad, I was laughing out loud. It was a beautiful day outside, so my date and I decided to cut our losses and go to the park about 45 minutes into the film. \n\nGreat decision.",
   "created_utc": 1690922263,
   "score": 90,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue5vq3",
   "message": "I haven’t walked out but I watched a couple leave “everything everywhere all at once “ after the dildo king foo scene and it cracked me up",
   "created_utc": 1690922630,
   "score": 175,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue7xkl",
   "message": "I was close to shit myself. It turns out I had diarrhea so it was a good thing .",
   "created_utc": 1690923386,
   "score": 125,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue4lg2",
   "message": "I never left the theater, but when I saw Bad Grandpa an older couple left pretty early. I Guess they didn't know what the movie was, and when the grandpa's dick got stuck in the coke machine they were out",
   "created_utc": 1690922153,
   "score": 100,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juebkt9",
   "message": "The person next to me was getting a handie. Staff did nothing. Manager did nothing......",
   "created_utc": 1690924759,
   "score": 83,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jueavht",
   "message": "Nothing to do with the movie. Went to see the new Avatar but my dog was on my mind the whole movie because she’s old and was acting weird before we left. Left the movie halfway through and my dog died 20 minutes after we got home. Still refuse to watch that movie",
   "created_utc": 1690924491,
   "score": 140,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue0ge1",
   "message": "My child became restless, and leaving was the best option for us and everyone else there.",
   "created_utc": 1690920632,
   "score": 115,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue8f3d",
   "message": "The Happening. A little bit into the movie I said “it’s not the plants is it?”. It was. I left.",
   "created_utc": 1690923566,
   "score": 55,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juehsyt",
   "message": "My sister and I saw Bruno on opening night in a small conservative town in middle America. The theater was packed with people doing Borat impressions during the pre-movie trailers.\n\nI haven’t seen the movie since, but I vaguely remember a scene where it’s a close up of a realistic looking penis dancing. At the end of the scene, the penis faces the audience, and a mouth forms and screams.\n\nI have NEVER seen so many people get up and leave the theater in disgust simultaneously.\n\nIt was glorious.",
   "created_utc": 1690927165,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue826a",
   "message": "I saw a dad walk out with his 2 young kids a few minutes into the South Park movie after he realized it was an adult cartoon.",
   "created_utc": 1690923434,
   "score": 50,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juecj4j",
   "message": "2003, Finding Nemo.  Date and I arrived a little early, then a few minutes into the coming attractions the theater fills up with summer camp kids.  We left immediately, spent our time enjoying the beautiful weather knowing we both avoided migraines.",
   "created_utc": 1690925122,
   "score": 63,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue6drc",
   "message": "The theater started filling with smoke.",
   "created_utc": 1690922817,
   "score": 21,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jueb4f9",
   "message": "I was 15 and thought I was edgy so me and my GF went to see the movie Bruno and left 20 mins in ... we snuck into whatever Harry Potter movie was out at the time like some basic bitches and had a blast.",
   "created_utc": 1690924586,
   "score": 30,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue8884",
   "message": "We walked out of Final Destination when I was 8 years old because it was too scary. After the kid got strangled in the bathtub",
   "created_utc": 1690923496,
   "score": 12,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue8uk5",
   "message": "Not me, but have to share. My MIL walked out of the new Indiana Jones movie. First of all, she went to the theater and then just looked for what movies were about to start. That’s psychopath behavior in my book. So anyway, walks out of IJ5. I ask why, and she says:\n\n“It was a bunch of chase scenes and I didn’t even care if they recovered the artifact they were running around trying to get.”\n\nI died for a moment. Like, have you ever seen an Indians Jones movie? Why tf did you even go!?",
   "created_utc": 1690923727,
   "score": 26,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue5nt6",
   "message": "The Passion of the Christ. Left the theater and snuck into the theater next door that was playing the remake of Dawn of the Dead. No regrets!",
   "created_utc": 1690922548,
   "score": 73,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue18bi",
   "message": "The experience was bad. The screen was super dim and not very sharp or colorful. The HVAC was super loud (humming and ticking). It was very hot. Sound was piss poor. They left the house lights on dim and finally the the super bright green exit signs we’re spilling light onto the screen. It was horrible and not worth the money.\n\nThe movie was Titanic at a Showcase Cinemas. Earlier 2023.",
   "created_utc": 1690920916,
   "score": 34,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue4z2i",
   "message": "A fight broke out over racial slurs being thrown back and forth.",
   "created_utc": 1690922294,
   "score": 20,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juecsi7",
   "message": "I used to live in a town where there's only one cinema. The last time I went there was to watch the movie \"The Hobbit,\" but the audio was out of sync with the scene by at least one second. I informed the staff at the entrance, but nobody in the cinema wanted to make something about it. So, 15 minutes after the movie started, I left the theater and haven't set foot in my city's cinema since.",
   "created_utc": 1690925221,
   "score": 9,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue5t25",
   "message": "It was the newest Blade runner and I felt like I needed to see the first one.",
   "created_utc": 1690922602,
   "score": 18,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juehwis",
   "message": "I was at the movie with my best friend and there were 3 seats between us and the group of girls next to us. This guy dressed in all black came up and sat between us and dropped a bag that had something metal in it on the ground. It was clear neither of our groups knew him because we were glancing at each other. My bff and I decided to leave as the commercials were playing because something didn’t feel right. We turned around when we got to the bottom of the stairs to see him also coming down the stairs. We booked it the fuck outta there and sped home.",
   "created_utc": 1690927204,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jueftvp",
   "message": "Tupac Resurrection, opening night.  Fight broke out within 2 minutes so we had to leave the theater lol",
   "created_utc": 1690926399,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue4i3u",
   "message": "Sausage party...do I need to say more",
   "created_utc": 1690922119,
   "score": 24,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue9jlo",
   "message": "Watchmen. We were early high school boys in the Midwest and a giant blue dick was slapping the imax screen.",
   "created_utc": 1690923988,
   "score": 6,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue9isf",
   "message": "I left during the movie A Guy Thing. It was soooooo awful",
   "created_utc": 1690923980,
   "score": 7,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juedjdu",
   "message": "Because I had my four month old daughter with me and she was crying and having a moment and I didn’t want to disturb everyone around me",
   "created_utc": 1690925507,
   "score": 5,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juej8i5",
   "message": "The only time I’ve ever left a movie early was because of other people. Talking, being overly loud, using phones, children, etc.",
   "created_utc": 1690927730,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juefu53",
   "message": "Batman 👍\n\nRobin 👍\n\nBatman AND Robin 👎👎",
   "created_utc": 1690926401,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue0oo5",
   "message": "I have ADHD and if it doesn't hold my attention I miss too many plot points.",
   "created_utc": 1690920718,
   "score": 19,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue884o",
   "message": "It was Stuart Little 2. My 3yo daughter ate the snacks we bought, said ‘This movie is awful’ and stood up and left. Never been prouder.",
   "created_utc": 1690923495,
   "score": 9,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jueir9i",
   "message": "It took three times to see Forrest Gump. The first time my wife was pregnant and started having contractions and the second time the baby was crying.",
   "created_utc": 1690927542,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue58t4",
   "message": "Fuck Rose and Jack. I just waited til the ship started sinking.",
   "created_utc": 1690922394,
   "score": 11,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juei8ik",
   "message": "I left The Joker a few years ago because I couldn’t handle the psychological torture. I sat in the car and read a book (thank you kindle app for making sure I always have a book to read!) while my husband and son watched it.",
   "created_utc": 1690927334,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue3ene",
   "message": "It was an adaptation of a book, and while it was done well, it just didn’t hit me as anything special. I got bored.",
   "created_utc": 1690921713,
   "score": 3,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue4g30",
   "message": "I was watching \"The Panic Room\" and just got bored with it, so I left.",
   "created_utc": 1690922099,
   "score": 2,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue6gds",
   "message": "I paid to see Disaster Movie.\n\nEnough said.",
   "created_utc": 1690922845,
   "score": 3,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue8e0b",
   "message": "Food poisoning. Hit me in the theater and it came out of both ends!",
   "created_utc": 1690923555,
   "score": 3,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juec3fp",
   "message": "I left because someone brought a baby into LOTR and the kid was screaming the whole time. I was not the only person to leave.",
   "created_utc": 1690924955,
   "score": 2,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jued1na",
   "message": "I sharted.",
   "created_utc": 1690925319,
   "score": 2,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juedn1z",
   "message": "My toddler took off the lid and dumped an entire ICEE on us.",
   "created_utc": 1690925547,
   "score": 2,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue4qml",
   "message": "You can go to the front and get your money back if the movie is that terrible. I've done it twice in total though.",
   "created_utc": 1690922206,
   "score": 4,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue767c",
   "message": "Avatar 2. Got about half way through before I was convinced I was watching the first movie with a new skin. Got so mad I up and walked out, felt like I’d wasted my money ta rewatch the same damn movie with an aqua theme.",
   "created_utc": 1690923108,
   "score": 11,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue96p8",
   "message": "Dunkirk at imax with pregnant wife. Child kicked because it was sooo loud. Had to leave and Google if we accidently ruined The baby. Movie was good though.",
   "created_utc": 1690923854,
   "score": 2,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juebmaj",
   "message": "The movie sucked and had no desire to waste more time.",
   "created_utc": 1690924776,
   "score": 2,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juedx7r",
   "message": "Had to pee, and then I came back in",
   "created_utc": 1690925657,
   "score": 2,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juee8x9",
   "message": "Because the movie is so bad, and you will never recoup that wasted time. There's no point in staying and losing even more time. Sometimes, you just have cut bait.",
   "created_utc": 1690925783,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jueeuyr",
   "message": "I was a right-wing male at the Barbie movie /s",
   "created_utc": 1690926017,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jueewfr",
   "message": "Way too many cellphone lights and people talking.",
   "created_utc": 1690926033,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jueez6u",
   "message": "It was Solo (SW Story) for me. They wrote a \"backstory\" to Han Solo's fucking name.\n\nNot only that, but it is given by a totally random Imperial officer.\n\nNot only that, but later he passes this random Imperial-given name on to his son.\n\nFuck that movie.",
   "created_utc": 1690926063,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juef7bd",
   "message": "Because it was Twilight",
   "created_utc": 1690926151,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juef8j1",
   "message": "Dropped the GF off to take her nursing state boards and figured I'd catch a movie. She called and said she was done, that the computer just ended the test 15 minutes in and that she must have failed so I left before the previews were even over to pick her up. She passed. I guess if you get enough questions right without missing they skip ahead.",
   "created_utc": 1690926164,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juefbkr",
   "message": "My time is more valuable than my money.  I won’t sit and be bored by a movie.",
   "created_utc": 1690926197,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juefywo",
   "message": "It was halfway though Field of Dreams and I could feel my brain leaking out my ears.",
   "created_utc": 1690926452,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jueglk5",
   "message": "A girl I was seeing INSISTED that if we brought her 2 year old with us to the movies he'd be quiet and probably fall asleep. I was so embarrassed about how poorly he was acting I took him out of the theater about 5 minutes in. It was some movie about bank robbers or something. She and her friend stayed for the rest of the movie. She wasn't a very good girlfriend.",
   "created_utc": 1690926693,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juegmr8",
   "message": "teenage dickhead dirtbags on their phones not giving a fuck about anyone else but themselves.",
   "created_utc": 1690926706,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juehau8",
   "message": "Middle school, I accidentally paid for the wrong movie thinking it was a comedy, ended up being in an r-rated very gorey movie that I couldn't handle(small town so they didn't really care about selling me the ticket). Or maybe I walked into the wrong movie? Its been like 15yrs I can't remember at this point haha",
   "created_utc": 1690926966,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juehw0k",
   "message": "I was about 12 years old and had seen the movie 5 times. It was the late 90s re release of the original star wars trilogy and my dickhead friends and I had been humming the imperial march very loud during Empire Strikes Back.\n\nWhen the usher asked us to quiet down he also realised we hadn't bought tickets and frogmarched us all out.\n\nWe'd buy 1 ticket then have that person open a fire door and let the rest of us in.",
   "created_utc": 1690927199,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juehwjh",
   "message": "Because the projectionist walked off the job🤣🤣",
   "created_utc": 1690927204,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juei4d0",
   "message": "I left a showing of the sixth sense about 30 minutes in with my dad years ago. \n\nI was 6……",
   "created_utc": 1690927289,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jueijuu",
   "message": "if you leave before a movie is half over, you get your money back. I've done it twice\n\nat least, that's how it used to be, not sure anymore",
   "created_utc": 1690927461,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jueinu3",
   "message": "My GF at the time got motion sick watching the Blair witch project and left.",
   "created_utc": 1690927505,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juem0jl",
   "message": "My sons first movie. He said it reminded him of church(he couldnt talk)",
   "created_utc": 1690928860,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juem37a",
   "message": "Saw quite a few people leave with their kids the night sausage party premiered.",
   "created_utc": 1690928891,
   "score": 1,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue1x54",
   "message": "The movie was terrible.\n\nEven got my money back.",
   "created_utc": 1690921169,
   "score": 3,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue2j9f",
   "message": "We were watching Naked Lunch . Nuff said",
   "created_utc": 1690921388,
   "score": 5,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "juea92g",
   "message": "The new avatar. I was bored out of my mind",
   "created_utc": 1690924254,
   "score": 2,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue61nt",
   "message": "Thought Hostel was going to be fun because I love trashy horror. It was honestly just awful.",
   "created_utc": 1690922690,
   "score": 4,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue1q4f",
   "message": "Inglorious Basterds. \n\nI was 15 or 16 and went with my dad. We both knew nothing of Quentin Tarantino at the time and were both confused and flabbergasted. \n\nHalfway through my dad asked if I wanted to ditch it and go do something else. I adamantly agreed. \n\nI watched it again a few years ago and I’ve learned I’m just not built for his films. \n\nI saw Once Upon A Time…in theaters with my boyfriend and was like okay, this is calm. Until the end and then I had my eyes covered for it. \n\nWe watched the Hateful Eight in bed together and I made it maybe through half and then turned over and covered my ears.",
   "created_utc": 1690921098,
   "score": 5,
   "submission_id": "15fnagy"
  },
  {
   "comment_id": "jue7cf5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15fnagy"
  }
 ]
}