{
 "submission_id": "15fo10e",
 "title": "How in the **** do printers still not work in 2023?",
 "selftext": "",
 "created_utc": 1690922213,
 "permalink": "/r/AskReddit/comments/15fo10e/how_in_the_do_printers_still_not_work_in_2023/",
 "score": 54,
 "url": "https://www.reddit.com/r/AskReddit/comments/15fo10e/how_in_the_do_printers_still_not_work_in_2023/",
 "comments": [
  {
   "comment_id": "jue54u4",
   "message": "IT professional here, I've done computer/peripheral/phone support for most of my working career, and the answer is very simple- \n\nPrinters are demons given metallic and plastic flesh, the ink is their blood- boiling with contempt for the common man.",
   "created_utc": 1690922354,
   "score": 78,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue5t2w",
   "message": "Because nobody has been trying to improve them in decades. They are profitable as they are. They're dirt cheap to make and they get people buying ink at like a billion percent margin.\n\nThey're basically like Keurig machines. The coffee they make is disgusting brown water that tastes nothing like coffee and is more like if you made a tea out of old cardboard boxes, but they are cheap as shit and they sell pods... and the only time they have been revised in any major way is when the patents for the previous version of the pods expired, and the pod gravy train was threatened.",
   "created_utc": 1690922602,
   "score": 21,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue5ccg",
   "message": "cue the printer beating scene in Office Space",
   "created_utc": 1690922430,
   "score": 4,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue6ckk",
   "message": "PC load letter? What the fuck does that mean?",
   "created_utc": 1690922804,
   "score": 3,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue875s",
   "message": "I switched to digital everything.\n\nI rarely need to print anything and If I do I make a special trip to Staples.",
   "created_utc": 1690923486,
   "score": 4,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue7zgu",
   "message": "crappy proprietary drivers  \ncrappy cheap hardware  \nno real standards in user interface, program interface, or consumables (except the paper)",
   "created_utc": 1690923405,
   "score": 3,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue83yc",
   "message": "Careful, they can smell fear",
   "created_utc": 1690923452,
   "score": 3,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue88q0",
   "message": "*grabs baseball bat*",
   "created_utc": 1690923501,
   "score": 3,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue4xo3",
   "message": "You gotta be smarter than the printer to use it properly. Good luck.",
   "created_utc": 1690922280,
   "score": 4,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue6dy9",
   "message": "Printers will always be a mystery. NASA is still working on it",
   "created_utc": 1690922819,
   "score": 2,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue7dft",
   "message": "Right!!!! Epson and hp are both on my shit list",
   "created_utc": 1690923181,
   "score": 2,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue9akg",
   "message": "This is why I've refused every attempt to replace our hp 4350s in the office. These shit still work, and their ancient ass driver still works. These newer HPs with their fuck all broken ass randomly breaking drivers and hardware can go commit sepuku.",
   "created_utc": 1690923895,
   "score": 2,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "juecw2b",
   "message": "bought a new  'old' HP laserjet model and getting the toner refilled at a local shop, this printer is not smart and no drivers required, it just works, not upgrading it.",
   "created_utc": 1690925259,
   "score": 2,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "juedt1s",
   "message": "After the Office Space incident, all printers have become sentient and spoke to each other in eeee's and errrr's telling each other that they wouldn't conform to the humans and would never work another day in their lives.",
   "created_utc": 1690925612,
   "score": 2,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "juefhd2",
   "message": "Ask your grandson to fix it",
   "created_utc": 1690926261,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue5271",
   "message": "Planned obsolescence. It's a fact of private industry that shelf life is essential to profit, in spite of engineering capabilities. \n\nThat's why they can build airplane engines that last 30 years and light bulbs that last a few weeks. It isn't a limitation of technology. Light bulbs could be designed to last 100 years in theory, but then there would be no repeat transactions and therefore light bulbs are made to last as long as they do.",
   "created_utc": 1690922327,
   "score": 5,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue4x9x",
   "message": "Im guessing they were designed to be pieces of shit to keep the tech support employed.",
   "created_utc": 1690922276,
   "score": 2,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue55j0",
   "message": "Operator error",
   "created_utc": 1690922361,
   "score": 3,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue5q75",
   "message": "You're allowed to cuss on the internet, there's no need to censor yourself. I promise you won't get in trouble.",
   "created_utc": 1690922573,
   "score": 4,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue8b1s",
   "message": "It's controlled by a demon, the printer daemon",
   "created_utc": 1690923525,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue5dzv",
   "message": "Because it's 2023 and printing should be a minimal, rare, niche task not a normal part of every day work flow.\n\nAre you on a computer?  Okay is the person you're printing this out for also on a computer.  Then don't fucking print it.  E-mail it to them.",
   "created_utc": 1690922447,
   "score": 0,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jued98l",
   "message": "Honestly, if you don't buy low end gear, they work fine.\n\nI spent $600 and the thing works great (multifunction, color, etc). Last one I had lasted 10 years before I finally upgraded.\n\n\"I work in IT\" Yea, so do I, and so do bunch of people. There are a lot of unqualified idiots in IT so I would take that with a grain of salt. Larger printers are complex machines with many motors, servos, sensors, etc. There's a lot going on and of course they will need maintenance like any other complex machine.",
   "created_utc": 1690925401,
   "score": 0,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue541b",
   "message": "Capitalism",
   "created_utc": 1690922346,
   "score": 255,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue5akb",
   "message": "Too many greedy companies that have to have compatible software and hardware.  Windows gets a new update that disables our printer for example.  And even within the printer product itself, so many companies make the components and they all have to jive, which they won't.  Heck, look at the x900h tv.  THAT is a disaster even when you only run the internal interface.  Tens of hours of troubleshooting.",
   "created_utc": 1690922412,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue893y",
   "message": "It has been cash grab since the switch from fot matrix to inkjet. Was told that from a computer store I did a work term for.",
   "created_utc": 1690923505,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue8p5d",
   "message": "Who in the **** (fuck, you pussies) still has a printer in 2023?",
   "created_utc": 1690923672,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jue9066",
   "message": "Have you seen the light? CAN YOU SEE THE LIGHT!?\n\nBrother is the way, the truth, and the light.",
   "created_utc": 1690923785,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jueanhm",
   "message": "The goal of printer manufacturers is to sell *ink*.  They have no incentive to make their printers any better, as long as people keep buying ink.",
   "created_utc": 1690924407,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jueb73g",
   "message": "Printers are the cheap doohickey meant the drive the sales of the real moneymaker, ink cartridges. It’s the toy in the box of Cracker Jacks or breakfast cereals. \n\nIt’s made as cheap as possible, to lure the customer into the company’s ecosystem.",
   "created_utc": 1690924614,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "juec6lc",
   "message": "Because they are strong and independent machines who don't need you to decide when they work. (Except sometimes they literally do)",
   "created_utc": 1690924989,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jueeyxa",
   "message": "Printer companies don’t make hardly anything off a one-time sale of the printer, so they cheap out on quality. They make their money on the ink",
   "created_utc": 1690926060,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jueg42f",
   "message": "I know, right? I have never had nothing but problems with printers, and they never work the way that they’re supposed to.",
   "created_utc": 1690926507,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "juegcrh",
   "message": "? Really \n\nI can print from anywhere in the world to mine, from any device - what more could you want?",
   "created_utc": 1690926600,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "juegjcs",
   "message": "probably because printers are relatively an outdated technology and there’s no point in making them better. \n\nmostly everything is digital now besides a rare few documents that still need to be printed on occasion. That’s why I don’t even own a printer at my house since I’d only need to print something maybe once or twice a year which costs me literal Pennie’s at the public library compared to the hundreds you’d have to pay for the hardware, ink, and paper itself",
   "created_utc": 1690926670,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "juegpju",
   "message": "There is no money in making good firmware.",
   "created_utc": 1690926736,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "juehicd",
   "message": "Have you ever used a 3D printer?  If so, then you'll be familiar with how they don't actually print 3D models... they print lithography files.  There's an interpolation process by which a 3D model (a set of mathematical equations describing and arbitrary collection of points and line segments) turns into a lithography file (a set of instructions describing a discrete quantity of physical components with geometries and orientations), and *that* is sent to the 3D printer.  This results in a lossy conversion because it's literally impossible for a physical machine with 3-space constraints to replicate infinite precision afforded by a mathematical model.  The end result is the 3D printer is fed an instruction set of \"open spout, move 0.1mm forward, close spout...\" which should produce a physical object approximating the original digital model.\n\nConventional 2D printers work by the same premise.\n\nWhen you have a Word document, clicking 'print' doesn't print the word document, it converts the word document into an instruction set and sends the instruction set to the printer.  The printer then follows that instruction set, regardless of what it is, without any form of error handling or self-awareness beyond \"it wants cyan but I have no cyan\".  The problem is that the instruction set converters are old and terrible (at least for home printers).  They're clumsy and have outdated data handling, thus producing bad instruction sets.\n\nThey also have little in the way of cross-talk.  The converter on the desktop and the printer don't do any real handshaking, their arrangement is more that of customer service phone tag - the PC sends the info to the printer assuming everything is fine, the printer receives the instruction set and attempts to execute it, then throws back to the PC if there's an issue.  It doesn't tell the PC \"I can't do step 4732, so I need you to change that for me\", it tells the PC \"I can't do step 4732, so I won't print this\" and the PC says \"oh, you couldn't print it?  Well I'll try to convert it again without changing step 4732 and maybe that'll work.\"\n\ntl;dr - [home] printers are still shit because they're designed to handle anything you could possibly throw at it from thousands of programs and file formats, and the team responsible for allowing you to send things from a program to the printer are not the same people as the team responsible for figuring out what you're sending to the printer and how to make it print.",
   "created_utc": 1690927049,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jueihtc",
   "message": "Stop buying cheap inkjets printer, either you buy good laser printers like Brother printers or ecotank printers like the Epson model. Also use a wired connection lol",
   "created_utc": 1690927438,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jueioem",
   "message": "They are designed  to not work. To make you buy more.",
   "created_utc": 1690927511,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "juej3uk",
   "message": "We got new workstations and printers at work. The printer is a Lexmark MS621dn and lately all the pages are printing like a photo negative. I searched briefly for a cleaning cycle or function, but I don’t know the PIN to login to access the menus. My IT department has yet to get back to me. I will just hurry up and wait.",
   "created_utc": 1690927679,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jueki6u",
   "message": "I haven't owned a printer in decades. The rare time I need to print something, my local library does it for pennies per page (5 or 10 cents per page, I forget which).\n\nOwning a printer is such a scam, you'll be buying ink forever.",
   "created_utc": 1690928243,
   "score": 1,
   "submission_id": "15fo10e"
  },
  {
   "comment_id": "jueklk5",
   "message": "Everything in life has a designed purpose…….",
   "created_utc": 1690928281,
   "score": 1,
   "submission_id": "15fo10e"
  }
 ]
}