{
 "submission_id": "15fq8mp",
 "title": "what's the most useless gift you've ever gotten?",
 "selftext": "",
 "created_utc": 1690927236,
 "permalink": "/r/AskReddit/comments/15fq8mp/whats_the_most_useless_gift_youve_ever_gotten/",
 "score": 138,
 "url": "https://www.reddit.com/r/AskReddit/comments/15fq8mp/whats_the_most_useless_gift_youve_ever_gotten/",
 "comments": [
  {
   "comment_id": "juen2rt",
   "message": "Clothes that were too small. Intentionally small.\n\nI’m a size 4 (I’m short). My aunt got me some really nice tops in a size 0 because “you looked so good last summer when you got all svelte.”\n\nI had bronchitis and lost 10lbs.",
   "created_utc": 1690929303,
   "score": 137,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juep1cy",
   "message": "My wife got me a travel lint roller for Christmas. Granted I was on my way to Iraq...so technically I was about to travel, but lint was the least of my worries.",
   "created_utc": 1690930130,
   "score": 103,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueo8u2",
   "message": "I remember when I was like 11 my aunt bought me a soccer ball for my birthday. I was into bikes, skateboards, paintball, and video games, at that point in my life the definition of \"sports,\" was \"the thing they force me to do in gym class.\"\n\nThat soccer ball sat unused and deflated until it permanently melted itself to the wall of my parents garage, where it rests to this day.",
   "created_utc": 1690929793,
   "score": 77,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueqnq0",
   "message": "My former MIL used to “gift” me all the owners manuals from her small appliances purchased in last year as an actual Christmas gift. The first year this happened I was very perplexed. She of course explained “I read of these things”. For stuff I actually owned but for her electric knife sharpener or (my favorite) the garbage disposal they had installed lol",
   "created_utc": 1690930817,
   "score": 70,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juem5ox",
   "message": "Tampons(im a guy)",
   "created_utc": 1690928920,
   "score": 64,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juemobr",
   "message": "A quesadilla maker.  I know their heart was in the right place, but it was HUGE, impossible to clean, and doesn't do anything that I can't already do with a normal non-stick frying pan.  One of quickest gifts I've ever gotten rid of after taking it home.  It was literally too big for any of our cupboards.",
   "created_utc": 1690929136,
   "score": 49,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueqtii",
   "message": "A Harmonica from my mother one Christmas. \n\nShe said it was something musical and cost her €30, I was convinced it was the Red Hot Chili Pepper DVD I kept mentioning and really wanted. \n\nI was really into playing guitar at the time, but had zero interest in a harmonica in some random off key.",
   "created_utc": 1690930886,
   "score": 41,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juewtby",
   "message": "Crotchless panties. From a guy I wasn't even intimate with.",
   "created_utc": 1690933432,
   "score": 36,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueyyxb",
   "message": "I was in college across the country but went to visit my mother. For Christmas she gave me a stack of board games (trivial pursuit, Life...) but when I want to leave she said they had to stay there. We never played bird games but she wanted an excuse to buy them for herself. Thanks.... merry Christmas I guess.",
   "created_utc": 1690934354,
   "score": 39,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juepgb6",
   "message": "Crystal seahorses pulling a crystal Cinderella style chariot\n\nI don’t really like the sea, crystal figures, or Cinderella. My parents just bought weird thing for weird child and didn’t really think about it.",
   "created_utc": 1690930308,
   "score": 26,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juej2d8",
   "message": "I still have a pen that looks like a carrot on my desk.",
   "created_utc": 1690927664,
   "score": 43,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juenxa3",
   "message": "An expired gift card…",
   "created_utc": 1690929657,
   "score": 24,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueyt4y",
   "message": "My high school boyfriend got me an Xbox controller. For *his* Xbox. At *his* house. Where he only had 1 player games, or didn't like to play multiplayer with me because I wasn't great at his games.",
   "created_utc": 1690934284,
   "score": 30,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueqdso",
   "message": "ring (??) for piercing, quite expensive. I've never had a piercing and I've told this person several times that I don't want to get a piercing, but apparently he listened to me so attentively that he spent a lot of money on a useless gift",
   "created_utc": 1690930701,
   "score": 20,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf0mbn",
   "message": "The fifth hand crank radio that my father got me for Christmas.  He also got me the other four…",
   "created_utc": 1690935070,
   "score": 23,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf1u6o",
   "message": "I asked for guitar lessons for my birthday, because I had found a guitar about to be thrown out and wanted to learn how to play it. \n\nMy parents instead bought me an electronic keyboard and then got mad that I didn't magically teach myself to play it.",
   "created_utc": 1690935602,
   "score": 18,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juevh4l",
   "message": "I got a book of Word Finds from my aunt...\n\n\n\n\n\n...that I had left at her house a few years before. (This was in the 90s)\n\nIt had my name in it, still, on the inside...",
   "created_utc": 1690932859,
   "score": 23,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueuq6r",
   "message": "A wine stopper. I'm not known to drink wine.",
   "created_utc": 1690932538,
   "score": 11,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf7nm1",
   "message": "Cheap sweets from my in laws. Like off brand cookies, donuts, etc. After the conversation about being diabetic. Also after a conversation about my parents being pastry chefs. I didn't take them with me when I left their house.",
   "created_utc": 1690938149,
   "score": 11,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf9a5h",
   "message": "A gun rack? What am I gonna do, with a gun rack? I don't even own aaaa gun, let alone many guns to necessitate an entire rack. What am I gonna do with a gun rack?",
   "created_utc": 1690938868,
   "score": 26,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueyz1z",
   "message": "My cousin got me some aftershave for Christmas one time. I have a full beard...",
   "created_utc": 1690934355,
   "score": 13,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf0fun",
   "message": "A pen that looked and smelled like a salmon. (And not a fresh one)",
   "created_utc": 1690934991,
   "score": 9,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf2h7x",
   "message": "Big Mouth Billy The Singing Bass. Dumbest fucking thing ever! Got it as a Christmas present from my own mother. Sad……",
   "created_utc": 1690935879,
   "score": 14,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf8o59",
   "message": "Pencils.\n\nThe people in question forgot it was my birthday (even though *their family was hosting me for my birthday party*), rummaged in a nearby drawer in full view of me, and gave me the first thing they found.\n\nIt was pencils. With Avengers-themed erasers.",
   "created_utc": 1690938594,
   "score": 12,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueuhg9",
   "message": "Whiskey stones as a recovering alcoholic.",
   "created_utc": 1690932433,
   "score": 14,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueuvht",
   "message": "A cheap knock-off Barbie doll. It was a secret Santa gift the girl who gave it to me said it could be my girlfriend. I just gave it to my niece who wasn't so thrilled about it either.",
   "created_utc": 1690932602,
   "score": 8,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufkawe",
   "message": "Quite a few years ago, I was contracted to a major bank's auto loan division and was tasked to be the systems engineer for their initial foray into their customer-facing portal.  People could login, look at their balances, make a payment, etc.  After 6 months of intensive, 60+ hour work weeks, we delivered the project on-time and on-budget, to great acclaim.  The day after launch, a celebratory dinner was held, and they were announcing awards for everyone.  VPs were getting impressive five-figure bonus checks, my management upline got rewarded on a similar scale, and finally it came my turn.  They called me up, thanked me profusely for my hard work and dedication, and handed me a box.  Inside was... a turquoise blue $2 Hobby Lobby sequined flip-flop, my extra shoe for going the extra mile.\n\nI turned in my notice the next day.\n\nhttps://imgur.com/a/WLkoTQN",
   "created_utc": 1690943910,
   "score": 10,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juekti4",
   "message": "My mother gifted me hamsters at 17. The age where I was only ever at my house to sleep. Otherwise it was school, work, and friends.",
   "created_utc": 1690928371,
   "score": 16,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juetlci",
   "message": "My mother gave my 5 year old a Sentry safe as a Christmas present.",
   "created_utc": 1690932058,
   "score": 11,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf3q11",
   "message": "I’m at a point in my life when the older family members of mine are giving personalized gifts (paintings, engraved clocks, various artwork) that I gave them a long time ago as a gift back to me……..is this a thing? Am I sensitive for being offended by it?",
   "created_utc": 1690936422,
   "score": 9,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf7pkj",
   "message": "A roll of tape.",
   "created_utc": 1690938174,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juez3pr",
   "message": "Asked a friend not to give me food for my birthday once and she gets me a chocolate cookbook 🤦‍♀️",
   "created_utc": 1690934410,
   "score": 4,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf3ndh",
   "message": "Lil pink 1-lb dumbbells.  They did eventually make a great baby toy, but for a grown-ass woman they were insulting.  (Actually so bad I kept looking through the much-larger box for the real gift 'cause I was so used to my dad and his gag gifts.)",
   "created_utc": 1690936390,
   "score": 7,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufheir",
   "message": "A donation was made in my name to the Human Fund",
   "created_utc": 1690942550,
   "score": 4,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juey4v0",
   "message": "A snow globe during a secret Santa. Pissed me off.",
   "created_utc": 1690933995,
   "score": 7,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juesiy6",
   "message": "My mom got me a bunch of girly hair clips for Christmas once. I was a huge tomboy (actually a guy it turns out) and literally never wore hair clips. She doesn't even like things like that. I honestly wondered if she picked them up at a dollar store at the last minute because that's the level of care she normally put into my life.",
   "created_utc": 1690931609,
   "score": 12,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf2gnd",
   "message": "The gift of life. I didn't want this shit.",
   "created_utc": 1690935872,
   "score": 8,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufa40r",
   "message": "Book #5 in a book series. I dont have any other books in that series. Only #5.",
   "created_utc": 1690939243,
   "score": 6,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufj78v",
   "message": "A sword. It looks amazing and I absolutely love it in every way, but there hasn’t been a single vampire, zombie, dragon or even a crack head enter my yard since. Feels like a bit of a waste TBH.",
   "created_utc": 1690943388,
   "score": 8,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufl9wq",
   "message": "Luggage tag. I shit you not. They had the gall to list expensive items on their xmas list too. That was the last year we did gifts.",
   "created_utc": 1690944374,
   "score": 8,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufb66a",
   "message": "a shirt that said “i love your boyfriend” when i was 11. Threw that shit right out.",
   "created_utc": 1690939716,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jues8vo",
   "message": "A dildo",
   "created_utc": 1690931490,
   "score": 3,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueyig5",
   "message": "A brooch",
   "created_utc": 1690934158,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf1vns",
   "message": "A watch. Came from a friend who knew i hate watches.",
   "created_utc": 1690935619,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf2oih",
   "message": "My mom bought me a monogrammed flask. I don't drink, all the booze in the house is for cooking or cleaning.",
   "created_utc": 1690935966,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf920z",
   "message": "A bottle of Johnny Walker Blue. I don't drink.",
   "created_utc": 1690938767,
   "score": 4,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf9iir",
   "message": "Dishes/kitchen equipment that's not dishwasher safe and difficult to clean by hand.",
   "created_utc": 1690938971,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufah0y",
   "message": "Technically, a rosary. I don't have use for a rosary. It hangs from my mantle, as it was a gift from my wife (who is Catholic) so I love it very much, but it doesn't get \"used.\"",
   "created_utc": 1690939403,
   "score": 4,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufauw9",
   "message": "A black wooden cat statue with words written on it, \"Life is better with a cat\".  Definitely a re-gift.",
   "created_utc": 1690939576,
   "score": 3,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufb2ta",
   "message": "An identical jewelry box to the one my MIL got me previously...the first of which I never used. She got me the exact same thing twice. Never used either.",
   "created_utc": 1690939674,
   "score": 6,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufb4ag",
   "message": "When I was with my ex-wife, the MIL got me this nice, brand name camping backpack. \n\nI don’t camp. I don’t travel. It sat for years collecting dust.",
   "created_utc": 1690939692,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufbbfe",
   "message": "A plastic supermarket bag with random pens and pencils that were clearly retrieved from the bottom of a drawer, from my step-uncle. Who then proceeded to pat himself on the back for 30 minutes for giving the best gift at the party. Step-uncle was a bit of a tool.",
   "created_utc": 1690939782,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufbis4",
   "message": "My mom has always been kind of a bad gift giver.. always just really random stuff that is never related to any of our interests lol \nI once got a jelly bean dispenser with a ridiculous amount of jelly beans. I’ve never liked jelly beans lol",
   "created_utc": 1690939876,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufcrq7",
   "message": "Family abroad sent me clothes that were WAY too small. I was an American size large and they spent a good couple of years sending me European children's clothes or European smalls and extra smalls. My mother even sent them my measurements one year and they sent an even smaller size than the year before.",
   "created_utc": 1690940440,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufcrt0",
   "message": "My MIL regifted me a Christmas gift she never even opened.  It was a loaf of homemade sourdough bread that had undergone a year of anaerobic decomposition.",
   "created_utc": 1690940441,
   "score": 6,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufcw4j",
   "message": "Lobsters from my dad because he found them on Groupon and that was cute and all but to use the giftcard I had to spend an additional $150",
   "created_utc": 1690940495,
   "score": 4,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufdli1",
   "message": "$8 miniature painting easel. I have never once painted anything",
   "created_utc": 1690940814,
   "score": 3,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufeeay",
   "message": "Precious moments bible from Trumper aunt.\n\nMight as well give me a brick, at least I could use it.",
   "created_utc": 1690941168,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufeims",
   "message": "A friend went on vacation in Cancun and brought me back a huge keychain. I've never been to Cancun, why the fuck would I put a massive Cancun keychain on keys? Anyone who sees it will assume I've been to Cancun, want to tell me about their trip to Cancun, etc. It's sitting in my junk drawer because for some reason it seems mean to throw it away, even though he'd never even know",
   "created_utc": 1690941222,
   "score": 4,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juffaws",
   "message": "When I was 15, my step mom sent me a 2 foot tall cast iron candelabra for Christmas. WTF? Lol\nLike something you'd see on Liberace's piano!\nMy real mom and I laughed about it until I got the MATCHING one the following Christmas. Then I was just pissed off. 🤬\nCouldn't even get $5.00 for them at a yard sale and ended up donating them to Goodwill.",
   "created_utc": 1690941579,
   "score": 6,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufg1uj",
   "message": "1990. My mom, bless her heart, bought me a Led Zeppelin CD box set. I had to run out and buy a CD player.",
   "created_utc": 1690941925,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufgqck",
   "message": "My in laws went to a mexican resort recently and brought me back some shot glasses. I don’t drink, at all. I haven’t ever drank around them, although I used to drink a lot, and I’ve told them many many times that I don’t drink because they constantly ask if I want alcohol or ask why don’t I drink. I opened the gift and just stared at them in confusion.",
   "created_utc": 1690942237,
   "score": 3,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufgs1r",
   "message": "Those prepaid VISA’s that lose money before anyone at the mall figures out how to charge them",
   "created_utc": 1690942259,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufi9tt",
   "message": "Those little wallet calendars that banks and supermarkets give out for free at the beginning of the year. Like six months on each side of the card to slide into your wallet. It was like 1987 and good Ol' Aunt Gertie gifted my brothers and me calendars from previous years that pre-dated 1987....like 1984 and 1985.",
   "created_utc": 1690942953,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufj0zz",
   "message": "A used giftcard with a balance of $3.25 left on it",
   "created_utc": 1690943306,
   "score": 3,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufjekr",
   "message": "Grandma got me a Magnadoodle…..because I was into drawing…..when I was like fifteen.\n\n “It said ages five and up!”\n\nThanks grandma.",
   "created_utc": 1690943483,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufjh97",
   "message": "A scented wax melter that required a candle to be lit underneath it. Why not just get a scented candle?",
   "created_utc": 1690943520,
   "score": 6,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufl37t",
   "message": "“I don’t even own A gun, let alone many guns that would necessitate an entire rack. What am I gonna do…..with a gun rack?”",
   "created_utc": 1690944285,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juflklt",
   "message": "And hand towel",
   "created_utc": 1690944515,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juflmgh",
   "message": "A laminated paper with the periodic table of elements",
   "created_utc": 1690944539,
   "score": 4,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufmblo",
   "message": "Fancy barbecue sauce. I’m deathly allergic to tomatoes and the person who gifted me the sauce was very aware of that.",
   "created_utc": 1690944871,
   "score": 3,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufnd7n",
   "message": "A medium shirt. I'm 6'1\" \u0026amp; 275lbs.",
   "created_utc": 1690945381,
   "score": 3,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufo2l9",
   "message": "I got a USED copy of season 1 of Punk'd on dvd about 6 years after it aired.  Not as a joke either!",
   "created_utc": 1690945729,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufo587",
   "message": "My MIL made a big deal one Christmas about how she spent all this money buying me a brand new leather jacket (I don’t wear leather jackets, but ok?). Well when she gave it to me, it was size XS, very obviously used (had rips and stuff in it), and was not leather, it was some kinda plastic. The part that bothered me was the size. That’s a couple sizes too small for me on a good day. I didn’t act excited enough about it, so she became the victim. Oh, and told me I could just lose a little weight and it would fit.",
   "created_utc": 1690945764,
   "score": 9,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufp5qx",
   "message": "This plastic device that supposed to help you make meatballs. Never used it. I mean why not just use your hands? It works even better!",
   "created_utc": 1690946272,
   "score": 4,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufqoi2",
   "message": "One time my aunt who is also my godmother bought me a plastic dollar store. Fred Flintstone toy camera for Christmas. I promptly brought out my 35 mm camera that I was using weekly for a photography class and popped it down in front of her. She reached in her bag and pulled out of 20 and handed it to me",
   "created_utc": 1690947040,
   "score": 6,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juei6dx",
   "message": "Led lights that react to sound. It is like 1 small stick that you can attach anywhere and it needs charging...",
   "created_utc": 1690927311,
   "score": 4,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juevgqf",
   "message": "An ex boss of mine gave me a compass to help me find my way. He was such a tool.",
   "created_utc": 1690932854,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufa19o",
   "message": "A big donut candle that’s sickening sweet smelling.",
   "created_utc": 1690939210,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufacsh",
   "message": "A toaster for sausages and buns. Gave it to a charity and hope they managed to sell it to some idiot.",
   "created_utc": 1690939350,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juesua6",
   "message": "A Bible.",
   "created_utc": 1690931741,
   "score": 6,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juemmt7",
   "message": "Clothes that are totally not my style",
   "created_utc": 1690929119,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juer7c7",
   "message": "a chia pet",
   "created_utc": 1690931049,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf3qsp",
   "message": "[removed]",
   "created_utc": 1690936432,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf9tvz",
   "message": "A mommy bible for the mom on the go",
   "created_utc": 1690939115,
   "score": 4,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufcngu",
   "message": "A big papier-mache fat cat that was about 18 inches high and just sat on the floor looking cute.  It wasn't like my mom to buy me something like that but she just thought I would like it and I thought it was the greatest thing ever!!  I had Fat Cat for years til I lost him in a flood",
   "created_utc": 1690940386,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juffr4k",
   "message": "My cunt of a sister, who will always be a cunt.  Gave me a framed picture of her at her birthday party when she turned 21. For my 21st birthday.",
   "created_utc": 1690941786,
   "score": 3,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueq84l",
   "message": "My friend sent me a wedding invitation that was carved from a tree, they divorced a year later.",
   "created_utc": 1690930636,
   "score": 4,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf5okk",
   "message": "A second vase in his favorite colors after telling him I didn't like flowers because he got me the first vase and insisted on buying me flowers.",
   "created_utc": 1690937287,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf7sdi",
   "message": "A candle. I don't like them/use them. I regift or donate.",
   "created_utc": 1690938207,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufcju4",
   "message": "My (ex) husband got me a curtain rod for Valentine’s Day.  Just a plain white curtain rod.  I did not need a curtain rod.",
   "created_utc": 1690940339,
   "score": 6,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufjhjf",
   "message": "A bright pink top with glittery stars and rhinestones that was a size small. I almost never wear bright colors, I despise glitter and ami have not worn small since 4th grade. It was from my ex MIL who knew damn well I wouldn't wear it even if it was the right size. She had it in her head that I was super petite because she wore a size 7x and I wear a large/XL/2x depending on the shirt.",
   "created_utc": 1690943524,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueseh1",
   "message": "For me no gift is useless. The fact that someone took the time to get me something is special on and of itself.",
   "created_utc": 1690931555,
   "score": 255,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf10an",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juevrst",
   "message": "A toothpaste tube roller.  My girlfriend got it for me because I always squeeze every last bit out of the tube. The thing cost more than it could possibly save out in a lifetime.",
   "created_utc": 1690932986,
   "score": 0,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juey7om",
   "message": "O, boo. There is no such thing! :D",
   "created_utc": 1690934029,
   "score": 255,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juekurc",
   "message": "An digitalartpad and stylus. My only other electronic was a flip phone.",
   "created_utc": 1690928384,
   "score": 0,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juens97",
   "message": "My satisfyer",
   "created_utc": 1690929599,
   "score": 0,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf1g98",
   "message": "Couple years ago for Christmas I just told people I wanted \"sharp and practical\"\n\nI got one of those Huusk knives from Facebook ads or something like that.\n\nIt's neither.",
   "created_utc": 1690935434,
   "score": 0,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf8o7u",
   "message": "The first thing that came to mind was actually a gift my mom got.  It was one of those towel warmer things like they have at spas.",
   "created_utc": 1690938595,
   "score": 0,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf9uup",
   "message": "The gift of life",
   "created_utc": 1690939127,
   "score": 0,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juff5jq",
   "message": "Life",
   "created_utc": 1690941510,
   "score": 0,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufkc3c",
   "message": "A wooden homemade locket box. Couldn’t fit anything I really wanted in there but it was a smooth box.",
   "created_utc": 1690943926,
   "score": 0,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufkxf6",
   "message": "I don't know, maybe I am being entitled and ungrateful. My ex knew I loved Pokemon, and knew I always identified with water and moon elements. So when Pokemon Sun and Moon came out I obviously got Moon.\n\nI wasn't too crazy about the game, I was very vocal about it and a few months later when my birthday rolled around my ex decided the best gift was to get me Sun... I was more than a little disappointed, especially since he knew how I felt about the game and considering I already got the version I wanted the most",
   "created_utc": 1690944207,
   "score": 0,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufu4jk",
   "message": "When I was a kid I used to get them all the time for Christmas and my birthday I was an only child and people would buy me board games you ever try to play Monopoly by yourself or battleship or Rock'em sock'em robots🤣🤣🤣",
   "created_utc": 1690948864,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufazzi",
   "message": "As a joke we give our dad really expensive shoes for every holiday (birthday, Christmas, Father’s Day etc) he’s been in a wheelchair for the past 30 years lol",
   "created_utc": 1690939639,
   "score": 255,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf9bj3",
   "message": "Flowers. I was dating a girl and she sent flowers to my work.",
   "created_utc": 1690938885,
   "score": 254,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jueylka",
   "message": "Someone gifted me headphones. I didn't even have a phone at the time. And they were so uncomfortable and bad for your ears I wouldn't even use them if I had a phone at the time.",
   "created_utc": 1690934194,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juez7uk",
   "message": "Coupon for a facial and lashes. I'm a guy. \n\nThis is why you don't give stuff like this as a white elephant gift.",
   "created_utc": 1690934459,
   "score": 5,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf3wwp",
   "message": "A dart board. \n\nI hate darts.",
   "created_utc": 1690936508,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf75r2",
   "message": "Mom’s cousin’s now-ex-wife gifted me a singalong book/CD thing for a popular Disney channel personality. I hated that character with every fiber of my being bc for a decade I would introduce myself and ppl would say “oh, like (said Disney personality)”. I politely said “thank you”. When I got home I looked thru the “picture book” (which was way below my reading level) one time and then threw it away in disgust. \n\nThe second most useless gift was the slippers that were about 4 sizes too small for me. My sister was gifted identical slippers that were also way too small for her lol. We had to toss both pairs.",
   "created_utc": 1690937928,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf78o4",
   "message": "Keyboard shaped waffle iron",
   "created_utc": 1690937965,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juf9k65",
   "message": "A cheap kids colouring book.",
   "created_utc": 1690938992,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufanwj",
   "message": "Someone bought me a mirror. Have zero fuckin use for a random mirror.",
   "created_utc": 1690939489,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufbe5w",
   "message": "My dad randomly gave me a dvd of Paul blast. He blatantly was regifting to me",
   "created_utc": 1690939817,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufed92",
   "message": "A cloth map to a video game I've never played. The heart was there, they knew I liked games, but I'd never touched the game they got me a map for so it doesn't have any sentimental value to me",
   "created_utc": 1690941155,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juff4f0",
   "message": "My mum gets me fashionable scarves for Christmas every year, I don't wear scarves nor am I fashionable",
   "created_utc": 1690941496,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufg28c",
   "message": "My ex-gf Stacy  got me a gun rack... a gun rack. I don't even own a gun, let alone many guns that would necessitate an entire rack. What am I gonna do... with a gun rack?",
   "created_utc": 1690941930,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufi6n3",
   "message": "A rock",
   "created_utc": 1690942911,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufinhm",
   "message": "A glass apple paperweight from my nana… I was 5 :/",
   "created_utc": 1690943129,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufkrqi",
   "message": "A blatantly racist porn DVD that they thought would make a funny gag gift.",
   "created_utc": 1690944132,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juflpqa",
   "message": "The maintenance guy at work gave me his ex wife's tongue rings as a Christmas gift.",
   "created_utc": 1690944584,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juflves",
   "message": "an iou that was forgotten by the gifter",
   "created_utc": 1690944659,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufonr8",
   "message": "One of those stupid little Japanese trees. I forget the name. My friend thought I needed another hobby, so she got me one of those stunted little trees in a pot that need an endless amount of fussing over. She told me there were books I could buy that could teach me how to care for it. Fat chance. I couldn't be bothered watering a cactus enough times to keep one alive. The thought exhausts me. Never mind trimming some damn thing. I watched the pathetic wither and die and threw it in the trash and the stupid thing still haunts my dreams.",
   "created_utc": 1690946021,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufop4a",
   "message": "A crystal making set when i was 12",
   "created_utc": 1690946039,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufpike",
   "message": "My sister once gave me \"Jesus Nails\" for Christmas.\n\n4 rough hewn nails with fake blood on the ends, in a box, with a bible verse...",
   "created_utc": 1690946453,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufpjif",
   "message": "A bible.",
   "created_utc": 1690946466,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufvjgd",
   "message": "For graduation my relatives gave me a gift card to a christian bookstore. A couple years later I gifted it back.",
   "created_utc": 1690949649,
   "score": 6,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufs3md",
   "message": "I grew up super poor, but my grandma and great aunty really held it together at Christmas time and made sure each of us kids got something from mom and something from Santa. Naturally we would scope out the wrapped gifts under the tree leading up to the morning and me and my brother had our eye on this box that had both of our names on it. \n\nWell on Christmas morning when I was about 7 I opened my gift from grandma and it was a psp game. Obviously I didn't have a psp so I got super excited because obviously I knew what was in the box now. \n\nMy grandma and aunty didn't know there were different kinds of Playstation, and assumed this game would work in the ps1 our uncle gave us. I don't remember what was actually in the box, but I do remember the disappointment when we opened all the gifts and there wasn't a psp. \n\nLove my aunty and miss my grandma. The MVPs of my childhood. I've never seen any people go to such great lengths to supply some children with joy.",
   "created_utc": 1690947776,
   "score": 6,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufqszk",
   "message": "Not me, but my brother received some rollerblades from my grandmother. Or at least the box displayed rollerblades. He opened it up and it was just a bunch of random shit from her junk drawer lmao.",
   "created_utc": 1690947103,
   "score": 3,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jug0742",
   "message": "Kids microscope 🔬 I was at university studying biology.. my parents were trying to be helpful and got me a microscope…. It was meant to be used by 5 year olds",
   "created_utc": 1690952423,
   "score": 3,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jug30f8",
   "message": "My 20th bottle of Bod bodyspray given by family who put no thought into a gift beyond 'man = bodyspray\" for birthdays and holidays.\n \nI buy my own colone. And I don't like Bod.",
   "created_utc": 1690954256,
   "score": 3,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufsm5y",
   "message": "Generally gift cards to restaurants I don't eat at.\n\nAbsolute worst, as a young dude (pre-teen) my aunt got my brother and I what she thought were \"oversized graphic tees.\" New trend? I dunno, but they were not \"oversized graphic tees,\" they were girls sleep shirt/pajamas.",
   "created_utc": 1690948048,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufsp1o",
   "message": "The bible",
   "created_utc": 1690948090,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juft8uu",
   "message": "My uncle lived in British Columbia and for christmas one year sent our family a elephant head bust smoking a pipe and wearing glasses, mounted on a plaque. They were apparently pretty popular where he was and he thought it was funny. It was made of the scrotum of a moose and the elephants trunk was moose foreskin...",
   "created_utc": 1690948385,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufti98",
   "message": "A Chanel mini bag. i am even unable to put my phone in it.",
   "created_utc": 1690948526,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juftsxt",
   "message": "Any type of alcoholic beverage. I don’t drink.",
   "created_utc": 1690948689,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "juftwlh",
   "message": "Shot glasses and a decanter from my mum about 6 months after getting out of rehab for mostly booze and uppers.",
   "created_utc": 1690948743,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufv07o",
   "message": "Fancy bar of soap with dried flowers in it…",
   "created_utc": 1690949351,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufwrgg",
   "message": "The \"gift of nothing\" which was a wrapped up empty plastic box gag gift .\n\nIt had a $1 sticker still on it.\n\nWe were having a Secret Santa with a $20 spending limit...",
   "created_utc": 1690950350,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufwtxc",
   "message": "A 4 person camping tent for my birthday.\n\nI hate camping, especially in tents.\n\nEvery year we go camping in the middle of the Summer with some of my wife's friends and their families and I grit through the event counting down the hours until we get to break down camp, load it in the car and drive home.  \n\nShe always has to work late the first day of camping so I end up leaving early and setting everything up in the sweltering heat and hating life.  When she arrives it's always something critical about the position of the tent or the orientation of it.\n\nIt tore the second year we used it.  We patched it up with duct tape to make do for the trip.  At the end we took it down and threw it out and she lamented that it was a shame since she knew how much I liked THAT tent since I enjoyed camping.",
   "created_utc": 1690950391,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufytrx",
   "message": "A Bible.",
   "created_utc": 1690951581,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jufz956",
   "message": "I must have been 4 or 5. I unwrapped a tiny poorly wrapped present to find a rock in it. There was nothing particularly special about it. It wasn't a rare stone. It wasn't smooth. It wasn't large. It looked like something someone picked up from a gravel  parking lot. It wasn't even clean. \n\nI was particularly peeved. I felt I had been pranked and went to the front door. I opened it, chucked it as hard as I could into the front yard, then closed the door. I went back to my presents.\n\nMaybe 20 mins later my younger cousin (I think he was 2 or 3?) came up to me to ask if I got his present.  I asked what he gave... and he mentioned the rock. 😦😬 I told him I did get it and thanked him. ☺️\n\nI didn't mention I had chucked the rock present until years later when we were teens exchanging old family's stories at another family gathering.",
   "created_utc": 1690951840,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jug07ux",
   "message": "Multiple of the same alarm clock radios from the same aunt from the 80s to the 90s. She never took the time to get to know me as a person. So she got me a generic gift for every year for almost 10 years. Mom would quietly return it to the store for store credit and I would get to choose my own gift.",
   "created_utc": 1690952436,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jug1c07",
   "message": "Christian music record after I left christianity\n\nOnly thing it's good for is the scratchy thing DJs do",
   "created_utc": 1690953144,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jug2wuf",
   "message": "An NFC electronic ring\n\nIt's meant to work as an NFC scannable item, but it can only store a tiny line of info, so it's almost entirely useless even if I could figure out how to get it to actually work.\n\nIt's also far too big for my skinny fingers, so I wouldn't be able to wear the thing anyway. It's too loose even for my thumb.",
   "created_utc": 1690954189,
   "score": 2,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jug3gae",
   "message": "Someone bought me a knee high dog garden figurine.\n\nI was a college student living in a dorm.\n\nI did not have a garden.",
   "created_utc": 1690954559,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jug3kz6",
   "message": "My whole family got AirPod cases for Christmas as a stocking stuffer. I was the only person in the family who didn’t have AirPods and when I did get them the case didn’t fit.",
   "created_utc": 1690954647,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jug3pll",
   "message": "My dad considers an apology text the weekend after my birthday to be a gift. He doesn’t know what day my birthday is, so he waits until he’s pretty sure it passed and sends a half assed apology and congratulations text",
   "created_utc": 1690954737,
   "score": 1,
   "submission_id": "15fq8mp"
  },
  {
   "comment_id": "jug4dcw",
   "message": "My sweet old grandparents used to get my brothers and me dress shirts for Christmas.  Really, really terrible-looking dress shirts.  I'm sure they were on sale somewhere they shopped.  Patterns like stripes and plaids with weird mixtures of bright \u0026amp; pastel colors.  Shirts so bad, if we wore them we'd have kick our own asses (as they say).  \n\nBut as I said, they really were sweet and loving grandparents.  They just had no clue what the kids were wearing in those days.  \n\nOh, and they always slipped a $5 bill in the breast pocket (which was quite a fortune in the 60s and 70s for kids like us).  Thanks grandma.  Thanks grandpa.",
   "created_utc": 1690955196,
   "score": 1,
   "submission_id": "15fq8mp"
  }
 ]
}