{
 "submission_id": "15fu2t7",
 "title": "Hospital workers, what’s your creepy or unbelievable story?",
 "selftext": "",
 "created_utc": 1690937076,
 "permalink": "/r/AskReddit/comments/15fu2t7/hospital_workers_whats_your_creepy_or/",
 "score": 48,
 "url": "https://www.reddit.com/r/AskReddit/comments/15fu2t7/hospital_workers_whats_your_creepy_or/",
 "comments": [
  {
   "comment_id": "jufccyr",
   "message": "When I was a travel nurse, I was working at a small hospital in missouri on the geriatric psych unit. Late at night I swore I heard a baby crying every now and then but just chalked it up to my imagination - the hospital didn’t have a labor/delivery unit or any unit for babies. There were Several times a patient would make a comment about hearing babies cry.  I mentioned this to a staff nurse one night and she told me the unit used to be an old nicu back in the day",
   "created_utc": 1690940253,
   "score": 49,
   "submission_id": "15fu2t7"
  },
  {
   "comment_id": "jufdvjw",
   "message": "i worked at an elderly home during a night shift all the lights were off in the hallway so i decided to do a checkup on the patients. \nwhen i came to the last room it was an old woman 95+ years old and she was in her bed sleeping, so i went out in the hallway and it was so quiet you could hear yourself breathing. \ni just walked a couple of steps and something told me to turn around and the woman who i just checked up on WHO was laying in her bed was now at the end of the hallway just standing there. \n\nand believe me if she would’ve opened her room i would’ve heard it because i was like 3 steps away from her room and i know she was in her bed also it’s not a chance she would be able to move so fast out of her bed and out of her room to the hallway without me hearing her.\nanyway, understandably i almost had a heart attack right then and there. i still don’t understand it tbh because i SAW her sleeping in bed and the next second she was standing in the hallway staring down my soul",
   "created_utc": 1690940938,
   "score": 30,
   "submission_id": "15fu2t7"
  },
  {
   "comment_id": "juf5ixp",
   "message": "One time someone said \"it's really quiet tonight\" and it was quiet for the rest of the night. Unbelievable, I know.",
   "created_utc": 1690937218,
   "score": 84,
   "submission_id": "15fu2t7"
  },
  {
   "comment_id": "jufoysg",
   "message": "I used to work a weird 5pm—2am shift in a hospital pharmacy that involved a lot of running to different units for various medication related problems. Mostly nurses not checking the tube station and telling me their doses were missing but I digress. There was one corridor I frequented that was brightly lit but always empty late at night and every once in a while I would feel like someone was watching me, but hospitals are weird and I figured my mind playing tricks on me. Until one time when I looked up in those reflective ball mirrors they have in the corners to make sure you don’t run into a bed and there was this faceless figure with a long cloak standing behind me and a hood on. It never moved and I would only see it for a second in the mirror and nothing when I turned around and did a double take. I chalked it up to sleep deprivation and stress but it was unsettling. I never told my coworkers about it for obvious reasons.",
   "created_utc": 1690946175,
   "score": 21,
   "submission_id": "15fu2t7"
  },
  {
   "comment_id": "jufflxx",
   "message": "Had a patient executed in my icu one time. Person in the icu had a regular visitor. Always pleasant, smiling and friendly. One day this person walks in their typical happy self. Walks over to the patient, pulls a gun out of their pants, puts it to the patients head and kills them. Turns around and smiles at the nurse who is basically paralyzed with fear while priming an IV bag. Walks out of the icu and the hospital. Caught by police shortly thereafter. \n\nHospital responded by putting a security guard at an entrance to the icu that the visitor didn’t even use. We had mandatory ptsd modules to complete on the computer. Told not to call in due to staffing issues. This was pre covid.  Security guard pulled from that station about 2 months after the murder. \n\nI’ll add I wasn’t in the room when it happens but around the corner. I think about that nurse every now and again. And realize that the general public has no idea what we deal with.",
   "created_utc": 1690941719,
   "score": 41,
   "submission_id": "15fu2t7"
  },
  {
   "comment_id": "jufrset",
   "message": "Few things, had teenager get a toy stuck in his rectum and couldn't get it out so went to ER. Surgeon had to get it out. Heard story about patient who had pet snake like long ass snake. Friend snuck it in the hospital and it escaped and couldn't find it. They didn't tell anyone so no one knew a snake was loose. I guess an older female patient would see this snake at night come through ceiling of her room when she complained she saw snake the staff didn't believe her and kept giving her Haldol and Ativan to knock her out. The snake kept coming through ceiling whole week and lady kept getting meds to shut her up. Long be hold she was telling truth when maintenance guy found snake in ducts one day.",
   "created_utc": 1690947614,
   "score": 15,
   "submission_id": "15fu2t7"
  },
  {
   "comment_id": "juf8cb1",
   "message": "A girlfriend I had in uni worked at a coffee shop in one of them and said they all thought there was a ghost and by they all I mean everyone who worked in the place, admins, nurses, doctors like everyone swore there was, so they put up security cameras (yes it was that long ago, i'm OLLLLLLLD) and they figured out there was a homeless guy somehow living undetected in the hospital",
   "created_utc": 1690938449,
   "score": 41,
   "submission_id": "15fu2t7"
  },
  {
   "comment_id": "jufknjq",
   "message": "Not a hospital but an assisted living facility. I worked as a server and ine morning during breakfast another server screamed at a resident and threatened to shoot him...over scrambled eggs. Reported it to the supervisor and she did absolutely nothing. He didn't get in trouble and she threw away the written reports from me, the resident he threatened and several other residents and staff who saw the whole thing. Dude still works there. That was 3 years ago, that supervisor no longer works there and the new one has fired 2 people she was protecting for their behavior...he is not one of them.",
   "created_utc": 1690944077,
   "score": 13,
   "submission_id": "15fu2t7"
  },
  {
   "comment_id": "juf5u4t",
   "message": "Commenting for the replies, like if ghosts exist; shouldn't hospitals be the most haunted places?",
   "created_utc": 1690937354,
   "score": 13,
   "submission_id": "15fu2t7"
  },
  {
   "comment_id": "jufuw3o",
   "message": "Not the creepiest thing, but this happened yesterday: I was drawing labs from a patient who was going through pretty bad drug withdrawals, so she was having audio-visual hallucinations. It was late evening, and while I was in there, she asked me to make the kids playing hide-and-seek leave her room, especially the one under her bed who was making all that noise. I told her that there were no children in there, and when she asked me to check again, I told her they “must have left” so she wouldn’t get upset. After that, I walked out of the room, just as the hall lights went out and someone at the nurse’s station said in response, “Again? Who keeps messing with the lights? That’s the third time they’ve gone out.” As I was in the elevator on the way back to the lab, I thought to myself… those two scenes put together are straight out of a horror movie. Anyway, back to work!",
   "created_utc": 1690949289,
   "score": 6,
   "submission_id": "15fu2t7"
  },
  {
   "comment_id": "jufza85",
   "message": "In my first year as a nursing student, I was assisting a middle aged male patient with having a bedside wash. It was on an elective day surgery unit where patients would be admitted, have a surgery and be discharged the same day and were, for the most part, completely independent. \nI asked if he needed assistance with washing and he said yes, as he couldn’t wash his own genitals and lower body and proceeded to demonstrate to me how he was unable to move his arms in such a way that would allow for him to clean himself in that area. He put a large amount of emphasis on the fact that he definitely needed me to wash his lower half! \nAs an eager first year I spent a good amount of time washing as also being a male, I appreciated the need for good hygiene (I.e he wasn’t circumcised). \nAfter I’d finished washing and drying him, he told me that he was still damp and proceeded to grab the towel from the bedside table and dry himself and his genitals completely will no issue and had a good range of movement in his arms and was able to reach all areas that he said he couldn’t!\nI was creeped out but it taught me a valuable lesson in promoting independence with ADLs👍",
   "created_utc": 1690951858,
   "score": 4,
   "submission_id": "15fu2t7"
  },
  {
   "comment_id": "jufj7vy",
   "message": "Elderly ladies hit on me all the time and it's starting to really gross me out.",
   "created_utc": 1690943396,
   "score": 6,
   "submission_id": "15fu2t7"
  },
  {
   "comment_id": "jug53ri",
   "message": "Not a hospital, but I once took a  job at an independent living facility for the elderly. It is a lovely place and the residents were fascinating! I really enjoyed it, the work was easy, and the pay not bad.\n\nThe overnight worker (just one for the entire facility) got sick and I volunteered to do the night shift. I don't have minor children, I'm a late night person by nature etc. so no big deal.\n\nBoy is that place different at night lol.\n\nTwo incidents stand out as seriously scary during my week of overnight shifts.  Being alone was it's own kind of scary, while the residents slept. I'd occasionally see one wandering the halls at night, unable to sleep, but that's not the scary.\n\nPart of the job entailed going from top to bottom of all seven floors, several times a shift.  This was to make sure a resident hadn't fallen somewhere, to make sure things were secure, and such. No obviously broken equipment. So I would start at the top and walk along the patios, the halls, check in community rooms, behind sofas---everywhere. Laundry room, computer room, gym.\n\nThe floor that the gym is on is separate from the rest of the building. It has it's own elevator and there are business offices with closed/locked doors at night. Only the gym and the bathroom have unlocked (but closed) doors 24/7.  I go down in the separate elevator, into the small lobby, and enter the hallway.  And *something* is different---I  can smell something I cannot identify. And it's QUIET. Very quiet. Usually you hear HVAC or something. But this night, silence.  The first door is the gym and I open it, go inside. At night this room is a bit unnerving at first due to all the mirrors, darkness and such.  I flip on the lights, walk the perimeter of the room, all is well.\n\nI close the door and continue down the hall, checking locks, and at the other end is the bathroom. I open that, step inside to look around the toilet, behind the door, and as I'm stepping out, turning off the light, closing the door, I look all the way down this long, long brightly lit corridor to the other end.\n\nSitting in the middle of the hallway is a yoga ball. Still, not rolling. Just a bright green yoga ball. That was NOT there a moment ago. I stop dead still, one hand on the bathroom door, looking at that with utter terror. I look at the gym door and it's closed. My heart is hammering and it's hard to breathe and I'm frozen in fear. Is someone in the building? It's 3 a.m. and I'm alone on this floor.\n\nRight next to the bathroom was a small laundry/janitor closet and through that was an exit to the garage. I'm not going down that brightly lit hallway, I'm choosing that dead dark garage, I don't care.   I plan it carefully while watching that ball, all the doors, because I have to get out my keys, unlock that laundry door, get inside, close the door, unlock and open the other door to the garage, and go down about ten stairs in the dead darkness to where there is a light switch. Yeah, I know it's not right but it is what it is.\n\nI let go of the knob, reach for my keys...and that fucking ball moved. I had tears in my eyes I was so terrified. Alone. Three a.m. Locked doors all around me. Only exit is into darkness.  I take out my keys, afraid to take my eyes off that big green ball, I reach for the laundry room door that is literally three feet to my right, and as I'm jamming my key in the lock, the damned lights go out.  If I had not had my key IN the lock when that happened, I would not have been able to see a thing.\n\nTurned the key, flipped the light, nothing. Found the other knob, got the key in and NOW the HVAC kicks on full force, rattling like crazy and I cannot breath I am so terrified. Ghost or person, haunted yoga ball or what, I am scared to death.  I yank that door open and run/fall down the stairs, flip those lights on and full sprint run to the outside door of the locked garage. I threw that open and finally could breath. I'm outside the facility, 3 a.m., still alone, in downtown in a not that safe neighborhood----and I feel safer.\n\nI called 911, tell them I think someone has gotten into the building, that I'm alone, and with 70 vulnerable elderly people. Many of whom do NOT lock their doors.  The police come, they sweep  the entire building with dogs, and nothing. I'm feeling like a fool, but super grateful to find nothing. No yoga ball in the hallway.\n\nWe go to the office where there are cameras and there is film that shows the hallway, and the rest of the building. All the officers with dogs have left, and it's just two officers. We pull up the footage, and as I'm walking down the hallway...the door to the gym opens and the ball comes out. Absolutely inexplicable.  I embarrassingly burst into tears.  The officers watch as the lights go out, as I described, and when they come back on with the HVAC (yes, there is zero connection, but the cameras show they came back on while I was in the laundry exiting into the garage). The yoga ball is gone.\n\nThey go back down and check every office, every inch of the place.  There is no one on camera in the gym, the hallway, no where.\n\nThat was my last night working nights. Called the next morning, said I couldn't do it after that, they reviewed the cameras, and yoga ball shows up and disappears, just like before.  They said it was the HVAC making the door open, I hadn't closed it obviously (it was visibly closed) and blew the door open and moved the ball out the door and back in, closing the door. Which was closed when officers arrived. No explanation for the lights doing their naughty and about exploding my heart in terror.\n\nI'll go with that. Too embarrassing to say I called out the cops and dogs for the yoga ball that terrified me.",
   "created_utc": 1690955712,
   "score": 1,
   "submission_id": "15fu2t7"
  },
  {
   "comment_id": "juferg1",
   "message": "I'm not a hospital worker, but at a certain university complex in Mexico in the 70's you could walk into the back entrance of the adjacent Municipal Hospital and roam the halls, surreptitiously pilfering drugs and anything else that wasn't nailed down, and eventually, one day, one of our little forays led me and a couple confederates down into the basement, where the mortuary was. The bodies. And we stole an arm and put in in a nearby empty classroom in the School of Dentistry. In broad daylight. Just for kicks. When class started and the students filed in and the discovery was made there was much yowling and screeching and retching. It was, in a word, glorious.",
   "created_utc": 1690941335,
   "score": 4,
   "submission_id": "15fu2t7"
  }
 ]
}