{
 "submission_id": "15fu0gr",
 "title": "What’s the most fucked up thing you’ve done?",
 "selftext": "",
 "created_utc": 1690936885,
 "permalink": "/r/AskReddit/comments/15fu0gr/whats_the_most_fucked_up_thing_youve_done/",
 "score": 213,
 "url": "https://www.reddit.com/r/AskReddit/comments/15fu0gr/whats_the_most_fucked_up_thing_youve_done/",
 "comments": [
  {
   "comment_id": "jufdnig",
   "message": "While it happened over 30 years ago, sometimes I will remember it and think, “you sick bastard”.\n\nAll of my friends were headed to New Orleans to party. I had to work, but wanted to go. I called one of my managers around midnight and told his wife my GF had been killed in a car accident. I didn’t even have a GF. I was just a drug addict with no respect for others. \n\nGot back to work on Monday and they had a card signed by the whole staff. I ended up in rehab a couple of weeks later.",
   "created_utc": 1690940839,
   "score": 190,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufqq1k",
   "message": "Poo-cigarettes \n\nPooped in a plastic bag, left it on the porch for a week(it was May), smashed dried up poop into poo dust, bought cigarettes I know the individual smoked, emptied one and filled it with poo dust, left pack in their car. They threw up when they lit it. \n\nDon't fuck with family.",
   "created_utc": 1690947062,
   "score": 106,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "juf7bnp",
   "message": "Replied to a post admitting wild shit and got arrested",
   "created_utc": 1690938001,
   "score": 228,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufidts",
   "message": "Got engaged to then married my high school best friend within a month of reconnecting after not talking for 10 years. \n\nDivorced 3 months later.",
   "created_utc": 1690943005,
   "score": 89,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufpies",
   "message": "when I was 12 I took 23 sleeping pills and then went to my sister's room thinking I would die in there with her. \n\nshe thinks I did it because I didn't want to die alone. truth is I did it because I wanted to make her feel bad. she abused me my entire life and I wanted her to pay.",
   "created_utc": 1690946450,
   "score": 77,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufl92m",
   "message": "I tripped a kid on the bus launch when I was in elementary school. Didn't know him, didn't have any reason to do it, no thought what so ever. I heard someone sprinting behind me and I stuck out my leg, was almost like instinct. He fell skidded on his face, and I instantly regretted what I did.  I didn't apologize or anything though, I just kept walking with the rest of the crowd. I didn't't even see who I tripped, no consequences ever came of this for me. Till this day I don't know who or why I tripped them. By some chance if this sounds familiar, I am so fuckin sorry man. I sincerely apologize and I don't know why I hurt you.",
   "created_utc": 1690944363,
   "score": 157,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufskzm",
   "message": "I didn't talk to my mom after my dad's funeral because my big brother started a fight and she took his side. She was murdered several months later, and I hadn't even gone to see her on Christmas. My last words to her were in anger. I can never go back, and I'm so terribly sorry.",
   "created_utc": 1690948031,
   "score": 18,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufuflw",
   "message": "When my mom was dying (she was sick for 8 months- lymphoma), during her last hospitalization, the doctor asked me alone,  not my dad,  if they could give her morphine.  I was told she'd pass quickly.  I never told my dad or siblings.  I never spoke about it for decades. She did pass quickly.. within 30 mins.  😭",
   "created_utc": 1690949034,
   "score": 164,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "juflu23",
   "message": "In order to not fantasize or fully committ to suicide. I left my home. Leaving my brother and sister behind to deal with our troubled parents. I will always feel guilt for it. I tried to raise money to take them out of the house but school and drinking took all of my savings. We have a good relationship now as adults. But leaving to save money to also get them out and bring them with me and get lost in my own vice and school debt. Will ALWAYS. eat me inside. I feel like both my siblings could have been less broken adults had i stayed to look after them.",
   "created_utc": 1690944641,
   "score": 239,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "juf7sty",
   "message": "Quit on myself back in 2011. Haven’t been the same since",
   "created_utc": 1690938212,
   "score": 159,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufptli",
   "message": "My parents had a very toxic marriage growing up. Always fighting, physically and emotionally. One day we were coming home from somewhere and my parents were yet again fighting, my mom took off her wedding ring and threw it. I found it by my feet in the back seat and I threw it out the window. They’ve sense gotten a divorce rightfully so. But I still always think back to that and wished I didn’t do that. It’s not like it would have changed anything by not throwing it out the window, but still.",
   "created_utc": 1690946605,
   "score": 128,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufru05",
   "message": "I ate dog shit out of pure rage when I was like 6",
   "created_utc": 1690947637,
   "score": 211,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufomid",
   "message": "The most fucked up thing I did is probably telling my sister that I would be better off without her, and I hate her. So, she ran away from home and got into drugs and eventually overdosed at 15. After days in a coma, she didn't die though. But, she's still highly addicted.\n\nAfter that (even now) my mom has blamed me for being the reason my sisters is a crackhead. I'm not sure if it is my fault or not because she started doing drugs much before she ran away. But yeah that's the most fucked up thing I've done that's led up to be the biggest mess.",
   "created_utc": 1690946004,
   "score": 7,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufoexg",
   "message": "I made a DeviantArt account",
   "created_utc": 1690945898,
   "score": 159,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufbhd2",
   "message": "Supporting my ex financially (rent, bills, expenses, everything) for years because he refused to get a job",
   "created_utc": 1690939858,
   "score": 73,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufqkql",
   "message": "Was 5 years old and took a long nap at my neighbor's house who used to babysit me all the time. By the time I woke up, I was feeling some kind of groggy post-nap discomfort as my dad was picking me up. My dad asked me what was wrong, and I have no idea what compelled me to do it, but I made up a story about how the neighbor's kid beat me up and burst into tears.\n\nWell, my dad marches over and yells at the neighbor. Neighbor freaks out because she claimed that she was watching me the whole time and nothing happened (because obviously nothing happened), but my dad is angry and says he can't trust them to take care of me anymore. They have a falling out and stop talking to each other and never speak to each other again until we move away a year later. I don't know why five-year-old me did that and shit still haunts me to this day.",
   "created_utc": 1690946989,
   "score": 85,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufo7kt",
   "message": "Loving somebody more than I loved myself.. it will destroy you.",
   "created_utc": 1690945797,
   "score": 186,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "juf6lbh",
   "message": "Screamed at my mum I don't want to be born while in a heated argument \n\n\nI was born after she had 2 miscarriages and she considered me her little miracle",
   "created_utc": 1690937683,
   "score": 208,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufru3p",
   "message": "I always take a penny but I’ve never left a penny.",
   "created_utc": 1690947638,
   "score": 77,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufgnc7",
   "message": "Fucked my friends mom. I feel guilty but i kinda want more",
   "created_utc": 1690942198,
   "score": 134,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufd7u8",
   "message": "Staying with family, a mouse was caught by the tail and leg in a mouse trap. I knew if I tried to hit it with a shovel, I would chicken out and not fully strike it and just hurt it worse before it died. \n\nSo I drowned it.",
   "created_utc": 1690940643,
   "score": 183,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "juf574k",
   "message": "Nice try, FBI.",
   "created_utc": 1690937075,
   "score": 70,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufosk2",
   "message": "When I was five, my brothers and I would go to a fraternity house, lift up my youngest brother, through the mail slot, who would unlock the front door and we would jump on the bunkbeds. Well, we came back and they had blocked the mail slot, so we turned on a hose and put it in the mail slot.",
   "created_utc": 1690946088,
   "score": 64,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "juflr8c",
   "message": "[https://imgur.com/a/6UVLSfP](https://imgur.com/a/6UVLSfP)",
   "created_utc": 1690944604,
   "score": 117,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufkhl1",
   "message": "Put schoolwork first when I wanted to have fun instead.",
   "created_utc": 1690943998,
   "score": 120,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufpzb8",
   "message": "Ending a relationship with my girlfriend, enlisting in the military, and engaging in daily habits of smoking, heavy drinking, and fighting.",
   "created_utc": 1690946686,
   "score": 54,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufreif",
   "message": "I sucked my female friend’s toes in public (consensually) after putting ice cream on them",
   "created_utc": 1690947412,
   "score": 96,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufw1vy",
   "message": "A friend and I set a large field near my house on fire when we were kids.  He had the brilliant idea to go get some hair spray and a lighter and play flamethrower in a field filled with waist-high dry-as-fuck grass in the middle of August.  He lit a patch of grass on fire and saw how fast it was spreading so he tried to stomp it out and couldn't keep up with it.  He demanded that I help but I was wearing shorts and flip-flops and there was no way I was burning the shit out of myself so we booked it and stayed inside the rest of the day.  After hours of hearing sirens we were sure something had gone way worse than we imagined and that we were completely fucked.  But then I saw on the local news that the entire field had burned down and firefighters had barely managed to save a house that was on the far edge of it (far enough that we weren't even aware that there was a house there) but thankfully no one was hurt.  There was a set of train tracks that ran through the field so they thought a spark from a train had started it, so we got lucky.  As guilty as I (and I'm sure he) felt we managed to keep our mouths shut about it and got off scot-free.",
   "created_utc": 1690949942,
   "score": 25,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "juflkja",
   "message": "I got a boner listening to my teacher, her age maybe around late 50’s, while lecturing us about literature, and then i relieve my self by jerking off in the restroom",
   "created_utc": 1690944514,
   "score": 102,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufsr49",
   "message": "Well, I lost my temper and I took a knife and I uh-. Do you know those \"Do Not Remove Under the Penalty of Law\" labels they put on mattresses? Well I CUT one of them off!",
   "created_utc": 1690948121,
   "score": 94,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufsala",
   "message": "Pissed in someone's shampoo bottle as revenge for putting used toilet paper on my pillow",
   "created_utc": 1690947880,
   "score": 20,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufmnvl",
   "message": "Telling people the most fucked up thing I’ve done, not gonna get me twice Ricky!!",
   "created_utc": 1690945036,
   "score": 37,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufs6tb",
   "message": "I was mowing a neighbors yard and saw a baby bunny in front of the lawnmower. It was a self propelled mower and had too much momentum. I pushed down on the bars to raise the blade…Too late.\n\n(This gets way worse)\n\nI heard the blades hit and thought, that’s that. It wasn’t. The mower chopped off the top of its head and ears. It started screaming and panic running all over the place. The screaming was a sound only heard in hell. I tried to stomp on it to kill it but missed. I ran over it 3 more times to kill it. The second pass hit full body but still didn’t kill it. Third pass stopped the screams. I let go of the mower and walked home.",
   "created_utc": 1690947823,
   "score": 47,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "juflqh0",
   "message": "I nutted in an escort who was married",
   "created_utc": 1690944594,
   "score": 119,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "juf5skw",
   "message": "A cowardly act of criminal sabotage in the year 2001.",
   "created_utc": 1690937335,
   "score": 67,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufufu3",
   "message": "[this was many years ago]\n\nI am a good person and a law-abiding citizen. I would never recommend anyone do this.\n\nI hit rock bottom at one point in my life after getting let go from a job I loved. It led me down a spiral of severe financial instability. I couldn’t afford rent, groceries, or gas for my car. I spent many months desperately applying to jobs, even in the service/fast food industry despite having a degree and a fairly impressive work history.\n\nI had to eat - and for roughly six months I stole food from a bunch of different major grocery department stores. It’s crazy how easy it is. I would fill my basket with only what I needed and just walk out. I’d change the store every time. I never got stopped once. Probably because I’m a very well-put-together looking guy. Over the course of those six months I ended up stealing hundreds of dollars worth of food. It didn’t feel good. I’d cry in my car on the way home, with the gas light on, every time. I couldn’t believe I was this low in life after how hard I worked. \n\nAfter those six months, I finally found a well-paying job.\n\nI haven’t stolen since.\n\nAny chance I get I’ll give my last penny to a homeless person. I was almost there. It’s scary.",
   "created_utc": 1690949037,
   "score": 15,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufatu8",
   "message": "hid under a girl bed during a school field trip",
   "created_utc": 1690939563,
   "score": 53,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufneac",
   "message": "Slept with the brother in law's wife. Really messed the family up.\n\n3/10 would do again.",
   "created_utc": 1690945395,
   "score": 111,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufodpg",
   "message": "Beat the absolute hell out of a guy for threatening my family.",
   "created_utc": 1690945881,
   "score": 32,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "juflbnf",
   "message": "Got married",
   "created_utc": 1690944396,
   "score": 71,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufq1b0",
   "message": "May or may not have stabbed a dude with scissors in the balls as he was assaulting my bff after she told me \" no matter what i dont wanna have sex tonight\" after a night of drinking. For context she was screaming \"no\" from the other room. Some others may or may not have drug him out into the street bleeding and beaten up.\n\nNot really fucked up i guess but its something i never saw myself actually doing as i was a very shy and non-confrontational person at the time.\n\n\nMore fucked up i guess is when i convinced a church to give me 500$ because i was a \"single mother\" and spent the money on booze and drugs.",
   "created_utc": 1690946713,
   "score": 71,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufo7op",
   "message": "Went on Reddit and confessed to all my crimes so they could be held against me forever",
   "created_utc": 1690945798,
   "score": 40,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufg6up",
   "message": "I masturbated at my moms boss's house.",
   "created_utc": 1690941989,
   "score": 43,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufrnoi",
   "message": "Got convinced to argue in defence of a rapist, twice\n\nThe first time it was because he was one of our friend groups best friends, and the girls in the group didn't believe he had either, he was super nice, and the girl struck us as manipulative and cold\n\nI apologized profusely to her after he raped a friend of mine and we cut him out pretty severely\n\nThe second was this guy had undoubtedly raped someone, got called out to like 60 people but when he tried to kill himself our other super charismatic friend cajoled is into defending him. I realized what he had done after I got into a huge blowout argument with him months later \n\nI no longer associate with any of these people",
   "created_utc": 1690947545,
   "score": 45,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufqf7f",
   "message": "Idk about the most fucked up but the stuff that sticks with me most is stealing from fellow classmates in middle school, lying and making shit up etc.   \n\n\nEspecially one time when I was between a good friend group and a bad one. I stole 5 dollars from a sweetheart of a kid and someone who considered me a friend. My good friend group tried to tell me to put it back, I never did. They stopped talking to me, I went towards the bad one and we all ended up miserable together, stealing shit throughout high-school and generally just being assholes to everyone around us, including each other.  \n\n\nThings are different now but I still feel a lot of guilt as I enter middle age and settle into life and a career. They're reminders to be better, but painful ones.",
   "created_utc": 1690946909,
   "score": 26,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufq696",
   "message": "I’ve gained almost 100lbs since beginning of covid. \nThe whole thing fucked with my already manic depression. I didn’t know how else to deal with being an essential worker and my husband going to school other than to just eat.\n\nI feel like I’ve ruined my body and there’s no going back. \nMy therapist and I have been working on this shit for years, on why I still binge eat and feel horrible everyday. So many fucking layers of childhood trauma and then feeling the betrayal of being cheated on.\nI don’t have the energy to work out or diet. If I do, it’s a constant cycle of lose 20lbs, gain it back two months later. I don’t know how to make myself stop.\n\nSometimes I wish I was an alcoholic instead. Guess I can probably still destroy my liver before I’m 40.",
   "created_utc": 1690946784,
   "score": 34,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufv60l",
   "message": "I cheated once. Never again \n\nIt was way shit and I felt terrible about it. Broke my ex's heart, we're friends now though\n\nIf you love your partner the cheating sex won't be worth it, pal. Just break up with em and work on yourself without hurting someone who genuinely cares about you",
   "created_utc": 1690949441,
   "score": 12,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "juftekc",
   "message": "Waste years of my life on the wrong people. I'm nearly done with my 20's and I hate that I didn't take control sooner.",
   "created_utc": 1690948471,
   "score": 29,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "juf5wzk",
   "message": "Caused the hole in the ozone with my sick vapes",
   "created_utc": 1690937389,
   "score": 66,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufegw3",
   "message": "Doubted myself",
   "created_utc": 1690941201,
   "score": 18,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufqefl",
   "message": "Screaming into a void; becoming more selfish and delusional the more I sunk into my phone. I’m an entitled piece of shit",
   "created_utc": 1690946899,
   "score": 22,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufseyf",
   "message": "Looked at an NSFW post at work",
   "created_utc": 1690947942,
   "score": 17,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufq8v2",
   "message": "I used to sh a lot and I had a collection of blades, my friend who also did was staying with me for the summer, he had asked to borrow my blades and I let him\n\nAnother time a month or so later he got drunk and my sister and I were trying to calm him down without waking up our mother, he ran out of the house at some point after she'd found out what was going on, the cops were called and were questioning him, he said he needed to use the bathroom and asked for his pencil case which had his blade in it, I knew this but I didn't say anything, he ended having to get stitches\n\nI feel guilty about these things everyday and have apologized to him but he doesn't blame me for some reason",
   "created_utc": 1690946820,
   "score": 9,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufz1kn",
   "message": "I was having sex with a woman and her phone rang.  Met her on active duty. She too was active duty. \n\nThis was the first time i ever had sex btw. \n\nShe answered her call and started talking saying that she was at the mall with her friends. \n\nI was doggy style with her and i had stopped. \n\nAfter a min i slowly started up agin, and then she said “i love you too honey”. \n\nI did not stop even when the realization hit me. \n\nI finished, thanked her. Told her we should not see each other anymore because we both had agreed not to get attached emotionally. \n\n Months later i slept with her bootcamp bunkmate who was still in touch with her and she told me that her husband had found out and had threatened to kill me.",
   "created_utc": 1690951712,
   "score": 6,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufous6",
   "message": "Banged OPs mom 15 years ago. Son, you should not have posted this.",
   "created_utc": 1690946118,
   "score": 33,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufm6k6",
   "message": "Depends what’s bad, fucking her best friend for revenge or the racing in the country in and out of traffic",
   "created_utc": 1690944804,
   "score": 23,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufv2aq",
   "message": "Answered an “anonymous “ survey honestly at work…. Shit fucked my world up",
   "created_utc": 1690949384,
   "score": 7,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufs3jt",
   "message": "I tried to get a guy deported bc he wouldn’t respect that i wanted a platonic friendship. Kept flirting with me, ignored my “No”s and eventually i decided enough is enough",
   "created_utc": 1690947775,
   "score": 29,
   "submission_id": "15fu0gr"
  },
  {
   "comment_id": "jufr0zg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15fu0gr"
  }
 ]
}