{
 "submission_id": "15g2kkl",
 "title": "Were you smacked as a child and what is your opinion on it now as a form of punishment?",
 "selftext": "",
 "created_utc": 1690963204,
 "permalink": "/r/AskReddit/comments/15g2kkl/were_you_smacked_as_a_child_and_what_is_your/",
 "score": 41,
 "url": "https://www.reddit.com/r/AskReddit/comments/15g2kkl/were_you_smacked_as_a_child_and_what_is_your/",
 "comments": [
  {
   "comment_id": "jugpjv6",
   "message": "Mom used to hit us with a wooden spoon or spatula. It didn't really work, though. \n\nBut man ... time outs ... those worked. You're telling me I have to sit in a chair for 10 minutes while everyone is playing? What fresh hell is that?",
   "created_utc": 1690971552,
   "score": 114,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhkg8w",
   "message": "While I may not agree with his stance on masturbating in front of people... Louis C K said it best, \"I really think it’s crazy, that we hit our kids, it really is. Here’s the crazy thing about it, kids are the only people in the world, that you’re allowed to hit. Do you realize that? They’re the most vulnerable and they’re the most destroyed by being hit, but it’s totally okay to hit them. And they’re the only ones! If you hit a dog, they fucking will put you in jail for that shit. You can’t hit a person unless you can prove that they were trying to kill you, but a little tiny person with a head this big that trusts you implicitly? Fuck them, who gives a shit?\"",
   "created_utc": 1690987183,
   "score": 188,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugq9bx",
   "message": "I was slapped in most occasions (for accidents that I made) and smacked to the butt with a broom (for sleeping in on weekends). My parents only did that when they were angry, not when they wanted to teach. It was punishment for the sake of their emotion.\n\nI was also smacked in the hands by my teacher with a wooden ruler (for failing to memorize something). In contrast with my parents, the teacher was controlled and prepared me beforehand with lessons and warnings. So it was a milder punishment which left me with no repressed anger, though the sharp pain is still in my mind. \n\nI was a very smart and docile child. I never meant to do bad.\n\nIt was later in life when I found out all these lessons could be taught without corporeal punishment that I felt humiliated, because what all these incidents did was causing fear and shame, not love, not self-confidence, but a fear that people with authority can take away the rights to my own body at any time.",
   "created_utc": 1690972066,
   "score": 197,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juh96xt",
   "message": "I was, often, by both parents. I told my mum if she ever hits my daughter, I’m going to hit her back. I will never ever use violence on my daughter. \n\nMy dad has apologised and said it’s no excuse, but that’s how he was raised and so that’s what he did. My mum says she never hit us, but she’s so much improved now as a grandmother than she was as a mother. She’s not one to admit to her mistakes, so I’ve accepted that changing without discussing it as as good as I’m going to get.",
   "created_utc": 1690982499,
   "score": 65,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugpmop",
   "message": "I was spanked quite regularly as a kid. It only taught me that I couldn't trust adults and that I needed to hide anything that might remotely get me in trouble. It didn't stop me from doing anything I wasn't supposed to, it just taught me how to sneak around and hide it really well. It also taught me very poor anger management, and that resulted in me having to teach myself appropriate anger management in high school and college. My favorite part is that I got in trouble in kindergarten for hitting a classmate who made me angry. And then I got spanked when I got home to \"teach me that hitting isn't okay\".\n\nI absolutely will not be spanking, smacking, swatting, or however else you want to term it when it comes to my children. It hurts them far more than it helps. And besides, I wouldn't hit an adult if they needed correction, so why would I hit a child?",
   "created_utc": 1690971609,
   "score": 239,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhnpxh",
   "message": "I do not think my parents abused me, and I don't hate them for it, and I still have contact with them. In the time period I was raised, this is not only how people disciplined their children, it's how experts in the field of child psychology told parents to discipline their children. My parents were products of their upbringing and the time they lived.\n\nI was physically spanked as a child by both parents, occasionally slapped by my mother. I don't recall my father ever slapping me. Occasionally I was spanked with a belt, and there are two occasions I can remember being spanked with a shoe. One of them I remember was for talking in church at the Christmas or \nEaster mass (Catholic, obvs) we went to with my grandparents.\n\nNever once did I think \"That is the consequence of breaking a rule or defying authority.\" All I thought, every single time, was that if I was big enough to do it, I would hit them back. When I was left crying in my room, I never thought \"I must remember this lesson the next time I think I might do something like that again.\" All I thought was \"I hate them.\"\n\nPhysical punishment never taught me respect. It only taught me rage.",
   "created_utc": 1690988459,
   "score": 167,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugg5m1",
   "message": "yes i was - it's actually more like i was beaten as a child. you shouldn't ever hit someone to get a message across, especially a kid. you're only teaching them to fear you",
   "created_utc": 1690964207,
   "score": 74,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugsd3g",
   "message": "Yes, and I genuinely think it didn’t do shit. I was physically abused by my father from a newborn to 9-years-old. He also domestically abused my mother. It’s really stressful. Like, imagine being a young kid and having the police come over so many times to ask you about what happened. And, like, the police made my 6-year-old sister decide if he should go to jail. What kind of shitty person makes a young child decide if their father should go to jail, when they’re obviously afraid and scared of the consequences. I don’t think that’s it’s a good punishment. I mean, sure, you may think that they’ll learn their lesson. But trust me, it didn’t make me learn crap.",
   "created_utc": 1690973520,
   "score": 93,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugx4co",
   "message": "Yes and i have never smacked my daughter and never will",
   "created_utc": 1690976459,
   "score": 124,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugqcbi",
   "message": "Dad gave me a bloody nose on Xmas eve. Seems like overkill",
   "created_utc": 1690972126,
   "score": 37,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juh5s64",
   "message": "I feel like it contributed to my anxiety problems that I still suffer from today. My younger brothers are also very nervous around our father and lack confidence. They don't respect him they fear him. I wouldn't want that for my children.",
   "created_utc": 1690980944,
   "score": 33,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugt681",
   "message": "Yes and it sucks.  Teaching children that violence is the answer creates more adults who use violence to solve issues.  Most kids just want their parents involved in their lives and prefer positive support.",
   "created_utc": 1690974056,
   "score": 133,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juglrh5",
   "message": "Happened a couple of times. Genuinely can’t remember what it was for, just that I got whacked. I think it’s more effective to actually talk your kid through how they fucked up and make them work to patch it up. Like if they scribble crayon on the walls, I think it’s better to supervise them cleaning it up. That’ll teach them the consequences of their actions more effectively than the same belt for every misstep.",
   "created_utc": 1690968649,
   "score": 27,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhr8n9",
   "message": "Yes, as a very young child if i had done something dangerous my mother would smack my legs. My father would sit me down and explain why it was dangerous, and made sure i understood.   \n\n\nI remember and learned my fathers lessons, I dont talk to my mother.",
   "created_utc": 1690989813,
   "score": 30,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juh68mm",
   "message": "I was only spanked, but all it did was make me hate my father and caused a rift that last our whole lives. Abuse of any kind, physical, sexual, emotional, financial, spiritual, is never OK for any reason.",
   "created_utc": 1690981156,
   "score": 19,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhddzo",
   "message": "Yes.\n\nI wouldn't smack another adult if they were doing something wrong, so why would I smack a child?",
   "created_utc": 1690984325,
   "score": 10,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugm8fl",
   "message": "I was. I don't smack my kids. I hadn't seen my mother in a decade, and she smacked my kid when I last saw her. If you have to smack a child to get your point across, you're a shit person.",
   "created_utc": 1690969021,
   "score": 64,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugo30v",
   "message": "yes, smacked around.  never used that I my kids or anyone else.  I found it ineffective.  Previous punishments never came to mind when I was about to do the next similar thing.",
   "created_utc": 1690970457,
   "score": 33,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juh8e88",
   "message": "I was spanked and I didn't really learn to be a better person after. I would even get spanked for accidents like spilling a drink. It's probably why I'm a perfectionist now and why I'm scared to make a mistake or I keep quiet about mistakes I've made.",
   "created_utc": 1690982142,
   "score": 14,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhknfy",
   "message": "I was smacked exactly once as a kid.  I was 9 years old, it was the late 80's, and I called a very clearly gay man a really nasty homophobic slur I had just learned because he bought the last donut of the kind I wanted at Dunkin Donuts.\n\nMy mom cracked me one in the mouth, I learned my lesson, and in retrospect, I'm perfectly fine with it.",
   "created_utc": 1690987260,
   "score": 30,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhf4mq",
   "message": "I was spanked as a kid, and refuse to spank my own kids. “Hitting someone into submission” is not a lesson I want to model. It’s tied up with anger issues, and “physical-violence-as-the-solution” is not what I want to equip them with. They’ll just end up emotionally stunted and physically afraid of me.",
   "created_utc": 1690985050,
   "score": 12,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juh46ri",
   "message": "Yes. Smacked. Spanked. Switch used.\n\nHate it. That form of punishment is an acknowledgment that the abuser lacks the needed communication skills to effectively stop unwanted behavior. I am not for the better because I got the wooden spoon.",
   "created_utc": 1690980185,
   "score": 28,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juh5jso",
   "message": "Yes, on occasion.  I don’t think my parents were wrong, but i choose not to spank or use any physical discipline for my child.",
   "created_utc": 1690980832,
   "score": 25,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugjg2d",
   "message": "My Mom only ever did it if me or my brother were doing something where we might've seriously hurt or killed ourselves.\n\nThe only time I remember her doing it was when I had tried to stick something in a wall socket.",
   "created_utc": 1690966830,
   "score": 12,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juho4rt",
   "message": "I was spanked as a child, now whenever somebody gets angry, or we are in a disagreement, I feel like they’re going to assault me. Just the thought of a heated debate getting physical fills me with anxiety and fear.",
   "created_utc": 1690988620,
   "score": 16,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugoqqn",
   "message": "Not fine, fuck my parents and fuck those who endorse that shit.",
   "created_utc": 1690970950,
   "score": 64,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juh9o8k",
   "message": "Shit. I even got the paddle twice by the principle in elementary school. It was the 60's. It would be 3 times in one day cause you'd get home, and mom would smack you around. Then a spanking by dad when he got home.it was torture. I never spanked my kids. I hated it.",
   "created_utc": 1690982709,
   "score": 11,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugju8w",
   "message": "My father was excessive. As a parent I see where it can be necessary at times but rarely. Usually only in times where safety is issue (A child running out in the middle of the street after explaining it to them failed to work) or maybe tremendous disrespect. Your job as a parent is to keep them alive and prepare them for the future world they will enter.",
   "created_utc": 1690967129,
   "score": 20,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugormy",
   "message": "My parents used corporal punishment sparingly. It was used to communicate severity rather than correct bad behaviour. Once things cooled down my parents would repeat 'don't do that' until I got it.\n\nThere is a well defined line between discipline and punishment. Frequent physical punishment usually makes the behaviour worse. Occasional use as a discipliary measure is fine.",
   "created_utc": 1690970968,
   "score": 115,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juh47kn",
   "message": "Got swatted/spanked, not smacked or straight up hit.\n\nTimeouts literally never worked for me. Complete introvert. I'll sit in silence for hours without it bothering me, and could as a child. Thinking about it this is probably why I weathered the lockdown/pandemic without even remotely losing my shit about \"needing to get out\" like so many.\n\nPhysical punishment at least carried the immediate threat of pain to my ass. It wasn't much better of a deterrent - I was(am) headstrong and mostly did what I wanted damn the consequences - but it was slightly more effective, I'll grant it that.\n\nI don't think my parents wanted to go down that route as they were both boomers and physical discipline they received growing up was way more violent/abusive. It was probably more a case of young me being a complete psycho that drove my parents to the breaking point to resort to it.\n\nWhat do I think about it now? I don't carry any baggage over it. I reckon there probably are some kids who you can't reach/change with soft punishments and a swat to the behind is occasionally called for.",
   "created_utc": 1690980196,
   "score": 51,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhayr5",
   "message": "I was spanked as a child. I think it shows strong correlations with bad outcomes in cognitive development in studies, and is therefore bad.\n\nI also think it creates, at least on some level, a relationship to one's parental figures of ongoing conflict, which cannot be sustained when the child gets older. This wad resolved in my mid teens when I threatened to kick my dad's ass and he decided he didn't want that kind of adverserial relationship with me. Things are a lot better with us now.\n\nI think that the idea that it creates an expectation that violence is the answer to some problems with based deeply in a pacifist ideology that almost no one actually believes in, and it is the weakest argument against corporal punishment. Some situations DO call for violence. Sometimes violence *is* acceptable. It's a question of when.\n\nI also think that the blanket statement that it is abuse, while it cam be logically justified, is a lot more squiggly in practice than in theory. Especially at the time I was growing up, a lot of parents thought this was what they had to do. They were adamantly taught that discipline was the primary method by which ones creates healthy children. This has proven untrue, but it wasn't outrageous to believe at the time.\n\nSuffice to say I don't resent my parents for it. They aclnowledge that it was a mistake.",
   "created_utc": 1690983281,
   "score": 5,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhtr5h",
   "message": "Yes. It's a terrible form of punishment that is ineffective and just produces long-term issues for the parent-child relationship.",
   "created_utc": 1690990757,
   "score": 4,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhf6sn",
   "message": "I was. I was told that I’d get it when I got older. Instead I got disgusted by it. I’ve seen little kids now. They are innocent and small and growing. How could you harm one?",
   "created_utc": 1690985075,
   "score": 12,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugqhwo",
   "message": "Yep, mom had a large wooden spoon for the deed. Guess what kind of relationship we have now? It seems that lots of people with no children have this fantasy to see other people beat their children.  It's never once crossed my mind that beating my child would be an effective way to get him to listen to me. It would, however, teach him to be sneaky, and that violence is an acceptable means of conflict resolution.",
   "created_utc": 1690972238,
   "score": 8,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juh8qll",
   "message": "Yes. Against.",
   "created_utc": 1690982298,
   "score": 8,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhcmna",
   "message": "Haha, who knew sitting in a chair could be such torment? Timeouts truly are a fresh hell for kids!",
   "created_utc": 1690984003,
   "score": 3,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jujd74s",
   "message": "Yup, I probably deserved it tbh.",
   "created_utc": 1691013719,
   "score": 8,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugqpo6",
   "message": "Yea I was.\n\nIt taught me there are consequences to my actions.\n\nIt also taught me that the worse the action, the worse the consequence.\n\nIf used sparingly and in proportion to the behavior it works, at least it did for us.\n\nHowever...if it is the answer to all of your problems as a parent, then you are just abusing your kid.\n\nMy opinion on it basically boils down to the kid screaming in the food store on that one episode of the boondocks.\n\nAll I really know is there are far too many people in the world who have never been hit, and when they finally annoy the wrong person and get laid out they learn about consequences then instead of when they were younger.",
   "created_utc": 1690972393,
   "score": 56,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugpbd3",
   "message": "I was hit with the “chancla” growing up in Mexico. \n\nI turned out fine. This might be controversial but it thought me that actions have consequences.",
   "created_utc": 1690971375,
   "score": 35,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhelua",
   "message": "Yes, but not severely or anything. I don't think it's a good idea though.",
   "created_utc": 1690984830,
   "score": 4,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugg5kh",
   "message": "Yes and I think it’s not as effective as people act . My brother and I both were hit. I see the negative effect of it mostly in him, he’s a coward. He fears saying the wrong thing or even expressing embarrassment because of the way our father shamed or hit us.\n\nHits were always the least effective. My biggest manifestation from childhood punishment is definitely via non physical punishment. I’m always a mess when my mother expresses disappointment in me or if she’s even mad at me.",
   "created_utc": 1690964206,
   "score": 7,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juho1i5",
   "message": "Yes. Terrible form of punishment that only teaches fear. I would lie and hide and do anything to avoid getting smacked.",
   "created_utc": 1690988585,
   "score": 7,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhbd5c",
   "message": "If by smacked you mean spanked, yes. I think it is a good form of punishment, but not always necessary. This depends greatly on the kid and what they’ve done. Some kids break down by just telling them no. Other kids won’t budge even if mommy spanks them, but when daddy does it finally sets in that they did a bad.",
   "created_utc": 1690983456,
   "score": 10,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugymlb",
   "message": "Yes. It wasn't terrible, just a spontaneous clip around the ear if I was cheeky. It was less than my parents got for their misdemeanours, but more than I would give to my kids. \n\nSmacking is clearly ineffective. My dad proudly said that his dad would give him a proper belt when he was a kid (and it \"didn't do him any harm\"), but he also says he was constantly doing things he shouldn't, and was forever being sent to the headmaster's office for one thing or another. \n\nYet he would think nothing of telling me how \"lucky\" I was that he didn't go for me like his dad went for him. He forgot to mention how he never really needed to. \n\nWhen my daughter was born, she was tiny and beautiful. I didn't \"decide\" I wasn't going to use corporal punishment - I just felt that I could never, ever do it. I'm so much bigger than her, and it would be just wrong. \n\nAfter all, the same parents who used corporal punishment were also the ones to tell you that you shouldn't pick on people smaller than you.",
   "created_utc": 1690977295,
   "score": 5,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhkcr8",
   "message": "Yes. Spanked as a kid which later turned into my Mom straight up slapping me across the face a couple of times as a teenager. It was extremely embarrassing and degrading even if no one else was around. As an adult I think it's extremely abusive and fucked up. Anyone who says \"My parents hit me and I'm fine!\" Needs to check themselves. Just because you've chosen to normalize abuse, doesn't mean it's okay or that \"you're fine.\"",
   "created_utc": 1690987144,
   "score": 6,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhmayu",
   "message": "If you’re too young to understand why you’re being spanked, why are they doing it?\n\nIf you’re old enough to understand why you’re being spanked, why do it?\n\nI would never spank my own kids if I had them.",
   "created_utc": 1690987908,
   "score": 5,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhrolu",
   "message": "Smacked and then some (well beyond beatings, to be honest). It didn't inspire better behavior, only underlying resentment, emotional issues, and recurring negative thoughts that still plague me into adulthood.\n\nHard \"no\" on it being used as any form of childhood discipline.",
   "created_utc": 1690989977,
   "score": 5,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugt1sm",
   "message": "I was given a couple of hidings as a child. I remember most of them. They were all deserved, and my parents talked with me about it afterward (mostly. Sometimes no talk was needed) - I always understood why it happened, even if in the moment and right after I was an angry little fucker because of it.\n\nI went to boarding school received corporal punishment there, too. That sucked and was borderline abuse. Halfway through highschool it became illegal and the teachers made the kids give each other hidings, which was so much worse. \n\nCorporal punishment from my parents - was good, they love me and did it for my best. In highschool - fuck that, fuck them.",
   "created_utc": 1690973976,
   "score": 5,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhbibg",
   "message": "Very very few times but it was pretty effective at showing me I was being an absolute shit at those moments. \n\nI grew up fine. The people that think what I went through is “child abuse” are idiots.",
   "created_utc": 1690983518,
   "score": 11,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugqmsg",
   "message": "Yes with the slipper. It taught me to lie well and think quickly on the spot to avoid punishments. Even now as a middle aged old woman, my first instinct is to lie my way out of situations and distance myself absolutely from the situation to avoid responsibility and punishment. \n\nI never punish my children for telling the truth as a consequence. I do not let them get away with things. I simply work through their mistakes with them and explain that if they purposely continue with the bad choices, consequences will be sought and I explain what those consequences will be and why I would choose that course of action.",
   "created_utc": 1690972335,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jugw5zh",
   "message": "It worked on me temporarily, but it was not “spanking” it was belt beating… \nIn long run it made me hate them and the house I lived in, already planing various revenges when i grow up- luckily i grew up being better human than them and never pulled the trigger on it. \nTo their defense I was fairly difficult kid to control.",
   "created_utc": 1690975904,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juh8sva",
   "message": "I got spanked quite a lot, and the worst was when my parents took a wooden spoon and wet it. The most infuriating thing is that my younger brother was never punished like that. I don't really want kids, but if I end up having them, I won't use physical punishment.",
   "created_utc": 1690982327,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jui8oyh",
   "message": " It just teaches you to be more sneaky and lie better.",
   "created_utc": 1690996299,
   "score": 3,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juifd3o",
   "message": "Both parents beat me\n\nIt does not work, I still do everything today that caused them to beat me the only difference is I don't call them on their birthdays",
   "created_utc": 1690998720,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juifso5",
   "message": "Yes, by several family members. I have a kid now, breaking the cycle of child abuse everyday.",
   "created_utc": 1690998871,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juigof0",
   "message": "Not just spanked, but punched, had my phone broken more than once, and even being cast out of my own home, and my opinion is, the moment I finish college and get my job, I am removing my parents from my birth certificate, changing my first and last name, and not letting them see me in their worst nightmares.",
   "created_utc": 1690999192,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juil2bw",
   "message": "Yes. I grew up afraid of my parents who really bought into the \"rod of discipline\" in the Bible. Thought this was normal.\n\nNow they wonder why I don't come around.\n\nI have kids now and wouldn't dream of hitting them.",
   "created_utc": 1691000789,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juizyxa",
   "message": "Coming from an Asian background. I’ve once been put into a push-up position and had the back of my legs beat with a bat. I would never dream of hitting my kids. I’d take their phones/electronics away.",
   "created_utc": 1691006176,
   "score": 3,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juj5udt",
   "message": "Yes. My own mother had a very true-to-the-time upbringing and it showed in the way she brought up / is bringing up her own children. She is a wonderful grandmother, not so great of a mom. My husband (who had a seriously abusive childhood) and I have promised each other that our baby girl will never experience anything like that. Looking back at it as an adult, I do not understand how a \"loving parent\" could ever lay their hands on their child.",
   "created_utc": 1691008297,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juj6ggb",
   "message": "Yes.  \n\n\nIt did not teach me respect, it taught me fear. Fear of violence, fear that anyone raising a hand to me came with pain, and was to be cowered away from, not fought. It taught me violence is somethig you cannot stop happening to you, so you never fight, even in defence. (outside of those occasions, there was no real anger in my household, not many raised voices, so it was literally an out-of-ontext problem)",
   "created_utc": 1691008525,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juj7vly",
   "message": "We were spanked with both the hand and a slotted wooden spoon. My sister broke all of the wooden spoons and hid them under the bed and nobody found them for a long time.\n\nI now have a 17 month old and could not imagine hitting or spanking her. The way she already gets scared when I use a serious No voice for her safety helps me see what would absolutely break my heart if it went any further.",
   "created_utc": 1691009053,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jujbyfk",
   "message": " I don’t think smacking is the answer. I don’t give a crap what your kids did, smacking isn’t going to accomplish really anything IMO.",
   "created_utc": 1691013206,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jujcz53",
   "message": "Yup lots of extremely hard spankings, sometimes with a wooden spoon. My opinion is why do some parents think that an already upset child (usually kids misbehave because a need is not met) should be smacked super hard to make them even more upset and make the situation worse with the child screaming and crying because now they're in pain? Stupid as fuck.",
   "created_utc": 1691013627,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jujd1nv",
   "message": "Yes, I was. More than smacked, proper ass-whoopings and borderline abuse.\n\nMy son is 15, his dad and I never hit him. He's a teen of course with teen attitude, but he's a very sweet, caring, well-behaved kid.",
   "created_utc": 1691013655,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jujddoj",
   "message": "We would get the belt. Bare ass if we were bad enough. Like the time I would tell my younger brother that the piss in the cup I just handed to him was apple juice while we were taking a bath together.",
   "created_utc": 1691013793,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jujeik4",
   "message": "Smacked or beat? I can‘t tell the difference anymore \n\nI was smack by hand, frying pan, rolling pin, tree branch, or whatever else was in their reach. I disapprove of hitting children. you can’t beat the wrong outta them. Some end up psychotic from that. If they end up like me, god help them.",
   "created_utc": 1691014257,
   "score": 3,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juk6fsr",
   "message": "Smacked, no. Spanked, yes, twice. It's extremely valuable and I feel parents who don't spank their kids are abusive and shouldn't have children. The anti-spanking crowd is exactly why spanking is necessary",
   "created_utc": 1691026175,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juk7gjx",
   "message": "I had the wooden spoon treatment, but it was always last resort and with plenty of warning given.  It also was only until I was about 5/6 years old, and spanking was treated as an embarrassment, like \"only little kids get spanked,\" and I was a big boy, dammit!  \n\nLooking back, it is a sure way to drive home cause and effect.  If you tell a kid that the stove is hot, they'll either listen to you, or touch the stove to find out what \"hot\" means.  I was the latter type of kid.  You do not want children to learn everything the hard way.  A spanking would hurt a lot less that finding out what happens when you play in traffic.  \n\nWhen a child gets spanked, they get snapped out of their world and all of a sudden pay attention.  This is when you drive the point home.  My parents did this every time.  It wasn't just a \"spank em and get it over with\" type deal.  They would spank, then make sure I understood why I got spanked.  \n\nFor sure, it's not an ideal punishment.  But the kids' have got to learn, and some kids just won't learn without real world consequences.  It's a stepping stone to really understand cause and effect.",
   "created_utc": 1691026623,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juk8zky",
   "message": "I was what you called over disciplined as a kid.\n\nI am not against spanking, but it needs to be reserved for behavior that warrants it, or as a last resort when communication doesn't work.",
   "created_utc": 1691027291,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jukj452",
   "message": "After reading most of these comments I think I’ll just be the odd one out. Both of my parents hit me. but my dad spanking me is what I was more scared of. For me personally I felt like it was effective. I wasn’t fearful of my dad himself but the fear of being spanked did keep me from doing anything I wasn’t supposed to. After he would spank me he would come to me later in the day to hug me, tell me he loves me and just reassured me that he only did it as a consequence to my actions. This is just my 2 cents but I don’t have any resentment towards my dad, I never feared him himself, I love him with all of my heart. The only thing I wish he did was do more father son things with me. Thats the only difference I would do with my son, give him the love and care after the fact and reassure that I don’t want to do it, it’s just the consequence of his actions so he could learn to do better.",
   "created_utc": 1691031929,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jukktvq",
   "message": "I was spanked, but it was VERY rarely, and I was sat down and told exactly why it was happening before I was spanked. And I was hugged afterwards and made to feel loved.\n\nSpanking was never the first resort. It only happened if I was being particularly disobedient, and only after being warned that it was coming. I can't remember it happening more than two, maybe three times.\n\nI have 4 kids, and I did the same with them. And I only had to spank each of them maybe once. Maybe. I have a great relationship with all of them.",
   "created_utc": 1691032791,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juha0uw",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jukvjl6",
   "message": "i got spanked if i didn’t listen. It worked. i always listen. My little siblings don’t get spanked. They *never* listen. \n\nspanking works. But only if it’s not out of anger and if it’s only one smack.",
   "created_utc": 1691038831,
   "score": 3,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juhjq52",
   "message": "My dad had a habit of smacking me extremely hard at the side of my head.  It left me with TBI as an adult so yeah, not a fan.",
   "created_utc": 1690986897,
   "score": 5,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jukujo9",
   "message": "Everybody in here literally quoting the exact same single piece of research like its gospel. Pure reddit.",
   "created_utc": 1691038211,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "jukuoal",
   "message": "I was smacked as a child. I strongly believed that was the only thing that worked on me, so I was ready to do it to my kids. The first time I smacked my 3-year-old on his diaper (not hard, just enough to get attention), after the look on his face, I decided that wasn't the was to go. Do I yell at them? Yes. \n\nThere have been occasions when I was so upset with what they did that I grabbed them too hard, like when they were running into traffic, or pushed them in frustration. But I tried very hard not to be violent and apologized profusely when I made a mistake. \n\nI have always had a temper, but even the kids tell me that I've improved over the years, especially after the pituitary tumor was removed. They are good kids and don't need much discipline, even without the threat of physical violence.",
   "created_utc": 1691038290,
   "score": 2,
   "submission_id": "15g2kkl"
  },
  {
   "comment_id": "juky42c",
   "message": "i was spanked but not smacked, and ngl i wouldn’t overdo it but i would do it if absolutely necessary",
   "created_utc": 1691040488,
   "score": 2,
   "submission_id": "15g2kkl"
  }
 ]
}