{
 "submission_id": "15g7vgx",
 "title": "What is your worst experience of catcalling?",
 "selftext": "",
 "created_utc": 1690979976,
 "permalink": "/r/AskReddit/comments/15g7vgx/what_is_your_worst_experience_of_catcalling/",
 "score": 51,
 "url": "https://www.reddit.com/r/AskReddit/comments/15g7vgx/what_is_your_worst_experience_of_catcalling/",
 "comments": [
  {
   "comment_id": "juhbu0z",
   "message": "I'm a man, I'm ugly and quite fat, I was never catcalled, but I once worked with a 50 years old guy and our job was to collect various stuff (furnitures and clothes ) in a big dirty van. \n\nOnce at the end of a big day both of us were in the van, wearing dirty working clothes, looking even worse than what we usually look like because it was the end of the day and we spent our day lifting stuff and loading the van. I was driving, my colleague was on the right seat, window open, smoking. \n\nWe stopped at a red light where a cute young woman was waiting to cross the street. There was nobody but us around. No other car, just our van and her. \n\nMy coworker looked at her, took a big puff on his cigarette, smiled, reached toward her with his hand as to tell her to come closer and said, roughly translated from french: \"Hey cutie, we just finished work, what do you say you hop in the van and me and my friend here show you what real men can do.\" \n\nShe took a step back and looked clearly scared... \n\nI felt like shit. So I did the only thing I thought was right, I smacked him in the back of the head and yelled at him to apologize to her. Then apologized myself for what he said. On the way back to the warehouse I lectured him about how she must have felt seeing two ugly men in a white van telling her to get closer. He kinda understood but still said \"no harm done, I wasn't going to do anything I was just playing around\" \n\nAs I was also the one \"in charge\", I notified our superior about his behaviour, who didn't care.",
   "created_utc": 1690983661,
   "score": 80,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhpnby",
   "message": "When I was younger me (male) I was very slim, wore my hair long and my pants were tight. I came out of a store one day and dropped my keys next to my car. As I bent over to pick them up, I heard \"Hey baby, nice ass!\" I stood up and gave him a full view of my bearded face. Dude just slunked away like the ass he was.",
   "created_utc": 1690989202,
   "score": 18,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juh4h3m",
   "message": "Was walking to a hospital appointment with my child, some guy sitting on a wall started with catcalling and telling me to come talk to him and attempted to throw a can of drink at me when i kept on walking.\n\nAnother was walking to pick up my child from school early because she was sick, had my earbuds in listening to a podcast, some guy that I passed turned around and started following me and screaming that I was a bitch for not talking to him.",
   "created_utc": 1690980326,
   "score": 36,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juh7z5l",
   "message": "My wife told me about a guy in a car who was following her as she walked. He’s gawking, trying to get her attention.  He ends up rear ending  a car at a stop sign",
   "created_utc": 1690981954,
   "score": 20,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juh4t4o",
   "message": "I was in 7th or 8th grade walking home. Guy is out on the street working on his car. He was definitely an adult but through my kid mind - he could have been anywhere from 25 to 45.\n\nI was in my school uniform. Obviously a minor. He whistled and called and told me I should come sit on his lap and hang out for awhile.\n\nI booked it home and changed my route home for awhile.",
   "created_utc": 1690980486,
   "score": 33,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhugth",
   "message": "8 guys, hanging outside the door to my apartment building, catcalling and harassing me for my number or to take their number, and having to get within 2 feet of them to get inside, and getting mean and almost threatening when I didn't respond. This happened last Saturday.",
   "created_utc": 1690991022,
   "score": 13,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juh6evf",
   "message": "Walking down the mall with my beautiful best friend at roughly around 16 years old and some douche whistles as he walks past and yells out “The one on the right” like yeah dickhead thanks for being a double douche.",
   "created_utc": 1690981235,
   "score": 13,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhx8wl",
   "message": "11 and playing outside with a lot of children (also younger, mostly girls). Grown man was on the other side of the fence talking to us and jerking off. Navigated everyone home safe as soon as I could. Ran to my parents, went to the police. They chased him but lost him unfortunately.  \n\nHappened a lot of times after that in different setting (car driving slowly where I walked) or guy biking and following me etc. But that one was def the most scary one.",
   "created_utc": 1690992058,
   "score": 11,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhb2vi",
   "message": "When I was 10 or 11 I don’t remember, a group of high schoolers catcalled me. I flipped them off.",
   "created_utc": 1690983331,
   "score": 10,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhtv30",
   "message": "When I was 18 a late 30s, 40s? Man followed me across campus for at least 4 blocks yelling about how he could treat me better than my boyfriend and he'd buy me diamonds etc. He belonged to a local immigrant population that was known in the area for being very misogynistic. There was an entire Starbucks that all the girls in my dorm avoided walking past because if the men who gathered there saw you with an uncovered head they assumed you were a prostitute.",
   "created_utc": 1690990798,
   "score": 10,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juh3vh1",
   "message": "Terrible because cats don't know how to answer phones",
   "created_utc": 1690980030,
   "score": 47,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhe0il",
   "message": "My BFF and I were walking through her neighborhood one evening and a guy yelled out \"I want to drink your bath water!\"",
   "created_utc": 1690984585,
   "score": 6,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhujqf",
   "message": "When I was 8, I was outside in the front of the house while my mom was in the garage. We lived on a dead end so if cars pull up, we know if they're from the block. So as I was sweeping up glass I saw a black 4 door old school looking bmw approach. The windows rolled down and it was 4 older men, dressed in black formal clothes kinda like Jehovah's witness. I was scared cus they started to whistle at me and kept smiling as they made a U turn on the dead end. Then one of them said \"pretty little girl you shouldn't be outside by yourself\". Thats when i ran back in the house. To this day i never told anyone cus i was embarrassed theyd say why i didnt say anything back then. I felt defenseless",
   "created_utc": 1690991052,
   "score": 6,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juh9b4s",
   "message": "I was like 8 years old wearing spongebob pajamas and walking down the street with my brother at night. Our mom told us we had to walk over to her friends house because she wasn’t coming to get us (idek bro) and this car drove by full of grown men who all hollered at me. My little heart was racing. I was like. A baby.",
   "created_utc": 1690982549,
   "score": 13,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juh4puz",
   "message": "My wife’s sister got catcalled when we were walking back from picking up food. She’s married. I’m married. Completely separate. But I could tell she was uncomfortable so I put my arm around her as a sign to say she’s protected. She leaned into it too to sell it. Was a little awkward to explain to our partners but in the end they were grateful.\n\nIt’s become a running gag now in the rare case we’re ever out together, and with the other sister as well, that we’re temporarily a couple\n\nYes, this applies to their husbands and my wife as well",
   "created_utc": 1690980443,
   "score": 16,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhuy9v",
   "message": "got catcalled once. i was getting money from an atm in barcelona, these two 50 year olds come up and start making weird comments implying i was a whore, they were also speaking french thinking i couldn’t understand and laughed at me the entire time.  \nwhat was i wearing? a long black skirt, a baggy black sweater and the worst offender of all! platform mules!",
   "created_utc": 1690991202,
   "score": 4,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhzlrl",
   "message": "I call and call my cats but they never come over to me.",
   "created_utc": 1690992935,
   "score": 5,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "jui2gzu",
   "message": "On my 13th birthday I stopped at a gas station with my family and ran in alone to get a drink. A crowd of men in their 50s followed me around and made sure I knew everything they wished they could do to me. I was a VERY 13-year-old-looking 13yo.",
   "created_utc": 1690993999,
   "score": 5,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "jui59sn",
   "message": "I was around 13/14, walking through a park to meet my mum in town. A man on a bike rode past and slapped my ass. I remember just standing still, then walking over to a bench and bursting into tears. Worst bit? Of the 5-10 people around, no one stopped to make sure i was ok. \nPut me off wearing skirts for years and made me extremely self conscious",
   "created_utc": 1690995036,
   "score": 5,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juh41zu",
   "message": "I saw a worker at a facility I was employed at take a header off the second floor of a building because he was leaning on a railing to catcall a secretary.\n\nNot gonna lie I found it satisfying.",
   "created_utc": 1690980119,
   "score": 8,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhbhge",
   "message": "High school.. (I was a socially awkward asf guy)\n\nThese group of \"cool girls\" would often catcall me as I walked across the street.. present day me would feel differently but back then it felt uncomfortable asf",
   "created_utc": 1690983508,
   "score": 8,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juh4qn1",
   "message": "\"Get your rat out!\"\n\nby Chavs yelling at girls walking between pubs on a night out!",
   "created_utc": 1690980453,
   "score": 4,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhzte6",
   "message": "I was a 13 year old young man and walking with my older sister when a guy working up on a roof yelled, “Hey sweetie, you got a great ass!” I keyed his pickup truck.",
   "created_utc": 1690993015,
   "score": 4,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "jui5i15",
   "message": "Stopped at lights saw a group of middle aged workmen yelling filth at two young teens on way to school. Fucking beeped my horn told them they were sick fuckers and I was reporting them to their company",
   "created_utc": 1690995118,
   "score": 5,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "jui7qzi",
   "message": "I was 13-years-old, walking to school.\n\nA car full of adult men yelled at me about my ass.\n\nI never walked to school again.",
   "created_utc": 1690995950,
   "score": 3,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "jui7t6j",
   "message": "I started getting catcalled when I was nine, and I remember a lot of those instances clearly. But the worst was when i was walking to meet a friend late at night, maybe 10 pm, and the area is usually very safe and busy. This night the streets happened to be quiet and the one car I saw started calling out to me from the window. I ignored him but the car followed me, the man continuing to make comments that were getting more and more aggressive. I tried to shake him by making turns onto different streets and turning 180% so he’s have to u turn. I called my friend and spoke loudly about what was happening, but that didn’t deter the man. I was scared. \n\nLuckily I turned onto a busy street and ducked into a convenience store.",
   "created_utc": 1690995972,
   "score": 3,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juh4oyx",
   "message": "My cat did not listen and continued to sleep.",
   "created_utc": 1690980431,
   "score": 9,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juh5mn7",
   "message": "Please upvote this thread guys. This is something I'm always trying to raise awareness towards. Most people have no idea [how young this starts.](https://www.reddit.com/r/AskWomenNoCensor/comments/12iuqj5/women_how_old_were_you_when_you_started_enduring/)",
   "created_utc": 1690980870,
   "score": 8,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhzs2l",
   "message": "I was at one time in extremely good shape, was mowing the lawn with my shirt off. Neighbors 12 year old daughter and friend catcalled as they went by. I acted like I couldn't hear them over the mower.\n\nTold my neighbor, he said she gets it from her mother.",
   "created_utc": 1690993001,
   "score": 2,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juia5ny",
   "message": "Horrified by this thread. Most of these stories are \"I was 8/I was in 4th grade\"\n\nJust how many nonces are there around?",
   "created_utc": 1690996835,
   "score": 2,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juin0nf",
   "message": "I called my cat, she bounded over too me, took a shit right by my feet, ran away, peed on a case of paper towels, then pretended she didn't even know me.  All in the space of 2 minutes.",
   "created_utc": 1691001497,
   "score": 2,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juipddn",
   "message": "Was walking alone towards a mall from my car and this guy I walk past starts catcalling me and following me, I accept some of his compliments to be polite but he starts to become real creepy REALLY quickly, like he gets really close and is following me into the mall, starts talking about how I'm so small it wouldn't take much for him to snatch me up and have his way with me, I got so fucking scared I went up to this big guy walking with what I assumed was a friend of his and pretended he was my boyfriend, thank God for this man cuz he turns to the creepy guy and shoves him away while his friend steps in front of me. That creepy guy runs off and it takes me a sec to recover lol, the two guys were VERY sweet and kind. They deserve the world.",
   "created_utc": 1691002354,
   "score": 2,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juh4i6o",
   "message": "I'm in high-school, walking home , just about the ugliest girl goes \"papi chulo\" and licks her lips.",
   "created_utc": 1690980341,
   "score": 4,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhxet0",
   "message": "Oh, jeez, it gets worse every night. Louder, longer, more repetitive and obnoxious. But you know what? I like it now. It means she's carrying around her favorite toy, a worn-out teddy bear that she moves around the house throughout the day. So, if I'm picking the worst experience, it would be the first time when it happened at night since I thought something was wrong with her.",
   "created_utc": 1690992118,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhyjmi",
   "message": "the cat didn't come back :(",
   "created_utc": 1690992540,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhs0kn",
   "message": "Walking through south Baltimore on my way to my bus stop, I was being solicited by a group of young men attempting to sell me a variety of pharmaceuticals, I.D., and female company. Despite my refusals and protests that did not in fact possess any funds, they did not believe me until I took out my empty wallet and turned out my pockets that contained only my apartment key and a few bus tokens. They let me go with a, \" maybe next time!\"",
   "created_utc": 1690990102,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhycnc",
   "message": "I was raised by a single mom that told me to never cat call women, but she cat called men all the time claiming they loved it. \n\nWhich leads me to being 18 just got my first car on the road. I'm feeling big, got a land yacht with a huge engine paint job was shit but I didn't see it. Got a cigar cruising the beach, see an ass that won't quit yell something about that shake and immediately feel bad. So at the light I make a U turn go past again yell an apology. Now I feel worse cause I felt like great so now she thinks I'm following her. Put the cigar out and slink off back home. \n\n\nThe second time I cat called a girl I was Sunday free Champagne brunch drunk. My friend and neighbor was giving me some shit on the walk home as we polished off stolen bottles of champagne. Claimed the waitress was into me and I never see when girls like me. Just not shooting my shots in general. So I see a pretty blonde in the distance on a cell. Yell out \"If you're looking for someone to call I'm already here\" my friend just drops laughing. I struggle to get her up and into her apartment, go upstairs to pass out and sleep off some the champagne. Her fiance wakes me up a few hours later says they have to show me something. Veronica mars. According too her I cat called Kristen Bell. Plausible they did shoot at a school across from us it was out of season but could have been reshoots. I dunno could have been a PA. But my friend swears to this day I hauled off and cat called an actress.",
   "created_utc": 1690992468,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhqxbf",
   "message": "I was yelling at this one girl telling her, at how sexy she was and how nice her body was. I wasn't watching where I was going and ran off the road. \n\nShe called our mom and I got chewed out. Our mom took the car and I couldn't drive for a month. My sister got the car instead because I was \"being a dumb ass and don't deserve to drive.\"",
   "created_utc": 1690989693,
   "score": 0,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhcnjq",
   "message": "When they don’t anymore😝",
   "created_utc": 1690984014,
   "score": 0,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhroi3",
   "message": "My ex's cat would always come running right up to me when I stopped by to pick up the kids or change her lightbulb or whatever but one day no matter how much I want psspsspss the little shit just ignored me the whole time.",
   "created_utc": 1690989976,
   "score": 255,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhszl1",
   "message": "My cat never comes when I call. She's an absolute asshole",
   "created_utc": 1690990470,
   "score": 255,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhpq50",
   "message": "Meow meow.",
   "created_utc": 1690989231,
   "score": 0,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juht28b",
   "message": "I'm a woman, and I've never experienced this irl.",
   "created_utc": 1690990498,
   "score": 0,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhuvzq",
   "message": "Cat called this girl and she was into it. \n\nWe went on a couple of dates and we clicked. \n\nWas together for about 4 years. It was great. Then she died of cancer. \n\nI will never regret cat calling her.",
   "created_utc": 1690991179,
   "score": 0,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juhm0ld",
   "message": "I don't know because I'm an average looking man",
   "created_utc": 1690987795,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "jui3t5j",
   "message": "I’m a dude and haven’t been outright catcalled before, but I was working one night and a girl who looked about my age at the time was ogling me while I rung her up. Then, as I handed her her receipt, she *bit her lip in full view of me*. I was already embarrassed but that made me even more flustered. I *really* didn’t want to do anything, I was at work after all. I just had to let it go. Then my coworkers started calling me “jiggalow”",
   "created_utc": 1690994497,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juia2d9",
   "message": "I was skating with my friends out in little Tokyo. Randomly 2 guys on electric scooters come by and asked us if we saw a phone anywhere and we said no we haven’t . One of the guys was a drag queen, broad shoulders , muscular wearing a dress. Before they left, the gay guy told me “nice shoulders” and winked at me while licking his lips and sped off. I couldn’t sleep that night.",
   "created_utc": 1690996802,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juiagxa",
   "message": "I've never had a bad experience with it. There's a woman at work that started catcalling me with that stereotypical double whistle thing. I started smiling and doing it back to her and will probably do it 15-20 times a day back and forth. It's my only experience with it really",
   "created_utc": 1690996949,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juiay5u",
   "message": "Disclaimer: I'm a dude\n\nThis isn't generally something I run into in public, but the comments I've received from old ladies in my grandmother's nursing home have been... interesting. Had my ass pinched a couple times there, too.\n\n\u0026amp;#x200B;\n\nSome people lose the part of their marbles that filters their brain+mouth at a certain age (others never seem to develop one)",
   "created_utc": 1690997122,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juiblta",
   "message": "Never had a bad catcalling experience, since I usually wear jeans that show off my legs and my hair is long, I usually get cat called when I squat to look for things when they see me from my back and only seeing who they assume to be a girl. The surprise when I stand up and look at them and they see my bearded face makes me laugh every time.",
   "created_utc": 1690997362,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juic4d2",
   "message": "High-school, personally feel like I'm below average at the time. Girl runs up takes a knee and proposes to me, me being socially awkward blank and freeze up. The gal says it's for a social experiment and I just blurt out sure then.\n\nNot exactly a bad thing but it didn't really feel good after finding out.",
   "created_utc": 1690997549,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juiduvc",
   "message": "I reacted to catcalling but I wasnt the one being cat called 😡🫣🫣🫣",
   "created_utc": 1690998178,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juiflfm",
   "message": "The bitch wouldn't even look at me! I called her \"sweetie\", \"honey\", all that shit. I followed her for like two blocks. Learn to take a compliment, sweetheart.",
   "created_utc": 1690998800,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juijvdb",
   "message": "I was 11 years old walking with my best friend to Wal-Mart and some guys driving by whistled at us and told us we were hot. We very much looked like little kids, just super creepy and baffling to me.",
   "created_utc": 1691000361,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juil4w2",
   "message": "I don’t have a car so I usually have to walk to the nearest plaza and then walk back if I wanna buy something. On my way back a guy said something like “hey mamas lemme holla at you” I completely ignored him not even a dirty look just kept walking, he got mad and said “you think you all that huh” and I didn’t want to deal with it so I just kept walking thinking I was completely alone. Turns out I wasn’t, to go back home I have to walk across a forest path next to a river and when I was already there is when I noticed he was behind me. I tried walking faster and he did the same I was completely terrified. The only thing I thought to do was FaceTime the first person I saw on my phone and lift my phone up to show that he was right there and try to talk “normally” as soon as he noticed he stopped and turned away but for a second I swore I was about to get raped or killed.",
   "created_utc": 1691000816,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juilqx0",
   "message": "Some chick asked if I had boxers on while I was walking,  I was really confused and the whole vibe was just awkward 😂",
   "created_utc": 1691001036,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juilrif",
   "message": "Sitting at red light next to a car with a group of young guys (honestly looked like teenagers), we both had our windows down and they called at me. I just smiled since I didn't hear what they said. Then they cut the car behind me off and followed me on the highway for quite a while before finally getting off at a random exit.",
   "created_utc": 1691001041,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juio07w",
   "message": "It wasn't me, but it was a good friend of mine. I got her permission to tell this story. One night she was walking down the street and she was catcalled by a group of men, she said no younger than 60. They then came up to her and started talking to her she started running and she said that it ended there, but I dont think it did. I dont wanna push so I'm not gonna ask but I have a feeling that wasn't the end.",
   "created_utc": 1691001856,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juionxi",
   "message": "I go to a high school, and there are specifically two groups of boys who do that to me. Call me names like “Mommy” “Sugar” it goes on. Some even bark at me or growl at me. Mind you the amount of maidens this lands them is zero. I get the worst of it I’ve seen because I am taller than most, and I have a larger chest than most girls I know (I hated it enough as it was until the harassment started happening) and they simply won’t stop. One time they tried to back me up into a corner, it was 5 against one. I screamed. Loudly. Caught attention of a lot of other students and I managed to run away. What would they have done if I didn’t. Though I was absolutely terrified of the attention it caused me I honestly think I saved myself from that. I was also called racist for rejecting one of them. I don’t see color of skin I see personality and his stank as bad as a garbage dump. Be careful out there all who read this (guys get catcalled too I wish that society saw it as wrong as if the genders were swapped)",
   "created_utc": 1691002096,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juip2n9",
   "message": "Outside of movies and TV shows I've never seen catcalling",
   "created_utc": 1691002245,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juipitr",
   "message": "One time I walked out of the train station towards university, I was around 22, and this scary guy kept following me closely. He kept whispering: hey girl.... hey... hey little princess... psss...psss... where are you going so fast?.. hey.. come with me little girl...\nI was so scared and nobody seemed to notice.  Eventually he stopped his pursuit as I kept ignoring him.",
   "created_utc": 1691002407,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juipxw5",
   "message": "I once called my cat over and he barfed in my lap. It was the worst.",
   "created_utc": 1691002560,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juiqmqe",
   "message": "Real men show respect, not their dirty van skills. 😂 Glad you stepped in!",
   "created_utc": 1691002809,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juir75l",
   "message": "Walking to elementary school with my friend and we would sometimes get adult men saying gross shit, but the worst was one guy who screamed out \"WHAT COLOR ARE YOUR PANTIES?\" from his car and followed us for a little bit. We were maybe nine or ten? It was the scariest one I remember. We didn't want to tell our parents it was happening, because we liked spending time together on the walk there and didn't want them to think we were babies.",
   "created_utc": 1691003014,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juirxfk",
   "message": "Got hit in an intersection. Pulled over to exchange info with the other driver. A carload of women pull up shortly after and proceed to shout flirtatious obscenities at both of us for the duration of the light they caught. Actually, I've had worse, but that was the strangest.",
   "created_utc": 1691003282,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juitja3",
   "message": "I was giving a coworker a ride home once and traffic was backed up. A car was broke down and the driver was waking up to cars asking for help. It was a young woman maybe 20 years old. She gets to my car and asks if we had a cellphone. It was the year 2000 before everyone had cellphones and before I could even say anything the coworker said “ all I got is hard dick and bubblegum and I’m all out of bubblegum “. She just kinda shook her head like WTF and walked to the next car.\n I also used to work with a guy that cat called woman I would say successfully sometimes.  I worked on power washing crew and we washed car lots. So we were all tan young guys. His typical cat call was “let me see your panties!” And he would yell this at woman at the car dealerships so they were probably receptionists in nice clothes but I would say about 10% of the time they would lift a skirt and show some panties. One time one of those ladies pulled her personal car up and asked us to give it a quick wash. We said sure no problem. Well she had taken her panties off and was playing with herself and took her boobies out for us too. We took our time washing that car.",
   "created_utc": 1691003877,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juixher",
   "message": "I was walking to my car in a parking garage on campus and as I was about to enter the garage, a guy on a bicycle started catcalling me. He even went around me to try to talk to me and continued catcalling. I got very nervous and tried to call anyone on my phone but nobody picked up. He did start making aggressive remarks which made me sprint up the stairs and almost run to my car. I locked the doors when I got inside as a precaution. It was very easy for him to go up the garage with the bicycle which scared me causing the running.",
   "created_utc": 1691005290,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juiy2hs",
   "message": "When I was 12 I probably weighted 70lbs and was probably 4 feet tall. I was walking to my local convenience store for candy. I had a small white car pull up behind me and started whistling and trying to get me to come closer. When I kept walking they drove past me and turned around. They did this probably 6 times. I ended up running and hiding in the store for 2 hours. \n\nI didn’t think I could call the cops just because I was scared.",
   "created_utc": 1691005502,
   "score": 1,
   "submission_id": "15g7vgx"
  },
  {
   "comment_id": "juj61oy",
   "message": "As a young lad I was catcalled by several older girls because I had to use my mothers ''Pick me I am Rich'' denim-bag.  \n\n\nI was 12 or 13 year old and it was the most embarrassing thing ever, however it did have the small benefit that I suddenly did not feel so worried about doing presentations anymore.",
   "created_utc": 1691008372,
   "score": 1,
   "submission_id": "15g7vgx"
  }
 ]
}