{
 "submission_id": "15gmkht",
 "title": "Redditors, that have killed someone, what happened?",
 "selftext": "",
 "created_utc": 1691016467,
 "permalink": "/r/AskReddit/comments/15gmkht/redditors_that_have_killed_someone_what_happened/",
 "score": 177,
 "url": "https://www.reddit.com/r/AskReddit/comments/15gmkht/redditors_that_have_killed_someone_what_happened/",
 "comments": [
  {
   "comment_id": "juk1sa0",
   "message": "My biggest regret is not going to the police when a classmate/friend of mine told me another one of our classmates offered him $10,000 to kill her husband. I didn't even ask him if he considered it. I basically assumed he didn't and said something like \"there's no fucking way you'll do something like that\" and he confirmed what I said then we changed the subject. A couple of weeks later when I saw her van on the news and saw the story was about an attempted carjacking that ended with one person dead I instantly became sick to my stomach. If I had taken that situation more seriously that man would still be alive today. They are both in prison. The killer (someone who I called a friend) got 25 to life and the wife got 26 to life.",
   "created_utc": 1691024161,
   "score": 92,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujupvu",
   "message": "Deployed and he was shooting at me.",
   "created_utc": 1691021062,
   "score": 215,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukcbq6",
   "message": "Was driving home from school. I was 18. Senior year. Was going through an intersection when a small car flew through the red light. I had an 87 Chevy suburban with a lift kit and cattle guard. She had a small Chevy cavalier. She died on the scene. She was 15 and had taken her dads car without permission. \n\nI don’t feel bad about it as it was not my fault and it took some counseling to finally get here. \n\nBut now I always do a quick left, right when going through any intersection. Didn’t help much when I was t-boned by an 18 wheeler last February who ran a red light in an ice storm and got away with it by simply denying it to 2 cops who didn’t wanna stand in the cold.",
   "created_utc": 1691028768,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujkb2o",
   "message": "Not directly but when I was 15 I took a lot of pills. A guy I went to school with was overdoing it. We were in the bathroom together 2 days before he passed. We got to talking, talked about the pills we were taking, I told him how much I was taking etc. I didn’t mention that I had a big tolerance. I just didn’t think to mention that. He died 2 days later. He was 15. I think about it alot and wish I could do it different.",
   "created_utc": 1691016642,
   "score": 10,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujy87b",
   "message": "Do “enemy combatants” count?",
   "created_utc": 1691022612,
   "score": 75,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk0x0t",
   "message": "Ask my lawyer",
   "created_utc": 1691023783,
   "score": 125,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujkfvs",
   "message": "They asked if anyone was a doctor, and I've always wanted to try, so why not? The guy was barely maimed. We're making a mountain out of a molehill.\n\nEDIT: People, please, stop giving me awards. This comment is crap. Don't waste money on reddit!\n\nEDIT #2: I've contributed to reddit's financial success. What have I done...",
   "created_utc": 1691016697,
   "score": 186,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujjx8z",
   "message": "Nice try fbi",
   "created_utc": 1691016483,
   "score": 244,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk1wuv",
   "message": "OP is Dexter Morgan.",
   "created_utc": 1691024216,
   "score": 114,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujjzfj",
   "message": "Homeless man broke into my house, had no choice. Warned him 3 times I had a gun and he still broke in.",
   "created_utc": 1691016509,
   "score": 216,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujko6s",
   "message": "I once roasted some dude online and people told me that I killed him. I felt bad but I don’t think it was my fault rly",
   "created_utc": 1691016791,
   "score": 18,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujmchq",
   "message": "Okay, who all wants to confess to murder?",
   "created_utc": 1691017490,
   "score": 190,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk8301",
   "message": "I've killed so many Sims that my PC is haunted.",
   "created_utc": 1691026897,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujw6tz",
   "message": "War",
   "created_utc": 1691021716,
   "score": 62,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk9fff",
   "message": "Iraq happened",
   "created_utc": 1691027484,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukbmfm",
   "message": "Not me, but my ex fiance's brother. At 18 he wanted to surprise his girlfriend with a surprise visit to her home in Detroit. He was/is an upper middle class white boy, btw. So long story short, as soon as he got off the bus he got jumped by three guys with knives. \n\nHe described it to me once but basically imagine Jason Bourne. No this kid wasn't trained, he just got lucky. He fought off all three gaining possession of a knife in the process. Apparently he beat the snot out of those guys. One got away, one woke up in the hospital, one never woke up. The cops ruled it a cut and dry case of self defense. \n\nAfter this encounter he was racked with night terrors. Therapy for years. The only thing that helped him sleep was the medication. He graduated college and proceeded to a life in the military. \n\nNot surprisingly, he did well in the military. He technically wasn't allowed to take the meds he was prescribed but his commanding officer was also the guy who was his mentor through his initial psychological trauma after the fight. \n\nThis all changed when he got accepted to sniper school. He placed first in an army shooting competition against 25,000 other applicants. He was beyond excited about this. I know this guy personally and I absolutely believe he could've excelled at the school and his career in the military would've been impressive to say the least. He left his base and transferred to the sniper academy. \n\nI know I'm glossing over a lot and that's because I know Jack shit about the military. Sorry. \n\nThe point is that at this school he wasn't allowed to take his meds. They/he thought he could handle it except one night he sleep walked out of a second story window. He was popular and everyone knew about his night terrors so there isn't anything like foul play here. He landed like a sleeping person on his right side breaking his wrists, jaw, and ankle among other bones and injuries. \n\nHis ankle ended up becoming fused from the heel to his shin, so his right ankle couldn't flex anymore. This effectively ended his entire military career. Before this he was a runner. Loved running. He told me once that he wished they could just cut his foot off so he could get a prosthetic that could let him run again. \n\nAfter he came home from the military he was lost for a time. His father was the head of psychiatry for a large group of hospitals so he wasn't without proper care on any front. Really amazing family. He ended up pursuing the police academy. \n\nAt the academy his foot presented a significant problem but the guy made it through. His running (hobbling, lol) times were the lowest passable grade but he did it.  Became a town cop last time I saw him. Good guy, raised a great family.",
   "created_utc": 1691028450,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk4sn6",
   "message": "Shot a man in Reno. You know, just to watch him die. \n\nI also killed a six pack or two. \n\nYeah, I know, Dottie. I’m a loner. A rebel.",
   "created_utc": 1691025466,
   "score": 119,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukbram",
   "message": "The person used a comma where it wasn't needed.",
   "created_utc": 1691028510,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujk9hw",
   "message": "He died.",
   "created_utc": 1691016624,
   "score": 44,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk9org",
   "message": "Was in 2nd battle of fallujah",
   "created_utc": 1691027595,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukbza1",
   "message": "I didn't forward that email in 2008. He ded. I cri every time",
   "created_utc": 1691028610,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk9op8",
   "message": "but srsly does muderin’ ass count??",
   "created_utc": 1691027595,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk4qrs",
   "message": "Had to kill a part of myself so I could keep living.",
   "created_utc": 1691025444,
   "score": 45,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk82iq",
   "message": "*sigh* lets read these comments",
   "created_utc": 1691026891,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukb2vs",
   "message": "I was kidnapped by the cartels as a kid and forced to work for them",
   "created_utc": 1691028207,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juke214",
   "message": "Not me but my friend. \n\nHe killed a man who was raping children/women, he walked in on it happening to his friends child. He beat him to death and did 20 years. \n\nIf you ask me, he did the world a favour.",
   "created_utc": 1691029555,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk91a5",
   "message": "Had a campfire birthday once, invited a friend of a friend (small town, ran into them at the supermarket kinda deal) mid party around the fire he dropped “yeah I stabbed my high school bully but it was self defense” and we kinda all just carried on with the night",
   "created_utc": 1691027311,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk4wkr",
   "message": "Nice try, FBI.",
   "created_utc": 1691025515,
   "score": 12,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juka5j7",
   "message": "Opened this thread and 6 vans parked outside. Send help",
   "created_utc": 1691027798,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukdmjc",
   "message": "Guy was dating my cousin (who at the time was like a sister). She was trying to get clean, and he started using H. I told him it was going to end with an OD or him getting clean so just get to it. \n\nHe decided on a fatal OD. Does that count?",
   "created_utc": 1691029360,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukdylp",
   "message": "I was 10, and I had taken to hanging out with an older kid in the neighborhood. \nThis kid convinced me to try weed one day, and when I was sitting there stoned, he pulled out this big hunting knife and looked at me with this menacing grimace and said \"you should run from me\". \nI was too scared to even move and blitzed out of my gourd. He got up, then I got up and I slowly backed away as he took these slow strides toward me, speeding up in the middle of each stride. Every time he moved like that my heart sank. I felt completely helpless and terrified. He lunged at me with the knife, and by some chance, he missed and managed to collide with me in such a way that he dropped the knife and fumbled perfectly past me. I made a break for the door which was locked. I fumbled to unlock the door as my hands just shook so tremendously. I heard him run up behind me right as I managed to open the door. \nHe placed his weight on the door and closed it. As he transitioned his weight to be placed with his shoulder, he dropped the knife again. \nI remember vividly feeling like I my arms were on fire and I got angry, most angry I've been in my whole llife. I went for the knife, and he pinned me against the  as I came back up, I bit his hand, and he  let go, and I just went ballistic after that. \nThe aftermath was a shitshow. We had to move out of the neighborhood, and I was kept in a mental health facility during the investigation. It took 8 MO ths to get me put of there once the authorities' investigation suggested I was a victim and defended myself. Turns out the other kid had been known for having some issues themselves. We wound up leaving the state after the kids' family continued to figure out where I lived and dropped by from time to time to make threats. I'm fine now.",
   "created_utc": 1691029512,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujy3rv",
   "message": "Well, this one time at band camp!",
   "created_utc": 1691022559,
   "score": 17,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujp5ud",
   "message": "Isn't anyone here military?",
   "created_utc": 1691018661,
   "score": 14,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk4u6z",
   "message": "well who's to say when life begins...",
   "created_utc": 1691025485,
   "score": 8,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukanf2",
   "message": "He said he was good at Smash so I challenged him and killed him 3 times",
   "created_utc": 1691028019,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukb5m8",
   "message": "I plead the 5th",
   "created_utc": 1691028241,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukcd0r",
   "message": "My buddy is a 39 years old HVAC tech with 20 years experience.  He currently has a 50 year old apprentice, who did time for manslaughter. Former gangbanger, pretty much kill or be killed situation.",
   "created_utc": 1691028784,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukcnos",
   "message": "Nice try, officer",
   "created_utc": 1691028919,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukde7b",
   "message": "Not today, FBI.",
   "created_utc": 1691029254,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukdwt6",
   "message": "I can’t tell you or I’d have to kill you. See? That’s how it gets started.",
   "created_utc": 1691029490,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukf4pw",
   "message": "Not me personally.. but a coworker of mine said he had gone to jail for murder after he found out a guy was molesting his son.. the guy beat him nearly to death and then went to the emergency room after to finish the job. Got sentenced to 5 or so years for a murder of passion. Did not regret it he said.",
   "created_utc": 1691030045,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukczu9",
   "message": "Well I’m in healthcare. I haven’t killed someone but the rate of death I face on the daily is just numbing that it has come to the point of me wondering if it really matters as much as the society thinks it is…",
   "created_utc": 1691029072,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk6llc",
   "message": "If I tell you I have to kill you",
   "created_utc": 1691026246,
   "score": 2,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk73pf",
   "message": "I am not presently at liberty to divulge this information, as it may compromise our agents in the field.",
   "created_utc": 1691026468,
   "score": 3,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukbyrw",
   "message": "OP is a federal agent",
   "created_utc": 1691028604,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukcy36",
   "message": "I don't like Mondays.",
   "created_utc": 1691029050,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk2sxv",
   "message": "Nope but I created a few worms.",
   "created_utc": 1691024599,
   "score": 2,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukacoh",
   "message": "I kill my children, they’re in the shower drain.",
   "created_utc": 1691027886,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukadot",
   "message": "I said his mama was so fat that the reason he was called Jr was because it was after the Jr bacon cheeseburger",
   "created_utc": 1691027899,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukb2ne",
   "message": "I wonder if there are actual killer in this Commet.",
   "created_utc": 1691028204,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukczvw",
   "message": "does killing spiders count?",
   "created_utc": 1691029073,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk98rk",
   "message": "I was in  a warzone. A car rolled up in the DMZ airport with 4 guys in it like boyz in the  hood or some shit. So anyway we started blasting and one by one we watched them fall they stood in the way of US and we smoked them all.",
   "created_utc": 1691027403,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujygac",
   "message": "They died",
   "created_utc": 1691022710,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk6oro",
   "message": "Nice try FBI",
   "created_utc": 1691026283,
   "score": 255,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukabna",
   "message": "My friends tried to give me a surprise bday, but when the lights turned on I just freaked out and unloaded my pistol, and also started flailing with my knife. It was not cool don't kill ppl. Learn to deal with surprises before they get you.",
   "created_utc": 1691027874,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk4o17",
   "message": "I swear it was self-defense. Oh wait. That was the other dream.",
   "created_utc": 1691025409,
   "score": 253,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukcqwq",
   "message": "Elon messaged me online and told me he would give me his entire fortune if I did it.  I never got the money.  I'll never understand why!",
   "created_utc": 1691028960,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juk1bbp",
   "message": "Well, according to some; abortion is murder.",
   "created_utc": 1691023955,
   "score": 230,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "juka75n",
   "message": "He said Griffith did nothing wrong",
   "created_utc": 1691027818,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukb4e5",
   "message": "He FAFO",
   "created_utc": 1691028226,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukbrle",
   "message": "Let's just say it was either me... or him. \n\n\nJk I'm too afraid to kill bugs",
   "created_utc": 1691028514,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukc1y6",
   "message": "I just murdered a chopped cheese, does that count?",
   "created_utc": 1691028643,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukdjnh",
   "message": "It has not happened, but if it did... if anyone kills or maims my kid, they are dead. They are laid down with my boot stomped inside their skull. I don't care if it was on accident. You're dead.",
   "created_utc": 1691029324,
   "score": 1,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujk6kg",
   "message": "Nice try, CSI.",
   "created_utc": 1691016591,
   "score": 252,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujz8rv",
   "message": "I kinda made friends with this random bloke on Discord. He was a nice lad but told me a little too often that he was depressed and had no friends etc. One day he said, \"All I do all day is listen to sad songs.\" I replied asking for an example of a song, (at this point already  thought that this 'depression' was fake). After he refused to give me a song I told him that if he's really depressed he should go kill himself. He never came online again. He was a very active user and from one day to the next he just NEVER sent another message. A few months later I re joined the server he was active on and asked what happened to him. They told me he killed himself but no one knew why.",
   "created_utc": 1691023054,
   "score": 213,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jujs6zj",
   "message": "Just an accident. The machine gun jammed and we were pinned down so I had to do some thinking, not like Sartre or Descarte, just threw a grenade into the mess and blew up a bus full of deaf kids. The military wanted to bury it all, but I can still see their burning hands signing for help when I close my eyes. That's pretty fucked up. I mean, that wasn't even proper sign language.  \n\nI'm kidding, I was never in the military.",
   "created_utc": 1691019951,
   "score": 189,
   "submission_id": "15gmkht"
  },
  {
   "comment_id": "jukd5aj",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15gmkht"
  }
 ]
}