{
 "submission_id": "15gpiuq",
 "title": "How did you (honestly) loose weight?",
 "selftext": "",
 "created_utc": 1691024122,
 "permalink": "/r/AskReddit/comments/15gpiuq/how_did_you_honestly_loose_weight/",
 "score": 223,
 "url": "https://www.reddit.com/r/AskReddit/comments/15gpiuq/how_did_you_honestly_loose_weight/",
 "comments": [
  {
   "comment_id": "juk4a5q",
   "message": "Strict portion control and lots of exercise are what got me from ~400 to 190",
   "created_utc": 1691025241,
   "score": 235,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk1vow",
   "message": "I could never lose weight by exercising. I had to cut calories. My simple method was try to eat 1/4 of what I would normally eat. Then, wait 10 minutes and if I'm still hungry eat another 1/4.",
   "created_utc": 1691024203,
   "score": 237,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juka6xq",
   "message": "I went from about 215 to 165lbs in about 30 days from pancreatitis. I absolutely would not recommend it, ever!",
   "created_utc": 1691027815,
   "score": 120,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk49se",
   "message": "I got myself a Fitbit and I started walking! I’ve lost almost 30 lbs.\n\nEDIT TO SAY THE MOST IMPORTANT PART: I’m 69!!",
   "created_utc": 1691025237,
   "score": 35,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk5m1i",
   "message": "I stopped eating after 6pm. I always found I have self control during the day for eating, at night I binge. So I stopped, I also take Metamucil now, one cup after 6pm some time- it fills up my tummy and makes nice poops- win win. Haha \nI’m down to 223 from 251.8, my goal is 175.",
   "created_utc": 1691025818,
   "score": 27,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk8z5v",
   "message": "Smaller portions (roughly half what I would normally eat) and an absurd amount of running, hiking, and CrossFit. 130 pounds in 11 months.",
   "created_utc": 1691027286,
   "score": 64,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukawye",
   "message": "This is terrible advice, but i did heroin for ten years. I looked like Jesus on the cross.",
   "created_utc": 1691028134,
   "score": 174,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk4hs3",
   "message": "Why is “lose” misspelled so frequently?",
   "created_utc": 1691025334,
   "score": 211,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk9d48",
   "message": "We have a family ranch. Sometimes I go far out to the back pasture, past the last fence. That's where I loose it. It's not going to scare anyone and no one is going frighten it or judge it harshly.\n\nTo see my weight running through the grass, leaping streams and chasing squirrels, is so soothing for my soul.  It just reminds you of why we should free our weight more often. It's meant to be loose and wild in this world. Not caged up in belts or girdles.",
   "created_utc": 1691027456,
   "score": 184,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukaqfj",
   "message": "Had the widow maker heart attack. Went through ten weeks cardiac rehab. Threw out processed food and mostly followed Mediterranean diet. Lost 30 lbs. Kept it off 2 years then started backsliding. Trying to restart good habits again.",
   "created_utc": 1691028056,
   "score": 75,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukcksv",
   "message": "I don't mean to flex on yall but my autoimmune disease did it for me 😎",
   "created_utc": 1691028883,
   "score": 35,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juklb2d",
   "message": "Swimming for 40 minutes every day is really a very effective way to lose weight.",
   "created_utc": 1691033037,
   "score": 39,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk7pqx",
   "message": "The boring way: Low carbs, healthy proteins, plenty of fruits and veggies and regular exercise. Sadly I’ve slipped a bit on will power lately, but this has definitely worked for me before.",
   "created_utc": 1691026735,
   "score": 33,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk1y1p",
   "message": "i got pneumonia and have lost 41 pounds and still losing the weight",
   "created_utc": 1691024231,
   "score": 61,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukbjo5",
   "message": "Keto and intermittent fasting.  You get toned in the gym but lose weight in the kitchen.",
   "created_utc": 1691028416,
   "score": 26,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukl93y",
   "message": "Stop eating white sugar. Its that simple for me.",
   "created_utc": 1691033008,
   "score": 20,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk2gsm",
   "message": "Daily one hour walks, skipping breakfast, and ordering smaller portions when eating out all worked out for me, but I was never dangerously overweight so idk if it’s this simple for obese folk",
   "created_utc": 1691024453,
   "score": 38,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukg1u3",
   "message": "Intermittent fasting. Only eating food during a four to six hour window each day. The other 18-20 hours are water only and sleeping. The window typically starts around 2pm or 4pm, depending on how long you want your window to be.",
   "created_utc": 1691030469,
   "score": 33,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk9rq9",
   "message": "Everyone is going to hate me. I started using Mounjaro two months ago and have lost 30lbs. 220 down to 190. I did not exercise at all. I just didn’t feel the need to eat a whole bunch of food. Now that I feel great, I have started an exercise routine that I hope to keep up. Diabetes does run in my family if that makes it slightly better.\n\nhttps://www.drugs.com/medical-answers/mounjaro-ozempic-compare-3571637/",
   "created_utc": 1691027632,
   "score": 40,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk1ue4",
   "message": "Well, past a certain point, it just makes itself loose.",
   "created_utc": 1691024187,
   "score": 25,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukewi5",
   "message": "If you drink - stop.",
   "created_utc": 1691029940,
   "score": 25,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juklbzc",
   "message": "It's 90% what you eat and 10% working out. Lifting weights is the easiest and most efficient way to burn calories and gain \"physique\" in general. If you're trying to do a specific sport, diet and exercise becomes much more nuanced.",
   "created_utc": 1691033050,
   "score": 25,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukaf5s",
   "message": "I lost 50lbs on weight watchers in 2019",
   "created_utc": 1691027917,
   "score": 10,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk2rtt",
   "message": "the gym and an abusive marriage",
   "created_utc": 1691024586,
   "score": 10,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukhvw4",
   "message": "I ate ~1500 calories a day, went for multiple walks a day, and went to the gym most days. I’m a 5’5” male and I got down to 152 at one point, but I wasn’t eating anywhere near enough. Now I eat a normal 3 meals a day and bike ride every day but I’m around 190 lbs currently…. So I guess the way my body is doesn’t allow for “slim” to be a thing in my life 🤷🏼‍♂️\n\nI’m trying to get back on a healthy diet regularly while eating enough to where I’m not starving. With the way I’m built it’s difficult to look fit from the waist up.",
   "created_utc": 1691031332,
   "score": 9,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk73ke",
   "message": "I went to the gym twice a week and never lost weight.\n\nMy wife joined a gym and they put her on a 8 week plan. And I followed along with her and I lost over 10 lbs.\n\nIt’s not just dieting, it’s making sure you stick to the diet for those 8 weeks and your body will drop the lbs.\n\nIt’s also not about starving. I actually had to eat more meals than I usually do. But portioned better.\n\nMeal 1 is portion (like size of your fist) protein, 1 portion carb, 1 portion fruit. A fruit can be a carb. But you need that portion right.\n\nMeal 2 is 1 portion protein, 2 portion carbs, veggie and salad. \n\nMeal 3 is a snack, like a protein bar. Or 20 grams of nuts + 2 portion fruits.\n\nMeal 4 is the same as Meal 2.\n\nIf you workout, you have to drink a protein shake after your workout.\n\nI simplified it and it’s based on weight. But 8 weeks. You’ll loose weight. It’s costly every week to stick to this, but worth it.",
   "created_utc": 1691026466,
   "score": 18,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk8wok",
   "message": "I'm stuck in an orthopedic rehab facility. The food is so incredibly bad I can't stand to eat much of it. I've lost 55 pounds. So far.",
   "created_utc": 1691027255,
   "score": 9,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukgplr",
   "message": "Subtraction by addition: Focus on adding foods that are healthy to what you’re already eating. It also helps you stay in an abundance mindset about food. You can eat whatever you want, but it needs to reflect what you *really, really want.* Start writing down what you eat, you won’t always need or want to do this and that’s ok. It’s a periodic tool to keep you honest. Also make friends with the spice aisle. \n\nExercise: Find movement you don’t hate and stick with it no matter how slow or small the time investment. I did exactly one down dog to up dog today, do I count it as my yoga for the day? Yes, yes I do, the same as the class I take on Monday nights. Hobbies can be exercise too (gardening, roller skating, wood/metal working, etc). It all counts. You don’t have to be a gym rat, as the slogan says, “just do it.” Look into functional fitness and functional movements. At the very least you want to be able to physically haul yourself up and out of most situations, ie. a fall. Start there and see what interests develop. \n\nMental health: Unpack the baggage. You’re doing this for you not your demons. You’re going to backslide. The key is you need to build your resiliency. The scale is not the only measure of success — and put those other metrics to use. Take measurements, track your mood, take note of how you feel and the fit of your clothes each day; those little things can be great reinforcements. Maybe the scale isn’t budging, but you’re feeling and sleeping well. That’s a win, and you need to keep rolling with it. Focus on tracking and improving your BP and cholesterol levels, too. This is a long game with no quick fixes (even surgery and medication require all this hard work and consideration). \n\nThe importance in the scale lies in the long game. You want to see a downward trend with normal peaks and valleys as you go through this journey. I once crabbed to my doctor that I was only losing ~6 pounds a year and she reminded me that it’s better to lose that 6 than gain it and to consider the cumulative affects. Most people gain the weight back within 5 years because they don’t unpack the emotional baggage around their bodies/food/exercise and they enact changes at an unsustainable rate. \n\nSource: I’ve lost 75 pounds in 10 years. I still have about 65-75 to go and I’ll be fine taking my time.",
   "created_utc": 1691030780,
   "score": 9,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukkofz",
   "message": "Intermittent fasting until noon eat a huge meal.. similar to chipotle bowl (no cheese)\nEat a light meal around 6pm..\nNot eat again until noon..\nI’ve lost 20 lbs since May\nI don’t exercise- just walking around my neighborhood.",
   "created_utc": 1691032714,
   "score": 8,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukl99b",
   "message": "Cocaine",
   "created_utc": 1691033010,
   "score": 7,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk88zb",
   "message": "Started working out, starting growing my own vegetables and fruits, making my own carbs. Most of my meat is now meat that I’ve hunted or fished for myself. Smaller portions, I try to not drink to much. Tons of water.",
   "created_utc": 1691026971,
   "score": 5,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juka0ap",
   "message": "When I was 14 I was pretty insecure about my body. Decided to start starving myself (I called it fasting at the time) I took a daily vitamin and weighed myself daily to see how fast I was losing weight \n\nSince I was pretty socially active I was always out so my Dad didn’t notice that I wasn’t eating (I also never slept at home) also because of this I was always walking around \n\nCombine the starvation with the constant walking around, always drinking whenever I could and puberty and there you go. I don’t remember my original weight but I know it got down to anorexic levels after 9 months\n\nEventually snapped out of it and started going to the gym with my buddy. 6 months in and I was ripped\n\nI eventually gained the weight back and now I have an unhealthy relationship with food and exercise once again",
   "created_utc": 1691027735,
   "score": 5,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukaqag",
   "message": "I had to start weighing my good and logging in my calories. I stayed under rhe amount that would mean I was burning more than taking in. I've lost almost 40 lbs in six months.",
   "created_utc": 1691028054,
   "score": 5,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukl5ul",
   "message": "Lost over 60lbs in 6ish months without counting calories by making a couple of changes:\n\nStarted going on 1.5-2mi walk every morning before work and every evening before showering/bed. \n\nThrew in a strength training when I felt like it, I'd like to get more consistent with this in the near future. \n\nLoosely did intermittent fasting. I'd eat a reasonably light lunch around 12:30-1pm (soup+salad, burrito bowl, grilled chicken sandwich) and try to have dinner somewhere shortly after work around 5:30-6:30. Ate pretty much whatever I wanted for dinner. \n\nI've still got some work to do - would like to really trim down some around my gut and etc. I'm sure I could do so if I went ahead and got serious about the strength training and was more strict about calories and macros.\n\nTl;dr: it really is as simple as moving more and eating a bit more consciously.",
   "created_utc": 1691032962,
   "score": 5,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukl8l9",
   "message": "Eat properly (portion control), eliminate alcohol, walk more.  40 lbs over 12 weeks",
   "created_utc": 1691033001,
   "score": 5,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juklcrs",
   "message": "I was 5' 10\" 225lbs, looked like I ate a basketball.\nI first tried keto, dropped 10 lbs in a matter of weeks. Stopped losing weight though. Then I started doing not keto, but still low carb dieting, had smaller portions when I did eat, and skipped meals(essentially fasting somedays). I dropped the rest of the weight, fast. In a few months I was at 155lbs.\nHad the bottom ab pooch, started fasting more and doing 100-300 pushups daily, and about 5 minutes of ab workouts. Ended up at 145.\nAfter I got told I looked sickly though, bulked up to 165ish, where I sit now, hit the gym and all that good jazz.\nSo for me. Low carbs, fast, small portions, and exercise. Be strict on yourself.",
   "created_utc": 1691033061,
   "score": 5,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juknqpl",
   "message": "Let me give it to you in the simplest terms ever:\nLift (heavy) weights (if you don’t know how, group fitness or YouTube videos at the gym are plenty fine). 3-6 days a week.\nWalk 7k steps a day or more.\nConsume .8-1.2 grams of protein per lb of bodyweight OR if you’re over 200lbs 25 grams of protein per meal or snack. \nA handful of veggies AT LEAST in two of your meals or snacks.\nSip on water all day.\n\nI fucking promise you will lose weight.",
   "created_utc": 1691034305,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukc0ph",
   "message": "Sit ups, walks, and water. I put an apple on the floor behind my back so that I can't rest on the ground. As soon as I feel the apple, I sit back up. I track how many by marking the number in groups of five on a single post-it, and the next day I do either the same amount or five more, but never less. The water... that just fills your stomach so you can't fill it with other nonsense. Walk when you are bored, even if you are just walking in place in front of the tv. Eat for fuel instead of pleasure.\n\nI lost almost 20lbs in July.",
   "created_utc": 1691028628,
   "score": 5,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukl2uy",
   "message": "Honestly, drinking lots of water (like, way more than you think you need), drinking a lot of black coffee (caffeine curbs hunger pangs for me, maybe it will for you?), lifting weights (nothing special, just master the big 3 lifts and work some cardio and supplement with whatever other exercises you find fun), and going through a bad breakup. To be frank the last factor was the most important. The best diet is divorce they say and they're absolutely right. \n\nAlso, count calories. Stop eating so much. Dont hit the drive thru. Learn to love eating oatmeal.",
   "created_utc": 1691032919,
   "score": 4,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juklap6",
   "message": "Paying attention to hunger cues, drinking lots of water during meals, exercise and balancing macros. I try to eat more meat and protein rich foods than I do carbs.",
   "created_utc": 1691033031,
   "score": 5,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juklct4",
   "message": "Calorie cut and ESPECIALLY cut out all breads and pastas save for lentil based ones. Most of my calories came from protien. This with weight lifting with a focus on getting stronger. Took a year but I lost over 55 lbs",
   "created_utc": 1691033062,
   "score": 4,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukldpn",
   "message": "If I’m being completely honest I know so many people relate but for a while (3-5 months) I basically starved and ate like 1 meal or less a day. But I’m doing good now and maintain my weight by exercising and eating healthy",
   "created_utc": 1691033074,
   "score": 4,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukamlz",
   "message": "It's simply calories in/calories out. Look at all the items you consume regularly. A lot of people don't realize a Coca Cola has the same calories as a cheese burger. If you drink 14 a week that's nearly two full days worth of meals.",
   "created_utc": 1691028010,
   "score": 19,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukaif9",
   "message": "Stopped drinking my calories. Black coffee took some getting used to, but cutting out Soda was alright.",
   "created_utc": 1691027958,
   "score": 3,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukjtna",
   "message": "Stress starved for two years from mental abuse and neglect from my ex. I'm anemic and have an eating disorder now, but on the road to recovery. Used to be 420lbs (190kgs) but I'm now down to 190lbs (86kgs) and maintaining.",
   "created_utc": 1691032278,
   "score": 3,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukkxn9",
   "message": "Keto, lost 40 pounds eating delicious shit!",
   "created_utc": 1691032844,
   "score": 3,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukldyo",
   "message": "Smart watch + tracking everything I consume in myfitnesspal.",
   "created_utc": 1691033078,
   "score": 3,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukns8t",
   "message": "Fasting, and removing carbs; avoiding insulin essentially\n\nExercise is mostly useful for building muscle and keeping injuries away",
   "created_utc": 1691034328,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk84q1",
   "message": "Becoming vegetarian",
   "created_utc": 1691026918,
   "score": 5,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukapgc",
   "message": "1000 Calorie daily diet. Ride a bicycle 40-80 miles per week. I went from 225 to under 180 in a 3 months. \n\nedit: I should add that this was in my mid 40s",
   "created_utc": 1691028044,
   "score": 5,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukl2mw",
   "message": "lost 40 pounds, 700 calories a day and gym everyday or more",
   "created_utc": 1691032916,
   "score": 4,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk4wn1",
   "message": "-I eat less, maybe once or twice a day.\n-I eat at home for the most part\n-I drink water (until I run out and then I start with the sugary drinks 😭). I have a 64 oz water bottle I take with me almost everywhere.\n-I do Martial Arts 2-3 times a week (But I haven't gone for a month cause I wasn't at home). I don't think it has helped me with my weight, but it keeps me active and I am a bit more flexible.\n-I have been trying to eat better.\n\n\nI don't count calories.. honestly I have tried that and it always stresses me out. I just don't eat as much and don't eat out as much as I used to.",
   "created_utc": 1691025515,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk94h5",
   "message": "I made better food choices and ate less. No fast food at all.",
   "created_utc": 1691027350,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk9fx3",
   "message": "Mental illness",
   "created_utc": 1691027490,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukaa5x",
   "message": "Stopped eating sugars then cut red meat to once a week. Walked my dog twice a day. Slowly but surely lost the weight.",
   "created_utc": 1691027856,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukafqd",
   "message": "I increase my steps from about 3 to 4,000 on average to a little over 10,000 on average per day and cut way back on my eating I believe the cutting way back on my eating is what caused the weight loss I've lost I don't know 35 40 lb in about 8 months",
   "created_utc": 1691027924,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukasxg",
   "message": "In hindsight, I probably developed anorexia although I didn’t acknowledge it at the time. That combined with increasingly intense aerobic exercise.",
   "created_utc": 1691028086,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukbsrc",
   "message": "I did a combo of intermittent fasting, calorie deficit, and excersing almost daily. Full discosure, I'm lean naturally, I just wanted to lose the weight I had gained\nduring a depression. I lost about 35lbs in maybe 5 or 6 months (180lbs \u0026gt; 145lbs)\n\nIntermittent fasting: I did 10:14 then later changed 8:16 when my body got more used to not eating all the time. Sticking to the fasting helped eliminate after dinner snacking and drinking which is where a lot of problems were in my diet. \n\nCalorie deficit: I was eating anywhere between 1300-1800 calories a day. I focused more on the weekly calories. That way if I splurged on a meal with friends it didn't make the day a \"fail\" day. I still had time to adjust my eating later in the week. \n\nExercise: I was working out for about 2-3hrs 4-6x a week. About 50% of that was cardio, 30% weights, 10% core, and 10% stretching.",
   "created_utc": 1691028528,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukhe40",
   "message": "I ate less, I moved more",
   "created_utc": 1691031098,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukhn6z",
   "message": "Optavia. 45 pounds. Have kept off 40 for 2 years.",
   "created_utc": 1691031217,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukit64",
   "message": "Learning patience, simplifying the process, accepting I am human and making adjustments and plans that work for me.\n\nFirst, I simplified - I went straight Calories out \u0026gt; Calories in\n\nSecond - What worked for me was not NOT eating certain foods.  Meaning I didn't say I \"can't' have certain things.  That didn't work and I don't believe it works really well for most as it is more of a punishment.   I gave up diets, and work outs etc. I truly believe they are not sustainable - if I can't figure out how to do this without a special diet/fad foods/exercise regiments then I am not going to succeed.  So I focused on lifestyle changes, self control, portion control and mitigation.\n\nInstead of living off Soda all day - I have 1, small one, at dinner.   I like it, I look forward to it.I stopped leaving snacks in arms reach (like at my desk).   I have a candy dish with loose sweets (Andes mints, peanut butter cups etc. - the mini stuff, not full bars).  If I have a sweet fix I take 1, literally 1.   It satisfies the craving and I don't binge on it.  They are also kept in a cupboard (or the fridge during summer) so they are not in easy reach - much easier to not give in.\n\nI keep my breakfasts consistent.  1 of 3 things, I know the calories of each and I start the day with a known.\n\nLunches are simple.  Sandwiches,  soups etc. with a proper portion of chips or what not.\n\nDinners I cook just enough for dinner OR enough for a planned left over dinner.   Then portion control.  Rather than anticipate how much to eat to be full, I do reasonable servings/portions.  If I am still hungry I can go back - but usually I do not need to.\n\nFor activity I do things around the house, yard work, house work etc.  When I go out anywhere I purposely park as far away from the doors as I can to make me walk more. (Unless it is raining).   I make sure I get up from my desk at least once and hour and walk around the house, go downstairs, go outside, something to move.\n\nIs every day a success - nope, and it won't be - but I have stopped beating myself up over it and forgive (not excuse, never excuse) the bad days and get back to it.\n\nSo far it has stuck - 125lbs down last check.   Will every day be perfect, nope, will I ebb and flow - up and down - yup, will I plateau and have to adjust - yup, but as long as the movement is net down I am happy.  Is it easy - it is now that I have been doing it for a while - sweet stuff tastes TOO sweet most of the time,  If I come close to eating like I used to I feel ill/heavy/sluggish and I don't really think about food like I used to.\n\nThat is me though.\n\nDo what works for you - if it is similar, great if it is something else also great.  No single person has the magic diet.     The only thing I will say is constant and a given is Cal Out should be greater than Cal In - you will lose weight.\n\nIf you are looking because you want to lose weight - you got this, whatever method you chose - you got this.   It is hard, but you go this.",
   "created_utc": 1691031783,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukjy9v",
   "message": "When I was 16 I went from 215 to 140 in less than 3  months when my brother passed.",
   "created_utc": 1691032344,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukkola",
   "message": "Stopped eating potatoes and chocolate and no sugary drinks and walked instead of taking the bus. Lost 25kgs and it stayed off",
   "created_utc": 1691032716,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukksxo",
   "message": "A combo of Wegovy, kettlebells, bike riding, gardening, raising animals and kids, stress, and keeping a strict calorie log. Down 48 pounds since January and boy do I feel better.",
   "created_utc": 1691032777,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukld9e",
   "message": "I really think not putting sugar in my coffee was a big help.",
   "created_utc": 1691033068,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juklew3",
   "message": "Honestly, there's been a couple of times when I've gotten pretty sick and lost anywhere from 20 to 30 pounds over the course of a few weeks. Then it took a long time to gain all of it back.\n\nWhen I've lost weight on purpose, it's been through intermittent fasting. I do recommend that. If you don't have conditions that interfere with it, it's something to work at and see if you can get used to it.",
   "created_utc": 1691033091,
   "score": 2,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukmxmq",
   "message": "Count calories and eat at a deficit",
   "created_utc": 1691033880,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juknura",
   "message": "Ate less (counted my calories) and that’s literally it. Like not even exercise or anything.",
   "created_utc": 1691034365,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukodxn",
   "message": "Need life changes, not diets.",
   "created_utc": 1691034651,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukoegf",
   "message": "Ate nothing but red meat and eggs to my heart’s content. Did it to improve emotional well-being, but I also lost ten pounds in the first week. Six months later, the weight is still off and my mind and skin are clearer than ever.",
   "created_utc": 1691034659,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukoels",
   "message": "*Lose",
   "created_utc": 1691034661,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukonal",
   "message": "Did Adrian Bryant’s workouts at home during covid. I picked one each day and got through it. I stopped eating between meals and if I got hungry outside of mealtime I’d drink green tea instead. Went from 67kg to 53kg:) I’m 23f",
   "created_utc": 1691034791,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukpf4r",
   "message": "Intermittent Fasting and limiting carbs (not keto).",
   "created_utc": 1691035217,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukpt80",
   "message": "Strict calorie counting. Would exercise 500 calories a day and then would net a -500 calorie count a day. Used a fitbit to monitor and used electrolysis to ensure my tdee  was accurate. Only way I could lose the weight I needed.",
   "created_utc": 1691035435,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukptrn",
   "message": "By walking",
   "created_utc": 1691035443,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukpyzr",
   "message": "My ADHD meds helped stop me from binge eating (for the most part)",
   "created_utc": 1691035522,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukqzki",
   "message": "I divorced him.",
   "created_utc": 1691036101,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "jukr33r",
   "message": "Lost 60lbs in 8 months\n\nWhen I go out to eat,  I always ask for half of it to be boxed up. \n\nI find a 30-45 minute podcast or playlist, put my workout clothes on, and just walk out of the house. I don't walk fast ever, just very leisurely. \n\nI plan a small trip or an event every few months, so I have a goal to work towards.\n\nWater .. but make it fun. Lately, I've been obsessed with the lemon lime liquid IV. \n\nWhen I go grocery shopping, I stick to the outer aisles of the store. That's where less processed food is. My go-to is a makeshift charcuterie board - pepperoni, grapes, diced cheese, and cinnamon pita chips\n\nDon't completely deprive yourself. It causes more damage long term.. to me, at least.\n\nAnd even though it's easier said than done, make fun a priority every day. Stress can lead you down a dangerous road. Do small, simple things that make you happy. My thing is a medium French fry from McDonald's every Friday night and watch wwe. I always look forward to it. \n\nGood luck!!",
   "created_utc": 1691036158,
   "score": 1,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk67sj",
   "message": "I lost 100 lbs by just keeping my carbs and calories low(like around 20 carbs and around 1500 calories daily)",
   "created_utc": 1691026077,
   "score": 3,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk21ky",
   "message": "I stopped eating meat, carbs, sugars, and dairy. Lost 80 lbs in 6 months. Never stepped foot into a gym.",
   "created_utc": 1691024273,
   "score": 5,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juk9m0j",
   "message": "I dropped 125 pounds from 335 to 210  over 14 months by intermittent fasting.  I didn't eat Monday, Wednesdays or Fridays.  Sometimes I'd add another day.  Now I don't eat a much those days, but I'm not actually fasting,  I think I will start again to lose another 20 pounds.  FYI 6 feet tall, moderately muscular for old guy",
   "created_utc": 1691027563,
   "score": 3,
   "submission_id": "15gpiuq"
  },
  {
   "comment_id": "juksycs",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15gpiuq"
  }
 ]
}