{
 "submission_id": "15grgxn",
 "title": "What was the final straw that made you end a friendship?",
 "selftext": "",
 "created_utc": 1691029507,
 "permalink": "/r/AskReddit/comments/15grgxn/what_was_the_final_straw_that_made_you_end_a/",
 "score": 22,
 "url": "https://www.reddit.com/r/AskReddit/comments/15grgxn/what_was_the_final_straw_that_made_you_end_a/",
 "comments": [
  {
   "comment_id": "juke3nh",
   "message": "When I text and got no texts back. Bye.",
   "created_utc": 1691029575,
   "score": 188,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukjpqr",
   "message": "When they \"Forgot\" to meet up with you for the third time even though you planned those meet ups days in advance.",
   "created_utc": 1691032224,
   "score": 55,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukhpaa",
   "message": "When he had everything going well for him in life and bought cool shit while I was living poorly, he'd rub it in my face. When I started being successful and finally made something for myself, he couldn't stand it.",
   "created_utc": 1691031243,
   "score": 184,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukeebs",
   "message": "He kept posting the most whiney posts on Facebook. Woe is me! Never trust women! He probably shouldn't have filmed himself blowing smoke into his toddlers face while drunk as a skunk yelling at the girlfriend. Now he sees his kid through child services visits.",
   "created_utc": 1691029712,
   "score": 50,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukgt1t",
   "message": "Him saying \"what have you done for me?\" in an unprompted call-out. He was holding food I bought him, with a bag with drawings i made for him. The friendship was completely one sided.\n\nWatch out for all-take-no-give people, guys.",
   "created_utc": 1691030824,
   "score": 87,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukfflb",
   "message": "I was friends with this girl in college. One semester we, my friend group, decide to be in a group for a semester long assignment. There were multiple parts to the assignment, one was going on a class trip, each person taking a section of a paper, and then the last was a display of some sort.\n\nOn the day we were compiling the display for class, this girl says she had a doctors appointment but she would hurry back. That would be fine because everyone didn't get out of classes to meet up until a certain time. She didn't show up because she went out on a date and then got her car washed. Which she posted on snapchat.\n\nShe showed up 20 minutes before the class started and our other friend who had been helping us, WHO DIDNT EVEN TAKE THE CLASS, had to give her the what-for because we were all so furious.\n\nIt was after that that I had looked back and realized it wasn't the first project she jeopardized, and she did some other shady shit like put another friend in a dangerous situation.\n\nAfter that I cut her out of my life completely.",
   "created_utc": 1691030180,
   "score": 155,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukkj98",
   "message": "She was unvaccinated and refused to take a covid test before seeing me. My mother was terminally ill and severely immuno-compromised, so I was absolutely trying to minimise the risk of getting covid so I could still see my Mum.\n\n\nShe refused to take a test, twice, despite kind and calm requests and explanations, on the basis that she \"didn't want to get a sinus infection.\" (This was in the time of nasal swabs, not mouth swabs, for covid tests. You know, those nasal swabs that are sterile and can't cause infection.)\n\n\nI'm 100% sure that it wasn't about a sinus infection. It was about control. She had been annoyed because I hadn't validated her anti-vax stance in the past.\n\n\nSimilarly, I know she wanted more validation for her religious views, which she'd acquired in her 30s and which I didn't share. I'd told her that I was happy her faith made her happy, but I think she wanted me to truly share her beliefs. I'd also said that her sister's bisexuality was \"fine with me\" when she'd stated that a wedding of 2 women was \"not what God wants.\"\n\n\nI think all of those different views just threatened the way she saw the world, and how she saw herself.\n\n\nHer last texts thanked me for \"sharing my views\" re covid and it's potential to kill my Mum, then became pseudo-concerned when I didn't reply. I read the whole situation as \"I want to say whatever I want to you, but I want to still feel like a nice person, so please reply and give me that validation.\"\n\nI didn't reply to her, but I still ask myself whether the mature thing to do would have been to clearly reply and state that I didn't want to stay in contact. It's taken me until now (over a year later) to see through the pain and formulate what I might have said.\n\nWe'd been friends since the first days of high school. 20+ years. In essence we just aquired very different views from each other as adults, but I can't pretend her attitude towards my Mum, and towards the horrible journey my family had to take, wasn't devastating.\n\nLife is a bloody painful journey at times, that's for sure.",
   "created_utc": 1691032640,
   "score": 20,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukfe4m",
   "message": "they screamed at me, and tried to emotinally manipulate me into calling them, when i literally couldn't because my microphone was packed for a trip i was going to the next day",
   "created_utc": 1691030162,
   "score": 24,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukid5u",
   "message": "They were always self centered and dominated the conversation but I rolled with it. But one day while traveling for work we had lunch with peers and they proceeded to brag incessantly about the car they drove, the luxury vacations they took and how well liked they were at work. \n\nThe car was an old Lexus, the luxury vacation was to New Orleans (they were from NOLA) and I was the only ‘friend’ they had at work because no one else could tolerate them. I was done after that.",
   "created_utc": 1691031565,
   "score": 129,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukildr",
   "message": "They were a “I can do to you, but you can’t do to me” person. They could talk about you all they wanted, but as soon as someone said something about them, they would blow up. \n\nThe final final straw was they tried to break two friends up so they made a group chat to try and get other friends on their side. We told the two friends about it and the two friend confronted the one friend. The one friend tried to pass blame on someone else but, the two friend knew the truth. We all eventually phased them out.",
   "created_utc": 1691031678,
   "score": 145,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukjyq3",
   "message": "Dude bought a new house a block from my job and I was over there after work every single day to help him paint or move stuff. Once he moved in I didn't hear from him for 6 months. When we did talk he claimed to not know the location of my work otherwise he'd visit. \n\nBut before this there were years of making plans knowing he wouldn't make it or already have other engagements.",
   "created_utc": 1691032350,
   "score": 85,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juklew5",
   "message": "I have friends that went so red pill it became a detriment to our friendship. It has the ability to completely change a person's personality.",
   "created_utc": 1691033091,
   "score": 101,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juklfdm",
   "message": "One of my friends from high school went full on \"traditional Christian\" as in thinking women should stay in their lane and let men run things. Started acting better than a number of us in our friend group, like he'd been enlightened after reading the Bible for a few weeks and discovering the truth, while trying to convert others into his new line of thinking. \n\nI had grown up with a narcissistic super religious father and had already decided to cut ties with him, so I was fully aware of the type and where he'd be heading. Tried to reason with him about it but he got pulled in too hard and had to let him go.\n\nI've had to let go several friends due to their romantic partners isolating them from their friend group (despite heavily trying to warn them about it), several who would not let go of exs, and some who just turned out to be general pieces of shit (cheaters, mostly men).\n\nHad one friend who had the nerve to actually delete my phone number and remove me off several socials, but still wanted me to come to her wedding. \nLike who does that?",
   "created_utc": 1691033099,
   "score": 41,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukljwo",
   "message": "Quitting drinking",
   "created_utc": 1691033165,
   "score": 7,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juklklk",
   "message": "He would constantly bitch about how broke he was, how terrible his life was, how much he wanted to kill himself because of those things but when I say hey maybe you wouldn't be broke if you actually bought groceries instead of eating out for every meal, maybe you'd save money by getting your THC in bulk jars direct from the manufacturer instead of buying a disposable vape at a shop every day, don't get high at work, you're going to get caught sleeping on the job and get fired...\n\nHe screamed at me and said I didn't understand and why was I giving him a hard time, blah blah blah. \n\nOkay. I dropped him. \n\nCalled him up a few months later because he owes me money (that I'll never see again) and guess what? Says he can't pay me back because he lost his job and his car's been repo'd. Shocked! I'm SHOCKED, I tell you! 🙄\n\nOh well, it was totally worth $180 to not have to listen to that whining anymore.",
   "created_utc": 1691033175,
   "score": 176,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukedw2",
   "message": "I was in a band with him and his brothers. We had a single ready for release and had all agreed on a release date; they then announced the single would be released on a different date. I assumed it was just a typo in the post, so I corrected it. Turns out they had an entirely different release date in mind and they berated me for “switching it” without telling them. At that point I was just done with them.\n\nMy friend had been one of my best friends for years, but it took me a while to realize how narcissistic he really was. I’m glad it’s over with now.",
   "created_utc": 1691029706,
   "score": 18,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukk4iv",
   "message": "When they stopped inviting me to go out with them after I lost a bunch of weight.",
   "created_utc": 1691032433,
   "score": 236,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukeb1s",
   "message": "Them choosing to be friends with someone I despised over staying mine.",
   "created_utc": 1691029670,
   "score": 36,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukhr11",
   "message": "Our group of friends from high school but after graduation would hang out on voice chat each night. Every night this one friend would just rage and rage whatever game he was playing. We'd usually play our own games but occasionally together.  He wanted to play hots, we were losing and he was raging at our team the whole time, eventually he just raged quit. I pretty much told him, every night I get home from work I just want to chill destress by gaming but all I get is an earful of negativity from you. So he stopped talking to me after that, few years later he apologies but we never reconnected.",
   "created_utc": 1691031267,
   "score": 15,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juki8zt",
   "message": "Not being invited to her wedding after being close friends for nearly four years. The other two people in our friend group were bridesmaids.",
   "created_utc": 1691031510,
   "score": 244,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukians",
   "message": "Misogynistic and homophobic statements",
   "created_utc": 1691031532,
   "score": 16,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukjivq",
   "message": "I knew them for a few months. They constantly tried to push my boundaries (i.e. wanting to know extremely personal info about me.) Their justification being that they were being a \"good friend\" to me. In other words, divulging personal info about myself was the repayment that they wanted. This was an online friend, BTW.",
   "created_utc": 1691032128,
   "score": 6,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukk23c",
   "message": "When they didn’t celebrate a big life moment of mine. Never once even mentioned it. Couldn’t even like a picture on the old Facebook or IG. After a year of just nothing I just booted her right out of my life.",
   "created_utc": 1691032398,
   "score": 13,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juklbnm",
   "message": "When I was 24 I discovered a good friend of mine had been having sex with minors for the past 3 years. I'm now 35, moved away, and the last I heard he was in prison for heroin possession, theft, arson, and 2 counts of felonious assault with a deadly weapon.",
   "created_utc": 1691033046,
   "score": 246,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juklkn1",
   "message": "She gave me shit for wanting to go back to school to complete my degree. She was lonely and she wanted me to move to her small town and rent the other half of the duplex she and her husband owned.",
   "created_utc": 1691033176,
   "score": 102,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juklwj7",
   "message": "When I text and got no texts back. Bye.",
   "created_utc": 1691033347,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukmxcv",
   "message": "Asking for a tiny ammount of vital help after I've been a life changing source of support to them, and not getting it.  \nLol don't do this to people, it's not forgiven or forgotten, ever.",
   "created_utc": 1691033876,
   "score": 50,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukmzzc",
   "message": "Being told God was more important than our friendship of 12 years when I came out to him.",
   "created_utc": 1691033914,
   "score": 13,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukn54n",
   "message": "He thought Jan 6 wasn't treason, didn't see the problem, blamed the media.\n\nThis guy took an oath to defend the Constitution. I take that oath serious enough I don't want to associate with those who excuse treason. \n\nHe was also a habitual liar, and that was already bothering me.",
   "created_utc": 1691033989,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukq2q7",
   "message": "When I reach out to get together for lunch to catch up. and they say they’ll check their calendar and get back to me. And then they don’t get back to me.",
   "created_utc": 1691035581,
   "score": 65,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukqvfi",
   "message": "This guy was my best friend during the whole of highschool. We drifted a bit apart due to different career choices but kept in touch sporadically.  A few years ago, decided to delete and block me from FB because of a political disagreement. I thought we were above such pettiness, because we'd known each other from way back. So when I realized that he'd done that, I also deleted and blocked him from everywhere. Blocked his number and deleted his contact info from my phone and everything, because f* him for political bigotry.",
   "created_utc": 1691036034,
   "score": 255,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juke2b0",
   "message": "Gaslighting",
   "created_utc": 1691029558,
   "score": 17,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukey4p",
   "message": "He went full conspiracy theory “Robert F. Kennedy is a very smart man” level shit. But his delusions of grandeur and narcissism had been wearing me thin for a long time.",
   "created_utc": 1691029961,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukeck0",
   "message": "Straws are for suckers",
   "created_utc": 1691029690,
   "score": 0,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukitmb",
   "message": "He assaulted my partner at the time. Other friends sided with him and I lost a whole friend group because of it.",
   "created_utc": 1691031789,
   "score": 18,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juke7vo",
   "message": "When they start talkin shit behind my back.",
   "created_utc": 1691029629,
   "score": 10,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukgk8u",
   "message": "Dude was requiring us to spend time with him every night and do a \"podcast\" on discord. At that time three of the six of us had a girlfriend, two were busy with school so they didn't really join in, and him. Dude flipped out about us not spending more time with him, like bro we get that we're your friends but we have lives too plus we busy dealing with school and stuff. Eventually we cutted him off our circle, dude's still friendless as far as I know",
   "created_utc": 1691030710,
   "score": 14,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukh57l",
   "message": "Tried to manipulate my other friend into doing what she wanted.",
   "created_utc": 1691030983,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukh86m",
   "message": "We were sharing a milkshake and he took the only straw left.",
   "created_utc": 1691031021,
   "score": 12,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juki56w",
   "message": "she ruined my birthday",
   "created_utc": 1691031459,
   "score": 12,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukkihw",
   "message": "she ruined my 21 birthday, before that she would only come to me for advice or a shoulder to cry on but when i needed it she would redirect the conversation right back to herself and so much more that she would do but the last straw was my birthday.\n\ni went all the way to her city bc she lives in the big city and we would celebrate my birthday. so i was gonna stay for two days, we were supposed to go to a restaurant but she had invited some of her own friends to join us. but we never went to a restaurant now did we? no ofc not. she took me to a fkn club. i don’t drink, i told her specifically that i didn’t wanna drink and when i realized it was a club i was so mad that i told her i didn’t want to be there and her other friends would jump in and make me uncomfortable to even have that conversation with her so i just shut up. the next day i told her that was fkdup and she apologized.\n\nshe did the same thing that night. i went to her apartment by myself and left her at the club. i am really uncomfortable at clubs i just don’t enjoy it. she knew that. but did this anyway. \n\nit was long overdue to end the friendship, she had been such a negative and toxic impact on my life anyway for years. we haven’t been friends for a year and it only took me a week to feel such a relief and the weights on my shoulders just went away. i didn’t realize how badly she was affecting my own mental health that it felt like paradise only a week after.",
   "created_utc": 1691032629,
   "score": 42,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukl1ow",
   "message": "When I got shouted at for not being in school for one month out of a whole year when she weren’t in for 3 months straight",
   "created_utc": 1691032902,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukm9ji",
   "message": "I've lost a few friends because they didn't respect my boundaries. I'm an easy dude to get along with, but just like everyone I have some quirks. One of which is that I avoid my birthday, I just don't want the attention, so I don't tell people when it is. They ask, I tell them that I don't appreciate the extra attention and to please not ask again.\n\nInevitably they find out, and for some stupid reason they can't not do anything. Welp, if you aren't going to respect that one simple request, then I guess I'm just not going to talk to you at all anymore.",
   "created_utc": 1691033535,
   "score": 10,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukn0ts",
   "message": "Working and going to school fulltime with barely 2-4 hours of sleep each night, rarely even at home, and could barely get enough time to talk to my own husband but she expected me to text her novels and novels of text messages everyday and calling me a bad friend for not texting back quick enough. I explained it to her and apologized profusely, but still got regularly berated in long paragraphs. That was not a good time. That was just the last straw. \n\nShe’s also inherently a selfish and very bossy person. And in recent years came out as a raging racist and homophobe (I’m bi) backed by her new found religion. The lack of human compassion got me in the end, but I was blind to it all along. It took me years to finally open my eyes and just say enough.",
   "created_utc": 1691033927,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukneln",
   "message": "I was supposed to be okay with not being paid back because they have kids",
   "created_utc": 1691034126,
   "score": 27,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukngxe",
   "message": "This just happened to me this week. I realized she only wanted me around to have someone to complain to and go places with her because she hates being alone. We had been friends nearly 3 years but the friendship started to sour back in January when she got back with her alcoholic cheating husband. Slowly I started to realize she didn't care about my interests or how I was doing and that we only ever did things she wanted to do. In fact, a lot of things I like she said she didn't understand and they were dumb to her (fair enough I guess?). My last straw though was her telling me that being called dramatic is bad for her mental health. I called her dramatic because she was being dramatic over a lice situation at work (we work in healthcare, it's not uncommon to get an outbreak of lice every once in a while). Our boss told her if she was going to freak out every time she's definitely not in the right profession. She ended up quitting the very next morning through text. \n\n\u0026amp;#x200B;\n\nWell, I had decided to quietly go no contact with her and removed her from all socials. Two days later she realizes this and starts spreading rumors to my coworkers that I was planning to quit with her and that I blocked her on everything. I'm just done with her. If she can talk shit behind my back that easily over me just not talking to her, what else has she said about me? That is not the kind of friendship I want. \n\n\u0026amp;#x200B;\n\nSorry for the long rant.",
   "created_utc": 1691034160,
   "score": 7,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juknljs",
   "message": "When I answered his texts. He answered back maybe 10%. Or I’d answer and nothing. \n\nI got pissed so I said something and got a song snd dance. Oh! And everyone knows he’s busy. But I expect too much. \n\nI wrote an email over that one. I did try to make a reasonable case for why I was pissed. Lol. Of course I never heard back.",
   "created_utc": 1691034228,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juknwd3",
   "message": "Probably when she was jealous that my boyfriend picked me over her (they had never even spoke she saw him once and said he was hot) and then went around to all of our mutual friends calling me a man stealing whore. So yeah we were done at that point. \nAnyway I ended up marrying the guy and sent her a save the date but no invite. 🤭",
   "created_utc": 1691034389,
   "score": 25,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juknytl",
   "message": "Was really good friends with this chick for 13 years. She started getting serious with her current boy friend like 3 years ago. She had a stroke and I went to see her. I texted her a week or so after, she never responded. I texted her merry Christmas a few weeks later, she never responded. A few weeks later, I wished her a happy birthday.  She again didn't respond.  I figured she was just going through her typical relationship, where she drops off the face of the earth for a bit and so I have her space.  A year goes by and again, I wish her a happy birthday via text... no response. I figured she just grew apart. Her sister texts me that July saying she doesn't know what happened between my friend and me but asked if I could reach out.  I explained what I've experienced then she stops responding. Two months ago my friend posted a rare snap chat and I messaged her saying I missed her and hope she's alright. She messaged me a few hours later telling me \"you stopped talking to me\". I have a text with time stamp and no reply. I was going to send it to her and try to defend myself but I figured it would just be drama. I've tried reaching out, she never did, but blames me. Frustrating, a little disappointing,  but just dumb. As good of and long of a friendship we had I would think I'd get a friendlier response",
   "created_utc": 1691034426,
   "score": 4,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juko2o3",
   "message": "She stole my weed pipe I hadn’t even used yet. Asked her about it after seeing her film herself do it on her Snapchat story, she denied it. Blocked her. Wasn’t a very smart cookie clearly, either that or she just didn’t give a shit.",
   "created_utc": 1691034483,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juko3t7",
   "message": "When I realized that people couldn't be bothered to take a minute or less to even say whats up. But let them need my vehicle, or mostly in my life, they need my muscle. Whether to move or handle business. If someone doesn't put effort in as much as I do, than I dont want or need them in my life.",
   "created_utc": 1691034501,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juko6y1",
   "message": "It got boring, so... Yeah ✂️",
   "created_utc": 1691034548,
   "score": 255,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukoox9",
   "message": "Went through a mentally rough time in school together, lived part of that time together, worked at the same company at desks close to each other, spent many lunches talking her off ledges and having deep conversations, and spent quite a bit of time at her house. I showed up when her stalker ex was waiting outside a school building for her once.\n\nShe got long covid. And has a history of shitty parents doing shitty things and illnesses she's only now getting to figuring out. I was there for all that too. I worried like crazy when she got covid. Her texts got more and more sparse. She told me she wasn't feeling like being sociable and that she likely wouldn't be hanging out anytime with any one. So I worried about that too. I knew she wouldn't show but I tried to help her invited to things and keep checking in. \n\nFound her going to events with a mutual friend on social media. \n\nI feel like a convenience friend. I was only ever there for her to dump her shit on basically. Sucks. She never came to our apartment. Then I got married, no congrats. Didn't come to see our house when we bought one, or meet our new puppy. It just makes me so upset that I put so much time and effort and care in and received basically nothing. If she didn't want to be friends, I'd rather she'd just told me.",
   "created_utc": 1691034815,
   "score": 11,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukp6sz",
   "message": "Best friend decided he was Tony Fucking Montana. I have kids - I don't need people around them that have an oz of coke on their person.",
   "created_utc": 1691035088,
   "score": 4,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukp98p",
   "message": "I just saw how manipulative they were, and how lowly I ranked on their friends tier. I’d rather be isolated than be somewhere I’m not appreciated or considered.",
   "created_utc": 1691035126,
   "score": 8,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpb3a",
   "message": "When he spiraled down so deep into his drug addiction that I could feel him pulling me down with him. Still won’t admit that he has a problem.",
   "created_utc": 1691035155,
   "score": 6,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpcoi",
   "message": "She tried to accuse me of SA. We were drinking and having a good time because we had not seen eachother in a long time. After a few drinks, I went upstairs into my\nRoom and went to bed after telling her she could take the spare bedroom. And that’s exactly where I stayed. I Was nowhere near drunk, mainly because I am not a fan of hard liquor despite having a high tolerance for it. \nThe next morning, she was getting ready to leave, hugged me goodbye and thanked me for hanging out. Later that day I received a barrage of texts from her accusing me of the SA. After reading the texts, I simply told her that if she truly believed I could do that to her that it’s best if we never spoke again. \nFor a little back story, this person might as well have been my older sister. We’ve known eachother since we were preteens. she’s been through hell and back. To boil\nIt down, let’s just say she’s the kind of person where you have to be careful with what you say and do otherwise you’ll send her into a ptsd attack. \nHowever, despite this she refused to seek out help, and would excuse poor behavior for her past. I loved her dearly I truly truly did, but I refuse to be around a person who only wants to play victim and expects the world to bend to their needs and wants. \nI don’t hate her, I only hope that she realizes what she’s doing isn’t healthy and is costing her people that actually care.",
   "created_utc": 1691035179,
   "score": 34,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpmmd",
   "message": "He abused his partner and her children, and used her major trauma from being tortured to keep her in line. I did everything I could for him, to take care of her, so she decided to skip the abusive middleman.  🤷🏼‍♂️",
   "created_utc": 1691035331,
   "score": 8,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpp5d",
   "message": "buddy from high school found out I got my GED and was moving out, and my dad was giving me money for a couple months until I got a stable job. he kept hounding me to pay him to manage my finances.",
   "created_utc": 1691035370,
   "score": 5,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpvuu",
   "message": "My friend who we shall call overgrown child, he always acted so entitled and always needed the attention of all of us when he slapped my other friend across his face we told him never to contact us again he threw a massive tantrum and broke his water bottle, a year later when he moved away, he stole something of another of my friends.",
   "created_utc": 1691035474,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpyl6",
   "message": "She sucked my boyfriends dick.",
   "created_utc": 1691035516,
   "score": 17,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpzjr",
   "message": "When they steal from you.",
   "created_utc": 1691035531,
   "score": 10,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukq0r3",
   "message": "When I realised I was never getting the money that they owed me back and that they didn’t care they owed it to me. \n\nByyeee!",
   "created_utc": 1691035550,
   "score": 5,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukqgv8",
   "message": "When I did all the work they took credit for it and not even one time bring it up I did all the fucking work",
   "created_utc": 1691035802,
   "score": 4,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukqogc",
   "message": "When I realized he and his wife prioritized their failing polycule over their kids’ happiness. The moment you neglect your kids around me, it’s over.",
   "created_utc": 1691035923,
   "score": 20,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukr4df",
   "message": "She was BPD in a toxic relationship and had 2 kids, one of whom was my own kids age. I allowed her and her kids to crash at my place a couple of times and I helped her navigate self filing custody paperwork. While she was anxiety inducing to be around, my kid was happy to have a friend and her constant panic didn’t bother me too terribly.\n\nUntil she started accusing me of sleeping with her husband and yelling at me for using quotation marks in a text message telling me I was criticizing her and how I was an awful person.",
   "created_utc": 1691036178,
   "score": 15,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukrhcm",
   "message": "too toxic and not good for my mental health.",
   "created_utc": 1691036388,
   "score": 7,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukrhu7",
   "message": "My friend of 11 years was upset and I was “hurting him” because I planned to start taking Testosterone and planned to get top surgery. His reasoning: “when we dated you sent me nudes. You were fine with your body then!”. Not to mention the rps we had of me fully transitioned and him sexualizing the hell outa it. \nI took a night away to gather my thoughts and told him our friendship was over. Months later he came back to apologize and say he’s better. I told him good luck on his new friendships. \nStill hurts to think about sometimes.",
   "created_utc": 1691036395,
   "score": 253,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukrqzu",
   "message": "They were never on time or would say they couldn’t make it minutes before the event starts like seeing a movie or hanging out. I have no tolerance for people who can’t be punctual.",
   "created_utc": 1691036540,
   "score": 4,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukrxxa",
   "message": "She was living with our other mutual friend and that friend's long term significant other (I'm talking like seven or eight years together). They were both unemployed and she would buy them food, weed and was taking care of all the household bills. Turns out they were sleeping together for at least year during this time. I just couldn't after that. There were things she'd done to me personally as well but this was my final straw.",
   "created_utc": 1691036652,
   "score": 5,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukrz6j",
   "message": "Something simple really.\n\nWe were at a restaurant and he said she is pretty cute for an asian chick.\n\nWas just the last straw in a string of casual racism over the years.",
   "created_utc": 1691036673,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukrz8p",
   "message": "Manipulation and gaslighting…..bye bye bitch",
   "created_utc": 1691036674,
   "score": 44,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juks5s4",
   "message": "Let me count the ways…\n\nHad a friend who was a liar and wanted to be me. One say she even copied and pasted my face onto a pic of herself. Anytime I had something going on, she miraculously had the exact same thing going on as well.\n\nHad a diff friend that was always negative, never anything positive going on, just miserable, like a dark cloud all the time. The last straw was when I had a miscarriage last year, suddenly she was mrs. positivity about how well her pregnancy was going, telling me how she was scared too but thankfully everything was going very well with hers, all while I’m still healing from my D\u0026amp;C.\n\nHad a *different* friend that again, wallowed in self pity. One of those that did terrible shit, would cry about it, and then go right back to doing it for attention. She’d call me crying all hours of the night over one thing or another, yet I couldn’t hold her attention for if I had a normal yet stressful day.\n\nHad a *different* friend who was not there for me whatsoever when I was SA, literally made the most inappropriate comment about it and then did not talk to me for the entire weekend after it happened, yet I tried my best to support her during her times in abusive relationships, helping her to press charges and get a restraining order with one of them. She ended up getting back with the guy and having 2 kids.\n\nLet’s just say I’ve been a giver to a lot of takers.",
   "created_utc": 1691036781,
   "score": 19,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukscjd",
   "message": "Seeing my old friend group constantly post photos to social media of them out doing things and having fun while I’m sitting at home \n\nI brushed it off at first. But after I made it clear when I was off a few times and still got no invites I just stopped contacting them",
   "created_utc": 1691036895,
   "score": 149,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juksnf6",
   "message": "When I asked about getting together on the weekend and they declined-they planned to be packing for a two day business trip. \n\nPacking. All day and evening. For two days. \n\nMessage received. Bye.",
   "created_utc": 1691037077,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juksp5d",
   "message": "I was in middle school and my neighbor who is a couple years younger than me, we were best friends for a few years, then I found out she was getting into some pretty bad stuff but from what I knew it was just a relationship with some stranger online and she told me she was stopping because she had realized how bad and dangerous it was. A week later I was texting her trying to make plans to have a sleepover and I wasn't getting any response which was very unlike her and a few hours later I get a text from her mom (on the friends phone) saying how my friend was grounded for a while and when I asked why all she said is \"I think you know\", I didn't know because her mom had already knew about the online boyfriend and had a talk with her about that weeks prior so I didn't know why this time. Turns out she was selling and trading people's nudes online",
   "created_utc": 1691037105,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukt0hy",
   "message": "The only thing they ever wanted to talk about was politics or religion. That's it. Nothing else.",
   "created_utc": 1691037290,
   "score": 12,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukuwf6",
   "message": "Sheesh there were so many things leading up to the end of my nearly 20 year friendship with one of my closest friends, but the very last thing she did was pick a fight with her husband on her birthday when we were all traveling together out of state... She'd been hassling him all day and I guess he got mad and left their bedroom to sleep on the living room couch (where my kid and I had been hanging out) and my only thought was \"Yeah I'm pretty fucking sick of her too.\" \n\nThat wouldn't have been the end of our whole friendship, but I had been feeling increasingly over the friendship, and the trip was the nail in the coffin. It's actually a long story and I think she'd be shocked that the reason I ended the friendship went deeper than her being an awful traveling partner - that was just the obvious unspoken excuse.",
   "created_utc": 1691038428,
   "score": 72,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukwttl",
   "message": "I had a child, and realized I didn’t want my baby exposed to that type of person.",
   "created_utc": 1691039651,
   "score": 33,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukt9d0",
   "message": "\"i just want you to be nice to me\"\n\"be nice? You are not a child\"\n\nDamn bro",
   "created_utc": 1691037434,
   "score": 7,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukxf5n",
   "message": "I was getting cyber bullied by someone in our friend group, remove him from the gc, and they kept telling me I should be friends with him again because he probably “learned his lesson.” Each time they added him back, it was worse. I cut all ties.",
   "created_utc": 1691040035,
   "score": 67,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukxopj",
   "message": "When I realized after more than ten years, I just plain didn’t like them.",
   "created_utc": 1691040205,
   "score": 101,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukz1a7",
   "message": "He would hit me in the face when he had everything going well in life and purchased cool stuff while I was suffering in poverty. He couldn't tolerate it when I began to succeed and eventually made something for myself.",
   "created_utc": 1691041092,
   "score": 18,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul0ptt",
   "message": "I ended 3 of them due to trumpism.",
   "created_utc": 1691042209,
   "score": 9,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukubie",
   "message": "My best friend for close to 15 years blocked me. When I got in touch with him I asked what was going on, and he said he was just purging his friends list. Said it was a mistake and unblocked me.\n\nWell I happened to be dealing with the loss of my father (who basically adopted him) and was struggling with alcohol abuse. I reached out to him just seeking a friend cause I was in such a low spot, then he blocked me again.\n\nI totally get cutting off friends who are alcoholics or toxic. But the only time I ever asked him for anything was \"Hey man, not sure if you heard but my dad died. I've been drinking too much and could use a friend to talk to.\"\n\nAnd he blocked me for that",
   "created_utc": 1691038070,
   "score": 34,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukycjw",
   "message": "One found Jesus.\n\nOne found a side piece.\n\nOne neglected her pets.",
   "created_utc": 1691040643,
   "score": 8,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukyk7g",
   "message": "She wouldn't stop sending me her tick tock videos. \nFirst I said sorry, I love you, but I don't support ti tock and won't watch it.\nSeveral links later I decided to just open one and it wouldn't open. So I told her I was unable to watch it.\nShe tried putting a cloud and sending that link. I again said. I can't open this, don't want to open this and I will not support tick tock and that I was sorry. Every single response of hers was a link. I'd ask, \"Hey just checking in hope all is well! How was ____ birthday party?!\" Response.....link. It was rude and I'm patient. But it rubbed me wrong.\nShe never asked me how I was doing. Never texted to say hi or tell me how she was. If I initiated a conversation, she'd just respond with a shit tock link of one of her videos. I'd ignore it and we'd go weeks without contact. She would finally text me, ask how things are, I'd say good, gove her any small updates and then ask her how she was. She'd respond with a link to her tick tock. I felt like she started baiting me. I'd told her once more... I don't like the content the platform provides, I don't trust the company, I don't like it. I won't get an account, I said I'm happy it makes you happy, but I won't get involved with that app. She denied it being owned by China and I told.her.to research it l. \nShe didn't text back. A week later she sent me two links to her videos.\n\nI'm still here, I'm not done with her, but until she stops, I'm taking a break.",
   "created_utc": 1691040781,
   "score": 5,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukz01h",
   "message": "I have plenty of friends I differ on politically, but when it gets to the point you are actively harming queer people that’s where I draw the line",
   "created_utc": 1691041070,
   "score": 247,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul2iue",
   "message": "I found out that he was gay. Sorry bud but where I come from we aren't for that fruity little gay boy shit. Hell naw",
   "created_utc": 1691043459,
   "score": 243,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukt4h1",
   "message": "I stopped texting first, few friends I talked to daily, I realized I always texted first, stopped doing it and that was the end of it. 1 of them would constantly say how she missed me when I was away at college, I was home for 2 months before I heard from her and she only texted to ask me to buy her hookah because she was too young and her sister was busy.",
   "created_utc": 1691037354,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukt4uo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukt7xh",
   "message": "Realizing you've known them for almost 20 years and you're sick and tired of unsolicited advice from someone who makes terrible life choices.",
   "created_utc": 1691037410,
   "score": 21,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juktd3y",
   "message": "Critical illness, close to death and in ICU for weeks; found out who my friends were.",
   "created_utc": 1691037494,
   "score": 58,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juktm2f",
   "message": "She was going through a rough time and I was nothing but compassionate and supportive. Then she broke my heart and acted like nothing happened. When I confronted her, she gaslit me. After 20ish years of friendship, that’s the thanks I get.",
   "created_utc": 1691037642,
   "score": 5,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juktrzz",
   "message": "i found his notebook full of some “symbols”\namongst other bad stuff",
   "created_utc": 1691037742,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juktyi0",
   "message": "Knew him since elementary school.  Always abrasive but, that was just him.  He went to Europe to go to college and met some really snooty Europeans and came back a horrible person.  Like he used to talk nonstop about debt and how he wanted to start a business and only hire people with debt so that he could mistreat them and they couldn't afford to quit.  Not joking.\n\nSo I tried my best to get him to come around, but he was so rude to grocery store clerks, etc. that it was almost a story that sounded made up for internet rage bait.  \n\nI was straight out of college at the time, and I accepted a night shift job.  I compromised my sleep and I'll tell you, the job did **not** pay well.  And he kept pressing me and pressing me to ask me how much I made.  I finally gave in, and he lorded it over me.\n\nSo one night before I punched in for the night shift, we went for coffee and he casually said something like, \"Yeah, anybody who gets out of bed for less than six figures is a sucker,\" knowing full well what I made.\n\nAfter about 20 years of friendship, I said I have to go, said goodbye, walked to my car and got in.  I turned the ignition and as the car was starting I said, this friendship is over.  And I never, ever looked back.\n\nAnd another friend guilt tripped me about it, said it was awkward that we're not all friends anymore.  This bad \"friend\" walked into another friend's butcher shop, used his friendship with another buddy working there, to run up a tab of several thousand dollars and then never paid.  \n\n\"Oh sorry that's business,\" was his reply.  \n\nI'll tell you, since cutting him out of my life I live much, much, much happier.  Had I never stopped being friends with him, I would have never grown so much as a person.",
   "created_utc": 1691037852,
   "score": 91,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juku3q6",
   "message": "They casually threatened me. Overall had a childlike temperament not too unlike my own. Though I decided if they could not admit fault in threatening, there’d be no point in keeping them around",
   "created_utc": 1691037940,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukunxo",
   "message": "We got in a fist fight",
   "created_utc": 1691038284,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukuw37",
   "message": "“they ran into traffic the day you *told them you’d take a break from them.”\n*their friend used the words “left them”. not true. blocked both of them immediately. fucking weirdos.",
   "created_utc": 1691038422,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukv3i1",
   "message": "Honestly I don't think I've had a final straw with anyone I just lose touch with people because of malaise and I've never really found that kind of connection with someone.",
   "created_utc": 1691038552,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukv3ws",
   "message": "We were housemates for years, but then I got into a relationship with my partner and he was noticing little behaviours of hers that were odd. We then had the opportunity to move away, but I couldn’t cut contact with her due to her having my cat. \n\nEventually we moved back home, and then some stuff came out that she was doing and I just had enough. Some of the stuff she did was\n\n- She manipulated my friendships with my other friends to either end my friendships with them or told me they were talking about me behind my back. \n\n- Made me financially dependent on her. (I had terrible mental health issues and she kind of just took over my life.) \n\n- Stole money from me and my brother (he lived with us) but said it was house bills. She ended up only paying £50 towards everything in the end. \n\n- I was in an online relationship for a few years, and it turned out she was catfishing me the entire time. When I moved away, she started doing it to other people and the truth came out. It was all truly fucked up and I couldn’t find any reason to stay friends with her. Extremely toxic.",
   "created_utc": 1691038559,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukv74f",
   "message": "Getting mad at me for not liking a post. Can't like it if I didn't see it. Everything was leading up to this and I just decided I needed to prioritize my well being over theirs.",
   "created_utc": 1691038614,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukvig0",
   "message": "When I had a tragedy in my family and she was not there for me in any way shape or form. That's when I realized that she was not really a friend I was her friend but she was not mines. It was like breaking up with your girlfriend or boyfriend. Till this day I still do not speak to her when she reached out four or five years later I shut that s*** down immediately if I never lay eyes on her again it'll be too soon",
   "created_utc": 1691038812,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukvjz6",
   "message": "She never was a loyal friend, very self centered. This was after she joined a legit religious cult. apologized to me and came back in my life for a moment only to peace out 6 months later. don’t got time for crazies anymore.",
   "created_utc": 1691038838,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukvr8o",
   "message": "The final straw was when the homeless unemployed alcoholic called me a piece of shit and an asshole in my own home, and then she kicked my cat (kitty moved in time, it ended up being a glancing blow on her butt, she wasn't hurt.)",
   "created_utc": 1691038968,
   "score": 18,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukwb87",
   "message": "When he turned into a toxic piece of shit after his gf dumped him. He would constantly throw shade at her, made sure she would see all the posts he would post about her. Then to add a cherry on top when I removed him from all my socials he came and harassed me because he didn’t think it was “serious”. And to make it even more interesting the MF has attempted to message me on different social medias with the excuse that I can “just Block him”. I did block him on everything and even had to change my number.",
   "created_utc": 1691039314,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukwiso",
   "message": "I had 3 friends from high school, met up with them again in our late 20s. One was doing well financially, married a well off dude and had 3 kids. She looked down her nose at the rest of us, would insult us, constantly talk about how much money she had and would start arguments in the group chat.\n\nShe even told me that the way I dress, I will never get a husband. When I started dating my now fiancé, he'd get shitty with me for continuing to talk to her because she'd make me cry. She told me that because I had no kids and wasn't married, I was immature. I tried to explain to her how her behaviour affected me/the group, but she never changed. I cut her off a few times, but the other girls would guilt me back in.\n\nOne day, I was just over it. I blocked all three of them and iced them out. They tried contacting my mother, my partner, calling me from different numbers but I blanked them. The main bitch even messaged me and said \"You're dead to me!\"\n\nGuess what, cunt, you were already dead to me.",
   "created_utc": 1691039450,
   "score": 21,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukwk0t",
   "message": "Most recently my sil was looking for the full uncensored video of Tyree Nichols being beaten to death. I was appalled. To me it’s like packing up a picnic and going to a lynching like the “good old days”. I didn’t say that but I did suggest that it was not cool to seek this. She countered with she needed to see it so she could experience it with her soul. I told her that watching a Black man be beaten to death for the good of one’s soul wasn’t on my bingo card. She blocked me immediately and I haven’t heard from her since. \n\nIt’s a tremendous relief. Now I no longer have to worry about offending her.",
   "created_utc": 1691039471,
   "score": 4,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukwqz0",
   "message": "He was my best friend of about 13 years. He said yes when I asked him to be my best man, and then ghosted me 2 weeks before the wedding. Didn’t even pick up his suit that I paid for. That was 7 months ago. Haven’t heard from him once since.",
   "created_utc": 1691039599,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukx1ss",
   "message": "When you have a group of friends and they have a chat group excluding you. It’s a 🚩 they are not your friends!",
   "created_utc": 1691039795,
   "score": 31,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukx5km",
   "message": "The thing is some people are so forgiving when what they do doesn't apply directly to them. Ha, but onc.it does it's a TOTALLY different story.\n\nIf you're a shitfuck with everyone else and you don't give a shit. Well then enjoy being a shitfuck.",
   "created_utc": 1691039862,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukx6oz",
   "message": "Far-right extremist posts. And then he blames it on his ethnicity.",
   "created_utc": 1691039883,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukxmhc",
   "message": "Final straw was him trying to convince me not to listen to our Bishop in getting removed from my emotionally abusive marriage situation and focusing instead on getting my now-ex husband into The Church because 'it'll fix everything, it's not like your situation is THAT bad.'\n\nFollowing me ending things and leaving my husband for a safe place, he began trash-talking me to our mutual friends.\n\nSooo not worth my loss of peace.",
   "created_utc": 1691040165,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukxvoq",
   "message": "She couldn’t take a harmless joke even though she joked around on the same way all the time. She’d give the silent treatment for weeks over it and then act like she hadn’t.",
   "created_utc": 1691040334,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juky2qo",
   "message": "They became an emotional succubus. I always supported them, but when it came time to support me, they were too busy. These people were also usually incredibly toxic.",
   "created_utc": 1691040464,
   "score": 25,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juky3f7",
   "message": "She had to one up everything I said / did. Only saw things her way because she knew best. Slowly started to eliminate contact with them and it was amazing how much stress was eliminated from not dealing with them.",
   "created_utc": 1691040476,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juky40r",
   "message": "Political \"views\" or politicizing things that have no business being politicized. I'm not one party or other. I hate the system we have of lesser of two evils.\nI don't feel like debating this here so all I'll say is the people who made it their whole identity I've cut out of my life and don't regret it.",
   "created_utc": 1691040487,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juky92p",
   "message": "When I was told over a text that \"none of us ever considered you a friend, we just tolerated having you around.\"\n\nSo, the friendship wasn't ended because it never technically began. I don't know what friends are anymore.",
   "created_utc": 1691040579,
   "score": 89,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukyb3a",
   "message": "A few.\n\n1) realized the dude was a bad person. Consistently cheating on his girlfriend, always “borrowing” money despite having rich parents. Just generally selfish. But we’d have fun together for a while\n2) he had relations with my at the time girlfriend. That was tough because we got along really well\n3) she was a good friend. And we got along. But she hated men. There actually was a final straw here where she was going to break up with a guy she was seeing, but waited until after her birthday because she knew he planned a big trip for them.\n4) one more. We were never that close, but he did too many drugs and led a different lifestyle. Not really a bad person, just we weren’t actually friends",
   "created_utc": 1691040616,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukybsn",
   "message": "Too many cancelled plans with lame excuses.",
   "created_utc": 1691040629,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukycza",
   "message": "When they came up with yet another reason not to talk to me and avoid me without coming and talking to me first",
   "created_utc": 1691040650,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukyn9l",
   "message": "He kept falling off the wagon. I couldn't watch anymore.",
   "created_utc": 1691040837,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukynga",
   "message": "Dated my first \u0026amp; only ex. After he became a known pos.",
   "created_utc": 1691040841,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukz0bn",
   "message": "They never returned my phone after i let them use it. Did not respond when they messaged me a year later.",
   "created_utc": 1691041075,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukz711",
   "message": "My best friend of 13 years started getting into weed, vaping, partying, and alcohol (we’re both minors). I don’t feel comfortable smoking weed because of a personal issue and shit also because it’s illegal and I don’t wanna get in trouble. But I went to go hang out with her one day and she brought a joint out thinking that I would smoke it. I turned her down multiple times but the last straw was when she grabbed me and put the joint into my mouth and tried to force me to smoke it. I walked home after that alone and listening to her sob and tell me it’s my fault that everything happened to her.",
   "created_utc": 1691041199,
   "score": 9,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukz8y0",
   "message": "My bestfriend stole my boyfriends number and told him shit stuff about me,and later i came to knew she had a crush on him and thats how i ended our relationship",
   "created_utc": 1691041234,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukzcnk",
   "message": "They both asked me for a threesome, right after I had told them how my relationship with my new boyfriend was developing and how well he was treating me and how much I liked him. \n\nOne year later and I still have the boyfriend, who is by far the most respectful and caring person I know. The other two? Pretty sure they're still cheating on each other.",
   "created_utc": 1691041302,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukznae",
   "message": "Somebody I was in a couple of college classes with, was going through a rough time. Claimed that she had so much stress that her hair was falling out. \n\nSo we both still needed to take 2 exams, of which one class was mandatory to pass before starting our internships. I was taking both classes, whilst she said she'd only take the mandatory one. She asked me to record the other class so that she could use the time to study.\n\nBut I took a little longer to upload the file one day, and she lost it at me. Then I called her out for not even taking the mandatory class. Of course that can happen if you're feeling really ill.... but then I overheard her talking to another classmate that she was still working on the side. Then she tried to blame me that I was the reason she was failing (instead of, you know, her working on the side, instead of studying)\n\nWe were done pretty soon after that.",
   "created_utc": 1691041503,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukzolt",
   "message": "He had been an asshole to me the entire time I knew him. I don’t know why I kept the friendship open so long. 20 years or so. The final straw was simply trolling me on Facebook one too many times. I was just done.",
   "created_utc": 1691041528,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukzrup",
   "message": "Sent me one of those crazy rant emails claiming I was ruining his (Bob) fun in an online Minecraft game we play as a group because he doesn't like me asking questions like \"Can we work together to plan out the Minecraft town we're building?\" and \"Where should I build so we don't bump into each other?\"  The day before the email, I log in and he's taken over the entire common region with some large building, and destroyed my structures.  When asked where it went he said it was always his area and he had dibs on it from the beginning.  I didn't argue but really felt disregarded.\n\nMore detail: the \"crazy\" email was a point by point of each random question I had asked in the last few months that Bob didn't like and why it bothered him, followed by how he is the sole \"provider\" in the game that *makes everyone else have fun*.  It included a demand that I make a list of everything I provided to make the game fun for him.  I couldn't even think of how to respond rationally to this (so I didn't).  Who claims to be the center of fun for an online game?\n\nI stupidly tried to call him a couple of times just to discuss it, and he refused to answer his phone.\n\nAnother player (Joe) at first told me not to respond to Bob and ignored it, but eventually over the next couple of weeks prodded me to \"apologize to Bob\" for making him unhappy.  When I asked what exactly I was supposed to apologize for, Joe blew up at me, said I was a liar, had never tried to call him, and was a \"narcissist\" for not apologizing.  I was further baffled. Joe also demanded a screenshot of my phone call log to Bob's number.   Again stupidly, I sent the screenshot proving the calls to Bob.  But I felt really used - it didn't sit right with me, and feeling off for a few days, I banned Joe and Bob from my life.\n\nEventually months later Joe sent me an email saying to \"return to our Discord and we'll pretend it never happened\".  Again, completely baffled.  All this and they want to \"pretend\" they didn't do it? \n\nAnd that is the story of how I ended two friendships at the same time.",
   "created_utc": 1691041590,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukzvoe",
   "message": "She left me with a guy from a club I had only met that night because she wanted to go hook up with someone close by. It was before Uber and Lyft were a thing around here, so I didn’t have much of a choice either because everything was closing for the night.",
   "created_utc": 1691041662,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukzw2z",
   "message": "He laughed when I read my laid-off notice email due to the beginning of the pandemic. He knew I devastated because of that laidoff.",
   "created_utc": 1691041670,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukzyqh",
   "message": "She let her kid steal other kids' toys at my neighborhood's  fourth of July party that i invited her to. Her kid asked of he could take a super soaker home that another kid left by the side of the lake while he was swimming and she literally said 'yeah, finders keepers'.  He stole random mail of ours too and she 'was so embarrassed and confused why he would think that was okay'",
   "created_utc": 1691041718,
   "score": 15,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukzyrj",
   "message": "I went to visit my friend in St. Petersburg, FL and it was a first Friday. They would close all the road downtown and it’s be one big party. Anyways, I s",
   "created_utc": 1691041719,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul01e8",
   "message": "He tried to convince me that Hitler didn't do anything wrong and that everything they say he did was a lie and a conspiracy. This friend was my best friend in high school, but then his health went bad and he essentially had to drop out. For years he was bedridden for the most part. While what he went through was really shitty, I think he spent way too much time on the bad parts of the internet and allowed himself to get influenced. I was really sad to cut ties because I was his only friend, but after that argument I just couldn't do it anymore.",
   "created_utc": 1691041768,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul04jv",
   "message": "I had a former roommate that went so political that she started me because I have friends across most of the spectrum and she was furious that I wouldn’t get in their faces about their personal beliefs and would rather discuss values and philosophies rather than how horrible this candidate or that candidate was.  She even got angry because I expressed genuine gladness that she got to enjoy the huge rallies going on at the time.  She ended up blocking me and despite my choosing to be kind through her crazy, I was not sad.    A lot of people were nutso on both sides that year.  I even blocked a couple people who probably voted the same as\nI did, but they were just political freakazoids.",
   "created_utc": 1691041827,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul064b",
   "message": "The final straw that made me end a friendship was when they repeatedly betrayed my trust and disregarded my feelings.",
   "created_utc": 1691041856,
   "score": 6,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul08jf",
   "message": "I went to visit my friend in St. Petersburg, FL and she told everyone of our friends that I made her skip work while I was there and that’s why she got evicted. That was the cherry on top… the reasons are too much to write. She is just a walking red flag and runs through friends. She gets what she wants then dips.",
   "created_utc": 1691041899,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul090o",
   "message": "I realized they were verbally abusive and that it was an unhealthy friendship",
   "created_utc": 1691041907,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul0ao7",
   "message": "She told me I wasn't allowed to find out the sex of my baby and she wanted to know before me and my husband, she invited herself over for Christmas morning then complained about what we traditionally have for breakfast saying she wanted something else, expecting us to pay for it.. soon shut that shit down told her we just wanted a family Christmas morning. Told her she was being too much and making me anxious,haven't spoken since. Way too controlling.",
   "created_utc": 1691041934,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul0b8w",
   "message": "It started with my friend stopping to search contact with me. It just stopped gradually. I was the one trying to hold the friendship up for about four years. Then he started to make weird and insulting comments about personal stuff in front of strangers. After i tried to talk with him about it he blocked it and got upset that i wanted to talk to him (and insulted me several times...).\n\nAt that point i simply stopped talking to him and the friendship was gone for me.",
   "created_utc": 1691041944,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul0dqc",
   "message": "The final straw that made me end a friendship was consistent disrespect and lack of support during a difficult time.",
   "created_utc": 1691041990,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul0kat",
   "message": "As a teen I had extremely low self esteem and didn’t care if people were mean to me as long as they called me friend. I spent like 8 years hanging out with this guy who would constantly belittle me in front of people to make himself seem “better”. One day he introduced me to a group of friends that kinda liked him but he still wasn’t technically apart of their group. They all saw how he treated me and the moment my friend was out of ear shot, they all took turns telling me I don’t deserve to be treated that way and that they thought I was super cool and that I should not hang out with him. \nAfter that day I stopped hanging out with and talking to him",
   "created_utc": 1691042109,
   "score": 71,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul0klr",
   "message": "One Halloween, I went out with my best friend and dressed in leather and donned a whip. I moved out of state a few months later and they lamented about the fun we used to have, so I sent a pic they took of me that Halloween to give them a laugh. They seemingly forgot the reference and showed the pic to my family and told them they were worried and didn’t know what kind of stuff I got into. I didn’t find this out until after I came home for a holiday visit and my entire family shunned me and would pull their children away whenever they tried to approach me. I’m pretty forgiving, but messing things up with my family was something I couldn’t easily let go of.",
   "created_utc": 1691042114,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul0p6r",
   "message": "Friend joined one of those “good wife” cults. That was not on my bingo card",
   "created_utc": 1691042196,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul0sja",
   "message": "She just didn’t care about doing things with me anymore. She would say she couldn’t go out because she “had homework” and then I would hear that she went to a concert or went shopping with someone else on that same night. I confronted her about it, she made up excuses, I stopped talking to her, and she never made any effort to contact me or save the friendship. We haven’t seen or spoken to each other in 12 years, so obviously I did the right thing, because she clearly didn’t care!",
   "created_utc": 1691042262,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul0t2m",
   "message": "Dude had always been a drain on me.  Talked shit about my kids.",
   "created_utc": 1691042272,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul0vs3",
   "message": "I have two. The first one had severe problems with depression, and i had helped her for over six months with coping with this in healthy ways that didn't involve drugs or cutting herself, one particular day on spring break, i was playing fortnite with my brother and our friends when one of them says she went to the hospital. I immediately got worried and started questioning him, and he told me she had posted on her snapchat story \"goodbye\" with her holding a handful of pills and i checked my phone. She did. I tried to call her several times but she wouldn't pick up. That was the first time i had cried for someone in about 5 years at the time. After about a month with no contact, i finally got the story, she had been texting a boy who she knew she was unstable towards, they started arguing, and he mentioned she should end herself. This caused her to have a mental breakdown where she then swallowed the pills. After trying so hard for so long to help her, practically dedicating myself to helping her, she threw it all away. In ten minutes, all that time was for nothing. All for an idiot boy who meant absolutely nothing. Never in my life have I felt so much rage, hate, sadness, and disgust for someone. \n\nThe second one I was also really close with. We had so much in common, and got along great. After about 8 months she started to change, she got distant from everyone and started getting into drugs. Everyday for weeks at a time she came into school drunk, or high off her ass. She was buzzed practically every second of the day, and she only talked to you if she was bored or she wanted something from you. One day she got ahold of a laced weed pen and was using it in the bathroom. She greened out and had an allergic reaction, along with seizures, every teacher and school staff available rushed to the bathroom to help her and she was taken out on a stretcher. When she eventually came back she continued to dabble in alcohol and vape heavily. I couldn't be friends with her anymore after that.\n\nI'm disgusted with myself for knowing i could have stopped them both, had i been more attentive. I still think about these stories often.",
   "created_utc": 1691042321,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul15r1",
   "message": "I used to always text her first but one day I decided not to text and see maybe It will come from there first but It's been 2 months now, still no message...\n\nStill, She is my bff\u0026gt;\u0026gt;\u0026gt;\u0026gt;",
   "created_utc": 1691042504,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul181u",
   "message": "My friend who lived 15 minutes away from me would decline most things I invited her to but I’d see her online hanging with other friends at parties. I’m not a big party person. She would only ever invite me to her birthday party once a year and get upset with anyone who didn’t bring her a gift or wish her a happy birthday. I stopped initiating hangouts with her and she noticed. Anytime she got in a relationship I didn’t exist. Then when a guy leaves her, she comes back like she never disappeared. \n\nThen I began setting boundaries and I finally came to terms with the fact that the friendship had run it’s course and it wasn’t reciprocated. I acknowledged and accepted this and let it fade away. I still got the “I miss you” and “let’s hang soon” texts but there was no substance to it. It was like she was sending a predefined message. I have other friends who have shown me beyond my expectations what a friend should be and it’s made me realize that her company was exhausting, phony, self-centered, and conditional.",
   "created_utc": 1691042546,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul1c9y",
   "message": "A 40 plus year friendship ended over arguments about Trumplthinskin. I realized I was not willing to listen to someone defend a thief, liar, and delusional psychopath. I value inner peace so I needed to end the relationship because protecting my inner peace was and is very important.",
   "created_utc": 1691042629,
   "score": 9,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul1fu4",
   "message": "Spent the money I was giving him for rehab on drugs and alcohol.",
   "created_utc": 1691042698,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul1l5i",
   "message": "Not coming to my birthday. Before that I'd tried a number of times to stay in touch, but it was always me making the effort. Finally the day before I checked If they were still coming after arranging it all 2 weeks before and was told they weren't sure it was happening so made other plans. Why not call me before you made the other plans if you weren't sure. Any way I'm not chasing them anymore and I doubt they even know.",
   "created_utc": 1691042799,
   "score": 10,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul1zyb",
   "message": "Used me for my kindness. I was kind and kept willing to help, I also realized how manipulative one of them was, so I ended the friendship.",
   "created_utc": 1691043088,
   "score": 5,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul2a1j",
   "message": "My friend circle is aged 17-19, an old friend of my friends comes back after 2 years of going missing (he's now 23), anyway, he started giving oxys to my 17 year old friend and tried to justify it by saying he was in a \"controlled environment\". I wanted to murder him. \n\nI hope that made sense",
   "created_utc": 1691043287,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul2hv4",
   "message": "he ruins a weekly table top game that i ran for 4 years, says its my fault he ruined it, and blames other friends for me being upset. I just wanted an apology. he said i was annoying and \"looking for someone to blame\".",
   "created_utc": 1691043439,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul3sar",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jula220",
   "message": "That is not a good excuse for repeatedly bailing on people",
   "created_utc": 1691048876,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul9myk",
   "message": "Sleeping with his girlfriend. \n\n(So technically it was him that ended it I suppose, but I totally see why it was an issue...)",
   "created_utc": 1691048556,
   "score": 0,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul6xjl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul55o8",
   "message": "He raped a mutual friend of ours \u0026amp; punched another one of our friends in the face during a drunken argument, he then kicked him in the face once he hit the floor, knocking out his teeth, leaving him unconscious in the middle of the street alone at night.",
   "created_utc": 1691045317,
   "score": 18,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul7dv3",
   "message": "He wouldn't stop talking about how much he wanted a 15 year old girlfriend and wishes it was legal 🤮",
   "created_utc": 1691046909,
   "score": 6,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul2v9a",
   "message": "Rudeness",
   "created_utc": 1691043701,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul43qc",
   "message": "When I realized that my friend had such extreme Narcissist Personality Disorder, that telling him was not going to change anything. And that he would continue to use me as long as I continued being a doormat. \n\nThe signs of his narcissism:\n\n-They were really nasty to other people, strangers, even their poor grandpa. Cussing at them and thinking it's funny. \n\n-Feeling entitled, like the were never in the wrong, it was other people that were the issue. Feeling like they deserved ridiculous things, such as bringing their dog into a \"no dogs\" liquor store, and arguing with the store cashier over it. Feeling like failed relationships were never their fault when in fact they always were. \n\n-posting 50,000 selfies, all day, everyday. With a filter. Writing captions such as \"I'm so pretty\" or \"I'm an icon\". SO cringe \n\n- calling me daily, only to spend the entire time talking about themselves. And interrupting or ignoring me when I spoke. Or texting other people when I was talking. Felt like I was talking to a wall\n\n- constant need for praise. Constantly talking about how fabulous their life is, how gorgeous they are, how popular they are, how they're practically a celebrity. Etc. \n\n- never having deep convos. Just talking shit about other people while bragging about themselves",
   "created_utc": 1691044562,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul7kcj",
   "message": "sexual assault, money fraud, death threats 🤷‍♀️",
   "created_utc": 1691047039,
   "score": 5,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juldvbo",
   "message": "They used me as their personal driver and piggy bank.\n\nOh and they tried recruiting me into an MLM scheme too.",
   "created_utc": 1691051773,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul8yry",
   "message": "She’d flirt and go after every guy that I’ve ever liked. Every. Last. One. She was so pretty when I was so dorky, so I never understood what she was always trying to prove.",
   "created_utc": 1691048063,
   "score": 13,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpi3b",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul2l9w",
   "message": "When I was in high school I hung out with a lot of guys. All which were pretty cool.\n\nThey were the type to not like going to school event, let alone a football game.\n\nI on the other hand, love football. So, after days of trying to convince one of my friends, he said yes.\n\nOn the day of the game, he said he was going to go down the street with his cousin to buy food and then come back.\n\nI waited a good hour. I called him and he said he was still waiting for the food. (Its a small restaurant at the end of the school and everybody went there Fridays after school)\n\nI said okay and asked if they wanted me to go in to get us seats. He said no that I should just wait.\n\nThe game started. I called and he said he was almost there. I heard the band (one of my favorite parts). I called him and he laughed and said he was at the game the entire time.\n\nI hung up, went to the school restroom, and cried.\n\nI realized then that he was a piece of shit!\n\nSuck to suck though... he asked me out later on and I rejected him. His cousin asked me out. And guess who I dated...\n\nFUCK YOU ALEX!",
   "created_utc": 1691043507,
   "score": 6,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul2n91",
   "message": "He turned into a super hardcore Trump supporter.  Which would have been fine had it not been for the fact that a) it was the only thing he would ever discuss and b) that every single other person HAD to be convinced that Trump was the be-all-end-all.  Good god was he ever annoying with that.\n\nBy all means, do your thing.  You want to be a Trump supporter go for it.  But when it's abundantly clear I'm not as stupid as you are, let it go and talk about ANYTHING ELSE FOR GODS SAKE",
   "created_utc": 1691043546,
   "score": 4,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul8a1y",
   "message": "I took my computer out of storage and needed to access some files on it. Took it to my \"friend's\" flat in London. I couldn't move it it right away so he said I could leave it there for one week. Couldn't get back to London in time so he put it out on the street our of spite. Best mate for 30 years until last year. Why would anyone do something like that you might wonder? He told me that would happen if I didn't pick it up. So it was \"my choice\". Full on high spec machine put out for trash.",
   "created_utc": 1691047550,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "julbu96",
   "message": "When she forgot my birthday. I know it's silly but her actions spoke volumes. I was there for her when she gave birth to both her kids, supported her. I was her bank and when I lost my job and had to supplement my income doing IC, she didn't HEAR me when hi said I could fund her pockets whenever she needed help. 11 years of friendship down the drain. Completely cut her out my life",
   "created_utc": 1691050208,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "julebmy",
   "message": "I just ended a friendship because it felt like a chore for her to hang out with me saying that she was “busy”, but she had no problems hanging out with her other friends.",
   "created_utc": 1691052124,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jum0jke",
   "message": "Reconnected with high school best friend thirty something years later. Saw she still worshipped the Virgin Mary and was a bootlicker.",
   "created_utc": 1691066144,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jum7ytt",
   "message": "So, I (29M) was friends with this guy (28M) for 23 years. We met when I was 5 and he was 4 at a karate dojo, then again in school that same year. We hit it off and were basically inseparable for 10 years. We hung out every weekend, and he lived at my house for the entirety of summer break for 6 of those 10 years. But things changed a bit when we were in high school. I went through a bit of mental and physical health hell, and he (rightfully) started hanging out with other people, got a girlfriend, and joined his school's football team.\n\nThe biggest issue from that point on, was neither of us really had time to hang out anymore. And we eventually just stopped talking to each other. I think we still considered each other as friends, or maybe that was just on my side, who knows lol.\n\nBut to directly answer your question as to what made me end the friendship. I was invited to his wedding... two days before it was supposed to happen... And I didn't even know he was engaged. But I was happy for him, and I still considered him my friend, so I asked what I thought were the appropriate questions.\n\n* What's the dress code? It might be too late to rent a tux, but I can at least have a suit washed and ready to go.\n\nHe told me to just wear jeans 'or something similar'. I thought it was a bit weird, but okay.\n\n* Was there anything they needed for the wedding or a gift that hasn't been given yet?\n\nHe said no, I just needed to be there. (I still gave him an envelope with $500 cash as a wedding gift. I would've felt like shit otherwise.)\n\n* I asked if he would mind if I brought my girlfriend to the wedding.\n\nHe said no, he didn't mind if she came too.\n\nSo, on the day of the wedding, my GF and I showed up in jeans, long sleeve shirts (Hoodie in her case), with an envelope of cash... To a wedding where *everyone* was in what I would call 'formal' attire.\n\nI heard people ask who we were. His mom, a woman who's literally known me since I was 5 and has called me 'son' more times than I can count, didn't want anything to do with me. And every time I tried talking to her, she'd scrunch up her nose and walk away after a few words. And my 'friend' didn't even speak to me the entire time we were there.\n\nThe only bright spot on the day was I got to see his two sisters, who I hadn't seen in a couple of years because they were both busy with school stuff. They were over at my place even more than their brother because my mom was their babysitter growing up, and I'd practically help raise them. Hell, they may not have been blood, but I considered them just as much my sisters as I considered my 'friend' a brother.\n\nMy GF and I sat beside the sisters while their brother got married, I chatted with them for a bit while we ate (my GF who suffers from severe social anxiety just hung out with us), then, when it was time to go, I shook their brother's hand, gave their mom a hug, shook their dad's hand and gave him a hug goodbye.\n\nThat was the last time I considered them my family. The 23 year friendship is over and I don't reply to their (aside from the sisters) messages anymore.",
   "created_utc": 1691069557,
   "score": 12,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jum9d25",
   "message": "A \"Friend\" started using drugs and started stealing trucks. I was hanging out with our common friend that lived in the same neighborhood, and this other friend decided to pull out in front of his house to brab about his new truck that he obviously had just stolen.  \n\n\nWe said what an idiot he is, doing that bullshit, and when he left we called the police, provided the description of the truck, the plate # and his name and address.",
   "created_utc": 1691070157,
   "score": 5,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jum9ev1",
   "message": "When he stole $12k from my business",
   "created_utc": 1691070177,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jum9ydh",
   "message": "When he started fully supporting andrew tate and started believing in \"the matrix\" and started to have very conservative and misogynistic views.",
   "created_utc": 1691070395,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul39ia",
   "message": "When he said that he didn't respect the existence of the field of Linguistics if it disagrees with his views on how English works.\n\nThis was after I'd gotten a degree in Linguistics.",
   "created_utc": 1691043970,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul4spv",
   "message": "Lack of reciprocity.",
   "created_utc": 1691045059,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul66r6",
   "message": "Pathological liar.  Told me he was dying. I was so distraught.  Complete utter wreck.  Nope.  Not dying. Healthy af.  He's still alive now 20 years later. Must be the miracle medical intervention he didn't need and didn't get.",
   "created_utc": 1691046051,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jul9dpq",
   "message": "using me solely as a dumping ground for their problems/stress/self loathing/etc, asking for advice and then getting upset at the suggestions or refusing to try or being straight up defeatist. eventually I got burnt out of being the unpaid therapist because I got absolutely nothing positive out of the friendship. the final was being made to feel like a traitor for not doing something with them that was very expensive that I couldn't afford and instead going on a cheap trip with someone else. it had been discussed and I thought it was understood that it was a money thing. when it happened, they made me feel like the biggest dick head for doing something else within my budget. after everything else, I was tired of being treated like that 😔",
   "created_utc": 1691048366,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "julai7b",
   "message": "I realised that she was silently bullying me. Whenever we went shopping, she claimed she hated everything I liked, and in a week, she’d be wearing the things I liked. \n\nI felt inadequate and realised it was not about me but her.",
   "created_utc": 1691049209,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "julal5v",
   "message": "Had a friend who fell into the world of “social media micro influencer” and it’s completely destroyed her life. She is now a shell of the person she once was; nothing about her actions are genuine and she only ever participates in activities if they can bring her attention/clout or views. The sad part is, she knows she has no more friends (I’ve heard that she gets drunk and cries about it to anyone who will listen) but can’t understand that she’s responsible for pushing them all away by reducing them to props and background noise for her tiktoks. She thinks Covid destroyed all her friendships but it was actually just her own, selfish behavior. We’re all in our mid to upper 30’s so she’s too old to be acting like this in the first place and it’s just really pathetic watching her try to keep up with people half her age by recycling their content.",
   "created_utc": 1691049269,
   "score": 4,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "julaleq",
   "message": "When I have waited for hours for her to show up over and over again. Final straw was waiting for her to show up for movies. Missed the show we planned to see and I finally reach out to her kids,(because she never responded to my calls/texts). Kids say she is sleeping because she’s tired from hanging out with friends earlier in the day. I said I don’t want to waste any more of my time waiting on her.",
   "created_utc": 1691049274,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "julb6sh",
   "message": "December of 2020 he started talking about how he’d gotten word that the military was about to overthrow all the Biden supporters and put Trump in charge.\n\nSpooked me. That was enough.",
   "created_utc": 1691049724,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "julhcs8",
   "message": "Them being a trump supporter, or even a trump apologist. Hard break.",
   "created_utc": 1691054425,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "julhopv",
   "message": "One of my best friends in high school; he knew I had a massive crush on a girl. He was well aware that I was a bit awkward and not very confident, so he offered to help me out. He invited the young lady in question and me to hang out at his place, to get us in the same place and give me a shot.\n\nThen he had sex with her while I was in the next room. I realized what was happening, and just sat there, unsure how to process what was going on. At some point I left. We never really discussed it.\n\nThe friendship puttered along for a short while longer, withering away after that. That event, along with a few other earlier experiences made it so I've never been quite able to trust other guys and form friendships with them as anything more than acquaintances. \n\nTo this day (I'm 38) I don't have a single close male friend. One of the few things I dislike about myself.",
   "created_utc": 1691054670,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "julyv4g",
   "message": "One of my best friends who helped me whenever I needed it in school like math and stuff stopped talking to me when I told him my family had a lot of wealth and business in India. His mom thought I was a “spoiled” brat or something",
   "created_utc": 1691065321,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "julzpfa",
   "message": "Was going through a divorce. Found out my best friend at the time was feeding information to my then wife. I had been confiding my feelings and such to him. My trust was violated, it sucked. I don’t share like that to my small number of friends. anymore, I use a therapist.",
   "created_utc": 1691065739,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "julzux0",
   "message": "Their constant rambling on and on about their BIG BOAT, their BIG HOME, the home’s BIG SOLAR SYSTEM, their new BIG KITCHEN, How successful they are ……blah blah blah . It just became a “look at me and our lives” session every the time. Every interaction became so mono-dimensional and boring and we would just nod to the incessant diatribe. I don’t give a toss about their BIG purchases , I just want to have mates who are just real.",
   "created_utc": 1691065812,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jumd1ep",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jultqhp",
   "message": "Ah, it was very simple. He was a MAGA supporter and we often talked politics and such. But that wasn't the cause for ending our friendship. I'm quite tolerant and I know how to separate people from their political beliefs. But come the pandemic, he starts promoting anti-vaccine stuff in his facebook. I lost both my in-laws to COVID and he knew that. I tried to convince him to get vaccinated out of concern for him, appealing to reason and empathy. He called me a shill for the pharmaceutical companies, a murderer and a co-conspirator for genocide.\n\nSo, that was the tipping point. I blocked him from all my social networks without any explanation. He can go get lost for all that I care nowadays.",
   "created_utc": 1691062606,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jum4k7y",
   "message": "My friend in high school was kinda creepy and had a face to match. (Poor guy) He was very immature and did a lot of childish things and barely passed classes. I don’t think he has any mental illness but I don’t know for certain. He was a constant distraction in classes. \n\nBut what was actually concerning was the fact he constantly made school shooting jokes and even bragged about his family owning an AR-15. He showed pictures of it at school and when anyone would ignore his childlike behavior he would threaten to shoot up the school. To put it simply, I eventually stopped interacting with him much but kept a VERY close tabs on him. I’m glad those years are over.",
   "created_utc": 1691068040,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jum6k7l",
   "message": "She slept with my ex, before he was my ex.",
   "created_utc": 1691068937,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jumi1x8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15grgxn"
  }
 ]
}