{
 "submission_id": "15grgxn",
 "title": "What was the final straw that made you end a friendship?",
 "selftext": "",
 "created_utc": 1691029507,
 "permalink": "/r/AskReddit/comments/15grgxn/what_was_the_final_straw_that_made_you_end_a/",
 "score": 22,
 "url": "https://www.reddit.com/r/AskReddit/comments/15grgxn/what_was_the_final_straw_that_made_you_end_a/",
 "comments": [
  {
   "comment_id": "juke3nh",
   "message": "When I text and got no texts back. Bye.",
   "created_utc": 1691029575,
   "score": 29,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukjpqr",
   "message": "When they \"Forgot\" to meet up with you for the third time even though you planned those meet ups days in advance.",
   "created_utc": 1691032224,
   "score": 16,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukhpaa",
   "message": "When he had everything going well for him in life and bought cool shit while I was living poorly, he'd rub it in my face. When I started being successful and finally made something for myself, he couldn't stand it.",
   "created_utc": 1691031243,
   "score": 8,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukeebs",
   "message": "He kept posting the most whiney posts on Facebook. Woe is me! Never trust women! He probably shouldn't have filmed himself blowing smoke into his toddlers face while drunk as a skunk yelling at the girlfriend. Now he sees his kid through child services visits.",
   "created_utc": 1691029712,
   "score": 6,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukgt1t",
   "message": "Him saying \"what have you done for me?\" in an unprompted call-out. He was holding food I bought him, with a bag with drawings i made for him. The friendship was completely one sided.\n\nWatch out for all-take-no-give people, guys.",
   "created_utc": 1691030824,
   "score": 10,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukfflb",
   "message": "I was friends with this girl in college. One semester we, my friend group, decide to be in a group for a semester long assignment. There were multiple parts to the assignment, one was going on a class trip, each person taking a section of a paper, and then the last was a display of some sort.\n\nOn the day we were compiling the display for class, this girl says she had a doctors appointment but she would hurry back. That would be fine because everyone didn't get out of classes to meet up until a certain time. She didn't show up because she went out on a date and then got her car washed. Which she posted on snapchat.\n\nShe showed up 20 minutes before the class started and our other friend who had been helping us, WHO DIDNT EVEN TAKE THE CLASS, had to give her the what-for because we were all so furious.\n\nIt was after that that I had looked back and realized it wasn't the first project she jeopardized, and she did some other shady shit like put another friend in a dangerous situation.\n\nAfter that I cut her out of my life completely.",
   "created_utc": 1691030180,
   "score": 4,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukkj98",
   "message": "She was unvaccinated and refused to take a covid test before seeing me. My mother was terminally ill and severely immuno-compromised, so I was absolutely trying to minimise the risk of getting covid so I could still see my Mum.\n\n\nShe refused to take a test, twice, despite kind and calm requests and explanations, on the basis that she \"didn't want to get a sinus infection.\" (This was in the time of nasal swabs, not mouth swabs, for covid tests. You know, those nasal swabs that are sterile and can't cause infection.)\n\n\nI'm 100% sure that it wasn't about a sinus infection. It was about control. She had been annoyed because I hadn't validated her anti-vax stance in the past.\n\n\nSimilarly, I know she wanted more validation for her religious views, which she'd acquired in her 30s and which I didn't share. I'd told her that I was happy her faith made her happy, but I think she wanted me to truly share her beliefs. I'd also said that her sister's bisexuality was \"fine with me\" when she'd stated that a wedding of 2 women was \"not what God wants.\"\n\n\nI think all of those different views just threatened the way she saw the world, and how she saw herself.\n\n\nHer last texts thanked me for \"sharing my views\" re covid and it's potential to kill my Mum, then became pseudo-concerned when I didn't reply. I read the whole situation as \"I want to say whatever I want to you, but I want to still feel like a nice person, so please reply and give me that validation.\"\n\nI didn't reply to her, but I still ask myself whether the mature thing to do would have been to clearly reply and state that I didn't want to stay in contact. It's taken me until now (over a year later) to see through the pain and formulate what I might have said.\n\nWe'd been friends since the first days of high school. 20+ years. In essence we just aquired very different views from each other as adults, but I can't pretend her attitude towards my Mum, and towards the horrible journey my family had to take, wasn't devastating.\n\nLife is a bloody painful journey at times, that's for sure.",
   "created_utc": 1691032640,
   "score": 4,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukfe4m",
   "message": "they screamed at me, and tried to emotinally manipulate me into calling them, when i literally couldn't because my microphone was packed for a trip i was going to the next day",
   "created_utc": 1691030162,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukid5u",
   "message": "They were always self centered and dominated the conversation but I rolled with it. But one day while traveling for work we had lunch with peers and they proceeded to brag incessantly about the car they drove, the luxury vacations they took and how well liked they were at work. \n\nThe car was an old Lexus, the luxury vacation was to New Orleans (they were from NOLA) and I was the only ‘friend’ they had a work because no one could tolerate them. I was done after that.",
   "created_utc": 1691031565,
   "score": 4,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukildr",
   "message": "They were a “I can do to you, but you can’t do to me” person. They could talk about you all they wanted, but as soon as someone said something about them, they would blow up. \n\nThe final final straw was they tried to break two friends up so they made a group chat to try and get other friends on their side. We told the two friends about it and the two friend confronted the one friend. The one friend tried to pass blame on someone else but, the two friend knew the truth. We all eventually phased them out.",
   "created_utc": 1691031678,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukjyq3",
   "message": "Dude bought a new house a block from my job and I was over there after work every single day to help him paint or move stuff. Once he moved in I didn't hear from him for 6 months. When we did talk he claimed to not know the location of my work otherwise he'd visit. \n\nBut before this there were years of making plans knowing he wouldn't make it or already have other engagements.",
   "created_utc": 1691032350,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juklew5",
   "message": "I have friends that went so red pill it became a detriment to our friendship. It has the ability to completely change a person's personality.",
   "created_utc": 1691033091,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juklfdm",
   "message": "One of my friends from high school went full on \"traditional Christian\" as in thinking women should stay in their lane and let men run things. Started acting better than a number of us in our friend group like he'd been enlightened after reading the Bible for a few weeks and discovering the truth, while trying to convert others into his new line of thinking. \n\nI had grown up with a narcissistic super religious father and had already decided to cut ties with him, so I was full aware of the type and where he'd be heading. Tried to reason with him about it but he got pulled in too hard and had to let him go.\n\nI've had to let go several friends due to their romantic partners isolating them from their friends group (despite heavily trying to warn them about it), several who would not let go of exs, and some who just turned out to be general pieces of shit (cheaters mostly men).\n\nHad one friend who had the nerve to actually delete my phone number and remove me off several socials, but still wanted me to come to her wedding. \nLike who does that?",
   "created_utc": 1691033099,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukljwo",
   "message": "Quitting drinking",
   "created_utc": 1691033165,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juklklk",
   "message": "He would constantly bitch about how broke he was, how terrible his life was, how much he wanted to kill himself because of those things but when I say hey maybe you wouldn't be broke if you actually bought groceries instead of eating out for every meal, maybe you'd save money by getting your THC in bulk jars direct from the manufacturer instead of buying a disposable vape at a shop every day, don't get high at work, you're going to get caught sleeping on the job and get fired...\n\nHe screamed at me and said I didn't understand and why was I giving him a hard time, blah blah blah. \n\nOkay. I dropped him. \n\nCalled him up a few months later because he owes me money (that I'll never see again) and guess what? Says he can't pay me back because he lost his job and his car's been repo'd. Shocked! I'm SHOCKED, I tell you! 🙄\n\nOh well, it was totally worth $180 to not have to listen to that whining anymore.",
   "created_utc": 1691033175,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukedw2",
   "message": "I was in a band with him and his brothers. We had a single ready for release and had all agreed on a release date; they then announced the single would be released on a different date. I assumed it was just a typo in the post, so I corrected it. Turns out they had an entirely different release date in mind and they berated me for “switching it” without telling them. At that point I was just done with them.\n\nMy friend had been one of my best friends for years, but it took me a while to realize how narcissistic he really was. I’m glad it’s over with now.",
   "created_utc": 1691029706,
   "score": 5,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukk4iv",
   "message": "When they stopped inviting me to go out with them after I lost a bunch of weight.",
   "created_utc": 1691032433,
   "score": 5,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukeb1s",
   "message": "Them choosing to be friends with someone I despised over staying mine.",
   "created_utc": 1691029670,
   "score": 4,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukhr11",
   "message": "Our group of friends from high school but after graduation would hang out on voice chat each night. Every night this one friend would just rage and rage whatever game he was playing. We'd usually play our own games but occasionally together.  He wanted to play hots, we were losing and he was raging at our team the whole time, eventually he just raged quit. I pretty much told him, every night I get home from work I just want to chill destress by gaming but all I get is an earful of negativity from you. So he stopped talking to me after that, few years later he apologies but we never reconnected.",
   "created_utc": 1691031267,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juki8zt",
   "message": "Not being invited to her wedding after being close friends for nearly four years. The other two people in our friend group were bridesmaids.",
   "created_utc": 1691031510,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukians",
   "message": "Misogynistic and homophobic statements",
   "created_utc": 1691031532,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukjivq",
   "message": "I knew them for a few months. They constantly tried to push my boundaries (i.e. wanting to know extremely personal info about me.) Their justification being that they were being a \"good friend\" to me. In other words, divulging personal info about myself was the repayment that they wanted. This was an online friend, BTW.",
   "created_utc": 1691032128,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukk23c",
   "message": "When they didn’t celebrate a big life moment of mine. Never once even mentioned it. Couldn’t even like a picture on the old Facebook or IG. After a year of just nothing I just booted her right out of my life.",
   "created_utc": 1691032398,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juklbnm",
   "message": "When I was 24 I discovered a good friend of mine had been having sex with minors for the past 3 years. I'm now 35, moved away, and the last I heard he was in prison for heroin possession, theft, arson, and 2 counts of felonious assault with a deadly weapon.",
   "created_utc": 1691033046,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juklkn1",
   "message": "She gave me shit for wanting to go back to school to complete my degree. She was lonely and she wanted me to move to her small town and rent the other half of the duplex she and her husband owned.",
   "created_utc": 1691033176,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juklwj7",
   "message": "When I text and got no texts back. Bye.",
   "created_utc": 1691033347,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukmxcv",
   "message": "Asking for a tiny ammount of vital help after I've been a life changing source of support to them, and not getting it.  \nLol don't do this to people, it's not forgiven or forgotten, ever.",
   "created_utc": 1691033876,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukmzzc",
   "message": "Being told God was more important than our friendship of 12 years when I came out to him.",
   "created_utc": 1691033914,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukn54n",
   "message": "He thought Jan 6 wasn't treason, didn't see the problem, blamed the media.\n\nThis guy took an oath to defend the Constitution. I take that oath serious enough I don't want to associate with those who excuse treason. \n\nHe was also a habitual liar, and that was already bothering me.",
   "created_utc": 1691033989,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukq2q7",
   "message": "When I reach out to get together for lunch to catch up. and they say they’ll check their calendar and get back to me. And then they don’t get back to me.",
   "created_utc": 1691035581,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukqvfi",
   "message": "This guy was my best friend during the whole of highschool. We drifted a bit apart due to different career choices but kept in touch sporadically.  A few years ago, decided to delete and block me from FB because of a political disagreement. I thought we were above such pettiness, because we'd known each other from way back. So when I realized that he'd done that, I also deleted and blocked him from everywhere. Blocked his number and deleted his contact info from my phone and everything, because f* him for political bigotry.",
   "created_utc": 1691036034,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juke2b0",
   "message": "Gaslighting",
   "created_utc": 1691029558,
   "score": 2,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukey4p",
   "message": "He went full conspiracy theory “Robert F. Kennedy is a very smart man” level shit. But his delusions of grandeur and narcissism had been wearing me thin for a long time.",
   "created_utc": 1691029961,
   "score": 3,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukeck0",
   "message": "Straws are for suckers",
   "created_utc": 1691029690,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukitmb",
   "message": "He assaulted my partner at the time. Other friends sided with him and I lost a whole friend group because of it.",
   "created_utc": 1691031789,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juke7vo",
   "message": "When they start talkin shit behind my back.",
   "created_utc": 1691029629,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukgk8u",
   "message": "Dude was requiring us to spend time with him every night and do a \"podcast\" on discord. At that time three of the six of us had a girlfriend, two were busy with school so they didn't really join in, and him. Dude flipped out about us not spending more time with him, like bro we get that we're your friends but we have lives too plus we busy dealing with school and stuff. Eventually we cutted him off our circle, dude's still friendless as far as I know",
   "created_utc": 1691030710,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukh57l",
   "message": "Tried to manipulate my other friend into doing what she wanted.",
   "created_utc": 1691030983,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukh86m",
   "message": "We were sharing a milkshake and he took the only straw left.",
   "created_utc": 1691031021,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juki56w",
   "message": "she ruined my birthday",
   "created_utc": 1691031459,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukkihw",
   "message": "she ruined my 21 birthday, before that she would only come to me for advice or a shoulder to cry on but when i needed it she would redirect the conversation right back to herself and so much more that she would do but the last straw was my birthday.\n\ni went all the way to her city bc she lives in the big city and we would celebrate my birthday. so i was gonna stay for two days, we were supposed to go to a restaurant but she had invited some of her own friends to join us. but we never went to a restaurant now did we? no ofc not. she took me to a fkn club. i don’t drink, i told her specifically that i didn’t wanna drink and when i realized it was a club i was so mad that i told her i didn’t want to be there and her other friends would jump in and make me uncomfortable to even have that conversation with her so i just shut up. the next day i told her that was fkdup and she apologized.\n\nshe did the same thing that night. i went to her apartment by myself and left her at the club. i am really uncomfortable at clubs i just don’t enjoy it. she knew that. but did this anyway. \n\nit was long overdue to end the friendship, she had been such a negative and toxic impact on my life anyway for years. we haven’t been friends for a year and it only took me a week to feel such a relief and the weights on my shoulders just went away. i didn’t realize how badly she was affecting my own mental health that it felt like paradise only a week after.",
   "created_utc": 1691032629,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukl1ow",
   "message": "When I got shouted at for not being in school for one month out of a whole year when she weren’t in for 3 months straight",
   "created_utc": 1691032902,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukm9ji",
   "message": "I've lost a few friends because they didn't respect my boundaries. I'm an easy dude to get along with, but just like everyone I have some quirks. One of which is that I avoid my birthday, I just don't want the attention, so I don't tell people when it is. They ask, I tell them that I don't appreciate the extra attention and to please not ask again.\n\nInevitably they find out, and for some stupid reason they can't not do anything. Welp, if you aren't going to respect that one simple request, then I guess I'm just not going to talk to you at all anymore.",
   "created_utc": 1691033535,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukn0ts",
   "message": "Working and going to school fulltime with barely 2-4 hours of sleep each night, rarely even at home, and could barely get enough time to talk to my own husband but she expected me to text her novels and novels of text messages everyday and calling me a bad friend for not texting back quick enough. I explained it to her and apologized profusely, but still got regularly berated in long paragraphs. That was not a good time. That was just the last straw. \n\nShe’s also inherently a selfish and very bossy person. And in recent years came out as a raging racist and homophobe (I’m bi) backed by her new found religion. The lack of human compassion got me in the end, but I was blind to it all along. It took me years to finally open my eyes and just say enough.",
   "created_utc": 1691033927,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukneln",
   "message": "I was supposed to be okay with not being paid back because they have kids",
   "created_utc": 1691034126,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukngxe",
   "message": "This just happened to me this week. I realized she only wanted me around to have someone to complain to and go places with her because she hates being alone. We had been friends nearly 3 years but the friendship started to sour back in January when she got back with her alcoholic cheating husband. Slowly I started to realize she didn't care about my interests or how I was doing and that we only ever did things she wanted to do. In fact, a lot of things I like she said she didn't understand and they were dumb to her (fair enough I guess?). My last straw though was her telling me that being called dramatic is bad for her mental health. I called her dramatic because she was being dramatic over a lice situation at work (we work in healthcare, it's not uncommon to get an outbreak of lice every once in a while). Our boss told her if she was going to freak out every time she's definitely not in the right profession. She ended up quitting the very next morning through text. \n\n\u0026amp;#x200B;\n\nWell, I had decided to quietly go no contact with her and removed her from all socials. Two days later she realizes this and starts spreading rumors to my coworkers that I was planning to quit with her and that I blocked her on everything. I'm just done with her. If she can talk shit behind my back that easily over me just not talking to her, what else has she said about me? That is not the kind of friendship I want. \n\n\u0026amp;#x200B;\n\nSorry for the long rant.",
   "created_utc": 1691034160,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juknljs",
   "message": "When I answered his texts. He answered back maybe 10%. Or I’d answer and nothing. \n\nI got pissed so I said something and got a song snd dance. Oh! And everyone knows he’s busy. But I expect too much. \n\nI wrote an email over that one. I did try to make a reasonable case for why I was pissed. Lol. Of course I never heard back.",
   "created_utc": 1691034228,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juknwd3",
   "message": "Probably when she was jealous that my boyfriend picked me over her (they had never even spoke she saw him once and said he was hot) and then went around to all of our mutual friends calling me a man stealing whore. So yeah we were done at that point. \nAnyway I ended up marrying the guy and sent her a save the date but no invite. 🤭",
   "created_utc": 1691034389,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juknytl",
   "message": "Was really good friends with this chick for 13 years. She started getting serious with her current boy friend like 3 years ago. She had a stroke and I went to see her. I texted her a week or so after, she never responded. I texted her merry Christmas a few weeks later, she never responded. A few weeks later, I wished her a happy birthday.  She again didn't respond.  I figured she was just going through her typical relationship, where she drops off the face of the earth for a bit and so I have her space.  A year goes by and again, I wish her a happy birthday via text... no response. I figured she just grew apart. Her sister texts me that July saying she doesn't know what happened between my friend and me but asked if I could reach out.  I explained what I've experienced then she stops responding. Two months ago my friend posted a rare snap chat and I messaged her saying I missed her and hope she's alright. She messaged me a few hours later telling me \"you stopped talking to me\". I have a text with time stamp and no reply. I was going to send it to her and try to defend myself but I figured it would just be drama. I've tried reaching out, she never did, but blames me. Frustrating, a little disappointing,  but just dumb. As good of and long of a friendship we had I would think I'd get a friendlier response",
   "created_utc": 1691034426,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juko2o3",
   "message": "She stole my weed pipe I hadn’t even used yet. Asked her about it after seeing her film herself do it on her Snapchat story, she denied it. Blocked her. Wasn’t a very smart cookie clearly, either that or she just didn’t give a shit.",
   "created_utc": 1691034483,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juko3t7",
   "message": "When I realized that people couldn't be bothered to take a minute or less to even say whats up. But let them need my vehicle, or mostly in my life, they need my muscle. Whether to move or handle business. If someone doesn't put effort in as much as I do, than I dont want or need them in my life.",
   "created_utc": 1691034501,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juko6y1",
   "message": "It got boring, so... Yeah ✂️",
   "created_utc": 1691034548,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukoox9",
   "message": "Went through a mentally rough time in school together, lived part of that time together, worked at the same company at desks close to each other, spent many lunches talking her off ledges and having deep conversations, and spent quite a bit of time at her house. I showed up when her stalker ex was waiting outside a school building for her once.\n\nShe got long covid. And has a history of shitty parents doing shitty things and illnesses she's only now getting to figuring out. I was there for all that too. I worried like crazy when she got covid. Her texts got more and more sparse. She told me she wasn't feeling like being sociable and that she likely wouldn't be hanging out anytime with any one. So I worried about that too. I knew she wouldn't show but I tried to help her invited to things and keep checking in. \n\nFound her going to events with a mutual friend on social media. \n\nI feel like a convenience friend. I was only ever there for her to dump her shit on basically. Sucks. She never came to our apartment. Then I got married, no congrats. Didn't come to see our house when we bought one, or meet our new puppy. It just makes me so upset that I put so much time and effort and care in and received basically nothing. If she didn't want to be friends, I'd rather she'd just told me.",
   "created_utc": 1691034815,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukp6sz",
   "message": "Best friend decided he was Tony Fucking Montana. I have kids - I don't need people around them that have an oz of coke on their person.",
   "created_utc": 1691035088,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukp98p",
   "message": "I just saw how manipulative they were, and how lowly I ranked on their friends tier. I’d rather be isolated than be somewhere I’m not appreciated or considered.",
   "created_utc": 1691035126,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpb3a",
   "message": "When he spiraled down so deep into his drug addiction that I could feel him pulling me down with him. Still won’t admit that he has a problem.",
   "created_utc": 1691035155,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpcoi",
   "message": "She tried to accuse me of SA. We were drinking and having a good time because we had not seen eachother in a long time. After a few drinks, I went upstairs into my\nRoom and went to bed after telling her she could take the spare bedroom. And that’s exactly where I stayed. I Was nowhere near drunk, mainly because I am not a fan of hard liquor despite having a high tolerance for it. \nThe next morning, she was getting ready to leave, hugged me goodbye and thanked me for hanging out. Later that day I received a barrage of texts from her accusing me of the SA. After reading the texts, I simply told her that if she truly believed I could do that to her that it’s best if we never spoke again. \nFor a little back story, this person might as well have been my older sister. We’ve known eachother since we were preteens. she’s been through hell and back. To boil\nIt down, let’s just say she’s the kind of person where you have to be careful with what you say and do otherwise you’ll send her into a ptsd attack. \nHowever, despite this she refused to seek out help, and would excuse poor behavior for her past. I loved her dearly I truly truly did, but I refuse to be around a person who only wants to play victim and expects the world to bend to their needs and wants. \nI don’t hate her, I only hope that she realizes what she’s doing isn’t healthy and is costing her people that actually care.",
   "created_utc": 1691035179,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpmmd",
   "message": "He abused his partner and her children, and used her major trauma from being tortured to keep her in line. I did everything I could for him, to take care of her, so she decided to skip the abusive middleman.  🤷🏼‍♂️",
   "created_utc": 1691035331,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpp5d",
   "message": "buddy from high school found out I got my GED and was moving out, and my dad was giving me money for a couple months until I got a stable job. he kept hounding me to pay him to manage my finances.",
   "created_utc": 1691035370,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpvuu",
   "message": "My friend who we shall call overgrown child, he always acted so entitled and always needed the attention of all of us when he slapped my other friend across his face we told him never to contact us again he threw a massive tantrum and broke his water bottle, a year later when he moved away, he stole something of another of my friends.",
   "created_utc": 1691035474,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpyl6",
   "message": "She sucked my boyfriends dick.",
   "created_utc": 1691035516,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukpzjr",
   "message": "When they steal from you.",
   "created_utc": 1691035531,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukq0r3",
   "message": "When I realised I was never getting the money that they owed me back and that they didn’t care they owed it to me. \n\nByyeee!",
   "created_utc": 1691035550,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukqgv8",
   "message": "When I did all the work they took credit for it and not even one time bring it up I did all the fucking work",
   "created_utc": 1691035802,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukqogc",
   "message": "When I realized he and his wife prioritized their failing polycule over their kids’ happiness. The moment you neglect your kids around me, it’s over.",
   "created_utc": 1691035923,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukr4df",
   "message": "She was BPD in a toxic relationship and had 2 kids, one of whom was my own kids age. I allowed her and her kids to crash at my place a couple of times and I helped her navigate self filing custody paperwork. While she was anxiety inducing to be around, my kid was happy to have a friend and her constant panic didn’t bother me too terribly.\n\nUntil she started accusing me of sleeping with her husband and yelling at me for using quotation marks in a text message telling me I was criticizing her and how I was an awful person.",
   "created_utc": 1691036178,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukrhcm",
   "message": "too toxic and not good for my mental health.",
   "created_utc": 1691036388,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukrhu7",
   "message": "My friend of 11 years was upset and I was “hurting him” because I planned to start taking Testosterone and planned to get top surgery. His reasoning: “when we dated you sent me nudes. You were fine with your body then!”. Not to mention the rps we had of me fully transitioned and him sexualizing the hell outa it. \nI took a night away to gather my thoughts and told him our friendship was over. Months later he came back to apologize and say he’s better. I told him good luck on his new friendships. \nStill hurts to think about sometimes.",
   "created_utc": 1691036395,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukrqzu",
   "message": "They were never on time or would say they couldn’t make it minutes before the event starts like seeing a movie or hanging out. I have no tolerance for people who can’t be punctual.",
   "created_utc": 1691036540,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukrxxa",
   "message": "She was living with our other mutual friend and that friend's long term significant other (I'm taking like seven or eight years together). They were both unemployed and she would buy them food, weed and was taking care of all the household bills. Turns they were sleeping together for a year during this time. I just couldn't after that. There were things she'd done to me personally as well but this was my final straw.",
   "created_utc": 1691036652,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukrz6j",
   "message": "Something simple really.\n\nWe were at a restaurant and he said she is pretty cute for an asian chick.\n\nWas just the last straw in a string of casual racism over the years.",
   "created_utc": 1691036673,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukrz8p",
   "message": "Manipulation and gaslighting…..bye bye bitch",
   "created_utc": 1691036674,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juks5s4",
   "message": "Let me count the ways…\n\nHad a friend who was a liar and wanted to be me. One say she even copied and pasted my face onto a pic of herself. Anytime I had something going on, she miraculously had the exact same thing going on as well.\n\nHad a diff friend that was always negative, never anything positive going on, just miserable, like a dark cloud all the time. The last straw was when I had a miscarriage last year, suddenly she was mrs. positivity about how well her pregnancy was going, telling me how she was scared too but thankfully everything was going very well with hers, all while I’m still healing from my D\u0026amp;C.\n\nHad a *different* friend that again, wallowed in self pity. One of those that did terrible shit, would cry about it, and then go right back to doing it for attention. She’d call me crying all hours of the night over one thing or another, yet I couldn’t hold her attention for if I had a normal yet stressful day.\n\nHad a *different* friend who was not there for me whatsoever when I was SA, literally made the most inappropriate comment about it and then did not talk to me for the entire weekend after it happened, yet I tried my best to support her during her times in abusive relationships, helping her to press charges and get a restraining order with one of them. She ended up getting back with the guy and having 2 kids.\n\nLet’s just say I’ve been a giver to a lot of takers.",
   "created_utc": 1691036781,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukscjd",
   "message": "Seeing my old friend group constantly post photos to social media of them out doing things and having fun while I’m sitting at home \n\nI brushed it off at first. But after I made it clear when I was off a few times and still got no invites I just stopped contacting them",
   "created_utc": 1691036895,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juksnf6",
   "message": "When I asked about getting together on the weekend and they declined-they planned to be packing for a two day business trip. \n\nPacking. All day and evening. For two days. \n\nMessage received. Bye.",
   "created_utc": 1691037077,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "juksp5d",
   "message": "I was in middle school and my neighbor who is a couple years younger than me, we were best friends for a few years, then I found out she was getting into some pretty bad stuff but from what I knew it was just a relationship with some stranger online and she told me she was stopping because she had realized how bad and dangerous it was. A week later I was texting her trying to make plans to have a sleepover and I wasn't getting any response which was very unlike her and a few hours later I get a text from her mom (on the friends phone) saying how my friend was grounded for a while and when I asked why all she said is \"I think you know\", I didn't know because her mom had already knew about the online boyfriend and had a talk with her about that weeks prior so I didn't know why this time. Turns out she was selling and trading people's nudes online",
   "created_utc": 1691037105,
   "score": 1,
   "submission_id": "15grgxn"
  },
  {
   "comment_id": "jukt0hy",
   "message": "The only thing they ever wanted to talk about was politics or religion. That's it. Nothing else.",
   "created_utc": 1691037290,
   "score": 1,
   "submission_id": "15grgxn"
  }
 ]
}