{
 "submission_id": "15grz4o",
 "title": "What’s the worst thing you’ve done because you were horny?",
 "selftext": "",
 "created_utc": 1691030953,
 "permalink": "/r/AskReddit/comments/15grz4o/whats_the_worst_thing_youve_done_because_you_were/",
 "score": 206,
 "url": "https://www.reddit.com/r/AskReddit/comments/15grz4o/whats_the_worst_thing_youve_done_because_you_were/",
 "comments": [
  {
   "comment_id": "jukr1sk",
   "message": "I was like, 11, and tried searching for child porn so I could look at kids my age. Thankfully, I found jackshit. I was a bitch.",
   "created_utc": 1691036137,
   "score": 65,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukq6gh",
   "message": "got caught fucking my door in middle school.\n\nI was about 12 at this time and had just recently learned about the 5 knuckle shuffle, thought I could do better than that. I knew penises went in holes, I knew I could remove my doorknob with a screwdriver. thought my parents weren’t home, so I proceeded to take the doorknob out and attempt to violate it, with little success, as one would imagine.\n\neither way, almost exactly 10 seconds from when I started, I hear my mom say, “what are you doing?” in the most disappointed mom voice ever. I walked back into my room, put my pants on, apologized, and put the doorknob back on.\n\nnever mentioned it again, though i’m assuming my dad got a good laugh out of it.",
   "created_utc": 1691035638,
   "score": 162,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "juknlbs",
   "message": "Used menthol aloe Vera gel to jerk off with when I was like 15. The freezing cold sensation wouldn’t go away for awhile afterwards, wouldn’t recommend unless you like simulating banging an ice slime from Zelda.",
   "created_utc": 1691034225,
   "score": 213,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukn7m9",
   "message": "Stole underwear probably my worst",
   "created_utc": 1691034024,
   "score": 202,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukppwy",
   "message": "Got fully nude and laughed at by a hooker before I rejected. 80 gets u nowhere in vegas",
   "created_utc": 1691035382,
   "score": 187,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukuoy4",
   "message": "Masturbated with a hollowed out jalapeño when I was going through puberty cause I thought the spiciness would be fun and no horny 13 year old knows how to use critical thinking and common sense. In my defence it was fun...during the act. The next 5 hours were agony",
   "created_utc": 1691038301,
   "score": 65,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukwbc0",
   "message": "Drive 14 hours to south Florida to have sex with my long distance gf and then turn around and drive 14 hours back on 3 hours of sleep in two days.  My car's check engine light didn't work so I didn't realize I needed oil (destroyed the engine completely) and nearly crashed twice from falling asleep at the wheel.",
   "created_utc": 1691039316,
   "score": 35,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukrea8",
   "message": "hooked up with a dude i just met, we were drunk as fuck so me sneaked in a closet sorta place, we were making out like crazy and i ended up sucking him off, when we finished we came out to join the party, he recognized my last name and turns out we are cousins.",
   "created_utc": 1691036338,
   "score": 230,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukiqek",
   "message": "Made 3 kids",
   "created_utc": 1691031746,
   "score": 75,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukhac8",
   "message": "shoved a cucumber up my asshole",
   "created_utc": 1691031049,
   "score": 2,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukp77z",
   "message": "Slipped on a dildo at 18 and bruised my cervix. Panicked because how do I ask my mom to take me to the ER for this raging pain without telling why and how I bruised my cervix. Thankfully, no ER visit needed, I just dealt with the pain like a true American[aka expensive hhh] And before anyone asks, it wasn't am \"oopsie I slipped on a dick\" joke. I had it on a solid slightly inclined surface and was getting up because it wasn't working for me but my knee or foot slipped and I fell straight back down. Ouch.",
   "created_utc": 1691035094,
   "score": 79,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukhl6q",
   "message": "Nutted inside a chip bag",
   "created_utc": 1691031190,
   "score": 68,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukj1z3",
   "message": "Ask my sister friend to fuck me",
   "created_utc": 1691031900,
   "score": 142,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukjp1i",
   "message": "Stuck my dick in crazy.\n\nThe post-nut clarity gave me a laundry list of \"you dumb fuck\" thoughts. \n\nStarting with \"Why did you bring her to your place?\"",
   "created_utc": 1691032214,
   "score": 209,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukt7j1",
   "message": "This was a long time ago. I (F) was a teenager and used to drive to the cemetery quite often. Well I was sitting in my car and started thinking about a porno I had watched recently. So yeah I masturbated and climaxed right then and there.\n I find this disrespectful and would never do this now.",
   "created_utc": 1691037404,
   "score": 141,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "juky935",
   "message": "Snuck out of the house for some pussy and ended up stranded on the other side of town at 4 in the morning with my phone almost dead and no shoes.\n\nPussy was good though.",
   "created_utc": 1691040579,
   "score": 73,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukx1c9",
   "message": "Got a handjob in the back of her car while her mother was driving",
   "created_utc": 1691039786,
   "score": 70,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukrq58",
   "message": "Smack my coworker ass because of a habit developed by my GF's ass. Horny made my stupid brain thought every asses before my eyes are the same",
   "created_utc": 1691036527,
   "score": 170,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukpayn",
   "message": "I fucked a couch",
   "created_utc": 1691035153,
   "score": 58,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "juktzbj",
   "message": "I sinned and touched myself :(",
   "created_utc": 1691037866,
   "score": 61,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukws6s",
   "message": "Had sex in church twice the same service with a girl I still don't know her name. I was in rehab and Sundays were the only time we were aloud without company at church so yea I saw a girl from the girls side she said she needed some dick so I followed.",
   "created_utc": 1691039620,
   "score": 24,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "juksa7m",
   "message": "Ate my own cum after nutting",
   "created_utc": 1691036855,
   "score": 72,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "juktekm",
   "message": "I was 14-15 staying over at a buddies house before an early hockey game. I went to the bathroom before bed and noticed his older sister's bra and underwear laying on the floor. I smelled and looked at them while getting off then put the underwear in my backpack. \n\nI then threw her bra down the laundry shoot to make it seem like her mom or dad cleaned up after her. \n\nPretty lame to take them but ya know....horny.",
   "created_utc": 1691037518,
   "score": 68,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukq0mm",
   "message": "Ask my dick, he’s the one who did it.",
   "created_utc": 1691035548,
   "score": 117,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukz3ig",
   "message": "Invited a guy over from a dating app, just so he could give me oral. He went down on me for 30+ minutes and wanted nothing in return. I still can't believe I had a random dude go down on me. Luckily he was chill.",
   "created_utc": 1691041133,
   "score": 1,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukh8cb",
   "message": "Sent nudes",
   "created_utc": 1691031023,
   "score": 53,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "juksgud",
   "message": "Got married",
   "created_utc": 1691036967,
   "score": 54,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukusvd",
   "message": "*walks into thread…reads three posts…runs out of thread*",
   "created_utc": 1691038368,
   "score": 74,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "juky3b9",
   "message": "Slept with someone from my small hometown. Now that doesn’t sound that bad but I was horribly bullied in school, I then went away to university and came back for a summer job in forestry. Suddenly guys that wouldn’t look my way were interested. I vowed to ignore them because they had their chance. However after a trip to the pub and few too many Long Island ice teas suddenly that vow went out the window. He was a guy that was always nice to me so it wasn’t like I fucked my high school bully. But man, horny me did not have her act together. And of course EVERYONE found out because dude shared. My lips were sealed.",
   "created_utc": 1691040474,
   "score": 15,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukudkz",
   "message": "Me and my buddy was snooping around his older brothers stuff while they were out, we found his flesh light and condoms, apparently it was recently used cause it was wet inside, buddy slips on condom which was way to big for us and he went to town and nutted, only to find the condom slipped off and he got his bros stuff all over him, I busted out laughing as he was dieing on the inside I passed on my turn lol",
   "created_utc": 1691038105,
   "score": 55,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "juks8ea",
   "message": "Drove a hour and a half during a blizzard on back country roads in a sports car with a crazy chick.",
   "created_utc": 1691036825,
   "score": 42,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "juky52u",
   "message": "Attempted, key word is attempted…to go home with a guy from the bar who I didn’t realize was much drunker than he seemed of course. Got into his brand new 21 Ram TRX (lots of fucking horsepower) and proceeded to drift around a corner when he gave it too much gas, running into a stone pillar in the median, and totaling his truck. I had whiplash and extreme bruising but somehow made it out somewhat unscathed.",
   "created_utc": 1691040507,
   "score": 14,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukrxqr",
   "message": "Shaved my head…",
   "created_utc": 1691036648,
   "score": 27,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukwwa1",
   "message": "Had sex in a bunk bed under somebody else who was (presumably, hopefully, pray to god) sleeping",
   "created_utc": 1691039695,
   "score": 33,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukxu6n",
   "message": "Had sex in a deserted alley at 3am with someone who I just met. Had fun, no issues but don’t ever, ever do that kids!",
   "created_utc": 1691040307,
   "score": 29,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukvkx1",
   "message": "\u0026lt;Censored, censored, censored, censored\u0026gt;.",
   "created_utc": 1691038856,
   "score": 12,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukr1ro",
   "message": "fapped over a porn that was incredible garbage",
   "created_utc": 1691036137,
   "score": 33,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukhpkn",
   "message": "Fucked a public bathroom plunger.",
   "created_utc": 1691031247,
   "score": 60,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jul0nhk",
   "message": "I fucked two different guys in one day because the first one didn’t make me orgasm and I was still horny. It was during my hoe phase, not my proudest moment.",
   "created_utc": 1691042166,
   "score": 1,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukvnj5",
   "message": "Back story( my mom and friends mom known each other from college me and her hang out multiple times a year maybe 8?? They call us cousins since we are the same age and have known each other  since we were 1-2 yo, out of the blue I couldn’t resist it I couldn’t stop so many thoughts rushing over me I just said fuck it I asked if I can make out with her… she wanted too do more then just  that next thing you know 50$ later and a plan b",
   "created_utc": 1691038903,
   "score": 20,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukxaxa",
   "message": "Got scammed literally 15 minutes ago 😑.",
   "created_utc": 1691039961,
   "score": 22,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukwqgr",
   "message": "Dated a girl that had two kids (pregnant at 16 and 20, met her at 26) and I was actually really considering having a serious relationship with her (I was 23 at the time and her ex-husband was a pedo and was in jail when we met -not related- and in the process of shadely getting out of it)",
   "created_utc": 1691039589,
   "score": 9,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukuajd",
   "message": "Got scammed by an obese hooker",
   "created_utc": 1691038053,
   "score": 18,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukt168",
   "message": "Ruby…",
   "created_utc": 1691037301,
   "score": 7,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukrr3w",
   "message": "A couple of 3s. Which adds up to a 6, so not bad.",
   "created_utc": 1691036541,
   "score": 35,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukwm3m",
   "message": "I asked my ex for goodbye sex while we was hugging......she was not happy.",
   "created_utc": 1691039509,
   "score": 6,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukxvxw",
   "message": "I hooked up with a younger coworker on the back of my car .. near his house.. it was great🤭",
   "created_utc": 1691040339,
   "score": 7,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukyavl",
   "message": "Quit my job, drove from Montana to the Oregon California border, and promptly made a baby within a matter of weeks.",
   "created_utc": 1691040612,
   "score": 7,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jul0esu",
   "message": "I was like 22 absolutely raging with hormones. I have had an insane libido literally since I was 3. Legit. I didn't know how or what to do with my dick but I rubbed it on everything and did all sorts of shit until I figured out how to orgasm. I know how young I truly was because aladin was out. \n\nI am a SUPER loyal dude so I'd have never done anything more than this but me and my GF (now ex) lived with this fine ass red head girl. One time I sniffed her panties that were left on the bathroom floor after she showered. They just smelt like detergent and as soon as I did it I was ashamed since I have never done anything weird like that. \n\nYears later and we have children together lol. \n\nI have several bad ones though. \n\nThe same girl who's underwear I sniffed and I were hornily trying to find somewhere to fuck and had nowhere to go because we were staying with family. I snuck into a friends backyard at night and decided we'd fuck in his hammock. She was riding me reverse cowgirl and the hammock broke and I hit my head on the roots under the tree and split my head open. Worst part is I did not tell her about the blood pooling under my head and since it was night she didn't see it. I just wanted to finish =0",
   "created_utc": 1691042009,
   "score": 1,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukwbk5",
   "message": "Jacked off in the woods behind my grandma's house",
   "created_utc": 1691039320,
   "score": 12,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukt5ph",
   "message": "Made a child.\n\nI adore her. She provides such a boost to my mental condition that the knowledge of her conception literally saved me from myself. I can't imagine my life without her. But I deeply regret bringing her into a deeply fucked up world on the precipice of a climatological catastrophe.",
   "created_utc": 1691037374,
   "score": 37,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukwdsh",
   "message": "Made a hole on my matress and fucked it",
   "created_utc": 1691039361,
   "score": 6,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "juky51q",
   "message": "Legitimately thought it would be a great idea around age 11 to use hair gel as lubricant. I figured it was slimey enough to work and i got myself through the rest of my bathroom escapade and cleaned up (like an 11 year old, so not well). I spent three days with a raw, dried out dick. I was peeling bits of gel and skin off the whole time. I could barely pee the first day or so. I switched to shampoo while showering until i grew up and started using lotion.",
   "created_utc": 1691040506,
   "score": 6,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukyd4i",
   "message": "I...I used my mom's vibrator",
   "created_utc": 1691040652,
   "score": 6,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukps5v",
   "message": "Experimented with my fingers up my butt. No lube.",
   "created_utc": 1691035417,
   "score": 20,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukzxl0",
   "message": "Pretty much my entire existence on Reddit 😅",
   "created_utc": 1691041698,
   "score": 1,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jul05tb",
   "message": "Finished before I found the perfect video",
   "created_utc": 1691041850,
   "score": 1,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jul2j1x",
   "message": "When I was 15, I was on a trip with a girl that liked me. She allowed me to finger her the whole bus ride. After we get off the bus ride, her father was there to pick her up and wanted to shake my hand. Bruh I shook his hand without him knowing that was in his daughter.",
   "created_utc": 1691043464,
   "score": 1,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukxqw9",
   "message": "I did an ol' 'American Pie' thing with a custard pie!",
   "created_utc": 1691040247,
   "score": 4,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukzw7m",
   "message": "Gf sucked me off in the back row of a Greyhound bus on I-5.",
   "created_utc": 1691041672,
   "score": 1,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jul0222",
   "message": "Go to horny jail...",
   "created_utc": 1691041781,
   "score": 1,
   "submission_id": "15grz4o"
  },
  {
   "comment_id": "jukypz7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15grz4o"
  }
 ]
}