{
 "submission_id": "15h1w7m",
 "title": "What's the biggest hint you've ever missed from a woman?",
 "selftext": "",
 "created_utc": 1691063184,
 "permalink": "/r/AskReddit/comments/15h1w7m/whats_the_biggest_hint_youve_ever_missed_from_a/",
 "score": 1,
 "url": "https://www.reddit.com/r/AskReddit/comments/15h1w7m/whats_the_biggest_hint_youve_ever_missed_from_a/",
 "comments": [
  {
   "comment_id": "julvdm4",
   "message": "A girl in uni offered to give me a ride home (she must have asked about me cause i never told her where i lived). so i was happy i didn't need to ride the bus, and called all my buddies saying i got us a ride home.\n\nshe wasn't pleased\n\nA guy told me before \" i hope im not interfering or anything\" and i replied \"interfering in what\"",
   "created_utc": 1691063510,
   "score": 52,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julvhok",
   "message": "Biggest one was when she asked me where a pub is on a new years eve and told me 3 times that she doesn't understand when I directed her straight down the street.. only after she left I realized that she wanted me to come with her - at least I ain't the only idiot cause r/datingadviceformen has shit tons of stories like that lol.",
   "created_utc": 1691063569,
   "score": 142,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julxuaq",
   "message": "I have very flexible joints. As a result, I was well known for doing tricks with my hands during my early uni days. Things like bending my fingers backwards to touch the back of my hand, touching my arm with my thumb, bending fingers into a Z shape etc.\n\nI was at a party with classmates and this girl I vaguely knew asked me for a private demonstration of my hands. I was slightly buzzed at the time so I said sure and took her to the kitchen while she giggled. I started doing my usual tricks but I quickly noticed something was wrong because she got this disappointed look on her face. She mumbled something akin to \"ok cool\" and left the party claiming she was tired, leaving me confused for the rest of the night.\n\nIt took me 3 days of sobering up before I realized I had fucked up and by the time I saw her again it was too awkward to talk about.",
   "created_utc": 1691064800,
   "score": 125,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julwd29",
   "message": "A girl once held my hand and I just thought we were friends 💀",
   "created_utc": 1691064034,
   "score": 38,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julwmrh",
   "message": "I should have kissed the girl in the rain. \n\nShe looked up at me, I knew I should kiss her, and I choked.  She broke up with me shortly after. nearly 30 years ago and I can still replay it in my mind.",
   "created_utc": 1691064176,
   "score": 53,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julv3t7",
   "message": "Hair tuck. Too easy to miss",
   "created_utc": 1691063366,
   "score": 1,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julvqmv",
   "message": "Two women, friends, giggling around me at a friends party. I just got there, and sat on the couch. They sat on both sides of me and started talking to me. I was sooo flustered I excused myself to go get a drink. I gathered my thoughts in the kitchen, got a drink, and when i came back, they were leaving. They went to their car, turned around to look at me, and laughed and then left.",
   "created_utc": 1691063702,
   "score": 10,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julwmva",
   "message": "At my community college when she sat next to me she immediately started talking to me. Laughing and giggling and asked if we could study together. I totally didn’t pick up on the vibes",
   "created_utc": 1691064178,
   "score": 66,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julwt9n",
   "message": "She \"forgot\" a scrap of paper at my place and *had* to come and get it.\nI realised it was odd that she scrumped up the super important bit of paper, before I realised she was hitting on me.",
   "created_utc": 1691064271,
   "score": 41,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julzba6",
   "message": "Met 2 girls at the club and we hit it off. After like 30min one of em says “wanna come with us to the car? We need to change?” What I said?! “Nah you guys look good.” \n\nDidn’t know anything was amiss until like 3mo later. I shot upright outta bed and realized my mistake.",
   "created_utc": 1691065543,
   "score": 6,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julzuq4",
   "message": "When I was going through my useless lesbian phase. \n\nShe was literally trying on lingerie, sexy outfits, and sex toys for me. Whoooosh.",
   "created_utc": 1691065809,
   "score": 19,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum055f",
   "message": "In high school. Went over to my friend’s house about a 2 minute walk from my house. Drinking and hanging out. I didn’t realize we would be drinking, so maybe 15 minutes after I got there I said “alright, give me 10 minutes. I’ll be right back. I have a bottle of gin at my house, and I’m gonna go grab it real quick.”\n\nOne of the girls there said she’d come with me. I explained that there was no need. It’s just a few hundred yards away. I’ll just jog down there and be back in 5 minutes. She said she’ll come anyway. I thought it was odd but didn’t think much of it and said, “alright then. Let’s go.”\n\nWe get to my house and go down to my hiding spot in the basement. My parents are gone, so there’s no one else in the house. I grab it, look at her, and straight to her face say “alright, let’s go.” We walk back down to my friend’s.\n\nIt was a couple weeks later that it hit me. She 100% wanted to come with me alone to my parents’ house so that we could hook up. I guess it was because I’d never thought of her like that. She was decent looking but not a stunner. Not someone I’d probably hook up with sober. But I still feel bad about how demoralizing that must have been for her. She sent all the signals short of just jumping me, and it went straight over my head.\n\nWe did end up hooking up at a party a year or so later, so hopefully that gave her some peace about the situation. But yea. I’m not a smart man.",
   "created_utc": 1691065948,
   "score": 12,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum0lo3",
   "message": "Hanging out with a coworker at her apartment, each 19/20ish. Sitting on the couch side by side, she complained that her large breasts were a pain to deal with because of their size, followed by\"...do you want to touch them?\"\n\nI sort of half-juggled them (as though I was comparing the weight involved) and said \"hmm, nice.\"\n\nNot the only signal I missed that night, but probably my defining moment of obvious failure.",
   "created_utc": 1691066172,
   "score": 175,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum0pn8",
   "message": "\"You know I'm single right?\"\n\n\"Yeah,me too.\"",
   "created_utc": 1691066224,
   "score": 30,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum203w",
   "message": "She said, \"I do tarot cards. Just before I came here, I did a reading and it said my night would end with a bang.\"\n\n...yup.",
   "created_utc": 1691066836,
   "score": 147,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum1w6h",
   "message": "Drove every week from PA to Chicago to see a girl I had a crush on. Still lived with her parents, so I never stayed the night.\n\nShe always was flirty, but \"then me\" was oblivious. When I stayed later than usual one night, and I yawned, she said \"you should just stay the night and we can get a hotel room.\"\n\nI said \"nah, I'm good to drive, I'll make it.\" She said, \"no, don't be silly. We can hang out tonight\"\n\nI was in the middle of Ohio when I realized what she meant.",
   "created_utc": 1691066784,
   "score": 206,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum41qa",
   "message": "In highschool I asked a girl to come watch a movie rental with me and some friends.  She was sitting on the floor in front of me, and rubbed her neck saying that her neck/shoulders were sore.  Completely missing the cue to offer a back massage, I got up and offered her a Tylenol.  My buddies ribbed me for that for a long time.  Somehow with my terrible game I still managed to marry her and we have 3 kids now.",
   "created_utc": 1691067801,
   "score": 17,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum1zc2",
   "message": "I had a girl literally just explicitly say she liked me and wanted to date and I assumed she was joking. She was not.",
   "created_utc": 1691066826,
   "score": 84,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3lrh",
   "message": "They say guys always are just thinking about sex, but boy has this thread proven that wrong",
   "created_utc": 1691067594,
   "score": 27,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum0o3g",
   "message": "We were seeing a movie together and she said she was cold. I said \"yeah it's pretty chilly\" and did nothing. Later she said it again, pretty obvious what she wanted. I proceeded to give her my jacket to put around her.\n\nI'm a practical man.",
   "created_utc": 1691066203,
   "score": 135,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum0qrx",
   "message": "A lifetime ago in high school the extremely cute exchange student from Spain sort of cornered me and started asking questions about an upcoming school dance. What is it like? Is it fun? Are you going with anyone?\n\nYnez, if you're out there, I'm sorry. I'm a dope.",
   "created_utc": 1691066238,
   "score": 219,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3m4d",
   "message": "Watching TV in my living room at roughly 2am, in the dark\n\nHer: applying strawberry lip gloss.\n\nMe: why are you putting on lip gloss?\n\nHer: strawberry lip gloss tastes so nice.\n\nMe: haha youre weird\n\nHer: want to taste?\n\nMe: nah I already know what it tastes like\n\nCommence several years of late night self loathing and regret",
   "created_utc": 1691067599,
   "score": 59,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumalpx",
   "message": "In high school, at a party, my crush asked me what kind of guy I'm into.\n\nI described him EXACTLY. **All that was missing was his social security number.**\n\nAnd he just walked away...and apparently told his friend \"sorry man, she's not into you.\"",
   "created_utc": 1691070655,
   "score": 1,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3gqx",
   "message": "Woman I'd been friends with for a year or two, \"I bet you have a beautiful cock ;)\"\n\nMe: \"It's alright, keeps me entertained, lol.\" Then I asked a question about Chinese food.\n\nCouple months after we lost contact, \"Ohh... OH... damn\"",
   "created_utc": 1691067529,
   "score": 30,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum4z0c",
   "message": "Me: \"I really wanna try to sleep with a tall girl, see how it's like.\"\n\nAttractive Girl: \"Well, I'm 6 feet 2\" (I'm about 5 feet 8)\n\nMe: \"Nah, I was thinking about 7 feet tall\"\n\nStill haunts me.",
   "created_utc": 1691068229,
   "score": 166,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3pp8",
   "message": "In class a girl asked if we could study together for a minor quiz at her place.\n\nA friend overhears and asks if he can join us, I say yes immediately before she can say anything.\n\nShe sends us her address and a time. I show up and she answers the door in a bikini. Nobody else at her place. She says she was sunbathing and asks me into her room while she changes. I look away to be polite and then make small talk once she's done.\n\nMy friend shows up 30 minutes later, turns out she told him that the study group started 30 minutes after what she told me.\n\nSigh...",
   "created_utc": 1691067645,
   "score": 147,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum1xgt",
   "message": "A girl I'd been chatting with for a while asked to come back to my hotel room to see my music collection on my laptop.\n\nSo I took her back and showed her my music collection for 30 minutes. That's not a euphemism, I literally did that until she took pity on how clueless I was and basically jumped me.",
   "created_utc": 1691066801,
   "score": 160,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum1vv5",
   "message": "\"So what do you like in a girl, sexually\"\n\n\"I guess what's important to me is a friendship like closeness\"",
   "created_utc": 1691066780,
   "score": 69,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3m8e",
   "message": "Went on a date with a girl and she asked if I wanted to come back to hers and stay over. I thought it was perfect as I had work in the morning and she lived right around the corner. I literally got into her bed, said good night, turned over and went to sleep. About a year later something reminded me of that night and the penny dropped. What a fucking idiot. Edit: a word",
   "created_utc": 1691067601,
   "score": 126,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum20y2",
   "message": "From a women’s perspective- one time in college I told a guy I went to lunch with that I was cold as we were walking back to class he goes, obliviously, “Yeah it’s kinda chilly I guess.  Shoulda brought a jacket.”",
   "created_utc": 1691066847,
   "score": 44,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum47jt",
   "message": "Had a girl I liked on top of me late one night at a party, she literally said \"I want to fuck you.\" Virgin me just thought she was being silly and went to sleep that night.",
   "created_utc": 1691067877,
   "score": 74,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum46ic",
   "message": "\"Hey, wanted to ask if you are free this weekend?. We can make some pasta and tiramisu together. I'll bring the ingredients\".\n\n\"Thanks for the offer, I plan on sleeping all day this weekend\" 🤦‍♂️\n\nShe was an exchange student from Italy.",
   "created_utc": 1691067863,
   "score": 54,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum90b2",
   "message": "Went on a short road trip with a girl from work. When booking hotels for the stay, she said \"Let's book a single room with separate beds; it'll save us money\". I thought that was a good idea and went ahead. \n\nThat evening when we went to bed, I was showing her a YouTube video on my phone and she went \"Make yourself comfy! Why are you sitting on the edge of the bed?\", and raised the comforter - indicating that I ought to slide in next to her in her bed (which I did). \n\nWhen we were chit chatting, I reached out for a bottle of water that was on a table across from her and accidentally brushed her bra strap with my elbow. I apologized and took a gulp of water. She asked \"Is my bra in the way?\". I said \"Nah, I managed to get the bottle, don't worry about it!\".\n\nOne day after the road trip ended, it hit me. \n\nAnd yes, I know I'm an absolute dumbass.",
   "created_utc": 1691070004,
   "score": 1,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3kcs",
   "message": "Had a girl I was dating in high school, we were macking on my bed and I started kissing her neck. She says \"stop that makes me horny\" but in a playful way. Youngster me was like woah no rape from I\n\nEdit: So just an off hand comment gets me 5700 more points than I had 48 hours ago thanks to you all!",
   "created_utc": 1691067576,
   "score": 121,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum8zxz",
   "message": "This was back in high school.  I was super shy.  I had been crushing hard on this girl since freshman year and everybody knew it.  She had thrown hints at me forever and I never acted.  I was insanely good at math.\n\nSo one day as I'm coming out of class she stops me and says that she heard that I'm some kind of math genius and asked me to tutor her.  I asked her what she's going to pay me.  She says very suggestively \"oh don't worry, you'll be well rewarded\".\n\nMy stupid ass responds, no I need actual numbers to know if it's worth my time smh.  I was so dumb lol.",
   "created_utc": 1691070000,
   "score": 1,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumauuf",
   "message": "Woman:\"Would you want to go for a coffee.... At MY place... (at 2 am after a party)\"....\n\n\nYeah still hate myself for it.",
   "created_utc": 1691070757,
   "score": 1,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum1anr",
   "message": "Well obviously I don't know, do I?",
   "created_utc": 1691066499,
   "score": 24,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumd5d4",
   "message": "I was snapchatting a girl from my high school when there was a pause in her response, then she sent me a post shower selfie with her arm just barely covering her tits with the caption “come play zombies” (she had mentioned playing earlier in the convo) and my dumbass goes:\n\n“Do you have xbox live?”\n\n“No” \n\n“Then how will we play?”\n\n“Idk”\n\nHer shirt was back on after that.  \n\nIt’s been 10 years and i’m still kicking myself.",
   "created_utc": 1691071654,
   "score": 1,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum2gl4",
   "message": "What hint???",
   "created_utc": 1691067053,
   "score": 17,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3ie2",
   "message": "Not sure what I missed, but when leaving to go to bed at a staff conference, the lady next to me stood up and shouted, \"I have been chatting to you all night, the least you could do is take me back to your room\". Everyone heard it and she had magically disappeared from the course the next day. I am autistic and have been married for over ten yrs, so it was very unexpected - i figured she was just being super friendly😂",
   "created_utc": 1691067550,
   "score": 17,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum4184",
   "message": "Best friend and I spent a couple of hours talking.\n\nDuring the conversation we talked about her dildo collection, and how a particular one is her favorite. We talked about things that made us horny; one of hers was the smell of cooked garlic. She mentioned she was making a dish that used cooked garlic while we were talking. By the end of the conversation she had stripped, making sure to tell me she was naked; that she was going to take a shower, and that her front door would be unlocked.\n\nShe couldn't have made it any plainer without straight out telling me to come fuck her, and I totally didn't pick up on any of the clues until months later, but by then it was too late.",
   "created_utc": 1691067795,
   "score": 15,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumba8r",
   "message": "I was 19 and good looking back in '86 and I'd always be going on about movies.  There were scads of older woman this office and one was constantly finding me alone and telling me that she'd love to see Blue Velvet but had nobody to watch it with.  I told her it was kind of erotic, but a good thriller.  She came back a week later and said her husband was going to be away if I still had the tape.  \n\nI handed it over and told her to borrow it as long as she wanted.",
   "created_utc": 1691070921,
   "score": 1,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumazs1",
   "message": "I had no idea there were so many clueless guys around here!",
   "created_utc": 1691070808,
   "score": 1,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum7gql",
   "message": "According to a mutual friend a woman was throwing all kinds of hints at me that I didn't get. In my defense a few days before hand she had said she wasn't interested in me in that way. So I was in \"ignore anything I may take as a hint\" mode.",
   "created_utc": 1691069335,
   "score": 9,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumayda",
   "message": "All of them.\n\nMy hint is that men are terrible at picking up hints. Be direct.",
   "created_utc": 1691070794,
   "score": 1,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum6bat",
   "message": "The setting, it's fall 2007 and I'm 17. Rihanna broke out into stardom letting us know we can stand under her umbrella, you could buy a house despite having no income, and Taylor Swift was promoting her music career on MySpace - I’m unsure if Tom was in her top 8.\n\nI was taking the SAT on a Saturday and ran into a girl I had a huge crush on. We worked together at Auntie Anne's in the mall, we'll call her Jess. She let me know that her parents and 7 siblings went on vacation for the weekend but she stayed behind to take the test. \n\nShe invited me over to her home that night to watch a movie. Her house was huge, probably due to the fact that we were upper-middle class and she had 7 siblings. I rang her doorbell and Jess answered wearing yoga pants - brand new at the time and a halter top that exposed her stomach. Jess let me in and let me know that she had to change so I should go up to her room. \n\nI went to the room with her. As Jess undressed, I turned around to be modest. She changed into soffee shorts and a sports bra.\n\nJess suggested we go to the attic to watch a movie on a small tv instead of the living room with the 50 inch Plasma TV because, and I quote, \"Nobody will notice if we make a mess up there.\" \n\nI froze. Jess and I watched The Guardian starring Kevin Costner and Ashton Kutcher. So, we watched the movie. And we kept watching the movie. And then the movie ended. \n\nDespite doing nothing the entire time, Jess asked if I wanted to stay the night with her. If I couldn't be even dumber, I wanted to go home and play Halo 3 on Xbox. So, I went home and played Halo 3. For some strange reason, we never hung out again. Hell, she even quit her job Auntie Anne's less than a month later.\n\nWe’ve run into each other here and there, and we’re both happily married to our partners - she has an adorable little boy and my wife and I are expecting a girl this fall",
   "created_utc": 1691068828,
   "score": 17,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum4o26",
   "message": "In my junior year of high school I was a teachers assistant for a 12th grade AP English course, and sat near this gorgeous, smart, and really nice girl.  We talked a lot and I liked her but always just thought she was way out of my league.\n\nAbout a week after our prom that year I was telling the teacher about how crappy it was because my date kinda ditched me.  He said \"well why didn't you ask ____?\"  When I told him how I never considered it he laughed at me and was like \"Man, you've been missing a lot of easy signals.  Don't worry, you'll get there.\"\n\nApparently being oblivious was my strong suit.",
   "created_utc": 1691068090,
   "score": 5,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum4yiy",
   "message": "One of the bustiest, beautiful and smartest girls I've met in my life leans up against a nearby car and tells me \"You should ask me out.\"\n\nSocially-Inept-17-y/o-Rex: \"Sure.\"\n\nNever did. Only after she started acting angry at me did I realize she had a crush on me the whole time.",
   "created_utc": 1691068222,
   "score": 4,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum6b8h",
   "message": "In high school, I caught a wickedly beautiful classmate sitting at my desk. When she looked up and saw me, she turned bright red and looked extremely embarrassed. Hours later, I realized that someone had written a love note directly on the cover of my notebook. . . And all I thought was “huh, that’s weird”.\n\nTo this day, I think of how stupid I was at 16",
   "created_utc": 1691068827,
   "score": 7,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum8npg",
   "message": "I probably missed almost every hint ever.  I'm pretty dense when it comes to that crap.",
   "created_utc": 1691069857,
   "score": 1,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum4yt7",
   "message": "A girl wrote a poem about me, said \"Joe said he thinks this poem is about you, what do you think?\" And then had me read it. The poem described me exactly and said about wanting to be with the person the poem was referring to and all that, and I still assumed since she was out of my league that the poem wasn't about me.",
   "created_utc": 1691068226,
   "score": 6,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum44jx",
   "message": "\"I think I love you\" \"Me too, thanks\" No joke, I'm fucking deaf\n\nEdit: Fuck you kind stranger",
   "created_utc": 1691067838,
   "score": 9,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumcs5n",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15h1w7m"
  }
 ]
}