{
 "submission_id": "15h1we2",
 "title": "What assumptions do you make about bodybuilders?",
 "selftext": "",
 "created_utc": 1691063200,
 "permalink": "/r/AskReddit/comments/15h1we2/what_assumptions_do_you_make_about_bodybuilders/",
 "score": 22,
 "url": "https://www.reddit.com/r/AskReddit/comments/15h1we2/what_assumptions_do_you_make_about_bodybuilders/",
 "comments": [
  {
   "comment_id": "juluv11",
   "message": "I assume that they can lift heavy things.",
   "created_utc": 1691063233,
   "score": 66,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "juluusn",
   "message": "They got a lot of money to afford that lifestyle",
   "created_utc": 1691063230,
   "score": 55,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julyucx",
   "message": "That they are much better at setting goals and sticking to the plans needed to accomplish them than I am.",
   "created_utc": 1691065311,
   "score": 27,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julzymy",
   "message": "Before I joined the gym I thought they would be egomaniac gorilas grunting at every rep that would kick me out of a machine because I am too skinny.\n\nAfter joining the gym I realized they are super nice (well... the majority at least) people that love to help out newcomers with their exercises. During me first year I was hardly able to lift any sort of weight because I was super skinny and wasnt eating right and I trained alone so I didnt have a friend to spot me. I remember doing bench press and I decided to push myself and try to lift with 10kg  (10 on both sides, just to be clear). As soon as I put my hands on the bar I noticed a small group around me. After doing 6 reps I was almost failing, but one of them rushed behind the bar and kept telling me \"Lets go dude! I know you got one more in ya!\". I was able to do 5 more reps and afterwards the group started cheering, patting me on my back and high-fiving me. It felt super nice.",
   "created_utc": 1691065861,
   "score": 32,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "july3ze",
   "message": "That \"the look\" can't really be achieved without steroids.",
   "created_utc": 1691064938,
   "score": 27,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julv04s",
   "message": "They on da juice",
   "created_utc": 1691063310,
   "score": 23,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julxpcp",
   "message": "I assume they have a massive black hole on their back where their cute lil hands can’t reach past their ridiculous muscles. \n\nSlap a sticker right on the small of a big guy’s back and see him have to rub himself like a bear rubbing a tree to get it off.",
   "created_utc": 1691064727,
   "score": 17,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum3yvw",
   "message": "I assume most body builders are submissive in bed. I've been in the kink scene for a while and I swear, the majority of big muscle dudes (and also women) just want to be tied up and beaten. Maybe they get tired of everyone assuming the opposite, I don't know.",
   "created_utc": 1691067765,
   "score": 5,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julzkv6",
   "message": "Eat a lot of meat",
   "created_utc": 1691065675,
   "score": 4,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum384p",
   "message": "They like to pick things up and put them down.",
   "created_utc": 1691067416,
   "score": 5,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julxk22",
   "message": "assuming that I lift to hide my insecurities\r  \n\r  \nha! I'm just as insecure as before except now my chest is lagging",
   "created_utc": 1691064652,
   "score": 4,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum8b8o",
   "message": "I assume they are into fitness. Other than that, I try not to assume anything about anybody because I don’t know them.",
   "created_utc": 1691069706,
   "score": 4,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julv7s7",
   "message": "That they are into fitness.",
   "created_utc": 1691063425,
   "score": 6,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julx5sr",
   "message": "Despite being one I hate them. Most of them fit the stereotype and give a selfie inprovement sport a bad rep. Especially the influencers that create unachievable expectations. Bodybuilding is a sport you do for you. No one else.",
   "created_utc": 1691064451,
   "score": 7,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julz5ej",
   "message": "💉💉",
   "created_utc": 1691065461,
   "score": 6,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum2mj9",
   "message": "That they will talk about working out all the time.",
   "created_utc": 1691067131,
   "score": 2,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum5wph",
   "message": "Protein farts.",
   "created_utc": 1691068657,
   "score": 2,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum6g8a",
   "message": "Sports pharmacology abuse often leads to early death.\n\nMany supplements don't do what they purport to do.\n\nMany contest bodybuilders spend more money on their sport than they make.\n\nMost male hobbyist bodybuilders often focus on developing their upper bodies and ignore their leg development, making them terribly asymmetrical.\n\nWhile heart attacks are common amongst steroid abusers, kidney problems are also an issue.",
   "created_utc": 1691068888,
   "score": 2,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum9kk4",
   "message": "They have trouble wiping",
   "created_utc": 1691070242,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julvpn6",
   "message": "They're slow.",
   "created_utc": 1691063687,
   "score": 4,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julyjn9",
   "message": "I have 5 “fitness athletes” in my friends list. I have them all on mute because they incessantly fucking post pictures of themselves many times a day. Not only in the gym, even just doing random things like having coffee, walking the dog… all… the… time… \n\nSo I would say: insecure and self obsessed.\n\nEdited to clarify, “fitness athletes” not “fitness models”",
   "created_utc": 1691065164,
   "score": 4,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julvfiu",
   "message": "That they couldn't bring their arms down to touch their sides if they wanted",
   "created_utc": 1691063539,
   "score": 2,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julvupf",
   "message": "vain",
   "created_utc": 1691063762,
   "score": 2,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julvl1w",
   "message": "Small dick",
   "created_utc": 1691063619,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julwtod",
   "message": "They have persistence to do the work that needs to be done to get that strong.",
   "created_utc": 1691064276,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "july1bz",
   "message": "[deleted]",
   "created_utc": 1691064901,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julz68g",
   "message": "For women, past life trauma.  For men, obsessive or past life trauma",
   "created_utc": 1691065473,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum0t11",
   "message": "Smart. They calculate body mass nutrition ratios of carbs and protien and are dedicated to their fitness.",
   "created_utc": 1691066269,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "juluyye",
   "message": "They have little penis",
   "created_utc": 1691063292,
   "score": 0,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum37wm",
   "message": "They're all on steroids, even the ones that claim to be natural.",
   "created_utc": 1691067413,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum63p7",
   "message": "They are secretly gay and/or homophobic. \n\nJust from working in gyms and having a personal trainer who was a body builder and attending events with him and his competitions.\n\nNot all, obviously. And I did turn my trainer around on his original homojeebies* opinion, so, credit there. \n\nThe unironic hysteric backlash to dudes oiling up other dudes, led me to the belief that many of these guys need to sort through their sexuality or learn to manage their emotions. \n\n*homojeebies is a word I made up to account for (actually) straight men and women who aren’t homophobic in the sense that they “hate” or are in mortal fear of gays; but, they low key think it’s icky. They say things like, “Whatever you want to do is your business, but I think it’s just . . . yuck!”",
   "created_utc": 1691068740,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julv1b7",
   "message": "Small pp",
   "created_utc": 1691063329,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julynqj",
   "message": "All of them doing roids, cause there's no \"natural\" way to gain the muscles",
   "created_utc": 1691065220,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julx0vi",
   "message": "Bodybuilding is what they care about most. And a lot have disordered eating unfortunately.",
   "created_utc": 1691064381,
   "score": 0,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum2cpi",
   "message": "Closeted gay.",
   "created_utc": 1691067003,
   "score": 0,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julwcol",
   "message": "I assume they all have ambitions to fuck my wife so I act like a prick around them.",
   "created_utc": 1691064029,
   "score": 0,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julxfz0",
   "message": "They keep fit",
   "created_utc": 1691064594,
   "score": 0,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "july2mr",
   "message": "That they're not on reddit",
   "created_utc": 1691064918,
   "score": 0,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julv1lg",
   "message": "That they don't have a very good taste in women",
   "created_utc": 1691063333,
   "score": 253,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julw7t8",
   "message": "My most shocking assumption is that they probably don't have much of a life.\n\nI work, have a family, hobbies and just about get to the gym three times a week.\nIf you are there every day for hours, something needs to give and most of us need to work. \nSo presumably the rest of the life stuff, must take second place.",
   "created_utc": 1691063958,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julyyql",
   "message": "That they have good discipline but exhibit narcissistic tendencies.",
   "created_utc": 1691065371,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "julzjcw",
   "message": "I assume they are depressed or running from something. That's not necessarily a bad thing, but just what comes to mind.",
   "created_utc": 1691065655,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum02dz",
   "message": "that if they just stop their bodies end worse off than if they never build it up in the first place, they need to \"come down\" in stages.\n\nalso if they do steroids their balls become tiny",
   "created_utc": 1691065911,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum0mp9",
   "message": "In my experience, powerlifters tend to be pretty cool people, while bodybuilders are almost always vain \"I'm better than you\" assholes.",
   "created_utc": 1691066185,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum0qw6",
   "message": "3:\n\n1. They're really disciplined\n\n2. They're on steroids\n\n3. Many of them have some sort of body dysmorphia and are never happy with the way they look",
   "created_utc": 1691066240,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum1of6",
   "message": "They use meat based cement.",
   "created_utc": 1691066684,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum1p6q",
   "message": "They work out a lot.",
   "created_utc": 1691066694,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum1xgl",
   "message": "It's not good to make assumptions",
   "created_utc": 1691066801,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum1zcy",
   "message": "that I never see any of them with children...",
   "created_utc": 1691066826,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum20zq",
   "message": "That they have the persistence to accomplish something very difficult, but it’s misguided. I don’t know if that makes sense.\n\nI completely understand wanting to be super fit. But really, what’s the point with all the huge muscles? You don’t need to get that huge to be in perfect physical condition. Unless you’re making a living from it (99+% aren’t), then what’s the point other than vanity and trying to intimidate others?\n\nI respect them, because it takes a lot of self-discipline and hard work to get really jacked. But I always just think that if they applied that self-discipline and hard work to something else, they could achieve something much more important. Let’s say you’re a surgeon. If you take that same self-discipline and hard work and apply it to your trade, you can become a crazy good surgeon. And I can only speak for myself, but being one of the best at whatever your profession is is infinitely more impressive to me than having huge muscles.",
   "created_utc": 1691066847,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum220j",
   "message": "Most are determined...",
   "created_utc": 1691066861,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum31ed",
   "message": "I think of people who are disciplined. The knowledge on nutrition is hard to learn, much less learn how not to have a big belly from all the food they eat. Consistent working out every day for months/years. What foods to eat and which to avoid is hard enough. If they’re not on steroids or any testosterone enhancers it can be a really hard thing to do. Especially if you look very toned or built a lot of mass",
   "created_utc": 1691067328,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum342w",
   "message": "They usually have muscles I guess",
   "created_utc": 1691067363,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum3mic",
   "message": "I've only known two bodybuilders and both were muscle marys so take from that what you will.",
   "created_utc": 1691067604,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum3opr",
   "message": "Most appear to push their business and the supplements they use on others, and I would say many provide advice they are not qualifed to give; scope of practice is a thing, and it's important to know what you can and can't do.",
   "created_utc": 1691067633,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum3sy9",
   "message": "That they have to have a lot of discipline to work so hard. I mean even with drugs you still have to work out to get that look. and once a week for an hour isnt enough. Several times a week for hours. Thats a hell of a hobby.",
   "created_utc": 1691067688,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum419j",
   "message": "Meat heads, unintelligent.",
   "created_utc": 1691067795,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum469w",
   "message": "Their testicles are either really small or really big, no in between.",
   "created_utc": 1691067860,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum4jlr",
   "message": "Micropenis. Either they are self conscious about their micropenis and engage in body-building to deal with that, or they develop a micropenis after becoming obsessed with bulking and taking anabolic steroids.\n\nIt's usually the skinny lanky guys with monster horse-cocks",
   "created_utc": 1691068032,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum4jze",
   "message": "That they spend a lot of time working on their bodies. I also assume they have really boring diets and that while I'm impressed by their dedication I'd probably not want to try and go for lunch with them.",
   "created_utc": 1691068036,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum54q5",
   "message": "They're named Frankenstein and it's an impressive undertaking to piece everything back together into a working vessel.",
   "created_utc": 1691068302,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum55og",
   "message": "They want people to be impressed that they're tough",
   "created_utc": 1691068314,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum59wx",
   "message": "shrunken testicles and enlarged clitoris.",
   "created_utc": 1691068368,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum5bc6",
   "message": "They're going to call me fat and ugly in their head.",
   "created_utc": 1691068386,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum5e62",
   "message": "They must have a lot of free time.",
   "created_utc": 1691068422,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum5qxa",
   "message": "Real bodybuilders who compete are Type A personality to the max. I have a close friend who used to compete. His diet, even now after his competing years, is extremely clean, and he knows what he needs to eat and when, what supplements to take and when, he MUST exercise multiple times per day to feel like himself, and when he was competing, his whole world revolved around it, even though he had a full time and very demanding job. He would stop whatever he was doing and dig into a tub of food he made specifically for his workout and just shovel it into his mouth, and then go about his day. \n\nSuper nice guy. Never judgmental. Not a meathead rawww I lift weights! No, he's actually brilliant, highly educated, and for whatever reason, that lifestyle of competing just fits him perfectly. Everything has to be just so to win, and that's who he is in all things.",
   "created_utc": 1691068584,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum6knr",
   "message": "That they are very disciplined and must earn more money than me to eat all that food they need.",
   "created_utc": 1691068942,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum6nza",
   "message": "Just like an ancient greek sculpture,  they have great bodies and small dicks",
   "created_utc": 1691068983,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum72ty",
   "message": "I assume they spend a fair amount of time in a gym.  I also assume their diet is more monitored than the average person's.",
   "created_utc": 1691069163,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum75u3",
   "message": "They have no time for anyone but themselves. Their health is secondary to bulk. And in my experience their back was covered in steroid acne and yes they were very small down there",
   "created_utc": 1691069201,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum7nq2",
   "message": "Super gassy from excess protein shakes.",
   "created_utc": 1691069420,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum7q9f",
   "message": "Bald in five years",
   "created_utc": 1691069452,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum8191",
   "message": "Their cardio sucks and they unhealthy",
   "created_utc": 1691069587,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum89aj",
   "message": "Stinky protein poos.",
   "created_utc": 1691069683,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum8evt",
   "message": "They take in a looooootta protein",
   "created_utc": 1691069750,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum8rea",
   "message": "Every time I see a super huge guy in the gym, I’m hit with a moment of jealousy. This moment is brief though because I suddenly realize that every aspect of their life is in some way made to accommodate that look, which isn’t a bad thing, but also isn’t for me.",
   "created_utc": 1691069899,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jum9kye",
   "message": "They look like misshapen clouds and hugging them might feel like hugging a statue",
   "created_utc": 1691070246,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumahha",
   "message": "They're a 100% on gear.\n\nIf me, a random nobody with barely enough fitness experience can get it, it's incredibly ridiculous for me to think that bodybuilders and fitness influencers whose entire livelihoods and hobbies are tied to their musculature aren't currently on a cycle.",
   "created_utc": 1691070608,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumauw9",
   "message": "For for a male bodybuilder I might assume you had self image issues.\n\nFor female bodybuilder I would assume that you have a very large clitoris",
   "created_utc": 1691070757,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumavjv",
   "message": "They have a lot of time to kill.",
   "created_utc": 1691070764,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumavrd",
   "message": "Not the brightest bunch.",
   "created_utc": 1691070766,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumbvjd",
   "message": "Small peen.",
   "created_utc": 1691071154,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumcew0",
   "message": "They know how to eat",
   "created_utc": 1691071367,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumdsmt",
   "message": "Small peepers, overall insecure.",
   "created_utc": 1691071903,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumdx3p",
   "message": "Weird one maybe, but that they're not super creative. How can you spend that many hours to get that jacked up, and also make art that takes years to get good at?\n\nI hope I'm wrong, honestly.",
   "created_utc": 1691071950,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jume1ja",
   "message": "There bodybuilders",
   "created_utc": 1691071998,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jume65m",
   "message": "They are disciplined or at least obsessed with working out",
   "created_utc": 1691072047,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumeu0p",
   "message": "That some of them just want to be held, have their back rubbed and told that everything will be ok",
   "created_utc": 1691072299,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumf9i4",
   "message": "I assume that they are persistent, strong, and are very smart about their health.\n\nEveryone has this idea that bodybuilders are dumb, but I disagree. You really have to know yourself and your body to be able to get muscles like that.",
   "created_utc": 1691072465,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumfosc",
   "message": "They have all that mental willpower",
   "created_utc": 1691072627,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumfq6m",
   "message": "Body dysmorphia, disordered eating, somewhere on the OCD spectrum, likely on gear.",
   "created_utc": 1691072641,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumfsiq",
   "message": "teenie weenies",
   "created_utc": 1691072665,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumfszm",
   "message": "They have a back scratcher to get that one spot they can't reach.",
   "created_utc": 1691072670,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumgmth",
   "message": "Whether or not they use a poop stick or not. \nA Poopstick is a stick to wrap toilet paper around and wipe your ass with because you cannot properly reach the proper area correctly. I knew a guy, and I saw his Poopstick.",
   "created_utc": 1691072988,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumgnrs",
   "message": "Most people assume strong and mean but just strong and nicest guys at the gym",
   "created_utc": 1691072998,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumgomm",
   "message": "After reading some of these comments, I don't think people know that a bodybuilder doesn't have to take roids and they also don't have to be Arnold-sized either.",
   "created_utc": 1691073006,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumgujj",
   "message": "They crush their enemies, see them driven before them and hear the lamentation of their women.",
   "created_utc": 1691073069,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumgv4q",
   "message": "Anger issues or mental instability or even both",
   "created_utc": 1691073075,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumh9bi",
   "message": "They are incredibly disciplined. \n\nThey scare the heck out of me. I always want to walk up to them and tell them how much I admire their physique and tell them that they really look good and I appreciate the hard work they put into fitness. But I’m a sixty-two year old male and I’m afraid that those women would think I’m being creepy and crush me.",
   "created_utc": 1691073224,
   "score": 1,
   "submission_id": "15h1we2"
  },
  {
   "comment_id": "jumhbfb",
   "message": "Tiny junk, drink out of gallon water bottles, take useless supplements.",
   "created_utc": 1691073247,
   "score": 1,
   "submission_id": "15h1we2"
  }
 ]
}