{
 "submission_id": "15h1w7m",
 "title": "What's the biggest hint you've ever missed from a woman?",
 "selftext": "",
 "created_utc": 1691063184,
 "permalink": "/r/AskReddit/comments/15h1w7m/whats_the_biggest_hint_youve_ever_missed_from_a/",
 "score": 106,
 "url": "https://www.reddit.com/r/AskReddit/comments/15h1w7m/whats_the_biggest_hint_youve_ever_missed_from_a/",
 "comments": [
  {
   "comment_id": "julvdm4",
   "message": "[deleted]",
   "created_utc": 1691063510,
   "score": 142,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julvhok",
   "message": "Biggest one was when she asked me where a pub is on a new years eve and told me 3 times that she doesn't understand when I directed her straight down the street.. only after she left I realized that she wanted me to come with her - at least I ain't the only idiot cause r/datingadviceformen has shit tons of stories like that lol.",
   "created_utc": 1691063569,
   "score": 139,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julxuaq",
   "message": "I have very flexible joints. As a result, I was well known for doing tricks with my hands during my early uni days. Things like bending my fingers backwards to touch the back of my hand, touching my arm with my thumb, bending fingers into a Z shape etc.\n\nI was at a party with classmates and this girl I vaguely knew asked me for a private demonstration of my hands. I was slightly buzzed at the time so I said sure and took her to the kitchen while she giggled. I started doing my usual tricks but I quickly noticed something was wrong because she got this disappointed look on her face. She mumbled something akin to \"ok cool\" and left the party claiming she was tired, leaving me confused for the rest of the night.\n\nIt took me 3 days of sobering up before I realized I had fucked up and by the time I saw her again it was too awkward to talk about.",
   "created_utc": 1691064800,
   "score": 240,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julwd29",
   "message": "A girl once held my hand and I just thought we were friends 💀",
   "created_utc": 1691064034,
   "score": 114,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julwmrh",
   "message": "I should have kissed the girl in the rain. \n\nShe looked up at me, I knew I should kiss her, and I choked.  She broke up with me shortly after. nearly 30 years ago and I can still replay it in my mind.",
   "created_utc": 1691064176,
   "score": 241,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julv3t7",
   "message": "Hair tuck. Too easy to miss",
   "created_utc": 1691063366,
   "score": 1,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julvqmv",
   "message": "Two women, friends, giggling around me at a friends party. I just got there, and sat on the couch. They sat on both sides of me and started talking to me. I was sooo flustered I excused myself to go get a drink. I gathered my thoughts in the kitchen, got a drink, and when i came back, they were leaving. They went to their car, turned around to look at me, and laughed and then left.",
   "created_utc": 1691063702,
   "score": 10,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julwmva",
   "message": "At my community college when she sat next to me she immediately started talking to me. Laughing and giggling and asked if we could study together. I totally didn’t pick up on the vibes",
   "created_utc": 1691064178,
   "score": 13,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julwt9n",
   "message": "She \"forgot\" a scrap of paper at my place and *had* to come and get it.\nI realised it was odd that she scrumped up the super important bit of paper, before I realised she was hitting on me.",
   "created_utc": 1691064271,
   "score": 103,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julzba6",
   "message": "Met 2 girls at the club and we hit it off. After like 30min one of em says “wanna come with us to the car? We need to change?” What I said?! “Nah you guys look good.” \n\nDidn’t know anything was amiss until like 3mo later. I shot upright outta bed and realized my mistake.",
   "created_utc": 1691065543,
   "score": 147,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "julzuq4",
   "message": "When I was going through my useless lesbian phase. \n\nShe was literally trying on lingerie, sexy outfits, and sex toys for me. Whoooosh.",
   "created_utc": 1691065809,
   "score": 19,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum055f",
   "message": "In high school. Went over to my friend’s house about a 2 minute walk from my house. Drinking and hanging out. I didn’t realize we would be drinking, so maybe 15 minutes after I got there I said “alright, give me 10 minutes. I’ll be right back. I have a bottle of gin at my house, and I’m gonna go grab it real quick.”\n\nOne of the girls there said she’d come with me. I explained that there was no need. It’s just a few hundred yards away. I’ll just jog down there and be back in 5 minutes. She said she’ll come anyway. I thought it was odd but didn’t think much of it and said, “alright then. Let’s go.”\n\nWe get to my house and go down to my hiding spot in the basement. My parents are gone, so there’s no one else in the house. I grab it, look at her, and straight to her face say “alright, let’s go.” We walk back down to my friend’s.\n\nIt was a couple weeks later that it hit me. She 100% wanted to come with me alone to my parents’ house so that we could hook up. I guess it was because I’d never thought of her like that. She was decent looking but not a stunner. Not someone I’d probably hook up with sober. But I still feel bad about how demoralizing that must have been for her. She sent all the signals short of just jumping me, and it went straight over my head.\n\nWe did end up hooking up at a party a year or so later, so hopefully that gave her some peace about the situation. But yea. I’m not a smart man.",
   "created_utc": 1691065948,
   "score": 12,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum0lo3",
   "message": "[removed]",
   "created_utc": 1691066172,
   "score": 135,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum0pn8",
   "message": "[removed]",
   "created_utc": 1691066224,
   "score": 237,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum203w",
   "message": "[removed]",
   "created_utc": 1691066836,
   "score": 10,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum1w6h",
   "message": "[removed]",
   "created_utc": 1691066784,
   "score": 129,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum41qa",
   "message": "In highschool I asked a girl to come watch a movie rental with me and some friends.  She was sitting on the floor in front of me, and rubbed her neck saying that her neck/shoulders were sore.  Completely missing the cue to offer a back massage, I got up and offered her a Tylenol.  My buddies ribbed me for that for a long time.  Somehow with my terrible game I still managed to marry her and we have 3 kids now.",
   "created_utc": 1691067801,
   "score": 171,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum1zc2",
   "message": "[removed]",
   "created_utc": 1691066826,
   "score": 36,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3lrh",
   "message": "[removed]",
   "created_utc": 1691067594,
   "score": 167,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum0o3g",
   "message": "We were seeing a movie together and she said she was cold. I said \"yeah it's pretty chilly\" and did nothing. Later she said it again, pretty obvious what she wanted. I proceeded to give her my jacket to put around her.\n\nI'm a practical man.",
   "created_utc": 1691066203,
   "score": 42,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum0qrx",
   "message": "[removed]",
   "created_utc": 1691066238,
   "score": 239,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3m4d",
   "message": "[removed]",
   "created_utc": 1691067599,
   "score": 88,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumalpx",
   "message": "In high school, at a party, my crush asked me what kind of guy I'm into.\n\nI described him EXACTLY. **All that was missing was his social security number.**\n\nHe went off and apparently told his best friend “sorry man, she’s not into you.”\n\n**EDIT:** Just remembered one other story. My brother was once driving a girl home when she said she thought he had a flat tire. She insisted they pull over and check. She directed him onto a narrow road surrounded by trees. He got out, checked it out and said it was fine. He was about to put the car in gear when she said \"as long as we're here, let's just hang out a bit.\" **He asked what she wanted to do. She said \"I'm sure you'll think of something\" and put her hand on his stomach. He chuckled and said \"that tickles\"...before removing her hand and adding \"come over to my house, you can check out my Xbox!\"** Then he put the car in gear and drove home.\n\nAnyway, he finally figured it out that same night, when he told me she was \"acting funny\" and I clued him in. The next day he found her, first thing in the morning, and said \"let me give you a ride home, I thought of something for us to do.\" \n\nNot the smoothest line, but it got the job done.",
   "created_utc": 1691070655,
   "score": 20,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3gqx",
   "message": "Woman I'd been friends with for a year or two, \"I bet you have a beautiful cock ;)\"\n\nMe: \"It's alright, keeps me entertained, lol.\" Then I asked a question about Chinese food.\n\nCouple months after we lost contact, \"Ohh... OH... damn\"",
   "created_utc": 1691067529,
   "score": 49,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum4z0c",
   "message": "[removed]",
   "created_utc": 1691068229,
   "score": 32,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3pp8",
   "message": "[removed]",
   "created_utc": 1691067645,
   "score": 132,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum1xgt",
   "message": "A girl I'd been chatting with for a while asked to come back to my hotel room to see my music collection on my laptop.\n\nSo I took her back and showed her my music collection for 30 minutes. That's not a euphemism, I literally did that until she took pity on how clueless I was and basically jumped me.",
   "created_utc": 1691066801,
   "score": 217,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum1vv5",
   "message": "[removed]",
   "created_utc": 1691066780,
   "score": 23,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3m8e",
   "message": "[removed]",
   "created_utc": 1691067601,
   "score": 183,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum20y2",
   "message": "From a women’s perspective- one time in college I told a guy I went to lunch with that I was cold as we were walking back to class he goes, obliviously, “Yeah it’s kinda chilly I guess.  Shoulda brought a jacket.”",
   "created_utc": 1691066847,
   "score": 44,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum47jt",
   "message": "Had a girl I liked on top of me late one night at a party, she literally said \"I want to fuck you.\" Virgin me just thought she was being silly and went to sleep that night.",
   "created_utc": 1691067877,
   "score": 99,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum46ic",
   "message": "\"Hey, wanted to ask if you are free this weekend?. We can make some pasta and tiramisu together. I'll bring the ingredients\".\n\n\"Thanks for the offer, I plan on sleeping all day this weekend\" 🤦‍♂️\n\nShe was an exchange student from Italy.",
   "created_utc": 1691067863,
   "score": 43,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum90b2",
   "message": "Went on a short road trip with a girl from work. When booking hotels for the stay, she said \"Let's book a single room with separate beds; it'll save us money\". I thought that was a good idea and went ahead. \n\nThat evening when we went to bed, I was showing her a YouTube video on my phone and she went \"Make yourself comfy! Why are you sitting on the edge of the bed?\", and raised the comforter - indicating that I ought to slide in next to her in her bed (which I did). \n\nWhen we were chit chatting, I reached out for a bottle of water that was on a table across from her and accidentally brushed her bra strap with my elbow. I apologized and took a gulp of water. She asked \"Is my bra in the way?\". I said \"Nah, I managed to get the bottle, don't worry about it!\".\n\nOne day after the road trip ended, it hit me. \n\nAnd yes, I know I'm an absolute dumbass.",
   "created_utc": 1691070004,
   "score": 167,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3kcs",
   "message": "Had a girl I was dating in high school, we were macking on my bed and I started kissing her neck. She says \"stop that makes me horny\" but in a playful way. Youngster me was like woah no rape from I\n\nEdit: So just an off hand comment gets me 5700 more points than I had 48 hours ago thanks to you all!",
   "created_utc": 1691067576,
   "score": 121,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum8zxz",
   "message": "This was back in high school.  I was super shy.  I had been crushing hard on this girl since freshman year and everybody knew it.  She had thrown hints at me forever and I never acted.  I was insanely good at math.\n\nSo one day as I'm coming out of class she stops me and says that she heard that I'm some kind of math genius and asked me to tutor her.  I asked her what she's going to pay me.  She says very suggestively \"oh don't worry, you'll be well rewarded\".\n\nMy stupid ass responds, no I need actual numbers to know if it's worth my time smh.  I was so dumb lol.",
   "created_utc": 1691070000,
   "score": 85,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumauuf",
   "message": "Woman: \"Would you want to go for a coffee.... At MY place... (at 2 am after a party)\"....\n\n\nYeah still hate myself for it.",
   "created_utc": 1691070757,
   "score": 239,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum1anr",
   "message": "Well obviously I don't know, do I?",
   "created_utc": 1691066499,
   "score": 153,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumd5d4",
   "message": "I was snapchatting a girl from my high school when there was a pause in her response, then she sent me a post shower selfie with her arm just barely covering her tits with the caption “come play zombies” (she had mentioned playing nazi zombies earlier in the convo) and my dumbass goes:\n\n“Do you have xbox live?”\n\n“No” \n\n“Then how will we play?”\n\n“Idk”\n\nHer shirt was back on after that.  \n\nIt’s been 10 years and i’m still kicking myself.",
   "created_utc": 1691071654,
   "score": 67,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum2gl4",
   "message": "What hint???",
   "created_utc": 1691067053,
   "score": 17,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3ie2",
   "message": "Not sure what I missed, but when leaving to go to bed at a staff conference, the lady next to me stood up and shouted, \"I have been chatting to you all night, the least you could do is take me back to your room\". Everyone heard it and she had magically disappeared from the course the next day. I am autistic and have been married for over ten yrs, so it was very unexpected - i figured she was just being super friendly😂",
   "created_utc": 1691067550,
   "score": 149,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum4184",
   "message": "[removed]",
   "created_utc": 1691067795,
   "score": 109,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumba8r",
   "message": "I was 19 and good looking back in '86 and I'd always be going on about movies.  There were scads of older woman this office and one was constantly finding me alone and telling me that she'd love to see Blue Velvet but had nobody to watch it with.  I told her it was kind of erotic, but a good thriller.  She came back a week later and said her husband was going to be away if I still had the tape.  \n\nI handed it over and told her to borrow it as long as she wanted.",
   "created_utc": 1691070921,
   "score": 196,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumazs1",
   "message": "I had no idea there were so many clueless guys around here!",
   "created_utc": 1691070808,
   "score": 1,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum7gql",
   "message": "According to a mutual friend a woman was throwing all kinds of hints at me that I didn't get. In my defense a few days before hand she had said she wasn't interested in me in that way. So I was in \"ignore anything I may take as a hint\" mode.",
   "created_utc": 1691069335,
   "score": 9,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumayda",
   "message": "All of them.\n\nMy hint is that men are terrible at picking up hints. Be direct.",
   "created_utc": 1691070794,
   "score": 19,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum6bat",
   "message": "The setting, it's fall 2007 and I'm 17. Rihanna broke out into stardom letting us know we can stand under her umbrella, you could buy a house despite having no income, and Taylor Swift was promoting her music career on MySpace - I’m unsure if Tom was in her top 8.\n\nI was taking the SAT on a Saturday and ran into a girl I had a huge crush on. We worked together at Auntie Anne's in the mall, we'll call her Jess. She let me know that her parents and 7 siblings went on vacation for the weekend but she stayed behind to take the test. \n\nShe invited me over to her home that night to watch a movie. Her house was huge, probably due to the fact that we were upper-middle class and she had 7 siblings. I rang her doorbell and Jess answered wearing yoga pants - brand new at the time and a halter top that exposed her stomach. Jess let me in and let me know that she had to change so I should go up to her room. \n\nI went to the room with her. As Jess undressed, I turned around to be modest. She changed into soffee shorts and a sports bra.\n\nJess suggested we go to the attic to watch a movie on a small tv instead of the living room with the 50 inch Plasma TV because, and I quote, \"Nobody will notice if we make a mess up there.\" \n\nI froze. Jess and I watched The Guardian starring Kevin Costner and Ashton Kutcher. So, we watched the movie. And we kept watching the movie. And then the movie ended. \n\nDespite doing nothing the entire time, Jess asked if I wanted to stay the night with her. If I couldn't be even dumber, I wanted to go home and play Halo 3 on Xbox. So, I went home and played Halo 3. For some strange reason, we never hung out again. Hell, she even quit her job Auntie Anne's less than a month later.\n\nWe’ve run into each other here and there, and we’re both happily married to our partners - she has an adorable little boy and my wife and I are expecting a girl this fall",
   "created_utc": 1691068828,
   "score": 17,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum4o26",
   "message": "In my junior year of high school I was a teachers assistant for a 12th grade AP English course, and sat near this gorgeous, smart, and really nice girl.  We talked a lot and I liked her but always just thought she was way out of my league.\n\nAbout a week after our prom that year I was telling the teacher about how crappy it was because my date kinda ditched me.  He said \"well why didn't you ask ____?\"  When I told him how I never considered it he laughed at me and was like \"Man, you've been missing a lot of easy signals.  Don't worry, you'll get there.\"\n\nApparently being oblivious was my strong suit.\n\nEdit: Probably should have added that she graduated shortly after and I never had the chance to ask her out, etc.",
   "created_utc": 1691068090,
   "score": 222,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum4yiy",
   "message": "One of the bustiest, beautiful and smartest girls I've met in my life leans up against a nearby car and tells me \"You should ask me out.\"\n\nSocially-Inept-17-y/o-Rex: \"Sure.\"\n\nNever did. Only after she started acting angry at me did I realize she had a crush on me the whole time.",
   "created_utc": 1691068222,
   "score": 4,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum6b8h",
   "message": "In high school, I caught a wickedly beautiful classmate sitting at my desk. When she looked up and saw me, she turned bright red and looked extremely embarrassed. Hours later, I realized that someone had written a love note directly on the cover of my notebook. . . And all I thought was “huh, that’s weird”.\n\nTo this day, I think of how stupid I was at 16",
   "created_utc": 1691068827,
   "score": 18,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum8npg",
   "message": "I probably missed almost every hint ever.  I'm pretty dense when it comes to that crap.",
   "created_utc": 1691069857,
   "score": 1,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum4yt7",
   "message": "A girl wrote a poem about me, said \"Joe said he thinks this poem is about you, what do you think?\" And then had me read it. The poem described me exactly and said about wanting to be with the person the poem was referring to and all that, and I still assumed since she was out of my league that the poem wasn't about me.",
   "created_utc": 1691068226,
   "score": 6,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum44jx",
   "message": "\"I think I love you\" \"Me too, thanks\" No joke, I'm fucking deaf\n\nEdit: Fuck you kind stranger",
   "created_utc": 1691067838,
   "score": 9,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumcs5n",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum7btu",
   "message": "So my boyfriend is so bad at flirting, we have known each other for 15 years and we were always just friends. We always had secret crushes on each other but we’re always dating other people. \n\nAbout 6 years ago after we had both been single a while, I had invited him over to go in the hot tub with me. Legit had candels lit and everything, not a move was made. Even after we got out I was sitting with him on the couch I put my head in his lap, he legit went nonverbal. \n\nThe next week was new years and when the ball dropped I kissed him and all he could say was ‘you are interested in being more than friends?!’ Lol DUH \n\nThat was 5 years ago, now we are getting married next year :)",
   "created_utc": 1691069276,
   "score": 111,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum3oty",
   "message": "Girl came over to mine in a very skimpy outfit. Thought she literally came over to hang out. When she was leaving she literally said \"you could have told me to do anything you wanted and I would have done it\"\n\nTaking hints has never been my strong suit, thought about that fuck up for quite a while afterwards haha",
   "created_utc": 1691067634,
   "score": 21,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum7ihy",
   "message": "After a photo session with a close friend, she said I can stay the night when I said I'm tired.\nI obliged, thinking it's just a nice offer.\n\nDuring the night I woke up slightly because she had grabbed my hand, put it on her hip and pressed her butt against me.\nI was still groggy and didn't think much of it and went back to sleep.\n\nIn the morning she turned around to face me, got her face so close her nose was touching mine... And again, I went back to sleep.",
   "created_utc": 1691069356,
   "score": 24,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum79n7",
   "message": "I worked as a bouncer 25ish years ago. One evening a slightly older and extremely attractive lady came back to the club and said that her car would not start. Eventually after chatting for about 15 minutes and just before closing I offered her a ride, out of sheer politeness and because I saw her tip bartenders really really well. When we got to her house she asked if I would like to get some water. I said okay and went into her house. After the glass of water she asked if I would not mind unbuttoning the top hook on the back of her blouse because she couldn't reach it. I did. Then I said thank you very much, have a good evening... and left.\n\nNever saw her again even though she was a fairly consistent customer until that evening.\n\n\nIt clicked only years later when a date asked me to help with the top hook on the back of her blouse. I must have stood there for solid minute with an absolutely idiotic look on my face because she kept asking me what's wrong what's wrong what's wrong.",
   "created_utc": 1691069248,
   "score": 26,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum7hjh",
   "message": "A girl legitimately said to me \"take me home\" as we parted ways. \n\nI thought she was joking. \n\nJudging by the fact we had just finished kissing eachother (passionately) only a few minutes beforehand I think it's safe to say she wasn't.\n\n#brainonairplanemode",
   "created_utc": 1691069345,
   "score": 161,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum7jmh",
   "message": "Didn’t miss it from a woman but it’s funnier this way.\n\nI used to work at a bar running poker tournaments \u0026amp; would usually talk to a regular.  He would occasionally say we should go out for drinks \u0026amp; I said yeah but we never made plans.  He would touch me, comment on what I was wearing, etc., this went on for months.  Then one day he brought one of the waitresses a cake for her birthday \u0026amp; I made a crack about him trying to pick her up.  Her response, “Hank’s gay, don’t you know that?”  Suddenly it all made sense.",
   "created_utc": 1691069370,
   "score": 231,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum8qpc",
   "message": "My first weekend of college a girl asked me if I wanted to wrestle her in my dorm.\n\n\n\nI wrestled her in my dorm.  Nothing more.",
   "created_utc": 1691069892,
   "score": 149,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum9hp3",
   "message": "She sat in front of me, wearing only undies, with her legs spread wide open, I didn't know what she wanted, I reached for ciggies and started smoking instead. This was back in 1999, nobody would believe this story if I told it offline so I am trying my luck on Reddit in 2023.",
   "created_utc": 1691070209,
   "score": 16,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum9w1s",
   "message": "Sometime back in the early 2000's\nHaving dinner with some colleagues..\n\n\nShe: Hey r/madasaturtle , Ive never been with a Dutch Guy.......\n\nWhat I should have said: \n\"Well, lets do something about that tonight.\"\n\nWhat I said instead :\n\"Me neither \"🤦‍♀️",
   "created_utc": 1691070369,
   "score": 57,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumatl3",
   "message": "Back when I was a teenager…\n\nI was with a girl, in her bedroom, alone late at night. She was lying on the bed looking at me, telling me how handsome I was and how much she liked my eyes.\n\nI said thank you, and that it was late, and that I should get going. To this day I cannot explain my actions because this girl was absolutely gorgeous and I had crushed on her for years. She was my friends younger sister. I think my brain just short-circuited and refused to believe that she was telling me the truth, and I was so nervous that I had no idea what to do. It hurts to think about.",
   "created_utc": 1691070743,
   "score": 241,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumfg0d",
   "message": "I either missed them all, or there weren't any to miss to begin with.",
   "created_utc": 1691072535,
   "score": 5,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum8eh3",
   "message": "Just reminded of another one.  \n17 years old and I'm home from college for a few months and an old school friend (beautiful blonde etc.) asks me over to catch up.\n\nSo I get to her house and she's dressed in the skimpiest black bikini I've ever seen. We get in the hall and she's 'Would I like a beer', so I say sure.   \nI ask her about the bikini and she's 'sunbathing' except it's overcast. \n\nWe go through to her lounge and I suddenly notice that it's very quiet with none of her family around and she confirms that's 'she's all alone'.\n\nShe sits on the settee, so I sit on the chair. 'Come over here so you're next to me' she pats the cushion. So I sit next to her. 'Can you have a look at my neck as it's a bit sore'.\n\nSo I lift up her beautiful long blonde hair and gently rub her neck which she literally starts purring at.  \n'Just kiss my neck a little' so I start nibbling her neck, then she suddenly says 'You should stop, that's really turning me on'  \n\n\nDumbass me:  'Ohh ok then' and I went and sat back on the chair.  \n\n\nHer look of total distain was well deserved and it wasn't until I was heading home that I finally clicked what was going on with the empty house, bikini, neck thing.\n\nIn my defence I was a total novice with the fairer sex at this point, something I made up for with a vengence over the following years at University.... :D",
   "created_utc": 1691069745,
   "score": 126,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumnk3c",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumfe9z",
   "message": "I was on a night out with a group of college friends and we ended up meeting more people from our college whilst out at a club. We formed into one big group and I was introduced to a few new people who were friends of friends. One girl approached me and told me she had asked about me and found out we had the same name. I was kinda drunk and said something along the lines of “aw no way that’s so cool” and she said “yeah, and lucky for you I really enjoy moaning my own name.” And I just kinda “… :)” I was asked the next day by a mutual why I rejected her and then I had the lightbulb moment 🥲",
   "created_utc": 1691072516,
   "score": 48,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumc9t7",
   "message": "said she got a new dildo, and asked if i wanted to see it. I thought it was funny, said yes, and she pulled ip a video on her phone of her railing herself w it. I thought she was just really committed to a bit or smth so i laughed my ass off and proceeded to have a running joke w her abt it for a year until she told me she had dropped the most aggressive and obvious hint ever.",
   "created_utc": 1691071311,
   "score": 32,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "juma8n0",
   "message": "A girl I had a crush on sat on my lap because she had white shorts on and didn't want grass stains.  She then sighed and said she wished someone would ask her to prom.  I assured her that someone would.  And it never occurred to me that I had a shot.  Years later she punched me for being so oblivious.",
   "created_utc": 1691070511,
   "score": 234,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumaxzh",
   "message": "This was back in college.  Went to a talent show with a girl had a great time. We stop by a bar for a quick drink. It was a little past midnight. I walked her back to her apt she asked me \"would you like to check out my place and have coffee\" and I said \"I am not a big fan of coffee. This was fun night, let do it again\"\n\nAs George Costanza said \"Coffee is not coffee.  Coffee is sex\"",
   "created_utc": 1691070789,
   "score": 163,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumgyvq",
   "message": "While in high school I was at a gig with a bunch of people from my year and had been standing next to this girl the whole night chatting.\n\nAnother guy asked us if we were together and she replied 'not yet' and I laughed and replied 'good one' while she looked at me weirdly.\n\nI had such a crush on her as well.",
   "created_utc": 1691073114,
   "score": 51,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum6pij",
   "message": "In college, my roommate’s gf was in town and I mentioned to a girl how I was going to have to leave the room. She tells me “my roommate is staying at a friend’s, you can stay with me.”\n\nI take her up on it. We get there and I go to sleep in the roommates bed. She asks what I’m doing and motions for me to get in her bed. I join her and proceed to talk about everything and anything until 5am when I say “welp, they’re probably asleep maybe I should go back to my room.” And I left.\n\nI realized the next day when she asked my roommate if I was weird",
   "created_utc": 1691069002,
   "score": 147,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumf90y",
   "message": "\"I'm a virgin\"\n\n\"Aw I'd sleep with you\"\n\n\"Aw thanks\"",
   "created_utc": 1691072460,
   "score": 114,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "juma8so",
   "message": "A year after high school, a girl I'd been crushing on for over a year and knew through mutual friends invited me over her (parents') place to...watch Smallville?...and at one point said her ass was kinda sore and needed a massage. Proceeded to roll over in her skimpy volleyball shorts and look at me. I nervously gave her like the most clinical and non-sexy butt massage you could imagine. I was nervous and didn't want to seem desperate because this girl was out of this world gorgeous and I just felt very average. She just felt way out of my league and I always thought we were \"just friends.\" To make things worse, that same night, a little later, this one girl from work who had a crush on me called me and I was awkwardly chatting with her trying to end the convo, and girl I was crushing on came in and jumped on my lap and started smiling, laughing, and grinding, knowing it'd make it more awkward for me. Just thought she was being playfully annoying and didn't imagine she might actually like me. Watched Smallville and went home. \n\nA year before this, she asked me to her prom (she went to a different school). And a year or two AFTER all this, she was visiting me and my sister (she was a mutual friend to us both) after we moved to a different state. She stayed over at my place and one evening said that she always had the biggest crush on me and doesn't know why I never reciprocated her advances. She then got up, looked over at me, and walked into her bedroom. I just...assumed she was tired and going to bed. I missed every single opportunity that could ever opportune on God's green earth.",
   "created_utc": 1691070512,
   "score": 23,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum909c",
   "message": "Literally telling me which hotel she was staying at alone, where she was going to drink the bottle of wine I’d recommended to her, alone. In the hotel she’d specified, named and geolocated after asking me where a girl visiting town alone might go for a night out. I was out of the supermarket and half way home with my shopping when I stopped, frowned and thought “hang on a minute!”",
   "created_utc": 1691070003,
   "score": 183,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum5hjz",
   "message": "Had a friend at University who was a best friend, except that I was too dumb to see that I was more than a friend to her.  \nShe was smart, beautiful, funny, very patient and we gelled straight away. \n\nWe always went to parties together, spent the evening with different people circulating, had different partners over the years, but she would always insist I saw her home safely and of course I just kept on missing those obvious signs.  \nRoll on three years and everyone is going their different ways and we go out for one last night for a drink, have a great time and I see her home as usual except this time she doesn't hold back and basically drags me into her bedroom.  \n\n\nHonestly I was so shocked, so dumbfounded that my 'best friend' who happened to be female  fancied the ass off me that it totally wrong footed me and we literally couldn't do anything apart from collapse into a fit of giggles and fall asleep in each others arms.  \n\n\nI never saw her again but every now and then I think back to that time and wonder what if I wasn't such a dumb-ass, would it have failed, would it have been amazing and life happy ever after?  \n\n\nWho knows apart from in an alternative universe.",
   "created_utc": 1691068467,
   "score": 3,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jumffa8",
   "message": "HOT girl just after HS, my exes friend actually, mentioned how my car had a huge back seat and called it a great “sex car”.  She said it more than once, more than twice! I just remember thinking there was no way she’d be that into me while I was also banging her other friend. Totally missed that shot. 🤦🏻‍♂️",
   "created_utc": 1691072527,
   "score": 71,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum7uu4",
   "message": "In highschool I invited two of my friends to hang out at my place for a few days when my parents were gone. One morning around 11AM they literally tried to break in my room to come in bed with me but I had locked the door and was feeling like sleeping in. So yeah I missed some \"Banging the door\" level of subtlety.No regrets.",
   "created_utc": 1691069509,
   "score": 65,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "jum817j",
   "message": "The literal girl of my dreams. We went out and I showed her this cool place with a gazebo and lights. We made out and she hopped on and said something about taking her panties off. I said that would probably hurt her against my jeans and it was cold. She hopped off and I took her home. Her and my coworker were friends so the next day I went to work and my coworker frantically asked why I didn’t have sex with her. And I was just like “I didn’t know it was on the table” so obviously I’m an idiot AND she went and talked to other people. It’s been like 13 years and I STILL regret it…\n\nEdit: tons of grammar errors while typing\n\nEdit 2: I guess for clarification I should add that the girl was in a dress that night, so it would have been super easy.\n\nEdit 3: I should also add that as I was thinking about this more I remembered that about 3 years after the first missed opportunity I worked with girl number 1’s sister, who was also an absolute smoke-show. She’d always try on little swimsuits and skimpy clothing for me at work. One day after work I was invited to her place and she said “let’s go out to eat and if you’re still hungry I’m sure I can find something else for you to eat” and I said “I already ate supper and I’m not hungry any more but maybe another time” so not only did I miss out on the girl of my dreams I also missed out on her hot younger sister…",
   "created_utc": 1691069587,
   "score": 68,
   "submission_id": "15h1w7m"
  },
  {
   "comment_id": "junk79c",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15h1w7m"
  }
 ]
}