{
 "submission_id": "15hs8re",
 "title": "In your college what did the most popular kid grow up to be?",
 "selftext": "",
 "created_utc": 1691130862,
 "permalink": "/r/AskReddit/comments/15hs8re/in_your_college_what_did_the_most_popular_kid/",
 "score": 84,
 "url": "https://www.reddit.com/r/AskReddit/comments/15hs8re/in_your_college_what_did_the_most_popular_kid/",
 "comments": [
  {
   "comment_id": "juqan1l",
   "message": "There was a popular kid in college? My university had like 20,000 people.",
   "created_utc": 1691132077,
   "score": 229,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqa8j6",
   "message": "She was Russian, rich and fucking gorgeous. Shes a cook in a carehome. Still stunning.",
   "created_utc": 1691131780,
   "score": 49,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juq93m4",
   "message": "He deadass became a binman.",
   "created_utc": 1691130931,
   "score": 79,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqc2j1",
   "message": "I don’t know about the whole college - but certainly the most popular person in the theatrical department ended up being an A lister. Some people just have ‘it’.",
   "created_utc": 1691133159,
   "score": 25,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqc36r",
   "message": "Most of the people I knew in college have grown up to be alcoholics.\n\nGood functional folks, good jobs, etc. But most of the friend group liked the bar more than the average person.",
   "created_utc": 1691133173,
   "score": 37,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqdhyq",
   "message": "It is actually quite sad. Due to the stress on keeping up appearances he started to abuse pills, and now living on the streets",
   "created_utc": 1691134265,
   "score": 13,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juq9cpy",
   "message": "45th USA president",
   "created_utc": 1691131116,
   "score": 240,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqcmyt",
   "message": "Well it’s been 5 years since we’ve graduated, while the rest of us common folks have been stable in our jobs this girl has switched from one hospital to another and is constantly looking for new places because she doesn’t like the “working environment” last month she tried to get me to pass her CV to my manager because she heard good things about my hospital and I know she’s passing her CV’s around to my other friends.",
   "created_utc": 1691133594,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqeoul",
   "message": "Had some minor roles in Hollywood movies and a leading role in a Netflix production recently. (as a German guy)",
   "created_utc": 1691135194,
   "score": 8,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqgk9c",
   "message": "What is this, high school?",
   "created_utc": 1691136652,
   "score": 26,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqgqn6",
   "message": "Orthopedist, no joking potential here",
   "created_utc": 1691136792,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqhlr6",
   "message": "There was this guy I knew who was part of a fraternity. You'll be pretty surprised to find out his name at the end. His family was extremely well off, and that's pretty much all I know. My best friend happened to be in the same fraternity and they were planning a party to celebrate a game the football team had won. I was helping set up and in turn got to stay for the party. About two hours in, he pumped into me from behind and made me spill my drink all over my shirt. He helped me clean it up and we made small talk. How things were with classes and whatnot. But then we didn't stop talking, and one topic just rolled right onto the next. Eventually I asked him about his family and what they did to be so rich like everyone had talked about. He confided in me and said that his dad owned a law firm, but they had to file for bankruptcy due to some under the table stuff he wouldn't talk about. So they were about to lose pretty much everything. He didn't know if he'd be able to continue with college. I felt for him and asked him what he planned on doing. He said we was most likely going to drop out and work. Do delivery services when he's not at work. Try to save up as much money as he could to help his family. And a month later, he did just that. I decided to follow him on Instagram and we talked every so often after that. Eventually he was able to save enough money to start a career in music. He would book smaller gigs at bars. One day, someone heard a couple of his songs and wanted to give him a bigger opportunity. And that's how he got to where he is today. He is the one, the only. Joe Mama.",
   "created_utc": 1691137459,
   "score": 250,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqhs7j",
   "message": "Isn't all this \"Popular Kid\" thing more for Highschool ? Haven't been to college but I'd assume you grow out of that phase...",
   "created_utc": 1691137603,
   "score": 15,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqirc7",
   "message": "He works as a real estate agent. Has come down to earth since we graduated and went from a guy on a pedestal to a very friendly lad. Last year he sold my house and I've been doing his accounting for 3 years.",
   "created_utc": 1691138373,
   "score": 10,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqiye2",
   "message": "In prison because he had pounds of meth in his room he was selling so the DEA(?) busted his shit down one day.",
   "created_utc": 1691138527,
   "score": 8,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqkdnl",
   "message": "Oddly enough, one became a drug addict. and another popular chemist🤓",
   "created_utc": 1691139643,
   "score": 4,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqjhbg",
   "message": "Lucky you! At my college, the squirrels were more popular than any of us humans.",
   "created_utc": 1691138945,
   "score": 6,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqizii",
   "message": "That guys dead wife",
   "created_utc": 1691138551,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqmazm",
   "message": "This was far before my time, but one becamw President.",
   "created_utc": 1691141141,
   "score": 255,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqmvcn",
   "message": "I went to the adult education side, so my class ranged from 20 to 45 in age. \n\nThe lady who THOUGHT she was the most popular, ended up as a special needs assistant at some school. We studied to become chefs.",
   "created_utc": 1691141584,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqncsx",
   "message": "Must've been a legendary hide-and-seek player then! 🕵️‍♂️🎉",
   "created_utc": 1691141958,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqnzi6",
   "message": "Do colleges have popular kids? I don't even remember my friends from college.",
   "created_utc": 1691142441,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqp14y",
   "message": "Convicted of hit and run, insurance fraud, and evidence tampering\n\nhttps://en.m.wikipedia.org/wiki/Thomas_W._Druce",
   "created_utc": 1691143228,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqpd5x",
   "message": "I went to art school so of the two “popular” guys in my program that I just looked up, one (whose parents owned a winery) started his own marketing company and lives in SF? The other is an incredible artist, and does comics. Last I heard of the latter is that he sold a story he wrote to be turned into a play. First guy I could care less about but the second was just SO GOOD, even though he was a douchebag in college. I think he mellowed out a lot, I ran into him at an arts festival and he invited me to visit where he lived but I was like what… you barely talked to me in college and bullied people, like hell I’m gonna travel across the country to do that. Still admire his art tho.",
   "created_utc": 1691143481,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqqkgy",
   "message": "An electrician. Im an electrician. Lol",
   "created_utc": 1691144366,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqqv6p",
   "message": "Arrested by the military because they took part in protests against the coup.",
   "created_utc": 1691144578,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqqxej",
   "message": "An ordained Jesuit priest, apparently. Just googled the dude. Wild.",
   "created_utc": 1691144622,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqvuw2",
   "message": "No such thing as \"the popular kid\" at college but Purdue had a couple \"famous\" people milling about when I was there in the early aughts.\n\n\nKyle Orton ended up playing for a couple teams in the NFL. One time I ran into him at a party and he tried to hit on my friend. Shit you not, this is what he said to her:\n\n\\*Kyle sits down on couch next to friend\\*\n\nK: \"Hey, you wanna feel my ARM?\" (said while flexing)\n\nFriend: \"Uhm, no?\"\n\nK: \"Wanna feel my CHEST?\"\n\nF: \"Ew, NO!\"\n\nK: \"Can I feel yours?\"\n\nDude was entirely on autopilot for that routine as if it had ever worked for him before. Wasn't even paying attention to her rejections. He might've had a bit of a drinking problem.\n\n\nAlso, Kal Penn's cousin was at Purdue so Kal would visit sometimes. This was after 'Van Wilder' but before 'Harold \u0026amp; Kumar' so he wasn't that big of a deal but he'd still draw a small group of people wanting to high-five \"Taj\".",
   "created_utc": 1691147878,
   "score": 3,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqs68z",
   "message": "23000 people at my school, if there was a most popular kid most likely I never saw him.",
   "created_utc": 1691145499,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqv2n4",
   "message": "He became quarterback of the Denver Broncos",
   "created_utc": 1691147392,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqve43",
   "message": "He died while we still in college, the kind of boy who seems grown up, all the pretty girls into him, he was giving that hype and has a band of cool boys always with him .. one day he and his friends somewhere in public in our small city were getting drunk with a hooker doing nasty stuff always in public, got chased by the police and he threw himself in the river though he could swim but he drawned being drunk .. RIP",
   "created_utc": 1691147588,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqvltq",
   "message": "Didn't.",
   "created_utc": 1691147722,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqvnc9",
   "message": "Not in college yet but the popular kid in my high school died of a heroin overdose in summer of 2021 didn't know him all that well but from what i could tell he was a dickhead",
   "created_utc": 1691147747,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqvpyi",
   "message": "President of one of the US Federal Reserve Banks.",
   "created_utc": 1691147792,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqw1we",
   "message": "kevjumba",
   "created_utc": 1691147996,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqyfhr",
   "message": "Must've been popular with the squirrels on campus!",
   "created_utc": 1691149384,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqyycw",
   "message": "Mother of 3",
   "created_utc": 1691149679,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqz5z5",
   "message": "six NBA Finals Most Valuable Player (MVP) awards, ten NBA scoring titles (both all-time records), five NBA MVP awards, ten All-NBA First Team designations, nine All-Defensive First Team honors, fourteen NBA All-Star Game selections, three NBA All-Star Game MVP\n\n...and the list goes on",
   "created_utc": 1691149798,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqzi88",
   "message": "International DJ",
   "created_utc": 1691149984,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "juqzxsq",
   "message": "A politician's mistress. They even had to put her aunt and uncle as her child's parents on paper to avoid conflict.",
   "created_utc": 1691150215,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "jur1k1h",
   "message": "Editor of the school paper. General provocateur. One of those \"I'm just asking questions\" folks and filled the paper with nothing with but crass jokes that he thought were \"edgy.\"\n\nThe last report of him sounds like an episode of Unsolved Mysteries: \"Last seen getting off the bus and entering an adult bookstore.\"",
   "created_utc": 1691151059,
   "score": 1,
   "submission_id": "15hs8re"
  },
  {
   "comment_id": "jur1oqo",
   "message": "She became a model, opened her own modelling agency and married Jay Baruchel.",
   "created_utc": 1691151128,
   "score": 1,
   "submission_id": "15hs8re"
  }
 ]
}