{
 "submission_id": "15hvpl7",
 "title": "What is the most disgusting thing you did willingly?",
 "selftext": "",
 "created_utc": 1691142846,
 "permalink": "/r/AskReddit/comments/15hvpl7/what_is_the_most_disgusting_thing_you_did/",
 "score": 116,
 "url": "https://www.reddit.com/r/AskReddit/comments/15hvpl7/what_is_the_most_disgusting_thing_you_did/",
 "comments": [
  {
   "comment_id": "juqpr62",
   "message": "Clinic visit because I had a c-section wound that was infected.  I didn’t realize how infected until the doctor told me that he was going need to cut me open right there in the clinic.  ‘But we are in the actual hospital, can’t we go to an OR to the emergency department?” I frantically asked!?  A 20 year old mother, the father already absent a few weeks in.  \n\nThe doctor injected a local into the areas around my wound, went and got a tray of tools and a nurse.  When they came back in the room I was scared and freaking out, especially since I have always had a horrible history with severe strep infections multiple times a year mostly throat and ear but tooth socket, face, and knee as well.  \n\nThe doctor grabbed a scalpel and cut me open along the c-section wound.  Unfortunately if I looked at him I had a rather good view of everything reflected in his glasses.  I could see the infection was to a cottage cheese consistency in places, he could pick it up with his fingers and scoop it out.  That is how he got much of it out, with his fingers.   I was hospitalized for the infection, they couldn’t close the wound again, it had to close on its own, which took months.  \n\nIt was decades ago but I can feel it (again) as I type this.",
   "created_utc": 1691143767,
   "score": 161,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqswsp",
   "message": "I licked several marble park benches in my college days. There was a time I felt like I had to lick anything shiny and smooth",
   "created_utc": 1691145999,
   "score": 176,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqt6bn",
   "message": "Well, willingly because I am not a jerk. \n\nBeware, shit story ahead. \n\nI helped with cleaning out a yacht overflowing with feces. Someone of our mates was stupid enough to take a huge dump in boat toilets instead of going out on the land (we was  anchored few metres from natural beach). It lead to, surprisingly, toilet being clogged. It started to overflow terribly and apparently, the dude tried to flush it several times, only making it worse.\n\nWe had to make a chain of people, passing to each what we called the shit bucket and empty it through side of the boat.\nIt took a long time.\n\nThankfully, it wasn't me who had to dive under water to  get to the toilet output and unclog it with a fucking toothbrush! We didn't have anything more suitable.\n\nOh, the funny times.\n\nI could smell feces all over the boat for next three days.",
   "created_utc": 1691146177,
   "score": 82,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqu2bs",
   "message": "When I was in the depths of my heroin addiction I used water from a puddle on the side of the road to shoot up.",
   "created_utc": 1691146756,
   "score": 254,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqtgb6",
   "message": "Sh*tting my pants in school and my dumbass 7 yo brain thought it will be a good idea to clean it with... MY SHOES!! And so i desperately tried to clean that sh*t, and it failed (obviously)",
   "created_utc": 1691146358,
   "score": 77,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqyuba",
   "message": "When I was 6 or 7, I was staying the night at a friend's house and had explosive diarrhea in the middle of the night. Only after finishing and trying to flush, I remembered his parents telling me not to use that toilet as it was out of order.\n\nI then spent the next 30-40 minutes slowly scooping the liquid shit out of the toilet that wouldn't flush (with my bare hands) into the trashcan. \n\nThen I washed my hands thoroughly and went back to bed. His parents found the diarrhea filled trashcan the next morning, no doubt by the smell, and had a stern but heartfelt talk with me.\n\nThat was almost 30 years ago and I'm still disgusted by it lmaoooo.",
   "created_utc": 1691149616,
   "score": 202,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqxmnz",
   "message": "went to sleep with my dog in my room.   \nwoke up to what felt like dirt in my bed so i got out of bed, still groggy as fuck, and stepped in some slimy substance which caused me to slip back into my bed where there was a dried piece of dog shit that i was sleeping with. nearly instantly woke up from the fall and very quickly realised that my dog had shit herself, in my bed, and in about 14 different locations on my carpet. i spent like 5 hours that day cleaning up dog shit out of my carpet after taking a shower.   \nMy poor dog was fed something the previous night that caused her to shit her brains out all over my room. As a germaphobe, one of if not the worst day of my life",
   "created_utc": 1691148929,
   "score": 206,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqownq",
   "message": "On two separate occasions I've cleaned up my girlfriend and her puke. The first time she puked in bed while we were sleeping and the second time I got up to go to the bathroom in the middle of the night and I found her passed out on the bathroom floor in a puddle of her own puke. And yes, both times I washed all the sheets, I mopped the floors and I helped bathe her and I took care of her. And although that might seem gross to most people, when it's someone that you love and care about than you don't look at it in that way.\n\n(Edit: Since someone was asking, on both occasions she was drunk)",
   "created_utc": 1691143134,
   "score": 153,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqwsc9",
   "message": "In high school, I was the weird awkward loner kid. \n\nI was offered a crisp 20$ to take one bite out of a piece of pizza from the garbage bin.\n\nI ate the whole slice.",
   "created_utc": 1691148434,
   "score": 79,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqsrri",
   "message": "I came home drunk as skunk from the pub with a curry, half way through the curry I vomited onto plate. I ate the rest of my curry and the vomit",
   "created_utc": 1691145907,
   "score": 86,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqv9dl",
   "message": "On two occasions I had a guy piss in my ass.",
   "created_utc": 1691147508,
   "score": 165,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqt9zu",
   "message": "Licked my exes (partner at time) asshole",
   "created_utc": 1691146244,
   "score": 50,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqtz1x",
   "message": "I hurled and simultaneously pooped myself at a house party. \n\nWas drunk at a halloween party and went out back to smoke a huge cannon of a joint with some new friends I made. So very stoned. Everybody went back in except for me and the one friend I came there with. He pulls out a pipe and we smoke a bowl. I started coughing so hard that I ralphed. Lost total control of my sphincter and could feel shit running into my shoes. Friend asks if I'm okay and I reply \"No. I shit my pants\". He laughs but he sees real quick that I'm serious. Luckily, he's the real mvp and got my stuff and we ubered home immediately (we were roommates). It was chilly out so in the time it took to get my stuff, it had kinda solidified making the uber trip home somewhat less dicey. So yeah a bit of a shitshow lolll",
   "created_utc": 1691146697,
   "score": 59,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juquh7h",
   "message": "Hmm. Accidentally swallowed a dog tag off of a dog collar that we were using for a drinking game, and then promptly went to the bathroom, puked it up into the toilet and washed it off, and we continued to use it for the game.\n\nAlso I ate a massive cobweb for $50 once. I was poor, and they didn’t say how I had to eat it. Turns out, when you roll that fucker into a ball, it’s tiny.\n\nI have other answers that top these by a fair margin but I worry about digital footprint.",
   "created_utc": 1691147021,
   "score": 22,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqopzb",
   "message": "Shat on a piece of paper and threw it over a fence over looking a primary school",
   "created_utc": 1691142993,
   "score": 39,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqsfs4",
   "message": "Pissed IN a vagina.",
   "created_utc": 1691145681,
   "score": 23,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juquy4j",
   "message": "Crawled on a canal that had sewage + foodwaste + god knows what else .",
   "created_utc": 1691147316,
   "score": 131,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqydd0",
   "message": "diapers of my child. every day. every night. every morning",
   "created_utc": 1691149350,
   "score": 15,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqz3fy",
   "message": "Eating popcorn off the movie floor, I'm a vacuum at that, and I'm still doing it, to this day.",
   "created_utc": 1691149759,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqzbhi",
   "message": "When you got kids, that list gets a bit too long.",
   "created_utc": 1691149882,
   "score": 102,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur0e3m",
   "message": "When I was working till late when I would get home if I was particularly tired and hungry I would just pull out a can of soup,  pull the lid and eat it from the can cold",
   "created_utc": 1691150458,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur0y3m",
   "message": "deep cleaned a mcdonalds grill. has not been cleaned in a year. the amount of build up and gunk was insane.never eat fast food",
   "created_utc": 1691150758,
   "score": 23,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur0zi2",
   "message": "Swallow it",
   "created_utc": 1691150778,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur18f5",
   "message": "I've asked and let many ladies sit on my face within hours of meeting them. I'm addicted.",
   "created_utc": 1691150891,
   "score": 22,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1b8w",
   "message": "This was around 2nd or 3d grade around Christmas time.\n\nAt my school, we had this really wonderful Advent-time at school. We would sit in a dimmed-light room, the teachers would light some candles, and we'd sing Christmas songs, get some ginger bread cookies, one child would get to place a piece in a homemade Christmas-crib as an advent calendar, and we'd watch an episode of this wonderful Christmas-show we have in Norway, called Jul i Blåfjell.\n\nIt was THE highlight of my day, and it was so cosy and nice and I loved it.\n\nOne day, I was sitting in the back, and I start to get really bad stomach cramps. And I feel really sick. And I puke. My whole mouth is filled with puke. But I keep it shut, and instead of going to the toilet or anything, I swallow it and do not say anything to anyone, because I didn't want to get sent home from school. \n\nTldr: I swallowed my own puke because I didn't want to get sent home from school.",
   "created_utc": 1691150932,
   "score": 16,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1el2",
   "message": "Change bed sore dressings. Wounds down to the bone. Horrid smell, lots of sloughing off rotten tissue, the works. Somebody had to do it.",
   "created_utc": 1691150980,
   "score": 58,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqr5f5",
   "message": "Anal sex.",
   "created_utc": 1691144781,
   "score": 3,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqudmg",
   "message": "When I was living alone, I got really sick one time. I ended up getting food poisoning. In the middle of the night after like a whole day of barely eating anything and just throwing up and pooping all day, I felt like throwing up. I seriously couldn’t even bring my own body up and I ended up throwing up besides my bed. I genuinely thought I’m gonna pass out and die in that moment. I wiped my face and went back to sleep. The next morning, in that sick and dehydrated state, I had to clean it up. That was the most exhausting and disgusting thing I’ve done.",
   "created_utc": 1691146957,
   "score": 47,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqpjvk",
   "message": "On the first time, when my wife slept at me, she got drunk and pucked in my bag. I cleaned it.  \n\n\nOne my ex cheated me. When it turned out I didn't say anything. I convinced her to go for a walk in the forest. I drove her to a tourist bench, we walked, and then at the end I got her excited, we had sex on the bench. After sex, I said I would get tissues from the car. I got into the car and drove away. In retrospect, it was a pretty disgusting act.",
   "created_utc": 1691143616,
   "score": 4,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqs4ag",
   "message": "Fuck 60-80yo men for $$$$$ 😩",
   "created_utc": 1691145461,
   "score": 4,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqtv0h",
   "message": "Ate cheese from the ground dropped by a stranger",
   "created_utc": 1691146626,
   "score": 2,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqu9yz",
   "message": "Oh! The other day at work I had to clean up diarrhoea. It was in the patient bathroom. It was on the floor, splashed up onto the walls and all over the toilet. We had to remove the actual toilet seat to clean it properly because it got into the screw part that keeps the toilet seat attached. Absolutely putrid.",
   "created_utc": 1691146891,
   "score": 237,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqyetg",
   "message": "Scooped a colony of maggots out of the ground in an outdoor animal enclosure with my hand",
   "created_utc": 1691149373,
   "score": 203,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqts2w",
   "message": "Date or even associate with my exs",
   "created_utc": 1691146571,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqti7i",
   "message": "I once fucked my ex in our front garden and we live opposite a school.",
   "created_utc": 1691146392,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqwo7b",
   "message": "Dated my ex boyfriend for a year.",
   "created_utc": 1691148366,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqyj2f",
   "message": "Not disgusting in the typical sense but when I was young I was mentally ill due to a lot of childhood trauma and I was an asshole to a lot of people.",
   "created_utc": 1691149440,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqtr6d",
   "message": "Disgraced Κουλα infinetelly",
   "created_utc": 1691146555,
   "score": 0,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqu51d",
   "message": "My sis was taking too long on the toliet so i pissed in corner of my room",
   "created_utc": 1691146804,
   "score": 186,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqx2b3",
   "message": "i got stuck in the stall of a public toilet as a kid, i tried banging the door and nobody was outside to help me get out. ended up crawling under the floor. yikes.",
   "created_utc": 1691148598,
   "score": 6,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqy0ws",
   "message": "Tased myself because my sister in law let me do it to her and I felt bad",
   "created_utc": 1691149153,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqzisg",
   "message": "Suxk off my mums uncle",
   "created_utc": 1691149992,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur04v5",
   "message": "Pooped in a urinal at a frat house just because",
   "created_utc": 1691150321,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqw15b",
   "message": "OP’s mom, but she was really sweet afterwards so…",
   "created_utc": 1691147983,
   "score": 254,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqy0z2",
   "message": "I had a fight with my friend and we stopped talking 😞",
   "created_utc": 1691149154,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqop9y",
   "message": "Stole a pencil from this one yute shit haunts me styll",
   "created_utc": 1691142978,
   "score": 254,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqvzkj",
   "message": "I gave this guy I was casually seeing a bj in a church parking lot with a park in the background. It was vacant that day. We both lived with our parents at the time so we had to hide.",
   "created_utc": 1691147957,
   "score": 255,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqzu9u",
   "message": "Fucked a fat girl missionary",
   "created_utc": 1691150163,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqvknj",
   "message": "I drank one those school concoctions that almost everyone made in middle school where you mix all your food and drinks at lunch and has to be one of the worst things I’ve tasted",
   "created_utc": 1691147701,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqyesx",
   "message": "make out with Emily",
   "created_utc": 1691149373,
   "score": 15,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqz1jq",
   "message": "I took a shot of the notorious jungle juice for a vape, and it was definitely not my proudest moment.\n\nI was working as a bar-back in a busy venue, and we had a plastic bucket with a colander on top that we threw all of the goodies into before putting them in a glass-washing machine.\n\nThis was a chunky, watery mixture of leftover liquid from different types of ales, lagers and stouts, Guinness foam, finished pornstar martinis and other cocktails, and pressed smoothies.\n\nOne of the other bar-backs dared me to and said he would give me an elf bar, so I grabbed a shot glass from a shelf, took the colander off, scooped up the goop with passion fruit bits floating around and downed it.\n\nI'm surprised that it didn't make me sick 😂",
   "created_utc": 1691149729,
   "score": 126,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqzedb",
   "message": "Cleaning up half rotten pig parts off the deck of a ship in my bare hands because no one else could stomach the smell when we were taking garbage off the ship. I don't know why I didn't smell the ammonia in that moment, but I knew it needed to be removed or we wouldn't be going home any sooner by crying over it. \n\nJust navy things.",
   "created_utc": 1691149926,
   "score": 211,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqzrvz",
   "message": "Smoke.",
   "created_utc": 1691150128,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqzvgp",
   "message": "Well, i wont name names, but in my defense, i was horrifically drunk, and she was desperate and preyed on me.",
   "created_utc": 1691150181,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juqzxgs",
   "message": "Ive eaten spicy food on a dare",
   "created_utc": 1691150210,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur0mki",
   "message": "My ex convinced me to stick a finger up his bum. He's got chrohns disease.  \n\nI was disgusted with myself for saying yes.",
   "created_utc": 1691150586,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur0qks",
   "message": "Lick a friend's sock while she was wearing it. The worst part was I offered to lick it...",
   "created_utc": 1691150645,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur0ui9",
   "message": "Put my big toe in a crack whores pussy... well in all fairness... she put it in there.  I may have been toe raped",
   "created_utc": 1691150705,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur19gk",
   "message": "[deleted]",
   "created_utc": 1691150906,
   "score": 204,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur19ou",
   "message": "Reading your username",
   "created_utc": 1691150909,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1cwl",
   "message": "Got married. I saw sense though and divorced the pos",
   "created_utc": 1691150956,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1eft",
   "message": "Oh boy, well, let me tell you about the time I willingly tried to impress my friends by eating a triple-layered, extra-spicy, mystery-meat sandwich they concocted at the local food festival. I thought, \"How bad could it be?\" Famous last words, right?\r  \n\r  \nAs I took the first bite, my taste buds went into shock, and my face turned every shade of the rainbow. My friends laughed so hard they nearly fell off their chairs! It was like a volcano erupted in my mouth, and my eyes watered like I was watching the saddest movie ever made.\r  \n\r  \nBut wait, it gets worse! The sandwich was so gigantic that I had to open up like a python trying to swallow its prey. Ketchup and mustard were splattered everywhere, and I looked like a walking condiment disaster.\r  \n\r  \nAfter that whole spectacle, I realized I was more of a \"plain cheeseburger and fries\" kind of person.",
   "created_utc": 1691150978,
   "score": 10,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1fob",
   "message": "Shat in my pants..lol...(school days tho).  :)",
   "created_utc": 1691150996,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1kh9",
   "message": "Her name was Rachel. Sadly I did her willingly.",
   "created_utc": 1691151065,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1kjz",
   "message": "Giving oral to a partner while having a sore throat and lots of phlegm 🤢",
   "created_utc": 1691151066,
   "score": 181,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1p9i",
   "message": "Disgusting in the \"WHY WOULD YOU DO THAT?!\" way but I am ashamed and embarrassed about this and know people will think this is fucked but here goes:\n\nWhen I was 15, a very, VERY horny teenager, I was watching a film with my Dad, lying down. A hot woman was on the screen and I got an erection. I had my hands down my pants and I started having a wank. I THOUGHT I was being subtle, I didn't think he would notice but... I was right next to him. He just said:\n\"What are you doing down there?\" in a tone that translated as:\n\"Why are you doing that? Stop!\"\n\nI obviously stopped, I said nothing, I tried to come up with an excuse like I was scratching my balls or anything but like it was SO obvious that J had nothing and said nothing.\n\nThis was 9 years ago and neither of us has acknowledged it. I hope he has forgotten, knowing my Dad it is possible but like.... I hate that this happened.\n\nThis is the most embarrassing moment of my life and I am telling it here because I will take it to the grave, I will never tell anyone about this.",
   "created_utc": 1691151136,
   "score": 214,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1t80",
   "message": "Took a mat shot",
   "created_utc": 1691151194,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1tlu",
   "message": "stay alive despite everything in me saying i should not.",
   "created_utc": 1691151199,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1v6r",
   "message": "Used to do a goo slap on people from different schools it's basically knocking one out into your hand and slapping it on someone else looking back can't believe we did shit like that but when you're 12 year old at the time and being egged on was funny 🤣",
   "created_utc": 1691151222,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1v71",
   "message": "Ate food off the floor after the 5 seconds",
   "created_utc": 1691151222,
   "score": 199,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1yt4",
   "message": "In 3rd grade a girl I had a crush on offered me a cool mechanical pencil in class if I dragged my tongue across the entire classroom floor. I did it twice and she didn't give it to me; she also didn't date me when I asked her out. I guess I was down bad in 3rd grade.",
   "created_utc": 1691151276,
   "score": 112,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur1yzt",
   "message": "I grew up on a farm. Apparently stuff I thought were just normal chores is considered repulsive.",
   "created_utc": 1691151279,
   "score": 165,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur22zz",
   "message": "Yo momma",
   "created_utc": 1691151338,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur23jt",
   "message": "Probably not the worst thing, but:\n\nI recently had a MOHs surgery in my doctor's office. He deadened up everything and cut into my thigh.\n\nSome people would be horrified and grossed out, but I thought it would be interesting to see what I looked like on the inside. So I enjoyed the show while the doc worked.\n\nIt was amazing. I love the way he nonchalantly grabbed a blob of fat and threw it in the trash while he was talking to me. Surprised that the fat looked like a crystal  clear blob of Jell-O. Also surprised to see that my muscles were more orange-y colored than I thought they would be\n\nEducational, but not for the faint of heart",
   "created_utc": 1691151346,
   "score": 36,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur23xl",
   "message": "I voluntarily licked some dust when I was younger. Wanted to get sick to skip school I think. Didn't work.",
   "created_utc": 1691151352,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur25f5",
   "message": "Do you know those little football goals, they post in urinals? There is this little football hanging so you know where to piss, to score a goal. I licked the ball.",
   "created_utc": 1691151373,
   "score": 12,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur25v3",
   "message": "I once dropped an unopened bottle of tonic wine into a portaloo and before I had even thought twice, I had reached in and recovered it. Reader, I drank the wine. (Yes I washed it, no I didn't get sick).",
   "created_utc": 1691151380,
   "score": 137,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur26c9",
   "message": "Ate some a$$ after a double #noshower",
   "created_utc": 1691151386,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2b2x",
   "message": "Glanced in your mom's direction.",
   "created_utc": 1691151456,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2civ",
   "message": "Dropped my car key into the urinal in jail...",
   "created_utc": 1691151477,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2g74",
   "message": "Made myself a cheese salad sandwich... was carrying it upstairs and tripped. Sandwich all over the place.\n\nI was starving.. so quickly reassembled it off the floor and continued with my day.",
   "created_utc": 1691151532,
   "score": 49,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2igu",
   "message": "Got my red wings.",
   "created_utc": 1691151564,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2jnp",
   "message": "Ate ass, and by damn it I'll do it again.",
   "created_utc": 1691151581,
   "score": 45,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2m0v",
   "message": "Drank a mix of oreo, ketchup, mustard and liver",
   "created_utc": 1691151616,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2niz",
   "message": "Had a boyfriend who liked me to vomit on him during sex. Sometimes I think he tainted my food.",
   "created_utc": 1691151638,
   "score": 113,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2p6b",
   "message": "Staying married to a narcissistic demon of a woman. I feel disgusted with myself every time I think about it.",
   "created_utc": 1691151662,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2pv1",
   "message": "Ass to mouth.",
   "created_utc": 1691151671,
   "score": 4,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2s3s",
   "message": "\"PAiD tAxEs\" ~ conservatives somewhere.",
   "created_utc": 1691151704,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2st8",
   "message": "Let him put it in my mouth after it was in my butt. In the heat of the moment, it's okay, right? 😆\n\nEdit: Calm down, everybody. I only did it once, and I was referencing Clerks 2 lol",
   "created_utc": 1691151714,
   "score": 12,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2swc",
   "message": "Shaved my pubes in a mall bathroom\n\nI dont know why or what i was thinking at that moment but i just bought a razor from the store went to the bathroom ans did it",
   "created_utc": 1691151716,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2u7s",
   "message": "Eat 300 raw “Morning Glory” flower seeds, in hopes of achieving enlightenment.",
   "created_utc": 1691151735,
   "score": 3,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2v57",
   "message": "When I was in the low point of my alcoholism and unable to require vodka, I drank my bong cleaner liquid - isopropyl alcohol mixed with whatever remnants of my bong junk. \n\nDon't really remember what happened after that - fuzzy memories of my partner and I in the back of a ambulance. \n\nBut I do remember what that shit tasted like. Makes me gag thinking about it.",
   "created_utc": 1691151748,
   "score": 166,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur2wcq",
   "message": "Ate ass. Wanted to be cool like the memes. Do. Not. Recommend.",
   "created_utc": 1691151765,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur3dey",
   "message": "April 24th 2022.6th grade. At my old school near the side entrance there’s a playground and next to it is a huge ass soccer field. On that soccer field was a drainage pipe an open one nonetheless. One day me and my friends John and Dave found a stick in that pipe with what we assumed was mud on the end of it. It got on our clothes but we didn’t mind cuz hey it was just mud right? I proceed to say \"I’ll give 5 bucks to whoever licks John being the fucking mental patient he was did it. Turned out that \"mud\" was some sort of animal shit. He gagged and threw up but thankfully no one saw. Needless to say he got 10 dollars that day.",
   "created_utc": 1691151990,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur3dl6",
   "message": "I ate a cold KFC french fry that was in its box, on top of a garbage, at a bus station. And then I ate another one because my friend wanted to record it.",
   "created_utc": 1691151992,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur3fxo",
   "message": "Dipped everything I ate for a week in banana pudding, no matter what it was",
   "created_utc": 1691152025,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur3j5u",
   "message": "Became a nurse. And then decided to go into aged care with my degree. Still scratching my head on that one. Not a day goes by where I'm not cleaning up someone's faeces, chronic and cancerous wounds, sputum, etc. But someone has to, I guess.",
   "created_utc": 1691152071,
   "score": 197,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur3l53",
   "message": "US Navy Shellback initiation",
   "created_utc": 1691152099,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur3m36",
   "message": "Licking my urine",
   "created_utc": 1691152113,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur3peh",
   "message": "We came home to find our Lab (thankfully crated in our breakfast room) had a horrific case of diarrhea and had shaken and shaken each time he went in the crate and COATED our breakfast room and about eight feet into the adjacent kitchen with the stinkiest liquid poop EVER!! We had come home to quickly get something and then take our oldest to CCD (last year before it became Faith Formation) and my husband had volunteered to help with the boys. I sent him off and stayed home and cleaned for three hours straight. He came home and helped for another two. \n\nTurns out the dog had drunk from the turtle habitat in our yard and that’s what made him so sick. It was then, and continues to be, the grossest thing I’ve ever had to clean. Ever.",
   "created_utc": 1691152160,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur3usk",
   "message": "Had a student job at a meat quality research facility. One of the projects was to find further traces of lead in the shot wound of wild boars after the bullet was cut out (lead bullets were not yet banned those days). Most of the boars had the wound on the neck, but one caught the bullet into its belly, so I practically had to cut its bowels open and remove the contents for the lead test. The smell haunted me for several days.",
   "created_utc": 1691152235,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur3yzs",
   "message": "I was made to pick-up the dissected skinless upper limb of a human during my viva of human anatomy in my first year of med school because i forgot to bring the rubber gloves. I still remember the feeling of cold fluid seeping from the flesh on my hands and my hands smelling like rotten garlic for the whole day . I still managed to eat my lunch though.😊",
   "created_utc": 1691152293,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur407t",
   "message": "Joined the Army and fought George Bush’s illegal wars.",
   "created_utc": 1691152311,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur410c",
   "message": "While having sex my GF sometimes when fingering her ass I would be unwillingly touch her poop. I would never say anything about it and would just continue finger her ass less deeper to avoid continue touching the poop",
   "created_utc": 1691152322,
   "score": 140,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur418n",
   "message": "I ate Vegemite on a dare when I was in Australia.",
   "created_utc": 1691152326,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur4576",
   "message": "Talked to men",
   "created_utc": 1691152381,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur4c2h",
   "message": "Working in a slaughter house as a 17 year old for 350 AUD a week full time ( i had earned more working in a kitchen 4 hours a day previously). Everything from watching an animal hanging by its back leg twitching after not being electrocuted properly while bleeding out from its neck, to walking in 6 inches of cauterizing blood daily, to the loss of bowel function on the goats I am swinging into a boiler vat to have their hair removed, the giant green pustules from infections on the sheep having their  skin removed, the intestines I sorted.\n\n\u0026amp;#x200B;\n\nPossibly the most disgusting thing I did there was take shit from the manager who never got his hands dirty.",
   "created_utc": 1691152477,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur4dh0",
   "message": "Poop",
   "created_utc": 1691152496,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur4dib",
   "message": "When I was a teenager and couldn't afford cigarettes I would sometimes pick them off the sidewalk (no more than half smoked ones though) and smoke them\n\nMostly id steal them from the window sill behind the fancy restaurant because the chefs smoked Belmont's and usually I ly had a drag or two before putting them down",
   "created_utc": 1691152496,
   "score": 1,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur4dyr",
   "message": "Go to work, all day for all my best years.",
   "created_utc": 1691152503,
   "score": 199,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur4e9p",
   "message": "I was on a Boy Scout camp out and this kid kept hitting me with his bamboo stick so I broke it in half and threw it away, he then decided to spit in my eye, so I proceeded to steal his bag of peanuts while he wasn't looking and filled the bag with my pee, I let it soak for a bit then poured the pee out and I let the bag dry in the sun for the rest of the day. The next morning I placed the bag back in his tent and watched him eat the whole bag, he periodically looked at the peanuts a little confused but he ate the whole bag of like 30+ of them. It was excellent revenge",
   "created_utc": 1691152508,
   "score": 6,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur7agy",
   "message": "When I was a kid my parents had three chihuahuas but didn’t really take care of them. Like at all. They wouldn’t buy them dog food, just hot dogs and chicken nuggets. No vet visits. Nothing. They weren’t even allowed to sleep inside the house because they weren’t house trained. But the two occasions that stick out to me were 1) when the female had puppies. She had 8 but since she wasn’t properly taken care of she spent the entire day roaming the yards and dropping sacks of puppies. My mom was grossed out so she didn’t want to help so it was up to 9 year old me and a nice neighbor to look for these bloody sacks of dead puppies. Only 2 survived. And 2) as early as about 10 years old I took it upon myself to wash the dogs. And they were all covered in fleas. Like a disgusting amount of fleas. I would bathe them, apply some cheap flea shampoo and use a toothpick to go through their fur and remove anywhere from 30-50 fleas at a time and crush them with my nails. It was god awful and to this day I refuse to ever bring an animal into my home unless I can 100% take care of it properly.\n\nEdit: I’m sorry but this was many years ago. Almost 20 years ago. Please stop telling me I have to report it, I was a child in an impossible situation just trying to survive and give those dogs whatever small acts of kindness I could. I no longer have contact with my mom now that I’m an adult.",
   "created_utc": 1691153894,
   "score": 214,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur8d9l",
   "message": "I suffer with a Pilonidal cyst, which can turn into an absess. Its basically swells up one side of your ass cheak with pus and blood. First time it got bad i was too embarrassed to go to a DR because i didn't know what it was, and it's on your ass.  Left side of my ass got so swollen and painful that i decided to get into the shower and stab the swollen painful ass cheak with a kitchen knife. I had plenty of rum before i did it to try numb the pain. Made a decent sized wound and then proceeded to push blood and pus out of my ass. When i couldn't take it anymore, i stumbled into my bedroom and passed out. When i awoke the next day, the smell of death was awful. I was laid in an infected pool of liquid, feeling so ill. I still didn't tell anyone and just laid there all day. I was sick for a few days until i started to feel better.\nAfter it flaring up again and again over a few years i finally went to see a doctor about it. They scolded me for my stupid DIY shower stabbing, saying i could have given myself blood poisoning and killed myself. Very lucky...\nMoral of the story, go to the doctor if you are ill, dont feel embarrassed. Dont try to sort it yourself. It could end very badly.",
   "created_utc": 1691154395,
   "score": 124,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur4j1t",
   "message": "I made out with my older sister when I was young, I sometimes act like I forgot it but it's still in my memories because not only I enjoyed it at that time but know I look back, yuck sweet home Alabama",
   "created_utc": 1691152573,
   "score": 9,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur5vgo",
   "message": "At a bar in St. John's, I kissed a dead fish to become an honorary Newfoundlander. About thirty people kissed the same dead fish before it got to me.",
   "created_utc": 1691153225,
   "score": 10,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur99ta",
   "message": "Fight for a narcissist’s love",
   "created_utc": 1691154808,
   "score": 9,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jurbjqz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur62bx",
   "message": "This is very dangerous, and I WOULD NOT RECOMMEND, but when I was in college, I was taking the trash out from my apartment before I left for class, and in my particular apartment at the time this meant putting it in my car and driving it over to the trash compactor. I did so, and when I threw it into the machine, the bag got caught on my car keys, and pulled the whole set into the machine with it. \n\nFortunately, this was the kind of machine that didn’t really compact anything while the door was still open. So for a hot second I just stood there, dumb founded, trying to figure out what to do. Luckily one of my neighbors rolled up a few seconds later with her own trash bag, so in a panic I asked her to hold the door for me while I CRAWLED INTO that thing to grab them. \n\nAs an adult in my thirties now, I don’t know how I didn’t get crushed to death. Honestly. Especially with just some random middle aged lady holding my life on her hands. But I had a test in the class I was about to leave for, so I felt like I didn’t have much of a choice. \n\nSo in I went. It was exceptionally disgusting. I was living in Georgia at the time, and it was  late spring, so it was disgustingly hot and swampy in there, on top of all the trash juice and other general unpleasantness. However, the keys had landed in a fairly easy spot, so once I got myself down the little shoot, it was pretty easy to get the back. But I will never forget the look on that woman’s face when I rebirthed myself out onto the world, smelling faintly of garbage, having done probably the stupidest thing of my life. \n\nI wonder if she ever tells people about that, lol",
   "created_utc": 1691153318,
   "score": 116,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jurfhfc",
   "message": "I was 18. I was at the PCPs having some tests ran. I was complaining of some stomach issues and they wanted a stool sample. I was handed a small cup and they said just push a little out, they didn’t need much. They handed me a paper plate and ontop was a cup, the top of the cup, a stool softener and gloves. \n\nI sat and waited until finally I felt something. What came out of me can only be described as a tree trunk coming out of my ass. It unfortunately pushed the cup out of my hand due to its weight and went into toilet. The weight of the cup with the turd splashed water all the up to my neck. \n\nI flipped out. Wtf do I do. Out of all the logical ways to handle this situation, I grabbed the turd and put it on the paper plate. I grabbed the cup and threw it away because duh it was dirty and fell in toilet. I stared at the medium rare tomahawk turd that I produced. Do I split it? That question just never made it’s way into my brain. \n\nI walked out the bathroom holding a paper plate with a turd on it and placed it on the check out counter. I cannot describe the poor girls face of horror. I explained the situation holding back tears from the anxiety attack I was having but it looked like I was laughing. \n\nThe dr came out, grabbed the plate and must have sliced and diced it into the office. No words were exchanged. I left. I got a call later in the week with good news that I was healthy but to please to find another pcp.",
   "created_utc": 1691157519,
   "score": 24,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur5etj",
   "message": "Swallow a mosquito. I was so annoyed by them biting me, a swarm of them chasing me at the park one night playing soccer, that I mock bit into the air and actually caught one, and just gulped it down.",
   "created_utc": 1691153000,
   "score": 160,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jurf2i4",
   "message": "All the shit stories here remind me of one of my earliest memories.\n\nI was having a warm bath, and it felt so relaxing I decided to take a shit in the bath. I didn't think much of it, dried myself and got clothed and went about my business.\n\nA few minutes later I heard my dad calling my name angrily: \"Did you poop in the bathtub leonmarino?\"\n\nTo which I somehow answered: \"It's not poop, it's magic papa!\"\n\nWithout blinking an eye he scolded: \"well make it disappear then!\"",
   "created_utc": 1691157343,
   "score": 140,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jusg0cv",
   "message": "Give my obviously dead 3 month old son CPR. \n\n\n\nThe 911 operator instructed me to do it, it was mortifying. The raspy sound of air just pushing back out of his lungs and the little \"sighs\" that his voice made as the air came back out still haunt me.",
   "created_utc": 1691171379,
   "score": 79,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur5m4s",
   "message": "I let someone shit in my hands as I tried to catch it while they were piggy-backing on someone else's back.",
   "created_utc": 1691153098,
   "score": 101,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jurq3oz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jurekg8",
   "message": "I was on a field trip in 8th grade with all of the 8th grade class. We were on a “ghost walk tour” in Charleston SC and my stomach started to turn. I desperately looked around for a toilet, but was extremely shy and didn’t want to talk to anyone about it. We stopped in a place for a moment and I just sat down to keep myself from shitting right there. Everyone gets up and starts walking to the next destination when I spot a portapotty. I get in there and as I’m pulling my pants down, I just unleashed the nastiest hottest pile of diarrhea into my shorts. I scooped everything out as well as I could in the portapotty. Luckily the tour was about over….but the back of my pants were literally covered in shit. I told the teacher I was sick and puked while I was trying to use the restroom. I got onto the bus and sat with my butt between the seat and the back of the seat in front so no one would see what was going on. I obviously smelled fucking awful, was devastatingly embarrassed about the situation, but my buddies came through. I told them the same story about throwing up and they had my back. One friend was on guard duty, one made sure I was off the bus and no one could see the nastiness on the back of my shorts, and lastly my buddy Robbie overheard someone accusing us of smelling like shit and he reversed it on him and said, “sounds like this guy shit his pants” and loudly redirected the attention to that guy instead. They helped me get the hotel room without incident where I then attempted to……fix my shorts by washing them in the bathtub. That. Did not. work. Now the room smells like shit so we just bombed it with axe body spray and just about died laughing about the situation. If my buddies weren’t there to help, I’m almost certain the ENTIRE 8th grade class would know I shit myself on that field trip.",
   "created_utc": 1691157133,
   "score": 117,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jurkq6s",
   "message": "First year of nursing school I worked on a geriatric ward and had to clean up a really demented senior patient who shit himself from head to toe with diarrhea. I even had to clean the bathroom floor afterwards. The \"accident\" wasn't his fault but he was so fucking mean and laughed at me the entire time",
   "created_utc": 1691159644,
   "score": 94,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jurkwt9",
   "message": "Back in the day- tv’s had speakers in the front. \nI was at work and had helped a resident onto the toilet. Went and did a few things and when I came back- poop EVERYWHERE. And I mean everywhere. Not just in the bathroom, but also in their bedroom. And I had to clean it all… even out of the tv speakers.\nAlso, not a fun way to find out someone has PICA because yes, it was also eaten.",
   "created_utc": 1691159716,
   "score": 57,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "juszcxs",
   "message": "When I was a horny teenager I thought it would be a good idea to cum on a chocolate biscuit and eat it. I was also at my grandparents at the time. Anyway obviously after I came all over the biscuit I wasn't horny anymore and didn't want to eat it so I went to go to the garden to throw it away when I bumped into my grandad who told me to hurry up and eat the biscuit because it looked like it was melting so I ate the cum covered biscuit in front of him. So probably that.",
   "created_utc": 1691178674,
   "score": 126,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jurhz6r",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jurnufg",
   "message": "Was up in a cabin for a week with people I didn't really know. At the time I was really nervous about pooping around others so for as long as I could I held in my poop in thinking I could last the whole trip and go home and do it in peace. The entire time we were eating nothing but meats so after about the 5th day I started getting woozy from my stomach pains and had to go try and push one out. \n\nI was in labour for about 2 hours but nothing was coming out even though it had breached a bit, so no turning back. But I was worried the others would notice me in there so long so my anxiety started to build and I decided I needed to do something. The reason it wasn't coming out was because it was far too big for my hole but way too dense to squeeze through.\n\nI was really panicking at this point and in a world of pain. So desperately, I managed to reach in with a few fingers and started breaking off little chunks of this behemoth and trying to coax it out. There was poop under my nails from clawing at it. It was so dense that I was able to actually wrap my hand around it and pull on it. I finally tugged it hard enough that it came out whole.\n\nThis bad boy was easily the girth if a coke can and about 10 inches long. It was too big to flush so I had to reach in and break it down with my hand. My hole didn't completely close for like 2 days and I was limping but the internal shame of having to arm-wrestle my own asshole was the worst part.",
   "created_utc": 1691160859,
   "score": 208,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jurzg78",
   "message": "I was a teen working at rite aid and I spent the whole 11 hour shift without using the bathroom. Finally when it was time to close up I realized I had to shit soooo bad but I was too embarrassed to ask my coworkers to wait for me so I left with everyone else. My crush at the time lived right near the store so she wanted me to come over and my brain below the belt couldn’t care less about whatever my stomach was going through. So I went to her place and just as she opens the door I immediately shit my pants. I was so embarrassed I ran and called an Uber but realized there was no way I could take it in my condition. So I had to skateboard 2 miles home leaving a nice little trail of goodies along the way.",
   "created_utc": 1691165186,
   "score": 34,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jutud6g",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jur6sxs",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15hvpl7"
  },
  {
   "comment_id": "jurip8h",
   "message": "Tried swallowing some shrooms down with Mountain Dew because I hated the taste. One got stuck sideways making me gag until I threw up. Because I wanted to trip so bad I dug through the puke that was on a dirty garage floor and re-ate every shroom I could find. Yes I did have a great trip after.",
   "created_utc": 1691158837,
   "score": 37,
   "submission_id": "15hvpl7"
  }
 ]
}