{
 "submission_id": "15hyeqc",
 "title": "People who say \"not the weirdest thing I've seen in New York City\", what is THE weirdest thing you've seen in New York City?",
 "selftext": "",
 "created_utc": 1691151068,
 "permalink": "/r/AskReddit/comments/15hyeqc/people_who_say_not_the_weirdest_thing_ive_seen_in/",
 "score": 147,
 "url": "https://www.reddit.com/r/AskReddit/comments/15hyeqc/people_who_say_not_the_weirdest_thing_ive_seen_in/",
 "comments": [
  {
   "comment_id": "jury2c5",
   "message": "While on the C train headed uptown one morning, a man stood up, reached into his pockets and pulled out three mice, and started juggling them. But once he missed a catch and the mouse fell to the floor, he totally gave up and dropped the other two. The mice ran around until we reached the next stop and they managed to scurry off the train to the platform. The guy had just sat back down like he wasn't just juggling mice he pulled out of his pocket.",
   "created_utc": 1691164666,
   "score": 254,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jus66dk",
   "message": "My friend's mom swears she saw a well-dressed business woman throw a jacket over a street pigeon and stuff it in her purse, then just walk away like nothing happened. \n\nI choose to believe.",
   "created_utc": 1691167720,
   "score": 61,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurbiey",
   "message": "Lived there for 15 years.  Almost never saw wild shit unless my parents came to visit.  One night my dad and I were walking home and we got bumped into by a HUGE bodybuilder looking dude decked out in women's lingerie with his weiner flopping about.  My Dad couldn't stop laughing, like a heard him laughing that night in the other room when I was trying to sleep.  Then my mom and I were in a pizza joint on the upper west side and there were 2 little old Jewish ladies (like 90s) having a terrible argument.  One of them had what I assume to be her son (60s?) With her and he yelled at the top of his lungs \"you should have died in the holocaust!!!\"  It took a while to convince my mom this was not an everyday occurrence.",
   "created_utc": 1691155808,
   "score": 54,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusf45b",
   "message": "More a weird but awesome experience.\n\nBack in the 90s, trip to NYC.  Buddy and I wanted to go to the Intrepid museum, no idea what bus to take or anything.\n\nSo, we ask the next bus driver for directions.  First - dude looked and sounded just like Jackie Gleason.  Nice pair of driving gloves.\n\nHe listens, looks at the 3 other passengers, and says \"These boys want to see the Intrepid!  Mind if I go off route to get them there?!\"\n\nPeople are fine with it, and off we go.   As he's dropping us at the gate, he says \"Can't be having tourists go home and saying New Yorkers suck, boys!\"",
   "created_utc": 1691171047,
   "score": 111,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurimjx",
   "message": "Guy got on the subway with his pants smoldering. Smoke drifting around him and he's slapping at his thigh area. Naturally everyone turned to look at him. He was like, what you all lookin at?",
   "created_utc": 1691158807,
   "score": 172,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurlxqy",
   "message": "Probably not the weirdest but I saw a Mariachi band on the 1 train with a one-armed man playing a single maraca.",
   "created_utc": 1691160124,
   "score": 108,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurqzwq",
   "message": "I was at a McDonald's at like 2am with a friend, and no more than maybe 2 or 3 minutes after walking in, this dude barges into the restaurant tweaking real hard.  Spots us and walks right over, spends like 5 minutes telling us something like it's his birthday but he's short on cash and needed $20 to go buy shawarma for his annual birthday celebration.  It's so long winded and rapid fire that other people in line with us have stopped their own conversations to look.  When he is finally done, my friend just says something like \"sorry bro but I need this cash to buy a big mac\" and this guy immediately loses it.  Screams for a few seconds, goes into a squat and slaps the floor a couple times.  He runs a lap around the restaurant, jumping up and onto some of the tables, and runs out the door into the night.  Couple seconds pass with nobody saying anything.  Someone quietly says out loud \"Damn, must be some pretty good shawarma\"",
   "created_utc": 1691162017,
   "score": 138,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jury7sx",
   "message": "When things started opening back up in 2021, my friends and I were chilling in Washington Square Park and we saw a man dressed as a rat climb on top of a garbage can.",
   "created_utc": 1691164723,
   "score": 111,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusau5u",
   "message": "I remember people talking about huge sewer rats in NYC, I thought they were a myth until I looked out the window of a train on the way in to town and saw a rat that had to be AT LEAST 20 lbs walking down the sidewalk in broad daylight. I started to wonder if he was just out picking up a pizza for Michael Angelo",
   "created_utc": 1691169459,
   "score": 17,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurfu95",
   "message": "I was taking the 2/3 from Fulton home to Brooklyn. Packed car. There's a bum sitting in the middle of the car on a bucket, drumming a pretty good beat. Doors open on Wall Street, and another bum walks on. This one has a guitar that's missing 2 strings, and he is singing \"Guantanamera\". The drummer gets in synch quickly, so now it's a duet. The guitar bum makes his way to the drummer bum. The drummer bum says, \"drop it like it's hot\", and the guitar bum gives him a bunch of change. So yeah, the weirdest thing I've seen has been one bum giving another bum money after a subway musical duet.",
   "created_utc": 1691157668,
   "score": 51,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jus84ob",
   "message": "Wrote this in my LJ on July 3rd, 2008:\n\nLast night while walking down Chrystie St. some drunk (or otherwise fucked up guy) comes staggering out of a building and says \"What do you do when someone fucks with you?\" to me and some other guy on the street. Other random guys says \"You fuck with him back!\" so the first guy walks across the street and sets some guys car on fire. We just kind of stare at it a minute in shock (it's burning pretty good. No idea how he did that) before calling 911. Two fire trucks show up in about 3 minutes and put it out. The guy who did it had disappeared at this point, so I figured my work was done and went on my way.\n\nCrazy.",
   "created_utc": 1691168444,
   "score": 232,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurgfhc",
   "message": "I watched the World Trade Center collapse from Greenwich Street.",
   "created_utc": 1691157915,
   "score": 223,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jus4m6b",
   "message": "Recently, I’ve been seeing a guy late night in Times Square and also in Washington Square Park who invariably is shirtless, jacked, oiled up, wearing a creepy clown mask, and doing strength training with resistance bands and kettle bells, all without saying a word but breathing heavily like you would expect from Michael Myers or something.",
   "created_utc": 1691167128,
   "score": 178,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jur63hp",
   "message": "I'm from here but moved away. I've seen it all. Public sex stuff, fights, purse snatching, etc. The weirdest thing I've seen was a guy on the upper west side standing in the middle of the road, dressed in a crotchless furry costume. He was eating like chow mein out of a box and yelling at cars passing by. The weirdest part was a cop car just casually drove past and didn't even seem to notice.",
   "created_utc": 1691153334,
   "score": 170,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurd7g2",
   "message": "I never saw anything super weird but one thing I found interesting is that, if you're out in the middle of the night (1-2am), you'll see a good amount of people out as well.  I'm not talking about young people coming out of clubs. Just normal looking people, walking their dogs or carrying groceries. People of all ages. Old people and kids. \n\nI haven't seen that in any other city I've been in.",
   "created_utc": 1691156554,
   "score": 156,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurp3ju",
   "message": "Group of 6 naval officers go into the city for a few days during a long weekend. All junior young 20ish types. One guy states that he wants to find a guy selling fake rolexes because he used to have one and thought it was hilarious that some frat bro had stolen it. \n\nI tell him my dad would like a fake Rolex, too, so I'll keep a lookout. \n\nMid way through day 2 we are walking on a crowded street and there's a skinny black dude wearing a bomber jacket poking out from a corner and whispering \"watches, watches\" in a thick African accent as people walk by. I grab my buddy by the arm and pull him closer to the guy. \n\nWhen we ask what kind of watches he has, he looks left, looks right, then pulls his coat open to show it's lined with watches. Just like in bad TV shows. \n\nWe talk for a bit and my buddy asks for a specific model of fake Rolex , and the guy makes a \"come here\" motion with his head and this other African dude materializes out of the crowd with what looks to be a canvas covered suitcase. He immediately turns it on it's side and it snaps four legs down and he opens it revealing a ton more watches. We ask how much. \"$300\". \"I'll give you $20\".  Face like I just slapped his mother in front of him. \n\nMy buddy says \"We'll buy two for $50\" and the guy accepts that. \n\nI pick out one, while my buddy is picking out his the one in my hand immediately stops working. I replace it with another random one, my buddy gets his, and we go on with our day with the two dudes melting into the crowd. \n\nThe one I wound up with was a \"yachtsman\" which I knew because it said that on the face. Diamonds to mark the hours, fancy etching....until you realize that the \"diamonds\" were roughly attached to the face with what appears to be a hot glue gun. My dad loved it. So did a robber who broke into his home some years later and stole it off his dresser.",
   "created_utc": 1691161314,
   "score": 123,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jursel8",
   "message": "I would say witnessing a well dressed middle aged woman squatting and releasing a poop on the curb at 3pm on a Wednesday. In a pretty busy avenue with people all around. I had just moved there and when I relayed the shock to my sil that grew up there, she was like “welcome to NY”.",
   "created_utc": 1691162549,
   "score": 212,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jus4t32",
   "message": "I was walking over the bridge from Long Island City to Greenpoint and I looked down at the tunnels that lead into Manhattan and suddenly saw an animal come out of the tunnel and it realized it was a zebra. Then another one came out. Then a whole bunch of horses, then an elephant... it turns out when the circus performs in Manhattan all the animal transport vehicles are kept in Queens and they walk through the tunnel to get there an back.  So Surreal.",
   "created_utc": 1691167202,
   "score": 222,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurghpz",
   "message": "[removed]",
   "created_utc": 1691157941,
   "score": 79,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurxfnw",
   "message": "I was on the train and this guy high on I don't know what was digging into his leg and ripping upward. Blood everywhere, kept scratching through the muscle. Everyone just moved away and kept riding. Nobody wanted the train delay.",
   "created_utc": 1691164431,
   "score": 97,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jus8n7x",
   "message": "It's gotta be between the dude casually dropping trow and taking a dump 20 feet away from families having a picnic in Washington Square Park, or the dude walking down the street at 6 PM in Midtown in nothing but heavy makeup and a bedazzled sock.",
   "created_utc": 1691168637,
   "score": 98,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "juriorv",
   "message": "Don't live in NYC, but live nearby and visit frequently. I've seen a LOT, but these two live on on my memory as the weirdest.\n\nBack when 42nd street was still quite nasty (early 90's) I was walking from Port Authority to GCT - I had gotten off the bus from my college and was walking to the train station to get a train home. I was a 19 year old white female wearing a large backpack.\n\nAs I was walking down 42nd street, there was a woman, an obvious drug addict and prostitute, standing in a doorway on 42nd street. She had dirty clothes, shorts and a tube top and no shoes. I walked by, she was like \"Hey, there\", pulled down her tube top, licked her fingers, rubbed her nipples and said, \"Want some of this, baby?\" I was like, \"Ummm, no thanks\" and kept on walking. Just seemed very weird to happen to me, on a Thursday afternoon in the middle of New York City, but I guess it wasn't *that* weird given the time and place.\n\nAnother time, we were down in East Village on a Saturday night. There was a woman, talking to herself, dressed in crazy clothes. She was holding a leash and we thought she had a small dog, but as we got closer, we realized it was a *large* rat caught on a glue trap. She'd attached a small leash to its neck and was parading it along the sidewalk while she continued to mutter to herself. It was beyond bizarre.",
   "created_utc": 1691158832,
   "score": 70,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "juruw3z",
   "message": "The weirdest thing in NYC is how, on New Year's Eve, everyone changes their personality to be a combination of the nicest small-town charm and the most intense welcoming committee to any event.\n\nPeople become not just nice, but go out of their way to be cheerful and helpful. It's the one magical night where we put aside our cynicism, sarcasm, and introversion and just want to have a party and love everyone around us.\n\nA small example is, one time, my husband and I walked past some lads on the street smoking really nice cigars. My husband just said to me, \"that looks good,\" and one of the guys chased after us to give him one and invited him over for a smoke. Stuff like this happens every year.\n\nEvery bar and restaurant is a party, most of them completely spontaneous and you will eat and drink for free a lot of the time. People on the street will smile broadly at you and say, with all sincerity: \"Happy New Year!\"\n\nAlthough we all think the Times Square Ball Drop is ridiculous and we want nothing to do with it, I think we all consider NYC to be sort of the capital of NYE and we are its ambassadors to the world. A job we take very seriously.",
   "created_utc": 1691163482,
   "score": 111,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusatnh",
   "message": "I was there recently and watched a girl piss on a parked car and then walk over to a guy sitting on a stoop and start blowing him. She stopped momentarily because she saw a family with kids coming down the sidewalk. I guess she had a slither of class left.",
   "created_utc": 1691169453,
   "score": 78,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusci9w",
   "message": "Luggage thieves used to sell their takings on St Mark's Place. Sidewalk full of open suitcases \u0026amp; they'd sell a pair of pants or half a bottle of shampoo, whatever. One night there was a open suitcase with maybe a dozen different dildos. \n\nAlso weird- Coney Island in the off season. Cops on horseback trying to win a giant stuffed rabbit at the sink a basketball game. The game was rigged and the cops were getting mad. The horses were just chilling.",
   "created_utc": 1691170080,
   "score": 63,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jus3cy6",
   "message": "The weirdest thing I've ever seen was a guy dump a giant bucket of golf balls out of his 10th story window onto Park Ave (@27th iirc) at about 11pm one Friday night in 1992.",
   "created_utc": 1691166650,
   "score": 88,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusomiz",
   "message": "Diner, about 2am back in 1988.\n\nGuy starts freaking out trying to get at his waist but he’s packed into a booth with friends. \n\nWithin seconds he launches himself backwards right onto the empty table in the next booth.\n\nNow he has full access to his waist and he’s slapping the shit out of himself. \n\nSuddenly he stops and bursts into laughter. \n\nIt was his work beeper going off on vibrate. He’d never carried one before. He thought a rat or something was biting him. \n\nHe was super embarrassed and explained it to everyone and apologized for disturbing everyone. \n\nThe whole fucking place burst out into laughter and clapping.",
   "created_utc": 1691174610,
   "score": 114,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurpzqz",
   "message": "This shit makes me want to visit NYC.",
   "created_utc": 1691161636,
   "score": 51,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jur1zfp",
   "message": "An old man walking around masturbating a banana.",
   "created_utc": 1691151285,
   "score": 75,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurtj5q",
   "message": "Homeless lady crappin’ into a sock in a subway car. Some how my SO, also on train, didn’t see or nor smell it.",
   "created_utc": 1691162970,
   "score": 29,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusrohx",
   "message": "The weirdest thing I've ever experienced in NYC was not the typical \"people shitting in the middle of the street\" you may expect to hear (which I have also seen lol). \n\nThe ACTUAL weirdest experience I had was the time some random guy chased me for about 12 blocks as I dodged between traffic and groups of tourists. I was walking to work and at first I didn't notice him, since I obviously was wearing headphones and actively avoiding making eye contact with strangers. Once I realized he was yelling at me and trying to catch up with me, I naturally began walking faster and trying to ignore him. \n\nWhen I was finally forced to stop at a busy intersection, he taps me on the shoulder and starts yelling at me. Turns out he was trying desperately to return my (untouched!) wallet that had fallen out of my pocket! And as he's doing this hugely kind gesture, he's simultaneously berating me for being so careless with my possessions (which, I mean is fair). \n\nI also once had someone find me on LinkedIn of all places to tell me I had left a credit card behind at a bar and offer to return it. \n\nPeople love to shit on New Yorkers, and sure we can be massive assholes. But New Yorkers can also be some of the kindest assholes out there. So suck on that, California.",
   "created_utc": 1691175757,
   "score": 104,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "juse17s",
   "message": "I once saw a guy taking photos of some scaffolding in Times Square. While he’s taking a photo, this tall, linebacker of a woman (a person of color, this is important,) in a dress is walking under the scaffolding. Well, apparently from what I hear this woman screaming, she thought the man was taking creeper photos of her! He isn’t polite, but he’s trying to explain this. She unloads on him, so to piss her off he snaps photos of her, saying it’s public space anyway!   \n  \n  \n  So, this woman starts **wailing** on this guy. No sooner does she start, does this guy (who kind of looks like a cross between old Nazi propaganda drawings of Jewish people, and Herbert from Family Guy,) is retreating. Casting some racial epithets at the woman. I always wonder what happened to that guy.",
   "created_utc": 1691170646,
   "score": 30,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusmcir",
   "message": "When I was like 13 I was in McDonalds having lunch with my friends and this lady walks in and gets napkins and ketchup and sits at the table across from us. She lays the stuff out in front and across the table from her, we assume she is waiting on a friend. She starts talking and gets up and walks to the other side of the table and sits down and answers herself. She went back and forth in this conversation for at least 10 minutes when we finished and left.",
   "created_utc": 1691173757,
   "score": 42,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusrstx",
   "message": "I pretty regularly see this black dude on a bicycle balancing shit on his head. Always something different. Car tire, basketballs, a straight up 30 gallon garbage can.",
   "created_utc": 1691175804,
   "score": 38,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusswv0",
   "message": "I wish I could find the photo I took ...\n\nWe're on a school field trip, it's 1986.  We're walking along a street, and we pass a pizza shop.  [All the pizzas are displayed in the front window](https://c8.alamy.com/comp/2A3C7M0/venice-italy-circa-may-2019-pizzas-on-display-at-a-restaurant-in-venice-2A3C7M0.jpg).\n\n**Among the pizzas is a big orange cat,** just sleeping there between two pizzas.  He's on his back, stretched out, totally relaxed.",
   "created_utc": 1691176224,
   "score": 39,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "juszvkk",
   "message": "I have was on the subway in Brooklyn. Guy gets on and starts walking back and forth through the car giving a speech about how he's hungry and would really like some food. After a while, the general ask for food becomes him talking specifically about how nice it would be to have a cheeseburger. After a couple minutes, a woman sitting across from me, digs into the bottom of her giant purse, pulls out a wrapped McDonald's CHEESEBURGER and hands it to the guy. He thanks her without missing a bit or any noticable suprise. Still not sure wtf I witnessed that day.",
   "created_utc": 1691178865,
   "score": 43,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurgfk3",
   "message": "Early 2000s a guy tried selling me chain in the street that I refused to buy.  He gives up then walks into a small alley then drops his pants and takes a crap all while some other guy is just standing with his pants around his ankles jerking off.",
   "created_utc": 1691157916,
   "score": 64,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurg0nt",
   "message": "Guardian Angels getting stopped and frisked.",
   "created_utc": 1691157743,
   "score": 18,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusrzpk",
   "message": "In the early 80's a friend of mine had been on the subway early on a Sunday morning.  He was wearing a t-shirt that had something to do with the Indian cricket team on it. A gigantic dude gets in at the next stop and they start talking about cricket vs baseball.  At the next stop some kids get in with a boom box ( ghetto blaster for you 80's kids ) blasting out rap music.  The gigantic dude yells \"Turn that shit off before I pull out my gun and shoot all of you\" Click, the music gets turned off.  My friend and the dude continue their conversation like nothing happened.",
   "created_utc": 1691175878,
   "score": 27,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jut7f7t",
   "message": "In a cab on 9th ave stuck in traffic and at a red light. Hear some commotion and a guy jumps in the back of the cab with me and yells \"Go! Go! They're chasing me!\" The driver is unfazed and just gestures to the traffic in front of us and says \"Go where?\" 3 deli workers come running up to the cab holding various makeshift weapons that they grabbed from their kitchen. I open my door and hop out while they dive in to the backseat and pull this guy out. They throw him onto the hood of the car behind us and start beating on him. I dove back into the backseat and yanked the door closed. The light turned green and we got the hell out of there. Cab driver and I had a good laugh about the whole thing.",
   "created_utc": 1691181754,
   "score": 28,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusg3l8",
   "message": "I would probably say a coffee cup mascot jacking it into a trash can.",
   "created_utc": 1691171413,
   "score": 21,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusleho",
   "message": "Once while sitting at a bus stop I watched two sketchy dudes come into the stop and one of them dropped his pants and got up on all fours on the bench while the second dude lit some kind of a pip and take a drag on it. He then put his lips to the asshole of the dude on all fours and proceeded to blow smoke up his ass.",
   "created_utc": 1691173401,
   "score": 19,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusgdm8",
   "message": "The 2004 Cracktoberfest riot. https://www.nytimes.com/2004/11/07/nyregion/5-arrested-in-clash-at-east-village-rock-concert.html\n\nIn 2012, I was in Washington Square Park. A huge crazy guy was standing on a bench, preaching with a vein bulging on his neck.\n\n\"IF YOU DO NOT OBEY THE BIBLE YOU ARE REBELLING AGAINST THE WORD OF GOD! YOU WILL NOT BE DRINKING BEER WITH YOUR FRIENDS IN HELL!\"\n\nOn a dare, I get up and start counterpreaching about a pagan god.\n\nME: Ladies and gentlemen, I have a god for you. And HIs name is Pan! He is the Greek goat god of fear and he is an Olympian and He is the Son of Zeus! Pan is Truth!\n\nPREACHER: HOW DO YOU KNOW?!!!\n\nME: Because the  Greek myths tell us.\n\nPREACHER: THEY'RE MYTHS!\n\nME: Do you dare to defy the Olympians?! Hades will cast you into the River Styx!\n\nPREACHER: God will send you to Hell for your pagan demon worship!\n\nME: O, 12 Olympians, I beg you! Release the Kraken so it might devour this unbeliever!",
   "created_utc": 1691171517,
   "score": 53,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusoazj",
   "message": "Dude just spitting onto his metrocard and using it like a drywall or bondo spreader on every surface including polls and windows.",
   "created_utc": 1691174489,
   "score": 17,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jut0hwh",
   "message": "This thread is epic. Keep it up.",
   "created_utc": 1691179099,
   "score": 16,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusrcwk",
   "message": "I've seen crust punks sucking eachother off in the open guitar case of a weeping busker.",
   "created_utc": 1691175632,
   "score": 18,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jus83pz",
   "message": "I've only visited New York City, only spent a few days of my life there. So mine is relatively modest.\n\nStopped at a red light, the driver behind me blared his horn at me, passed me by crossing into the opposite lane, ran the red light... and was immediately pulled over by the cop on the other side of the intersection.\n\nEdit: My hypothesis is he saw my out-of-state plate, couldn't see the red light, immediately assumed I was a total idiot stopping for no reason and went blind with rage? But this will forever be a mystery to me.",
   "created_utc": 1691168434,
   "score": 38,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jur43u7",
   "message": "I’ve never actually ever seen anything truly crazy in NYC. Just your run of the mill stuff. \n\nMiami and Las Vegas though…truly weird things have gone down around me there. Stripping on the street, addictions playing out in public, literal flames, etc.",
   "created_utc": 1691152362,
   "score": 30,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusy3rw",
   "message": "One of the stranger subway performances I can recall, was a guy at union square.  He was on the subway platform, standing in the center of a pentagram wearing only a loincloth, surrounded by raggedy stuffed animals.  He was playing a kazoo and slowly letting air out of a balloon, which was raised over his head.  He was also aggressively staring down anyone who came near, whilst gyrating his lanky body.\n\nAnother time at union square there was small jam band laying down some funky tunes.  As I was passing by they started playing Billie Jean.  Suddenly a dwarf dressed like Michael Jackson appeared, moonwalking and dancing about.  Everyone lost their shit, stopped, and cheered.  He had some legit moves.\n\nOnce as I was passing through the subway at Penn Station, there was a rather obese homeless woman who had setup shop on a bench.  She had a shopping cart packed to the brim with junk.  She was complaining to her friend about something.  Then she abrupty stood up in sort of a half squat and sprayed an ENTIRE aersol can of febreze into her undercarriage.  That one still haunts me a little...",
   "created_utc": 1691178197,
   "score": 28,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "juscspu",
   "message": "A man shoving a hot dog up his ass",
   "created_utc": 1691170189,
   "score": 9,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "juspix9",
   "message": "Me and my dad were leaving the Empire State building and heading towards the subway. Walking in the opposite direction were a young couple arguing in a language that sounded Eastern European. As I watched, the guy seemed to get frustrated with the girl and made a move to slap her, but then at the last minute seemed to realize he was on a busy sidewalk in America and ended up kind of pushing her face. I was just completely stunned into inaction and just kept on walking. I hope she got away from that trash. \n\nAnother time in NYC, I saw a homeless person bundled up with a cat on a leash wearing a sweater.",
   "created_utc": 1691174946,
   "score": 10,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusdqt0",
   "message": "Homeless woman wearing a dress with no front, just naked boobs, belly and bush. Was in the city with my little brother and sister - “Look this way kids, nothing to see on the right.” Lol\n\nTaking the subway to go see Les Mis when it first opened and my wife getting her purse grabbed by a wanna-be purse snatcher. Wife was inside the subway, snatcher was outside, purse was caught in the closing door. Door reopened and my wife yanked hard causing the thief to fall backwards without the purse. Door closes and subway goes off. Happened so fast I didn’t get a chance to even react. My wife said she had the tickets in her purse and there was no way she was giving them up.\n\nAlso have had prostitutes approach me on the street but I’m a native New Yorker so I know how to speed walk and not make eye contact.\n\nI love the city. Anything you want to eat or do or see or buy is there anytime of day or night. It’s exhilarating.",
   "created_utc": 1691170540,
   "score": 21,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jus4et5",
   "message": "An old friend who used to live there told me he was sitting on a bench, talking to his friend at a perpendicular intersection. He saw two guys walking toward them from waaay down the street. Surely enough, they walked right up to them, one guy snatches his friend’s chain and then they turn around and calmly walk right back down the street they came from. Neither of them did anything or knew the two guys.",
   "created_utc": 1691167048,
   "score": 9,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jutdrg2",
   "message": "Not as insane as some but one of the most heroic things I’ve ever seen. New Years I’m on the 6 going back to my place at like 2am. Train is pretty full. This girl across from me looks awful. Completely wasted and she knows it and feels it. Suddenly she flinched and puffs her cheeks out. She stays that way for the next 10 minutes, with her boyfriend rubbing her back. \n\nThey get out at the same station as me, and I see her walk to a trash can and spit out a TON of vomit. She held it all in her mouth the whole subway ride like a goddamned superhero.",
   "created_utc": 1691184200,
   "score": 30,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jus7dzb",
   "message": "I was young, 8 or so,  \n my dad and I went to a Burger King drive through. There were two cars in front of us and I guess the first guy was taking too long to order, so the car behind him honked his horn. The first guy got out of his car, and I don’t remember if he pulled the second guy out or if he got out on his own but he started absolutely wailing on him. I burst into tears and my dad left and I think we went and got pizza somewhere. I’ve never been back.",
   "created_utc": 1691168168,
   "score": 10,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jut43lg",
   "message": "I saw an entire bar pile out into the street and start fighting. One of the participants was using the outdoor cigarette ashtray filled with sand as a weapon. 20 people easy just swinging. \n\nThere were four of us waiting to cross the street watching. We were headed into that bar. If we were 90 seconds earlier we would have been in the middle of the mayhem.  We went to the next bar.",
   "created_utc": 1691180467,
   "score": 14,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jur1rak",
   "message": "A couple of dudes dressed as touhou characters",
   "created_utc": 1691151165,
   "score": 14,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusqinj",
   "message": "Once got on the subway and saw an empty carriage (remember it’s empty for a reason) and sat down. There was this lady clearly on drugs (she had that crackhead look) sitting in the far side. The train starts to move and she promptly takes off her pants and takes a dump right there.\n\nNever again getting excited by an empty carriage.",
   "created_utc": 1691175317,
   "score": 9,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jussuad",
   "message": "A one-legged man on a rollerblade (and two ski poles to propel himself). On 45th and Lex",
   "created_utc": 1691176197,
   "score": 11,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusu4lm",
   "message": "Literally got this set of texts from my roommate and friend in a group chat(roommate is a dog walker, so beans and jennie are dogs):\n\n\nR:Beans and Jennie just met that Dustin kid from stranger things\nR: And then a psycho, homeless man attacked me with his wheelchair, calling me a pig\n\nF: see you can't send those as if that's how that went, that needs more detail and are you ok\n\nR:Today is just such a roller coaster\nR: Oh I'm fine but it literally happened one block, and then the next block\nR:He charged me with the wheelchair and I got shoved into a wall tripping over Beans\n\n{R then posts a picture of a parked car's front left wheel over a GIANT grey grocery bag that seems to have copious amounts of brown SOMETHING being squeezed out of it}\n\nR:That's a bag of shit\nR: A massive bag of shit\n\nme: I'm writing this all to reddit. I'll let oyu know who asks for pics of your tits, the Dustin kid, and the bag of shit, respectively",
   "created_utc": 1691176687,
   "score": 6,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jut1ob0",
   "message": "Super benign compared to most stories here, but like most it happened on the subway. There was a older guy doing a literal song and dance in the car we were on, and he was just…terrible. Not good at all. He finished and then just shoved his bare hand in people’s faces, expecting them to fork over cash to thank him for a job well done. He didn’t have a hat or cup, just his hand and a smirk on his face. A couple people gave him some dollar bills but most (my family included) just side eyed him and he moved on. I’ve never seen street performers so bold and confident with themselves as they are in New York.",
   "created_utc": 1691179539,
   "score": 6,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurrwgj",
   "message": "I saw a public bathroom where you didn't have to pay one time in NYC... that was REALLY weird.",
   "created_utc": 1691162363,
   "score": 10,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jus40nn",
   "message": "That dude who used pink panties on his face as a mask on the subway at the start of the pandemic.",
   "created_utc": 1691166899,
   "score": 8,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jut3oqh",
   "message": "Some dude was halfway through that new Snoop Dog meal from Jack in the Box and then out of nowhere he threw it on the ground, leans up against the stoplight and just has the absolute worst diah diah episode I've ever seen. Included were the sounds of someone who had hurricane Katrina coming out their ass..",
   "created_utc": 1691180310,
   "score": 5,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jut74rr",
   "message": "Hosting some out of town friends, and they marvel at how many people are in Times Square. As if on cue, a childhood friend from six states away walks by and recognizes me.\n\n\"crossroads of the world\" indeed.\n\nand a more NSFW entry- Riding the subway into queens at around 2am. Just me (a projectionist) and some dish washer type guys on the train.  Doors open, homeless looking woman gets on. She sits, coughs up a loogie, and spits out a glop of bright red *something* from her lungs, right onto the floor between us. \n\nNo one reacts, until we get to the next stop, when all of us except for homeless lady get up and go to other train cars. We all make eye contact and shake our heads.\n\nPublic sex is so common in the city it's not worth mentioning, btw.",
   "created_utc": 1691181639,
   "score": 8,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jutdmbz",
   "message": "Oh, Jesus, I grew up here in the 90’s so the list is endless.\n\nThe “I have no legs” guy on the train (he’d roll through the train in a pullcart saying I have no legs over and over in a singsong voice)\n\nLingerie jogging guy\n\nI used to walk through Central Park to get to work and there was a guy who used to do Tai Chi butt naked every morning not far from the pool at 103rd.\n\nA guy once offered me 50 bucks to buy him a ticket to the Show World in Times Square.  I was 13.  It’s a porn theater.\n\nA guy feeding a rat some of his m and m’s from his hand late at night at 34th street.",
   "created_utc": 1691184144,
   "score": 9,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusne9a",
   "message": "Was on vacation there and my wife and I were packed up ready to go. She wanted to grab some pizza before our trek to the airport and I figured it'd be the perfect time to smoke the last of my weed I'd packed into the tip of a cigarette. She orders pizza and I go for a little walk.\n\nI'm walking through a small park and light up. Then after a minute or 2 I see a cop, he sees me, I turn to walk a slightly different direction then him. He immediately walks directly to me. I had smoked half the cig so I knew I had no weed left in it. \n\nHe walks up to me and asks how I'm doing. I tell him I'm good and just soaking in the sights before I fly home. He then looks me in the eyes and says \"are you ok?\" I awkwardly tell him yeah I'm fine. He then says \"are you SURE you're ok?\" I tell him yes I'm fine and then he just says ok and heads off.\n\nThis was 2020, so weed wasn't recreational yet, but I'm 100% sure he knew and was just fucking with me because I was high. Definitely not the weirdest thing in NYC, but it was my weirdest experience in the short time I was there.",
   "created_utc": 1691174149,
   "score": 9,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jurg7vq",
   "message": "Homeless shit\n\nEdit: I mean literal shit.",
   "created_utc": 1691157828,
   "score": 5,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jus4j6t",
   "message": "When the circus elephants used to take over the street",
   "created_utc": 1691167096,
   "score": 3,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "juskpmv",
   "message": "I once saw a woman coming out of New York City with a frog in her hand",
   "created_utc": 1691173145,
   "score": 3,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusssn9",
   "message": "Walking in Soho about 2 AM and see a bunch of cops perform a take down.  But the cop cars were fake yellow cabs.  Lights behind the grill.  Pretty unexpected as a tourist.",
   "created_utc": 1691176179,
   "score": 5,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jusxs2h",
   "message": "My wife went with a friend who was having a medical procedure a couple years ago. She left her hotel one morning and there were a bunch of police, \"glass\" (probably plastic, from my thinking), and blood at the entrance.\n\nApparently someone in a drunken argument decided to pry loose a post box, smash it into the ground, and use a shard to stab someone's throat. \n\nMy sister's lived in NYC for years and never encountered that kind of insanity, so I expect it was just luck of the draw for my wife.",
   "created_utc": 1691178074,
   "score": 3,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jut6u9y",
   "message": "When I was on vacation in NYC years ago I saw a guy doing [this](https://www.youtube.com/watch?v=c8LfPyTGr-E\u0026amp;t=4s\u0026amp;ab_channel=Jimvonmeier) on the floor of the subway platform. That was pretty fucking weird.",
   "created_utc": 1691181523,
   "score": 6,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jut7oj5",
   "message": "Keypad on the showers at the YMCA after too many rapes. Explained why it was cheap.",
   "created_utc": 1691181854,
   "score": 3,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jutbi5n",
   "message": "Times Square COMPLETELY EMPTY besides for my brother and I… not a soul outside. It was EEIRE. It was the middle of the day too, not some weird random hour but definitely not expecting it to be a ghost town. I could hear the buzzing of the advertisements",
   "created_utc": 1691183300,
   "score": 3,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jutbm3o",
   "message": "Not me but my parents. Back in the 80's when mid-calf length skirts were in fashion, they were walking with another couple when a pigeon flew up the other woman's skirt. Evidently the pigeon only knew how to fly \\*up\\*, and the woman did a terrifically entertaining high-stepping dance down the avenue, screaming and batting at her skirt while the pigeon kept flapping. Evidently a crowd gathered to watch the goings-on. Finally, after about a half-block of this spectacle a very stunned and bewildered pigeon fell out of the skirt and wobbled to the curb while the woman, her panty hose in shreds, wobbled about on her high heels.",
   "created_utc": 1691183344,
   "score": 5,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jutj12i",
   "message": "So many things. My top three - one glorious the other two truly bizarre. ;\n\n1. Cold snowy night on a rooftop party in the lower east side. As we looked down from above on the street a guy comes out of nowhere and starts banging on a fence. Another guy appears and bangs on a trash can. Suddenly there’s about 10 people banging on various trash cans, lamp posts, fences - the noise evolved into a wonderful rhythmic percussion performance. It lasted about 10 minutes- and then everyone went in separate directions. One of my favorite musical moments to this day. It was there and gone - this was all before cell phones. Just random music made by strangers.\n\n2. After working all night I was changing trains in Grand Central and there was a man whose head looked like one of those shrunken head people in the movie Beetlejuice. He was in a white collared shirt and a tie - his head was the size of a softball. I was exhausted and convinced I was hallucinating do to lack of sleep. However after about six double takes - I was convinced this was real. Turns out it’s a rare genetic condition called microencephaly - I suspect this was an extreme case.\n\n3. 5 AM on the G train. There was a guy combing his hair and leaning forward. There was an anthill size pile of dandruff on the floor in front of him - as he combed more and more dandruff fell out.\n\n*edited to include another memory",
   "created_utc": 1691186344,
   "score": 7,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jutw8np",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jutlud9",
   "message": "this dude walking down the street, fully clothed, but his fly was down. and his cock was just out. just walking down the street minding his business. he seemed like a respectable man too. i mean he was wearing a very nice suit and tie, and his hair was combed back. he wasn't even hard",
   "created_utc": 1691187526,
   "score": 9,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jutjyo1",
   "message": "In Prospect Park in Brooklyn I saw a turtle eating a pile of pasta, it was the most Brooklyn thing I’d ever seen.",
   "created_utc": 1691186730,
   "score": 6,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jutm095",
   "message": "A very nicely dressed “business man” type in the financial district…. Walking nonchalantly at a quick pace with his semi erect penis hanging out of his fly. Pants were done up. He made eye contact with me. I had been in NYC for like 30 mins at the point… first visit.",
   "created_utc": 1691187596,
   "score": 6,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "juttzri",
   "message": "1. a guy used to roll himself up in a rug and lay down at crowded warehouse parties so people would step in him\n\n2. i witnessed two blind men come face to face in an intersection at 23rd street. they kind of were tapping the walking sticks they have together like a sword fight in slow motion, both seemingly confused and then a great amount of laughter from the two when they realized what was happening. \n\n3. a war vet looking guy was in a wheelchair next to me, and dropped his beer, i gladly picked it up for him. just after handing it back to him, he shitted out of a a tube in his stomach into another hand, and i noped the fuck out",
   "created_utc": 1691191096,
   "score": 5,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "jutpu3y",
   "message": "Probably pretty tame by this thread's standards but I saw a dog in wellies, a yellow rain slicker, and sunglasses that matched his owner's.",
   "created_utc": 1691189252,
   "score": 6,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "juttbth",
   "message": "I have only been to NYC once; I traveled to NJ for work for a two week training course.  A group of us got along really well and decided to take a bus to Times Square as none of us had ever been.  We got to the port authority \u0026amp; after a 45 minute trip several of us needed a restroom.  We found the first available bathroom at the terminal and entered, only to find a homeless man openly washing his balls in the sink.  I'm not talking a quick rinse, this fellow was fully linens-on-a-washboard by the river scrubbing with his pants around his ankles like a five year old using a urinal.  It was like watching someone work out a fresh batch of dough at a mall Cinnabon - if the dough had patchy hair and moles.  As astonished as we were to witness this first hand, it was much more interesting to see that NO ONE else seemed to even notice.",
   "created_utc": 1691190800,
   "score": 5,
   "submission_id": "15hyeqc"
  },
  {
   "comment_id": "juui2m3",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15hyeqc"
  }
 ]
}