{
 "submission_id": "15i1bkv",
 "title": "What was an incident that ruined your innocence?",
 "selftext": "",
 "created_utc": 1691158655,
 "permalink": "/r/AskReddit/comments/15i1bkv/what_was_an_incident_that_ruined_your_innocence/",
 "score": 7,
 "url": "https://www.reddit.com/r/AskReddit/comments/15i1bkv/what_was_an_incident_that_ruined_your_innocence/",
 "comments": [
  {
   "comment_id": "jurto2l",
   "message": "Not a massive deal but it's kinda funny:\n\nWhen I was a kid and staying over at a friend's house, his mother said she needed to speak to me in private. \nShe sat me down and explained that just because I had figured out Santa wasn't real, I can't continue to go around school spoiling it for all the others. \n\nThat wasn't me. I hadn't been doing that and I still believed in Santa...",
   "created_utc": 1691163020,
   "score": 195,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus0kh4",
   "message": "Nightmare as a child.  \n\n\n Walked into my parents bedroom to get comfort from parents.  \n\n\nMom was full on riding Dad and all I could say at the time was \"what are you guys doing?\"  \n\n\nWent back to my bedroom just trying to figure out what the heck is going on, and my dad came in a few minutes later and said \"So what'd ya see?\"  \n\n\n\"Mom was hugging you funny\"  \n\n\n\"Yes she was\"",
   "created_utc": 1691165606,
   "score": 77,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurxjiy",
   "message": "My parents divorced when I was around 2 so for as long as I could remember I spent every second weekend with my dad. That was normal to me, and in and of itself wasn’t a problem. We had a great time and overall was a positive influence though I think in retrospect I think I formed myself into the man I am today - I believe a pretty decent one - by learning from his mistakes as much a I was moulded by him.  \nWhen I was really young he would pick me up Friday evening and return me Sunday evening. Then as I got older Friday evening turned into early Saturday morning. Then late Saturday morning. Sunday evening became Sunday afternoon.  \nThen one Saturday, when I was about 13, he just didn’t show up at all.  \nAt around midday, while I was still sitting outside my house with my bag packed having waited for several hours at this point certain his car would pull into the driveway at any moment my mother summoned me inside because dad was on the phone. He was calling me from a pay phone just across the state border, to tell me he’d packed everything he owned into his car and driven through the night to be with his girlfriend who had recently moved interstate, so I wouldn’t be seeing him that weekend, or for the foreseeable future.  \n\nA couple of years later he sent me a plane ticket to come visit him, and I went. More for the prospect of flying interstate for the first time than seeing him, but I did want to see him. While driving from the airport to his girlfriend’s house, he made a point of showing me the pay phone he called me from. I really don’t know what he thought I’d get out of that.  \nWe don’t talk much anymore.\n\nEdit: I thought I’d insert this here since it came up in the replies and I realise where I left off might have made this unclear - apologies I posted this at like 1am then immediately fell asleep.  \nI stayed with him for a week and mostly we had a good time! We visited a theme park and played paintball. Did a lot of fun touristy stuff. As a teenager I still felt very close to my father even though it was bittersweet with all the ways he had hurt me emotionally. I don’t think he’s abusive, just really not interested in being a father, so I was more like his young friend - and that’s part of why I liked him. When we hung out we were just a couple of guys being dudes.  \nI don’t hate him, though maybe I’d be justified if I did. But that phone call when I was 13, and the stinger where he showed me the phone he abandoned me from two years later, were definitely some of the most painful moments of my young life.",
   "created_utc": 1691164472,
   "score": 168,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus2bj6",
   "message": "Crawling over a rock during a family outing to see my father on top of my mom’s best friend when I was 11. I was crushed and scared. The real fucked up thing is that they made me keep it secret. Which I did for two very long, tormented years.",
   "created_utc": 1691166258,
   "score": 249,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus7rgn",
   "message": "Walked in on my parents fucking while I had just lost a tooth, I was 7 years old.",
   "created_utc": 1691168306,
   "score": 121,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusc7m1",
   "message": "My first year of high school was when I got my first allowance. Five bucks a week, I was rich!\n\n\nSecond week of the school year, a new classmate asks me for a dollar so that he can buy something at the cafeteria since he forgot his lunch.  He will pay me back the day after. Ok.  I loan him a dollar.\n\nThe day after, he tells me he'll pay me back when he'll receive his allowance next week. Ok. I only get money once a week as well.\n\nCome next week, I remind him about the dollar.  He says he has no money.  \n\nLater that day, during lunch time, I see him buying a brownie at the cafeteria.\n\n\nA tough, but valuable lesson was learned that day.   And part of me still somewhat hope he's still begging for a dollar in some ditch at the moment.",
   "created_utc": 1691169971,
   "score": 58,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurjjl2",
   "message": "When i was 11/12yo my cousin showed me some silly pornographic games online.",
   "created_utc": 1691159171,
   "score": 58,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurjted",
   "message": "I saw my mom eating out the hairiest pussy I’ve ever seen on my favorite chair in the living room. Saw the video on her kindle and I been scared ever since",
   "created_utc": 1691159280,
   "score": 41,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus5s3o",
   "message": "I had two friends that would just steal from me.  I lost half my baseball cards because I wasn’t paying attention.  I lost an important set of comics books.  The specific moment… I found my empty wallet on the way to the friends house in the road.  My dad helped me get my money back.  I realized I was gullible shortly after this.  And surprisingly I stood up for myself eventually too.",
   "created_utc": 1691167571,
   "score": 57,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jut0wub",
   "message": "Parents were divorced, dad was an addict, saw him on weekends (lived with my mom) until I was about 4 when he relapsed and some legal shit went down that gave my mom full custody. Didn’t hear from him since (not even a card). \nMy whole childhood/teen years were spent thinking he was on the streets somewhere living addicted and homeless, and that’s the reason why I couldn’t even get a card and he didn’t pay a single cent of child support. \n\nFound out when I was 17 (through Facebook) that he got clean, moved to Arizona, got married, had a daughter. Had a very nice house with a big ass pool too. \n\nYeah idk that shit hurt ngl",
   "created_utc": 1691179253,
   "score": 212,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurq2db",
   "message": "The first time I remember my parents arguing in front of me. My father threatening to call the police on my mother if we were not returned at the exact time specified in the agreement. As in, if we were not there by 6:01.\n\nIt was the first realization my parents cared nothing for me and just cared about hurting the other parent.",
   "created_utc": 1691161664,
   "score": 60,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurzd4r",
   "message": "Watching my Dad lose his shit, clear the kitchen table of an entire meal, broken glass everywhere, hitting my mom. Me standing in the hallway after he left. My mom crying and telling me not to walk on the kitchen floor. I was about 3 years old.",
   "created_utc": 1691165154,
   "score": 67,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus126x",
   "message": "I was in 1st grade. Babysitter had a 12yo daughter. She showed me how to have sex and kissed and did all sorts of bullshit. Fucked me up pretty good and I suspect she was fucked up by someone in her fam. Still, I was 6yo and think it caused many underlying issues.",
   "created_utc": 1691165791,
   "score": 196,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurqdob",
   "message": "SirGlenn. A very well to do grandfather of mine, left all us kids in the family tree, $5000.00  (5000 1960's dollars) my father went to court to have all the money put in his name, as \"kids\" have no knowledge of finance.  Us kids, ended up with nothing. This was the last straw,  any of \"us kids\" gave even a pinch of respect to the new patriarch of the family.  He wasn't a patriarch, he was a thief.",
   "created_utc": 1691161783,
   "score": 103,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusluiv",
   "message": "Driving a car when I was 11 so my dad could hit his crack pipe and get his fix.\n\nTrue story. My mom would always make him take me with him in hopes that he would go where he said he would. We were supposed to be going to get things for dinner but I knew as soon as we left we weren't because the neighborhood we went too. Well after he got his rock he pulled over and said I need you to drive son. I looked up to my dad so I just thought he wanted to teach me to drive. Then as soon as I got in the drivers seat he pulls out his pipe puts his rock in it and lit it up. That was the day I lost my innocence as well as the respect for my dad. Also that's the day I learned what crack was.",
   "created_utc": 1691173569,
   "score": 227,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus1ex4",
   "message": "My little sister was raped, sodomized and murdered when she was 8 yrs old.... I was 9.",
   "created_utc": 1691165923,
   "score": 50,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus96y5",
   "message": "Three immediately come to mind and I'll list them in chronological order. \n\nThe first would be a singular episode of physical abuse (choking; both hands, pinned me down) from my father when I was 9 years old, after I'd taken his patience to the absolute end of the line with my shenanigans. I genuinely thought he was going to kill me before he snapped out of whatever had grabbed ahold of him for those few seconds. He has trauma from his childhood and I forgave him a long time ago but it left me feeling, well into my adulthood, like he didn't love me. \n\nThe second is when I was 11 years old and watched him shoot a raccoon that he'd trapped. He was a licensed professional trapper as a side hustle and I would go along with him when he checked his lines. He told me more than once that I didn't have to watch; he knew I was sensitive. But I didn't want to disappoint him by looking away. He shot it point blank, right between the eyes with a .22 rifle. I'll never forget the fear the raccoon was displaying in the instant before he shot it, and the violence of its death (involuntary motions, tonnes of blood etc). Absolutely traumatized the shit out of me. \n\nThird is when my sister was killed by a drunk driver when she was 25. I was 27. Turned the world completely upside down and now, at 39, I'm still dealing with the trauma and shock. It still feels like it happened yesterday and I have flashbacks to that awful day, and that period of time in general, a few times a week. I've talked to therapists (and I am one myself) but I don't know how to heal from it and I'm pretty sure at this point that I never really will. \n\nEdit - for structure and some grammar.",
   "created_utc": 1691168843,
   "score": 170,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusclpr",
   "message": "My bio-mum died when I was a week away from turning 8 years old. Amniotic embolism during childbirth (amniotic fluid got into her blood stream). It's almost always fatal from what I understand now, but it was incredibly traumatic because she hung on for 2 weeks in the ICU and I desperately wanted her to wake up and come home. \n\nI remember her hands the most. They were conveniently near my eyeline as a little girl standing beside the hospital bed. Normally they were beautiful graceful hands (she was a very pretty, elegant lady), but I hate that my strongest memory of them is all swollen and bruised and purple around her wedding band. \n\nIn Buddhist funeral tradition here, the immediate family has to go through a lot of prayers and rites for the deceased's soul. So since my baby brother was less than a month old at the time (this whole thing fucked up our relationship for a long time, but we're tight now), it was my father and a very traumatized 8 year old at the forefront of all of this. And he traveled a lot for work, so we (brother and I) lived with my aunt and grandma and a lot of the follow-up rites for the deceased fell to me.\n\nI had to check my mother's columbarium 'headstone' for spelling mistakes. \n\nWhen we transferred her ashes over to a bigger urn for their permanent resting place, I had to do it, by moving the bigger chunks from the smaller urn to the new one with chopsticks. That's how I learned that cremation isn't perfect and thick pieces of bone (skull, the ball joint of the femur etc) can be left behind. (I was reading well beyond my grade level and definitely could recognize certain bone shapes.)\n\nYeah, my innocence was well and truly shattered by that whole thing.",
   "created_utc": 1691170116,
   "score": 21,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurwc7x",
   "message": "My dad raped my friend when I was 11",
   "created_utc": 1691164025,
   "score": 86,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurwgtd",
   "message": "At 9, when I was in New Orleans with my parents I saw a drunk man walking down the street with his dick in hand, pissing as he walked.",
   "created_utc": 1691164073,
   "score": 133,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus92ol",
   "message": "My grandmother wouldnt let me read the Babysitters club MaryAnne and Too Many Boys because my mom was pretty promiscuous and my grandmother seems to value sexual purity above all else. I was like 7? 8? I was reading at like a 6th grade level. \nSo instead i was allowed to poke through an old stack of Readers Digest from the 80s...where i read an essay from a Chinese RN during the violently upheld single child policy days....and i learned that full term second children were EUTHANIZED WITH A NEEDLE OF POISON IN THE SOFTSPOT. \n\nkissed my innocence goodbye but at least i wasnt exposed to the dangers SEX",
   "created_utc": 1691168799,
   "score": 135,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus7j32",
   "message": "When I was 5 or 6 I didn't want to go to church with my mother, grandma, brother \u0026amp; sister. When we were going to the car my mother was so annoyed that she told me \"okay, go inside to dad and grandpa\". But I didn't.\n\nI climbed on a garden house roof from which I could spy into the living room and see  dad and grandpa putting the gifts under the tree. I was suspicious before, but then I knew that Santa isn't real. Everything is a lie.",
   "created_utc": 1691168220,
   "score": 248,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurw9ti",
   "message": "When my neighbour who I used to call uncle tried to molest me when I was 12 years old . Though he didn't succeed but it changed me  forever.",
   "created_utc": 1691164000,
   "score": 2,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jut1eqe",
   "message": "For years I asked my dad for career advice when I was in low 20s and out of college. I kept his advice in mind all the time and even wrote it down to remember. I've done all I could to land interviews and I either get ghosted or they reach me to say I'm not a right fit.\n\nI then was offered a free job/interview course from my university and decided to go but FORGOT to tell my dad as I usually tell him everything and pretty much learned a ton of things I was never told. \n\nAfterwards, I told my dad about it and started with, \"so my uni sent me an invite for interview/job courses and---\" before I even finished my sentence, he went on a rant saying those places are usually scams and they won't teach you anything and will just collect money because they can. Again, this course was free and I didn't even have a chance to tell him so I stopped out of my suspicion. \n\n2 months later, I found a job with a pay higher than my dad. I realized later that he never even did a job interview before because he was a boss at his own job that failed within 5 years because a lot of his employees hated him. Wasted like 5 years taking advice about job interviews when he never even had one before.",
   "created_utc": 1691179441,
   "score": 102,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus6wph",
   "message": "when my friends brother (who repeated 7th and 9th grade) told me to search up Redtube instead of YouTube because it’s better…. I was eight.\n\nAs I grew up I realized my buddy was in an abusive household, hope he’s doing ok",
   "created_utc": 1691167990,
   "score": 206,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus0cps",
   "message": "Sexually harassed by my sister's partner while I was sleeping. She caught him but she didn't break up with him. Made me realise that it's not always blood is thicker than water.",
   "created_utc": 1691165524,
   "score": 28,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusyhm2",
   "message": "I used to go over to my cousins house after school for a couple hours until my parents got off work. (They were 20 years older than me, kinda like uncle age really).\n\nMy uncle would go down on his wife in the middle of the house randomly. Their kids (two years older than me) would cheer them on. \n\nFucked me up really.",
   "created_utc": 1691178344,
   "score": 230,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jut2prs",
   "message": "I remember learning about periods (am female) in fourth grade Human Growth and Development and it sounded so awful that I was like “Why haven’t they found a cure? Does the president know?? Why isn’t anyone doing something about this?!” And just being _upset_. Welcome to the horrible world of female healthcare baby me :/",
   "created_utc": 1691179934,
   "score": 66,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusmia8",
   "message": "When a teenaged girl came to my house to cuss my family out (I was 8 years younger than her) and I was confused as to what happened.  Then later, my mother told me about my father's indiscretion and that girl was my half-sister.",
   "created_utc": 1691173816,
   "score": 177,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jursykq",
   "message": "I bit into a cookie thinking it was chocolate chip. Nope, oatmeal. I’ve never trusted a cookie since.",
   "created_utc": 1691162757,
   "score": 159,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurvcp1",
   "message": "My father was murdered when I was 9. Injected and overdosed against his will. Killer only got a year for it.",
   "created_utc": 1691163653,
   "score": 195,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurwi8s",
   "message": "1. In the 3rd grade REBECCA told me (out of the freaking blue) what sex is. I remember being like \"you're wrong! there is NO WAY my parents did that!\"\n\n2. Freshman year of college JAMES took my \"innocence.\" That was far more enjoyable and far less traumatic (which may be why I'm still with him).",
   "created_utc": 1691164087,
   "score": 229,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusg6mf",
   "message": "I was 14m hanging out with a 15f ( only 2 months older). She was neighbor of my older brother. We weren't dating, just hanging out, playing video games and walking to store.  I went to her house one day and her 3 brothers and mom were in family room, mom said she is upstairs go ahead up. I went up and knocked on her door, she said come in, when I entered she was standing there with nothing on. My innocence was lost that day.",
   "created_utc": 1691171444,
   "score": 78,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "juslu59",
   "message": "I was probably 17 or so and I saw one of those videos where someone was getting beheaded by a large knife. I had clicked on the link as it was found in a music forum I was involved with at the time. The gurgling sound. The blood. I couldn’t finish the video. From what I remember after looking it up, it was some video of a prisoner of war. I just… didn’t expect real death to be so much more horrific than TV and movie death.",
   "created_utc": 1691173564,
   "score": 87,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus3msi",
   "message": "When Mufasa and Little Foot's mom died. Fucked me up for awhile learning what death was.",
   "created_utc": 1691166754,
   "score": 157,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurtlev",
   "message": "My father s very sudden death when I was 16. My mother became a basket case and ceased being a parent. I had virtually no guidance after that. I had to make my own choices about schools, career and who to marry. I had nobody to go to when I was overwhelmed and troubled, nobody to vent to, nobody to help me make decisions. I did OK in life (I’m 58 now) but it cost me a lot of stress and agita. \n\nHere’s an example. The summer I was 15, in 1980, was great. Rode my bike everywhere, hung out with my friends, saw The Empire Strikes Back and The Blues Brothers five or six times each. Ate tons of pizza and enjoyed life.\n\nThen my dad died in his sleep in March of 1981, a month after my 16th birthday. My mother ordered me to find a summer job and a part time job for the fall (I was going into 12th grade). Since I was underage and nobody helped me get working papers, I had to lie about my age. I was a big kid so employers believed I was 18. I finally landed a job on a loading dock for an electronics company in Queens. The job involved loading and unloading huge crates of merchandise on and off trucks. My co-workers were some of the shadiest characters you ever saw. They smoked MJ almost endlessly. I had to take the NYC subway to and from that job every day. I hated it and I hated my life. That was the summer of 1981 and every summer after that for the next 5 years. I never had another free summer.",
   "created_utc": 1691162993,
   "score": 156,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus38hk",
   "message": "My dad letting his friends come over when he was ‘watching’ me. I was 8 and his friends molested me. My dad knew and did nothing to stop it.",
   "created_utc": 1691166604,
   "score": 181,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus40v6",
   "message": "Saw a video of dozens of chicks getting turned into red paste in some industrial blender. I was in middle school.",
   "created_utc": 1691166901,
   "score": 159,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurx4vo",
   "message": "When my dad said, “you know he does drugs right??” About my cousin who I adored. I was 12. Also 9/11. Also heart surgery.",
   "created_utc": 1691164320,
   "score": 211,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurmkys",
   "message": "I've been sexually harrassed when I was 10",
   "created_utc": 1691160373,
   "score": 181,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusjdii",
   "message": "My older sister was early in puberty maybe 11 or 12 but honestly even a few time before then she manipulated me into having sex or other inappropriate things, she used me as practice basically, my parents tried to ask about it a few times like if anyone even family has ever touched me I always denied just bc I was a kid and thought I’d be in trouble, now I know that it was abuse and her taking advantage but either way now I have a weirdly high sex drive and anxious when I have to sleep around other ppl, I just end up not sleeping lol",
   "created_utc": 1691172641,
   "score": 122,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusil44",
   "message": "When I was around 7 or 8 my best friends sister who was about a year older used to give me $1 if I watched her dry off and get dressed after we went swimming .",
   "created_utc": 1691172346,
   "score": 90,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "juso08z",
   "message": "First time I listened to someone die when I was a 911 operator. \n\nSpent years in emergency services after that, including ER nurse. I no longer have any innocence left.",
   "created_utc": 1691174375,
   "score": 108,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "juszypi",
   "message": "I saw my great-grandmother pass away in a nursing home. I was eight years old, elected to stay and I literally watched her take her last breath. \n\nMy poor Nana couldn’t even stay to see her out. She kept crying. She went out quietly, and there wasn’t much else. I didn’t know what happened so I just went cold. The school counselors tried talking to me about it the next day. I just stayed still…I stayed blocked off from the rest of the world. It was strange.\n\nI still feel strange about it now, despite hitting my 20s.",
   "created_utc": 1691178898,
   "score": 38,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurx4pe",
   "message": "9/11 happened when I was a freshman in high school. WAs definitely my “welcome to the real world” moment growing up.",
   "created_utc": 1691164318,
   "score": 142,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus76to",
   "message": "My sister, who is 4.5 years older than me, and I were fighting. She was a redneck and I was a Poe reading skater kid. We did not get along. She is in the kitchen and I am headed downstairs to get away from her. We fought a lot and she used to physically abuse me, not sexually, but twist my wrists and arms until I did what she said if she was ever left in charge. She would also try to convince me I was adopted because I had blonde hair and blue eyes and no one else had those traits in our immediate family. Anyways, we are verbally fighting in front of our parents, and I leave the room knowing she cant touch me with our parents around, as Im headed downstairs she tells me that she will \"see me later\", I knew it was a threat, bit with my folks there, i clapped back and called her a pool hall whore or some such, early nineties in central va, that was a deep cut, she lost it and starts screaming and coming towards me. My dad, calls her by her name and she took her anger at me and shouted at him \"what?!\". Thats all it took. My dad jumped up and started choking her. My mom is screaming my dads name as he has shoved her against the counter tops in the kitchen, choking her with both hands. I ran downstairs and loaded his 12 gauge shotgun with birdshot and went and hid in the dog house with the gun. Cops came, the whole 9. No one pressed charges. It is never spoken of. That night was when I knew I did not like or trust these people. I was 12. That christmas i stayed up late and saw my parents bringing in all of Santas gifts. But i think the first thing did more damage.😏",
   "created_utc": 1691168094,
   "score": 157,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurr20d",
   "message": "2 girls and 1 cup video…",
   "created_utc": 1691162040,
   "score": 107,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusr0li",
   "message": "My cousin forced me to do things to her and threatened to tell my mom that I was begging her to let me do those things if I said no.",
   "created_utc": 1691175503,
   "score": 37,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusnakq",
   "message": "Dhs sent me to my dad's over some bullshit(long story) and the first day was great then he roofied me and raped and abused me for 3 and a half months before I was able to go back home.\n\nI was 7",
   "created_utc": 1691174110,
   "score": 60,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurr22e",
   "message": "When i was but a lad of 10, my mother and I were ambling down enjoying a bag of roast chestnuts sold to us by an affable Welshman,  when from across the street approached a woman of I'll repute. Not knowing her nature, I ever do briefly spied on of her ankles, exposed for all to see, and though my Sainted mother did her best to avert my gaze, from that day on I was a man.",
   "created_utc": 1691162041,
   "score": 239,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusvlos",
   "message": "The principal and teachers not believing me when I said I was being bullied.\n\nThey said it had to be my fault because I was in there every week. \n\nI was in there every week because I was constantly being fucked with and defended myself time and time again. \n\nFuck you Ms. Palacios!",
   "created_utc": 1691177245,
   "score": 70,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus5gba",
   "message": "No incident, just growing up and losing the child's perspective of the world.",
   "created_utc": 1691167449,
   "score": 53,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus05d1",
   "message": "Watched a guy get murdered broad day in front of a corner store.",
   "created_utc": 1691165447,
   "score": 51,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusctce",
   "message": "My parents had sex while I was in their bed. Heard my mother say \"Touch my boobs\" \n\nThere isn't much more to say.",
   "created_utc": 1691170195,
   "score": 78,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusi1na",
   "message": "I don't know if it ruined my innocence per say. But I remember when I was about 9 I was visiting with my grandma who was a sweet and wonderful angel. She was on her normal business and all of a sudden the wool unveiled. Nothing grand, nothing different, I just knew she wasn't a good person.\n\nNow my grandma isn't a monster. She's just a narcissist who is sweet as honey on the outside, and rotten on the inside. \n\nBut yeah it's one of those \"core memories\" I hear about",
   "created_utc": 1691172141,
   "score": 47,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jus2ork",
   "message": "a sex game ad on my favorite flash game site",
   "created_utc": 1691166395,
   "score": 37,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusmzg8",
   "message": "I'm 16-17 years old.  My Father was a preacher; he preached all over.  I was old enough to drive myself and so I went to my regular congregation while the rest of the family went to wherever my Father was preaching that Sunday.  At my regular congregation, we were working on building our first church building.  Before the service, the pastor announces that someone had stolen some construction supplies from us and he asked for volunteers to agree to camp out at the construction site with guns to shoot whoever was stealing from us.  People volunteered.  No one objected.  16-17 year-old me KNEW this was wrong, but I'm just a kid.  That day I learned the difference between Christianity and \"Christianity\".",
   "created_utc": 1691173994,
   "score": 66,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusogo6",
   "message": "The time in the shower when I was 11 and the shower head hit me just right",
   "created_utc": 1691174549,
   "score": 38,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusqhpi",
   "message": "I don't remember how old I was but my parents bedroom's TV was the only one that had Direct TV, I went and turned it on, a sex scene was playing, it wasn't those nice sex scenes you might fin in romcoms or some series, it was like a woman who was a prostitute, they were going at doggy style and you could hear the V.O. of her saying something like \"I can't believe I ended up like this\", I just thought \"that's... I shouldn't have done this\" turned the tv off and left the room, I just wanted to watch tv, to this day, I've NEVER turned on their tv again",
   "created_utc": 1691175307,
   "score": 24,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jushd2n",
   "message": "being groomed by a grown woman on and off again over the course 6 years. no one cared because it was from 2010-2016 time frame and i’m also a girl. small town as well. people figured that we just had such slim pickings as lesbians that it wasn’t a big deal. i’m now the age that she was when i turned 18 and we were able to finally be really together, for all of a couple of months on and off. i realize now as a grown ass woman closer to 30 than i am to 20 just how much of my childhood that took from me and how negatively it affected me in ways i couldn’t back then. i was a sexually curious teenager no less, like every other teenager, but that was pretty fucked up of her.",
   "created_utc": 1691171884,
   "score": 35,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusnein",
   "message": "I saw a guy get a blow job behind a utility shack at a water park while I was on the line for a slide. I didn’t know what was going on at first but I knew I wanted in on it.",
   "created_utc": 1691174152,
   "score": 30,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusolwl",
   "message": "Watching E.T. as a kid, when I first understood that government can be the bad guys",
   "created_utc": 1691174603,
   "score": 28,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jut0ath",
   "message": "I was in a motorcycle accident when I was 30. I worked in Silicon Valley for a software R\u0026amp;D company and worked crazy hours; sometimes 15 hours a day. After my accident, my back was really sore and I needed to see a massage therapist. It was no big deal to me, as that was something that I did regularly when I lived on the East Coast.\n\nThe only place I found to get a massage during hours that I was available (10pm) was called the Golden Gypsy in Berkeley. Super convenient, being a half a mile away from my home! I called up and and asked about coming in, maybe I needed an appointment? It turns out all I had to do was show up.\n\nI rolled in after work and the place look like a windowless hotel. that didn't really bother me. I knocked on the door and I heard some shuffling inside. That also didn't bother me much. Beautiful woman with a long black dress open the door; the foyer had 1970s shag carpet, bright red. The wallpaper was a beautiful Victorian style velvet pattern also bright red. there were lights that went around the perimeter of the room where the walls met the ceiling that were also bright red. Apparently to me red flags don't look red under those conditions. As the woman lead me into the room there were about 12 women wearing short black dresses all lined up against a mirrored wall. Some smiled at me some kind of looked away. A couple of them even raised their eyebrows when I looked at them. \n\nWhat did I do? Did I notice anything was out of sorts? Was I doubting my decision to get a massage? No. I picked a tall blonde who had big hands. As she led me up the stairs to a tiny room with a foam mattress on what looks like a table I told her that my back was killing me because of my motorcycle accident and I really needed it worked on.\n\nShe asked for my credit card to get it approved and as she walked out of the room she said, \"just so you are aware, this is an 'entertainment only' massage.\"\n\nThat's when the last little bit of innocence that I dragged through my 20s slipped out of my body and was taken away by this beautiful blonde who had my credit card. When she came back to the room I told her I made a mistake and really needed a good deep tissue massage. Maybe some shiatsu. I handed her a $20 bill, thanked for her for her time And went home.\n\nThat weekend I found a place in Piedmont where the women had Birkenstocks, cargo pants, and did not shave their legs. Exactly what I was looking for in a massage business. Needless to say after about three months of therapy my back felt great but I will always carry the memory of losing my innocence at the Golden Gypsy.\n\n(sidenote: the woman I met at the Golden Gypsy turned out to be a good friend of one of my old friends in the area. I found this out by meeting her at his birthday party that he had at a local music club. She let me know he did not know about her work. )",
   "created_utc": 1691179024,
   "score": 30,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurz012",
   "message": "When I was young maybe like 7 or 8 at the time my cousin showed me pornography and he took me into his walk in closet to do something I didn’t know was wrong until years later. \n\nEdit: it was oral sex. I still haven’t forgiven him for it and haven’t even tried to talk to him about it or even ask why he did such a thing to me.\n\nEdit 2: I don’t even think he remembers doing it to me either. I have not once heard him say sorry or just talk about it with me multiple times when we have hung out together.",
   "created_utc": 1691165016,
   "score": 34,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusdp38",
   "message": "Walking home from school and finding porn mags under a flyover.",
   "created_utc": 1691170522,
   "score": 11,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "juslhae",
   "message": "in high school I had a business where I sold official documents from the secretariat like: permission to leave school, and if you are late you will be allowed in the class, .... to other students. I had made $680 when I got snitched and the school wanted to sue me for fraud and forgery. They didn't follow this through and I got off with a week suspension and €680 profit. I think I can see this as a success",
   "created_utc": 1691173430,
   "score": 9,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusu64t",
   "message": "My parents and I would go visit the Philippines at least once every two years when I was a kid. We'd go visit my grandparents, my uncles house, the beach, my godfathers rich house in Manila, and some restaurants throughout the whole trip and I would play with the local kids there and it would be great.\n\nOne time, my grandpa decided to bring me along to his trip at his friend's farm and show me the animals there. How could I resist? When I got there, I was playing around with the dogs, chickens, and goats there. But this one particular goat was very playful with me cause I remember I kept petting him a lot and he kept following me everywhere I go. I told my grandpa that I want him as a pet and he told his friends \"My grandson wants this goat, I'll take it!\" I was obviously excited cause it would be my first pet. But then I saw my grandpa, his friend, and some helpers slaughter the goat before my eyes and I started crying. The screams of the dying goat are seared into my memory.\n\nLater that day, we got back to my grandpa's house (where we were staying at) and my grandpa surprised my parents that I picked the goat for dinner. I didnt eat anything for the next couple days and my mom thought I was sick so she had me stay inside the house for a while. Since then, I never touched anything thats a goat or lamb and I'm a goddamn chef. I refused to even cook and/or serve goat cause I would still hear the screams from that very day.",
   "created_utc": 1691176704,
   "score": 144,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusajqt",
   "message": "My much older sister learned in school about the sun exploding millions of years into the future. She explained to me in great detail while on a camping trip how it was inevitable and that it wouldn't matter because we'd all be dead anyway. I was 4.",
   "created_utc": 1691169351,
   "score": 39,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurypqo",
   "message": "I have a bunch of memories, learning about the realities of food/hunting, seeing pornography, seeing how drunk people behave like idiots.\n\nbut the most vivid was coming home from primary school and my mum telling me my Dad was having an affair and had run off with a family friend (one of my friends mum). Thats a core memory.\n\nHe came back the next day but they were seperated within a year and divorce when I was in high school. Dad and his AP have been together for \\~30 years now.",
   "created_utc": 1691164909,
   "score": 19,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jurqbd7",
   "message": "I was very fond of the cartoon show Ben 10\n\nAt the age of 11-12, once I searched Alien X videos on google and then...",
   "created_utc": 1691161759,
   "score": 39,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jutriqg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jutrii2",
   "message": "I was maybe six years old and taking a bath with the bathroom door open. I had a fear that if the door closed I would be locked in forever, and so everyone obliged me (2 siblings and my mom). One day I am in the bath and daydreaming. As a kid I wanted to be a director so I would daydream entire movies in my head constantly. \n\nMy eyes are closed as I begin to sink lower into the bath, when suddenly I am submerged entirely. Two hands were weighing down on my shoulders and I quickly realized I was being drowned. I tried to scream but my mouth was filling with water, so obviously I couldn't. Then out of nowhere the hands are gone and I rise up to see my mother staring back at me with tears streaming down her cheeks.\n\nI didn't say anything, perhaps I was confused or just too afraid to. She told me, \"I am so sorry.\" Then turned and left the room just like that. \n\nNot the only time a situation like that arose, just the first in my memory, and probably my first brush with the idea. Luckily I survived all attempts and have since been able to enjoy baths as an adult in peace.",
   "created_utc": 1691189988,
   "score": 70,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusflnb",
   "message": "The first time I realized that a guy wasn’t listening to a thing I said and just wanted my body. It made me sad.",
   "created_utc": 1691171228,
   "score": 45,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusdsgg",
   "message": "When I was about 5, I watched a video that was in my dad’s camcorder of what looked like people taking off their dicks and banging each other with them, but I guess now that they were strap-ons",
   "created_utc": 1691170557,
   "score": 15,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jussprs",
   "message": "This is a bit dark and not humorous unlike a lot of the comments but whenever I was a kid I didn't really have friends, I was obsessed with anime and since I got bullied due to my interest I just went online and talked to people. A lot of those people were grown ass men pretending to be around my age, they would talk about anime series and try being my \"friend.\" \n\nwithout graphic detail they groomed me and would send videos of them getting off. Which I had no idea what was happening or what a dick looked like, it was just weird to me at the time because i was clueless on what i was seeing and why they were making \"weird noises.\" \n\nIt only got worse because then they'd actually send me porn and be manipulative when I said no to me not wanting to watching it with them. \n\nI look back and hope that they've gotten caught or haven't harmed and took another child's innocence, that they'll live the absolute worse lives. The internet is sick sometimes and It's awful children have to go through these sick pedos, stay safe strangers.",
   "created_utc": 1691176150,
   "score": 24,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusxlal",
   "message": "Probably getting molested by an extended family member when I was six, and the ensuing fallout from that. I had a lot of sexual hang ups for years, it ruined the holiday of Thanksgiving for me, and I don’t like associating with my Mom’s side of the family at all to this day.\n\nI feel like it also stressed my relationship with my Dad, because I was pretty traumatized for years over it and he never quite “got it”. He’d tell me to man up and just move past it, in his mind I think he just figured it was like getting beat up or something? Id have full blown panic attacks whenever I’d have to be around that family member, and I think he thought he was helping by pushing me to confront it and be around that cousin (there were other people around, so I guess he figured I’d feel safe) but all it did was harm my trust in him and make me feel like my Dad didn’t have my back.\n\nI’m a guy btw, if that makes a difference. And the cousin is an older guy.",
   "created_utc": 1691178004,
   "score": 16,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "juuvzha",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jut4w3o",
   "message": "I was nine. My mom was abusive and I felt unwanted. We had a neighbor who loved me. She treated me like her own kid. She would protect me when my mom would beat me with a leather belt or scream at me or slap me. \n\nOne day her husband called me over. I called the neighbor, Mom (her surname) and called her husband Dad (surname). \nBasically, he tried to rape me. I didn't know what he was doing, but he put me on the couch and took off his pants and lay on top of me. \n\nMy brother, came knocking on the door, shouting that my granny was calling me. The neighbor let me go. \n\nI went home very confused that day, my granny wasn't even home.\n I told my brother years later that he saved me from getting raped. He told me he knows. \n\nMy brother is two years younger than me. So he must've been around 7.",
   "created_utc": 1691180769,
   "score": 19,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jutkatp",
   "message": "High school, about 1960. Got a part time job in a small hospital in a small farm town.  I was the \"shitty little jobs\" guy.  Somebody puked in the E.R. waiting room?  Call BobT21.  \n\nSo there was a major accident.  A flatbed truck full of farm workers collided with a bus full of Sunday school students.  Mass Casualty plan was initiated, I got sent to the E.R. ER Supervisor nurse \"Genghis Connie\" \"Hold this on there, don't stop until I tell you to, don't lose it in front of the patient.\"  My illusions about \"life being good\" vanished.\n\nAfter it calmed down I snuck out by the dumpster for a smoke.  Connie was out there crying.  She told me \"If you ever tell anybody about this, you will regret it.  I know where the nerves are.\"  \n\n60 years later, I have just told Connie's secret.",
   "created_utc": 1691186871,
   "score": 18,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jusv5c7",
   "message": "One day I was 6 and I was watching classic smosh and I heard a line saying \"sex\" so I was wondering, what's a sex? So i searched it up and went to videos...big mistake",
   "created_utc": 1691177071,
   "score": 16,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "just25d",
   "message": "When I was about 10 years old, I found out that my mother was actively cheating on my father and had been doing so for their entire relationship. When I confronted her about it, she grabbed an X-acto knife and threatened to slit her wrists because she was such a horrible mother.",
   "created_utc": 1691176281,
   "score": 13,
   "submission_id": "15i1bkv"
  },
  {
   "comment_id": "jutcm27",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15i1bkv"
  }
 ]
}