{
 "submission_id": "15i1ing",
 "title": "How did you almost die?",
 "selftext": "",
 "created_utc": 1691159137,
 "permalink": "/r/AskReddit/comments/15i1ing/how_did_you_almost_die/",
 "score": 152,
 "url": "https://www.reddit.com/r/AskReddit/comments/15i1ing/how_did_you_almost_die/",
 "comments": [
  {
   "comment_id": "jurjw4h",
   "message": "Cancer. Lost my legs tho",
   "created_utc": 1691159311,
   "score": 172,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurr1pz",
   "message": "A meth overdose. I was 22, deep in the midst of addiction, hadn’t eaten for 2 weeks or drank anything for days. \nI was somewhat forced to shoot up (during this time I was an addict, the person supplying me was an abusive ex) he told me if I didn’t shoot up I wasn’t allowed to use anymore, so I did.\n\nHe did it for me, chose how much, stuck my arm and i immediately blanked out. I don’t remember much of that day other than honestly believing it was the end and I was going to die. \nI quit using after that and moved away from him and I’ve been clean from it since. Next month makes 8 years clean.\n\n\nEdit: WOW. Wow, wow wow wow. I love you all and I am trying to answer all questions in regard to what happened and about this experience, thankfully I am off work and it’s a Friday, my fiancé has a friend over and I am trying to answer all questions (serious and silly alike) \nAnd I am so grateful for all of you asking questions and giving support. \nI’m in tears right now. \nThis never felt like something I would be speaking about anonymous yet openly about or anything I would be able to help someone with, so please don’t hesitate to ask questions, I will respond when I can. \n\nIf it matters, I’m sitting in my garage right now reading and responding and I do feel as if any and all prayers I’ve ever prayed had been answered. \nI’m willing to give any answer, advice, support, suggestions that are needed. \nYou all rock ❤️",
   "created_utc": 1691162037,
   "score": 81,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurjvn1",
   "message": "Cancer.  Fucked it off twice now.",
   "created_utc": 1691159306,
   "score": 252,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurkso4",
   "message": "Table saw blade flew off under my armpit. Didn’t tighten it up enough",
   "created_utc": 1691159671,
   "score": 85,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurqv4j",
   "message": "Got locked in the boot of the car for about an hour during an Australian summer. I don't remember what I did (if anything) to make my mum punish me like that. I was 8 years old.",
   "created_utc": 1691161967,
   "score": 43,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurs8ky",
   "message": "A few weeks ago I was walking home from the grocery store late at night and noticed a homeless guy across the street looking a bit off. I wasn't sure if he was high or having mental issues or just entertaining himself. He started to cross the street diagonally towards me and had one hand stuffed in his jacket. I felt a bit uneasy about the situation so I phoned a family member, picked up my pace, and kept looking at him to check where he was in relation to me. When my mom picked up the phone I spoke a bit louder than usual and told her I was walking home down ABC street. I didn't say anything about the guy, I just asked her about her day, but I wanted to be on the line with someone just in case. After a few seconds, he turned and stopped following me\n\nLess than 12 hours later, less than 2 blocks away, someone was stabbed and nearly killed. When I saw the face of the alleged perp on the news, it was the same guy who had been following me down the street. I was pretty unnerved the day I saw that. If I were less aware of my surroundings or less trusting of my gut, who knows if it would have been me he stabbed.",
   "created_utc": 1691162488,
   "score": 195,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurlu5e",
   "message": "Drinking. At some point i think i was trying to kill myself with alcohol. Shit gets really bad, in your head, you start losing your mind. Not to mention all the stupid stuff i did that couldve led to my or someone elses death..",
   "created_utc": 1691160084,
   "score": 196,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus9s08",
   "message": "Cancer stage 4…. Given less then a month.. that was 10 years ago",
   "created_utc": 1691169061,
   "score": 147,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus1rht",
   "message": "Exploring tidal cliffs, accidentally slipped into the water. Went in sideways, narrowly missed hitting my head. Just barely clawed my way out of the rough tidal zone; it was way over my head \u0026amp; was so choppy I was being slammed against rock. Please be careful around tidal cliff zones!",
   "created_utc": 1691166052,
   "score": 252,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurymgy",
   "message": "Caught an incredibly rare fungus that attacked my lungs and would have attacked my other internal organs. Took two years to diagnose because it’s so rare. Only patient my respirologist has ever seen with it.\nDropped to almost 80 pounds. I could literally feel myself slowly dying.",
   "created_utc": 1691164875,
   "score": 68,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurkh1u",
   "message": "Mixture of so much coke and a shitload of mdma at a party. Spazzed out and started seizing. Just as everyone was about to call an ambulance I started to come back round but it was a close call so I'm told. Really made me change my behaviour",
   "created_utc": 1691159543,
   "score": 31,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus0cij",
   "message": "Walking down the pavement with my girlfriend holding hands when i was 18... person driving a car and using their mobile phone mounted the pavement at 45ish miles an hour and hit my girlfriend square on, broke my wrist and compound fracture of my right arm..  threw my girl 120ft down the road and killed her outright...i didnt even feel the pain in my arm while i cradled her broken body... found out at autopsy that she was 4 weeks pregnant with my first child... Driver got 2 years suspended sentence and i saw him laughing and joking with friends and family as he left court, never even apoligised... totally broke me, survivors guilt is horrible and my life has been a car crash (this wording was intentional) ever since..\n\nUpdate,... thank you all for your kind words.. im ok, not the best i could be but im dealing with it and will be for the rest of my life. Its hard but i know i can do it and Barbs wouldnt want me to destroy or hurt myself forever, i know that but its so hard sometimes.\nI have progressed more in the last 5 years than i could imagine and just take every day as it comes, one day at a time, doesnt make it easier, just a little more bearable... i just wanted to answer the question and ive found that talking about it and telling ppl makes it a bit easier (especially when i can be sort of anonymous on Reddit) than bottling it all up like i did for years and years for it all to come out suddenly and then i make stupid or even dangerous decisions. I dont want pity, just a bit of  understanding when i say im having a bad day and need to be on my own.\nThanks again everyone, your words mean a lot and i appreciate them greatly.",
   "created_utc": 1691165522,
   "score": 139,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurt9ap",
   "message": "Not me but my childhood friend. We were playing with my dad's tools in the garage when my friend felt something sting him. He dropped the hammer he had, and a black widow went crawling away. We both looked at each other then the bite. On the skin in between his fingers, there are two pin marks where the fangs pierced him. We didn't tell anyone bc we weren't supposed to be there. Luckily he didn't die, but in retrospect that could have turned out a whole lot worse.",
   "created_utc": 1691162868,
   "score": 55,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurndwp",
   "message": "Was trying to buy illegal stuff in Mexico(college spring break), we ask a bell boy at our hotel, he says to meet in the lobby at 8 PM, SCORE! We get ready and head down to the lobby. We are told to get into this white jeep. We are hesitant, they can tell, they offer us a beer, they had a 30 pack in between the driver and passenger, red flag, we were in college and were like \"Hell yeah!\". The next 30 minutes were them cussing us out, telling us to leave their country, all Americans do is come down and treat their country like shit, and so on and so on. At one point my friend puts his hand on the driver's shoulder to try and calm him down, he pulls out a gun and slaps my friend's face with it. He is drunk, getting extremely angry at us, and is speeding and swerving on these narrow dirt roads outside of Cabo. It is a neighborhood so there are cars lined up on both sides of the street, not much room for error. As we are preparing to die, I am looking at the road up ahead, trying to see if there is a good way spot to jump out and roll out of the car. Nothing. A few minutes later(felt like an eternity) the driver slams on his breaks, yells something in Spanish, and tells us to get out. We do. The driver and passenger get out and tell us to stop. We do. He is holding his gun. We tell them we just want to go back to our hotel, we are sorry for upsetting him. He laughs. He says, don't you guys want some party favors? We are shocked. But we reply yes. lol. He says 100 dollars, we don't argue. We pay him and he says actually give me all the money in your wallet, we oblige.  They give us maybe 10 dollars worth of white powder. They laugh and drive off, the car is smoking and whistling, he was driving it so hard trying to scare us. We call a taxi, go to our room, compose ourselves for the next 30 minutes, we then go out to the club and try and score some more! College stupidity at its finest!",
   "created_utc": 1691160686,
   "score": 88,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurupe6",
   "message": "My dad was driving our family of 4 down a highway(?) it was en route to Bakersfield Ca and I remember there were trees and open fields on either side of the road. If anyone is familiar with that area y’all can correct me if I’m wrong. I remember my dad was drinking a beer and had just finished one and he asked me to pass him another one from the cooler he had in the back seat. I don’t know if I was being cheeky or if I just sensed something wrong but I didn’t give him another beer. He kept yelling at me and getting more and more angry until he decided to aim the car at the center divide straight into a huge tree. I thought we were all going to die and it was all my fault but then at the last minute my mom pulled at the steering wheel and we just kind of fishtailed instead of hitting anything. I know it wasn’t my fault but I was fairly young at the time, maybe 8ish and it was just scary.",
   "created_utc": 1691163412,
   "score": 112,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurw13o",
   "message": "Giving birth.",
   "created_utc": 1691163908,
   "score": 240,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus1utq",
   "message": "T-boned by a cement truck. Guy at the tow yard couldn’t believe I was still alive.",
   "created_utc": 1691166087,
   "score": 237,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurty1h",
   "message": "Not drinking enough while at sea.\n\nBurning up and felt crap went for a sleep on my bunk and woke up six hours later as I was dumped into a bath full of ice.\n\nThe sickbay nurse then made me drink a 5 litre jug of weak orange with some other stuff in it over an hour.\nOnce I finished that she gave me another to finish off.\n\nWhen I was found I had a temperature of 107° apparently, so was carried straight to sick bay and dumped in the bath.\nI didn’t remember any of it apart from the shock of hitting the frozen water.\n\nA few years later and it’s winter, a friends dog has chased a duck onto a frozen pond and fallen through the ice. I didn’t hesitate and slid out onto the ice on my belly and got to within six feet of the dog when the ice cracked and I went in as well.\n\nI wasn’t overly worried as the ice was only about half an inch and the depth was about 20’.\nSo I grabbed the dog, swung him up and literally threw him across the ice towards the edge then just made my way breaking the ice until I could stand up and get to shore.\n\nOnly once I got there did I realise just how cold and numb I was but I didn’t care, Home was only half a mile and I’d saved the dog...👍",
   "created_utc": 1691163125,
   "score": 89,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurv3ep",
   "message": "For a laugh, i took a big lungful of helium from the tank at work as i was leaving, walked out back to where my friends were waiting for me, was going to say something in a funny helium voice when i saw them, but i apparently blacked out out once i got outside, walked across the road and faceplanted in the dirt.  Scraped my ear on a piece of rebar that was sticking out of the ground about 18 inches.   Had i been a bit to the left, it would have gone straight through my head.   My friends said i went in to convulsions for a bit, and then i stood up confused.",
   "created_utc": 1691163557,
   "score": 79,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurx14k",
   "message": "This actually happened to me recently, July 20th 2023, I was hit by a truck while riding my bicycle, multiple compound fractures in my leg, and a cracked pelvis, luckily walked away with my life and no head injuries.",
   "created_utc": 1691164281,
   "score": 167,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurtufg",
   "message": "A bootleg grounded outlet. \n\nScummy landlord didnt want to bring an old house up to code, so his maintenance guy flipped the polarity on all the outlets, and tied ground to hot. \n\nSomehow this tricks an outlet tester into showing a pass. \n\nBut this makes grounded things, like guitar strings and microphones, electrically hot. \n\nI had one in each hand and clenched. I had to mummy walk into the next room till something unplugged. Walked away with burns on my palms.",
   "created_utc": 1691163087,
   "score": 195,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus11ej",
   "message": "Besides close calls in Iraq, including a sniper round flying right by my ear (I felt the heat and air) and it hit the wall right behind me. \n\nIn 2011, I almost drown. \n\nI was at the beach with my wife and her parents, the tide was strong and a lot of waves. If went in to my knees and when wave would hit water would be up to my neck and then there would be strong current pulling back. \nI decided to swim out, it was fun swimming up a wave then getting dropped down, except after one wave another came, I got thrown under the water, tossed around, there was rocks on the floor and I felt cuts and \"road rash\".  I let go, decided it was not a fight I was going to win. It became peaceful and I passed out. \n\nI ended up on the beach, few people pulled me out. I didn't get CPR as I woke up as the lifeguard was approaching. Bruises and cuts all over me but alive. \n\nEven though I was a strong swimmer, in shape the ocean was stronger and I learned my lesson.",
   "created_utc": 1691165783,
   "score": 150,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurxf1l",
   "message": "Hemmorhaging after birthing. Placenta wasn't detatching and the midwife assistant tugged and tore the umbilical cord. It had to be manually removed along with handfulls of clotting blood.",
   "created_utc": 1691164425,
   "score": 76,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurrmit",
   "message": "Dismantling an intact ww2 era mortar round with a hammer, punch and vicegrips. Or so ive been told afterwards but personally disagree.",
   "created_utc": 1691162258,
   "score": 251,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurudzg",
   "message": "Neonatal bronchitis. In the ICU at 6 weeks and almost went.",
   "created_utc": 1691163293,
   "score": 120,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus11xm",
   "message": "I died during gall bladder surgery when the surgeon accidentally nicked my liver and I bled out. Thankfully, he managed to realive me and I'm still here 22 years on!",
   "created_utc": 1691165788,
   "score": 26,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurytbi",
   "message": "When we were getting in the car to go to school, my little brother had this habit of turning on the ignition. One day, he forgot to open the garage door. Our mom wasn't very quick to get her bag that day. I remember talking to him and how we both agreed we were still tired, and I remember waking up to the sound of the garage door opening and my mom being pissed",
   "created_utc": 1691164946,
   "score": 155,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurzrfa",
   "message": "Got a tattoo on my leg, not my first tattoo so i figured it would be a simple heal like the others were... apparently not. \n\nFirst couple of days were a breeze, after day 2 I couldn't stretch my calf to walk so i had a limp, but I wasn't really concerned at this point. \n\nDay 4 rolls round, and by this point, it's a deep shade of red and burning hot, so I described what was going on to the artist and got told that it was okay and leg tattoos usually end up like that, in hindsight I should've gone to the Dr's for it but I trusted the artist and figured it was okay and it's just freaking me out cause it was my first leg tat. \n\nI still had an inkling of doubt in the artists response so I'd asked my mate to take a look and see what she reckons, and naturally she flipped out and told me to get it checked. But I'm an idiot, so I didn't listen to her right away, but by that night, it had gone from red to dark purple with pus blisters forming so I went to a\u0026amp;e. I would've died had I not gone to the hospital that night. \n\nIt was my own fault cause I should've gone on day 4, but it's over now.",
   "created_utc": 1691165302,
   "score": 125,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "juru2nn",
   "message": "Hit by a car (twice). Stepped out in street in front of a Lincoln while running one night in Athens/UGA. Stepped out of my broken car and got sideswiped by passing car before I could get back in. Stay in your car folks. God looks out for fools \nAlmost struck by lightning   Hit 6 feet away\nStalked by 3 black bears at Mt LeConte lodge in TN, Smoky Mountains",
   "created_utc": 1691163173,
   "score": 107,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus157l",
   "message": "In college when i was a freshman. Got too drunk and high at a party where i hadn’t smoked in probs like 2 years. Got back too my room and passed out on the bed. \n\nWoke up too my roommate dragging me off the bed and yelling. Was not coherent. Turns out i was blue in the face choking on my vomit.\n\nCrazy thing is he wasn’t suppose too come home that night. He was suppose too stay at someone else’s place and something told him not too, and he came back. Dude saved my life, still best friends too this day",
   "created_utc": 1691165823,
   "score": 242,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurpa53",
   "message": "This was a long time ago. They wanted to build a building on top of a main sewer line on the banks of the Ohio river so it had to be dug up and encased in concrete. It was 40 foot deep. So we dug a 20 foot deep hole and laid it back. Then in the bottom of that we dug a 20 foot hole for our ditch boxes. Our ditch box was 16 foot wide 20 foot long and came in 3 sections 2, 8 foot high and 1, 4 foot high. So we took cables hooked up an 8 foot tall section and I got on top grabbed the cable and the track hoe lifted me and the box and set us in the bottom of the hole. I unhooked the cables grabbed hold of the end and the track hoe pulled me out of the ditch. Repeat for the other two sections. We had just set the last section and I was unhooking the cable when the entire side of the ditch caved the box jerked and I had to grab the cable to keep from falling 20 feet into the ditch. 10 minuets earlier and they could have just put a stone slab on top of that hole.",
   "created_utc": 1691161377,
   "score": 70,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus2wgf",
   "message": "In the fall of '91 I was in Hawaii and dove into this [blow hole in Hanauma Bay](https://youtu.be/lxIe_3aU7MY). (That's not me in the video, but it's the blow hole.)\n\nMy buddies were doing it and it was no problem for them.\n\nThe problem for me was that I was a lot bigger than them, so my lats got stuck as I was face down in the hole.\n\nThe concept is you time the waves and dive in just as the water recedes and the flow pulls you through.\n\nWell, I got stuck and had to wiggle my way down, ripping up the skin on my lats and ribs.\n\nSo I finally get down and I have to swim like a mofo, but it's too late...the next flow is coming in.\n\nI'm at the edge, almost there, so I have to grab onto the edge with both hands like a kidnapping victim holds the doorframe so as not to be abducted.\n\nThe wave cycle is not very long, but when you're doing something new and panicking, it feels like an eternity.\n\nI've heard they have closed off this portion of the bay.\n\nI know I don't need to do that again!",
   "created_utc": 1691166477,
   "score": 212,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jush49p",
   "message": "Car accident when I was 12.  My dad was hopped up on pain killers and driving me to Little League tryouts.  He fell asleep at the wheel and went head in into a tree going about 40 on a country road.  Broke my right femur, left arm, collapsed a lung, tore apart my left knee ligaments, crushed my left foot.  I was in ICU for a few days in a coma and the femur break came really close to knocking the artery and sending me off to the land of the dead.\n\nWhat it really killed was all of my confidence and pretty much ruined my childhood.  I developed a severe anxiety disorder and became a recluse.  I stopped playing sports and just stayed indoors a lot.",
   "created_utc": 1691171793,
   "score": 235,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurkd0j",
   "message": "I was driving my Royal Enfield 350CC at 90kmph on a flyover, suddenly felt heat on throat and it took me a second to put my hand in between the kite thread and throat and by the time I grabbed it and threw it over my head, it was halfway in my right thumb. If I have not reacted like that ffs, I would be bleeding through my Jugular vein like a pig. Still have that mark on my neck.\n\nP.S.\nPeople here in India fly kites during August to celebrate Independence Day and most of them use threads which are chinese and are laced with powdered fibre glass to fight with other flying kites.",
   "created_utc": 1691159499,
   "score": 186,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurvcjk",
   "message": "Starving myself for weeks, staying up seven days at a time and binge drinking the whole time.",
   "created_utc": 1691163651,
   "score": 109,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurtah4",
   "message": "Drunk at a train station, realised I was on the wrong platform and jumped onto the tracks to quickly get to the right platform - got hit by the train I wanted to catch! Thankfully it was going very slowly at this point...",
   "created_utc": 1691162881,
   "score": 155,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurxf8z",
   "message": "Got lost in the Bolivian rainforest for three days after consuming tea made from angel trumpets.",
   "created_utc": 1691164427,
   "score": 36,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurn12b",
   "message": "Was at a party and these chicks start fighting so of course the dudes gotta get in the mix. Dude pulled out his strap and let off a shot towards the ceiling right next to my ear. Im just glad he didn’t have it tilted enough my way to blow my head off",
   "created_utc": 1691160550,
   "score": 113,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurniri",
   "message": "I'm pretty sure it wouldn't of killed me, but I only have a 2nd one that wa spretty easy to avoid, so a bus. I was walking on the sidewalk and tripped on a tile, sent me flying, and heading towards the street as a bus was passing by, luckily somebody caught me.",
   "created_utc": 1691160737,
   "score": 22,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus0alb",
   "message": "My mom stopped her car on the tracks when a train was coming thankfully with all the screaming of the kids she snapped out of whatever she was doing and drove off of it.",
   "created_utc": 1691165502,
   "score": 79,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurq3fq",
   "message": "A tooth almost got me. Got infected and got into my blood stream: got a nice stay in ICU",
   "created_utc": 1691161675,
   "score": 67,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurtyyi",
   "message": "Suicide. It happens.",
   "created_utc": 1691163135,
   "score": 84,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurxnyz",
   "message": "brain tumor and brain cancer. the cytostatic treatments were horrible, i vomited more than ten times a day and shat my self more than ten times a day, could barely stay awake, couldn't communicate with anyone because as soon as i tried to talk i vomited, lost all my muscles, almost starved to death, got underweight, got diplopia, my spine got bent due to my position when i laid down all day, lost my eyebrows, got too thick saliva to be able to swallow it and more",
   "created_utc": 1691164518,
   "score": 50,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurv8pm",
   "message": "Was walking to the gym from my car in the parking lot and these two girls were speeding and cutting through the parking lot and were an inch away from hitting me while I was crossing from parking lot to the gym. Never had my life flash before\nmy eyes before",
   "created_utc": 1691163612,
   "score": 34,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurwws8",
   "message": "Hanging, that hurt",
   "created_utc": 1691164236,
   "score": 40,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus0g66",
   "message": "The night before Memorial Day 2023 I was driving home from work, was waiting at a stop light; my light turned green and I proceeded to cross the intersection when a Chevy Traverse blew his light and smashed into my Nissan Versa Note. I think you can guess who won that battle (it wasn’t my hatchback). I spent two days in shock trauma and another weekish on the couch before I could walk upright to the bathroom. In addition, my left arm went through my drivers side window and I got 42 stitches. If I wasn’t wearing my seat belt I would have been killed. \nAn interesting postscript, I posted pictures of my car on Facebook saying “Please wear your seat belt, your family wants you around” etc etc and got the normal “Hey, glad you’re ok” comments, except from my ex girlfriend who had recently friended me again after not hearing from her for years. She commented “It’s everyone’s choice whether they want to wear one or not, you shouldn’t be telling people how to live their lives.” Completely inappropriate considering it was so recent I was still cleaning dried blood off my skin, she got the immediate unfriend and block.",
   "created_utc": 1691165560,
   "score": 52,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus0s4y",
   "message": "Hemorrhage during child birth. Lost a lot of blood, placenta disintegrated and had to be manually retrieved (worst pain I’ve ever had.. even worse than the contractions) childbirth can go so bad so fast.  I only have one kid because of it",
   "created_utc": 1691165685,
   "score": 48,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurs6b0",
   "message": "Due to airstrike.",
   "created_utc": 1691162464,
   "score": 27,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurtklm",
   "message": "Kratom. After just 2 weeks of taking it, my liver was in overdrive \u0026amp; started to shut down. Nearly died. Diagnosed with liver damage, spent weeks in hospital..it was wild.",
   "created_utc": 1691162985,
   "score": 63,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus3bqu",
   "message": "I got drugged at a local bar when I was i think 25. It was the scariest thing in hindsight. I was at the bar, talking to the bar tender, then next thing I knew I was half conscious laying in the bathroom covered in vomit. There is a whole block of time that I lost and can not remember for the life of me, but everything before that and after waking up in the bathroom, I remember fine. I was in and out of consciousness. It was a single bathroom, and i guess I was slumped against the door so no one could get in. I was completely immobilized. My friend was finally able to open the door and the ambulance came and got me. at that point I was conscious in my head, but physically I could not move or talk. I was vomiting on and off. I remember the ride to the hospital, then they put me in a room. I was laying flat on my back and I could tell I was about to vomit again but I had no way of communicating or moving, and I thought for sure I was going to choke and die there. Luckily a nurse ended up coming in and noticed, she sat me upright in time so I ended up being okay. They did not check me for drugs, they didn’t even test my alcohol level. They just called my mom and sent me home. I had only had 4 drinks the whole night(assuming I didn’t drink anymore during the time I was blacked out) and I can definitely handle my liquor. Even at my most intoxicated I’ve never been immobilized like that, so I know I was drugged. I tried to tell the bar the next day and they basically told me I was barred and there was “no way” I was drugged because the bartender is “reputable” as if she could watch every single person at all times but I digress . I have my suspicions on who it was, as I only left my drink with my friend and her boyfriend and her boyfriend is a sketchy character now that I look back at everything. Moral of the story, don’t trust anyone with your drink alone cause people are crap \u0026amp; you can’t trust anyone.",
   "created_utc": 1691166637,
   "score": 70,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus0v2h",
   "message": "Went on a high elevation alpine hike on Mt. Rainier with an out of town friend. At around 10,000 feet we decided it was time to head back down the mountain. About five minutes into the descent I was in an uncontrolled glissade across a snow field. Even though I knew better, after I was unable to slow myself I put my feet down. That's when my crampons bit into the snow and stopped me, sending all of the force into my legs. I heard an unsettling pop and felt excruciating pain. As soon as I stopped I looked down and saw that the heel of my left boot was where the toe should have been. I had severely broken my leg and I was at least a 3 hour hike down with sunlight (and warmth) declining. We were not equipped to be there after dark.  Within a couple of minutes I could feel my extremities beginning to tingle. Was going into shock. Fortunately, I had some glucose gel packs which I began to suck on. And they seem to keep the shock at bay. Our cell phones weren't working well at our location but another stroke of luck was that I had put a GMRS radio in the bottom of my pack and as such we were able to get word out on the radio that we were in trouble and needed help. The National Park Service  couldn't get a helicopter that was willing to fly to that elevation so late in the day (on a Sunday in early October). So they had to gather a party of climbing rangers to come get me. A couple of other climbers on the way up the mountain really saved me by giving up their climb and assisting me, covering me with sleeping bags and making tea while one of them went back down the mountain to meet the rangers coming up. Shock and hypothermia very likely would have done me in that night if I hadn't been so lucky. It was pitch dark and freezing cold by the time the rangers arrived four hours later.  They strapped me into a litter and had to carry me off the mountain. It was almost 9 hours between the time of the accident and the time I checked in to the emergency room.",
   "created_utc": 1691165716,
   "score": 56,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jushbii",
   "message": "Cancer. Just finished my last Chemo Tuesday and now I go back on the Oral chemo pill. I have a PT scan the end of the month and hopefully this shit is gone for good",
   "created_utc": 1691171868,
   "score": 53,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurwlfi",
   "message": "I was contemplating suicide after a particularly bad day at school.\n\n\u0026gt;!I thought better.!\u0026lt;",
   "created_utc": 1691164120,
   "score": 31,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurl6zy",
   "message": "i was in my kitchen fell over and instinctively grabbed the towel under the knife rack and a knife landed maybe a centimeter from the side of my face.",
   "created_utc": 1691159829,
   "score": 42,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus4npf",
   "message": "Well, let’s start at the beginning, shall we?\n\nAge 3, electrocution. My brothers got creative in their attempts to kill me. I was a chewer, and loved the taste and feel of rubber and metal in my mouth, so I would go for their game controller cords. They swapped it out for the power cord one day, and left the system running.\n\nAge 4, blunt force trauma from playground equipment. Wasn’t paying attention and walked under a swing in use. The downswing took me clear off my feet and sent me flying. I woke up about 20 minutes later with everyone standing around me.\n\nAge 5, choking on a hot dog. Heimlich’d myself, and went about my business.\n\nAge 7, mauled by a dog. Teachers took me room to room as their personal show-and-tell/PSA the next day.\n\nAge 11, almost hit by a car on my bike. Had to hit the ditch to avoid it. She made a show of pulling over and telling me that her almost hitting me was my fault, while I’m trying to remove myself from a briar patch.\n\nAge 14, almost shot by a hunter while wandering through the woods. He had been drinking, which given the area, isn’t surprising.\n\nAge 16, car crash. Unmarked turn, plus gravel in the road. I hate to do it, but I gotta paraphrase Episode 1 Anakin here, “I saved the car…mostly.”\n\nAge 17, voluntarily hit by a car on some REALLY good drugs. Flew off the hood and went headfirst into the asphalt. Spent the rest of the day concussed.\n\nAge 18, dirt bike crash. Hit a tree, and barely missed it going by. My foot wasn’t as lucky. It hit the tree and some speed. I tore my big toenail off, and got 6 stitches between the big toe and the one next to it.\n\nAge 19, attempted suicide. Bought the wrong ammo, and ammo is non-returnable.\n\nPlus a vast collection of broken bones and scars.",
   "created_utc": 1691167144,
   "score": 39,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurutvd",
   "message": "Almost drowned in a pool",
   "created_utc": 1691163459,
   "score": 23,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jushdzq",
   "message": "Went to a beach with my family when I was 8 years old and decided to not tell anyone and go out as far as I possibly could into the water. I was in way over my head getting deeper and deeper bouncing on my tip toes, yet no one noticed me. It was to the point where my whole head was under water and I would push myself up get a breath of air, then my whole head back down into the water. I was probably less than a minute from drowning. I was literally preparing to die in my head. Then my father noticed me and ran to the water and saved my life. I get chills thinking about it now",
   "created_utc": 1691171894,
   "score": 29,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jurx2nk",
   "message": "Just your standard every day getting crushed in a conveyor belt.",
   "created_utc": 1691164297,
   "score": 18,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus2v82",
   "message": "I don’t know if I would’ve died but I think about this incident all the time. I was like 12 years old walking home from school on a busy street. I crossed the lot of this auto garage (which was usually open but closed this day) and there was hardly any traffic on the street due to everyone stopped at lights further away. While I was crossing the empty lot, a car stops and a youngish man asked me if I wanted a ride. I said “no” and kept walking. Then, he pulled into the lot and circled me, again asked me, not taking no for an answer. I didn’t even think, I just ran as fast I could down the main street - busted a wheel on my roller backpack and didn’t look back until I was way past, and there was enough traffic on the road. I always think about that incident because I think the worst could have happened if I had gotten into the car. The second incident was I was caught in a rip tide and almost drowned, but fortunately survived.",
   "created_utc": 1691166464,
   "score": 21,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "juseq4r",
   "message": "Depression and suicidal thoughts.",
   "created_utc": 1691170904,
   "score": 21,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jusqyl8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jus34e7",
   "message": "Haribo twin snakes. On LSD, not our first rodeo.... comfortable at home with my long term boyfriend. We're laying in bed, watching cartoons and snacking on gummy candy. Laughing and snacking and giggles and shit. I laugh particularly hard and a gummy snake lodges in my trachea.\n\n\n\nHe thinks I'm laughing so hard I can't breathe. Pantomiming choking, trying to punch myself in the chest, throwing myself against chairs and shit. He's lovely but not the sharpest tack at that moment... I lose consciousness and I guess he realized what was up because I wake up like five minutes later, vomiting over toilet, him giving me heimlich. It was messy.\n\n\n\nWhen I come to, I know there is still a piece of gummy lodged inside me. Painful to breathe, wanna vomit, can taste and smell the gummies through my ears and nose. I understand that sounds crazy but I think I need medical attention... We call my nurse friend to come check me out. Before she arrives I have another attack and cough part of the worm up. By the time she gets there I'm pure panic. Helps me shower, cough, calm. I know there's still a part of the gummy in my chest. They're telling me I'm just high. Legit, all I wanna know is if I can wait to come down before I go to the hospital or if I should call ems asap. She talks me down though I know they're discounting my words... I get calm enough to doze. As she is leaving she steps on the gummy I choked out. Says, wtf is this on your floor? We say oh that's part of the gummy she choked on. Friend goes wut? Apparently she thought we were making up my near death, and it wasn't until she saw the bile covered chunk that she took me seriously.\n\nEnded up feeling validated and they were much more receptive to my knowledge of my body, watched over me till next am. I wake up sober but still in pain but also less terrified. No insurance so... Ended up coughing the rest up two days later.\n\n\nI still have issues with knowing how to eat/drink/breathe. Still love the at home LSD fun though no more gummy candies or laying down and eating. Stay safe, kids.",
   "created_utc": 1691166561,
   "score": 30,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jush9gw",
   "message": "Double murder robbery I missed because I was doing bong rips with my ride.  Ruby Tuesday's, 1998, July 4.\n\nIf I'd been on time to work that day instead of 10 minutes late, I'd be dead, too.  I went in the back before the cops even secured the place.  Saw too much.\n\nMiss you JoAnna, and I know your little boy is happy and healthy and with your family.",
   "created_utc": 1691171847,
   "score": 21,
   "submission_id": "15i1ing"
  },
  {
   "comment_id": "jusuc80",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15i1ing"
  }
 ]
}