{
 "submission_id": "15i6w78",
 "title": "Do you prefer cats or dogs, and why?",
 "selftext": "",
 "created_utc": 1691171602,
 "permalink": "/r/AskReddit/comments/15i6w78/do_you_prefer_cats_or_dogs_and_why/",
 "score": 20,
 "url": "https://www.reddit.com/r/AskReddit/comments/15i6w78/do_you_prefer_cats_or_dogs_and_why/",
 "comments": [
  {
   "comment_id": "jusorxa",
   "message": "Honestly I can't taste the difference.",
   "created_utc": 1691174667,
   "score": 36,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "juspw4y",
   "message": "I prefer cats, cause sometimes I just don't have enough energy to give it to dogs.",
   "created_utc": 1691175083,
   "score": 14,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusgv71",
   "message": "Cows, you can ride them and they produce milk",
   "created_utc": 1691171699,
   "score": 11,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "justlj0",
   "message": "It's lovely and amazing to have cats or dogs.",
   "created_utc": 1691176485,
   "score": 5,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusln77",
   "message": "Cats are calm, peaceful and independent. They love you on their terms and I respect that. Dogs are needy and generally smell.",
   "created_utc": 1691173491,
   "score": 29,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusv87x",
   "message": "dogs \n\nbecause dogs",
   "created_utc": 1691177102,
   "score": 4,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusi7kd",
   "message": "Dogs u can take them for a walk and they are less scratchy and they dont walk on your food counters",
   "created_utc": 1691172204,
   "score": 9,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusnya1",
   "message": "Cats. Dogs remind me of children constant need for attention and they need proper stimulation. Cats are more like roommates, they acknowledge your existence and if they want something they come to you otherwise they are happy in their space. I can also leave cats for a period of time and know the house won’t get torn apart and as long as they have a good supplies of food and water and a clean litter box they’ll be fine for the day.",
   "created_utc": 1691174355,
   "score": 8,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "juskvm0",
   "message": "I prefer cats. It doesn't mean I don't like dogs though, I just *prefer* cats. I like a quiet household and I think cats are more comfy in a quiet environment, plus they're really cute and fluffy. \n\nJust be careful if you get a longhaired cat. When they get diarrhoea you are in for a fun time.",
   "created_utc": 1691173206,
   "score": 12,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jush2ck",
   "message": "Dogs, I think they’re way more compassionate and loyal but maybe I’m biased. I just lost my wolfdog a few weeks ago. She was genuinely my best friend.",
   "created_utc": 1691171772,
   "score": 8,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jushkxt",
   "message": "Dogs because I enjoy walking and hiking with them",
   "created_utc": 1691171966,
   "score": 4,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusxsrg",
   "message": "Dogs. They have more of a personality. Just over all a better companion. It’s why they call them man’s best friend",
   "created_utc": 1691178082,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusmjhl",
   "message": "Dogs. Because I like the relationship between me and my dog. During training, walks, etc. When you do enough with your dog, it really becomes part of the family",
   "created_utc": 1691173830,
   "score": 4,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusi338",
   "message": "Cats. They’re much cleaner than dogs and care about their personal hygiene. I loved my late Australian shepherd, but I’ll be the first to say that she was a natural-born dirt ball. Despite our frequent bathing and grooming of her, she always managed to get filthy and stinky in short order. I remember in the summer she sometimes had a small cadre of flies following her around outside. Beyond all that, cats seem more intelligent and caring than dogs. I love their natural curiosity.",
   "created_utc": 1691172156,
   "score": 7,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusqxkq",
   "message": "dogs 100%, they are cute and funny.",
   "created_utc": 1691175472,
   "score": 2,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "justfud",
   "message": "Dogs cause golden retrievers \n\nCats are cool too but I'd rather have a golden retriever",
   "created_utc": 1691176426,
   "score": 2,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusv7eu",
   "message": "Why not both?",
   "created_utc": 1691177094,
   "score": 2,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusp5t3",
   "message": "Cats.  You dont have to take them outside to use the bathroom, my cat leaves me alone when I want to be left alone, and mine actually growls at the doorbell and DOES NOT get on my counters or scratch my furniture.  Cats can be trained nicely, you just have to start off when they are young and follow through with it.",
   "created_utc": 1691174811,
   "score": 3,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "juspmst",
   "message": "Dogs. Cats are a toss up if they even like you and they shit in a box in the corner of your house. (Dear Cat Owners - Everyone who comes to your house can smell it, you are just use to  the cat shit smell.)",
   "created_utc": 1691174987,
   "score": 5,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "juskpje",
   "message": "Dogs. Cats are bigger about personal space and I like to be cuddly and give lots of pets to my animals. Dogs like that kind of stuff more. And they won’t scratch you if you step too close for their comfort.",
   "created_utc": 1691173144,
   "score": 2,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusjkf6",
   "message": "Cats because I don't want my house to smell like dog and I don't want to condemn a good boy to living outside",
   "created_utc": 1691172713,
   "score": 3,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusgw4u",
   "message": "I prefer dogs because they can do things like police, guide, basketball, and other dog stuff. Cats are jerks eh?",
   "created_utc": 1691171709,
   "score": 3,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusgw5p",
   "message": "I'm already aloof, cold, and indifferent to the suffering of humans, so what do I need a cat for?",
   "created_utc": 1691171709,
   "score": 2,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "juslorp",
   "message": "Dogs. I love my cats too, but I get the feeling the most affection they ever feel for me is 'pleasantly amused by my existence'.",
   "created_utc": 1691173508,
   "score": 3,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusiyck",
   "message": "We lost our 11year-old greyhound early in the morning. He was a dog like none other.  A cat just can't compare. Don't get me wrong, I love cats. But *sniff!* Jack was so special we took turn sleeping with him until he died,",
   "created_utc": 1691172483,
   "score": 2,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jush1ld",
   "message": "Dogs, I really hate cats.",
   "created_utc": 1691171765,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "juskc60",
   "message": "Dogs! Cats are drama queens with a god complex.",
   "created_utc": 1691173004,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusnt43",
   "message": "Both! If I had choice, I’ll get a dog and a cat.",
   "created_utc": 1691174301,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusgs27",
   "message": "Dogs, just easier to care for.",
   "created_utc": 1691171665,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusleve",
   "message": "I like both. I prefer owning a cat though, and I’d rather be surrounded by neighbors with cats instead of dogs. Both are great though. I love my “dog nephews”. I just like a more peaceful home environment.",
   "created_utc": 1691173404,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusq3rm",
   "message": "Younger me was dogs 100%. My energy matched theirs. Older me it's cats because now my energy matches theirs. Cats are less needy and so loving. I'm now a cat person!",
   "created_utc": 1691175161,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusq6cl",
   "message": "I love cats and dogs. I had my perfect dog in my 20’s. But I always had cats too. \n\nDogs need to be walked. You can’t leave a dog alone for a day, let alone a weekend. \n\nAnd to recycle an old joke: You feed a dog and they think you are a god. You feed a cat and they think they  they are the god.",
   "created_utc": 1691175188,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusqhca",
   "message": "Cats just match my energy",
   "created_utc": 1691175303,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusqi6p",
   "message": "Cats are generally quieter, have soft fur, are less needy and don’t stink.  Dogs are all kinds of gross, their fur feels greasy and wiry, they destroy everything within their reach and make their owners’ homes and vehicles smell like ass.  Plus it seems like there’s a serious dog attack in the news every other day.",
   "created_utc": 1691175312,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusr1yu",
   "message": "Cats- they don’t smell and their affection feels special, like something you earned instead of something they give to everyone",
   "created_utc": 1691175517,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "juss2ds",
   "message": "Cats. \n\nThe biggest reason is probably because that's just what I'm used to. I have not gone a single day of my life without a cat, while I haven't had a dog since I was 8 or 9 years old. \n\nBut also:\n\n\\-They're less work. They bathe themselves. I don't have to walk them. There's very little training required. I don't have to get up or come home at any particular time so they can relieve themselves and I don't have to go outside to scoop poop. Litterboxes aren't exactly fun, but I still find them preferable to dealing with dog mess. \n\n\\-They don't have body odor the way dogs do. \n\n\\-They're generally quieter. Granted, my Siamese mix is quite vocal and can be rather loud, but I will take that over barking, howling, and whining any day. \n\n\\-They're more independent. Which is not to say that they're never needy. My Siamese mix is very demanding of attention, but nothing like a dog. \n\n\\-To me, they're cuter. Especially the orange ones. I'm a sucker for the orange ones.",
   "created_utc": 1691175905,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "juss398",
   "message": "Cats don't make noise and are independent. A good homebuddy and a sleeping partner. They have a cute voice and their purring known to have healing properties. And the best thing is they give you space and are not intrusive.",
   "created_utc": 1691175914,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jussqgt",
   "message": "i love both, but prefer cats because they suit my personality and lifestyle better. i don’t have the kind of outgoing personality needed to be a good dog parent, and their constant neediness burns me out. my gf has a dog that i get to play dad to, so i have the best of both worlds.",
   "created_utc": 1691176157,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jussu1y",
   "message": "I like the one that doesn’t smell my Coochie on my period 😊 dogs are also messy and needy. Also their breath always smells. My cat comes in, cuddles with me and leaves. My neighbor has a dog that’s always barking and jumping, sweet dog but I could NEVER have one like that",
   "created_utc": 1691176194,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "justz7o",
   "message": "Cats. 😻 I had a black long haired cat who sadly passed away last year in May.",
   "created_utc": 1691176629,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusucy7",
   "message": "Cats.  They are way more independent and much easier to take care of than a dog.  A dog requires a lot more attention, training, etc.",
   "created_utc": 1691176777,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusjoxu",
   "message": "I am scared of unknown dogs and I have always been more comfortable with cats. I have also taken care of cats and I have never had any problems with cats",
   "created_utc": 1691172759,
   "score": 255,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusjsat",
   "message": "Cats. I’ve grown up with them and always have been scared of dogs for some reason",
   "created_utc": 1691172796,
   "score": 255,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusmehh",
   "message": "Don’t like dogs. Dogs evolved from rats",
   "created_utc": 1691173777,
   "score": 253,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusgqae",
   "message": "Both",
   "created_utc": 1691171647,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jushr2v",
   "message": "Both together are the best company you can have, especially if you live alone.",
   "created_utc": 1691172030,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusics5",
   "message": "Anything with a penis",
   "created_utc": 1691172259,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusm45p",
   "message": "Love them both, hate people though",
   "created_utc": 1691173670,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "juspgq4",
   "message": "prefer cats...like dogs... wouldn't mind a hybrid...",
   "created_utc": 1691174924,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusrr41",
   "message": "I prefer big dogs that don't shed like ours do.\n\nWe've had both. Our cat was psychotic. Would cause all sorts of hell just to get our dog to chase her. I used to hear the cat running around in the middle of the night and it would sound like a herd of elephants! \n\nOur dogs are also crazy. Our 15 year old jack russell will bark at anyone who doesn't give her attention. She is right at everyone's feet (people have tripped over her). She would also show you where valuables are as long as you make sure to pet her. But she doesn't watch out for anyone else to the point she has knocked the kids over. Our 10 year old lab is extremely laid back but too big in our house but she can't run the yard because she doesn't stay on the property. So she's in a kennel unless we're outside. She's great with our kids and only our kids. Our 7 year old lab only listens to me and he is wonderful with all kids! He is also an outside dog because I didn't have the time to properly potty train him. He's also in a kennel unless we're outside. \n\nThe bad thing about our dogs is they all shed horribly. I brush them once a week and they get baths once a month, weather permitting and not in the winter time.",
   "created_utc": 1691175786,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "justicf",
   "message": "I worked with animals most of my life, i personally like dogs better, they are often more expressive and i build a better trust relationship with them. \n\nI’ve had 5 cats and while i liked them it is not the same relationship at all. The one big advantage of cats is that they require less maintenance and are more independent.  So of you like to travel or work a-lot, a cat is better, if you want a small 2year old human on 4 legs get a dog.\n\nMy dog is always happy when he sees me, my cats would hiss at me for random reasons sometimes, then cuddle, then hiss. Cats feel like dating someone with BPD.\n\nStill love them all but ill always be a dog guy even if they require a-lot more work.",
   "created_utc": 1691176452,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "justy4c",
   "message": "Yes because cute",
   "created_utc": 1691176618,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusvmz3",
   "message": "Cats are just so chill and easy to take care of. They're practically self-sufficient. They are also so deeply affectionate.",
   "created_utc": 1691177259,
   "score": 0,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusvnit",
   "message": "I have a dog and 2 cats and there’s pros and cons for each. I love them all the same except for one cat. He’s a jerk.",
   "created_utc": 1691177265,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusvrw3",
   "message": "I have both and I find myself thinking \"I hate cats\" much more frequently than \"I hate dogs.\"  I hate litter boxes.  I hate how they wait to get into any room or closet that is generally kept close.  I hate how they hide when you're in a hurry and need to leave the house after they rush into a room they're not supposed to be in.  Meanwhile my dogs are just like, \"love me, please.\"",
   "created_utc": 1691177311,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusw2m1",
   "message": "I don't dislike dogs but prefer cats because they are very low maintenance compared to dogs and the fact that as I get older I realize that I am a cat, everything about my personality and behavior just seems to come down to me being very catlike.",
   "created_utc": 1691177426,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "juswetc",
   "message": "Cats are calm, cute and although make some weird actions.\n\nDogs are useful, but the most of them stupid, hyperactive, aggressive pieces of madness who deserve to be killed.",
   "created_utc": 1691177555,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "juswhzh",
   "message": " I like dogs as long as they belong to someone else. They are too needy and noisy for me. I  like that cats are independent and pretty quiet, except for a siamese at any time but especially when in season",
   "created_utc": 1691177589,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "juswrab",
   "message": "Both equally",
   "created_utc": 1691177689,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusxfeq",
   "message": "Dogs 100% My son's cat did more damage to my house than any other creature that has ever lived here. Shredded carpet, peed in the clothes dryer, clawed apart the woodwork, trashed the furniture and the little AH kept trying to kill me. He was determined to trip me on the stairs and loved to jump out and sneak attack me, but wouldn't let me pet him unless I was on the toilet. (Idk why, he would just body slam the door until it opened and come rub on my leg.)  Most bizarre creature. My dogs haven't ever come close to causing that kind of damage and they are always happy to see me, have never bitten me or tried to kill me, not even once. They are also good at letting me know when there's a stranger on the porch and would protect me from an intruder. The dogs have my back. The cat wanted me dead.",
   "created_utc": 1691177942,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusxj3v",
   "message": "Cats. They can clean and take care of themselves. Dogs are loud, smelly, shit everywhere and are generally a pain in the ass.",
   "created_utc": 1691177980,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusxra1",
   "message": "Love cats. Purring is top tier comfort. Also they are quiet.",
   "created_utc": 1691178067,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusxy7c",
   "message": "I love both cats and dogs but I prefer to live with cats because dogs are way too needy and you have to go out and walk them. I like how cats are so much more independent minded like when I had my parents dog over I couldn’t understand why if I stay up late it also meant the dog had to stay up late too whimpering why I’m not going to bed like why can’t you just go to sleep without me I don’t get it?",
   "created_utc": 1691178139,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusyyc4",
   "message": "Cats.  I love dogs too, but I don't have the time/energy to care for one.  Cats are easy.",
   "created_utc": 1691178523,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusyyuj",
   "message": "Cats, because they're cleaner, more independent, less smelly and are more enjoyable to pet because of their lovely soft fur. Plus I never feel like a cat is going to attack me like a dog.",
   "created_utc": 1691178528,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusyzo8",
   "message": "I have both, but I prefer my cat. He's mad chill. My dog makes a mess, eats random shit when I'm not looking, and requires a crap ton of attention.",
   "created_utc": 1691178537,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jusz3u9",
   "message": "I love dogs, I just don’t want to be responsible for one. \n\nI love my kitties. And I think I understand them more. \n\nMy mother-in-law recently asked me if I’d ever be interested in a dog. I said maybe, if I could find one that was small and chill and low maintenance. So, a cat.",
   "created_utc": 1691178581,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut0kkj",
   "message": "I love cats, but prefer dogs. What I like about cats is they are low maintenance, I can just chill and get things done and not have to worry too much. They’ll come cuddle on their terms and it feels amazing when they do as if you earned those cuddles. \n\nWhereas dogs can be very high maintenance: multiple walks \u0026amp; fetch a day, mental enrichment, need to find sitters if gone too long in the day, constantly wants pets and playtime. BUT! My dog makes me so fricken happy. He’s an incredible companion. I’ve loved all the cats I’ve had and wish I could have more, but it’s a different bond with dogs that is hard to explain. I feel happiest with my pup.",
   "created_utc": 1691179125,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut2352",
   "message": "I don't know where all the comments about independent non-needy non-noisy cats come from. I like cats but good thing I like dogs because my cats have mostly been as needy and interactive as my dogs and sometimes much louder.\n\nI prefer dogs, because I don't look like a weirdo taking long walks in the evenings if I have a reason. I like hiking and outdoor stuff. I like the feeling of safety even a fairly little dog can offer. I had a Burmese who played fetch and answered the door but she couldn't be as \"protective\" as even a small dog. She was almost the perfect puppy cat though.\n\nI generally like doggish cats and catlike dogs. But a catlike dog can do all the snuggly companion and silently staring out the window stuff and then go for a long rambling walk on lead, and then lay around and watch me do the gardening without eating the birds. \n\nI like walking 5 km a day then feeling like someone might not try and break in. Even a very personable and endearing and bonded cat can't be asked to participate for that. Though I do think there is probably a tipping point where a cat is just a lot more robust than a similar sized dog. My partner was encouraging me to look at 3 kg dogs and idk I don't worry about a 3 kg cat the same way.",
   "created_utc": 1691179693,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut28f6",
   "message": "Dogs.  We go hiking, kayaking,  swimming... basically horsing around all the time.  Cats are boring af.",
   "created_utc": 1691179749,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut2iyi",
   "message": "I was so tired of having to clean litter boxes twice a week, so I got a dog. Now I get to carry a bag of poop around the block twice a day.",
   "created_utc": 1691179862,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut2pjv",
   "message": "I prefer cat sized dogs. A little barky but otherwise it's the best of both worlds.",
   "created_utc": 1691179932,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut30df",
   "message": "Cats. They are affectionate, have extremely distinct personalities, live for 15-30 years, they are reasonably self sufficient for a pet, and they are cute as hell.\n\nJust got 2 kittens in fact to keep our older lady company (her brother of 17 years just died in Oct).\n\nThe preference is there but it's not huge. I'm sure one day my kids will ask for a dog and I'm inclined to say yes. Dogs are good also.",
   "created_utc": 1691180049,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut391u",
   "message": "Dogs. Because they are man’s eat friend",
   "created_utc": 1691180144,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut3b8v",
   "message": "Bothhhh but I like cats way more",
   "created_utc": 1691180167,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut3m33",
   "message": "Overall: Dogs.\n\nBUT There are both Good Cats/Dogs, and shitty Cats/Dogs. In my experience Most Cats are shitty, but not all. Most Dogs are good, but again not all.",
   "created_utc": 1691180281,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut43mf",
   "message": "Cats are lame, dogs are not.",
   "created_utc": 1691180467,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut4cqs",
   "message": "Dogs. Because cats are useless assholes.",
   "created_utc": 1691180564,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut4mdv",
   "message": "Cats because I just love them more than dogs",
   "created_utc": 1691180666,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut4nal",
   "message": "Dogs give unconditional love and affection and cats are pricks that ruin anything just because.",
   "created_utc": 1691180676,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut54n7",
   "message": "I love them both. But hubby is allergic to cats. So we have dogs. I would have both if we could. Dogs are great protection and keep predators away from my chickens.",
   "created_utc": 1691180861,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut57nx",
   "message": "Honestly? I feel like they aren't comparable. I've had a lot more bad memories with dogs than I have with cats, so if I had to pick an answer I'd say id hate dogs more.\n\nDogs actually kill things first of all. They are actually dangerous. You are seriously judged when you have a dog that is capable of that. My parents didn't teach me how to raise a puppy (they wanted it) but they work full time jobs so it was mine at 14 to parent a dog. That ROTTWEILER was horrible and traumatic. I became a little abusive. She killed my chickens, she hurt because she was big, it was... It was natural. Her behavior was completely natural. I just don't like that level of stress (that dog got hit by a semi-truck at a young age, my new dog is a lot better. I didn't want him either. He's my dog though, again.)\n\nCats, people just don't know how to raise cats. They serve an entirely different function and that's evident by the comparison of cats and dogs. Dogs are workers. They require maintenance and actual intent. That's what they were for from lap dog to herder to sled puller. Cats have passive reasons to be. They actually domesticated themselves at first because our food stores had pests.\n\nCats and us truly have a symbiotic relationship, cats are genetically nearly the same as they were hundreds of years ago. They exist to live in our homes, cuddle with us, and thrive in our *environment*.\n\nSomething I learned from the cat whisperer guy is that good behavior in dogs is based on training, and good behavior in cats is based on the environment. Litter boxes here, play time there, cat tree by the window. That's the setup for a good kitten and eventually cat, unless they have a mental disorder. Cats are born set up with everything we will ever need them for. Dogs are a project.",
   "created_utc": 1691180894,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut58jx",
   "message": "If I had to pick, I prefer the temperament of cats. I also would rather clean a litter box twice a day then scoop poop in my yard.",
   "created_utc": 1691180905,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut5guy",
   "message": "Cats because they'll do their own thing most of the time, I hate the neediness of dogs that have to be attached to your hip all waking day or else they get separation anxiety",
   "created_utc": 1691180993,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut5ix8",
   "message": "I like them both but for different reasons. Cats are interesting independent personalities. They are fun to have around. But dogs have evolved with humans for so long there is a connection humans can have with them that is fairly unique and makes them really great companions.",
   "created_utc": 1691181016,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut5md5",
   "message": "definitely dogs. instead of dealing with a stinky litter box my dog gets me to go outside and exercise more and has helped me meet a lot of people. I also don’t have to worry about him going from being cuddly one minute to scratching and biting the next.",
   "created_utc": 1691181053,
   "score": 1,
   "submission_id": "15i6w78"
  },
  {
   "comment_id": "jut69yl",
   "message": "I'm a lazy piece of shit and it's cruel to not take a dog for a walk or two during the day",
   "created_utc": 1691181306,
   "score": 1,
   "submission_id": "15i6w78"
  }
 ]
}