{
 "submission_id": "15i8i6a",
 "title": "Why did that one kid get expelled?",
 "selftext": "",
 "created_utc": 1691175384,
 "permalink": "/r/AskReddit/comments/15i8i6a/why_did_that_one_kid_get_expelled/",
 "score": 7,
 "url": "https://www.reddit.com/r/AskReddit/comments/15i8i6a/why_did_that_one_kid_get_expelled/",
 "comments": [
  {
   "comment_id": "justxwh",
   "message": "Downloading porn on the school computers was the last straw, he even used his own login.",
   "created_utc": 1691176616,
   "score": 180,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jusxsul",
   "message": "Playing kickball in gym class kid kicked his shoe off and his bag of weed came flying out right to the teachers feet!",
   "created_utc": 1691178082,
   "score": 166,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jusueie",
   "message": "He told the principal he had a gun and was going to go out and kill himself with it.\n\n(This was pre-Columbine.)\n\nEDIT: To the best of my knowledge, he did actually have a gun, but I don’t know with certainty.",
   "created_utc": 1691176793,
   "score": 170,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut6m4y",
   "message": "So it didn’t happen to me but my friend was expelled for taking a shit in the teachers purse.",
   "created_utc": 1691181436,
   "score": 243,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jusw7g6",
   "message": "For spraying the fire extinguisher in the principals face after he called him short 🤣",
   "created_utc": 1691177477,
   "score": 170,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutbmsb",
   "message": "We had one kid that shit on a table and another kid ate it  in high school. The shitter got expelled, but not the  eater\n\nEdit : I’m adding more details. These were both guys. There were a group of a few guys that thought it was cool to do things for reactions like this. One of them also ate a live goldfish and took a shot of cum at a party. The eater was not expelled but I think suspended. He ended up going to Stanford. \n\nI have no clue what happened to the shitter. These people were in my grade (small class about 100 kids) this was around 2006 I believe",
   "created_utc": 1691183351,
   "score": 144,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jusqrwz",
   "message": "He told everyone what tampons are for.",
   "created_utc": 1691175412,
   "score": 33,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut6c1w",
   "message": "Threw a chair at a teacher after we'd all been violated by her.\n\nFor context. It was junior high and this teacher for some weird reason loved patting/ rubbing our shoulders and backs. She did this to everyone and everyone hated it. She'd been asked to stop and even got reported to the board, but they did nothing. \n\nOne day a girl who'd been sexually abused in the past had enough and threw a desk at the teacher. Girl got expelled, but again nothing happened to the teacher. Last I heard she's still teaching and we're still treated like we were crazy. This was back in 2001. Really made me lose faith in authority.",
   "created_utc": 1691181328,
   "score": 10,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jusvnoo",
   "message": "Calling in fake bomb threats",
   "created_utc": 1691177267,
   "score": 111,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutajbm",
   "message": "Calling my daughter a monkey and the N word..He fucked around and found out.",
   "created_utc": 1691182937,
   "score": 77,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut7jgc",
   "message": "He raped another student",
   "created_utc": 1691181799,
   "score": 136,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutc7u8",
   "message": "He just kept shitting his pants. There was nothing wrong with him. He just kept doing it. \n\nSame place, same time, everyday… right after recess when we lined up to go inside he’d just let loose… the fattest and wettest fart/shit you’d ever heard, and it would echo through the silent hallway for literally everyone in the grade to hear. \n\nAt first we thought it was just embarrassing for him, but by the time week 2 came around, we were all convinced he was doing it intentionally. I have no explanation because he was kicked out after like 3 months of consistently doing it.\n\nEdit: I nearly forgot, he would announce to everyone he shit himself too by saying (and I quote) “….WHOOPS….. Iiii pooped myself”.",
   "created_utc": 1691183584,
   "score": 246,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutcljx",
   "message": "Him and his cousin beat up the deputy principal and tried to kill him with a spade…at school. No charges ended up being laid. Later went on to kill a tourist during the 2000 new years and dump his body in the harbour.\nEdit: brothers not cousins memory is a little hazy after 23 years! I personally didn’t know them but knew enough to stay the fuck away from them they were known for being trouble kids. Our art teacher stopped the attack he’s a hero imo. Well done sleuths for finding the articles!",
   "created_utc": 1691183737,
   "score": 171,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut44nm",
   "message": "Broke a kids legs for no reason, i was there and the pain I felt as I watch his leg go straight to bent, he kicked his knee from the side and completely dislocated his leg, the kid is in a wheelchair now",
   "created_utc": 1691180478,
   "score": 171,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutf26i",
   "message": "Here's one - a girl got drunk at a house party. Some guy ejaculated on her hair and took photos of it, as well as a few photos of her naked (and unconscious!) - the girl's boyfriend went John Wick on the guy when he got EMAILED the photos by the guy. He was sent away for beating the shit out of this sexual assualter, who wasn't even given detention, and the girl's photos got sent around for years and people called her slut. Terrible school.",
   "created_utc": 1691184724,
   "score": 240,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut7qtz",
   "message": "Put laxatives in a pregnant teachers coffee. She miscarried 2 days later. Fucker was 12. \n\nOr the guy who brought a shotgun to school.\n\nEdit: Apparently, laxatives have very little correlation to miscarriages. Also, it is apparently called a stillbirth not a miscarriage, thank you for correcting me",
   "created_utc": 1691181879,
   "score": 61,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutcn4u",
   "message": "I beat the shit out of a teacher after he groped a friend. They investigated and fired him. They let me back the next year.",
   "created_utc": 1691183754,
   "score": 34,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jusvq3s",
   "message": "I was dumb, I thought nuggies were friendly and gave one to a kid I talked to occasionally. I haven't even the slightest clue why I even did it, but I gave him a nuggie. Of course the big guy he was friends with didn't like that pushed me around and eventually clocked me in the nose. \n\nI was bleeding everywhere and I can only assume they wanted to get rid of me. I was kicked out and sent to a school that was k-12 for misfits or whatever. Had to wear a uniform and everything. That place was wild. \nI was allowed to go back the following year due to good behavior. \n\nWhich wasn't hard considering I was pretty angelic compared to the whacks that went there. I mean kids shoving teachers into bookshelves and jumping out the window kind of crap. My autism just makes it hard to understand what's socially acceptable and I tend to just be wrong a lot of the time.",
   "created_utc": 1691177292,
   "score": 162,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jusqtjv",
   "message": "bait in class.",
   "created_utc": 1691175429,
   "score": 37,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut2h3h",
   "message": "Set the soccer teams locker room on fire for getting kicked off (side note: also effed his cousin)",
   "created_utc": 1691179842,
   "score": 13,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juswnri",
   "message": "He looked at porn on a school computer.",
   "created_utc": 1691177652,
   "score": 144,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutbwhs",
   "message": "He stabbed another kid with a letter opener he made in shop class. We didn't make letter openers in shop class after that.",
   "created_utc": 1691183459,
   "score": 158,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutd16f",
   "message": "Tackled and restrained by coaches after he grabbed a bat from the storage room with the intention of beating his pregnant math teacher with it",
   "created_utc": 1691183911,
   "score": 197,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut8ao4",
   "message": "Got drunk on contraband screwdrivers at lunch and went to driver's ed.  Crashed into some school busses parked on the driving course.",
   "created_utc": 1691182093,
   "score": 195,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutc0vl",
   "message": "Flopped his dick on another dudes shoulder in his room at study hall. Boarding school is weird",
   "created_utc": 1691183507,
   "score": 187,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutcpib",
   "message": "Middle school. He was really into assassins creed (video game and main character is an assassin). He also seemed like a slightly depressed/edgy kid. \n\nI became friends with him during his last 2-3 weeks. He told me he wanted to make a cool stabby blade thing that shoots out of his sleeve like in the video game. I told him that would be cool (but I was never dumb enough to do it myself). He actually made it and brought it to school. We spent a couple of days of recess and lunch running around and I watched him terrorize some of the kids, including myself. I never thought he’d harm anyone though.\n\nSomeone must’ve told on him. School supervisor guy came in, asked for him and his backpack, and he never came back.\n\nI think I saw him a few years later and he thought I was the one that told on him. I tried to deny it but didn’t want to risk getting into an argument.",
   "created_utc": 1691183780,
   "score": 82,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutdu8g",
   "message": "He raped a girl with a broomstick with his buddies, video taped it. His mom found the tape and turned them in.",
   "created_utc": 1691184231,
   "score": 117,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juswl7y",
   "message": "I don't think anyone ever got expelled from my school. They had a ton of \"zero tolerance\" rules that they said would get someone expelled no matter what but whenever someone broke one they'd just get suspended for a few days or week with no explanation as to why they weren't expelled.",
   "created_utc": 1691177624,
   "score": 160,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut5wj7",
   "message": "Walked out of English class to talk to another kid in the hall. The teacher was real lax so she didn't care he walked out to talk to this guy. Fight breaks out in the hall. Teacher runs out, other teachers come help break up the fight. One teacher asks the kid that walked out class why they were fighting and he said \"He stole my weed.\"\nKid who left class was selling and the kid in the hall tried to walk off without paying. \nAny other BS excuse would have just got him suspended.",
   "created_utc": 1691181162,
   "score": 189,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutdm37",
   "message": "Giving a bj in the staircase with glass walls facing the cafeteria windows… during lunch",
   "created_utc": 1691184141,
   "score": 249,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut0ko7",
   "message": "Broke a teacher's nose.",
   "created_utc": 1691179126,
   "score": 12,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutb952",
   "message": "He made a bomb threat online. Most of the school skipped out the day he did because they didn't want to blow up. I was one of the poor souls with no social media so I came in to school, not knowing there was a frickin' BOMB THREAT! I also had a mom who was unphased and just told me, \"You'll be fine. Go to class,\" when I called her.\n\nI didn't learn until the next day that he had been apprehended and expelled. What scared me was I knew him for years and he never seemed like the kind of person to go that far. He was a class clown, but I never thought he would take that as even a joke. Apparently he did have a bomb, but it thankfully never made it to the school grounds.",
   "created_utc": 1691183207,
   "score": 33,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutcvku",
   "message": "Having a pound of weed in his car",
   "created_utc": 1691183847,
   "score": 27,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jute85c",
   "message": "In sixth grade we had this special kid, he was slow but a complete spazz. He called a black girl the n word and we never saw him again. I actually don’t think he had the ability to even understand what he did, he had the mentality of a 6 year old.",
   "created_utc": 1691184387,
   "score": 6,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutf8er",
   "message": "Thought he was funny and decided to grab the SRO (student resource officers) gun. Our SRO also happened to be part of SWAT. He did this as we all left end of day, crowded hall. I remember this vividly over 20 years later. This was also post Columbine by like a month. Kid got slammed into a wall put in cuffs. Arrested and expelled immediately",
   "created_utc": 1691184795,
   "score": 134,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutc7su",
   "message": "Two kids made a diss track about a girl they didn’t like as joke. she reported it and they immediately got expelled. In my opinion a little over kill since they didn’t have any previous suspensions or incidents like this before but they are pricks to this day so I don’t feel bad at this point.",
   "created_utc": 1691183584,
   "score": 30,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutc06s",
   "message": "For throwing a chair out the window on the 4th floor",
   "created_utc": 1691183499,
   "score": 6,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutcnqr",
   "message": "Planned a food fight that turned into a riot with property damage and then fled from the police",
   "created_utc": 1691183761,
   "score": 41,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutd7nl",
   "message": "Baited a very mentally unwell homeless man into the school for the giggles, man had a knife and after being refused fries from the school cafeteria threw a tantrum on the tables\n\nNobody was hurt but the kid was expelled for threatening future safety. The school made him take it down and this was in 2012 but there used to be a video on YouTube of the incident",
   "created_utc": 1691183981,
   "score": 202,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutgepz",
   "message": "For lifting up his shorts and exposing his balls through the leg hole to the principal while said principal was escorting potential investors for the school.",
   "created_utc": 1691185274,
   "score": 158,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutiq56",
   "message": "My neighbor across the street was three years older. Practically a God to us. He was a very funny guy who also was a very good drummer. One day in the spring of his senior year he decided to pull a fire alarm at school. That was it. He was expelled. He eventually got a GED but this was when they were first starting out so it took a couple of years. The last I heard he had been briefly married and divorced and was working as a cashier at the local drugstore and was living in his mother's basement.",
   "created_utc": 1691186220,
   "score": 102,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut9qiv",
   "message": "At boarding school: got one of the cleaning staff pregnant.",
   "created_utc": 1691182641,
   "score": 194,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut35v6",
   "message": "Hacked into computer system and change grades",
   "created_utc": 1691180109,
   "score": 30,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juszc37",
   "message": "Shot a flare gun into his grandmothers tv. Stole a truck.",
   "created_utc": 1691178666,
   "score": 9,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut5vnk",
   "message": "She had some form of autism, got the \\*second\\* best grade in the class, freaked out, ran out of the class and into the woods, people realized she was missing, there was a complete lockdown, police, helicopters, community sweeps, etc.\n\nFinished high school homeschooled.  Went to college after though, and apparently she was still super anti-social and off-putting, from what I've heard.",
   "created_utc": 1691181152,
   "score": 9,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutcze3",
   "message": "Shelly was a girl in my sister's grade when we were in high school. It was a VERY strict Christian school. Shelly and Chris got caught kissing on campus. They got expelled and all of us in junior high and high school had to congregate for a student assembly so Chris and Shelly could each publicly apologize in a speech to all of us for kissing on campus.\n\nYears later, there was understandably a state of upset among other students as two teachers were caught French kissing on campus while others kept walking around them. And nothing bad happened to the teachers. Rules for the kids but the adults did not have to follow the same rules.",
   "created_utc": 1691183890,
   "score": 177,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutbwsc",
   "message": "Jizzed in a salad and then put it back on the buffet line (the salads were in small individual containers)",
   "created_utc": 1691183462,
   "score": 195,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutbwvd",
   "message": "he brought a gun to school and posted it on snapchat. instantly got caught and expelled. stupidest thing anyone has ever done but also a blessing in disguise",
   "created_utc": 1691183463,
   "score": 220,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutd2u0",
   "message": "This kid came to my school because he was expelled from his old school. He hacked into the school system gave them a virus.",
   "created_utc": 1691183929,
   "score": 90,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jute4cd",
   "message": "She tried to kill the principal!",
   "created_utc": 1691184344,
   "score": 190,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutfitv",
   "message": "He started a fire in some backpacks. This was in elementary school like 91-92ish and we were in like 2nd grade. After that no one was allowed to go into the hall unattended (backpacks were in a weird corridor in the hallway outside the pod of classrooms).\n\nAnother one was the only male cheerleader beat someone to a pulp for making fun of him being a cheerleader. The fight was huge, interrupted all the classes and hundreds of student watched this cheerleader in uniform just pummel this other guy. They ended up outside the school in the middle of the street. Several teachers had to step in and stop the fight. I believe the cheerleader would have killed the kid if someone didn't intervene.",
   "created_utc": 1691184913,
   "score": 130,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jusyacv",
   "message": "Someone faked a shooting threat against me",
   "created_utc": 1691178267,
   "score": 9,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut8ac4",
   "message": "Happened in Kindergarten. There was a kid named Dexter who had severe anger issues. \n\nEvery day a small group of kids would get certain \"jobs\" to do around the classroom, such as line leader, table cleaner, etc.. Dexter got the table cleaner position and he was absolutely livid since he wanted to be line leader. \n\nWhat started off as a screaming fit escalated into him throwing scissors around the class, biting the teachers hand, shattering a window with his flying scissors, breaking the tank that housed the class gerbils, and just trashing the entire classroom. \n\nThe rest of the students had to evacuate the class while the teacher and principle attempted to restrain him. Security had to get involved. Never saw him again after that day",
   "created_utc": 1691182090,
   "score": 228,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutboj7",
   "message": "he was in grade 8, and went to go play tag with grade 6's\n\nHe just started decimating them, like just full speed, full momentum, right through the ceter-mass of the child.\n\nThan the custodian who was assigned to watch him clotheslined him, and I never saw either of them again.",
   "created_utc": 1691183371,
   "score": 3,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutcx6d",
   "message": "My husband got expelled for stabbing a kid with a protractor.\n\nIn his defense, it was self defense- several kids tried to jump him in middle school.\n\nAlso on his behalf, he's f!@#ing crazy.",
   "created_utc": 1691183864,
   "score": 215,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutdgxr",
   "message": "He beat up another kid and got suspended for a week.  On his first day back, he threatened his teacher, and was expelled almost immediately.",
   "created_utc": 1691184084,
   "score": 3,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutdjk6",
   "message": "A gay kid in my grade was singing at lunch, and was told to stop by a counselor and he ended up hitting her then flipping her off, the sheriff at our school was called to help out and then it was a mad dash around the school for the both of them, the sheriff chasing the attacker. \n\nAnother time was someone I was almost friends with was secretly dealing weed…I had no idea.",
   "created_utc": 1691184113,
   "score": 3,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutdwls",
   "message": "For double pantsing a girl in class when she stood up, then running from the room and shooting her self down the hallway on an office chair with a fire extinguisher. This was the final of many straws. Her locker was left empty after she left because no one wanted it and it ended up with nasty shit written about her all over it.",
   "created_utc": 1691184257,
   "score": 3,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juteaou",
   "message": "Kindergartener — long list of threatening behaviors (foster kid with every kind of past abuse) told me he was going to shoot himself and then come shoot me. I refrained from pointing out his lapse in logistics.",
   "created_utc": 1691184416,
   "score": 158,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutey1k",
   "message": "Knocked up a teacher, and then was busted with cocaine. While in jail he was expelled.",
   "created_utc": 1691184678,
   "score": 133,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutf3qd",
   "message": "For hurting the teavher and impaling his eye with a pencil",
   "created_utc": 1691184741,
   "score": 7,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutfyj7",
   "message": "He heard a rumor that person C was inappropriately looking at his little sister and started yelling at C and threatening him. That was his last straw after being caught with vapes and marijuana on campus.",
   "created_utc": 1691185091,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutg3e9",
   "message": "Stabbed a kid for mocking his dead sister.",
   "created_utc": 1691185145,
   "score": 203,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutgc83",
   "message": "Kid said he was going to play a prank on a teacher. It turned out to be a Molotov through his windshield.",
   "created_utc": 1691185246,
   "score": 142,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutgghs",
   "message": "he spit in the teachers coffee cup when she walked away",
   "created_utc": 1691185294,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutghfu",
   "message": "Stole an exam from teachers office. Teacher waited to see who else he gave it to. Both kids expelled.",
   "created_utc": 1691185305,
   "score": 92,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutglxy",
   "message": "Grabbed a girl's tit outside",
   "created_utc": 1691185356,
   "score": 6,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juth9ho",
   "message": "The final straw was when he lit a cigarette in French class and refused to put it out. Smoked it all. He was 13. I see him every now and again and he’s a mess",
   "created_utc": 1691185625,
   "score": 11,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juthf4n",
   "message": "Harley. He burnt down the playground twice. \nHe was honestly my favorite though.",
   "created_utc": 1691185689,
   "score": 148,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juthr6h",
   "message": "He started a fire in the boys room. Then got back in the next year. Oh Kevin. Then Fernando stabbed someone as a 15 y/o 8th grader, then came back sophomore year, fresh from juvie. He liked me though, so I was ok 😂 I was a dork, but my mother also taught his behavioral issue class, so he had a soft spot for us.",
   "created_utc": 1691185827,
   "score": 163,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juthswm",
   "message": "I got expelled for a fight.  Had to get a lawyer to get back into school.  \n\n25-30 people got suspended for a food fight.\n\nHad a friend get expelled for a fight with the star quarterback.  He never went back to school.\n\nRough year.",
   "created_utc": 1691185847,
   "score": 138,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juti1q4",
   "message": "he sprayed another student with zippo fluid and was attempting to set the student on fire when he was tackled.",
   "created_utc": 1691185946,
   "score": 242,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juti3dt",
   "message": "Peeing on a teacher who wouldn’t let him go to the bathroom",
   "created_utc": 1691185964,
   "score": 134,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juti3ei",
   "message": "I remember we had this quiet kid, and people would pick on him.\n\nSo one day in class, some fat kid was picking on him behind his desk, and quiet kid snapped. Grabbed his pencil and jammed it through the fatties arm. I never saw quiet kid again.\n\nNot sure if that meant he got expelled or what",
   "created_utc": 1691185964,
   "score": 137,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutil5d",
   "message": "She was a senior and he was a junior at a private high school. They got caught making a pot transaction on campus. She had to finish her senior year at the local public school. He was out for the rest of the year and was allowed to return his senior year to graduate. I don't know what happened to her, but I know he had some additional weed issues and was living in Canada waiting out the statute of limitations for a few years after college. He's back around now though.",
   "created_utc": 1691186163,
   "score": 9,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutitpi",
   "message": "Made a hit list of most of the kids at school and included Shania Twain. He made national news and was never heard from again.",
   "created_utc": 1691186261,
   "score": 96,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutm1vz",
   "message": "She drew threats on the bathroom walls, which leaked out to the Channel 7 News. Emergency PTO Meeting resulted. She went to Juvi for Terroristic Threat, got expelled, went to the next school two towns over where our teen moms and other exiles typically go. (Yeah, this was the late Nineties, not 1955.)",
   "created_utc": 1691187614,
   "score": 6,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutmng6",
   "message": "i put my bully into a coma.",
   "created_utc": 1691187870,
   "score": 13,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut0eyu",
   "message": "Bunch of people a couple years above me got expelled for taking pills in maths 😂",
   "created_utc": 1691179068,
   "score": 5,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutabo7",
   "message": "2 kids in my grade got expelled... One brought a knife to school (allegedly multiple times), and the other was the first to know about it, but didn't tell anybody). Both got expelled for it. The kid who knew but didn't tell anybody came back the following year. Both kids walked at our 8th grade promotion.\n\nNot an expulsion, but in 4th grade, a kid in my grade decided to bring a live round to school. He was just suspended for the entire year",
   "created_utc": 1691182857,
   "score": 6,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutaztb",
   "message": "She showed her P to the class. In 3rd grade.",
   "created_utc": 1691183112,
   "score": 4,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jusyvno",
   "message": "Had a molotov cocktail in his locker with intention to burn down the school.",
   "created_utc": 1691178493,
   "score": 2,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jusz72j",
   "message": "He brought alcohol to a school dance lol",
   "created_utc": 1691178613,
   "score": 2,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut4tb3",
   "message": "For getting some girl in another school pregnant (or so was the rumour).",
   "created_utc": 1691180739,
   "score": 2,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut60t6",
   "message": "Threw a big eraser out the 4th story window\n\nHits some lady pushing a stroller\n\nThe principal walks into the room like 30 minutes later; somehow found out that it came from our classroom.\n\nNext thing you know he got pulled out... someone snitched. \n\nHe missed prom, the senior trip, finished the school year at home, had to go to summer school, AND he didn't graduate with us. I'm still good friends with him",
   "created_utc": 1691181207,
   "score": 8,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut6755",
   "message": "In my country, you can't expell anybody fom school.",
   "created_utc": 1691181276,
   "score": 2,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut6f3s",
   "message": "A kid in my sister's class (chemistry) smoked weed (I believe), sharing it ... in the school cafeteria",
   "created_utc": 1691181361,
   "score": 2,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut6za8",
   "message": "Kid called in a bomb threat to get an extra day to study for mid terms. He was also known for bringing pot to school.",
   "created_utc": 1691181579,
   "score": 2,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jut9o9s",
   "message": "A kid at my mates school pulled a BB gun on the exchange students",
   "created_utc": 1691182617,
   "score": 2,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutbikm",
   "message": "Dealing drugs on school property. This was 7th grade.",
   "created_utc": 1691183304,
   "score": 2,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutbp3g",
   "message": "In 7th grade I knew a kid who came from a group home let's call him Will (for privacy reasons) I remember  being in a class with him one day then heard moaning in the back of the classroom so obviously the teacher came up to his computer and saw pornography on his computer of course will Closed out the tab and denied it  unfortunately he didn't notice the camera behind him the teacher took him to the principals office showed the footage and he got expelled for the rest of the school year",
   "created_utc": 1691183378,
   "score": 2,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutbujs",
   "message": "Lighting firecrackers in the science building!",
   "created_utc": 1691183437,
   "score": 2,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutdpo3",
   "message": "Threatened to shoot up the school.",
   "created_utc": 1691184180,
   "score": 2,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jute62w",
   "message": "I got in an argument with another kid I lied to the principal about what I said to her and there was no follow up cause she stabbed someone.",
   "created_utc": 1691184364,
   "score": 2,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutevg3",
   "message": "Made a hit list and a written plan to shoot up the school and told people about it",
   "created_utc": 1691184648,
   "score": 2,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutf2zg",
   "message": "I went to a very tony  private high school in suburban Portland Oregon that was in the news a couple of years ago.\n\nOne of the senior faculty members had a son that was dealing Mexican ditch weed to the entire student body (and some faculty) but managed to scapegoat another student when they got caught.\n\nGuess who got expelled, even though EVERYONE knew what the real deal was?\n\nAnd that’s when I started figuring out how shit works in America.",
   "created_utc": 1691184734,
   "score": 22,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutfmf8",
   "message": "This was a K-8 Catholic school and the rule was three suspensions in a year then it’s expulsion, this kid was an eighth grader, he wrote a rap song with many profanities that the teacher was not pleased with, a very misogynistic and perverted poem about girls, and the final thing he did after his two suspensions, was punching a first grader.",
   "created_utc": 1691184954,
   "score": 83,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutfr8s",
   "message": "Sold dried parsley as weed.",
   "created_utc": 1691185009,
   "score": 7,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutg3t8",
   "message": "Cocaine",
   "created_utc": 1691185150,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutgj5g",
   "message": "punching a kid right in the diaphragm for no reason. initially that earned him a suspension, but then the school found out/ took into account the other things he did. ex. repeatedly hitting me with his water bottle, saying jesus was a terrorist, and getting in trouble on various other occasions for various other things.",
   "created_utc": 1691185325,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutgrzb",
   "message": "He pissed in his school desk during 8th grade match class. He tried to make an excuse, but it just didn't add up.",
   "created_utc": 1691185425,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutgsbu",
   "message": "TLDR: Baked Beans\n\nMy cousin thought it would be funny to fling baked beans into his friend's face. Said friend then made a \"hit list\" and in order to punish one, they had to punish both.",
   "created_utc": 1691185429,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutgsmu",
   "message": "Texted a bomb threat to get out of school early.",
   "created_utc": 1691185432,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juthjwd",
   "message": "Fucker opened the Chamber of Secrets.",
   "created_utc": 1691185744,
   "score": 11,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juthnuw",
   "message": "Threatened to shoot up the school, he wasn’t even expelled, he got arrested after being caught selling drugs. We were in eighth grade.",
   "created_utc": 1691185788,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juthsqs",
   "message": "Bringing a hammer to school to jump another kid",
   "created_utc": 1691185845,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutht6b",
   "message": "He burnt down the school greenhouse.",
   "created_utc": 1691185850,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juti0mu",
   "message": "He tried to light an under classmens hair on fire in the public bus for laughs\n\nHe pissed off the deans one too many times over the years and they expelled him. Thinking back on it he was a pretty alright guy especially given his social group had some of the schools biggest assholes",
   "created_utc": 1691185934,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juti0wy",
   "message": "Bringing weed to school and got caught with it in her bag, it literally stunk out the whole classroom I don’t know how she thought she was gonna get away with that",
   "created_utc": 1691185937,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juti1jq",
   "message": "because his parents had more money than sense and didn't care about raising a kid.",
   "created_utc": 1691185944,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juti3am",
   "message": "He took a shit on the floor of the cafeteria",
   "created_utc": 1691185963,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juti7ji",
   "message": "Someone had anal sex at my homecoming in the middle of the dance floor. There was a pile of shit. Someone picked that up and threw it at someone in the face. \n\nThey got expelled lmao",
   "created_utc": 1691186009,
   "score": 13,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutidmo",
   "message": "I got expelled from high school for beating the crap out of a fella that beat up his girlfriend 🤦🏻‍♂️ 🤷🏽‍♂️",
   "created_utc": 1691186078,
   "score": 57,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutig3s",
   "message": "For making a fake bomb and slipping it into another kids backpack. Honestly looking back on it it's kinda impressive cause the little box thing had a flashing red light. Kid was in the fourth grade at the time and the bomb squad came to dismantle it. A few years later a legit bomb was found near the school he was moved to. Pretty sure he's in jail now",
   "created_utc": 1691186106,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutiwfm",
   "message": "Bro had cocaine in his backpack",
   "created_utc": 1691186292,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutizpb",
   "message": "Throw a hand made bomb in the school cafeteria while in recess time",
   "created_utc": 1691186329,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutj201",
   "message": "Started a fire in the boys bathroom.",
   "created_utc": 1691186355,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutj5f8",
   "message": "Kid got kicked out when his circuit board project caught fire.\n\nUnfortunately it's school policy, anyone caught smoking pot in school gets expelled",
   "created_utc": 1691186394,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutj5pz",
   "message": "He brought a knife to class and he was throwing a fit getting in trouble. I saw him crying and the principal at the time had no time to play around. “Get up now! Knock it off!”",
   "created_utc": 1691186398,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutj69g",
   "message": "Because he kicked me in my back so that I'd land into a bush of those spiky ball things. Jokes on him, I overproduce histamine, so my back created a perfectly identical imprint to his shoe. \n\nThey called him to the office to verify the match and he was expelled.",
   "created_utc": 1691186404,
   "score": 194,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutj7y5",
   "message": "He got an important science exam that him and his class were given a whole month to complete, when he gave the exam sheets to the teacher they were all blank and the only writing on it was \"fuck science\", the teacher said they were going to have to suspend him, he tried to start a fist fight with the teacher.\n\nHe was expelled as soon as possible, only 2 people in my class seen him after he got expelled and they both said he looked miserable.",
   "created_utc": 1691186423,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutj8nu",
   "message": "We all thought he got expelled but turns out he didn’t. He got sent to one of those awful teen reeducation camps by his parents. Poor guy. I only learned this recently after re-connecting with him.",
   "created_utc": 1691186431,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutj8o0",
   "message": "Selling acid behind the football field.  Really upset me because I didn't know he had acid for sale!",
   "created_utc": 1691186431,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutjamq",
   "message": "Brought a hammer to school to beat up the kid who he thought “stole” his girlfriend. Pulled it on him by the trashcans.",
   "created_utc": 1691186454,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutjc4x",
   "message": "Throwing peanuts at the girl who was known to be allergic",
   "created_utc": 1691186471,
   "score": 230,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutjf6e",
   "message": "She did a lot of things but I’m only aware of a few of them. \n\n1) she dropped a cedar block (I think that was what it was called) on another classmate’s hand. \n2) she threw a pencil at someone that ended up causing their nose to bleed. \n3) talking back \u0026amp; cursing at teachers. \n4) was racist towards me after she asked me about my ethnicity. \n\nShe didn’t make it to halfway of freshman year.",
   "created_utc": 1691186507,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutjgmn",
   "message": "This wasn’t the “official” reason but this kids dad was piping down the principles wife so the faculty basically hazed this kid into getting expelled. They would make jokes about his clothes, hygiene, and home life which didn’t make sense because this kids family had a lot of moneybags he was a clean kid. The teachers bullying him finally made him crack and in the middle of a big altercation, with the principle in class, the kid yelled, “I’m glad my daddy is fuckin your wife, I’m just pissed he didn’t give me a pass at her.” The whole class lost it and the principle cried.",
   "created_utc": 1691186523,
   "score": 49,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutjhkh",
   "message": "Threw a book at the teacher for $50",
   "created_utc": 1691186533,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutjizh",
   "message": "Threw a jar of manure into a group of bloods during lunch.",
   "created_utc": 1691186550,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutjjjd",
   "message": "So this was in fifth grade, this kid was BAD- like he was involved with drugs (this is pure speculation, but I remember he used to bring small bags with “weed” it could’ve just been oregano, idk), cussed out teachers (like not mumbling under his breath, full on verbal fights with the teachers) never did his work, his parents couldn’t even control him. The event that did it was him fighting with one of the male teachers after sending him out of the class for talking shit to one of the students. He refused to leave and when the teacher tried to call security the kid started punching him. Like not soft hitting like what some kids would do if they threw tantrums, but full blown punches. This kid wasn’t very big for a fifth grader but he could pack a punch. (The teacher wasn’t very built either, he was maybe 5’10? Slimish build, and this is just to my best memory) anyway it took like three staff and a security guard to pry this kid off the teacher and by then all of the kids including myself cradled in the corner. The kid go expelled, and the teacher quit I believe? I’m not really sure. We didn’t see him for a good 2 months (mid school year) I heard from gossip among the teachers, bad kid broke his ribs or something like that. He came back to the finish the semester and after that quit. Though I was already heading to sixth grade so I’m not sure. My sister (sister is a year under me) sister said she never saw that guy again.",
   "created_utc": 1691186556,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutjkpi",
   "message": "Said he would rape a girl if he owned her/ found her sleeping.",
   "created_utc": 1691186570,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutjmey",
   "message": "Dude put his phone under our teachers skirt and took a photo… this was like 2 weeks into freshmen year.",
   "created_utc": 1691186589,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutjmzm",
   "message": "Throwing one of thise old plastic chairs at the teacher.",
   "created_utc": 1691186596,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutjoce",
   "message": "They found a hit list in his locker after a student tipped off one of the teachers.",
   "created_utc": 1691186612,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutjt0d",
   "message": "Got caught jerking off in the library to National Geographic",
   "created_utc": 1691186665,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutjz4x",
   "message": "He put ratsak in a girl’s food in cooking class. Teacher was told before she ate it",
   "created_utc": 1691186736,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutk2uo",
   "message": "He got caught trying to fuck the rival high-schools horse mascot in the field they kept it in after his football team lost.",
   "created_utc": 1691186778,
   "score": 32,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutk36g",
   "message": "For doing mushrooms and having an existential crisis in Mr Haynes class lol",
   "created_utc": 1691186782,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutk3qi",
   "message": "Threw a Crayfish through an open window into a class, the Crayfish went down a male students shirt and bit him. This was the last straw for a string of stupid activity.",
   "created_utc": 1691186789,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutk4k6",
   "message": "Elementary school: Dude was suspended for a good month, and came into the class with the Vice Principal as she carried a few sheets with her, I could only imagine separate work. When they came in, Vice Principal asked if he was ready to join us again. He responded by whacking the papers out of her hands and onto the floor, running down the hall. Never saw him again.\n\nMiddle School: Dude was just a little obnoxious throughout the year, but nothing major from what I saw. Then one day out of the blue the whole school was required to change their passwords as the guy got a hold of a teachers password, and logged into a computer as them to change his grades.\n\nHigh School: No expulsions, but some of the shit that went down with some folks should have led them to be expelled.",
   "created_utc": 1691186799,
   "score": 47,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutk6kb",
   "message": "Pissed and put pubic hair in a specials needs kid drink. Found out once police were on campus.",
   "created_utc": 1691186822,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutk70a",
   "message": "Made a plan to shoot up the school after they suspended him because his hair was too long. \n\nThey arrested him 4 hours before he was going to do it.\n\nI wish I was joking",
   "created_utc": 1691186827,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutka74",
   "message": "Took AR-15’s and handguns from his dads stash and robbed a drug dealer with three hood dudes from the public school in our district (we went to a private school). When they went into the drug dealers apartment to steal the weed, Coke and money he wasn’t home so instead they robbed his 13-year-old sister, who was staying there, at gunpoint until she told them where the stash was. Being that he got sent to Juvie he was kicked out needless to say.",
   "created_utc": 1691186864,
   "score": 1,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutkafp",
   "message": "Cigarettes for blowjob in the school parking lot.\n\nThat was those *two* kids though",
   "created_utc": 1691186867,
   "score": 8,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutkbg9",
   "message": "Showed up to school in his full KKK uniform, white hood and everything.",
   "created_utc": 1691186878,
   "score": 112,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutlt8i",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutliam",
   "message": "He spiked a bunch of kids drinks with Ritalin in like 8th grade and a few kids had to be taken away by ambulance to get their stomaches pumped. It was rumored the same kid tried to kill his dad with a hammer.",
   "created_utc": 1691187383,
   "score": 202,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutkzbh",
   "message": "Sexual harassment/assault took the school two weeks after the first time he grabbed a girl’s ass. Also grapes girls in other places. Got decked by a girl our dads are friends her family was very proud",
   "created_utc": 1691187160,
   "score": 30,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutl4jg",
   "message": "During morning announcements; he ran into the office, grabbed the intercom mic, and yelled “fuck her right in the pussy!” Thanks, TJ. You made the student body smile for about 10 seconds that day.",
   "created_utc": 1691187221,
   "score": 92,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutnqpi",
   "message": "Stabbed me in my leg during a fight in middle school.\n\nOH WAIT HE DIDNT GET EXPELLED.\nMeanwhile same kid is the reason I didn't finish college in 2016. Got me kicked out of college after a fight.",
   "created_utc": 1691188340,
   "score": 7,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutogpv",
   "message": "I got expelled when I was 14 for gang related activity in a county school with a population of 650. Me and my friends said we were the cool guys. I shit you not they expelled all 4 of us.",
   "created_utc": 1691188652,
   "score": 112,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutpnzz",
   "message": "We had what we called “the mad pooper.” He pooped in the hallways three times before he was caught and expelled for it. Our school newspaper covered it every time, “the mad pooper strikes again.”",
   "created_utc": 1691189178,
   "score": 41,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juts56r",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutlydd",
   "message": "Class clown. Chemistry class. Dude caused another students experiment to react violently and blinded her. Half a dozen students saw him do it and heard him say he didn’t like her because she was smart.   He was in prison 4 years later. Dead 6 years after that.",
   "created_utc": 1691187574,
   "score": 179,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutlvxp",
   "message": "Russian exchange student in high school. Chased a squirrel, caught it, it bit him, so he swung it by the tail against a tree. \n\nHe was expelled for having a detailed map of the school with locations where he wanted to place bombs and a list of students he wanted to kill and how he was going to do it.",
   "created_utc": 1691187546,
   "score": 35,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutlnhs",
   "message": "Guy grew up doing Muay Thai, boxing and wrestling. Forgot where he was during a wrestling match and threw a spinning back fist that knocked his opponent clean out. He was completely mortified once he realized what he did. \n\nStraight A student, star athlete, and genuinely good guy. The class president even addressed it and organized protests and walk outs until he was reinstated. Even the guy that got knocked out and his parents forgave him and supported us. He did get reinstated but wasn't allowed to wrestle or box anymore. Not sure what the coaches pulled to allow him to play football. He eventually quit football too his senior year and was never really the same.",
   "created_utc": 1691187445,
   "score": 106,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutonw0",
   "message": "Put a picture of his penis in the yearbook that led to an investigation that ultimately landed him and 3 buddies in jail.",
   "created_utc": 1691188740,
   "score": 66,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutkeyl",
   "message": "I burned porn i downloaded off limewire onto cds and sold them for $10/pop.",
   "created_utc": 1691186920,
   "score": 148,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutl931",
   "message": "He kept getting caught having sex in the gymnastic room. They literally had cameras in the room and he kept bringing girls there between classes. Got caught like 5 times before he got expelled",
   "created_utc": 1691187275,
   "score": 220,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutm016",
   "message": "Dude got in a fight with a teacher who publicly shamed him in front of his class for \"not caring\". The dude was dyslexic and struggled to read aloud in class. Didn't have any more apathy than 60% of teenagers in a mandatory class. \n\nI work as a teacher now and I still think, while extreme, she had no right to do that to him.",
   "created_utc": 1691187593,
   "score": 124,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juuihh0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutqj1a",
   "message": "This is one of my favorite stories: \n\nSetting: high school in a rural area many years ago\nWe were seniors\n\n\nI'm in welding class one day and I overhear a couple kids talking at one of the welding stations(booths with concrete on 3 sides, open top, and a curtain behind you). I hear them talking about welding an object to the metal welding table. Of course I'm curious so I peak around the corner and see they are both looking at a spray bottle of pressurized axe body spray. I immediately realize this will go poorly, being a pressurized and flammable substance. So I butt in and say that's a bad idea.\n\nBoth these idiots cut me off and tell me to f off (I played football against them and their rival high school and we never got along super well) So I said whatever f you guys too and walked across the room where I can see the teacher and their booth and made myself look busy while watching these clowns. Sure enough(I didn't think they'd actually do it)I see the curtain shut, spark spark and boom! Flames shot out the top about 10 feet and this idiot comes busting out of the booth like a character in a cartoon hair back up and schinged soot all over his face and a big look of shock on his face. Teacher was red faced and yelled at this moron for a solid 5 minutes and stormed out with both these guys. Last I heard they were expelled from that school.\n\nI will never forget that smell. Axe and burnt hair",
   "created_utc": 1691189554,
   "score": 113,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutkxan",
   "message": "For dropping m80's aka 1/4 sticks of dynamite down the guys toilets on the 3rd floor of our highschool. Yup, that was my cousin, 2 days before his graduation,  my aunt almost killed him. God rest his silly soul. 😜",
   "created_utc": 1691187137,
   "score": 36,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutncor",
   "message": "The guy was intelligent and was overall a nice kid and a good student when I first met him. He got in with the popular crowd who were a bunch of degenerate druggies. Watched him slowly fall down that slope from junior high to highschool where he would just smoke weed all day and skip class. Experimenting with harder drugs. He ended up body slamming a kid he was bullying and the kid snapped his arm in half. Pretty bad compound fracture. Got expelled for that.\n\nMy mother is a nurse and looked after him a few times. He was in and out of the hospital for drug addiction and alcohol abuse.  Not sure if he turned his life around or if he is dead but I'm hoping he cleaned up his act and has found his peace.",
   "created_utc": 1691188173,
   "score": 101,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutnh3x",
   "message": "Swear to god… my first day of Jr High, a guy named Steven who I had gone to school with throughout all of elementary school blew a spit bubble and it landed in my hair at our first assembly. Never realized it. Just saw a teacher call him down from the bleachers then never saw him again. I ended up finding him about 20 years later and he told me that he had gotten expelled for it.  He was working at a gym trying to sign people up. I always wondered if the spit bubble had landed him there.",
   "created_utc": 1691188226,
   "score": 95,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutnwh6",
   "message": "Running through the cafeteria at lunch naked with a backpack on that he set on fire.",
   "created_utc": 1691188409,
   "score": 94,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutl39b",
   "message": "I went to a really small rural school.  300 students from K-12 small.  I started there in 2nd grade, and we were always a tight-knit class.  We had some kids come and go over the years, but the majority of the people I graduated with were also 2nd grade classmates.  In Jr High we had a kid come in, we'll call him Danny.  He was a total asshole, and he basically fractured our class from one cohesive group into cliques.  He and a couple of otherwise good kids basically became the school bullies.  It was bad enough that we had many substitute teachers quit after having our class.  Somehow they were always just careful enough to not cross a line to get into too much trouble.\n\nOur senior year my class planned to take a weekend trip to a semi-local amusement park as our \"senior sneak\" trip.  During the senior year Danny and his posse were worse than ever, to the point that many of us were not going to go on the senior trip, despite working our butts off doing carwashes and other fundraisers from Jr. High on in order to fund the trip.\n\nA few weeks before the trip, Danny and one of the others from his clique did something and got expelled.  I don't know the full details, but it had something do do with physical violence against our school counselor.  It was an overnight change in the dynamics of our class.  It was like the cliques disappeared.  Even the other Danny-followers that were left changed their attitudes and were nice to everyone again.  We all went on the trip and had a great time.  Graduation came and went, we had a PTA-sponsored overnight graduation party, then after that was over we all went and had a party at a nearby lake.\n\nI don't know what it was with Danny, but it was like an old cartoon where he was the bad guy that put a town under a spell, and once the superhero kicked his ass, the whole town went back to normal.  I wouldn't have believed something like that was possible had I not seen it myself.  I don't know what ever happened to him.  Despite the things he did to me and my friends, both directly and indirectly, I wish him well.  I hope that was a wakeup call and he turned his life around and made something of it.  I think it's more likely he ended up in prison though, but I have no idea.",
   "created_utc": 1691187206,
   "score": 70,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutlpoj",
   "message": "The dude smoked a joint in the school’s pool area, claiming “the chlorine would mask the scent of the weed.”  \n\nHe was caught within 5 minutes of sparking it LOL, idiot.",
   "created_utc": 1691187470,
   "score": 78,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "juto05n",
   "message": "This kid brought a gun to school cause he was \"gonna go sell weed after school\". Dude was literally showing it to everyone and on the last passing period of the day he took it out in the most packed bathroom and everyone started laughing, screaming etc so a teacher walked in and after asking around the school cop searched and arrested bro💀worst part was the gun was fake.",
   "created_utc": 1691188453,
   "score": 73,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutrqyk",
   "message": "Dropped LSD in the English teacher's water before class. This was in the late 90s",
   "created_utc": 1691190090,
   "score": 66,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutr0w7",
   "message": "Came on here to see if anyone mentioned what my friends and I did. Nope. Here goes. \n\nThey took the French fries away from our school cafeteria. So we began loading empty milk cartons full of food and dropping them down stairwells on teachers. The cartons had notes attached saying the attacks would continue until the fries came back. We were very sneaky, didn’t get caught for six months. \n\nUnfortunately, we were dumb kids who were really into the game Red Faction. Our school colors were red and white. So we took to calling our selves the White Faction. \n\nIt wasn’t until after we were caught did we consider that some people might think we were racist. \n\nI’m lucky we all only got a month suspension and ISS for another month. \n\nI have a phd and a law degree now. 😅",
   "created_utc": 1691189772,
   "score": 47,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutvsna",
   "message": "He kicked my friend in the ass so hard it broke his tail bone.\n\nHe literally broke my friend's ass",
   "created_utc": 1691191894,
   "score": 55,
   "submission_id": "15i8i6a"
  },
  {
   "comment_id": "jutlmnv",
   "message": "In middle school, this girl did nothing but start fights. The last I saw her, she was being taken, alone, on a full-sized school bus to who knows where. As the bus drove off, she squeezed herself halfway out a window screaming at everyone that she'd beat our asses.\n\nAnother kid in high school got expelled after bringing brass knuckles to attack some other kid. When confronted by the school officer, he tried to act like the brass knuckles were a decoration for his lanyard...",
   "created_utc": 1691187435,
   "score": 45,
   "submission_id": "15i8i6a"
  }
 ]
}