{
 "submission_id": "15i9uo4",
 "title": "What is the most fireable thing you have seen someone do at work that didn’t get them fired?",
 "selftext": "",
 "created_utc": 1691178516,
 "permalink": "/r/AskReddit/comments/15i9uo4/what_is_the_most_fireable_thing_you_have_seen/",
 "score": 22,
 "url": "https://www.reddit.com/r/AskReddit/comments/15i9uo4/what_is_the_most_fireable_thing_you_have_seen/",
 "comments": [
  {
   "comment_id": "jutd91t",
   "message": "When I worked retail, I once challenged a customer to step outside and fight. The customer - I'll never forget this - said, \"Dude, you're at work,\" and walked out, shaking his head. Sometimes the customer is right!",
   "created_utc": 1691183997,
   "score": 238,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juszb5s",
   "message": "tried his damndest to sleep with the bosses wife while out at a work party. got fired months later for something completely unrelated",
   "created_utc": 1691178656,
   "score": 204,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jut23ab",
   "message": "Supervisor freaked the fuck out on the sales guy and just clocked out. It was a super busy shipping day and he was just done. He got to the end of the driveway and turned around and clocked back in and they just acted like he didn't tell them to fuck off lol",
   "created_utc": 1691179695,
   "score": 93,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jut708h",
   "message": "Work drunk.\n\nThis was in car sales. Dude showed up drunk or heavy hangover constantly. But he sold a lot of cars, somehow, so they didn’t care",
   "created_utc": 1691181590,
   "score": 127,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutepeh",
   "message": "A security guard jerked off on an a bed in one of our unused rooms for our clients (I work in a residential adolescent mental health facility) for a month until someone found the bed absolutely covered in cum. Badge scanners were checked and the guy was identified, but instead of firing him he was just moved to the guard shack.",
   "created_utc": 1691184582,
   "score": 179,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutb1o5",
   "message": "Had a guy at work do these things during his time at a place I worked and he never got fired:\n\nAccidentally set fire to the trees out back whilst taking a pee, he was bored and lighting ants on fire. Fire truck had to come put it out - scorched earth!\n\nIgnored instructions from a spotter and dropped a 250k machine whilst the spotter was underneath (luckily, the legs on the machine prevented any injury). Edit: I was wrong, she wasn’t underneath just very close and looking underneath.\n\nThrew a plastic 55g drum at the owner in a fit of drunken rage.\n\nGot pulled over 25 minutes away from work 25 minutes after his shift and got a dui - blew a 0.21 and was in the local paper.\n\nGot drunk on moonshine from the back fridge, went into the bar bathrooms (during business hours) and pulled his infected tooth out with a pair of channel-locks, stole the bartenders tips and drove home a bloody drunken mess. Bathroom was an absolute disaster.\n\nRoutinely stole cash, beer, and merch.\n\nThrew a glass at me once, but that wasn’t really all that bad.\n\nPulled the wrong valve off of the bottom of a tank and lost ~800 gallons of beer before I could get it back on for him\n\nSome of the things from the top of my head, it was a while back now but he eventually quit.",
   "created_utc": 1691183130,
   "score": 49,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juszt9f",
   "message": "Talking shit about the manager while sitting about 50 feet from his desk- manager just walked away",
   "created_utc": 1691178842,
   "score": 176,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jut5w14",
   "message": "Long ago, when bookstores existed in the mall, I worked for one that had satellite calendar kiosks during the holiday season.\n\nDude who was working at the kiosk \"accidentally\" put two endorsed-by-the-register checks into his pocket instead of in the till and went home. \n\nAt the end of the night, there were some frantic phone calls made to figure out where this check went so they could balance the registers. When I came in the next morning, the assistant manager who had dealt with the whole situation was visibly frustrated that Dude had not been even been written up.\n\nHe was such a weird guy. Always stared a little too long after you finished talking.",
   "created_utc": 1691181156,
   "score": 141,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutfllc",
   "message": "Worked at a Video Game retailer, yeah that one, back when I was fresh out of college.  The Nintendo Wii was due to be released the following week and we were no longer taking pre-orders.  Some guy comes in with his girlfriend and wanted to preorder but couldn’t so he tried to bribe my coworker with $20 to get one anyway.  Store was full of customers and our supervisor was present.  Coworker busts out laughing, walks around the counter, puts an arm around the guys shoulder, literally busting a gut, wheezing with laughter.  Suddenly he stops laughing, looks the guy dead in the face and yells, “20 bucks?!?!  GO SUCK A DICK!”\n\nGuy’s face turned bright red and his girlfriend and the entire store started laughing at him.  Never saw the guy again.  Manager said that was hilarious but don’t ever do that again.\n\nCoworker was let go months later for gift card fraud shortly after I was promoted and transferred to another store.",
   "created_utc": 1691184945,
   "score": 250,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juszgdu",
   "message": "Curse out the boss in front of an entire team of employees (not me)",
   "created_utc": 1691178710,
   "score": 90,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutgk6g",
   "message": "I work for a union job that favors the lazy.\n\nOne time, a guy was loading an 18 wheeler and a female supervisor told him to hurry up because the shift was almost over. He got about 3 inches from her face and screamed \"HOW BOUT YOU SUCK MY DICK, BITCH!\" The supervisor immediately walked him out the door. Fired on the spot.\n\nTwo days later, he's back at work. He filed a grievance with our union steward for harassment and wrongful termination and ended up getting his job back WITH BACKPAY.\n\nSince that day, I never agreed with our local union...",
   "created_utc": 1691185336,
   "score": 103,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jut1xeq",
   "message": "Used a racial slur toward a Jewish co-worker in front of a customer. He claimed he didn't know that calling him a \"Cheap J*w\" was bad because all Jewish people love their money.\n\nHe was fired about a year later for sexual comments toward a married female customer.",
   "created_utc": 1691179633,
   "score": 151,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutl8vf",
   "message": "Not do her job. Find any excuse to avoid work. Spend half the day chatting on the phone. Then work unapproved overtime, claiming that she had too much work and needed to catch up. Yes, I'm talking about you, Stephanie. Worst co-worker I ever had.",
   "created_utc": 1691187272,
   "score": 168,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutj95q",
   "message": "Saying in front of HR, and I quote: \"Alright, which one of you boys is going to slap my face, grab my throat, call me a dirty whore and spit in my mouth?\"",
   "created_utc": 1691186437,
   "score": 102,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jut03jg",
   "message": "Invade Ukraine.",
   "created_utc": 1691178948,
   "score": 107,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jut2zes",
   "message": "I worked in a kitchen in high school and a guy bled on a pizza and stills served it.",
   "created_utc": 1691180039,
   "score": 108,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutiy9h",
   "message": "It was me, but I faked a coworkers death by putting a makeshift memorial up in his assigned parking spot on April 1st. It had his picture, flowers, a handful of candles,  the whole deal. The head of HR was not amused. Everyone else loved it though.",
   "created_utc": 1691186313,
   "score": 168,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jut5tsf",
   "message": "in my life i had one job outside of being self-employed: head of the IT department for a local retailer with three in-state locations and two out-of-state locations. everything was going great. new websites built, new software for the employees to list items online built, new inventory system setup, marketing going well, etc.\n\n\nthis was until nepotism kicked in. see, we were doing millions in ad buys on TV and low-and-behold the son of the lady we did these buys through needed a job. so he's hired and it was immediately clear this kid had no clue what he was doing. but he had some pull.\n\n\nhe fancied himself a nerd so he started tinkering with our site. not a dev branch, i'm talking production. the live website. soon after we got hacked. it took me some time to find out how the shell got onto our server. turns out dipshit, while making his unneeded changes, fucked with various security settings on our site. this led directly to us getting owned. it was all in the logs. i documented what he did and the consequences of it. we had to take the website down so internet sales immediately stopped. i had to go through all of the source code to make sure there weren't any other backdoors lurking. it was a PITA.\n\n\nthe kid never faced any consequences for this. i quit soon after and went back to self-employment. fun times!",
   "created_utc": 1691181132,
   "score": 52,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jut2r0y",
   "message": "Oh, I know another one:\n\nMy head of department got fired for telling the boss he should consider treating his employees better instead of wearing them out by motivating them and a raise or at least proper equipment.",
   "created_utc": 1691179947,
   "score": 35,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutfl43",
   "message": "\"What are you gonna do? Fire me? I'm your only line cook that'll take 3 waiters, a bus boy, and the dish washer with me if I leave!\" I was the dish washer.",
   "created_utc": 1691184939,
   "score": 70,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jut65ft",
   "message": "Worked a 24 hour shift doing manual labour. Then got into a truck, drove 2 hrs to another site do another 8 hour shift. Coerced a few underlings to join him. Then they had to drive home… 34 hours of working without sleep, driving public roads in that state thinking they where tough as shit…\n\nThe boss was an absolute scumbag, but even he had the sense to know that this was truly irresponsible. This was solely on the head of the narcissistic egomaniac foreman who thought he was the toughest badass around and only those who could follow him where the good workers.\n\nNeedless to say I opted out. I wasn’t on the foreman’s good side and he made my life hell for two years. In a way I’m thankful I learned so much about life and people in that time. I hit a massive low point in my life working with that man. But I came out stronger at the other end.\n\nHe was never reprimanded for this, and all the other things he did, which was unfortunate. But I’m happy to now be earning way above what he is. And he’s probably still destroying his body in the name of being a rough bastard.",
   "created_utc": 1691181258,
   "score": 36,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jut1x4z",
   "message": "Threw a glass bottle in the direction of an employee during a tantrum.",
   "created_utc": 1691179630,
   "score": 10,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jut3qti",
   "message": "A cashier stole money from another employee and didn’t get fired. Almost no one liked her, too. She was rude to any new employee and a good number of those who’d been there for a while. Said some very questionable things about certain Black employees, only just on the deniable side of racist. Eventually she was fired for pulling too many no-call no-shows, but it wasn’t a new thing for her. If we hadn’t switched managers not too long before that, she probably would’ve been kept on for as long as she wanted to work there.",
   "created_utc": 1691180332,
   "score": 16,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutkt8b",
   "message": "Accidentally send out the entire company's (3,000+ employees) headcount to the company distro. File contained everyone's salary, birthday, government numbers,etc.",
   "created_utc": 1691187089,
   "score": 68,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jut7gmr",
   "message": "I worked in a freezer for a while. All my bosses in there with us were pretty laid back. The best thing they said was they didn’t care if we smoked weed on the job, as long as we could do our job. Well one of the people who took advantage of that was the forklift operator. One day, while high, ran my foot over. It didn’t hurt too bad, just had a wicked bruise. I personally don’t blame him because we were talking just before it happened and my foot was in front of a wheel and he had something on his forks, so he didn’t see my foot. Management didn’t do anything about it. He was driving the next day. \nThere was also someone on 3rd shift who kept running into the sliding door that divided the freezer from the shipping dock. He ran into it like 3 times in 2 weeks before they told him they were gonna have him do something else",
   "created_utc": 1691181769,
   "score": 30,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutbz8s",
   "message": "I was doing some kind of apprentice's/studying and working thing.\n\nDuring semester breaks we were working, or would need to take time off.  That meant informing who you were working with (as soon as you would know), going through a tool process for requesting your time off, checking back it was approved.\n\nPeople were surprised when a colleague didn't show up on the first day after the semester. He hadn't called in sickm. After not being there until mid day, the department he should be at called our supervisor. The supervisor checked if there were time off or sickness and they simply forgot to inform department? Nope.\n\nSo they called him. It took more than one try, but he answered and told them\n\n\"oh yeah. I'm in new York. Sorry I forgot to inform the department or put in time off, I won't be there until two weeks.\"\n\nHe was not fired - and this would be one of the few actual offenses for which that _would have been possible_. Which is _hard_ in my country (rightfully so).\n\nEven worse, he was also not made to return immediately and I never heard anything about any other repercussions (albeit I simply may have missed them).\n\nI'm still blinking and wondering. That's not a \"oopsie\". It's traveling to another continent! It takes _months_ of planning. Yet no one even knew. He didn't simply forget to enter it, he told _no one_. Not even colleagues. And nothing came of it.",
   "created_utc": 1691183489,
   "score": 11,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutelhu",
   "message": "Fuck his assistant in our wellness room DURING business hours.",
   "created_utc": 1691184537,
   "score": 44,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutj576",
   "message": "Smashed an elevator glass button panel in the building they worked at, after hours, while bringing 10 drunk friends in to show them the office for some reason. \n\nThat guy is still there.\n\nEdit: I got fired from the same job for showing up late lmao",
   "created_utc": 1691186392,
   "score": 30,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutkgx5",
   "message": "Literally not working. She would get to work at 6:30 and I would see her leaving as I pulled in at 8:00. Her boss hadn’t even arrived yet. This was like 4-5 days per week. She maybe stayed till 2:00 on the good days. They tried to fire her and were told it was impossible to fire anyone for anything at a university. They waited for the grant to run out and then didn’t put her on the new one. It took 2 years.",
   "created_utc": 1691186943,
   "score": 54,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutlez8",
   "message": "I used to be a chemist in the lab, and I swear to God, every lab had one psycho. Our resident psycho had it out for one of the girls for some reason, and had to be physically restrained by another guy from attacking her. He didn’t like something she was talking about (he was an angry chauvinist). Another time he threatened to “bash her head into the glass window “. Management and HR did absolutely nothing, in fact they blamed her. She ended up taking him to court and filing a restraining order. He was forced onto a different shift and had to leave the property before she came in. Way to protect your own employees, assholes. Oh, and he accused everyone of being secretly gay together. Good times.",
   "created_utc": 1691187344,
   "score": 37,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jut4vw7",
   "message": "Doing wheelies in 80ft booms.",
   "created_utc": 1691180766,
   "score": 10,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutb08e",
   "message": "Almost caused an accident between 2 aircraft. Twice. They were let go about a month later for overall performance issues.",
   "created_utc": 1691183116,
   "score": 28,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutdo8r",
   "message": "Selling pot in the office.",
   "created_utc": 1691184165,
   "score": 15,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutl4vx",
   "message": "*Watched a man, in a union shop, go to his car and take a 1/2 hour (timed) break, then work 45 minutes, then take antother 1/2 hour break, and did this the entire 12 hour shift. Security guard was told to film him, but not interfere. Mgmt could't fire him due to union .*",
   "created_utc": 1691187225,
   "score": 15,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutlgzk",
   "message": "In a hospital the person went out to get a patient and called out in the waiting room, \"Where's my little (insert name of disease the infant had) baby?\" Basically just told all the people in the room what disease the baby had and the mother's jaw dropped and was furious. Nothing happened. She ended up quitting on her own 3-4 years later.",
   "created_utc": 1691187367,
   "score": 43,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutnp8p",
   "message": "He hit the OSHA inspector with a forklift.",
   "created_utc": 1691188322,
   "score": 0,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutq1xr",
   "message": "Worked at a deli for a summer that hired a bunch of high school kids with a large sweaty checked out manager. I was one of the high school kids. One of the other two had a block of havarti cheese they just opened to cut off six slices for a old lady. It was near the end of the day so instead of putting the rest of the block of cheese in syran wrap and in the refrigerator he put it down the garbage disposal. Just pushed it down with barbeque tongs while doing the \"shhhh\" gesture at me with his lips and other index finger. I just thought \"Well that's fucked up.\"",
   "created_utc": 1691189349,
   "score": 22,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutgnag",
   "message": "Leave 30 mins into the shift without telling anyone and logging it as a full 8hr day",
   "created_utc": 1691185371,
   "score": 24,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juticds",
   "message": "My brother punched his boss in his face. He deserves it. I am really happy that he did it",
   "created_utc": 1691186063,
   "score": 9,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutmyr7",
   "message": "Smoking crack, being visibly high on crack.  O.D.ed on the job multiple times.  Everyone in department, including management knew this was going on.  He was fourth year electrical apprentice who could not pass journeyman’s exam, because, you know, crack.",
   "created_utc": 1691188007,
   "score": 42,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutngtz",
   "message": "A guy got a dui and lost his license for three months and didn't tell anyone at work about. He drove a company truck daily for work and they only found out after he got his license back. I know he was still there 5 years later.",
   "created_utc": 1691188223,
   "score": 21,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutnxl1",
   "message": "Watched a coworker rent an entire big box retail store parking lot to a BMW dealership for cash on the side so they could park excess inventory.\n\nCorporate didn't know.  He pocketed all the money.",
   "created_utc": 1691188422,
   "score": 59,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutjgot",
   "message": "Having sex in in a closet and getting caught. \n\nI didn’t personally see it but it was widely known. News travels fast.",
   "created_utc": 1691186524,
   "score": 14,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutboqb",
   "message": "Coworker saying discriminatory comments about my age and others over 40. She wants herself to look good but it doesn’t and she’s still there.",
   "created_utc": 1691183374,
   "score": 11,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutcahr",
   "message": "Worked in a restaraunt as a bartender. One of our line cooks got a DUI on the way home from work. No punishment. Dude was an asshole too.",
   "created_utc": 1691183614,
   "score": 7,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jute73h",
   "message": "Go on an angry tirade, cussing and slamming shit on the ground. Just causing a seen in front of clients. Union said it was just a misunderstanding 😳",
   "created_utc": 1691184375,
   "score": 3,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juth0xi",
   "message": "Made a 9/11 joke at a Muslim woman in front of their boss",
   "created_utc": 1691185525,
   "score": 9,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juthvgh",
   "message": "Constantly watched people drink on the job and couldn’t say anything because management was doing it too.",
   "created_utc": 1691185876,
   "score": 9,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juthyib",
   "message": "The patient got pneumonia because of the wrong dose of medicine, still the patient didn't know, and nobody fired",
   "created_utc": 1691185910,
   "score": 3,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutis87",
   "message": "When I worked in telemarketing (a guy's got to eat) I saw a 24 year old coworker come in three hours late and with a major hang-over and doing all his 'work' that day with his feet up on the desk while napping in his chair. He was this way because the previous night he drove to a brothel and partied a little too hard, he informed us. I was wondering why he wasn't fired, until I found out that he was fucking the 10 years older floor manager.",
   "created_utc": 1691186244,
   "score": 9,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutj14a",
   "message": "Does it count if it was me? I smoked a blunt out back with my boss 😂",
   "created_utc": 1691186345,
   "score": 12,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutk395",
   "message": "Total a company car while DUI.",
   "created_utc": 1691186783,
   "score": 5,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutkw9v",
   "message": "I worked in a call center where a co-worker got caught, not once but twice, for masturbating at his desk when speaking with female customers.\n\nHR spoke with him about it, everyone knew what he had done but they just kept him on regardless.",
   "created_utc": 1691187125,
   "score": 6,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutkz30",
   "message": "Smoke joints in the bathroom and then proceed to blame it on me. Our boss wrote me up 😐",
   "created_utc": 1691187157,
   "score": 7,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutpeca",
   "message": "Assault other coworkers, 3 times..  \nThe third guy(a good friend of mine) that got assaulted got fired because he was upset about being punched in the face several times(because he THOUGHT the guy he punched stole his **soda**, which he *didn't*).  \nThe day after the guy got fired, the asshat that punched him brought in a cake TO CELEBRATE that the other guy got fired.  \n\n\nOnce I read the frosting on the cake and found out that the cake was to celebrate the firing of my friend I went to my boss and quit on the spot.",
   "created_utc": 1691189061,
   "score": 3,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutmlm7",
   "message": "Incite an insurrection at the capital.",
   "created_utc": 1691187847,
   "score": 2,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutq7sy",
   "message": "Destroyed the economy in 2008 by giving mortgages to people who didn’t have the ability to pay for them. But I’m sure the golden handshake was punishment enough",
   "created_utc": 1691189419,
   "score": 4,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juszu4h",
   "message": "I (29m) have a somewhat socially awkward guy that works in my department about my age. I work for a big investment firm where there is a lot of posturing and everyone is very professional. One day awkward guy basically tells the managers during a big department meeting with all of my coworkers that he felt like he was constantly belittled by the managers at every turn and he felt like they put themselves up on a pedestal above everyone else (no one else in the department shares this sentiment whatsoever). Me and my coworkers thought for sure he would be transferred out or fired at the worst after that but nothing happened to him. After I saw that I was like wow you must have to really screw up bad to get let go by management here. Has anyone else had someone pop off at work and they didn’t get fired?",
   "created_utc": 1691178851,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutd23j",
   "message": "This is a pretty mundane summer job story but it's the best I could think of. I used to have this job at the snack bar at this tourist trap in Colorado Springs, CO, USA called Seven Falls. I both made food and ran the cash register. It wasn't a bad job in retrospect, but of course I hated it at the time because I was a kid and work sucks. Anyways, employees from all the other functions in the attraction would usually come to the snack bar for lunch where we were supposed to charge them something like half price as the employee discount. I would frequently just let employees take shit without paying. Eventually my manager noticed on the cameras and confronted me about it. I fessed up and he was like okay well you can't do that again. And that was all that came of it.",
   "created_utc": 1691183921,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutd4op",
   "message": "I have currently only worked jobs where it’s me and my boss. My boss is literally a dog trainer and I will talk with her about some things my family does with our dog to keep him somewhat trained (she did and amazing job training our dog) she will give me this look of “why?” And every time I think “fuck this is it”. It’s kinda funny but she loves when I come to work because I help with the dogs and also make sure her work area is clean.",
   "created_utc": 1691183950,
   "score": 4,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutf11l",
   "message": "We had an office luncheon for Thanksgiving one year on a Friday.  They served wine at lunch. We were a smallish company back then with about 50 people. \n\nAfter lunch the managers would hole up in a conference room and get hammered. This year they decided to let a few select other employees come in. They invited one of our programmers and a few others.  \n\nApparently this guy had drank almost two bottles of wine at lunch alone. Then he started pounding back the liquor like crazy. \n\nBy 3 he was running up and down the halls yelling and people. Challenged a few people to a fight. He then laid in the floor of the conference room and started kicking and screaming and crying. They called his wife to coke pick him up when he first started to get out of hand but she was about an hour away. \n\nWhen she got there, two guys had to load him into an office chair and wheel him out the door to put him in the truck his wife was driving. He then proceeded to vomit on himself and the truck as they were closing the door. She was told to take him to the hospital to he checked out. \n\nHe showed back up to work on Monday like nothing had ever happened.  \n\nHe wound up getting fired a few months later because he made a really bad error with code that cost the company a lot of money and he screamed that he wouldn’t sign the write up so he was terminated then for insubordination. \n\nThere was also no more alcohol allowed at any employer function that did not include clients.",
   "created_utc": 1691184711,
   "score": 5,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutjqvq",
   "message": "Working IT. Gal I was working with returned a CPU with a vastly downgraded video card. I asked her about it and she said it was fried.I later caught a glimpse of the mounting bracket in her purse.We were friends then so I chose to keep quiet.That card was worth at least 400 dollars at the time.",
   "created_utc": 1691186641,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutkegu",
   "message": "Crash a six foot long maybe three foot wide fish tank into the support pillar of the building while driving the fork lift and yelling at us to pay attention while we stocked shelves.",
   "created_utc": 1691186914,
   "score": 5,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutks47",
   "message": "This was at an electronics big box store. This one person was pulling overnight orders in the warehouse the orders were for some 65 and 70 inch TVs. Well they pulled one out went to get the second one and like dominos all the large TVs on the rack fell over one after another it reached the end of the shelf and 6 took the dive after all was said and done at least 12 tvs destroyed",
   "created_utc": 1691187076,
   "score": 6,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutl2v2",
   "message": "Tell the supervisor to go fuck himself when he was told to get off his phone. My mind was blown",
   "created_utc": 1691187201,
   "score": 3,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutl6dz",
   "message": "Falling asleep multiple times. Sometimes while he was meant to be monitoring a potentially dangerous mechanical test rig.\n\nHe was lucky that is generally fell asleep in a position that looked like he was working.",
   "created_utc": 1691187242,
   "score": 5,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutl8wg",
   "message": "Jerkin it in the mens room. Union protected him.",
   "created_utc": 1691187272,
   "score": 6,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutl95r",
   "message": "A supervisor was fired for shaving time cards, then rehired a month later into the same position.",
   "created_utc": 1691187275,
   "score": 3,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutlfvy",
   "message": "Not only committed blatant time fraud but did it to promote her other business.",
   "created_utc": 1691187355,
   "score": 3,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutlg2y",
   "message": "spit in a sandwich, spread it into the mayonnaise, and give it to the customer. it was so gross and i legit told my (terrible) boss, who didn't do shit.",
   "created_utc": 1691187357,
   "score": 7,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutliw8",
   "message": "Opening manager ran over a employee in company box truck. Guy lived but was pretty banged up. Manager as far as I know never got in trouble but did end leaving down the line.",
   "created_utc": 1691187390,
   "score": 2,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutllzx",
   "message": "Run a porn and MP3 site off the corporate network.\nWhile doing coke off his desk.",
   "created_utc": 1691187427,
   "score": 5,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutlr6u",
   "message": "Got drunk on his lunch break, came back late and punched a hole through the bathroom door",
   "created_utc": 1691187488,
   "score": 3,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutlwas",
   "message": "Called the manager a \"fat f-ing c\\*\\*t\", walked out and returned the next day like nothing happened",
   "created_utc": 1691187550,
   "score": 8,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutm6dz",
   "message": "Send porn to the ENTIRE office of over 100 people",
   "created_utc": 1691187667,
   "score": 4,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutm8l7",
   "message": ".99cent store. 2 cashiers having oral sex at a register after hours. All the managers saw the video. No one lost their job even tho it was reported to HR.",
   "created_utc": 1691187692,
   "score": 3,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutmjta",
   "message": "Sounds like a rat trap. The cheese in this feed reeks.",
   "created_utc": 1691187826,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutmk3e",
   "message": "I watched someone live at work for 2 months.",
   "created_utc": 1691187829,
   "score": 4,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutmrud",
   "message": "Pass out at her desk from all the random prescription drugs she was taking.  Known doctor shopper to get pain pills.  Apparently had mixed a few that shouldn't get mixed, passed out, and breathing slowed waaay down.  Ambulance was called.  Surprisingly enough she wasn't fired, and we worked at a pharmacy.  No...not a liability at all!",
   "created_utc": 1691187923,
   "score": 5,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutn27q",
   "message": "I'm a retired pharmacist.  More than once, I had technicians who said things to me, and other people, like \"Make me, bitch\" and I used to work at a hospital with two men who, if they were the only pharmacists on staff on the weekends, literally did not work; they would sit in the break room and watch sports.  That they got away with it was not because they were men, but because one of them was, for reasons I never figured out, untouchable.  (He sure wasn't at his next job, I found out later.)",
   "created_utc": 1691188048,
   "score": 2,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutn5oe",
   "message": "Coworker was upset he didn’t get his second break on time and so he literally walked out of his job.. he came back the next day. Store leader literally begged him to not do that again. Guess you could say our store really needs workers.",
   "created_utc": 1691188089,
   "score": 2,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutn6o0",
   "message": "It's a tie...\n\n1) Supervisor engaged in sexual intercourse with one of his associates bent over her work space.\n\n2) Supervisor leaving a company function, hit two cars in front of three cops, ran, ran a red light, then drove back to the plant, across the back lot, bogged down to the axels and was caught trying to run away on foot.",
   "created_utc": 1691188101,
   "score": 4,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutn8zg",
   "message": "Drink a beer on the job.\n\nHe even got caught. Twice.",
   "created_utc": 1691188129,
   "score": 2,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutnf44",
   "message": "The dude showed up drunk to work. He drove. \n\nManager sent him home. I asked why he wasn't fired and she said it was because he never clocked in, so he technically wasn't intoxicated at work.\n\nLooking back, I think that manager really wanted to jump that guys bones.",
   "created_utc": 1691188202,
   "score": 7,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutnij6",
   "message": "I used to work in an office with a girl who was a hairdresser on the side. There was more than one occasion she gave someone a haircut on the clock.... management didnt even bat an eye! 🤷‍♀️",
   "created_utc": 1691188243,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutniv1",
   "message": "Came in obviously drunk and/or high on many occasions and on top of that his work was absolute shit. Took a year and a half to fire this dude.",
   "created_utc": 1691188247,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutnjk6",
   "message": "Past out drunk in the bathroom.",
   "created_utc": 1691188256,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutnpst",
   "message": "Had a guy who works for me set off fireworks in the parking lot during lunch (in a state that very much they weren't legal).  Ironically they told me put him on a PIP and he rage quit because I told him he had to be at work on time. I wasn't even implying any kind of wage theft, just \"You must be on site by 8, and I will pay you for whatever time you get here before then. If you need 15 minutes a day of OT just to be ready at 8, I'm fine with that.\"\n\nCouldn't handle that responsibility.\n\nAnother time, guy walks up to his soon to be ex, and tells her ,\"I'ma kill you bitch!\".  Standing there talking to my work buddy both of us managers (work buddy was her supervisor) and we're like \"wtf did you say?\"\n\n\"Aint got nothing to do with you it's between me and her\"\n\nDafuq?  \"uh were both management and you just made it between all of us\"\n\nCalled security, had him walked out and a week later.... there he is again. So I ask and Work Buddy says \"HR handled it, said it was a moment of weakness and he apologized\"\n\nAll I could do was permanently ban him on any project I was on which HR had no say about.  They got divorced, she remarried and as far as I know he never caused another scene.",
   "created_utc": 1691188329,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutns2k",
   "message": "Spitting in someone's food",
   "created_utc": 1691188356,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutnsut",
   "message": "Not a damn thing. He was also the bosses son though so yeah nepotism is cool",
   "created_utc": 1691188365,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutnyo2",
   "message": "When I was in HS, a teacher called me “an evil little bitch” right in front of the principal.\nNothing was done.",
   "created_utc": 1691188435,
   "score": 7,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutnysd",
   "message": "Nothing\n\nNothing at all\n\nDay in, day out, didn't lift a finger. Apparently, unless he did something egregious, he could just do nothing, collect a pay check and all benefits, and not get fired",
   "created_utc": 1691188437,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutnzlb",
   "message": "he would show up late to work every shift and would take an unscheduled break to go get high. got fired for crashing a golf cart.",
   "created_utc": 1691188446,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juto08y",
   "message": "I snorted meth at work, would show up drunk, stoned, high on coke, high on good painkillers.",
   "created_utc": 1691188454,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juto2i7",
   "message": "Caught fucking in the supply closet after business hours.",
   "created_utc": 1691188481,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juto3xw",
   "message": "A director of customer engagement publicly, in a department wide recorded meeting, told everyone he was going to participate in wage theft against his subordinates. I've never downloaded and saved a zoom meeting faster. Then, when he didn't get reprimanded or anything, I took that video to the labor board and sued them for wage theft. It just boggles my mind how a popular, well known start up would allow someone like that to remain on staff. Last I heard, half the call center was going after them for wage theft under the same condition that I did.",
   "created_utc": 1691188498,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juto549",
   "message": "Stole $40K from the company. How did she not get fired? She had proof the owner of the company was raping a 13 year old (his stepdaughter). Well, she bragged to someone about how she was untouchable and why. That person reported it to CPS. CPS investigated and the guy figured he had nothing left to lose, so he reported her for grand larceny. They both got arrested on the same day.",
   "created_utc": 1691188513,
   "score": 56,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutogdx",
   "message": "Murder a hospice patient.",
   "created_utc": 1691188648,
   "score": 1,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "jutt54i",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juua5m8",
   "message": "He was a manager. Girl wanted to get hired. He told her he would hire her if he got a bj. She agreed and he went to the bathroom and waited. Instead she went to HIS managers office just down the hall and reported him. Instead of getting fired he was demoted one step, I think because of lack of evidence, but this is totally something everyone that knew him would agree is something he'd do. He never made it back to manager even though he constantly tried. That's some justice but that prick should have lived in a box for that.",
   "created_utc": 1691198490,
   "score": 10,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juu0fau",
   "message": "He was an outside salesman, his work laptop had 1000's files of porn. His numbers were great so no one said anything. Three years later he got busted for kiddie porn. Our IT quit and sent info to the FBI. Every time I see that IT, I thank him.",
   "created_utc": 1691193968,
   "score": 3,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juu6ntr",
   "message": "I worked at Coca Cola.  A fellow driver was always short on his delivery truck.  He got so bold that he stopped in the parking lot on the way back in and loaded soda into his trunk, on camera.  CDL driver who will work are hard to come by, so they kept him.\n\nThe most egregious thing I’ve ever seen that resulted in termination was a Coca Cola also.  A driver basically hired his own coworker.  He was dropping his helper off down the street, going into work, leaving with the truck and picking him up.  He split his pay with him.  He would drive and let his “employee” settle the invoices and stock/merchandise.  This man was never employed with Coke and I can only imagine how the story would go if there was a bad accident or something.  \n\nThe second the next egregious firing was again at Coca-Cola.  Jay Leno even commented on it.  In Indiana PA, a Coke and Pepsi salesperson (account managers) got into a fistfight.  The guys name was Bob and he got hired for a chip company after.\n\nThis was the MOST TOXIC business and company I could have ever found.  I regret my wasted years there, what a scumbag company/culture.",
   "created_utc": 1691196822,
   "score": 3,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juu6ufz",
   "message": "A sales manager I worked with took a picture of his dick on a colleagues phone.\n\nThat colleague proceeded to email it to everyone in the building including the higher ups.\n\nHe claimed it was a joke that went too far and was forgiven, no probation, no write up, no public acknowledgement it happened at all.",
   "created_utc": 1691196910,
   "score": 3,
   "submission_id": "15i9uo4"
  },
  {
   "comment_id": "juus4w8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15i9uo4"
  }
 ]
}