{
 "submission_id": "15icbhv",
 "title": "What is something that ruined your life?",
 "selftext": "",
 "created_utc": 1691184146,
 "permalink": "/r/AskReddit/comments/15icbhv/what_is_something_that_ruined_your_life/",
 "score": 80,
 "url": "https://www.reddit.com/r/AskReddit/comments/15icbhv/what_is_something_that_ruined_your_life/",
 "comments": [
  {
   "comment_id": "jutqbnz",
   "message": "A really bad drug addiction after my moms suicide…. 1 year sober now……",
   "created_utc": 1691189465,
   "score": 113,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutfter",
   "message": "Depression. \n\nIt's devoured the last 7 years of my life.  Even though I'm trying, I take a hand full of pills every morning, I usually show up for appointments, I still don't remember what actually wanting something feels like.",
   "created_utc": 1691185033,
   "score": 74,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutds5f",
   "message": "Oh, of course I know him, he's me!",
   "created_utc": 1691184208,
   "score": 87,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutgmnp",
   "message": "My spouses personality disorder",
   "created_utc": 1691185365,
   "score": 35,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutiwaw",
   "message": "Abuse and bullying, I'm sure I am not the only one",
   "created_utc": 1691186290,
   "score": 31,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutg9dk",
   "message": "It ruined my life for 30 years. Typical alcohol and drugs. I bartended for 25 years so it all came easily to me. People love buying their bartenders shots and tipping drugs. Luckily I found out at 46 that I have bipolar II, ADHD, and general anxiety disorder. I realized I'd been self medicating and weened myself off everything. Now I only take my prescriptions and I lead a fairly healthy life. Lost 80 lbs too. So, yeah, I ruined my life for quite a while but thank goodness I was able to get my stable happy life back.",
   "created_utc": 1691185214,
   "score": 20,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juto9ck",
   "message": "Borderline personality disorder; it makes me an asshole and I have to expend so much energy trying not to be. Crazy mood swings, the ANGER, stupid impulsive decisions that you’ll regret for the rest of your life, unhealthy relationships, constant fear and anxiety, warped self-image that gave me bulimia, I’ve torn my body to bits through self-harm, turned to substances to try to help which lead to addiction issues wiping out 15 years of my life… and at some point I developed psychosis to go along with it, so now I have to take medications that make me feel like a brain-dead zombie all the time. I wouldn’t wish it on anybody, and I know people with BPD get a bad rap for being ‘crazy’ and ‘toxic’ in relationships and stuff, but honestly we just wanna be loved, we’ve just got a funny way of going about it.",
   "created_utc": 1691188563,
   "score": 49,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutjyu8",
   "message": "Fear.  Most all aspects.",
   "created_utc": 1691186732,
   "score": 13,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutnkdd",
   "message": "Outward bound course. Got bitten by a tick, got Lyme's disease and that turned into chronic viral arthritis and then ME.",
   "created_utc": 1691188266,
   "score": 13,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jute4nz",
   "message": "Depression",
   "created_utc": 1691184348,
   "score": 12,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu07ey",
   "message": "Alcohol.\n\nSober for 4 years and a half now !",
   "created_utc": 1691193868,
   "score": 11,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutsz4m",
   "message": "Eating disorder. It has ruined my body but also my brain. I'm pretty much a shell of who I used to be.",
   "created_utc": 1691190639,
   "score": 10,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutzbyg",
   "message": "Being fat. I was an obese child who became an obese adult. I had diabetes by 17. I was bullied every day, and my parents weren’t much kinder. I did not know how to fix it, I was a gd kid. I had gastric bypass in my late 30’s and lost most of it but my diabetes did not improve like I was promised. I am almost 50 now, irreversibly damaged by the bullying and shunning by my own parents.",
   "created_utc": 1691193472,
   "score": 16,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutz0zc",
   "message": "Taking ecstasy and opioids as a 13 year old. I took a lot of drugs from then onto about 19 or 20.\n\nIt ruins your reward system so you have no incentive to do anything. Not even to improve yourself. You become a shell and are ready to wait and die. Sometimes I get a glimpse of happiness and what I need to get there, but I do wonder if I am so emotionally stunted I just can't get there. It's like I am right at the top of a ladder but the last 4 bars are missing. I can see the top. Just barely touch it. But I am missing the last few components to get there. :'(",
   "created_utc": 1691193333,
   "score": 8,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu48nu",
   "message": "Mental illness",
   "created_utc": 1691195709,
   "score": 9,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutewo0",
   "message": "Ex,drugs and my ,,dad,,",
   "created_utc": 1691184662,
   "score": 6,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutz9xs",
   "message": "Getting a chronic illness in my twenties. It's like my life ended at that point.",
   "created_utc": 1691193447,
   "score": 7,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutv1z3",
   "message": "My ex",
   "created_utc": 1691191564,
   "score": 7,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu4bx7",
   "message": "Becoming legally blind.",
   "created_utc": 1691195750,
   "score": 7,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juts6mc",
   "message": "social media",
   "created_utc": 1691190286,
   "score": 11,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutf9zx",
   "message": "Meth destroyed my family as a kid.",
   "created_utc": 1691184813,
   "score": 5,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutozd9",
   "message": "My birth",
   "created_utc": 1691188880,
   "score": 5,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu0bb9",
   "message": "Toxic mold poisoning.loss and neurological and cognitive effects.",
   "created_utc": 1691193917,
   "score": 6,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu7qa0",
   "message": "I married a extremely narcissistic woman. I cannot emphasize to readers out there to steer clear of them. They will smile to your face while plotting your demise. I know readers won’t agree, but they enjoy so much your pain. Pain they caused. They literally thrive on seeing you suffer in misery and tell you I love you while doing it.",
   "created_utc": 1691197333,
   "score": 4,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutr671",
   "message": "My bad choice in women",
   "created_utc": 1691189838,
   "score": 4,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutv63w",
   "message": "Not being financially wise.",
   "created_utc": 1691191615,
   "score": 4,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu1a62",
   "message": "I used to be good at math and bad at reading. So my school would take me out of class to work with a reading tutor. Doing this made me miss out on any math classes from 2nd until middle school. Basically anything after multiplication I was never told existed. My reading did not improve until I was shown comics and got deeply invested in them. So basically they made my math and reading skills useless! :)",
   "created_utc": 1691194359,
   "score": 4,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu42y6",
   "message": "Lots of things “opening up” to my “friends”, my bpd mom, my dad trying to kill me, my depression, my attachment disorder, being pull out of school in the 3rd grade, homelessness, poverty, adhd and my autism\n\nI’ll add more because why not childhood sexual trauma, ptsd, anxiety, panic attacks, alcoholism, incelldom, unable to save a friend from dying, survivors guilt from being unable to stop a rape and murder when I was homeless, being ntred, drugs, religion, abandonment, gaslighting, porn addiction, being tortured in front of a cop when I was 12 and having nothing done about it, disassociation, being beaten up a lot, childhood malnutrition and neglect, being involuntarily committed as a child for something I didn’t do, betrayal, trusting the wrong people, almost killing somebody and being treated like an investment or charity case.",
   "created_utc": 1691195638,
   "score": 4,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu07u6",
   "message": "Being raised in a cult….moronism",
   "created_utc": 1691193873,
   "score": 7,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu2njl",
   "message": "It’s me. Hi! I’m the problem it’s me!",
   "created_utc": 1691194985,
   "score": 7,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutgyr7",
   "message": "Heroin",
   "created_utc": 1691185502,
   "score": 3,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu0osv",
   "message": "My poor financial management.  So now I shall be a cheap bastard to myself to correct it.",
   "created_utc": 1691194087,
   "score": 3,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu1tf4",
   "message": "BDSM is part of my earliest memories. The problem continues as an adult. I will never be stable.",
   "created_utc": 1691194608,
   "score": 3,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu788f",
   "message": "My ex. Manipulated my entire friend group into hating me. It took tons of evidence to prove he was a liar and manipulator.",
   "created_utc": 1691197091,
   "score": 3,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juuck6g",
   "message": "Toxic family…went NC and got some therapy….things are much better now!",
   "created_utc": 1691199648,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutxlpy",
   "message": "Alcohol and gender dysphoria",
   "created_utc": 1691192698,
   "score": 4,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutk5de",
   "message": "Myself",
   "created_utc": 1691186808,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutqk9j",
   "message": "Alcohol.",
   "created_utc": 1691189569,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutvema",
   "message": "My ill mind",
   "created_utc": 1691191719,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutzscl",
   "message": "I spent most of my childhood and 20s trying to fit in. I never fit in. I felt like I couldn’t be myself. I was a people pleaser and yet I never met the friends I hoped for. Instead I wasted years, time and energy on people who were not worth it. People who didn’t really even like or care for me..I wish I had spent that time developing myself or on hobbies, learning a language.. fitness, ANYTHING other than trying to be friends with ppl and trying to be liked. Focusing on other things instead could have lead to lasting friendships on their own without me trying so hard.",
   "created_utc": 1691193679,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu2hs9",
   "message": "My birth",
   "created_utc": 1691194913,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu37xw",
   "message": "Parents that physically, mentally, and emotionally abused me before depression started to take hold.",
   "created_utc": 1691195243,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu3y8b",
   "message": "Heroin",
   "created_utc": 1691195577,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu40bx",
   "message": "Adderal. Well maybe I’m exaggerating. But it was not a friendly factor is some issues.",
   "created_utc": 1691195604,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu42ho",
   "message": "Poor reactions to trauma early in life setting me on a path of compounding misery. I've since learned how to cope, but holy shit am I a wreck lol. At least life is merciful enough to be short.\n\nStill wild to me that some folks actually enjoy all this commotion, and would leave life a positive review on Yelp.",
   "created_utc": 1691195632,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu51p7",
   "message": "Me. Definitely me.",
   "created_utc": 1691196078,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu68m7",
   "message": "People tricking me into believing something was wrong with me (that got sorted out years ago thankfully), and a big friend betrayal from a long time ago as well. Healed from the event itself obviously, but lost faith in making lifelong friendships after that. Still have hope I'll keep meeting some nice people along the way, but that was truly a damaging thing that particular person did to me.",
   "created_utc": 1691196625,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu6teq",
   "message": "PTSD from a deadly rollover. Being raised by a woman with BPD who did NOT want me and reminded me all the time that I ruined her life. That I was the reason Dad died. Being adopted but not being wanted is fuckin weird.",
   "created_utc": 1691196897,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu6xkc",
   "message": "Fear of failure. Wasting years of my life trying to have a meaningful relationship with a family that wants nothing to do with me. Depression.\n\nIf I could do it again, I would have left as soon as I turned 18 and cut off contact.",
   "created_utc": 1691196951,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu7e30",
   "message": "SSRI lexapro lead to basically deleting my life",
   "created_utc": 1691197169,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu9wcm",
   "message": "Being sexually abused as a young child. Being autistic as well without knowing it until adulthood, facing constant bullying throughout school. Even being bullied by teachers. I still struggle with it till this day and will for the rest of my life",
   "created_utc": 1691198368,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juua774",
   "message": "My son being diagnosed with a rare terminal genetic disease called krabbe disease in April. Life has been completely flipped upside down since then.",
   "created_utc": 1691198511,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juuamw6",
   "message": "Drugs and alcohol. I'm 42 and trying to turn this thing around on my own.",
   "created_utc": 1691198722,
   "score": 2,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juufggj",
   "message": "Unmedicated ADHD and doctors being obnoxious about treating ADHD. \n\nI barely graduated high school. C average, and technically didn't have the credits to transfer to a real college since I failed both math and Spanish outright. Everyone just assumed I was lazy, and it looked it. I couldn't study. I couldn't pay attention. One minute I'd be listening to the teacher and the next I'd be off in my own little mental world fighting monsters or whatever. \n\nI had gone to the doctor previously,  but they are so reluctant to diagnose ADHD. I even took a test that basically pointed directly at ADHD and he thought I made up my answers. He gave me mental exercises to practice and told me to download and listen to ocean music while I studied. What? \n\nA year goes by and I go to a community college. Of course once again I'm struggling with absolutely everything, except here there is even less control so I'm pretty much fucked. After 2 years I drop out and just get a job at a subway. \n\nAt subway I'd fuck up constantly. My manager saw all the signs of adhd and gave me his own doc. 22 years old and I finally had one that was willing to let me try stimulants. The first time I took adderall it was like the world had suddenly opened up to me. I went from an extreme introvert that could barely hold a conversation to an extrovert. I suddenly felt like doing things other than video games. Like before this there wasn't career idea or anything I could possibly find enjoyment in. Everything was boring and shitty. Adderall made it all fun. \n\nIn 4 years I went from living with my parents making minimum wage to starting a business, successfully running it and making loads of money, buying a house with cash, making tons of friends, traveled all across Europe, Japan, and 25 or so states in the USA, learned to draw (something I always dreamed of but couldn't commit to).  It was like a brand new me. \n\nThen the palpitations came. Adderall was fucking my heart up, even though I was only taking it once or twice a week. I went to a cardiologist and he told me to get off it. We tried non stimulant meds, but they did fuck all. \n\nSo now here I am. Business is nearly dead. Friends are too much work. I play games and browse reddit all day making 20k a year working like an hour or two because I can't bring myself to do more. Haven't traveled since Covid. I have 0 motivation to do anything. I've tried depression and anxiety meds just in case, but they join the non stimulant ADHD meds in doing nothing. I want to feel normal again. I'm so jealous of all of you out there that just love going out and doing stuff, making friends and maintaining friendships naturally. None of this is enjoyable without those stupid blue pills.",
   "created_utc": 1691201039,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juuh6gq",
   "message": "Husband died and left me a single parent.",
   "created_utc": 1691201873,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutyt5w",
   "message": "Taking the covid vaccine and having brain inflammation.",
   "created_utc": 1691193234,
   "score": 4,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutwsc4",
   "message": "Toxic masculinity",
   "created_utc": 1691192335,
   "score": 3,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutepn3",
   "message": "My childhood and anorexia lol",
   "created_utc": 1691184584,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu32ky",
   "message": "doing competitive gymnastics at a young age.\n\nthis fcked up my view on my body and i faced a lot of abuse from other gymnasts and even coaches whether it was mental or physical abuse. \n\nthis lead to bad eating disorders, self harm, depression, anxiety, suicidal thoughts and attempts… it was a long 3 years.. \n\ni’m now on medication- anti depressants and anti psychotics and smoke weed to help with all my problems but i’m finally happy, clean and healthy again",
   "created_utc": 1691195176,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu3xcx",
   "message": "Marijuana...I'm almost 13 so that's not the best.",
   "created_utc": 1691195566,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu4lek",
   "message": "Video games, turns out I spent my whole childhood/first decade of my adult life playing video games and now I don’t know how to socialize so I just keep playing more video games. I’m scared I’m going to die alone",
   "created_utc": 1691195870,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutpiji",
   "message": "Females",
   "created_utc": 1691189112,
   "score": 250,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutjq94",
   "message": "Men",
   "created_utc": 1691186634,
   "score": 253,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutuzbc",
   "message": "Leftists and rightists",
   "created_utc": 1691191531,
   "score": 253,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juts5fe",
   "message": "Trusting someone who lied and said they would take care of me. They managed to manipulate me into destroying my own life. They have moved on and are happy knowing they sucked me dry of everything I had.\n\nPro tip: do not ever marry someone in the military! Your career will always come second and you will always have to sacrifice everything that makes you happy while they have to sacrifice nothing!",
   "created_utc": 1691190272,
   "score": 0,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutj83z",
   "message": "Me and being blind to myself.",
   "created_utc": 1691186425,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutjo8p",
   "message": "Brick.\n\nIf you know, you know.",
   "created_utc": 1691186611,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutm5jv",
   "message": "My dad.",
   "created_utc": 1691187657,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutob4d",
   "message": "My family.",
   "created_utc": 1691188585,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juttgwy",
   "message": "My ex wife, I had to take our kids and run. Her dumbass ended up getting deported a couple years later.",
   "created_utc": 1691190862,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutxin4",
   "message": "Military",
   "created_utc": 1691192659,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juty1n6",
   "message": "Lupus",
   "created_utc": 1691192892,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutz03z",
   "message": "Your looking at em",
   "created_utc": 1691193323,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "jutzj49",
   "message": "I write about it a lot on Reddit but here's a quicky.\n\nLast year I started getting short of breath. It got worse and worse so I went to the Dr. Dr sent me to er. Er finds a mass in my chest, right lung no longer working due to diaphragm paralysis . I have to go on oxygen. My whole life flips upside down. I go on medical leave, disability, food stamps. Drs refers me to surgeon. The surgeon says no. Too fat for surgery. (gained 95 lbs after my mobility is compromised from being unable to breathe.) They tell me I need weight loss surgery. So weight loss surgery won't kill me but lung surgery will? My life is currently a nightmare.",
   "created_utc": 1691193563,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu0ani",
   "message": "emmm nada lol",
   "created_utc": 1691193908,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu0lim",
   "message": "My childhood",
   "created_utc": 1691194046,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu165z",
   "message": "Family and trauma mainly",
   "created_utc": 1691194306,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu1f0h",
   "message": "My heath and metal health",
   "created_utc": 1691194422,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu1m4s",
   "message": "making friends with the wrong ppl",
   "created_utc": 1691194514,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu1vnn",
   "message": "My obsession with celebrities.",
   "created_utc": 1691194636,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu1yb1",
   "message": "Love",
   "created_utc": 1691194668,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu20cq",
   "message": "Depression",
   "created_utc": 1691194694,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu2a42",
   "message": "Anxiety, stress, and insecurity",
   "created_utc": 1691194818,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu2s9z",
   "message": "Married an addict.",
   "created_utc": 1691195045,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu2z9a",
   "message": "Bipolar and psychosis",
   "created_utc": 1691195133,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu33eu",
   "message": "Toxic relationships",
   "created_utc": 1691195186,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu38fl",
   "message": "Having a stroke at age 27. Messed with me mentally and physically. Almost lost my marriage. Lost multiple friends. Finally recovering and mostly enjoying my life now. 5 years later.",
   "created_utc": 1691195249,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu38zw",
   "message": "Generalized anxiety.  Think feeling like the orange M\u0026amp;M all the time.",
   "created_utc": 1691195256,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu4di2",
   "message": "A complete and total lack of self-confidence.",
   "created_utc": 1691195771,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu4du9",
   "message": "Many things have ruined my life over the years, or so it seemed at the time.",
   "created_utc": 1691195775,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu4hc6",
   "message": "Ex but I'm also grateful. Without pain, there is no growth.",
   "created_utc": 1691195819,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu4jig",
   "message": "Plantar fasciitis! I can barely walk my dog in the morning! I was in the best shape of my life and suddenly I’m getting stabbing pains in my foot. Thanks covid for making it impossible to see a doctor. I sit on my ass 90% of the day and the 10% I’m on my feet is out of pure necessity. I miss running, i literally dream about it. Seeing a doctor next week and hopefully they’ll just chop my foot off and give me a prosthetic",
   "created_utc": 1691195846,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu4trx",
   "message": "Metastatic breast cancer. I'm exhausted, nauseous, and depressed every day. My muscles ache. I'm broke (🇺🇲). My lifespan has been shortened, but I can't \"live like I'm dying\" because I don't have the energy or the money for that.",
   "created_utc": 1691195975,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu53ju",
   "message": "OCD when it gets bad, it’s so bad. I have to touch each side of my body in the exact same way with the same amount of pressure, I have to endlessly check that doors are locked, that the baby is breathing, that laundry is folded the right way and put away by type and color. On a good day, I just feel like I am “double checking” everything. On a bad day, I can’t even sit on the couch without making myself miserable.",
   "created_utc": 1691196101,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu5e60",
   "message": "My ex.\n\nI'm slowly putting my life back together 4 years after leaving her.",
   "created_utc": 1691196237,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu5fjb",
   "message": "My eyes.",
   "created_utc": 1691196253,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu681o",
   "message": "Alcohol.",
   "created_utc": 1691196617,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu68ra",
   "message": "Being fat.\n\nAround 18-19 I was about 260 pounds and started getting back pain, high blood pressure, sleep apnea and fatty liver. I lost a lot of weight but It's a lifelong struggle and it's caused a lot of health problems. Self image problems too.",
   "created_utc": 1691196626,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu69qf",
   "message": "Procrastination",
   "created_utc": 1691196640,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu6dtc",
   "message": "My parents",
   "created_utc": 1691196692,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu6v8x",
   "message": "I don’t know if I’d say it’s ruined my life because I’m working on them and I plan on getting better, but there are a lot of things. Insecurity, especially around height and dick size. Being fat. I’ve lost almost 50 lbs now so I’m doing well with that. I also have ocd and some other mental stuff going on (add, perfectionism, etc). Ocd and insecurities really don’t go well together haha but yeah that’s my answer",
   "created_utc": 1691196921,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu6vjs",
   "message": "Many stupid mistakes.",
   "created_utc": 1691196925,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu70ni",
   "message": "my first love",
   "created_utc": 1691196991,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu70ou",
   "message": "me, myself, and I babbbbby!",
   "created_utc": 1691196992,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu7940",
   "message": "Getting defrauded of nearly everything",
   "created_utc": 1691197102,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu7ht6",
   "message": "That fucking asshole drunk driver that killed my mom",
   "created_utc": 1691197218,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu7lh4",
   "message": "Parental Trauma from childhood. Committed a HUGE Mistake before I learned 💯 😪. Now rehabbing after receiving 25 years of punishment from my action",
   "created_utc": 1691197268,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu7s3p",
   "message": "Me.",
   "created_utc": 1691197357,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu7vxz",
   "message": "Anxiety",
   "created_utc": 1691197409,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu80cj",
   "message": "My soon to be ex-husband. He decided he loved beer/cocaine more then his wife and adult kids. I lost everything, even my house. I hope it was worth it for him. All alone now for the rest of his life but he's got his drugs!! We will turn all this around and be happy again.",
   "created_utc": 1691197468,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu8165",
   "message": "ngl but having the best childhood and adolescence anyone could ever dream of, filled with lots of travels, good schools, good food and many rich and affluent experiences. Now 26 trying to figure out my life and dealing with extreme isolation, weed and video game addiction, adhd, mediocre work ethic, mid confidence, no romantic partners etc. I guess because I never really had anything serious to worry about, I never developed the drive and work ethic to be anything other than average or probably below average. And I suppose I’m okay with that for now",
   "created_utc": 1691197480,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu85ft",
   "message": "When they decided to cancel BeetleBorgs",
   "created_utc": 1691197535,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu879w",
   "message": "My childhood.",
   "created_utc": 1691197559,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu8g73",
   "message": "GAD",
   "created_utc": 1691197678,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu8jss",
   "message": "It wasn't the heroin so much as it was the love of heroin. I'm clean now but that feeling still remains. Hard to listen to the first Velvet Underground record now",
   "created_utc": 1691197724,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu8k7c",
   "message": "Alcohol.",
   "created_utc": 1691197729,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu8ye2",
   "message": "COVID.......I can no longer work. I was a workaholic and loved my job.",
   "created_utc": 1691197919,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu8yfm",
   "message": "My own choices.",
   "created_utc": 1691197919,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu90y4",
   "message": "SSRI medication. I felt icky and not myself for two years. Age 16-18 was a blur. Medication doesn't drug anymore out of autism spectrum and help you meet the love of your life or earn $150,000 per year.",
   "created_utc": 1691197953,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu9a70",
   "message": "Anxiety",
   "created_utc": 1691198075,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu9h0e",
   "message": "Congratulations on your sobriety! Here's to brighter days ahead! 🎉",
   "created_utc": 1691198164,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu9tia",
   "message": "Becoming a teacher. The stress and abuse exacerbated my mental illnesses.",
   "created_utc": 1691198329,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juu9x4r",
   "message": "Childhood trauma",
   "created_utc": 1691198378,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juua0ll",
   "message": "My ex brother in law. Found out he was a cheater for many years (still is) and my poor sister who wouldn’t hurt a fly is having to rebuild her life. Had to sell my childhood home (that’s another story and that is connected to the divorce), my dog of 13 years died, I had to break it off with a guy I really liked, and two people I was close to died in the span of 2 months. It’s been rough but I’m just trying to push through and finish school. Covid sucked but this past year has been so rough for me.",
   "created_utc": 1691198423,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juuabv8",
   "message": "Being a \"gifted\" child.",
   "created_utc": 1691198573,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juuahzg",
   "message": "Child abuse. I missed out on experiences like reciprocating a crush. I had low self esteem and finally when the boy I crushed on in 5th grade ended up in my class in 6th grade—I internally freaked out. he told me he had a crush on me by mid year my response was crazy—I told him him “why?! What are you thinking?!!!!”.  idk why I reacted that way. \n\nCrazy thing is I wished he’d have a crush one me too. Lol.  He did and then idk why I blew up on him when he told me. After that I was awful to him. He tried many times to be sweet and kind—I was violent with words and I have, a couple of times been physical. I’m cringing right now remembering it.\nI had to kill any fantasy about anyone having a crush on me. I didn’t think I was pretty never the less for my crush to have a crush on me!! \nIt was too good to be true. I knew whatever good thing it could have been, would just be destroyed by my abuser if she found out. She probably would’ve found a way to humiliate me in front of him. \nI unknowingly carried that loss of experience with him for 20 years. It wasn’t until the lockdown when everything was quiet and had time to clear my mind that he popped up in my dreams. I was flooded with emotions.  I knew it would have been an unfinished business that I would’ve regretted not fixing.",
   "created_utc": 1691198655,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juuaojm",
   "message": "Death",
   "created_utc": 1691198745,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juuaq57",
   "message": "Being born in a universe that revolves around paperwork and money with no cool superpowers like in a fictional video game, movie, or tv show. I mean why the heck am I in this reality?! \n\nIf it's something I actually did have control over:\n\nThen it would be going on the internet when I was 13-15 years old. That ruined a good portion of my life.",
   "created_utc": 1691198767,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juub429",
   "message": "Alcoholism",
   "created_utc": 1691198956,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juubgjk",
   "message": "The GOP 😔",
   "created_utc": 1691199125,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juubgp6",
   "message": "It's me! Hi! I'm the problem, it's me!",
   "created_utc": 1691199127,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juubkkx",
   "message": "Man. Mine's lame compared to these comments. I dropped out of college to get married and start working. I have regretted that decision for 20 years. In 1998 I was taking electronic media classes. We were focusing on digital media creation, analog to digital conversion, and digital radio. I even appeared on the college radio station for a while.",
   "created_utc": 1691199179,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juubm6x",
   "message": "Congratulations on one year sober! Keep living your best life! 😄🎉",
   "created_utc": 1691199200,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juubr2h",
   "message": "A bad break up, I really let my life fall apart because of it. I flunked out of college and was super depressed for like five years. I turned it around, met my wife, went back to college and graduated, got a great job, and then had a kid.",
   "created_utc": 1691199264,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juubu9x",
   "message": "Becoming an adult.",
   "created_utc": 1691199307,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juubzy1",
   "message": "Technically… Existing",
   "created_utc": 1691199381,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juuc1pf",
   "message": "Alcohol. It has robbed me of my sanity, my health, and my friendships.",
   "created_utc": 1691199405,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juuchcc",
   "message": "My cheating ex. Fucked up my mind for almost a year. I was really attached to her and after finding out, it messed me up.",
   "created_utc": 1691199612,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juuchwn",
   "message": "girl",
   "created_utc": 1691199619,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juucioo",
   "message": "Pneumonia. Never been the same since I was in the hospital for 30 days.",
   "created_utc": 1691199629,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juucn58",
   "message": "Manic episode.",
   "created_utc": 1691199688,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juucnfn",
   "message": "Amphetamine-based eye drops.  Allergic reaction led to seizures, brain messed up for life.",
   "created_utc": 1691199692,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juucsh0",
   "message": "Capitalism.",
   "created_utc": 1691199758,
   "score": 1,
   "submission_id": "15icbhv"
  },
  {
   "comment_id": "juufg9s",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15icbhv"
  }
 ]
}