{
 "submission_id": "15iiu9x",
 "title": "What is the worst version of you to have existed?",
 "selftext": "",
 "created_utc": 1691200687,
 "permalink": "/r/AskReddit/comments/15iiu9x/what_is_the_worst_version_of_you_to_have_existed/",
 "score": 21,
 "url": "https://www.reddit.com/r/AskReddit/comments/15iiu9x/what_is_the_worst_version_of_you_to_have_existed/",
 "comments": [
  {
   "comment_id": "juugcar",
   "message": "At the height of my drinking. Drunk almost every night. Did a lot of bad things those years.",
   "created_utc": 1691201465,
   "score": 35,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuex00",
   "message": "The one where I had success early in life and never had the shitty views I had formed as a teenager questioned.",
   "created_utc": 1691200777,
   "score": 39,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuiccz",
   "message": "My middle school (specifically 8th grade) version",
   "created_utc": 1691202440,
   "score": 94,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuknsy",
   "message": "The me I'm living now",
   "created_utc": 1691203584,
   "score": 0,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuexpr",
   "message": "2020-2021 version.\n\nThe only version of my self I’d beat the crap out of.",
   "created_utc": 1691200787,
   "score": 30,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juufo7x",
   "message": "When I was late 17/early 18, so a little over two years ago. \n\nI was an insecure loser who desperately wanted attention, so I’d try and intentionally say the most outrageous stuff or talk a big game to people because I thought everyone thinking I was cool would make me happy. \n\nAll it did is make me cringe internally whenever I remember it now. There’s a lot of stuff I said online back then that I’m really not proud of. Really cringey and gross stuff I only said because I just wanted strangers to give me validation. \n\nI know two years isn’t *that* long ago, but it really is like night and day comparing the person I was back then and the person I am now. I’m glad I was able to realize that it was wrong - and that I was able make a complete change for the better - but I’m still somewhat disgusted I ever got to that point. \n\nI’d punch old me in the face.",
   "created_utc": 1691201143,
   "score": 168,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juufbkn",
   "message": "The mirror universe one from that Star Trek episode where everyone has a goatee.",
   "created_utc": 1691200973,
   "score": 70,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juunykx",
   "message": "The current one, unfortunately",
   "created_utc": 1691205291,
   "score": 36,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juug2io",
   "message": "The one on Pristiq. It calmed my anxiety but made me emotionless and just didn’t care about anything. I accepted working under a horrible narcissistic boss and gained closed to 10kg due to laziness. Husband asked me one day to please focus on myself because I just wasn’t the same person. I quit the drug cold turkey (would never recommend,  the worst side effects including wanting to walk in to traffic several times), went back to a previous employer, began eating better and working on myself. Got awesome again just in time for the pandemic, but somehow my mental health stayed well and conceived my first baby during all of the chaos.",
   "created_utc": 1691201334,
   "score": 24,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juugjab",
   "message": "starting sobriety",
   "created_utc": 1691201560,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuex4v",
   "message": "1.5 years ago",
   "created_utc": 1691200779,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juukxrn",
   "message": "Realtor version... and I'm a recovering addict. Realtor me had 4,500 Facebook friends... because \"networking\". Bruh, I don't even know 4,500 people. WTF was I even doing? At least tweaker me wasn't pretending to be friends with and Albanian scammer",
   "created_utc": 1691203724,
   "score": 35,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juul7uu",
   "message": "Heavy drinking to the point of loosing a good job, alienated my family, and lost the love of a very special woman.",
   "created_utc": 1691203864,
   "score": 20,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juulwra",
   "message": "The addicted one",
   "created_utc": 1691204214,
   "score": 4,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juumjw3",
   "message": "High school me. I was insecure and snarky and negative and *mean.* And I didn't have to be.",
   "created_utc": 1691204545,
   "score": 21,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juumu4t",
   "message": "I used to Gaslight...... I'm ashamed in myself. I had a much needed wake up call a few years back.",
   "created_utc": 1691204691,
   "score": 9,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juun5t5",
   "message": "Elementary school me for sure",
   "created_utc": 1691204860,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuof4q",
   "message": "24-25 year old me. Drinking all the time while on heavy medication and acting like a complete trashy human being for like an entire year.",
   "created_utc": 1691205540,
   "score": 9,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juup2a4",
   "message": "Drunk",
   "created_utc": 1691205878,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juup381",
   "message": "2014 to 2017 me. Alcoholic. Armed. Violent. Punishing everyone around me for existing in the same world as me, punishing myself for existing in the first place.",
   "created_utc": 1691205893,
   "score": 5,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juupcoy",
   "message": "Height of my mental health crisis \n\nI was really toxic and just a annoying person to be round,I feel bad for the people around be who were either victims of my toxic ness or just generally had to deal with me",
   "created_utc": 1691206035,
   "score": 12,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juupwdf",
   "message": "17 year old me to 24 year old me. Was never in a gang, and usually targeted criminals, but I was very aggressive in my ways of earning money. Made a lot of enemies that resulted in getting shot at 24. Life has been a lot less stressful since",
   "created_utc": 1691206332,
   "score": 3,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurkxo",
   "message": "Self-defeating, head perpetually up my own ass, chronically unproductive and lacking any real motivation to improve, and too immature to be the man my SO at the time deserved.\n\nGrew out of it eventually. Now I’m just vanilla-flavored stupid.",
   "created_utc": 1691207261,
   "score": 5,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurl19",
   "message": "The last 6 months... Me and my ex saw the worst of each other...we were stuck in our addiction. We did things we would never do",
   "created_utc": 1691207263,
   "score": 4,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuu0f3",
   "message": "The height of my pill addiction. While house sitting, I knew the owner had medical issues, which meant they would have pills. Being the addict I was, I round them fairly quickly. I'm sure I should have died that weekend. Ativans 5 MG, and I think I popped 5. I don't remember much of anything for those 4 days. It's very scary, very embarrassing. After I sobered up, I owned it and apologized. We're still friends. I'm sober 6 yrs+ now",
   "created_utc": 1691208634,
   "score": 6,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvb0r",
   "message": "Me at the end of my relationship with a long term ex…would have been…2008ish? \n\nAfter five years together he announced to me in November that he was switching schools to one 5 hours away in January. But it was fine, I was done school that May so I’d move out there to be with him at the point. For the next five months I could feel him pulling away. Even before he moved. I could feel it and asked him what was wrong, he swore everything was fine. I point blank asked him if he wanted to break up, he assured me he didn’t. He moved and became impossible to track down. Would never answer his phone, wouldn’t text me back, wouldn’t email me back. I’d go days without hearing from him and when I finally did he’d act like I was the crazy one and he was just busy and everything was great. I felt like I was going crazy.\n\nI spent from November to March just feeling truly pathetic. I was constantly on my laptop trying to get a hold of him. My grades slid, I ignored friends and family. I was miserable and trying to figure out what was going on. I felt like I was losing my mind and was constantly crying and then I’d be so happy when I did reach him. I realize now what he did and I know none of how I behaved was my fault but shit, I’m ashamed of it all.",
   "created_utc": 1691209380,
   "score": 12,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuta71",
   "message": "Glass House. White Ferrari. Live for New Year's Eve. Sloppy steaks at Truffoni's. Big rare cut of meat with water dumped all over it, water splashing around the table, makes the night SO MUCH more fun. After the club go to Truffoni's for sloppy steaks. They'd say; 'no sloppy steaks' but they can't stop you from ordering a steak and a glass of water, before you knew it we were dumping that water on those steaks! The waiters were coming to try and snatch em up, we had to eat as fast as we could!",
   "created_utc": 1691208221,
   "score": 11,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juufsb4",
   "message": "Addict",
   "created_utc": 1691201197,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juug4es",
   "message": "Assuming Hugh Everett's Many Worlds theory of quantum mechanical wave function collapse is actually  true, (remember, that's not science.  No one as of yet has created an \"Everett-Wheeler phone\") probably the version where I hurt the most people (particularly women and children).",
   "created_utc": 1691201360,
   "score": 253,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juutn3u",
   "message": "My stupid first grade self who threw something across the room one day",
   "created_utc": 1691208424,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuu9ud",
   "message": "Gangbanger Me",
   "created_utc": 1691208784,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuf6bc",
   "message": "I would say my sophomore self was the worst version of me. I dated a senior, and that relationship ended up backfiring. Ended up losing any chance of playing sports that year because we were caught in my bedroom. Ended up falling for my best friend, and that didn't work because she didn't like me (we still were friends after). I'd say I had 2, maybe three friends that year. Although, the next year would have plenty of surprises. Everything happens for a reason, right?",
   "created_utc": 1691200902,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juufihw",
   "message": "I stayed drunk in my adolescence. A version of me I never want to be again.",
   "created_utc": 1691201066,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juui6i7",
   "message": "When I went through my “bougie” phase when I was like 19-20. I tried dressing like those fashion nova models and would buy a lot of fake diamond jewelry. I’d even walk and hold my purse like a bougie person. I later realized I was investing too much time on figuring out how to make “bougie” my style, when style is something that should come to you naturally. Bougie is NOT me at all. I’m 28 now and I wear T-shirt’s and jeans with converse and call it a day. Comfort and free-spirited has always been my true style. Now I understand what “finding your identity” means.",
   "created_utc": 1691202362,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juukkhg",
   "message": "The one where I lose control of my temper, just let go of the reins.",
   "created_utc": 1691203537,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juulg1r",
   "message": "Middle school and Freshman me.\n\nSo much politics. So much mental instability. So much League.",
   "created_utc": 1691203974,
   "score": 5,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juulu3k",
   "message": "The person who was overly obsessed with celebrities, yeah I would smack her.",
   "created_utc": 1691204176,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juun62n",
   "message": "Hmmmm",
   "created_utc": 1691204864,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuo46r",
   "message": "2011 I was going to give up on college and really wanted to fail. I guess I got a second chance once I realize my school was gonna keep giving me financial aid.",
   "created_utc": 1691205375,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuobet",
   "message": "8 years ago. I had no music taste, hobbies or any other interests besides just studying. I was quite linear with how I viewed life in general.",
   "created_utc": 1691205484,
   "score": 4,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juupo8h",
   "message": "18-21 year old me. Low morals, no ambition, committing felonies, awful partner, awful sibling, awful kid, college dropout, drug user, and a liberal.",
   "created_utc": 1691206209,
   "score": 3,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuq2ib",
   "message": "Probably me the last 6 months, I’m finally starting to crawl back from what I can only assume was a midlife crisis (35)",
   "created_utc": 1691206425,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuq8ua",
   "message": "When I was taking psychiatric medicine for a misdiagnosis (learned of the actual diagnosis many years later). The wrong medication made me extremely angry, always hungry, sleeping way too much or not sleeping at all. I was a zombie and stupid. Self harmed nearly every day. The medication made me worse. Couldn't work, couldn't remember anything, and had zero motivation. Lost relationships and my entire 20s.\n\nThe entire time, they weren't treating the correct issues. I was really angry about it for a couple years.",
   "created_utc": 1691206521,
   "score": 8,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuqa8e",
   "message": "My super Mormon self. I was a miserable stay at home mom who got married at 19 and I had no personality because all of it was just mormonism. I had no identity outside of that. Looking back now, it felt like I was a robot. Now I am 29 and goth mom with tattoos. Never felt more like myself in my life.",
   "created_utc": 1691206541,
   "score": 93,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuqcrq",
   "message": "Just before I met my now-wife. Late 20s, alone, no friends to speak of. Drank, smoked, ate crap. Imagine The Dude (Lebowski) but without the bowling skills. She rescued me.",
   "created_utc": 1691206581,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuqs1z",
   "message": "24 and 14 were rough.",
   "created_utc": 1691206814,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juur4iq",
   "message": "13 year old me was a tremendous pita. I feel bad for my parents now.",
   "created_utc": 1691207006,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juur4s3",
   "message": "The version of me from 2012. It wasn't my finest hour for how naïve and desperate I was. It's so embarrassing for me to look back at that year. It wasn't until 2013 I snapped out of it.",
   "created_utc": 1691207010,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurc4z",
   "message": "Simp version",
   "created_utc": 1691207123,
   "score": 255,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurdg8",
   "message": "2018-2019 version of me",
   "created_utc": 1691207143,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurlx3",
   "message": "so far probably 7th grade me. wore the same sweatpants every day without washes, up to weeks between showers, never brushed my teeth and still in contact with extremely bad people. on top of all this my grades were the worst they'd ever been",
   "created_utc": 1691207276,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurm6m",
   "message": "2008",
   "created_utc": 1691207280,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurwsf",
   "message": "Easy that’s me!",
   "created_utc": 1691207444,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juusct6",
   "message": "Taking antidepressants and drinking heavily. Still don’t know if it was six days or four weeks, but I know I was an absolute horrible human being to people while it happened.",
   "created_utc": 1691207692,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juusews",
   "message": "Being suicidal out of spitefulness. Glad I made it and my mind got straightened out",
   "created_utc": 1691207726,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juusgax",
   "message": "This time last year.   Thanks for the reminder",
   "created_utc": 1691207747,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juusj33",
   "message": "Early 2012 me.",
   "created_utc": 1691207791,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juusrff",
   "message": "The me that put up with abuse for ten years",
   "created_utc": 1691207923,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juusu96",
   "message": "The drunk version. 2 year bender, not cool",
   "created_utc": 1691207967,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juut3rl",
   "message": "17 and 23, not sure what it is but others have said 23 is also a shit year for them",
   "created_utc": 1691208117,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juutn5u",
   "message": "Now",
   "created_utc": 1691208425,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juutsui",
   "message": "There is a film portrayal of the bad version of me.  Dr. Evil in Austin Powers.",
   "created_utc": 1691208514,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juutz21",
   "message": "13 year old me and me now",
   "created_utc": 1691208612,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuu5s4",
   "message": "From the time I was about 17 or 18 up until I got sober at 24.",
   "created_utc": 1691208720,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuu8z9",
   "message": "I was prescribed on antidepressants and benzos after being diagnosed with ptsd and chronic depression from a traumatic experience. I continually took them for several years in combination with psychotherapy. I really didn’t need them for as long as I was prescribed on them, and my depressive episodes were far and few between and were primarily seasonal or triggered by life hardships or other ptsd triggers. Because of this I would occasionally fall into hypomanic states. I was not a good person during these times, and acted out recklessly and selfishly. Hurt a lot of people and made really poor decisions. Became very attention seeking, and validation craving. Have been off all the meds since 2018 and will never go back.",
   "created_utc": 1691208771,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuukm5",
   "message": "High school to early college me. I was horribly socially awkward, easily led around by one or two people I was in love with rather than having my own personality (and tangentially hurt some people emotionally when I didn't think for myself and handle some things better), and I failed horribly at empathizing with other people. On top of that, I was so paralyzed with worry that I would upset someone that I just didn't say much and let other people do all the heavy lifting socially.\n\nI'm happy to say that me no longer exists except in my memories. But getting past that was a lot of work for me, and the friends who stuck by me.",
   "created_utc": 1691208957,
   "score": 11,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuuw27",
   "message": "Freshman-junior year of high-school was my villain Era. I'm so glad my friend group had the brains to leave me in the dust when I dropped out- if I still had them I probably wouldn't have gotten some decent character development",
   "created_utc": 1691209141,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuv2y8",
   "message": "When I got fat in the the early 2010s. Partly due to depression mixed with just being lazy. Don’t get fat if you can help it. I’m in a much better space now and have a far better outlook on my life.",
   "created_utc": 1691209250,
   "score": 4,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuv98a",
   "message": " Depends who you ask.",
   "created_utc": 1691209352,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvc57",
   "message": "Present me I guess",
   "created_utc": 1691209398,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvgkm",
   "message": "Coked up gang banger my now wife got me and my brother out of the streets moved across the country we started our own company got our geds and my brother went on to get a college degree it’s insane how lucky we got",
   "created_utc": 1691209473,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvm94",
   "message": "High school. So about 25 years ago. I didn't have my ADHD in check and I could get absolutely surgical with a teardown of a person.  No one fucked with me, but it's not exactly the best skill to have when you are trying to make friends.",
   "created_utc": 1691209567,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvqam",
   "message": "The raging alcoholic me, who chose a bottle over health.\nSober now 👍",
   "created_utc": 1691209634,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvspj",
   "message": "13-14 year old me.  I was terrible.  I ran with a really bad crowd. I did a lot of fighting.  I snuck out at night.  Even participated in the theft and joyride of an SUV.\n\nI’m certain if SnapChat or Instagram existed at the time I would have done something to ruin my life.\n\nAnyway, my dad went to prison my freshman year, and it was a giant wake-up call.\n\nEnded up trying to turn shit around.  Migrated to a different group of friends.  Started thinking about making the most of high school.\n\nI suppose I turned out okay.",
   "created_utc": 1691209675,
   "score": 23,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvt4x",
   "message": "14-16 aged me, God I was insufferable back then. Fortunately the only real lasting thing connecting me to that version is this username",
   "created_utc": 1691209682,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvu5h",
   "message": "19 when I got my first corporate white collar job.  My parents never taught me office politics and my dad actively shit on everyone, so I had a pretty terrible attitude at work.  I was smart and worked hard, but if I had even a shred of the social skills I should have had, I'd be doing much better right now.  I'm not doing terrible by any means, but I should have worked up to VP or something by now.",
   "created_utc": 1691209698,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvw8m",
   "message": "All of them.",
   "created_utc": 1691209733,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuw27j",
   "message": "Post heart attack from drinking, hole in throat, stomach tube hooked up to Propofol....it was right after Jan 6 and CNN was on but I was doped up and intubated so I couldn't changed the channel. worst me ever",
   "created_utc": 1691209832,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuw30b",
   "message": "Couple years ago i got really depressed, forgot how to act and managed to fuck up every friendship i had without realizing it. Im all good now tho, moved away and started over",
   "created_utc": 1691209846,
   "score": 3,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuw3qy",
   "message": "2020-2022, I was depressed, anxious, addicted to nicotine, and surrounded by shitty friends. had to make choices I regretted in order to keep the only friends I had",
   "created_utc": 1691209857,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuw4hd",
   "message": "The version that didn’t heal, or even know they suffered a lot of child abuse.",
   "created_utc": 1691209870,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuw4p0",
   "message": "Worst of my eating disorder. I was a bitch, killing myself slowly and making it everyone else’s problem.",
   "created_utc": 1691209873,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuw96e",
   "message": "I don't know, but I'm pretty sure I'd tell 17 year old me to stick to my home city for college and to go to therapy religiously, to avoid becoming that worst version in my 20s.",
   "created_utc": 1691209948,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwaid",
   "message": "Me rn",
   "created_utc": 1691209969,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwasa",
   "message": "20 to 30 year old me, a drugged out emotional cripple with no morals, coping skills or limit to my appetites or ability to create chaos and pain in my wake. Grade A asshole and menace.",
   "created_utc": 1691209973,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwbnn",
   "message": "Late teen/early 20's me.",
   "created_utc": 1691209988,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwexr",
   "message": "Lol I had some existential crisis about some alternative reality version of me that was Hitler 2",
   "created_utc": 1691210043,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwfgn",
   "message": "Dissociation during my divorce at age 20. Like watching myself tear apart my life from a third-person perspective.",
   "created_utc": 1691210051,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwg70",
   "message": "Probably February 2021-May 2023",
   "created_utc": 1691210063,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv1e5u",
   "message": "When I was growing up I was popular in school, I was the kind of person that was friends with everybody. At 17 I tried cocaine because a girl I liked had some and I got addicted. It changed me… I started getting arrested and doing dumb shit and it caused me to lose all of my friends. 5 years later I got clean and tried to rekindle some of my lost friendships and no body wanted anything to do with me. I tried several times over the years and failed, this caused me to develop serious social anxiety. I tried getting through that and started trying to make new friends and failed. People from work would always get together for drinks and shit but despite the fact they those people no nothing of my past I’m never invited. I have been trying online dating hoping to meet somebody since 2015 with no luck. Every conversation I have are ones I start because if I didn’t start them I would never be able to speak with anybody other than the pizza guy. Im 38 now and I have had 0 social interactions since my early 20s. Im telling you all of this because in my opinion the current version of me is not the worst version but I think the facts that nobody will give me a chance and that nobody has any interest in being a part of my life shows that every body else thinks my current version is the worst.",
   "created_utc": 1691213190,
   "score": 7,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuxs8u",
   "message": "Probably hate the 16yo me the most. Wasn't coping well and i kept expressing it in the dumbest ways which makes me feel bad",
   "created_utc": 1691210867,
   "score": 3,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuz2pw",
   "message": "Every time I look back at myself a few years ago, no matter how old I get, I cringe. I guess is a good thing because it means I’m constantly growing.\n\nBut by far my worst was 10 years ago in my mid 20’s. I was in a new place with no support system, severe depression and being gaslit at every turn by a manipulative person I thought I was close to. Looking back I can’t correlate my actions with who I am as a person. It’s like I have the memories of a completely different person who looked identical to me.",
   "created_utc": 1691211665,
   "score": 5,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuzj71",
   "message": "The jealous one who always felt he deserved more. \n\nTook longer than it should have to realize I need to earn it.",
   "created_utc": 1691211962,
   "score": 12,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv1mrv",
   "message": "The one in which I achieved success early in life and never had the skewed opinions I had developed as a youth called into question.",
   "created_utc": 1691213352,
   "score": 3,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv1s6s",
   "message": "When I was a mean kid. I know it was a trauma response but it hurts my heart to know that I wasn’t a good friend or family member to the people I love.",
   "created_utc": 1691213453,
   "score": 10,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuzprt",
   "message": "I was a Colonel of little renown in the 1870s. Having graduated from West Point I let ideas of grandeur cloud my mind as I led my insufficient force against 2500 Comanche warriors. All but one of my men died that day, myself included. Reincarnation’s a bitch.",
   "created_utc": 1691212076,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwjd2",
   "message": "You know what's funny, this is hard to answer. I think it's just something wrong with me but I always feel like the current me is the worst. I feel like previous versions of me had an easy time compared to whatever my situation is now. In a way just not letting myself validate how difficult any situation was for me.",
   "created_utc": 1691210114,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwjvr",
   "message": "Elementary school me thought it was cool to just not shower for weeks and have smelly armpits💀\n\nPromise I'm not like that now. I do like 12 swipes per arm and shower every, if not, every other day.",
   "created_utc": 1691210122,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwq63",
   "message": "About 8 years ago when i had a string of traumatic events happen and then had a complete mental breakdown. Worst part is I feel like it’s happening again. Had a string of traumatic events happen this year and feel like I’m completely falling apart.",
   "created_utc": 1691210225,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwqs8",
   "message": "The one I was 2 weeks ago.",
   "created_utc": 1691210235,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwryf",
   "message": "Me currently.  It's like I can see my attitude and depression second hand but I can stop myself lashing out.  I've turned into someone I don't like.",
   "created_utc": 1691210255,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwvcm",
   "message": "Late teens. 19 or so. I was so awkward and had no idea who I was. But at the same time an incredibly horned up dummy very lustful for anyone that would have glanced at me. It made for some horrible attempts at asking people out or showing interest in them, that on occasion worms into my brain still  haunting me  reliving the most embarrassing moments of my life while I am trying to sleep.",
   "created_utc": 1691210312,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwybn",
   "message": "High school, junior to senior year, was me at my worst. I treated my “best friend” like shit because I didn’t know how to deal with my loneliness snd my feelings towards him. It culminated in him ending our friendship, which was totally justified, and ghosting me. It’s been nearly a year since then and I’ve been working to let myself never, ever let my emotions get that out of control again.",
   "created_utc": 1691210361,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juux1di",
   "message": "When I'm angry. I can get furious, enraged, hostile, resentful very easily.  I'm very good at repressing it so it's a version of me that is usually not externalized but it's a pretty ugly version of me that I'm the only witness to.",
   "created_utc": 1691210413,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juux4ew",
   "message": "Elementary to middle school years. I will not explain but man I was horrible",
   "created_utc": 1691210464,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juux523",
   "message": "JunkieDan\nNot so much fun Dan\nOwed ya money, \"borrowed\" your shit Dan.\nDid nothing but look like Death itself walking Dan\nAshamed Dan\nWasted away Dan\nLost, hopeless, alone Dan.\nJunkie Dan\nNever ever come back, man",
   "created_utc": 1691210475,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juux63x",
   "message": "The simp that only wanted love and validation from someone who friendzoned them. took so much out of me.",
   "created_utc": 1691210492,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juux6mm",
   "message": "The one where I slept with my best friends boyfriend in HS. Lost all my friends in the process understandably. I’m 32 now, and almost everyday question why I even deserve happiness and a good life.",
   "created_utc": 1691210500,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuxbzk",
   "message": "According to my partner: right now:-(",
   "created_utc": 1691210589,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuxeo8",
   "message": "Young...drugs... Really doesn't need an explanation. I was a disgusting human...",
   "created_utc": 1691210634,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuxoy3",
   "message": "Neighbors cat kept coming into my yard and dumping. So I captured it and set it loose in a field a mile away. Neighbor comes and asks me if I've seen her cat, accuses me of doing something. I told her she needs to be more careful about letting her cat out, and I closed the door. \nStill feel shitty about it years later.dont know why I did it. Don't like there's that version of myself I carry around.",
   "created_utc": 1691210810,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuxtdq",
   "message": "Selling coke, selling papers. During finals I had gotten my tonsils out and could t snort. Was just openly eating the shit out of a bag during finals.",
   "created_utc": 1691210886,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuxwd4",
   "message": "Lowkey think now because every now and then I smoke weed or hit dispos with step-brother’s and I probably shouldn’t do that since I have heart problems but I still do it for fun",
   "created_utc": 1691210937,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuxzry",
   "message": "At the height of a speed addiction, turned me into a horrible person",
   "created_utc": 1691210995,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuy00k",
   "message": "About 3 years from now...",
   "created_utc": 1691210999,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuy1os",
   "message": "When I was in middle school was able to persuade a bunch of of my classmates that I was a vampire and that the black raspberry ice drinks looked exactly like blood so I would say it was my blood for the day and that was the reason why I only wore black clothing",
   "created_utc": 1691211027,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuy4ts",
   "message": "The version of me that was on a high dose of Adderall.",
   "created_utc": 1691211081,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuy5kh",
   "message": "Me right after my first breakup and for a few months after. It was 3 days before my birthday. Not a good time.",
   "created_utc": 1691211094,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuy7s2",
   "message": "this year",
   "created_utc": 1691211132,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuynaw",
   "message": "The one that exists right now. I don’t like how irritable I am lately or how I just cannot find happiness in anything.",
   "created_utc": 1691211400,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuyqlo",
   "message": "Shortly after my CPTSD/codependency triggered the first time as an adult. Took a couple of months but I was just as self destructive as a drunk or drug addict, just high functioning.",
   "created_utc": 1691211458,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuyuoa",
   "message": "NOW",
   "created_utc": 1691211529,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuyvpw",
   "message": "14-17 year old me.",
   "created_utc": 1691211546,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuyx8n",
   "message": "When I left my abusive home. A lot of people seem to think it gets easier after. But trauma doesn't stay where it happened. It follows you.\n\nI had a couple bad habits, I won't name them since idk if it's allowed here, but let's just say they were very unhealthy and it worried my loved ones dearly. They watched me destroy myself for a while. I felt bad but I couldn't stop. \n\nWeed helped a lot, but sadly after a bad experience with a different substance, any drug makes me panic. So now I'm just going with the flow.\n\nMy habits are gone now. I'm doing better I like to think.",
   "created_utc": 1691211573,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuyy4l",
   "message": "Failing marriage, failing business, dying family and in-laws. Severely depressed, not a good person or friend. Two or three hard years in the 2000s.",
   "created_utc": 1691211588,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuz13b",
   "message": "Close race between me in the fall of my freshman year of high school and the fall after I graduated college. \n\nFormer was a borderline \"nice guy\" who was chasing a girl that clearly just needed me as a friend and acted like a douchebag to a lot of people.\n\nLatter was a depressed alcoholic who was lucky he didn't make even poorer decisions than the ones that he did make.",
   "created_utc": 1691211637,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuz15g",
   "message": "Christian me. What a joke. IMO.",
   "created_utc": 1691211638,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuzbd2",
   "message": "Alcoholic me",
   "created_utc": 1691211820,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuzbl9",
   "message": "14th was bad, 19th was worse.   Current version is an improvement",
   "created_utc": 1691211824,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuzdld",
   "message": "2020-21 Quarantine me. :|\n\nIt doesn't help I was just turning into a teenager.",
   "created_utc": 1691211859,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuzp8f",
   "message": "The jealous, insecure girlfriend. This was about 8-10 years ago. I’d be watching everything he’d do. Go to his workplace to ‘assess’ his co-workers. I’d check his phone, with and without consent. I specifically didn’t allow any photo with only him and another girl (like even when they were at work, or any gathering). \n\nBut then I got to the point where I realized that even if I place camera on his forehead, if he wanted to cheat, he’d cheat. And all of those efforts are wasted energy. \n\nAnd I just prayed that if he’s not the one, for God to just steer him away from my direction. \n\nLo and behold, got married to the same guy 😂",
   "created_utc": 1691212067,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuzpo3",
   "message": "My teenage years where I took everything and everyone for granted. I learned the error of my ways, apologized, and try to atone for my stupidity since then.",
   "created_utc": 1691212075,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuztxz",
   "message": "me in 2020. far-right asshole back then",
   "created_utc": 1691212152,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuzvnj",
   "message": "There’s a multiverse version of me that made Thanos eat his own ass",
   "created_utc": 1691212183,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuzwhc",
   "message": "The one I'm in now.",
   "created_utc": 1691212198,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuzyqw",
   "message": "staying with my ex abuser for about a year. i was super brainwashed into thinking he’d be the only person to ever love me like he did. boy oh boy…now i’m at my happiest (=",
   "created_utc": 1691212240,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv00gy",
   "message": "The night before Election Day, 2016. Strung out on heroin and painkillers and 600 miles from home for a new job prospect. Got busted trying to smuggle clean piss in for my drug test, and they put me out on the street (rightfully so). No money for food, no money for a bus ticket, dopesick as ever. The absolute lowest moment of my entire life. If I ever thought about taking the easy way out, it was during that night.",
   "created_utc": 1691212271,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv03do",
   "message": "Probably the current one.",
   "created_utc": 1691212324,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv04nx",
   "message": "The one that I have to ignore every instinct to fight the bastard that stole from me, abused me, destroyed my property and pretend everything is fine to protect my daughter.  FUCK, next week everyone should by Valium stock cuz I’m gonna use lots of it.",
   "created_utc": 1691212348,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv04ul",
   "message": "College me. Or... me from 2009 - 2012? I was so self-centered, thought I was always right, wanted to be spoiled rotten by friends. If I was close friends with someone, I didn't want them to talk to anyone but me. It was bad. I wouldn't have wanted to be my friend with that attitude, lol. I had graduated high school a year earlier and it was very clear that I had a lot of growing up to do. I like to think I'm better now, especially since I've learned so much since then on how to be a better person. 🙂",
   "created_utc": 1691212351,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv07sn",
   "message": "This current one.\n\nI kinda don't give a shit about a lot of things, but I do kinda give a shit about a lot of things. I don't want to do anything, but I don't want to just be in my apartment. Cleaning up this dump could help, but I'd rather rub one out and take another nap on a Saturday. I've pissed some people off that are definitely gunning for me, so that's gonna suck real soon. I'd rather be dead than have to wake up to my fucking alarm Monday morning. Nothing's making sense anymore and I'm just ready to leave. Dig?",
   "created_utc": 1691212406,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv0d5a",
   "message": "You're lookin' at him BUB",
   "created_utc": 1691212504,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv0dp8",
   "message": "Religious me. When I was religious I was a complete and total piece of shit. My religious upbringing taught me that I was better than any brown person because having anything but white skin was the mark of Cane. I was a racist sack of shit and justified that racism with my faith. Total shit bag. I became a far better person when I figured out religion is a money making scheme.",
   "created_utc": 1691212514,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv0e6g",
   "message": "From about 2004-2018 there were moments when I was just horrible, on the verge of a mental breakdown and such a horrible person to be around. Quick to anger, would lash out at anyone (except my family) that I felt was trying to do me dirty. I was unrecognizable. I had a ton of misfortunes going on and they just got the best of me.",
   "created_utc": 1691212523,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv0gi3",
   "message": "On meth and in a toxic relationship",
   "created_utc": 1691212566,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv0ivd",
   "message": "Drunk me….",
   "created_utc": 1691212610,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv0k7p",
   "message": "Hard question to answer, probably me right now or me from a few years ago",
   "created_utc": 1691212635,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv0nkz",
   "message": "I was Karen.  Not mean outright but def not kind either. Haughty.  Life took me down haha.  Now i hope people have a better day for having met me.",
   "created_utc": 1691212697,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv0qoe",
   "message": "If any one of my other selves have given into the Intrusive Thoughts… I feel sorry for anyone who knows them.",
   "created_utc": 1691212754,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv0qoz",
   "message": "In this universe.) While I was on medication for my mental disorder. One of the side effects was reduced impulse control. My natural impulse to anger is violence. I was naturally angry about the psychiatrist not listening to my concerns about this, before it was officially recognized that what I was saying was true.",
   "created_utc": 1691212755,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv0spv",
   "message": "Pretty Sure It's Rn",
   "created_utc": 1691212791,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv12po",
   "message": "27 years old coming off over 5 years of opioid addiction at 300-400mg per day. I literally did not leave my house/room for about 8 months. There are so many times i could pick but that one was the most agonizing for me and my family.",
   "created_utc": 1691212976,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv1750",
   "message": "around Nov 2019-Jan 2022. I had zero social skills and thought the best way to make friends was to say completely out of pocket statements. That just completely alienated me. I have made some great friends again, though, and have learned from that mistake.",
   "created_utc": 1691213058,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv18jy",
   "message": "I was smoking pot all the time while my dad was dying of leukemia.  One night he came down to the basement where I would smoke. Thought I was clever by spraying air freshener. He was frail and he said to me, \"I can't help you anymore.\"  Turned around and walked slowly back up the stairs.  I didn't say a word.  I felt like a piece of shit.",
   "created_utc": 1691213085,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv1a3e",
   "message": "me every minute of my life so far",
   "created_utc": 1691213114,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv1a7b",
   "message": "Not proud of the person I was in high school and early 20s. I’ve been through a lot of trauma (rape by my own dad, poverty, alcoholism) so I was often angry and not the best person to be around. I’ve worked on myself a lot, I keep pushing everyday",
   "created_utc": 1691213116,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv1dvb",
   "message": "Allowing myself to be in the most toxic relationship for 4 years. I was always depressed, always anxious, and lost so much weight cause I was so malnourished from always being stressed.",
   "created_utc": 1691213185,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv1jdu",
   "message": "My \"femboy\" phase probably.\n\nI was horny all the time and met with some stupid people and did stupid things.\n\nI'm glad i didn't catch anything back then :/",
   "created_utc": 1691213288,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv1jg9",
   "message": "Late 2014 - 2015, over worked, could barely control my anger and had terrible anxiety and panic attacks. I never want to go back to that. Weed and a better job helped a lot since then.",
   "created_utc": 1691213289,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv1lk8",
   "message": "my borderline disorder and bipolar 2 that developed from childhood abuse/trauma. I can't be in serious relationships--i go into a rabbit hole and relationships consume me. I have been single for 4 years (yes, I have not had sex since 4 years ago) and when I set up a meet from dating apps--I am very detached and then I just cancel it. LOL. I can't be in a relationship with another person. I guess I'll be single until I die. LOL!",
   "created_utc": 1691213329,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv1m39",
   "message": "15-18 personally weren’t my best moments",
   "created_utc": 1691213340,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv1s3n",
   "message": "15 year old me was quite the little shit. just thinking the world was supposed to revolve around me.\n\nAlso, it took a bit to step back into normal world after my third tour. Not looking for karma stuff there, and I didn't do any crazy shit, but it was hard to care about what \"normal\" people cared about, or react appropriately. For example, when someone was lamenting on how the local place was out of their special sandwich or whatever, and you have to not just start belting out stuff about \"who gives a fuck, if your not on fire, why tf are you are you complaining?\" Sounds way too harsh, and it totally is, but you get a bit warped under prolonged high stress, and it takes a bit to come back down.  \nother things just red line you, often for very poor reasons. thinking about it now, it likely took about 5 years to go back to \"normal-ish\" shit.",
   "created_utc": 1691213451,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv1u76",
   "message": "current me. im lonely, unmotivated, miserable, depressed, i dont bathe or brush my teeth, my diet is frightening, and my dog is gonna die.",
   "created_utc": 1691213493,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv6hvs",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juva9wp",
   "message": "The one that drank.",
   "created_utc": 1691219470,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juvaqsd",
   "message": "The raging alcoholic version. She gone now!",
   "created_utc": 1691219814,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juvaye2",
   "message": "When all the things I worked for turn out right. It made me arrogant, egoistic and greedy. That destroyed so much and I needed to start from scratch. \nHappened 2x in the past 12 years, my life is a weird cycle of self sabotage and success.",
   "created_utc": 1691219969,
   "score": 3,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juvcer5",
   "message": "The beyond exhausted version.\n\nTo be clear, it is a medical condition and not self-inflicted. But for the last 3 years I have had to survive off of 4-5 hours fractured sleep a night. It has led to a plethora of additional health issues. One of which is tinnitus and hypersensitivity to high-pitched sounds. Not great when you have a highly energetic 4 year old.\n\nKeeping it all together on a daily basis requires a lot more effort than others understand. Every now and then this exhaustion gets the worst of me 😞 I will erupt into a rage state, unable to process logic or reason. I have screamed at my partner and punched a door in fury. Although these moments are short and rare, they are mortifying. \n\nI then have to spend weeks atoning for actions I had no control over. Praying that it never happens again.",
   "created_utc": 1691221040,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juvcnft",
   "message": "Early 20s. Was involved with a biker organization called the hell riders. This was in the 1970s. We owned knives.",
   "created_utc": 1691221219,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juvcr2z",
   "message": "The me that tied my self worth to whether men found me sexually attractive. \n\nI've grown a lot since then and not only that but realised I was dealing with some pretty serious internalised homophobia (directed solely at myself) and came out as a lesbian. \n\nI'm hoping to meet a girl who doesn't mind I'm a bit special and also wants to dig up Henry VIII as much as I do.",
   "created_utc": 1691221299,
   "score": 4,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juve1xa",
   "message": "All of thrm",
   "created_utc": 1691222275,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juvepc8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juvevtk",
   "message": "Hmmmm",
   "created_utc": 1691222914,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juvgrze",
   "message": "The current one, unfortunately",
   "created_utc": 1691224415,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juvb11c",
   "message": "I have this werid day dream about the multiverse where there's literally a version of me called, the \"worst\" Id go universe to universe killing myself.",
   "created_utc": 1691220022,
   "score": 255,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv70fp",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juv3ffm",
   "message": "I flirted with another man while I was married, my husband (of 7 years) found out and was so sad. I told him I needed time to think and decide if I wanted to stay with him or not(he really didn’t treat me well at all before the whole flirting thing and I didn’t know what I was doing) he agreed. After about a week I told him I wanted to come home, he refused. I continued to beg but also continued flirting with this guy(who I actually had never even met in person he was just a stranger online). Eventually we decided to divorce. I stopped flirting with that guy and ended up talking to a bunch of other guys and sending very sexual photos and videos and such. I almost started an only fans. Then I got a boyfriend I found on tinder, I really didn’t like him but I was lonely so I stayed with him for a while. Eventually I got into therapy and my therapist said “the most hurtful way to break someone’s heart is to lead them on.” I broke up with him immediately and stayed single for a bit longer. I then started dating a coworker, I got pregnant and we got married. He’s my best friend and I’m so glad I’m not that person that I was before. I’ve spent hours and hours in therapy working on bettering myself.\n\nEvery time I look back I’m disgusted with myself and shocked that I was capable of treating others and myself so badly. But I’m also grateful to be where I am right now. My ex husband also had a kid after we divorced and as far as I know he is happier now too. We were so young when we got married and changed a lot over that period of time. We wanted very different things in life but we were forced to rely on each other starting at 18 so we didn’t know how to live apart. A divorce was going to happen eventually I just wish I would have been better about it instead of cheating and absolutely crushing is heart(despite all of the struggles we were going through.) he was a terrible husband but I will never forgive myself for hurting him like that.",
   "created_utc": 1691214584,
   "score": 2,
   "submission_id": "15iiu9x"
  }
 ]
}