{
 "submission_id": "15iiu9x",
 "title": "What is the worst version of you to have existed?",
 "selftext": "",
 "created_utc": 1691200687,
 "permalink": "/r/AskReddit/comments/15iiu9x/what_is_the_worst_version_of_you_to_have_existed/",
 "score": 33,
 "url": "https://www.reddit.com/r/AskReddit/comments/15iiu9x/what_is_the_worst_version_of_you_to_have_existed/",
 "comments": [
  {
   "comment_id": "juugcar",
   "message": "At the height of my drinking. Drunk almost every night. Did a lot of bad things those years.",
   "created_utc": 1691201465,
   "score": 38,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuex00",
   "message": "The one where I had success early in life and never had the shitty views I had formed as a teenager questioned.",
   "created_utc": 1691200777,
   "score": 16,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuiccz",
   "message": "My middle school (specifically 8th grade) version",
   "created_utc": 1691202440,
   "score": 17,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuknsy",
   "message": "The me I'm living now",
   "created_utc": 1691203584,
   "score": 14,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuexpr",
   "message": "2020-2021 version.\n\nThe only version of my self I’d beat the crap out of.",
   "created_utc": 1691200787,
   "score": 10,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juufo7x",
   "message": "When I was late 17/early 18, so a little over two years ago. \n\nI was an insecure loser who desperately wanted attention, so I’d try and intentionally say the most outrageous stuff or talk a big game to people because I thought everyone thinking I was cool would make me happy. \n\nAll it did is make me cringe internally whenever I remember it now. There’s a lot of stuff I said online back then that I’m really not proud of. Really cringey and gross stuff I only said because I just wanted strangers to give me validation. \n\nI know two years isn’t *that* long ago, but it really is like night and day comparing the person I was back then and the person I am now. I’m glad I was able to realize that it was wrong - and that I was able make a complete change for the better - but I’m still somewhat disgusted I ever got to that point. \n\nI’d punch old me in the face.",
   "created_utc": 1691201143,
   "score": 9,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juufbkn",
   "message": "The mirror universe one from that Star Trek episode where everyone has a goatee.",
   "created_utc": 1691200973,
   "score": 7,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juunykx",
   "message": "The current one, unfortunately",
   "created_utc": 1691205291,
   "score": 6,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juug2io",
   "message": "The one on Pristiq. It calmed my anxiety but made me emotionless and just didn’t care about anything. I accepted working under a horrible narcissistic boss and gained closed to 10kg due to laziness. Husband asked me one day to please focus on myself because I just wasn’t the same person. I quit the drug cold turkey (would never recommend,  the worst side effects including wanting to walk in to traffic several times), went back to a previous employer, began eating better and working on myself. Got awesome again just in time for the pandemic, but somehow my mental health stayed well and conceived my first baby during all of the chaos.",
   "created_utc": 1691201334,
   "score": 3,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juugjab",
   "message": "starting sobriety",
   "created_utc": 1691201560,
   "score": 3,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuex4v",
   "message": "1.5 years ago",
   "created_utc": 1691200779,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juukxrn",
   "message": "Realtor version... and I'm a recovering addict. Realtor me had 4,500 Facebook friends... because \"networking\". Bruh, I don't even know 4,500 people. WTF was I even doing? At least tweaker me wasn't pretending to be friends with and Albanian scammer",
   "created_utc": 1691203724,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juul7uu",
   "message": "Heavy drinking to the point of loosing a good job, alienated my family, and lost the love of a very special woman.",
   "created_utc": 1691203864,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juulwra",
   "message": "The addicted one",
   "created_utc": 1691204214,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juumjw3",
   "message": "High school me. I was insecure and snarky and negative and *mean.* And I didn't have to be.",
   "created_utc": 1691204545,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juumu4t",
   "message": "I used to Gaslight...... I'm ashamed in myself. I had a much needed wake up call a few years back.",
   "created_utc": 1691204691,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juun5t5",
   "message": "Elementary school me for sure",
   "created_utc": 1691204860,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuof4q",
   "message": "24-25 year old me. Drinking all the time while on heavy medication and acting like a complete trashy human being for like an entire year.",
   "created_utc": 1691205540,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juup2a4",
   "message": "Drunk",
   "created_utc": 1691205878,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juup381",
   "message": "2014 to 2017 me. Alcoholic. Armed. Violent. Punishing everyone around me for existing in the same world as me, punishing myself for existing in the first place.",
   "created_utc": 1691205893,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juupcoy",
   "message": "Height of my mental health crisis \n\nI was really toxic and just a annoying person to be round,I feel bad for the people around be who were either victims of my toxic ness or just generally had to deal with me",
   "created_utc": 1691206035,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juupwdf",
   "message": "17 year old me to 24 year old me. Was never in a gang, and usually targeted criminals, but I was very aggressive in my ways of earning money. Made a lot of enemies that resulted in getting shot at 24. Life has been a lot less stressful since",
   "created_utc": 1691206332,
   "score": 2,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurkxo",
   "message": "Self-defeating, head perpetually up my own ass, chronically unproductive and lacking any real motivation to improve, and too immature to be the man my SO at the time deserved.\n\nGrew out of it eventually. Now I’m just vanilla-flavored stupid.",
   "created_utc": 1691207261,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurl19",
   "message": "The last 6 months... Me and my ex saw the worst of each other...we were stuck in our addiction. We did things we would never do",
   "created_utc": 1691207263,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuu0f3",
   "message": "The height of my pill addiction. While house sitting, I knew the owner had medical issues, which meant they would have pills. Being the addict I was, I round them fairly quickly. I'm sure I should have died that weekend. Ativans 5 MG, and I think I popped 5. I don't remember much of anything for those 4 days. It's very scary, very embarrassing. After I sobered up, I owned it and apologized. We're still friends. I'm sober 6 yrs+ now",
   "created_utc": 1691208634,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvb0r",
   "message": "Me at the end of my relationship with a long term ex…would have been…2008ish? \n\nAfter five years together he announced to me in November that he was switching schools to one 5 hours away in January. But it was fine, I was done school that May so I’d move out there to be with him at the point. For the next five months I could feel him pulling away. Even before he moved. I could feel it and asked him what was wrong, he swore everything was fine. I point blank asked him if he wanted to break up, he assured me he didn’t. He moved and became impossible to track down. Would never answer his phone, wouldn’t text me back, wouldn’t email me back. I’d go days without hearing from him and when I finally did he’d act like I was the crazy one and he was just busy and everything was great. I felt like I was going crazy.\n\nI spent from November to March just feeling truly pathetic. I was constantly on my laptop trying to get a hold of him. My grades slid, I ignored friends and family. I was miserable and trying to figure out what was going on. I felt like I was losing my mind and was constantly crying and then I’d be so happy when I did reach him. I realize now what he did and I know none of how I behaved was my fault but shit, I’m ashamed of it all.",
   "created_utc": 1691209380,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuta71",
   "message": "Glass House. White Ferrari. Live for New Year's Eve. Sloppy steaks at Truffoni's. Big rare cut of meat with water dumped all over it, water splashing around the table, makes the night SO MUCH more fun. After the club go to Truffoni's for sloppy steaks. They'd say; 'no sloppy steaks' but they can't stop you from ordering a steak and a glass of water, before you knew it we were dumping that water on those steaks! The waiters were coming to try and snatch em up, we had to eat as fast as we could!",
   "created_utc": 1691208221,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juufsb4",
   "message": "Addict",
   "created_utc": 1691201197,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juug4es",
   "message": "Assuming Hugh Everett's Many Worlds theory of quantum mechanical wave function collapse is actually  true, (remember, that's not science.  No one as of yet has created an \"Everett-Wheeler phone\") probably the version where I hurt the most people (particularly women and children).",
   "created_utc": 1691201360,
   "score": 0,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juutn3u",
   "message": "My stupid first grade self who threw something across the room one day",
   "created_utc": 1691208424,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuu9ud",
   "message": "Gangbanger Me",
   "created_utc": 1691208784,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuf6bc",
   "message": "I would say my sophomore self was the worst version of me. I dated a senior, and that relationship ended up backfiring. Ended up losing any chance of playing sports that year because we were caught in my bedroom. Ended up falling for my best friend, and that didn't work because she didn't like me (we still were friends after). I'd say I had 2, maybe three friends that year. Although, the next year would have plenty of surprises. Everything happens for a reason, right?",
   "created_utc": 1691200902,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juufihw",
   "message": "I stayed drunk in my adolescence. A version of me I never want to be again.",
   "created_utc": 1691201066,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juui6i7",
   "message": "When I went through my “bougie” phase when I was like 19-20. I tried dressing like those fashion nova models and would buy a lot of fake diamond jewelry. I’d even walk and hold my purse like a bougie person. I later realized I was investing too much time on figuring out how to make “bougie” my style, when style is something that should come to you naturally. Bougie is NOT me at all. I’m 28 now and I wear T-shirt’s and jeans with converse and call it a day. Comfort and free-spirited has always been my true style. Now I understand what “finding your identity” means.",
   "created_utc": 1691202362,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juukkhg",
   "message": "The one where I lose control of my temper, just let go of the reins.",
   "created_utc": 1691203537,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juulg1r",
   "message": "Middle school and Freshman me.\n\nSo much politics. So much mental instability. So much League.",
   "created_utc": 1691203974,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juulu3k",
   "message": "The person who was overly obsessed with celebrities, yeah I would smack her.",
   "created_utc": 1691204176,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juun62n",
   "message": "Hmmmm",
   "created_utc": 1691204864,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuo46r",
   "message": "2011 I was going to give up on college and really wanted to fail. I guess I got a second chance once I realize my school was gonna keep giving me financial aid.",
   "created_utc": 1691205375,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuobet",
   "message": "8 years ago. I had no music taste, hobbies or any other interests besides just studying. I was quite linear with how I viewed life in general.",
   "created_utc": 1691205484,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juupo8h",
   "message": "18-21 year old me. Low morals, no ambition, committing felonies, awful partner, awful sibling, awful kid, college dropout, drug user, and a liberal.",
   "created_utc": 1691206209,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuq2ib",
   "message": "Probably me the last 6 months, I’m finally starting to crawl back from what I can only assume was a midlife crisis (35)",
   "created_utc": 1691206425,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuq8ua",
   "message": "When I was taking psychiatric medicine for a misdiagnosis (learned of the actual diagnosis many years later). The wrong medication made me extremely angry, always hungry, sleeping way too much or not sleeping at all. I was a zombie and stupid. Self harmed nearly every day. The medication made me worse. Couldn't work, couldn't remember anything, and had zero motivation. Lost relationships and my entire 20s.\n\nThe entire time, they weren't treating the correct issues. I was really angry about it for a couple years.",
   "created_utc": 1691206521,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuqa8e",
   "message": "My super Mormon self. I was a miserable stay at home mom who got married at 19 and I had no personality because all of it was just mormonism. I had no identity outside of that. Looking back now, it felt like I was a robot. Now I am 29 and goth mom with tattoos. Never felt more like myself in my life.",
   "created_utc": 1691206541,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuqcrq",
   "message": "Just before I met my now-wife. Late 20s, alone, no friends to speak of. Drank, smoked, ate crap. Imagine The Dude (Lebowski) but without the bowling skills. She rescued me.",
   "created_utc": 1691206581,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuqs1z",
   "message": "24 and 14 were rough.",
   "created_utc": 1691206814,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juur4iq",
   "message": "13 year old me was a tremendous pita. I feel bad for my parents now.",
   "created_utc": 1691207006,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juur4s3",
   "message": "The version of me from 2012. It wasn't my finest hour for how naïve and desperate I was. It's so embarrassing for me to look back at that year. It wasn't until 2013 I snapped out of it.",
   "created_utc": 1691207010,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurc4z",
   "message": "Simp version",
   "created_utc": 1691207123,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurdg8",
   "message": "2018-2019 version of me",
   "created_utc": 1691207143,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurlx3",
   "message": "so far probably 7th grade me. wore the same sweatpants every day without washes, up to weeks between showers, never brushed my teeth and still in contact with extremely bad people. on top of all this my grades were the worst they'd ever been",
   "created_utc": 1691207276,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurm6m",
   "message": "2008",
   "created_utc": 1691207280,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juurwsf",
   "message": "Easy that’s me!",
   "created_utc": 1691207444,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juusct6",
   "message": "Taking antidepressants and drinking heavily. Still don’t know if it was six days or four weeks, but I know I was an absolute horrible human being to people while it happened.",
   "created_utc": 1691207692,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juusews",
   "message": "Being suicidal out of spitefulness. Glad I made it and my mind got straightened out",
   "created_utc": 1691207726,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juusgax",
   "message": "This time last year.   Thanks for the reminder",
   "created_utc": 1691207747,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juusj33",
   "message": "Early 2012 me.",
   "created_utc": 1691207791,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juusrff",
   "message": "The me that put up with abuse for ten years",
   "created_utc": 1691207923,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juusu96",
   "message": "The drunk version. 2 year bender, not cool",
   "created_utc": 1691207967,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juut3rl",
   "message": "17 and 23, not sure what it is but others have said 23 is also a shit year for them",
   "created_utc": 1691208117,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juutn5u",
   "message": "Now",
   "created_utc": 1691208425,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juutsui",
   "message": "There is a film portrayal of the bad version of me.  Dr. Evil in Austin Powers.",
   "created_utc": 1691208514,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juutz21",
   "message": "13 year old me and me now",
   "created_utc": 1691208612,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuu5s4",
   "message": "From the time I was about 17 or 18 up until I got sober at 24.",
   "created_utc": 1691208720,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuu8z9",
   "message": "I was prescribed on antidepressants and benzos after being diagnosed with ptsd and chronic depression from a traumatic experience. I continually took them for several years in combination with psychotherapy. I really didn’t need them for as long as I was prescribed on them, and my depressive episodes were far and few between and were primarily seasonal or triggered by life hardships or other ptsd triggers. Because of this I would occasionally fall into hypomanic states. I was not a good person during these times, and acted out recklessly and selfishly. Hurt a lot of people and made really poor decisions. Became very attention seeking, and validation craving. Have been off all the meds since 2018 and will never go back.",
   "created_utc": 1691208771,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuukm5",
   "message": "High school to early college me. I was horribly socially awkward, easily led around by one or two people I was in love with rather than having my own personality (and tangentially hurt some people emotionally when I didn't think for myself and handle some things better), and I failed horribly at empathizing with other people. On top of that, I was so paralyzed with worry that I would upset someone that I just didn't say much and let other people do all the heavy lifting socially.\n\nI'm happy to say that me no longer exists except in my memories. But getting past that was a lot of work for me, and the friends who stuck by me.",
   "created_utc": 1691208957,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuuw27",
   "message": "Freshman-junior year of high-school was my villain Era. I'm so glad my friend group had the brains to leave me in the dust when I dropped out- if I still had them I probably wouldn't have gotten some decent character development",
   "created_utc": 1691209141,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuv2y8",
   "message": "When I got fat in the the early 2010s. Partly due to depression mixed with just being lazy. Don’t get fat if you can help it. I’m in a much better space now and have a far better outlook on my life.",
   "created_utc": 1691209250,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuv98a",
   "message": " Depends who you ask.",
   "created_utc": 1691209352,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvc57",
   "message": "Present me I guess",
   "created_utc": 1691209398,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvgkm",
   "message": "Coked up gang banger my now wife got me and my brother out of the streets moved across the country we started our own company got our geds and my brother went on to get a college degree it’s insane how lucky we got",
   "created_utc": 1691209473,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvm94",
   "message": "High school. So about 25 years ago. I didn't have my ADHD in check and I could get absolutely surgical with a teardown of a person.  No one fucked with me, but it's not exactly the best skill to have when you are trying to make friends.",
   "created_utc": 1691209567,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvqam",
   "message": "The raging alcoholic me, who chose a bottle over health.\nSober now 👍",
   "created_utc": 1691209634,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvspj",
   "message": "13-14 year old me.  I was terrible.  I ran with a really bad crowd. I did a lot of fighting.  I snuck out at night.  Even participated in the theft and joyride of an SUV.\n\nI’m certain if SnapChat or Instagram existed at the time I would have done something to ruin my life.\n\nAnyway, my dad went to prison my freshman year, and it was a giant wake-up call.\n\nEnded up trying to turn shit around.  Migrated to a different group of friends.  Started thinking about making the most of high school.\n\nI suppose I turned out okay.",
   "created_utc": 1691209675,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvt4x",
   "message": "14-16 aged me, God I was insufferable back then. Fortunately the only real lasting thing connecting me to that version is this username",
   "created_utc": 1691209682,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvu5h",
   "message": "19 when I got my first corporate white collar job.  My parents never taught me office politics and my dad actively shit on everyone, so I had a pretty terrible attitude at work.  I was smart and worked hard, but if I had even a shred of the social skills I should have had, I'd be doing much better right now.  I'm not doing terrible by any means, but I should have worked up to VP or something by now.",
   "created_utc": 1691209698,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuvw8m",
   "message": "All of them.",
   "created_utc": 1691209733,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuw27j",
   "message": "Post heart attack from drinking, hole in throat, stomach tube hooked up to Propofol....it was right after Jan 6 and CNN was on but I was doped up and intubated so I couldn't changed the channel. worst me ever",
   "created_utc": 1691209832,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuw30b",
   "message": "Couple years ago i got really depressed, forgot how to act and managed to fuck up every friendship i had without realizing it. Im all good now tho, moved away and started over",
   "created_utc": 1691209846,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuw3qy",
   "message": "2020-2022, I was depressed, anxious, addicted to nicotine, and surrounded by shitty friends. had to make choices I regretted in order to keep the only friends I had",
   "created_utc": 1691209857,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuw4hd",
   "message": "The version that didn’t heal, or even know they suffered a lot of child abuse.",
   "created_utc": 1691209870,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuw4p0",
   "message": "Worst of my eating disorder. I was a bitch, killing myself slowly and making it everyone else’s problem.",
   "created_utc": 1691209873,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuw96e",
   "message": "I don't know, but I'm pretty sure I'd tell 17 year old me to stick to my home city for college and to go to therapy religiously, to avoid becoming that worst version in my 20s.",
   "created_utc": 1691209948,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwaid",
   "message": "Me rn",
   "created_utc": 1691209969,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwasa",
   "message": "20 to 30 year old me, a drugged out emotional cripple with no morals, coping skills or limit to my appetites or ability to create chaos and pain in my wake. Grade A asshole and menace.",
   "created_utc": 1691209973,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwbnn",
   "message": "Late teen/early 20's me.",
   "created_utc": 1691209988,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwexr",
   "message": "Lol I had some existential crisis about some alternative reality version of me that was Hitler 2",
   "created_utc": 1691210043,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwfgn",
   "message": "Dissociation during my divorce at age 20. Like watching myself tear apart my life from a third-person perspective.",
   "created_utc": 1691210051,
   "score": 1,
   "submission_id": "15iiu9x"
  },
  {
   "comment_id": "juuwg70",
   "message": "Probably February 2021-May 2023",
   "created_utc": 1691210063,
   "score": 1,
   "submission_id": "15iiu9x"
  }
 ]
}