{
 "submission_id": "15iikxb",
 "title": "How do you feel about nudity in cartoons being censored but grotesque violence is perfectly fine for TV? Since when was skin more sensitive than blood?",
 "selftext": "",
 "created_utc": 1691199937,
 "permalink": "/r/AskReddit/comments/15iikxb/how_do_you_feel_about_nudity_in_cartoons_being/",
 "score": 30,
 "url": "https://www.reddit.com/r/AskReddit/comments/15iikxb/how_do_you_feel_about_nudity_in_cartoons_being/",
 "comments": [
  {
   "comment_id": "juugmr1",
   "message": "It's weird.\n\nYour question reminds me of a scene in Hannibal that featured the corpses of a naked couple posed with flayed skin from their backs spread out like angel wings. \n\nThe TV censors in America initially weren't going to allow this scene to be shown on TV. Not because of the gore, but because you could see their buttcracks.\n\nThe show makers suggested filling in the buttcracks with blood, so they weren't visible, and the censors said that was fine and allowed it to be shown on TV.",
   "created_utc": 1691201607,
   "score": 23,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juukt43",
   "message": "A lot of parents would rather have their kids get in a fight than experiment sexually",
   "created_utc": 1691203658,
   "score": 13,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juudru2",
   "message": "not just cartoons, just all media be Social Media, print, movies, TV. \n\nI went to High School in Spain, and there the women were topless on the beaches and public pools. Every neighborhood had a public pool and you could see your class mates topless every Saturday at the pool. Was pretty cool. I think breasts are not inherently sexual, they are simple baby bottles from Nature. The act of child nursing is not sexual so why would nipples be sexual. \n\nBut yeah violence is ok. Like I was watching a PG film with my 10 yr old son and he was appaled from the sheer violence. Like any movie will have heads being impaled, skin being torn off, and nobody bats an eye.",
   "created_utc": 1691200230,
   "score": 13,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juudi6u",
   "message": "Hypocritical, puritanical religious mores.",
   "created_utc": 1691200102,
   "score": 19,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juuej7a",
   "message": "Religion. Ever since religion.",
   "created_utc": 1691200590,
   "score": 15,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juus36s",
   "message": "Porky pig and Donald Duck do not wear pants.",
   "created_utc": 1691207543,
   "score": 3,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juutfhc",
   "message": " Boom!\nThis just summed it up, right here!!",
   "created_utc": 1691208305,
   "score": 2,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juufjgc",
   "message": "You have to protect children from seeing boobies. Don't worry about them playing call of duty and watching violent shows, God is okay with violence. Don't show them boobs or they will become deviants.",
   "created_utc": 1691201078,
   "score": 4,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juuks44",
   "message": "The loud minority always gets their asses kissed these days.",
   "created_utc": 1691203644,
   "score": 3,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juurg9w",
   "message": "I made a comment once to a friend about how we couldn't rape people instead of just plain old kill them in a video game. I mean I don't want to rape people, or do it in a video game, but the concept of sex crimes being so taboo yet murder is glorified just is interesting to me. \n\nThat conversation did not go well. My friend was just completely adamant about that kind of comment not ever being ok. And yeah I guess it shouldn't be ok, but my question is why is it perfectly ok to crack open a few sodas after school and violently murder people on a screen, yet the mere hypothetical mention of raping somebody means we have to end the conversation at all costs in the name of human decency.",
   "created_utc": 1691207188,
   "score": 4,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juufn31",
   "message": "Because religion has to infest our society.  Nudity is pretty common on many countries in northern and western Europe and you don’t those societies fall apart.",
   "created_utc": 1691201128,
   "score": 3,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juuibeu",
   "message": "I honestly don’t know how to answer this lol. Both are things kids shouldn’t be looking at but it also depends on the level of gore.",
   "created_utc": 1691202428,
   "score": 2,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juuq56b",
   "message": "It's stupid.  People in Harlie Quinn explode in horribly grotesque ways, but god forbid they actually show her boobs when she flashes her girlfriend.  \n\nPersonally, I think it would be funnier if they censored both.  But if not both, then censor neither.",
   "created_utc": 1691206465,
   "score": 2,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juudltw",
   "message": "Since forever. Nudity is porn, gore and violence is for dramatic effect. It’s just how it is",
   "created_utc": 1691200151,
   "score": 2,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juum906",
   "message": "I personally think that cartoons in the early 2000's did it perfectly. Nudity is somewhat of a normal thing and people should get used to that.",
   "created_utc": 1691204389,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juufpzl",
   "message": "Who cares about cartoon boobs? Get a life.",
   "created_utc": 1691201165,
   "score": 253,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juujw39",
   "message": "In the US it started out with the moral majority",
   "created_utc": 1691203198,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juuo83b",
   "message": "Last I checked blood isn’t sexual ( most of the time )",
   "created_utc": 1691205433,
   "score": 255,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juug54e",
   "message": "Violence and gore used to get us food, whi hbis something children used to be taught to do. \n\nSex has almost always until recently been a \"wedding night plus\" unlock, so children in general are less exposed to sex. I'm not saying I agree, but we aren't bononos, violence is more normal for us.",
   "created_utc": 1691201368,
   "score": 251,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juum503",
   "message": "Yeah, that's messed up.",
   "created_utc": 1691204333,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juuplrd",
   "message": "I disapprove of censorship flat out.",
   "created_utc": 1691206172,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juut677",
   "message": "Middle-class parents aren't worried that their kids will kill people. (Maybe they should be, but they aren't.) They are, however, worried that their kids will have sex. So it's okay to \"put the idea in their heads\" that killing people is funny, but it's not okay to \"put the ideas in their heads\" that people have sex.",
   "created_utc": 1691208157,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juuvcb6",
   "message": "I was playing one of the Mortal Kombat games and uppercutted my opponent into a vat of acid. I remember thinking to myself, \"Wow. Good thing her skin melted off before her bikini, or I might have seen a nipple.\"",
   "created_utc": 1691209401,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juuvhtj",
   "message": "Early 2000s, action by USA vs. Taliban had just started in Afghanistan.\n\nHeadline News was showing Afghans dragging a dead body out of a Jeep and through the streets every half hour.\n\nMeanwhile, there was a lingerie model fashion show on national television the night before.\n\nGuess which one generated the most irritated letters to the editor of the local newspaper?\n\nI, personally, would prefer my young grandsons to see mostly healthy young women in their underwear than to see a dead body killed in violence.  But apparently corporate America doesn’t share my view on this.",
   "created_utc": 1691209494,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juuvt91",
   "message": "Hentai sure children’s cartoons no. Anime I’m okay with some titty I’m not a robot",
   "created_utc": 1691209683,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juuwg51",
   "message": "They’re not really on the same level. Invincible level carnage only happens in shows that could also have nudity based on the rating system. Do you mean when people get hit with a comically large hammer and turn into a flat disc? Or when they get shot or stabbed with the wound hidden from view and only a blood stain (if that) to show they were really damaged? That’s the violence equivalent of cleavage. There’s just not enough graphic violence in low rated shows to say “man, it’s weird that they can’t have porn in this”.",
   "created_utc": 1691210063,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juuy1kd",
   "message": "naw, it is more that religious freaks demand that sex be portrayed as sacred while violence is encouraged in the bible. even though the bible features both in graphic scenes like a man giving his daughters to be gangraped to save two angels from the same fate or a guy hearing voices in his head from :god\" was about to murder his son.",
   "created_utc": 1691211024,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juuy8tg",
   "message": "My assumption is that they don’t want people to be addicted to porn",
   "created_utc": 1691211150,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juuyicm",
   "message": "Give it all or nothing",
   "created_utc": 1691211312,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juv0mk4",
   "message": "It is very weird.  I'd rather both be gone from my TV.",
   "created_utc": 1691212678,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juv15r5",
   "message": "How about neither? Why on Earth would you want to expose children to sex?",
   "created_utc": 1691213033,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juv1hns",
   "message": "Big pet peeve of mine. I think our society has twisted priorities right now, especially in the US. I’ve noticed ever since the rise of MeToo (a very important movement, don’t get me wrong), we seem to be sliding toward more prudish attitudes about sex overall, without considering what’s actually harmful and what isn’t. I remember seeing a bare butt on TV when I was a kid, and it didn’t phase me one bit. Seeing blood and gore for the first time was actually disturbing and took some time to process.",
   "created_utc": 1691213256,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juv2v89",
   "message": "It’s a strange, puritanical society that we live in. Sex is looked down upon and seen as dirty. Drawing blood is seen as strong and heroic in most cases",
   "created_utc": 1691214197,
   "score": 1,
   "submission_id": "15iikxb"
  },
  {
   "comment_id": "juv5akl",
   "message": "USA!!!  🫣",
   "created_utc": 1691215914,
   "score": 1,
   "submission_id": "15iikxb"
  }
 ]
}