{
 "submission_id": "15isppg",
 "title": "What’s a harmless/non-serious secret you’ve kept forever?",
 "selftext": "",
 "created_utc": 1691233130,
 "permalink": "/r/AskReddit/comments/15isppg/whats_a_harmlessnonserious_secret_youve_kept/",
 "score": 52,
 "url": "https://www.reddit.com/r/AskReddit/comments/15isppg/whats_a_harmlessnonserious_secret_youve_kept/",
 "comments": [
  {
   "comment_id": "juvtpgn",
   "message": "I did a lot of sneaky stuff when I was a kid. I mostly stole chocolates every night up until Christmas eve. I did it while everyone was asleep. My mom is a light sleeper so if I stepped anywhere that made the wooden floor creak she'd yell \"who's awake?!\". Well, during the day I would memorize all the creaking spots from my room to the living room (where the chocolates were at). I wouldn't get greedy though (only 2 or 3 chocolates at a time). I was super patient. If I heard any noise that made me suspect someone was awake, I would stand there frozen for nearly 10 minutes at a time. \n\nI even had a plan B in case someone had to use the bathroom (hiding spots). One night my dad got up to pee and I hid behind the china cabinet while he walked past me half asleep.",
   "created_utc": 1691233905,
   "score": 245,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvut52",
   "message": "My best friend streamed on twitch for 1 year, and I was all of her viewers. She regularly streamed to 1 viewer (me) so I made multiple accounts and pretended to be a stranger who would talk to us during stream. \n\nI gave them different personalities, different ways of speech, different backgrounds. I would even create discord chats to make them seem believable. \n\nEventually she gained a following and I didn't need to anymore, and later she stopped streaming altogether.\n\nShe still doesn't know.",
   "created_utc": 1691234596,
   "score": 14,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvv6ps",
   "message": "Dad,  I lied that day in kindergarten when I said I had a tummy ache and needed to go home. \n\nI was totally fine,  I was just super bored and wanted to spend time with you.",
   "created_utc": 1691234835,
   "score": 253,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvt9z5",
   "message": "I stole the cookie from the cookie jar",
   "created_utc": 1691233634,
   "score": 25,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw2jq4",
   "message": "In 2009 my best friend was struggling to pay rent when his TV broke. So I want and bought him an at the time 42 inch HDTV for over $1,000. I knew he would never accept me spending that much as a gift.\n\nSo I took it out of the box and put a few small scratches on the back of it and told him I bought a new TV and that he could have my old one that I didn't use anymore.\n\nWell, he's doing way better now financially, but he has no idea I did that and I will never tell him.",
   "created_utc": 1691239219,
   "score": 154,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw3os4",
   "message": "I used to live in a dorm hall when I was an undergrad. There was this one guy in the dorms who had a mat outside his door. I always thought it was a little weird because:\n\n1. You had to walk a long way through carpet to get to the door, so your shoes would surely be mostly clean by that point, and\n2. Anyone could just simply take it.\n\nI kinda just assumed someone would steal it eventually, but after about a month, I noticed it was still there. I obviously wasn't going to steal someone's stuff, but I did want to mess with it, so I simply moved it to the door across the hall. The next day, I saw it had been moved back, so I decided to move it across the hall again. I did this for an entire year. Sometimes they'd give up and leave it at the other door for a week, then I'd just move it back to fuck with them. I loved the idea that it surely led to some sort of argument between the two neighbors because nobody is gonna think some guy is just randomly deciding to fuck with them for no reason. I literally never met either of the people that lived in those rooms. I just kept messing with their mat. \n\nI had some special moments with it too. On Christmas, I replaced the mat with a Christmas one and then put the original one back the next day. On Easter, I bought the cheapest, shittiest Easter basket I could find and filled it with granny candies like Werthers and those strawberry candies, then I \"hid\" it under the mat. At one point, I bought a second mat to just sometimes put at both doors, then take the second mat away randomly. Eventually I moved into an apartment and couldn't mess with them anymore though. They never got to find out wtf was going on.",
   "created_utc": 1691239840,
   "score": 105,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw4za4",
   "message": "I ate the crumble off the top of my mom's apple crisp and blamed it on the cat. Years after the cat passed, my parents tell the story of how she ate the crumble as a cute anecdote.",
   "created_utc": 1691240481,
   "score": 97,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwa02x",
   "message": "I've had type 1 diabetes since I was 3. On my 9th birthday, my grandma made a birthday cake for me, which was big enough for us all to share at the family party. Since there was so much food, we had plenty of leftover cake for the next few days, which I was only allowed to eat a little bit of. \n\nWhen no one was around, I snuck into the kitchen and ate a couple slices of the leftover cake, plus I picked huge chunks of the icing off. It looked pretty haphazard by the time I snuck away again. \n\nMy parents soon found the remains of the cake. Since I'm diabetic, they didn't suspect that it was me who picked at the leftovers (I was usually a very well-behaved kid). They blamed it on our rather chubby cat, and promptly deemed it unacceptable for human consumption. It was a believable scenario because she had stolen human food in the past. Sadly, they threw the rest of the cake out.\n\nI could never own up to it because I would have been in trouble for compromising my blood sugar levels, and for being greedy! My old cat never ratted me out for letting her take the blame, though. Thanks, Molly, R.I.P!\n\n\n\nEdit: I'm a woman and this was the year 2000, before the medical technology we have now. Back then, I only checked my blood glucose at mealtimes so the crime wouldn't have been evident until the next morning, and that's only if I was honest about my blood glucose level! There was no such thing as sliding-scale dosage back then so eating more cake was very much a bad idea! Hence only being allowed a little bit.\n\nEdit 2: it was sitting out on the kitchen table and hadn't been wrapped up and put away yet lol. It was butter icing which made the cat theory a bit more believable\n\nEdit 3: we didn't have such easy access to info like cats taste receptors back then, so this didn't occur to my parents.",
   "created_utc": 1691242718,
   "score": 190,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvzblf",
   "message": "I walk around the woods behind my house naked sometimes and pretend im on Naked and Afraid.",
   "created_utc": 1691237401,
   "score": 180,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvy7l2",
   "message": "When I tell people I read a lot, I leave out that it’s fan fiction.\n\nDramione fan fiction. That’s semi-explicit Draco Malfoy and Hermione Granger (I know, I *know*, it’s my secret shame) fan fiction.\n\nIt’s awkward when people want to know what I’m reading and I have to make something up.\n\nI’m so deep in the closet I’m rubbing shoulders with Tom Cruise here.",
   "created_utc": 1691236729,
   "score": 179,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvsoq9",
   "message": "Crashed my mom's drone a few years ago, fixed the wings and hid the evidence. No one knows but me, not anymore I guess.",
   "created_utc": 1691233261,
   "score": 128,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvzezg",
   "message": "I bought a surprise plane ticket to see my long distance girlfriend after one year apart. She told me there was somebody else some days before the flight.",
   "created_utc": 1691237454,
   "score": 157,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvufcn",
   "message": "One day when I came from home school my mum had locked me out of the house. So I went into the jitty and randomly decided to skim some stones. The milkman had come and left 4 milk bottles near our gate so I casually skimmed a stone at them and managed to smash all of them with one stone.\n\nTold my mum it was like that when I got there. Mum got annoyed at the other rascals that were around and not me. Complete win.\n\nI also stole someones milk from their doorstep one day when I was around 11 because we had no milk and I wanted a cup of tea.",
   "created_utc": 1691234361,
   "score": 26,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw4u2q",
   "message": "My mum lent my now mother-in-law her trifle dish for Christmas Dinner. It was the last thing my mum had of her sister as she had died suddenly that year (they were super close and trifle was their thing). My mother-in-law dropped it and she replaced it with the exact same one (no idea how as the original was pretty old). We decided never to tell my mum. It's sort of a running joke now at Christmas we wind my mother in law up and every time it's mentioned she is hysterical having to relive the moment she dropped it all over again!",
   "created_utc": 1691240412,
   "score": 59,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw0w7m",
   "message": "I've always been a night owl. When I was in Elementary school I'd slip into the living room and watch late night tv until the channels went off the air.",
   "created_utc": 1691238298,
   "score": 184,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw6tbv",
   "message": "I helped a friend out with ad money on her blog and views and YouTube stuff  I would regularly click on ads on different devices so she could get the money from them I also used multiple devices and accounts  to help her get a boost on her blog and her YouTube channel. I would write in different ways and say different things to make sure they all didn’t sound too Similar. Also being bilingual helps so I was able to write in English and Spanish \n\nShe’s gotten a big enough following she doesn’t need it anymore but to this day she doesn’t know it was me who left all of those encouraging comments and likes and reposts and thing of that nature.",
   "created_utc": 1691241314,
   "score": 243,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw6rrd",
   "message": "There was one time when my boyfriend and I forgot there was rice in the rice cooker and it got flies. I eventually remembered and went to clean it out and got so grossed out that I couldn’t do it. A little later we were cleaning the kitchen and I “””casually””” asked my boyfriend to clean the rice cooker, knowing it was full of Gross. He opened it, was incredibly grossed out, but still cleaned it. \n\nIt’s been years since this happened but I’ve been so embarrassed by my conduct that I’ve never admitted that I knowingly sent him to take down the rice cooker. I feel like I owe him an apology but that would require me to admit it and I. I can’t. 😳We’re a very open couple and have had much more difficult conversations (just the usual relationship stuff that rises in an LTR). But for some reason this incredibly low stakes secret just makes me cringe so hard that I can’t bring myself to say anything. I will take this secret to my grave.",
   "created_utc": 1691241295,
   "score": 159,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvuxqj",
   "message": "Stephen Jay Gould said it; \"I am, somehow, less interested in the weight and convolutions of Einstein’s brain than in the near certainty that people of equal talent have lived and died in cotton fields and sweatshops.\"",
   "created_utc": 1691234679,
   "score": 34,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvwmo6",
   "message": "I actually don't really care for Fist of the North Star, but one of my best friends is a mega 90s nerd and it's their favorite show so I'm trying to learn more about it for her sake ^^;;",
   "created_utc": 1691235736,
   "score": 45,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvv2h4",
   "message": "People that are secretly alive, but dead for the public life and vice versa",
   "created_utc": 1691234761,
   "score": 15,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw8w9u",
   "message": "My dad claimed to have fucked my friends mum in a pub toilet when they were younger. \n\nHe told me one night when we were pissed together, I believe him. \n\nMy friend could be incredibly competitive and annoying but I always resisted the urge to tell him \"My dad fucked your mum\" 🤣",
   "created_utc": 1691242239,
   "score": 81,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwbkgq",
   "message": "When I was about 15 or 16 I had a sleepover with about 10 of my friends and my sister. I decided to have some fun with them, and pretended to sleep talk. They recorded it on a cassette tape, and I figured it would just be a fun harmless prank.\n\nWell, nearly 30 years later, they still keep bringing it up. They still don't know that I was faking and I don't know how to tell them at this point because so much time has passed. That tape is still floating around. I hate it when they bring it up, and they think it's because I'm embarrassed about sleep talking but the reality is it was just a stupid prank I played when I was a teenager and I just never in a million years thought that it would still be going three decades later. I want this to just fucking die already lol.\n\nNobody knows my secret except for you, random strangers on Reddit.",
   "created_utc": 1691243387,
   "score": 59,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw73yx",
   "message": "I told Stefani Germanotti to change her name.",
   "created_utc": 1691241447,
   "score": 7,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw33x0",
   "message": "Grade Three in the 70s. Watched something the night before where burglars or spies broke into somewhere using plastic explosives on a lock. My grade three class had a supply of plasticine/modelling clay. I decided to blow the lock on the teachers filing cabinet. I packed the clay on and in the lock but the bell rang before I could set the charge (probably pipe cleaner wires). This was Friday morning. It set over the weekend. Teacher was not happy on Monday morning. But no one copped to it.",
   "created_utc": 1691239525,
   "score": 28,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw8ivs",
   "message": "Not long after I got married I went to play laser tag with people from work (retail) after we all clocked out. I told her we stayed late doing inventory stuff. I would have loved for her to come but A) she takes FOREVER to get ready for anything B) we didn’t have a lot of extra money at the time, and 3) she didn’t have health insurance at that time and I was worried about her somehow getting hurt playing laser tag. We’ve been married 27 years, so I hope this secret doesn’t get revealed and we’d have to split up.",
   "created_utc": 1691242076,
   "score": 27,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwc0mm",
   "message": "I was working in a restaurant when I was 19. The restaurant let me serve alcohol even though it was illegal. Anyway, this old man was being a pervert and talking about sexual stuff to me. He had a steak ordered. No one was near the food when I picked it up because there was only one cook and he walked away. I spit on his steak, rubbed it in, then watched him eat it.",
   "created_utc": 1691243570,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwc6vp",
   "message": "When my brother was 4 he won a stuffed animal from a claw machine and it was his favourite thing ever, slept with it every night for weeks he fell asleep on the couch and was carried to bed but left his stuffed animal on the floor and the dog decided to tear it to pieces during the night. I spent $40 trying to win another one and put it under his bed for him to find.\n\n*wow didn’t think this would blow up so much, thank you for the awards and kind words I’ll do my best to pay them forward❤️",
   "created_utc": 1691243643,
   "score": 113,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw2cxq",
   "message": "I did not care for The Godfather\n\nIt insists upon itself",
   "created_utc": 1691239114,
   "score": 32,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvvqpq",
   "message": "I ate the chocolates 😈",
   "created_utc": 1691235183,
   "score": 13,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvx2os",
   "message": "I broke a blade off this watch-type thing that fired the spinny thing (that had the blade) that my friend had literally just opened for his birthday at the birthday party I was at.  I shoved it down the side of the cushions and hoped no one would notice.",
   "created_utc": 1691236019,
   "score": 9,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvzlss",
   "message": "I’m the one that stole the chocolate chips.",
   "created_utc": 1691237562,
   "score": 2,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwa9hz",
   "message": "I stole $5 off my dad’s dresser back in the mid 90s when I was 12. He spent a solid hour looking for it, and was convinced he threw it out.",
   "created_utc": 1691242834,
   "score": 0,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwcdhm",
   "message": "I threw away my uncles porn. We all lived together and I found it on accident. I got super scared because I was a sheltered kid and didn’t know what I was looking at. \nI panicked that I’d get in trouble and so I threw it away. No one got mad from what I remember and I don’t think he ever asked anyone about it since no one brought it up.",
   "created_utc": 1691243719,
   "score": 192,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwcmwo",
   "message": "My brother was a jerk to me when we were teens. I had a pretty friend over and he was trying to talk to her. I would page her(this was in 90s) and put random numbers so she would come inside and it would “cock block” my brother",
   "created_utc": 1691243831,
   "score": 26,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwcvtj",
   "message": "Back then there was this old guy who made a living selling used cardboard boxes, cans, and anything in good shape, he would use a broken trycyle (A three wheeled vehicle that had a small compartment fit for atleast 3-4 people attached to a motorcycle) everyday he would go around and collect whatever he could find, he wore rags, had messy hair and wasn't in the best of health, so almost all the time when i saw him i gave him some money and some snacks, although my parents disapproved of it and thought i stopped, Little did they know i started a small business at my school selling bracelets and gave 80% of the money to him and the 20% went to me buying him food.",
   "created_utc": 1691243931,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwf8c5",
   "message": "When I was like 9 my parents had incense and I thought it was weed so I tried to smoke it out of an incense waterfall machine. Didn’t go well.",
   "created_utc": 1691244914,
   "score": 44,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvw22y",
   "message": "Omg some of these are so good , This is the best thread to read whilst stoned , *grabs tea and hits the bong * xx",
   "created_utc": 1691235378,
   "score": 4,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw40jg",
   "message": "I let the dogs out",
   "created_utc": 1691240010,
   "score": 2,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw9aat",
   "message": "There's a few things people have talked to me about in confidence and I kept a lid on that shit, so tight I rarely think about it myself.",
   "created_utc": 1691242409,
   "score": 29,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juvy3vs",
   "message": "If I tell I won't be keeping the secret any more.",
   "created_utc": 1691236665,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw9z51",
   "message": "Borrowed my dad’s paint sprayer. Couldn’t get it cleaned well enough. Bought a new one returned it in the old box. Didn’t want to disappoint him.",
   "created_utc": 1691242707,
   "score": 20,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwdidj",
   "message": "That I’m bisexual",
   "created_utc": 1691244195,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwahpi",
   "message": "Done……upvote back",
   "created_utc": 1691242932,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw0ekq",
   "message": "That's dedication! You were the ultimate one-person fan club.",
   "created_utc": 1691238025,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw1yxp",
   "message": "My Uncle smoke and both him and he's wife are deacons in church, the wife didn't know that till now, it's over 25 years",
   "created_utc": 1691238907,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juw8p16",
   "message": "I like pickles",
   "created_utc": 1691242151,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwas27",
   "message": "I ate one chips more than my sibling",
   "created_utc": 1691243052,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwazyh",
   "message": "I donate to my friends when they stream on alt accounts",
   "created_utc": 1691243147,
   "score": 14,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwbai3",
   "message": "I liked all the potato chips in a bag of my brother’s favorite chips and watched him eat them in revenge for him frogging my arm(punching with knuckle up to induce more pain)",
   "created_utc": 1691243272,
   "score": 11,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwc6vw",
   "message": "Sometimes I don't bathe for a week or more, I don't smell bad because I didn't do anything major.  Just wipe and done.",
   "created_utc": 1691243644,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwdlvd",
   "message": "Sucked off my biology teacher back in college more than once.",
   "created_utc": 1691244235,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwdmq0",
   "message": "Nsfw, read at your own discretion \u0026gt;!I bought a sex \"toy\" a while back where you put your dick and balls through a set of holes and sandwich your balls between two panes of (probably) glass or something else, and with a set of nuts and screws, you squish them down and flatten them while you jerk off. I've used it a number of times and nobody's seen it or questioned the package it came in.!\u0026lt;",
   "created_utc": 1691244246,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwe2jh",
   "message": "I stole some extra free samples at Sams Club",
   "created_utc": 1691244425,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwebjd",
   "message": "I love telling people I placed first in a national competition for shotokan karate. So naturally people assume I'm a really good fighter. I placed first in kata. I'm just really good at choreography.",
   "created_utc": 1691244530,
   "score": 22,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwebpo",
   "message": "I still suck my thumb sometimes.  I'm 44. I've been married for 15 years.  As far as I know my husband has never caught me. He would definitely say something if he did.",
   "created_utc": 1691244533,
   "score": 164,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwed5g",
   "message": "In elementary school, due to limited gymnasium space our basketball team had to practice in the early morning before school. I must not have heard our coach when he told us that practice would be cancelled the next day because of a personal scheduling conflict. One other kid and I showed up to find an empty gym with all the lights out. We spent the hour using a turned over garbage can and the increasing sunlight from the skylights to try to dunk a kid's mini basketball on the 10-foot rim. I was tall for my age but still couldn't do it. We never told anyone.",
   "created_utc": 1691244551,
   "score": 9,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juweg38",
   "message": "My younger sister and I would sneak a Christmas present from under the tree, surgically remove the tape, carefully unwrap the gift to see what it is and then wrap it back exactly how it was, put it back under the tree exactly how it was.",
   "created_utc": 1691244585,
   "score": 212,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwf13n",
   "message": "I took a shit behind the entertainment stand in my parents living room when I was like 7, covered it with my dads hat and blamed it on the dog.",
   "created_utc": 1691244830,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwfkth",
   "message": "Nice try not getting out me that way",
   "created_utc": 1691245055,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwfo7t",
   "message": "Going to my grave with me.",
   "created_utc": 1691245093,
   "score": 6,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwghgp",
   "message": "I farted in a Physics tutoring class consisting of 6-10  people including the tutor. \n\nA friend started yelling about the air conditioner having a bad smell. He suspected a bird or a mouse died there. \n\nFinally we all had to move to continue the class in another room. \n\nUntil this day, no one in this group knows that I farted.",
   "created_utc": 1691245436,
   "score": 130,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwgxyo",
   "message": "I didn’t reveal to anyone until I was 40 that I had a childhood dream of making films. The first person I told was someone I knew wouldn’t ridicule me.\n\nIt was my girlfriend. Fortunately I was right.\n\nI’ve long since decided that the best way to accomplish that is to write a bestselling novel.",
   "created_utc": 1691245634,
   "score": 8,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwgyot",
   "message": "My mom / dad / people in our community kept spotting me driving to this back parking lot at a local government complex.  They asked me what I was doing, and told them it was a great place to star gaze because it was kind of off the main road.  \n\nEven 20 years later I still get comments if I'm going to go stargazing!  No, that was my make out / sex spot in highschool.  I think they know.",
   "created_utc": 1691245643,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwh4ak",
   "message": "I write stories about my friends and I being heroes and stuff. I hope they wouldn’t be creeped out by it, they make great characters and it’s fun to imagine.",
   "created_utc": 1691245710,
   "score": 64,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwh9h1",
   "message": "As a kid I constantly got in trouble for putting things in my mouth.  One day when I was about 6 I accidentally swallowed a couple of coins…even through the massive episode of violent vomiting and subsequent hospital visit, I never confessed to swallowing the coin because I didn’t want to get in trouble",
   "created_utc": 1691245772,
   "score": 224,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwhc6v",
   "message": "Fart",
   "created_utc": 1691245805,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwhfqr",
   "message": "I know what the fox says.",
   "created_utc": 1691245846,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwhs5d",
   "message": "My father's friend from kindergarten was born with two thumbs on one hand.",
   "created_utc": 1691245993,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwhuct",
   "message": "That's dedication to friendship and entertainment! You deserve an honorary \"Best Supporting Viewer\" award.",
   "created_utc": 1691246019,
   "score": 1,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwhutj",
   "message": "When I was dating my now wife, her son took my car for a joyride while we were out of town.\n\nWhen we got back from our out of town trip I noticed something was amiss on my car. When I got in it, I noticed the sunshade was installed backwards, I would never do that on accident. \n\nI then pulled the dashcam footage. He took it around the neighborhood. He didn't do any donuts, or burn any tires. Just a nice slow stroll through the neighborhood with the music playing and I assume waved and some people. \n\nI ended up just handling it man to man. he was like 17-18 at the time. I never told his mom about it.",
   "created_utc": 1691246024,
   "score": 14,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwikpe",
   "message": "As a previous nanny, I've seen many first steps and heard many first words, but I never share that. When I leave I say something like, I think little one is soooo close to walking/talking! It's a special moment parents deserve, who am I to take that from them? One baby was walking with me for a full 2 weeks before he showed his new trick to his parents.",
   "created_utc": 1691246330,
   "score": 210,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwlivp",
   "message": "My dad is a doctor. When my daughter was little she was terrified of hurting her ankle. Like anytime she got the slightest twinge or rolled it slightly, she was convinced it was broken. My dad would take her to the office and run a fetal heart  Doppler over her little ankle and tell her it was an X-RAY machine and her ankle was fine. \n\nShe’s 13 and still convinced that papa took actual x rays of her ankle. I’m never going to tell her otherwise.",
   "created_utc": 1691247570,
   "score": 15,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwn0hx",
   "message": "When I had just got my license, I was kind of an idiot (as are most 16 year old boys).  It was snowing and I thought I would try to drift my car into a mcdonalds parking lot from the road.  I failed, obviously, and went down an embankment into another parking lot.\n\nThankfully my car was mostly ok, I had to replace a quarter panel and a headlight, but nothing too serious.\n\nI told my parents I was avoiding a head on collision and hit black ice.  I have never told them the truth even though it has been 20 years since that incident.  I could tell them and they wouldn't care really, but I just haven't and probably never will.  This is the first time I have ever told anyone the truth about that day.",
   "created_utc": 1691248185,
   "score": 139,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwlr3j",
   "message": "In 1998 I had a friend who was stuck in a very toxic situation at her home. She had an opportunity for a new start across country in Oregon. She had a Dodge Neon that was hanging on for dear life and decided to pass on the opportunity for fear the car wouldn’t make the trip. I told her I had a friend that was a mechanic that owed me a favor and he would give the car a tune up for free. I didn’t really have a friend that was a mechanic. We were both 18 with not much money but I used all of my savings to pay to have her car made road worthy for the trip. She’s a mother of 4 now with a great job and thriving in Oregon.",
   "created_utc": 1691247664,
   "score": 218,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwlcyw",
   "message": "My mom won a prize from SiriusXM at the beginning of the pandemic that never arrives even after she followed up.\n\nShe had been so excited to win something for the first time that  I finally found a record store with the items she won, paid for them, and arranged with them to use a generic shipping label and include an apology for the delay and congrats for winning label. \n\nShe loves her prize and 'forgives' them for rhe delay.",
   "created_utc": 1691247501,
   "score": 2,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwj6wx",
   "message": "I'm the culprit of the 1986 pudding cup incident. Not my younger sister.",
   "created_utc": 1691246584,
   "score": 92,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwn907",
   "message": "My mum is a health nut (with probably disordered eating) who wouldn’t let us have cheese in the house when I was kid. When I was mid 20s, I bought a unit and my dad was helping me fix stuff up so I provided lunch. I said to him - bet you’re going to hate going back to work next week and not have any cheese on your sandwiches. It was then he told me his deepest secret, he had been buying blocks of cheese at work for years. I had no idea he was crafty. And my mum still doesn’t. Poor dad has been retired for years though so not sure on the current cheese consumption status.",
   "created_utc": 1691248279,
   "score": 94,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwi2w4",
   "message": "At our 6th grade halloween party I found my crushes favourite watch in the garbage bin with a broken band. Took it out, fixed it, gave it back to her. When her friend pestered me \"Why would you fix that for her??\".. I lied and said someone else told me to, not wanting to be found out for having feelings for her.",
   "created_utc": 1691246119,
   "score": 243,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwjr6c",
   "message": "I can't remember why, but I was mad at my Dad for something. As revenge I added extra chili powder and hot sauce to our family chili. Turns out my family never really added enough seasoning to the chili as it was, and the food actually tasted a lot better as a result of my revenge tactic.\n\nI've overcorrected as an adult on seasoning food at times, but I do make a mean chili.",
   "created_utc": 1691246821,
   "score": 248,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwnihw",
   "message": "I have a secret reddit account to implicitly invite goofy straight dudes to moon me.",
   "created_utc": 1691248386,
   "score": 186,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwo6ko",
   "message": "When I was 6, my older brother and I were pondering what the female versions of our names would be.\n\nI decided mine (Nate) would be Natalie, but my brother cuts me off before I could declare and said \"you think yours is Natalie, don't you?\"\n\n\"Uhhh.....no!\" I stammered back, and refused to tell him the \"real\" name.\n\nFast forward over 2 decades to today, we're in our early 30s, and somehow that convo comes back up. He laughs and says \"it was Natalie, wasn't it?\"\n\nIn my head, the ancient pride of a tinier version of me roars, and demands I refuse to acknowledge he was right. Every other part of my brain facepalms at how ridiculous a hill to die on this is, and we compromise by telling him \"What argument? Sorry I don't remember that...\"\n\nOh, I remember, dear brother. But I will never confess!",
   "created_utc": 1691248659,
   "score": 228,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwmjr0",
   "message": "One time my friend was moving and needed a toaster. I told her we were getting rid of ours, sent a pic, and asked if she wanted it. I already put it out to the curb and forgot about it so I felt bad and bought her the same model but a little used but didn’t tell her. I felt too bad to tell her I gave it away incase she was counting on so bought her one thst looked just like the pic I sent and used so it was believable. I’m not sure why I’m like this.",
   "created_utc": 1691247991,
   "score": 10,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwj88o",
   "message": "I'm Canadian, and in high school, I had a crush on this girl who was originally born in the US. To try and impress her, I pretended I was an American who immigrated to Canada too. I was so committed that I even gave her the address of my old home: it was really just a hotel I had stayed in while on vacation in Florida with my family. Since it was the early 2000s, she never verified. We didn't end up dating, but to this day, I never came clean. I wonder if she still thinks I'm an American.",
   "created_utc": 1691246599,
   "score": 84,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwsa2e",
   "message": "only my immediate family know I threw a birthday party when I was 13 and no one came. I remember sitting at the window crying, looking out for any cars to come.\n\nI never told anyone else about this, because I didnt want to seem like a massive loser, still dont. Even the kids who didnt turn up, I told them my neighbours and friends from extra curricular came, so even they dont know.",
   "created_utc": 1691250331,
   "score": 80,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwnu83",
   "message": "I intentionally bombed a math competition in middle school because I didn't like the teacher over the program or being forced to do it by my parents. I blamed it on nerves and was not asked back. 😀",
   "created_utc": 1691248518,
   "score": 105,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwt6nk",
   "message": "When my wife died, she had been working on “special occasion” letters for all of our kids.  Towards the end, the cancer had spread to her brain and she wasn’t able to focus on writing much, and when she did, it was often unintelligible gibberish.  I tried to help her by taking dictation but she said it would mean more if it was in her own handwriting and wanted to finish it.  She slipped into a coma and died after only getting through a handful of letters for our eldest child, leaving addressed envelopes only for our other two kids.\n\nI knew this would be devastating for the three kids, and possibly create conflict, so I paid a woman who specialized in calligraphy to literally duplicate my wife’s handwriting.  I gave her the content, channeling my wife’s comments she made to me about what I thought would be meaningful words to our three kids when I had helped her dictate a few.  And, as she wanted, I have passed them out on special occasions of wedding dates, birth of first child dates, first day of college dates, etc.  \n\nMy kids don’t know.  They’ve even shared the ones she actually wrote with ones written by her surrogate and thus far the secret remains safe.  I haven’t told anyone else this but Reddit and hope it stays here a secret as well.  I’ll take it to my grave.  I consider it harmless as it was her intent but cancer robs so much from people afflicted with it…including their best, most sincere attempts at helping others cope with the loss themselves.",
   "created_utc": 1691250697,
   "score": 184,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwj0pc",
   "message": "I ate sand :|\n\nListen I was at the beach and I tripped",
   "created_utc": 1691246513,
   "score": 6,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwj8i7",
   "message": "My secrets are never harmless.",
   "created_utc": 1691246602,
   "score": 6,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwnxur",
   "message": "When I was younger (15 year old) I used to secretly go down to our living room and out the back door to smoke. Our house had an alarm with sensors, including one upstairs in my parents bedroom which would start blinking if it registered movement. I was just able to watch the terminal from the backyard to the hallway to detect movement and not get caught (hopefully).\n\nMy dad, whom I lost 3 years ago due to Covid, was a diabetic and frequently came downstairs for some sweets because his bloodsugar would get too low. \n\nOne night, I went down and did the usual: slide aside the slats as quietly as possible, open door, have a quick smoke and back to my room like a ninja. Suddenly the terminal starts to flicker... I flick the cig across the fence and try to slide the slats back the way they were as fast and quiet as possible before he reaches the bottom of the stairs. No way I make it past him so I hide behind the couch. He comes down, grabs some sweets and he sits down on the same couch I'm behind. My heartbeat must have been over 200 bpm at that time, but I remain silent until he gets up to go back to bed.\n\nHe never knew I was there otherwise I might have lost him sooner, but it makes for a good laugh with my mom these days.",
   "created_utc": 1691248560,
   "score": 234,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwm98n",
   "message": "I have a sister who used to be so into baking when we were younger however, she would sometimes refuse to share the blessing of her talents with me so one day I watched her make chocolate fudge and while she was adding her finishing touches, I went back into my room and waited for her to finish so she wouldn’t think I was doing anything sus. \n\nLater that evening I found her fudge in the fridge… UNTOUCHED might I add. Idk how it happened but I ended up eating the whole thing. When she noticed it was missing she went ballistic over where it could have gone…. I helped her “look” for her fudge that day. \n\nLegend says she’s still searching for it🕊️",
   "created_utc": 1691247873,
   "score": 5,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwqyje",
   "message": "First marriage to my late wife, on the day of the wedding, the ring got stolen out of my car. I was freaking out. My two best men went into overdrive and took a picture I had if the ring and went to I don't know how many jewelry stores explaining what had happened and if they had a ring that was similar. \n\nThey went to this really great jewelry maker so said, \"I have something that is really close, give me a bit and I can make it perfect.\"\n\nHe worked his ass off and got it done with about an hour to spare, plus the managed to get my window fixed. \n\nThe three of us are the only ones who know. I ended up using that jewelry maker for any jewelry I needed and well I haven't stopped yet. \n\nHe ended up telling my best men to not worry about the price and for me to come down after the honeymoon to work it out. I did and he gave it to me at the cost of the materials. He is a great guy. He retired during COVID.",
   "created_utc": 1691249793,
   "score": 126,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwiepb",
   "message": "I once lied in a work center that the sexual harassment towards a female peer was being investigated and that they would do well to stop talking about the girl that way if they didn’t want to find themselves being investigated too. She was a friend of my wife and I, and she was bothered by how guys were talking about her. The truth was there was no investigation. But it did the trick. No one ever knew, but eventually I did tell her what I did.",
   "created_utc": 1691246259,
   "score": 14,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwj74y",
   "message": "I had my niece remind my sister that it was our mom’s 70th birthday (no party because it was the height of the Covid pandemic) after my mom lamented that my siblings hadn’t said happy birthday. I still haven’t told my mom",
   "created_utc": 1691246586,
   "score": 229,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwu4kx",
   "message": "Several years ago I was in a new relationship.  In my grogginess in the morning while still in bed, I forgot my boyfriend had slept over the night before and I just let one rip super loud. Instantly, he is awake.  The bed creaks and I remember he is there and am somewhat mortified until  he nearly immediately tells my dog, also in the bed, that he will take him outside to poo as I pretend to still be asleep. He takes him outside and later when I am awake, he tells me about my dogs crazy fart.  I let my pup take the fall.",
   "created_utc": 1691251070,
   "score": 112,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwylvb",
   "message": "I convinced my sister I had entered us both in a blog giveaway, I won a coupon but she won the grand prize , a $300 gift card to Lane Bryant.  My sister was a size 16, and desperately needed new clothes but would spend money on her baby grandkids and thin adult daughters. This was the only way I could make sure she spent it on herself. It’s been 10 years. She’s doesn’t know.",
   "created_utc": 1691252836,
   "score": 23,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwsc04",
   "message": "I bought a decommissioned fire cheifs vehicle from the Richmond fire department auction and got them to \"donate\" it to my grandmother. She never would have accepted it if it came from a family member.",
   "created_utc": 1691250353,
   "score": 39,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwza63",
   "message": "My friend is a major, major, Death Cab for Cutie fan. They came to our city a couple years ago, and I knew she wouldn’t be able to afford the tickets to go. She was upbeat about it, but I know she was devastated by it. \n\nI bought tickets. Two days before the show, I told her that the friend I originally planned to take couldn’t go, and would she please come with me? There was no other friend. Told her I loved the band and would be sad to miss them. She of course accepted, and had the time of her life. \n\nShe’s doing much better now, but every couple of Christmases or Birthdays, she gets me some Death Cab merchandise because “she knows how much I love the band.” \n\nI can’t stand their music. I literally have them blocked on Spotify. But now it’s gone too far where I can’t tell her.",
   "created_utc": 1691253109,
   "score": 142,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwqx0j",
   "message": "Every thanksgiving in San Luis Obispo my best friend and I are in charge of pies. We go to the Madonna Inn, a gloriously outlandish hotel/restaurant/bakery/resort, and ask for two of their pie boxes. We then go to Safeway and buy two much cheaper pies and put them in the boxes. We bring them to our large family gathering and everyone compliments the wonderful pies because of how amazing the Madonna Inn’s reputation is for baked desserts.\n\nI’d like to say this is because of concerns about cost or because the Safeway pies are better, but the truth is my bf and I have been doing this for about a decade now and it’s just become one of our favorite traditions together.",
   "created_utc": 1691249776,
   "score": 186,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwiqbc",
   "message": "I once paid my mom's phone bill when I knew she was low on money. I got on her account on her phone while she was doing other things and I know her passwords so it was pretty easy, added my card as a one time payment only so it wouldn't save to her account and paid. She figured she just forgot she paid it and that's why she thought she was low on money. (My mom is ADHD and so am I, so forgetting stuff is very common.)",
   "created_utc": 1691246394,
   "score": 72,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwp69t",
   "message": "I once told a girl I was dating I loved the dish she cooked for me.  In reality, it was terrible.  25 years later, my wife is still cooking it at least once a month because it's my \"favorite.\"  I've never been able to tell her, but now I've let my 8 year old daughter in on it.  She'll prance up to my wife and say \"Let's cook Daddy's favorite tonight!\" Then she turns around and looks me dead in the eye with a shit-eating grin on her face.",
   "created_utc": 1691249063,
   "score": 216,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwvhiy",
   "message": "In kindergarten, some kid I didn't know too well took one of those plastic clips that hold bread bags together, snapped it in half and gave me one of the pieces, saying \"This is your key to the magic door, and this one is my key to the magic door.\" And then he left.  \n\nThat seemed reasonable to me, so I took it home and poked it into any properly-sized indentation I could find, to try and find the magic door that it unlocked. After accidentally unscrewing a couple of outlet covers from the wall, I eventually got bored, and lost the key somewhere. But a few days later, it hit me: I had just *taken* that crappy half of a plastic tab from the kindergarten without asking a grown up. That was stealing! I was a pretty straight-edged kid, so stealing anything at all was about the worst misdeed I could imagine. But here I was, having outright robbed my own school of this valuable object, and nobody even knew about it.  \n\nAnyway, I resolved to never tell anybody about my horrible crime, and it has remained a secret until this very day. I hope all of you out there can forgive me.",
   "created_utc": 1691251598,
   "score": 85,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "jux64sb",
   "message": "When I was about 16 or 17 I wanted a cat so badly, and my mum had consistently being saying nope all my life. \n\nSo I went in the classifieds at the back of the newspaper, found someone giving away free kittens, and I went and got one.\n\nWhen my mum came home that day, I told her that I met a man down by the docks with a cardboard box full of kittens, and he was going to throw it in the water if he couldn't get rid of them. So I took one. \n\nShe did try to give her away a few times to various friends, but nobody wanted a kitten, and she got attached to her. To the point that she wouldn't let me take her with me when I moved out for university. \n\nShe loves telling that story of how we ended up with a cat that I wasn't supposed to get, and that sweet baby lived to be almost 20 in the end. She brought home many mice and birds, and once, a weasel. \n\nI named her Turnip, after Baldrick's turnip in Blackadder. \n\nRIP Turnip. You lived a lie, but you were loved, and your fake origin story continues to delight at the dinner table!",
   "created_utc": 1691255776,
   "score": 20,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwkwdv",
   "message": "I was seven and we were moving from one farm to a bigger one. Mom was taking garbage out to the burn barrel and burning it. In the rural eighties we just burned everything. I started looking at the fire when she went back inside and discovered a burning ice cream lid. I picked it up and threw it like a frisbee and it did a nice arc and landed right at a large stack of hay that was quite a ways away. I was horrified and went running in and told mom some paper had floated up and onto the hay. Other than the huge stack of hay burning down there was no harm done. It was old hay anyway that's why it wasn't stored in the barn.",
   "created_utc": 1691247308,
   "score": 45,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "jux0d7u",
   "message": "When my friend moved into her first apartment, she didn't have any tools for basic repairs. I spent a few hundred on a toolbag, socket set, screwdrivers, cordless drill, wrenches, level, etc. Took everything out of the packaging and gave her the bag of tools. I told her they were my extras and showed her how to do some of her repairs. She still doesn't know everything was brand new and, frankly, nicer than my own toolset.",
   "created_utc": 1691253541,
   "score": 237,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juws6d6",
   "message": "At university, my best friend and I went to the bathroom on a night out, and as we were using the urinals he exclaimed how Greg (a slightly older guy at the same school) was such an asshole. I pointed to a cubicle and mouthed how Greg was inside. \nMy friend went bright red and died inside, and permanently avoided Greg for the rest of our time there. \n\nJust the other day, about 5 years later it came up and I had totally forgotten. I finally told him I’d made it up.",
   "created_utc": 1691250288,
   "score": 27,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwzyoh",
   "message": "One day I came home late at night drunk and decided to walk my dog. Just when we arrived outside my house my dog attacked a racoon hanging around the area. I ended up wrestling my malamute and freed the racoon from his jaws. \n\nHere's the thing. I was drunk and the racoon kinda just stared at me infront of me and I decided to try and pet the racoon. I got maybe one pet in before it took a chunk out of my finger. I ran into the house leaving a trail of blood up to my brothers room for help. A sleepless night in the hospital and 4 consecutive rabies shots later was the result.\n\nEveryone asked me what happened and I just told them while I heroically wrestled my dog to save the racoon I got bit in the process. They still don't know the real story. It still gets brought up 10 years year.",
   "created_utc": 1691253381,
   "score": 156,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwwx32",
   "message": "I was about 10 years old and was pretending to be sick to avoid going to school. This was the 1980's so the old-school, glass tube, mercury-filled thermometers were still a thing.\n\nMy dad was getting ready to leave for work as I worked my magic to convince my mom to let me stay home for the day. Neither one of them was having it. I persisted.\n\nOut of frustration, my mom grabbed the thermometer and put it under my tongue. I knew it would read 98.6 and this was my only shot to avoid school for the day.\n\nBoth of my parents stepped out of the room for a moment. I looked over and saw my dad's piping hot cup of coffee sitting on the counter awaiting his morning commute. I quickly dipped the thermo into the hot java.\n\nIt instantly shattered emptying the toxic mercury into the coffee along with tiny shards of glass. I panicked. In my mind, there were only a couple possible outcomes. My dad dies of heavy metal poisoning and a lacerated esophagus. Or, I fess up to what I did.\n\nI could hear them coming around the corner about to return to the kitchen. At the last possible second, I swatted my dad's mug off the kitchen counter smashing it on the floor creating a coffee explosion in my mom's freshly cleaned kitchen.\n\nThey burst in the kitchen aghast at the mess I created. I reply with a flurry of sorrys and apologize profusely for being clumsy. My dad is furious because now he won't have coffee on his way to work. My mom is pissed and she starts cleaning up the mess.\n\nIn the chaos everyone forgets about my claims of illness. I slipped the remainder of the broken thermo into the trash and went to the bus stop saving my father from a horrible death--at least in my mind at the time. Until this day, I have never told anyone about this.",
   "created_utc": 1691252161,
   "score": 255,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "jux6q0z",
   "message": "I used to be a Jehovah’s Witness (I was raised that way- I did not join by choice lol) and when we went door-to-door I used to pretend to press the doorbell so I didn’t have to actually bother anyone and talk to them.",
   "created_utc": 1691255994,
   "score": 56,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "jux02fq",
   "message": "Man. My secret story is not as heartwarming as the others on here. But I feel like writing it out anyhow. \n\nMy little sister loved dragons and collected little inexpensive statues and toys. I was 15 years old and had my first job working at Friendly’s. I saved up my money to buy her something way out of my price range for her birthday - it was this tiny statue (over $100! A fortune for a teen) because it was adorable and perfect - a dragon just coming out of an egg. I was so excited to give it to her. \n\nMy mom, who honestly has a novel’s worth of issues, had no money and hadn’t planned. Two night’s before my little sister’s birthday she told me she hasn’t gotten her anything at all, so I gave it to my mom to give to her. It made me sad not to have much of a present for my sister (I gave her a card and some candy), but I knew her heart would break if mom gave her nothing. 30 years later and I still haven’t told.",
   "created_utc": 1691253422,
   "score": 252,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwqhwu",
   "message": "I always knew my firsts boyfriend is gay, and still I agreed to be his gf at the time. He never told me that during the time we were together, and I've never initiated the conversation. We're from very conservative country so I understand he was just super scared to come out, or even acknowledge he's gay. We have never done anything sexual, but we could spend a lot of time together as friends and it was awesome. We were 14-15 at the time. He came out to me a few years later and I never said anything. Many people  tried to make me a victim on the way but I'll protect this guy to the day I die. We love each other, his my family even tho we don't talk as much anymore (I live in another country). Totally pure and awesome man. I'll always support him.",
   "created_utc": 1691249605,
   "score": 243,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwtmhn",
   "message": "When I first met my wife's 93 year old grandma about 13 years ago, she had me try her holiday dish 'congealed salad'. It's basically lime jello made with condensed milk, and it has pineapple, walnuts, marshmallows and celery mixed in, and it is poured into a bundt cake pan to set. It's a terrible, old timey southern dish. She was so excited to let me try it that I panicked and said it was amazing. She absolutely lit up, and every year since then, she has exponentially increased the amount she makes because she knows \"how much I love it\". The bundt cake pan has long since been replaced with a literal punch bowl. The rest of the family knows I hate it, and it's just silently accepted that I will eat huge amounts of it each year instead of telling her the truth.",
   "created_utc": 1691250870,
   "score": 8,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwqxai",
   "message": "I have a friend who sometimes goes through some hard times financially. They’ve had a pretty tough hand dealt to them in life. Smart as hell but one of those people who it seems always has something going wrong. It culminated with them losing a leg in a car accident that was entirely not their fault. Two seconds on either side and they’d have been fine.\n\nAnyway, over the years I’ve secretly given them cash and gifts, all online, all anonymously. Anything from paying for a year of LiveJournal back in the day to buying stuff off their Amazon wishlist, to anonymously sending money to a Patreon they have for some of their creative work. Why anonymously? Well, we tend to like each other but we have some very differing views about the world and have bickered in the past (nothing like MAGA vs. sanity.. we’re just both highly opinionated). They take a pretty negative view of the world and I don’t blame them. But by having an anonymous benefactor I hope they somewhat realize that there’s some good in the world that’s there just for doing good. I’ve never told a soul about this other than this post.",
   "created_utc": 1691249779,
   "score": 101,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwwtz4",
   "message": "I worked at a place that didn’t like to give raises. In an effort to justify it they would write people up for nonsense around review time and fill people’s employee files with petty write ups. I would go into work early and purge the files removing anything negative",
   "created_utc": 1691252127,
   "score": 163,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "jux6nnq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "jux5udq",
   "message": "My daughter lost her favorite stuffed animal and was devastated. I went online and found a replacement on eBay for an insane price because it turns out her stuffed puppy was a collector’s edition (fml) and the one I found was in mint condition. \n\nI then rubbed it in dirt, washed it a few times, and ripped off its leather on its nose and filled it in with black permanent marker, all so it matched the one she had. We then told her that her puppy had been found and the joy on her face made the expense and time it took crafting it well worth it. \n\nShe is thirteen now and still keeps her puppy on her bed. I plan to take this to my grave.",
   "created_utc": 1691255666,
   "score": 148,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwyvvl",
   "message": "When l was 10 and my younger brother was 5; l pranked him and scared him so badly he shit his pants.  \n\nHe cried and l felt so bad that l cleaned him, his pants,  and the place in the hall where he shit.  \n\nI never told anyone. (At 10 years old,  that shit would have been hilarious to friends and family)",
   "created_utc": 1691252951,
   "score": 195,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwyruq",
   "message": "My freshman year of high school, my math teacher was a young lonely woman. To be fair, she overshared a little bit and indicated to us that she really wanted to get married but couldn't find anyone.\n\nSomehow, these immature freshmen all let it go. They never made fun of her. Nobody ever did. Literally zero jokes were ever made at her expense. At least, not that I ever knew about.\n\nThat was the state of affairs until my senior year, when the school hired a new math teacher for seniors. He was roughly the same age as my freshman year math teacher. And he gave off Sad Lonely Guy vibes. But nobody ever made fun of him either (somehow).\n\nAbout halfway through my senior year, I was wandering around the halls during class for some reason or another. I passed by the freshman teacher's classroom and stopped. There, I saw the two of them standing together in her classroom. They were holding hands, making googley eyes and smiling at each other. They never saw me.\n\nI started walking again, determined to act like I saw nothing. I never told anyone because I was concerned that if those teachers hadn't been made fun of for being unhappily single (which was sort of a miracle), then their luck could run out now and they might be subjected to inappropriate jokes for FINALLY meeting someone. And I didn't want that.\n\nAfaik (which isn't saying much), their relationship never became public knowledge while they worked together at the school.",
   "created_utc": 1691252904,
   "score": 6,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwsay1",
   "message": "If anyone was at the Hyatt Regency in Columbus, OH right before the Origins Game Fair in 2018, I have your white noise machine.  You left it in the hotel room.  I didn't even realize for half my stay...I was like \"oh this is actually really convenient!\" figuring it was just a new thing the hotel was doing.\n\nThat is, until I visited my friends' room, where they didn't have one...then noticed I could unplug the one in my room, and realized it must have been left behind.  I told the front desk about it, but they insisted it didn't need to be moved to a lost and found.  Told them to tell me if anyone called looking for it, but no one did.\n\nSo, thank you, forgetful stranger, it has actually helped immensely with my sleep.",
   "created_utc": 1691250341,
   "score": 230,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "jux2xhp",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwsf0a",
   "message": "Every Christmas I would write a fake “Christmas newsletter” (like those letters some people send every year with updates about their life, family, etc) and send it to my parents. I made up this guy who was a huge blowhard, but believable enough that my dad thought maybe he had worked with him at some point in the past.\n\nI had a spreadsheet to keep track of his job, wife, children, grandchildren, holidays, etc. so that I could stay accurate from year to year. My parents would get so annoyed at his arrogant writing style but I was really proud of it lol! It went on for 6 or 7 years but then his twin granddaughters graduated high school and I stopped.",
   "created_utc": 1691250387,
   "score": 9,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwyo9g",
   "message": "My parents bought me a book of world history when I was a child.\nIt had beautiful illustrations.  \nThey know it was one of my favorite books growing up.   \n  \nWhat they don't know is the fact that those beautiful illustrations were frequently of naked women was a significant factor in it being one of my favorite books.  \n  \nI did wind up with a life long love of reading and history, so mission accomplished?",
   "created_utc": 1691252865,
   "score": 161,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "jux7qgf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juxkthr",
   "message": "My mom was a meth addict. So my siblings and I grew up with very little. Normally she would pull her head out of her ass enough around the holiday season to sign up with a church or charity to get us a food box and some presents. However by the time I was 11 she was so far gone we could go weeks without seeing her leave her room or her be completely gone from the house. I entered a drawing contest at my school around this time. I won a $100 gift certificate to our local mall. One day after making sure my siblings made it to school I played hooky and walked to the mall(about 3.5 miles) I bought my three siblings some presents(almost for got to get myself something ended up buying some discounted bodywash) then had them wrapped there at the mall before trekking home. I hid the presents in the crawl space till the 24th(I was right our mom did nothing) when my siblings were distracted by a movie I snuck out and put the box of presents on the front porch before knocking and running away. I snuck back in the back door by the bathroom and heard my siblings yelling \"someone left a box on the porch that says merry Christmas\" I had also spent the last week before winter break going door to door asking for canned food donations saying it was for a food drive at my church(I didn't have a church) so that we didn't spent the whole winter break hungry. \n\nI'm so glad all 4 of us made it out of our childhood and not one of us took the same path as the woman who birthed us\nEdit:spelling",
   "created_utc": 1691261361,
   "score": 203,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwtpg1",
   "message": "My parents didn't want me to learn to ride a bike until I turned 8, but I really wanted to learn, so I snuck into the garage when they weren't paying attention and the garage didn't have cars in it and rode my sisters bike in circles and crashed into things until I figured it out. Then I would sneak out and ride around the neighborhood for 2 years, and no one had any idea I was gone (it was the 80s, being a kid was different back then).\n\nThen, when I was 8, they bought me a bike for my birthday, and I was so excited, I forgot the secret, jumped on and rode off expertly. \"Wow, Magic, you're really picking that up fast!\" I realized what I had done and pretended to fall off, and then had to \"re-learn\" for them before I could go riding.",
   "created_utc": 1691250902,
   "score": 52,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwvsge",
   "message": "My last day at the restaurant I worked at in college, somebody broke into two workers’ cars. $2000 total was stolen.\n\nOne, a guy whose car broke down and was in the shop, and he was borrowing his friend’s car.  His cash was to pay for his own car.\n\nOne, a single mom who was saving up for her community college tuition for the next semester. \n\nBoth completely broke down in the office when they learned about it. I was closing that night, so I went into the manager’s office when it was just the two of us, and pulled my own cash savings for the month (about $1400) and split it 600/800, asked the manager to put them in unmarked envelopes and give them to the servers on their next shift. \n\nI never saw a single person from that restaurant again. I checked the guy server’s Facebook a couple days later and he had posted “God is so good” so I know he got the money. I have no idea where they’re at now, but I hope they’re in better places.",
   "created_utc": 1691251719,
   "score": 110,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juwwfwt",
   "message": "I was playing checkers when someone taught me what stealing was. Board games at day care had missing pieces sometimes so I asked where some went. My friend told me they were probably stolen. At any rate I learned what stealing was and I took one checker. I kept it in my pocket until I got home and put it in my little kid safe my grandma bought me. Then the next day I took it out and brought it back because I was so scared I would get into trouble for stealing. I haven’t told anyone.",
   "created_utc": 1691251973,
   "score": 113,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juxexur",
   "message": "My wife lost one of her favorite pair of gold earrings her parents gave her. She could not find the other after weeks of trying.\n\nIt had sentimental value as it was a 16th bday gift,  so I knew she’d never want another set. \n\nSo I took the one she had around our big city to jewelers and shops until I found a matching one. Eventually found one, bought the pair. Dirtied it up at home and let her “find it” in her sock drawer.\n\nStill have the other hidden in my desk in case she loses the other.",
   "created_utc": 1691259081,
   "score": 138,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juxp0ys",
   "message": "My son was really into digging holes when he was 6. Had a 3ft deep one going in the yard because he was convinced he was on top of some old ruins. Kept bringing small old things into the house that he was so excited he discovered, and displayed them in his room after cleaning them.\n\nTo this day, he doesn’t know I’d been going to the flea market every Saturday and buying small bits of old looking junk and planting them in the hole for him to find.",
   "created_utc": 1691263055,
   "score": 79,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "juxepst",
   "message": "My best friend in high school worked hard after school and on weekends in a butcher shop to earn money. He had healthy savings balance and really wanted an Xbox so we could play Halo, but his parents wouldn’t let him buy one even though he’d earned more than enough on his own.\n\nI knew HTML, so I made a fake website for a Australian gaming magazine advertising a competition to win an Xbox. He “entered the competition” and “won” it. We faked the email telling him he’d won. We bought an Xbox from the local store, and went straight to the local post office and faked the sender’s address on the label. Two days later, it turned up at his home. \n\nHe showed his parents the website, the email and the postage and they believed him. We spent the rest of the summer hanging out playing Halo. So good.",
   "created_utc": 1691258997,
   "score": 117,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "jux5rli",
   "message": "When I was 20 I moved into a flat with two 30year olds that were really selfish. They were charging double price for the 4th room (now that I think of it I was probably charged more than they were paying too) in the house so they both could pay less for their own rooms. \n\n\nI wanted to have a friend there to feel less alone and my guy mate was first year apprentice on low wages . I told him it was way cheaper and he moved in. I told the 30 year olds I would pay half his room if they let me have a friend move in. \n\nSo yeah he got subsidized rent because I needed a companion after a bad break up. I ended up dating his best friend and us three moved out into a better place without the 2 people who just wanted flatmates to make money off and I married his best friend and he is now a qualified electrician making shit loads of cash so we all win 👍🏼",
   "created_utc": 1691255639,
   "score": 89,
   "submission_id": "15isppg"
  },
  {
   "comment_id": "jv0qu38",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15isppg"
  }
 ]
}