{
 "submission_id": "15iuc5p",
 "title": "\"People of Reddit, what's the creepiest encounter you've had with a complete stranger that still gives you chills?\"",
 "selftext": "",
 "created_utc": 1691238178,
 "permalink": "/r/AskReddit/comments/15iuc5p/people_of_reddit_whats_the_creepiest_encounter/",
 "score": 20,
 "url": "https://www.reddit.com/r/AskReddit/comments/15iuc5p/people_of_reddit_whats_the_creepiest_encounter/",
 "comments": [
  {
   "comment_id": "juwfnwk",
   "message": "I was alone at the gas station when a guy in a brown suit holding some container of pink liquid came out of a white panel van and walked over to me.  \n\nHe told me that he was selling the liquid as some kind of carpet cleaner. I still lived at home and had no need to add to my parents cleaning supplies. Especially since this was an unmarked container that looked like paint remover.  \n\nI explained this to him while just having a bad feeling in general. I don't know exactly why, but my Spidey sense was tingling.  \n\nHe asked where I was going and I exaggerated a board game night at my friends into a \"party\" at my friend's house. He smiled and said, \"I bet you get all the girls at a party like that.\" (I didn't.)  \n\n\"I used to be like that when I was younger,\" he continued. Then, something changed in his face and my internal danger sense lowered. \"We're cool, man,\" he said as he smiled at me and closed himself back into the panel van.  \n\nIt could have been a face value interaction, but to this day I feel like it would have been a big problem if we weren't cool by the end of the conversation.",
   "created_utc": 1691245090,
   "score": 46,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juw8ccl",
   "message": "I was in Vienna during Christmas break. There is a large open air market in the middle of the city and thousands of people were milling about, eating, drinking, and shopping in the evening. \n\nA very attractive blonde woman with light blue eyes bumps into me, and in accented English apologizes. I said ‘No worries’ and we started chatting. She says she’s from Poland and she’s here for New Years visiting a friend. I mentioned I’m American but Polish in heritage and we continue to talk for several minutes. She says that she’s hungry and wants to get food. I offered to buy her a slice of pizza at a booth. I get one for both of us and she takes a bite and says she doesn’t like it and wants to go to a place away from the town center.  \n\nSomething about how quickly she rejected the pizza, which was quite good, set off alarms and I wished her a pleasant evening and walked away.  I looped around the town center and coincidentally saw her walking down an alley with two large men, one on each side of her…very quickly I realized that she was bait to draw me into an alley so they could mug me. \n\nI definitely dodged a bullet that day.",
   "created_utc": 1691241997,
   "score": 110,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwrls4",
   "message": "I was in a grocery store doing my weekly shop, and was approached by a man who said I was pretty and asked for my number. No intros, no asking me how I’m doing, just getting straight to it. I politely declined and said I wasn’t interested. He became persistent, so I ended up telling him to just give me his number so I could end the interaction. \n\nAfter he gives me his number, I go back to shopping without incident (or so I think). It turns out that this man was keeping an eye on me from the dairy section as i was walking up and down the aisles. As I’m getting ready to head to checkout, he decides to approach me again. This time, he’s super agitated and raises his voice while asking why I won’t just give him my number. I decide to be direct, and tell him that I said I wasn’t interested, and I will not be giving my number to a stranger. He really had an issue with it, became irate, and had to be removed from the store. I was walked to my car, and he ended up following me out of the parking lot. \n\nI was on my street when I noticed I was being followed, drove past my house, and started driving towards the police station in my city. He followed me until he realized I was turning into that driveway, and then sped off. Luckily I haven’t seen him since.",
   "created_utc": 1691250054,
   "score": 97,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwkrqe",
   "message": "Driving across the country with my wife and dog, we stopped at a gas station around midnight. I was coming out of the bathroom, and I saw the guy mopping the floor had stopped, and was just staring out the window at my wife, who had finished letting the dog pee and was slowly walking back to the car. \n\nThere was a super creepy guy slowly sneaking up behind her. He was like 20 feet back, but quietly getting closer, and my wife had no idea. So I got out of the gas station real quick, and loudly went over to them, hugged the dog said let's get going, etc. The second I walked over to them the guy turned around and ran away. \n\nMy wife never knew there was a guy sneaking up behind her until I told her once we got back in the road.",
   "created_utc": 1691247254,
   "score": 44,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juw9duc",
   "message": "The guy at the Big E peeing next to me said \"nice dick\".  I was 12.",
   "created_utc": 1691242454,
   "score": 190,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwj8pg",
   "message": "I was walking my dog along the canal path on a chilly winter day when I noticed a man on a bike peddling towards us. I moved over to let him pass and noticed he was a little odd looking. Long straggly hair, mismatched clothing, sandals on his feet and pink ribbons were tied on his handlebars. As if that wasn't enough, he had a wicker basket on the front of his bike with a radio in it. The radio was playing that creepy tiny Tim song, tiptoe through the tulips. He half stopped, said hello and saluted me. I said hi and saluted him back. He grinned and said ' Don't go the way I've just come, I'm expecting trouble.'\nI didn't really know what to say so I said thanks and he cycled away. \nIt was all a bit strange and off, so I did what he said and walked back the way we'd come. I've never seen him again.",
   "created_utc": 1691246604,
   "score": 137,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwavx3",
   "message": "Ya'll are about to be in one of those AI narrated reddit videos on youtube",
   "created_utc": 1691243099,
   "score": 199,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwalsj",
   "message": "I was at work helping a customer when he told me “you look like you could be raped”. My male boss didn’t understand why I didn’t want to walk to my car by myself that night.",
   "created_utc": 1691242979,
   "score": 128,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juw1b2g",
   "message": "I once met someone on the sidewalk that knew my name, my parent's and siblings' names, where I lived, and what I did for a living. Every time I asked him \"where do I know you from?\" he'd avoid my question and spit out another fact. He didn't look in the least bit familiar. When I raised my voice in frustration, he just patted me on the shoulder while smiling and told me to take care. If that was a prank, I never found out who set that up. I was suspicious of my coworkers so I acted normal when I went to work. Never found out the reason. I'm starting to think it was one of those people with super memories that you only meet once and forget about them. Cause I'm not important enough to get spooked by an undercover agent.",
   "created_utc": 1691238534,
   "score": 24,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juw1o1m",
   "message": "When I was 5 I was playing by the road in the yard and a lady pulls over and starts talking to me. My mom runs up and grabs my hand and the woman says how much I reminded her of her dead son, I thought I was gonna get kidnapped",
   "created_utc": 1691238738,
   "score": 210,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwlxqs",
   "message": "walking down hastings in vancouver someone stopped me and vigorously tried to sell me a water bottle full of blood.",
   "created_utc": 1691247742,
   "score": 17,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwvztz",
   "message": "So, I went to this music store to buy some strings for my violin. Because it was a five string (both an E, the highest on a violin, and C, the lowest on a viola) I had to buy a pack for a violin and the C string separately. (I know this is boring but it is all relevant I promise) When I go to pay, the clerk helps put the C string into the other pack and hands it to me, without ringing it up, and I put it in my case and zip it up. The next day he shows up at my door, having looked up my address, saying he can get me arrested for theft and it was on the cameras. Not sure how he thought he could turn that on me when it was clearly just neglect on his part, but the fact he actually went that far to cover his own ass was pretty damn disturbing. Not very eventful compared to a lot of other stuff on here, but I thought I'd share it anyway.",
   "created_utc": 1691251798,
   "score": 207,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwu1uy",
   "message": "I think I accidentally did one of these to a stranger before.  I was working at a mall in a state where marijuana was illegal.  I was buying from one of my employees, and we would regularly meet in a secluded corner of the parking lot to exchange.  One night after closing, I'm driving around to the spot like I had done a hundred times previously and see her car.  \n\n\nSpontaneously, I decided to be a goofy goober.  I pull in the spot on the right.  My arms locked at 10 and 2 o'clock, my gaze forward, I sit motionless for a good 10-15 seconds before doing a super exaggerated head turn / neck whip to the left and chanelling my best Jack Nicholson Joker grin.\n\n\nI had the wrong car!  I'm a middle-aged, bald, white dude driving a shitbox Honda Civic and the young black lady I did this to looked so terrified.  I think she was having a heated phone conversation but her survival instincts kicked in real fast and she zoomed the fuck out of there.  I learned my lesson, though. I'm too old to be buying drugs at night anymore.",
   "created_utc": 1691251040,
   "score": 206,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwi91z",
   "message": "\"You think I won't catch you if you run?\"\n\nA 40-something drug addict told me this after asking 13 year old me for change. I told him I didn't have any and guess I looked scared. I did run back home as fast as possible but he didn't chase me, thankfully.",
   "created_utc": 1691246192,
   "score": 35,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juw51wf",
   "message": "I’ve been on vacation recently in Thailand and I was walking with my 12 year old cousin in the middle of the night to go buy some snacks from the grocery. I left the store for a couple of mins to answer a phone call and when I got back a white man was standing next to him asking him if he wanted to smoke weed so I just walked infront of him and blocked his view from my cousin and told him to leave. While we were walking back to the hotel I could feel someone behind us and kept looking back every now and then. When I entered the lobby of the hotel I saw him walking away from us. That 10 min walk back to the hotel, I was so scared and creeped out that he’d do something to us.",
   "created_utc": 1691240514,
   "score": 175,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwgvfm",
   "message": "So, about 15 years ago, I lived in Jerusalem. One night, I'm on my way home, and I see this guy, long hair and beard, just staring at me as I walk past. Never blinking. \n\nNow, when you live in Jerusalem and someone is being dodgy, your first thought is \"terrorist\". So I tense up, start to walk faster, getting ready to run if I need to, when suddenly he calls my name. \n\nI turn around, and I look at him better, and I have no idea who that is. This guy looks homeless. So I say \"sorry?\", thinking I misheard, and he didn't say my name after all, and he goes, \"yeah, it's you!\". And he starts to laugh and walks away. \n\nTo be honest, I never thought of it as creepy, just weird, but when other people hear the story, they seem to think it is creepy. \n\nI just always wondered if he was like a schoolmate of mine that I just don't remember, and that has fallen on some rough times. 🤷‍♂️",
   "created_utc": 1691245604,
   "score": 137,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwpyi3",
   "message": "When I was a kid, around 6 years old , My folks and I were eating at a fast food joint called Rax’s (Arby’s type place in the 80’s) and there was this creepy old man in there eating that was laughing maniacally. It freaked me the fuck out. This guy had a very uncanny way about him and I just froze, couldn’t eat and could hardly speak,  I was absolutely petrified. To this day I still get the chills thinking about that old dude.",
   "created_utc": 1691249385,
   "score": 47,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwuq60",
   "message": "When I was about 5, I saw a lady wearing old timey clothing walk into our church. I thought she looked like a witch and was scared. She came right to the kid section and asked our Sunday school teacher if she could teach the kids. Nobody knew her, this was a small church. Our teacher obviously declined, and the lady became grumpy and left. It always stuck with me as the first time I got bad vibes from someone. Never saw her again.",
   "created_utc": 1691251303,
   "score": 59,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwtdhw",
   "message": "It doesn't give me chills but I do reflect and wonder what would have happened. \n\nWe had just moved from Illinois to Florida. I had just turned 12, so this was '86. It was a weekend; I don't remember the specific day. I got up early and went to the basketball court in the apartment complex I lived in. Started playing and this hatchback pulls up. Guy gets out of the car and asks if he can shoot around with me. He's talking to me, don't remember the actual conversation. I do remember him telling me that he had a job interview and needed to borrow a comb. He asked me if I had one and I told him yeah. He asked to borrow it and I said sure, I just need to go grab it real quick. He said that he would drive me and I told him, \"no, that's ok. I live right over there and I could walk\". He was pretty insistent on giving me a ride. Finally I just told him that I'd be right back. Went towards my house through the courtyard, but never went there. Waited around the corner to see what he was doing. One of the older girls that I played ball with showed up. He left a couple minutes later.\n\n Coming from small town Illinois, I was pretty naive. But that whole thing felt off. The dude didn't bother me; just the insistence on him giving me a ride.",
   "created_utc": 1691250772,
   "score": 136,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwv0u7",
   "message": "I was in high school. A man flashed me in the parking lot with no one around nearby. Turned out he was one of my classmate's dad.",
   "created_utc": 1691251419,
   "score": 230,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwmp86",
   "message": "At 16 I was admitted into adolescent psychiatry for a few days (due to my mom setting me up) even had a staff member tell me you don’t belong here why are you here? Anyway…I was admitted at night and they gave me some drug to calm me down due me being furious from it..there was no available dorms so they trusted me enough to put me in a guest type hospital like room that actually I was able to wake up and walk to front desk, immediately this Jamaican chick about my age walks up to me says give me your hand, ( I did I actually thought she was a staff member) and she says none of us belong here, please understand god works in different ways, and your dad wants you to know he loves you and is watching you. My dad passed when I was 5. I asked how did you know she just smiled and walked away. Found out she was a patient. I still think about it",
   "created_utc": 1691248055,
   "score": 114,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwqhni",
   "message": "[deleted]",
   "created_utc": 1691249603,
   "score": 38,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juws7tw",
   "message": "My cousin and I were walking through Waikiki a few years back and we laughed about something pretty loud. A homeless man imitated our laughter in an almost caricature way.. but then kept doing it and began running towards us (from behind), laughing in the same way we did but getting louder and louder.. we started running because at this point he was in a full sprint. No idea what the fuck that was about. \n\nOutside of that, my cousin and I were maybe 9 or 10 and were playing in the yard at my grandmothers house. Blue van pulls up on the side of the road, no windows.. and two guys get out with it still running and start walking towards us.. we ran inside the house and got an adult.. and they peel off.. I 100% believe they intended to kidnap us.",
   "created_utc": 1691250306,
   "score": 12,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwvmra",
   "message": "I was 7.\n\nOne of our neighbors was walking while I was playing in the yard. She asked me some questions. My Mom came out and spoke to her. Everything seemed normal. My Mom went back inside.\n\nNow I was playing with my dolls outside. Typically little girl playing with her baby doll.\n\nShe leans in and starts talking to me. She says something like “you could be my little dolly. I’ll dress you. Change you. You can be my pretty helpless doll”\n\nThen I remember her giving me a kiss.\n\nI freaked out and ran inside. My mom came out talked to the lady and didn’t believe me.",
   "created_utc": 1691251654,
   "score": 159,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwwue8",
   "message": "I saw one guy randomly kick another guy at a bus stop for no reason then a woman across the street started yelling at him about it. Anyways I high-tailed it out of there before he could start kicking me too.",
   "created_utc": 1691252132,
   "score": 73,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwjsik",
   "message": "Pretty sure I was almost abducted as a 9- or 10-year-old. I showed up at a neighborhood playground, and it was empty except for a man standing there. He called out to me, and I came a bit closer. I don't remember having a real concept of \"stranger danger\" like they teach it, but I knew something was fishy. He said he \"just found these basketball cards!\" and wanted to give them to me. But the pack was clearly just freshly opened by him. (And furthermore, I collected baseball cards, not basketball. If they'd been baseball cards, who knows what kind of danger I could have gotten in.) I declined. He insisted. I declined again. I turned with my little bike and got out of there. As far as I know, he didn't chase after me or anything. I don't think I fully understood the danger I was in. I didn't even mention the encounter to my parents until years later. I filed away the memory, and then years later it popped up and a lightbulb went off.",
   "created_utc": 1691246837,
   "score": 194,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "jux0529",
   "message": "when I was 13 I took the bus to the local Walmart, and as I was approaching the store a woman stopped me and complimented the bag I was carrying. it was a hippie looking bag I'd borrowed from my mom, and I thanked her and told her just that, that it was my mom's. she complimented me for being \"real\" about that and then offered for her and her husband to give me a ride home. I felt really uncomfortable, and said no (I'd also just arrived at the store and hadn't even had a chance to go in). she gave me a business card (for some kind of car related business, like a mechanic) and told me to email her, and I went on my way. I never did email her, whole thing made me uncomfortable as hell. really felt like I almost got trafficked or something.\n\nthe other one that sticks out in my mind, I'm not even sure if it was real or if I can describe it in a way that does any justice to how bizarre it felt. I was probably 8 or 9, and I lived in a small apartment complex. I strapped on my roller blades and was gonna head out to skate around the complex, as I often did. I rolled down the sidewalk away from our door, and looked down the long, straight pathway that was just on the other side of the wall our door was on. at the end of it, a good few hundred feet away, I saw what looked like an old person dressed in a white formless garment. they looked... wrong somehow. they spotted me just as I spotted them. then, with the most unnatural movements, they began very quickly moving towards me. luckily, I was about 20 feet away from my front door. so I rolled back the way I came, and stepped back inside and locked the door. I remember so clearly standing there against the door with my heart pounding out of my chest. to this day I have no explanation for this memory, nothing like it ever happened again.",
   "created_utc": 1691253450,
   "score": 4,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "jux9tym",
   "message": "I was riding the bus home from work one day and was a dozen or so stops away from my stop when a woman wearing a mask (pre-pandemic, so it was out of the ordinary, but still not totally strange) got on. As she walked down the aisle, she loudly announced to the bus \"I have SARS, ebola, and HIV!\" Of course she sat down right behind me. \n\nAs we rode along, she had a few loud, strange outbursts, but everyone just politely gave her a wide berth, as there was clearly something mentally going wrong with her. We were 3-4 stops away from where I normally got off when she leaned forward to whisper in my ear \"I'm gonna lick your neck.\"\n\nAnd then she did.",
   "created_utc": 1691257162,
   "score": 155,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxkoo1",
   "message": "I used to work in a drug and alcohol rehab. You learn to keep your guard up around patients, but most of them are pretty normal, nice people who have had a rough go of it. Every so often someone gets threatening or freaks out, but nothing we weren’t trained to manage. \nOne day I come in and there’s a new patient who checked in yesterday. I meet him while supervising lunch, he approaches me and INSTANTLY I felt a chill and alarm bells ringing in my head. He introduced himself and was perfectly polite, but there was no feeling behind his eyes at all, just total cold blankness. I was polite back but didn’t let the conversation linger, you have to trust your gut and all. He told me I was shy and called me “Shy Stevie” (real name changed, but it was similar). He always made a point to talk to me after that and while being totally polite and relaxed, he had the most threatening aura about him, it was hard to explain. When he checked out I was assigned to take him to collect his things, but an older employee said she would take him instead (I was pretty young at the time) because she “didn’t like the way he looked at me,” and I was relieved. \n\nAfter he checked out I was going through his file to mark his discharge and found that he had recently been in a long term psychiatric hospital and had smashed through the safety glass at the nurse’s station and tried to kill a nurse. He was diagnosed with antisocial personality among other things. Really unnerving and we probably should have been informed prior to his arrival.\n\n(edited for my anonymity)",
   "created_utc": 1691261306,
   "score": 141,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juw2em3",
   "message": "When i was 24 i met a girl a couple years older then me (26 or 27 i dont remember exactly as i tried to forget that immediately).\n\nLong story short she cancelled the date later after finding out im already 24 and she \"needed someone fresh and unused in her bed\". Completly ignoring me telling her i'm virgin beforehand.\n\nFigured out she only wanted to date guys that were 18-21 that time as she didn't trust guys still being virgin at older age...",
   "created_utc": 1691239140,
   "score": 120,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxlhxd",
   "message": "I am a petite woman and I was walking my dog before a hike in the early AM in the city. I cross paths with a man going the opposite direction and make eye contact and give a polite smile. The man abruptly turns around and starts walking behind me. I turn, he turns. The next block, I turn, he turns. The third turn, when he followed me, I start to jog a little and look back and HE has started to jog. \n\nI take out my cell phone and wake up my husband and yelling into my phone say: “Hey I am almost home, can you meet me outside the house?” I stayed on the phone with him repeating the same request. He was confused but complied and when I made the last turn onto my block, the man turned the opposite way. \n\nI was shaking and immediately broke down crying when I got to my husband waiting for me outside. I always wonder what this man’s motives were or what would have happened if I hadn’t taken out my phone and called my husband.",
   "created_utc": 1691261629,
   "score": 200,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "jux9i08",
   "message": "I was driving on a back road at night heading to my parents house when a Cadillac started following me. It was a one lane road at night, dizzling on and off and this guy I notice has been following me for a little over 2 miles. At first I thought it was paranoia, so I used my blinker and they copied me. Every time I did it. A sole blue light then went off on their hood behind me I guess trying to get me to pull over. I called 911 and stayed on the line until the police intercepted me. Lst: the guy ended up being wanted on warrants for skipping bail on an SA charge. Definitely came way too close that night.",
   "created_utc": 1691257036,
   "score": 236,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwy0pj",
   "message": "I was maybe 13 yrs old and I was standing by my house and playing , where I see a guy he must have been in high school or college idk, he walks upto me and says  I want to have sex with you , you're sexy I want to sex you !!! I was sooo scared I just froze, and then came back to my senses and called my mom he got scared and he ran away, this incident still gvs me chills, I was soo terrified! That guy mentally harassed me for months by following me wherever I go, thank god we shifted our house and I stopped seeing him",
   "created_utc": 1691252600,
   "score": 72,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "jux12m2",
   "message": "I was at a conference.  Had dinner with Dr. John Schneeberger.  Nothing at the time.  Like zero. Guy was totally totally normal.  Later when I learned he was a serial rapist who would anesthetize his victims and rape them in the hospital, raped his own daughter and put a tube of a patient's blood under his skin to fool a DNA test... ya that gave me chills.  Because if I can't spot him being off... who else am I missing?",
   "created_utc": 1691253823,
   "score": 161,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwc2ap",
   "message": "There was a man at the bus stop who we started chatting with. This was in 2010 (?) so queer folks weren't nearly as accepted, and this person had garishly painted fingernails and was wearing women's clothing.\n\nHe seemed lonely so my buddy and I started talking to him.\n\nThe guy decided he liked me, which is normally fine. Despite being a straight man, I always feel complimented when anyone—of any sex/orientation—likes me; it's flattering. But this guy was looking at me like I was a piece of meat.\n\nI felt like he was undressing me with his eyes, and I was clearly just a sex toy to him. He didn't see me as a person, as I was being very openly objectified and it felt disgusting—he was even licking his lips when talking to me.\n\nI had never been in the male gaze in that way before, and it sent chills down my spine. I felt dirty, like I needed to shower.\n\nI've been threatened by members of organized crime, when I was a Mormon missionary I had people answer their door with guns drawn, worked in pediatric trauma care—but none of it compares to how that man at the bus stop looked at me.\n\nIt was the most awful feeling a person has ever given me, and it is a frequent occurence for women—daily, even.\n\nI've always been a feminist, but that day I learned firsthand what women mean by \"the male gaze\", and it turns my stomach even thinking about it.",
   "created_utc": 1691243590,
   "score": 216,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwzf4s",
   "message": "I was maybe 8 or 9 and parents left me in my driveway because they had to leave and my friends parents were in their way to get me literally the other street over. Guess they got delayed or forgot or something so I'm just standing around and a guy in hatchback pulls up and starts talking at me. Now, we lived in a bad neighborhood and I was all kinda of NAH but he kept getting more and more insistent. \n\nFinally he pulls in the drive way and I HELL NAH take off running down the street to go bang on my neighbor's door where my sister's babysitting. The dude starts chasing me in his car! So I get to the house and BANG BANG BANG sister answers the door and by that time the dude, who is out of his car now coming at me, stops and sprints back to it and takes off when the door opens.\n\n100% was going to be kidnapped.\n\nSide note in this neighborhood, my sister who was 12-14 and her friend would go play at the park. Well, one day an older guy was harassing them, basically trying to convince them to go with him. They weren't having it so they ran back home and the dude followed. They ran and told the dad who is definitely not a guy to fuck with. Dad hops in his car with a gun and starts chasing the would-be rapists SHOOTING AT HIM WHILE DRIVING. Hits the guy in the neck, he crashes... Can't remember if he died or not, but Dad had to go to court for it and it was dropped because there were so many witnesses and I believe the guy has a prior sexual assault.\n\nI was pretty young when all this happened so details are a bit hazy. Lots of crazy shit happened in that neighborhood. Sharpstown in Houston, Texas",
   "created_utc": 1691253162,
   "score": 148,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "jux0ao1",
   "message": "I was over a friend of a friends house a couple years ago. I can’t remember if it was basketball, soccer or boxing, but my friend had been invited to this guys house to watch an event, and since we were already together he invited me too.\n\nAll day this guy talked about his dogs, three pit bulls, and how much he loved them. He talked about their look and their size and their bloodline and what they knew how to do, on and on about his dogs.\n\nLater in the evening, around 7pm, we’re having a couple beers hanging in the living room and there’s a raucous from the kitchen. One of the dogs had bit his daughter. He grabs the dog by the collar, takes it outside. A couple minutes later I hear the loud snap of a gunshot. He comes back in, sits down like nothing happened. Joking, talking about the game.\n\nI must have been staring at him, because after awhile he focuses on me, laughs obnoxiously, and goes. “Yeah, yep. And I don’t even like you.”",
   "created_utc": 1691253512,
   "score": 161,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwvs2j",
   "message": "A dude smell of cadaver in a home hardware",
   "created_utc": 1691251714,
   "score": 9,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwz2ze",
   "message": "When I was around 9 years old I was walking outside with my mom and siblings when we eventually caught up to a guy in front of us. He stood out. He was wearing a long black coat, sunglasses, a black hat, and just his general appearance made him look very shady. He also had a big dog with him that had the exact same vibe as him. My younger brothers, who were very active and always jumping around, caught the attention of the dog, which started staring at them while walking. The man suddenly turns his head around slowly and asked \"Did you say something to my dog?\" And again, his voice perfectly fit his vibe. We weren't in an English speaking country at the time so it was unusual to hear it, and he sounded calm but intimidating. He kind of reminded me of Mike and Gus from breaking bad. We said no and he slowly turned his head back around and continued walking. My brothers were very quiet after that until the guy went a different way. Not really chilling, more just interesting to me how he probably has a really interesting story to tell about his life.",
   "created_utc": 1691253030,
   "score": 65,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "jux7fck",
   "message": "My wife and I stopped at a park with our then 7 year old daughter. My wife went off on her own for a few to look at some trees while I took my daughter over to the bank of the lake. Seemingly of nowhere this really creepy guy walked up and started addressing my daughter while ignoring me. He was going on about how to attract the ducks and was positioning himself in a way to get in between us. I did a quick calculation where I had a base set up to kick his ass into the ropes along the edge of the lake which would trip him at his knees and sent him into the water. I had my daughter by the hand and just interrupted the guy and pulled her away, the guy turned around and went right to his car and left immediately. My insticts were strongly indicating that this man was intending to abduct my daughter and the chills from that experience still haunt me many years later.",
   "created_utc": 1691256255,
   "score": 193,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxevw2",
   "message": "When I was 8-9 and my older sister was about 13 we went to a fast food place with my parents. ( something like Taco Bell or del taco) It was later at night, like an hour before the store was closing. Pretty deserted except for my family and some middle aged man, looked like he could be homeless. He was kinda just talking to himself, saying nonsense. My dad had to go outside or to the bathroom so it was just me, my sister, and my mom. He’s sitting at a table across the restaurant but we notice that he keeps moving tables. He’d move one table closer to us and watch us for a bit as he ate. We tried to just ignore it but soon enough he was at the table right next to us and he was trying to talk to us. My sister, just becoming a teenager, had started getting into makeup and experimenting with how she dressed. The guy kept making comments on her makeup or how pretty she was. My mom had gone towards the front of the store and was talking with my dad so it was just my sister and I. We were both clearly uncomfortable and my mom could tell. She decided it was time to go, my dad really didn’t seem to notice or care that a creepy man is sitting near his two minor daughters and making comments about how they look. Me and my sister told my mom how uncomfortable we were when we got home and she told us to let her now if we ever feel like that, and that she would get us out of that situation asap.",
   "created_utc": 1691259061,
   "score": 9,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxhfse",
   "message": "When I was about 6 years old (this would have been around 1990), I was riding my big wheel bike down my block in a DC suburb. The way our street was situated, at the end of the block was the entrance to an alleyway that took you behind all the houses. I would frequently turn down the alley and go behind our house and enter through our back gate. \n\nAs I got towards the end of the block, a car was coming and I stopped and waved my hand indicating that they could go ahead and I would wait for them to pass. The driver in the car refused to go and motioned for me to turn instead. So I went ahead and entered the alley.\n\nI got about halfway up the alley not quite to my house when someone grabbed me from behind. It was the driver and she was pissed. She had turned into the alley after me , drove down, parked her car in the middle of the alley and gotten out. She yanked me up by the arm, and screamed in my face \"Don't you ever use police signals with me!\" I immediately began sobbing, ran to my house and told my parents. By the time they ran out the back door, the driver was gone.\n\nI'm 38 now and still think about it.",
   "created_utc": 1691260026,
   "score": 227,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwn6m5",
   "message": "I was looking for a bus on the street. I saw one, did some hand signals and the driver pulled over. i went up to the passenger window with the intention of asking the driver if he's going where I'm going or not, the man in the passenger seat looked at me in such a way that just froze me. I couldn't speak and it felt so fucking weird, I was stunned without explanation. after a solid 5 seconds the driver said \"YEA?\" and I could only say \"*location's name* me are you going to me house?\" and the driver just drove off.\n\nit was so weird",
   "created_utc": 1691248252,
   "score": 30,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwz88o",
   "message": "Recently I had a complete stranger park his bicycle right in front of my car while I was sitting on a small venue curb with some friends. He starred at me for 20-30 seconds then sat down right next to me and said “hello my friend.” I’m usually pretty nice to people and good in situations like this but something made me feel so weird that I got up and went back inside. That was like 2-3 weeks ago.",
   "created_utc": 1691253087,
   "score": 52,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "jux7hgl",
   "message": "When I was 14 my mom decided randomly that we were all going to be Mormon. They have this thing where young boys can gain “priesthood” to do extra shit around the church. My mom basically forced me to do this so I had to be interviewed by the Bishop at our ward. Basically me and a 65 year old stranger locked in a room at the church together and he asks some weird ass questions. Basically the two worst were, “have you had sex or are you sexually active?” and the one that really bothered me, “do you masturbate or please yourself?”. I’m sure they ask everyone that, but at 14 it freaked me out and I just lied lol. Hated that place.",
   "created_utc": 1691256277,
   "score": 134,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwvbn2",
   "message": "I walked into a bakery the guy that was behind the counter sent every alarm off in my brain. He looked absolutely normal and was polite as can be. But he just gave me chills. He watched me out the window all the way to my car. \n\nA women was assaulted a couple nights later outside that same bakery. I'd be willing to bet money it was the same guy.",
   "created_utc": 1691251537,
   "score": 54,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxbjmi",
   "message": "My mom had a friend whose husband tried to get into my house when the only people home were me and my sisters.  He left when we let him know we had a gun.\n\nI should say that the reason this guy was married to my mom's friend is because he raped her and got her pregnant, and she was religious, so her church made her marry him.  My mom made us go to the wedding with her.",
   "created_utc": 1691257800,
   "score": 234,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxbn4r",
   "message": "Walking back from pool at night and a large middle aged man came out of nowhere and did that Silence of the Lambs *thspspsps*-thing at me.",
   "created_utc": 1691257835,
   "score": 95,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juw2q1v",
   "message": "I found a lovely letter from a stranger next to me when I woke up from a nap on the bus. It was weird but wonderful. Until today I don't know who he was...",
   "created_utc": 1691239314,
   "score": 28,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwswxy",
   "message": "Why did you put the question in quotes 💀",
   "created_utc": 1691250592,
   "score": 17,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwxo8s",
   "message": "I have an eidetic memory and if I meet you only once that’s my impression of you for my rest of my life and 20 years later, I can still see your face in my head, and I remember your voice.\n\nI still know about your daughter and your son and your parents and your family. I remember what your favorite snack is. I remember your allergies. I remember any of you medical history you shared.\n\nAs I wrote this, I thought about some of the people from my life, and I found myself remembering people from many many years ago as if it was yesterday and apparently this is not a common thing and so I feel kind of cursed by it.\n\nBut the person that did that to you was simply bullying you ; people like us,they tend to get bored, so the worst of us will do that, but the best of us try not to let you even know it’s a possibility.",
   "created_utc": 1691252464,
   "score": 25,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwxuou",
   "message": "I was 8 and some lady in a gas station said I looked just like her dead son I'm like tf that gotta do with me",
   "created_utc": 1691252533,
   "score": 11,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwwog0",
   "message": "I was playing a show with my band in Hood River, OR. It was like 1am after the show and we were loading up gear at the cars when this guy walks up to me. Well dressed, stone sober and walking with a purpose. Without any introduction or context he asked me “Do you know who Antifa is?” Now I know about Antifa but this guys breath was just reaking of Fox News, and I was smart enough to play dumb so as to not engage him. He asked like 3 times, adamant that I knew who Antifa was, before turning around and speed walking away. It kind of stunned me but then I realized we had Washington plates and you could easily figure out we were a Seattle band and this guy was probably looking to start something. Considering the time of night and how intense he was I often wonder if he would have whipped out a gun and killed me on the spot if I said the wrong thing.",
   "created_utc": 1691252066,
   "score": 40,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "jux6izf",
   "message": "One of my friends back in hs brought a stranger over to my house. Wasn’t too out of the ordinary, since my house was the party house. This guy though was just sitting in the corner quietly the whole time. I don’t think he said a word to me, but he had kind of a sinister feeling about him. \nFast forward a month later, my friend tells me, the guy he brought over did a b\u0026amp;e, that went wrong. The owners we home, so he sat them on their knees and executed them.\nSupposedly his case got dropped because of a technicality. \nAll of this was told to my from the friend, that brought him over. I don’t know how true it is, but the sinister feeling I got from the stranger, I wont ever forget.",
   "created_utc": 1691255920,
   "score": 42,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxh90k",
   "message": "Once saw someone standing dead still in front of some house's door. Was in the middle of the night and the street wasn't lit well either. Couldn't do anything because i was driving past. Still no idea what tf that was",
   "created_utc": 1691259952,
   "score": 3,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxlv6a",
   "message": "When I was 9, I was in K-mart with my uncle in the television section (remember when k-mart had those separate rooms for the tv's and big electronics?)  It was Saturday morning and he sat me and my little sister down and told us to watch the cartoons on the tv's while he hunted down a sales person. Not 2 minutes after he was gone, we approached my 2 men and they tried everything to lure us out. We were petrified and didn't say a word. They finally lifted my sister to carry her out and was reaching for me when my sister peed on the one guy. He dropped her and she started crying. My uncle heard her and came running. The guys bolted. I still think about that all the time. We were so lucky that day.",
   "created_utc": 1691261773,
   "score": 204,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxo8wa",
   "message": "I was 12yo and staying with my parents at a hotel in Dallas. I was in the adjoining room. At some point in the evening I got a call on my hotel phone and answered it. A man claiming to be hotel security told me to unlock my door so they could do security checks when they do their rounds. I told him okay and hung up. I then went to my folks room and told them to unlock their door so security could check on them. Clearly my folks were upset and explained that the door locks were there to protect me. Later that night I awoke to pulling on my door. It was creepy af.",
   "created_utc": 1691262741,
   "score": 147,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxrisw",
   "message": "A little less than a decade ago, two of my buddies and I descended from the mountains during the night because of a massive storm that flooded our camp spot. We arrived into the small town at the base around 2 am and checked the established campsites, but they were also all muddy and flooded. We noticed a tent setup in there though, and as we walked away we all realized at the same time that a man with a large white beard and wearing all black was walking at the same pace as us out of the campground area. As we walked closer towards the main road we eventually lost sight of him.\n\nSince we had parked my friend's car in the next town and had taken a bus back several towns to start our hike, we had never planned to come to this town and therefore had no means of transportation out of there. We decided to get some rooms for the night and head back on our hike once the storm passed the next day. So we walked to every hotel in this town, but they had no rooms available anywhere. After about an hour of walking in the rain, we stood under an awning at the gas station and the worker came out to tell us that the post office building was open all night and sometimes stranded hikers spent the night in there and it was fine. So we went there.\n\nWe threw our sleeping pads on the floor and tried to get a few hours of sleep now that we were sheltered. At some point I hear my friend say, \"Someone is watching us outside\".  We all get up and look and it's the white beard ninja creep looking guy. He is just standing there with his nose on the window staring at us. Then he slowly walks away after a few minutes while looking back at us a few times before vanishing. \n\nWe all agreed to leave this building before getting murdered in it or that maybe that man's campsite was flooded and he might have been trying to sleep there as well. Either way we decided to sit in a covered bus stop bench and drink the last of the warm beers in our backpacks while watching an incredible lightning show. Not too long after though, we saw white beard ninja guy sit at a bench across the street from us outside of a restaurant. We just sat there doing our thing while he distantly looked at us and sometimes laid his head down on the table. This went on until about 6 am, when the rain stopped. He just walked away and we left shortly after.\n\nWe later found out that he is in fact a homeless person who lives there. He probably just wanted a place to sleep. I have seen him several times over the years as he is always hanging out outside that same restaurant. I bought him food and offered him beer but he declined the beer. I asked him about his life but he speaks so low and mumbled that I cannot understand anything he says. He seems really sweet in a way but obviously mentally ill also. The locals say he is harmless and just a bit lost. \n\nAnyway, I'm not sure what to think of him but when I saw him standing in the rain, staring at me as I woke up, it freaked me the fuck out!",
   "created_utc": 1691264087,
   "score": 188,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxur1m",
   "message": "One time I was doing door to door sales and this guy just gave me a weird vibe and so I played it off like I was sure he couldn't save any money if he signed up with what I was selling so I was like I'll just go and then he got in his van and followed me around the neighborhood and kept trying to convince me to get in his van and come back to his house and he said he thought that I was cold and I needed some tea or some soup. I literally called my coworkers and told them that if anything happened to me this is the address of my murderer because he was that creepy. I ended up hard selling the next customers who were this really nice old couple and I went into their house and I spent all day telling them all the different details of the plan so that I didn't have to be out on the street anymore.",
   "created_utc": 1691265432,
   "score": 105,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwfkaf",
   "message": "Not a person but umm... I had a fistulotomy couple of days back. I was sedated with a spinal anaesthesia. Which made my lower part of the body numb. The operation was short and I was transferred from OT to a ward. There was a sheet over my lower body. Curiosity led my hands to explore my lower parts of the body which were still numb. I slid my hand between the pyjama and suddenly touched a cold and dead feeling like mushroom. I withdrew my hands immediately as reflex just to realise later that it was my own penis.",
   "created_utc": 1691245049,
   "score": 19,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwrjhj",
   "message": "I was on the sidewalk walking and everywhere i went the same guy were behind me and everytime i stopped he walked around 20 meters and tryed to hide from me. I think he was my stalker but at the end i called the police and he got arrested",
   "created_utc": 1691250027,
   "score": 11,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juwrh6g",
   "message": "r/LetsNotMeet",
   "created_utc": 1691250001,
   "score": 6,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "jux4gci",
   "message": "Was at ren fest, chilling by my campfire with a bottle of mead and this boy just shows up and starts trying to ask me to let him suck me off. I told him to fuck off and said but your here alone? And that’s a justification for soliciting a random stranger like wtf people.",
   "created_utc": 1691255145,
   "score": 3,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxcyeu",
   "message": "I was 12 years old on a bus to visit my uncle in Kelowna. This greasy looking dude sat beside me and chatted me up the whole trip. Bought me lunch and snacks as well. I thought he was going to kidnap me when we arrived in Kelowna.",
   "created_utc": 1691258333,
   "score": 12,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxhyuu",
   "message": "Friend and I were shopping at Kohl’s a few years back. One of their store brands is called HELIX. We are at the checkout and the clerk is the skinny older dude who looks like he’s *seen some shit* throughout his life. \n\nHe’s going through our purchases as he rings them up and looks and my friend then at me and says “there’s a gay porn studio called Helix. They make movies with boys like you two.” \n\nWe’re gay, and in our 30s at the time, but that was really random and gross.",
   "created_utc": 1691260235,
   "score": 3,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxij33",
   "message": "I was walking in my city and a random guy rode up on a bicycle and asked very forcefully that I buy some heroin off of him. I politely said “no thanks, I’m not interested” and he kept insisting. After the 3rd “no,” I turned around to walk away and he started yelling at me that he better not see my face again or he was going to kill me, and made threats against my family too if he ever saw them with me. I just calmly walked back home hoping I wasn’t about to get mugged or shot. Nothing ever happened and I know these people are all talk most of the time, but it was still scary. I actually saw that guy again a few months later (his appearance was very unmistakable), but he didn’t seem to recognize me that time and nothing happened.",
   "created_utc": 1691260455,
   "score": 13,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxojxl",
   "message": "2 instances. 1. I was young (M17), it was late. I was walking home and this car slowed down next to me. The guy inside tried to convince me to get in to his car. Said he would pay me to suck me off. I rejected his offer but he kept following me through the streets, raising the amount offered. Finally, I ran and lost him. 2. A  year back, I was traveling with my 6 y.o daughter in Germany. We were in Munich and stopped for a quick espresso and cookie for her. Sitting by a table, enjoying ourselves, when an old man leaned over to me and spoke to me in German. I  asked him to repeat in English to which he said \" your daughter is very lovely\". Gave me the creeps. His eyes looked like that of a shark. He looked predatory, hungry. We fled the scene.",
   "created_utc": 1691262868,
   "score": 34,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxp7cf",
   "message": "The pink woman. I used to live near a park and I would go for a run every day. One summer on the hottest day of the year this woman showed up. She didn't do well with the heat at all. Her skin was pink, and she was wearing bright pink clothes. From a distance it looked like she was panting. I remember thinking that she picked the worst day to start exercising at the park. When I went home that day I saw her sitting by a monument at the park, smoking a cigarette, and staring at me. I saw her two more times. On the last time our paths crossed, I said Hi and waved as I got close, and she stopped dead in her tracks and locked eyes with me, and she did something I'll never forget. Her mouth was a perfect O shape as she was walking, and when she stopped she went between that O and every expression between that and a smile almost like something out of stop motion animation, and then in reverse back to the O. It was one of the creepiest things I've ever seen.",
   "created_utc": 1691263129,
   "score": 41,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxpcxp",
   "message": "Excuse my english\n\nI was 18 years old, living in the French South countryside. One of my friends sometimes threw big ass parties in his father's place (their parents were divorced and he was normaly living with his mother, near our school) : a little house in an ancient farm in a hill, surrounded by grassland and forest, away from everything. We had to drive 1 hour in hills and forrest to get to his father's village : a little village lost in the hills, where houses are very espaced one to another. \nIn those parties, we put some campfires and were drinking and smoking all night with our friends. \n\nOne day, he wanted to make it big and invited some young People from this village. He didn't knew them very well, we didn't knew them at all, but hey, why not plus there would be more chicks. \nAnyway, 10 local youngsters come to our party and everything goes just fine.\n\nUntil 2 am : I was drinking my beer in front of the campfire when I see a 16 yo I never spoke to, coming straight to me. He grab my head and squeeze it against his for a solid 10 second. I was drunk/stone, in à good mood, so I didn't reacted agressively. Then, he released me and fall into his knees. He started laughting freneticaly, almost crying. So weird. He stopped, looked at me straight in the eyes and said \"35. Not so bad for your\".\nAnd he went walking. \n\nThe thing is, I had a very aggressive cancer I fought from 14yo to 16yo. I won, I'm here, but I have some after effects on my health. \nI don't know if he really spoke about the age of my death, It's an interpretation. I never spoke to him again and my friend just said he didn't knew him, he was just a local guy from the hills.",
   "created_utc": 1691263191,
   "score": 10,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxv2xf",
   "message": "I was playing basketball in the driveway when I was about 7 years old. This gold van pulls up in front of the driveway and swings open the side door and I see a group of women who are about to get out. My mom came outside and they quickly swung the door shut and sped off… creeps me out thinking about what could have happened had she not come out in that moment",
   "created_utc": 1691265567,
   "score": 30,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxx04a",
   "message": "I used to walk my dog at 4am, it was usually dead quiet outside and my dogs would harass me to go outside and I always thought it was safe cause one is big and protective. One day I was walking them and I noticed a car stopped at a stop sign, probably for 5 minutes straight across the street. I made eye contact with the driver and immediately got a gut feeling and grabbed my dogs leash tight and went to turn around back home. As soon as I did that he sped across the street and into my apt complex where I was and I ran as fast as I could with my two dogs back to my house, luckily I was close and made it to my house before he made it to me. I tried to scream but was so scared that no noise came out. I ran inside and told my parents I was never ever walking the dogs in the dark alone again. The next day my parents went to walk the dogs, saw the guy circling the street at the exact same time as the day before and called the police. They found the guy, he apparently was kicked out of his house by his wife and leaving the country in 3 days. I still get the chills not knowing what he had planned to do to me esp knowing he was leaving the country and his wife kicked him out.",
   "created_utc": 1691266351,
   "score": 84,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxxpf3",
   "message": "I'm a teen, but when I was a younger kid, I and my cousin were at our grandparents. Our grandparents sent us to go alone outside to buy ice cream.\n\nWhen we were going back home, a random man said \"Hey you kids, follow me\". Luckily, we both said we will come back that we just need to leave the ice cream in the freezer. We lied. We never came back and ate our ice-cream right away when we got home.",
   "created_utc": 1691266641,
   "score": 3,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxxwh1",
   "message": "When I was in college I had a side business selling art. At one point one of my facebook friends reaches out to me saying she'd like to buy some art and because we live in the same area it would make more sense to meet up in person than to pay shipping fees. I figure this is reasonable and we make plans to meet at a local coffee place. At this point I'd met her in person maybe twice, we're not friends, but we had mutual friends. \n\nShe shows up at the coffee place with her ex boyfriend, and says \"don't worry, he's just an ex, we're still good friends though\". Weird, but ok. Like I don’t care if he’s an ex or not, I’m here to sell you a bunch of stuff. Something felt off about the situation. I don't know if this makes any sense, but it seemed like they were pretending way too hard to be normal, like they were trying to be Barbie and Ken. She was talking in an accent with a much higher pitch than her real voice, and he kept making lifeguard poses and talking in an inhumanly deep voice; I felt like they were roleplaying or something. I give her the art, she pays me. They offer to give me a ride home, which I thought was nice, as otherwise I was looking at a 40 minute bus ride. Also I had virtually no sense of self preservation.\n\nOnce I was in the car with them, things got weird. They proceeded to drive in circles around town for about four hours playing the Dead Kennedys on near max volume, in dead silence. I don't think she said a single word the entire time, and he only spoke very occasionally. I didn't want to piss them off or ask too many questions because the whole situation still felt *really* strange to me. It was weirdly tense, and it felt like they were trying to play loud music to drown out the tension.\n\nAt one point I mentioned I had to take a piss and the ex got really agitated and kind of freaked out, and wouldn't stop the car, and the woman tugged on his sleeve a little and said \"just let him take a piss, it'll be fine\". Eventually he drove way out into the woods and told me to piss on the side of the road. After that they both seemed kind of agitated/annoyed with me and dropped me off about a half mile from where I lived. We never spoke again.\n\nTo this day I have no idea if they were swingers, or serial killers, or on meth, or just people with no social skills, or what the heck that situation was about.",
   "created_utc": 1691266722,
   "score": 82,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxyr72",
   "message": "Whose reading this in the middle of the night?",
   "created_utc": 1691267080,
   "score": 161,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxzw1b",
   "message": "I once almost hit a dog running across the street in the early evening on my way home. I got the dog in my car and drove to the house address listed on the tag and knocked on the door - no one answered. I called the # on the tag and left a message saying I had their dog and that I would wait about 10 min. Almost at the 10 min mark a young-ish guy in his 20s walks over to my car from the street. I asked him the dogs name which was on the tag, but just wanted to make sure it was the owner. He was giving kind of off vibes, but nothing too creepy. I learned a couple years later after his arrest and address were publicized , that he was the murderer of a woman in my town who was randomly stabbed one evening jogging along a popular trail.  The case had been unsolved for many years and it was during this period before he eventually turned himself in, that I had this encounter.  \n\nhttps://www.nytimes.com/2018/09/27/nyregion/confess-cold-case-murder-connecticut-jogger.html",
   "created_utc": 1691267549,
   "score": 71,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juy1g6z",
   "message": "I did have a weird encounter the other day.  I've been taking my child to the playground a lot lately and it's mostly been really nice, to see how children just instantly form friendships, engage in play, etc.  It all feels very sweet and innocent.  But we met this kid who instantly gave me serial killer vibes, and they only grew stronger the more time I spent with him.  The initial worries were that he just seemed over-eager, boundary crossing, controlling (dictating what they were going to play).  And then he picked up a stick, pretended it was a knife (said as much), and then while sitting on this spring-borne rocking horse stabbed it repeatedly in the butt to make it \"go wild\" and throw him off.  And the stabbing wasn't some offensive but normalized riding crop against the horse's ass thing, this was brutally stabbing.  So far everything was a bit off, but maybe forgivable.  The child seemed socially awkward, was extremely overweight (to the point of limiting his activity), had long hair that he seemed uncomfortable with, in the sense that he later got angry and loud when he thought he was mistaken for a girl (which he actually hadn't been, the person was saying she about someone else).  And then he saw a beetle on the playground and became fixated on it, completely ignored us, to \"play\" with it...  I hightailed it out out of there to engage with the normies.  Later as we passed by he announced with this horrible glee that he'd killed it, and I didn't find it hard to imagine he'd tortured it along the way, given glimpses I'd catch at a distance.  I  get that kids can be cruel to bugs, magnifying glasses and ants, etc. but I think it's usually out of a lack of understanding.  With this kid it hit different, that his glee came from his actually understanding.  Anyway, I could be imagining some of this.  The vibe was just so much darker and weirder than with any other kid I've seen, gave me the creeps.  If my impression was accurate I shudder to think about what goes on in his home.",
   "created_utc": 1691268193,
   "score": 3,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juy25kt",
   "message": "I once lived (temporarily) in a rent small apartment that was really close to a bar. The owner of the bar built some apartments on the same building, so this might sound weird but the door for my apartment was right next to the door of the bar’s toilet, it was like 50cm apart (around 20 inches for the Americans). Once I was washing my hands at home, and all of a sudden there’s a drunk guy, who looked around 60, right in the door of the bathroom. He literally entered, saw the living room, kept going, entered the kitchen, kept going, till he was on the bathroom. I froze, I thought he was going to do something really bad, and there was nothing I could do bc he was already right in front of me, on the door, so I couldn’t escape. He said “I was looking for the toilet. They gave me this key”. Almost freaked out, I said “its not here. You entered the wrong door, let me show you.” And I showed him the toilet. To my surprise, he simply left and went to the toilet as I showed him. I never interacted with that man again, but I saw him a few times on the bar. He probably was really drunk and confused, bc he clearly didn’t want to do anything bad, bc if he wanted he would have done it. After that I always locked the front door. And yes it happened to me a few times to see men pee (they left the door open) when I was leaving or getting home.\n\nSorry if this is confusing, I’m not exactly fluent in English so it was a bit hard to describe this",
   "created_utc": 1691268482,
   "score": 59,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juy266f",
   "message": "I was placing the gas nozzle back in the slot, and the adult male owner of the convenience store walked up to me and kissed me on the mouth and stuck his tongue in.\n\nMy face is becoming red just thinking of this.\nI drove off but of course hated for years I didn’t kick his ass at that time.\nThis is how predators get away with this shit for so long.\nIt shocks you for a few beats afterwards.",
   "created_utc": 1691268489,
   "score": 3,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juy2ku8",
   "message": "I was desperately hunting for an apartment in Berlin 7-9 years back and decided to try craigslist to see if I can find any. There was one woman looking for a roommate and after sending her a quick email she promptly answered- quite fast actually. We agreed that she can show her apartment the next evening and I found myself there the next day with terrible weather.\n\nThe apartment was at the top floor with no elevator, when she opened the door for me I realised this might be a weird one; she seemed quite groggy, spoke well but weirdly and gave a off vibe a little bit.\n\nThe kitchen and the room she was renting was nice and clean, but I got a glimpse of her room which was incredibly messy and just reeked. The bathroom had a big tub that was filled to the brim with water, I asked if she was going to take a bath jokingly and she just shrugged and said it didn't work, which itself didn't make sense.\n\n\u0026amp;#x200B;\n\nWe went to the kitchen to chat more and she seated me with my back to the entryway, so I didn't see anything behind me or in the rooms. Almost instantly I hear something moving in one of the rooms and I asked if she had a friend in the apartment, she didn't even answer this but started to babble about something else. My spider senses went haywire and something in my head just said leave now, so I just stood up and quickly grabbed my shoes and got myself out of the apartment while shouting \"thanks \" in the stairway. In the evening she sent me a email that totalled like five pages about god and some absolutely nutty stuff, needless to say I blocked her and hopefully never run into her again.\n\n\u0026amp;#x200B;\n\nedit:typos",
   "created_utc": 1691268655,
   "score": 187,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juy4r6p",
   "message": "I was walking home from work around 11 pm from Wrigley Field in Chicago. I walked home every night for years through these parts and never had any issue. I had my music in but never listened loud just in case. For about a mile I could hear someone yelling behind me, but they weren’t close and I couldn’t make out anything they were saying. I started to get a really bad vibe and decided to mute my music for a bit. \n\nI started to hear the voice getting closer but still couldn’t make anything out until I heard a distinct “I just really really DONT like gay people.” I turned around and saw an old janky dude just sprinting at me full force from behind, I remember his arms were flailing in the air uncontrollably. I decided quickly to just cross the street and see if he would follow me. I turned to stare at him as he slowed to a walk and stayed on his side of the street. Once he was parallel to me, without even glancing over, he calmly said “That’s exactly what I would have done.” And continued on, turning left into the train station about a block ahead. Gave me the creepiest feeling. I definitely was ready to fight if I needed, but dude had the most whacked out posture and vibe I’d ever seen.",
   "created_utc": 1691269555,
   "score": 109,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juy5pbs",
   "message": "Stared glaring daggers at me like I had kicked his baby. This was for over an hour, tell I got uncomfortable and left. He tried to follow me I’m pretty sure but then I ran into friends and he left. I’m not sure what he was planing on doing or what but it gave me the creeps.",
   "created_utc": 1691269938,
   "score": 3,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juy60q6",
   "message": "When my son was a toddler, I made a late night run to a 24 hour Walgreens to pick up a prescription for him. We lived in an urban area where that Walgreens was actually busy at that time of night. It was also right next to a Metro stop and was not a place where most people drove, so parking was super limited. I ended up parking at a curb a bit away from the store. When I got back to my car a youngish, very normal (by my estimation) guy came up to my window. I rolled it down a bit and he said “I think I know you from xyz place.” I had actually been to xyz place before (xyz place was also a very popular place), so I tried to remember him. In that spilt second that I hesitated trying to remember him, his eyes went completely black, his whole face changed, and he grabbed the door handle of my car and tried to open it. I put the car in drive and peeled out of there looking straight ahead. Only when I got to a red light a few streets away did I realize that the overhead light was on. He had actually opened my door a bit and I hadn’t realized. I never forgot his face. How it changed. I remember one of Ted Bundy’s victims (survivor obviously) described how his face went from normal, attractive, friendly to black-eyed, unrecognizable, and frenzied. That’s how this man transformed. There were some missing women in our city and I always wondered if this guy did it.",
   "created_utc": 1691270071,
   "score": 146,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "jux75oc",
   "message": "Not only gives me the chills, but changed my life.\n\nBack in 1997, I went to a convenience store with a friend.  I got a bottle of water, my friend got a small bottle of milk(back when milk chugs were popular, lol).  I took them to the counter.  The guy behind the counter has a very distinct look to him.  Older, maybe 40's but looked rough.  Tan, wrinkly, bald, long pointy gray beard.  Piercings and tattoos everywhere.  He rang the two items and in a scratchy, shrieky, witch-like voice said \"Two Two Two, one third the number of the Beast\".  I paid and we got out of there fast.\n\nEver since that day, I see that number daily.  Addresses, phone numbers, the time on the clock.  I got a new debit card  it was the expiration date AND it was in the number.  Interviewed for a job last week.  When I got there, the last three numbers on the mileage of my car were 222.  Coincidentally, after I left the interview and checked my watch, the time was 3:33.\n\nI have seen the number twice in one day, but never 3 times.  I don't know why, or what it means.  But I see it Every. Single. Day.  For the last 26 years...",
   "created_utc": 1691256153,
   "score": 4,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxbuop",
   "message": "Okay, I've got a few accounts up my sleeve, but I'm going to compose one that still scares me. One day after school, I was hanging out with my then-boyfriend and we watched one of the SAW films while lounging. He ordered pizza, so when we heard a knock on the door and the doorbell 30 minutes later, we assumed it was the food. He opened the door to find nobody there. He told me to promptly get to his room and stay there till he called me down. I did. After 10 minutes, the doorbell rang again, and it was the food, so I went down because i was hungry lol. During that time, my boyfriend shut all windows and drapes, and although I assumed it was a prank, he claimed that this never occurred in his neighbourhood. We quickly forgot it. \n\nOn my way to school two days later, I receive a call from an unknown number. Considering that it was 6:30 a.m., I assumed it was an emergency call. I answered the call and all I heard was interference. A few seconds later, I received another call and said hello once more. I heard a woman in the background of the call, and it became apparent that it was the audio voice of the bus announcer; which means the individual was on a bus. I peered everywhere, but only I was on the phone; a few others were using their devices, but I disregarded them because i didn't think it was any of them. At this juncture, I assumed I was dealing with a stalker. \n\nThe following week, at 2am, I received another missed call from a private number, and I thought it might have been my boyfriend because he couldn't sleep. I answered the phone without speaking; I  heard static and heavy breathing. I turned off my phone and realised I have to change my number immediately. When i turned it back on i had a few voicemails and it 3 of them were complete static. Creepy. But i did change my number.\n\nAfter a week, the situation had calmed down. I was, however, too optimistic. Because i got a private call on my new number around 3am. I just stared at the screen and thought, there is no way. No absolute way its the stalker. Ive changed my number. It stopped ringing and then they called again. I was so annoyed at this. But i answered the phone and a man spoke. He sounded like he was in his mid-20s (I was about 15 at the time). He inquired about my previous number. I was shocked and couldn't think rationally. I gathered myself quickly and asked him his name, to which he responded that i already knew (lol tf?). I then inquired as to how he knew me, and he stated that he had seen me at a party. I suppose that's plausible, but how in the world did he get my number? He claimed that I gave it to him. I obviously didn't and i wouldn't because i was seeing someone. I began recording the conversation using my mother's phone so that I could capture his voice. He then began to tell me I was very attractive, that he liked me, and that we should hang out one day after i finish school. He said he will pick me up and he knows a few spots. I was so disturbed by this. I asked him why he pranked me so much, and he responded, \"do you mean the knocks or the calls?\" I had forgotten about the incident involving the knocking. As soon as i heard that shit, i cut the phone and immediately woke my mum and went to the police station to report everythinggg. This man knew me, where I attended school, and where my boyfriend lived, but still to this day I have no idea who he was. \n\nI have many, many more stories. I wish i didn't.",
   "created_utc": 1691257915,
   "score": 62,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxba1t",
   "message": "So I got arrested when I was in college for public intoxication when I was 20, 21 is the legal drinking age in Freedomland.  I was walking home from a party, as I wanted to pass out in my bed.  They put me in jail for the night, and the guy I was in the cell with was a pretty cool guy for the most part.  Wake up the next morning, and after breakfast (they fucked up toast which I thought was impossible unless your burnt it and they didn't burn it.  It was just fucked up) they took us to the judge for I think was the arraignment.  It's the part where the judge tells you your crime and how you plead.  The guy I was in a cell with was in front of me, and the judge says \"Mr. such and such, you are being charged with murder how do you plead?\"  I was like \"WTF, you put the drunk in the same cell as a possible murderer?\"",
   "created_utc": 1691257698,
   "score": 46,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxl89a",
   "message": "I was walking out of a walmart with my mom whos 5'4 and I'm 6'3. Before we got to the car some kid who was about 5'7 came up to us demanding money. We were more confused than scared and I yell at him to fuck off. Well next thing I knew I saw a flash of metal and without thinking I pulled my knife and stabbed him once in the side and he ran off.",
   "created_utc": 1691261521,
   "score": 4,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "jux6k44",
   "message": "I was heading home one evening from the downtown core by metro (subway). As soon as I left the terminal station and started walking towards my home (about 20 minutes away), this dude cycles up to me, slows down and starts asking me all sorts of questions (i.e. how you doing? Where you going? Wanna chat?). I’m doing everything possible to shake this weirdo off with short and curt (but kinda polite) answers. Eventually, I turn down where I live and bolted. He yells: “Bye! You’re pretty! I live (where he lives)!”",
   "created_utc": 1691255932,
   "score": 2,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "jux6uok",
   "message": "He was drunk and was smoking some of that good thing and he was talking to me in very short sentences like taking breaks every 2 words and every time he did that he aproach me slowly step by step i was like hell no im out",
   "created_utc": 1691256040,
   "score": 2,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxk5cq",
   "message": "I was walking in downtown Philadelphia on a beautiful day - near the Liberty Bell, being tourists. I was with a group of people and we were talking, laughing, and I was whistling to myself. This homeless man behind us started screaming, “The next person who starts fucking whistling is getting this bullet in their brain!” and waving his hand in his pocket around. For some small town folks that was scary. \n\nWe also went on a ghost tour then were walking back to our hotel and this black SUV was slowly following us.",
   "created_utc": 1691261090,
   "score": 2,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxldmp",
   "message": "I probably was the creepy encounter for a lot of people",
   "created_utc": 1691261579,
   "score": 2,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juy1i8k",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxt14b",
   "message": "I was playing at the end of the trailer park and a guy pulled up in a convertible. He said he knew my mom and held up a Polaroid across the front seat.\n\nI saw the lady didn't have the right hair color and said so. He got frustrated and insisted I should come closer to be sure. \n\nI said, \"No, I'm actually going to get lunch now, sorry.\" He gave me a fake smile and left, so I turned around.  My neighbor, who later again saved my life quite literally, was walking up with an odd expression and her purse. \n\nFound out a few years later that she had a .357 in there and there was a serial killer killing young boys in the city for about 3 years around then.",
   "created_utc": 1691264719,
   "score": 176,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxzc7c",
   "message": "I once worked in predominately Asian mall selling computer hardware. I'm 1/2 Asian but I look predominately white. Fun times working there. One day a guy comes into the store looks around and makes a B line for me. This was an extremely buys day, I suspect it was close to Christmas and the store was packed. We start talking a little, I immediately start to pick up some odd vibes from him. Then he confides in me how upset he is that this neighborhood had changed so much how it was different when he was a kid and then he says \"all these Chinese people around here now, don't you just want to kill all of them sometimes\"?.... I was so shocked I just froze and he could tell I didn't agree so he just walked off.",
   "created_utc": 1691267322,
   "score": 64,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juy188c",
   "message": "Before I got my own laundry machines, I used the shared laundry room in my apartment complex. The building for the shared laundry is separate from the units and you have to go outside to get to it. Tenants all have our own keys to get into this room which they keep locked at all other times to avoid vandalism etc.   \n\nOne night I was coming back from the laundry room with my dry clothes and I heard someone say “excuse me” from behind me. I turn around and there’s this guy standing there who I’ve never seen. He stared at me silently for a second with a stoic face and narrowed eyes. I don’t know what it was, but the second I saw him every alarm bell started going off in my head. This was a regular looking guy, there was nothing about his posture or anything else that would outwardly suggest danger. The conversation went like this:  \n\nGuy: I just moved in and don’t have a key to the laundry room yet. Can you open the door for me?\n\nMe: (paused for a second as I was trying to remember if someone had moved in recently, and I did recall seeing a moving van a couple days before) Oh ok, yes I can open it for you.  \n\nGuy: Can I just borrow your key?  \n\nMe: Uhhhh…  \n\nGuy: It’s cool, just tell me which unit you’re in and I’ll put it in your mailbox when I’m done.  \n\nMe: No. I will open the door and there’s a wedge inside you can use to prop it open.  \n\nGuy: ….Okay. Thanks.  \n\nI opened the door for him and started heading back towards my unit. Then I got the feeling I should look back, and I did and saw him standing in the doorway watching me. I was pretty uncomfortable about that, so I turned and went the opposite way that I would go and went behind the building and through a different entrance that I didn’t use since it took me the long way around. I just had a strong, strong feeling that I shouldn’t let this stranger know which unit I was in. Despite him saying he now lived in the complex, I never did see him again.  \n\nI can’t prove he was up to no good, but I’ve never had that kind of internal reaction to seeing a regular person before or since.",
   "created_utc": 1691268102,
   "score": 81,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxnibn",
   "message": "I was 11 or 12 and had to wait for my sister to pick me up after school as she had early release and cleaned a house (allegedly) and I had like choir practice or some shit after school related to a class so I couldn't skip it without losing credit. She was mad she had the burden of picking me up and driving me home, so she just quit coming on time and would show up at night reeking of pot and booze. \n\nI was at the school past teachers and janitors leaving and just sat outside until 8 or 9pm. These drunk assholes from the labor camp would stumble past me to get booze from the corner store and make gross comments. Eventually it got to where some days they'd come right up to me and try touching me and shit. I even sat behind the school instead so they'd think I wasn't there but they came looking anyway. \n\nWhen I complained to my parents (mom worked nights, but dad was just a lazy asshole who refused to pick me up and would shut the ringer off in the phone and ignore me calling) what was going on and that I was scared of the men they told me I was too ugly for that to be a problem and to quit lying for attention. I started walking home (only an hour) instead to avoid them.\n\nThere were a few of these gross drunk assholes and there was one in particular who on the last occasion had a different look to him and also seemed to be stone cold sober. The look he gave me was so fucking unsettling. I ran off and hid along a canal after they went into the store because I was afraid of what he'd do when they came back. A dude from parent's church (thankfully not a creep) saw me walking up the highway in the dark later by myself and drove me home. He was taken aback when he saw that my dad was home and did not gaf where I was or what was going on. That was honestly the last time I ever tried to get help from other people. I also got awesome legs, ngl.",
   "created_utc": 1691262444,
   "score": 49,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juzhye2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juy81vj",
   "message": "I was taking the buss home with my dog one night. Noticed a man sitting a few rows further down staring at me - like, really ***staring***, not just looking. It went on for some 10 minutes. The buss approached the last stop before mine, and for some reason I decided to slip out just as the doors closed. Even though he made me uncomfortable it didn't really have anything to do with the guy, I think I decided to let my dog stretch her legs a little before bed.\n\nI'm a brisk walker, and was striding ahead. As I made it about 100 metres or so down the path towards the neighbourhood I lived in, the man suddenly caught up, having gone out of his way to get off the bus - *at what was obviously not his stop* \\- after I slipped through the closing doors. He tried to make small-talk, and complimented my smile (I never smiled at him or anyone else on the buss) but I tried to politely brush him off and be on my way.\n\nHe then got infront of me and blocked my path, got in my face and very aggressively asked \"What? I'm giving you a compliment. You don't wanna talk to me?!\"\n\nOut of the blue a young woman appeared, asking for the nearby university. It was literally a stonetoss up the road, so she knew exactly what she was doing. As we walked towards the university the man skulked back to the buss-stop. I think about this girl every now and then, and have no doubt she saved me from what could have become a very scary encounter.\n\nThing is ... if I had decided to wait for my buss stop, I would have exited almost right outside where I lived. In a dark and secluded one-way street. There would have been no-one to save me from any kind of encounter there.",
   "created_utc": 1691270930,
   "score": 51,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juyg6ln",
   "message": "Had a guy in a dark ally ask me if I was willing to die for my wallet. I said no and that he's welcome to take the dust from it because I was broke to. He told me to take out my wallet and I did. It had a dollar in it and be told me to give it to him so I dropped it and took off running. I looked back and he was standing in the street with a rifle. He absolutely could have shot me. Still loosens the bowls when I think about it.",
   "created_utc": 1691274440,
   "score": 13,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juzsvt7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juz6der",
   "message": "I was really into hitchhiking in California years ago. 99% of the drivers were super cool and I made great memories, and then about 1 in 100 drivers were creepy AF or just realllllllly weird. So many crazy stories. The craziest and creepiest was on a month long hitchhiking trip up and down the 101 in the middle of the night I got picked up by a van. Almost immediately when I entered the car I got some yellow flags, trash everywhere, a rancid stank, and the dude was morbidly and visually unclean. I tried to make a little small talk and introduced myself as usual but he didnt respond, just kept driving. Red flag #1 was the first thing this dude said to me in a deadass serious tone was \"Haven't been a lot of murders this year have there?\".... I nervously laughed and started thinking about an exit plan. Red flag #2 was I realized the van locks had been cut off, they were the pop up and down door locks and they were just chopped down, so I couldnt unlock the door. I started freaking out a little bit and he was also driving really fast. I ended up faking like I was sick and about to throw up. I got him to pull over but he didn't turn off the car or unlock the doors. I frantically climbed back into the back of the van, and jimmy-d the trunk open. I then sprinted into the forest. Still gives me chills to think about that encounter to this day.",
   "created_utc": 1691286450,
   "score": 42,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juzk82d",
   "message": "I wish I hadn’t gotten to this so late, doubt this will get read..\n\nI was at a TJ Maxx with my wife. I (average looking dude, mid 20s at the time) went to the men’s section to look at clothes while she went to her stuff. While there, this guy started chatting with me while I was looking through the shirts. Small talk, nothing crazy. Which was already a bit weird, guys don’t usually do that sort of thing.\n\nI got bored and left to find my wife. Few minutes later he’s in the same aisle. Didn’t think anything of it. We walked to another aisle and he followed. I noticed this time. We went to another aisle that was strictly women’s clothes and he followed. I told my wife what was happening.\n\nWe then went to the complete opposite side of the store and he followed us there. We both freak out, leave the aisle, lose him, nearly run out of the store. As we’re leaving, I see him walking towards the front looking around like he was trying to find me.\n\nWe drove home SO fast haha. Still freaks me out a little bit thinking about it.",
   "created_utc": 1691293420,
   "score": 41,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juyqpps",
   "message": "I used to work at a liquor store and while I was on a smoke break a guy came up started small talking to me in bad English. He was 40 something Latino guy and he just had this look like he was not right in the head. He said he wanted to buy something so I went in and he got nude magazines and cleaning products. I didn't say a word but he looked at me and raised his eye brows and said \"my house is going to be fun tonight you should come by\" I said no and gave him a really disgusted look.\n\nHe leaves and I shake it off. A few minutes later a teenager on a skateboard comes in and gets a coke. He leaves and I hear talking outside but I had customers so I couldn't see what was going on. After a little bit the older guy comes back in and buys beer and duct tape. This time he's looking away from and not talking. I ring him up and demands a black bag. I bag his stuff and he leaves then the talking ensues. I poke my head outside. He was talking to the teenager. He goes over and quickly puts the bag in the truck but pulls out the beer. Heads over to the passenger side opening it and putting the beer in it then waves over the teenager.\n\nI ran up and ask the kid what he's doing. He tries saying \"none of your business man\" and I very clearly explain \"I don't care about the beer if he bought it for you, this dude bought duct tape, cleaning products and nude magazines. The beer is the least of my concerns. I'm about to call the cops on this guy don't go with him.\" He gives me a shocked look and says \"what the fuck... he just offered me a ride I'm not into that shit.\" As he's getting on his skateboard the man gets really upset with me and pulls out a knife saying something in Spanish. So I pull out my phone and pretend I'm recording him cause my POS phone had super cracked screen and only used it for receiving calls. But I memorize his license plate as he starts getting in his truck. He leaves and I call the cops immediately. Lucky he paid for the cleaning products and magazines with a credit card but paid cash for the duct tape and beer.\n\nThe cops tell me that truck and license plate has a warrant for arrest... wouldn't tell me what for but said they would find him and thoroughly thanked me for warning the teenager though. I wonder what he's done.",
   "created_utc": 1691279059,
   "score": 36,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juxo1h0",
   "message": "Hitchhiking...don’t do it.\nI narrowly escaped.",
   "created_utc": 1691262660,
   "score": 16,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juz778k",
   "message": "I was hiking in a remote area to get to an abandoned church that was rumored to be used by a satanic cult. I needed footage for a project for a video production course I was taking in my masters program. I was about an hour in to the hike when two people walked around the bend in the trail. Please keep in mind that I had hiked about two miles from the closest semi-public parking lot to get to this point. The first person looked to be at minimum 70, was relying fairly heavily on a metal cane, and had on a hospital-type blue and white mask. This was in October 2019, so it wasn’t too hot, but this was also pre-Covid and far from anywhere I would ever expect to see a medical mask. I’ve felt a lot of anxiety around unknown people in masks since, and I attribute a lot of it to this interaction. The second person was following closely behind him and looked to be their wife of similar age, but she didn’t have a cane or mask. I was immediately freaked as soon as I saw them. Masks weren’t normal then, and were the farthest from normal you could get considering it was 2019 and a mile deep into a wildlife management are. \n\nWe all paused for a minute and just stared at each other warily before I kept walking forward until we were about ten feet from each other. To this day, I’ve never felt so closely scrutinized by anyone. I felt so closely watched: every facial expression, every subconscious body movement. Their eyes were sharper than most people I’d ever met, and far beyond the sharpness I would ever expect to see in the average 70+ year old person. \n\nI could immediately tell that something was not right. My dad made me read “The Gift of Fear” when I was growing up, and despite being on a daredevil kick, I immediately knew I had fucked up going there alone. I had goosebumps, I felt like I couldn’t stay still, and I couldn’t stop the word vomit coming from my mouth. Upon thinking about it after, I realized that I learned not a single thing about them including who they were or why they were out there. However, by the time I walked off, they knew my name, my college, my dorm, my major, why I was there, what I was doing it, where I was planning on going, where I had parked, and that people were expecting me back at home before nightfall. They had asked specific questions to get that information from me, and I honestly answered 100% truthfully because I felt I couldn’t help but to. By the time they finished questioning me, they seemed more relaxed, but I knew without a shadow of a doubt that I needed them to realize that I wasn’t a threat. I think that’s why I overstated so much. I can’t put my finger on a single thing that did it, but I know I was in danger with them and it’s probably THE sharpest memory I have to date, bar none. \n\nI tried to take unexpected and more difficult to travel paths once I got past them. I ended up getting my footage for my project, but I also ended up stranded in a 26,000+ acre wildlife management area after nightfall with no cell service and a dwindling battery. \n\nI made it out, but it really changed my perspective on fear and reset the wild streak I had going at the time.",
   "created_utc": 1691286849,
   "score": 18,
   "submission_id": "15iuc5p"
  },
  {
   "comment_id": "juynobl",
   "message": "A bad one I had was as a kid growing up outside of Chicago and before having a cell phone. I just graduated 8th grade and summer break started. It got dark and my buddy and I were walking back to his house to play GTA San Andreas on his PS2. As we were about to cross the street, a car pulled up on us with around four guys in it and  no other vehicles on the street. We couldn't see their faces clearly as the orange glow of the street light illuminated everything but the inside cab. Driver started off with \"hey guys\", and proceeded to ask us what we were up to. They knew we were terrified. He asked about the skateboard I had just gotten for graduation, and the game in my friend's hand. I told him we were heading to my buddy's house to play the game. What was unsettling was no one in the back seat was conversing, it was dead quiet. The passenger in the front keep checking his mirror as did the driver checking his rear view. The contents of the whole conversation were akward with frequent periods of silence like they were just trying to find shit to say. As a kid I was always ignorant in thinking I could fight my way out of any situations if need be, but that fantasy was shattered as the reality set in that these 4 dudes in their 20's-30's could do whatever the wanted if we were caught. My buddy's responses to these guys were very soft-spoken almost to a whisper, he couldn't even think straight. My gut dropped as soon as they offered us a ride. Without looking at my friend, I said run. I knew out of the two of us, my buddy was faster as he was a sprinter and it would mostly likely be me getting taken. We both ran past the back of the vehicle, into an alley behind a supermarket, then into random people's yards, I didn't even think to knock on any doors or scream. I heard tires peel off, and realized I got separated from my friend. We ultimately found each other by his house a few miles down the road. Never saw that car again\n\nStill think of that to almost two decades later.",
   "created_utc": 1691277677,
   "score": 13,
   "submission_id": "15iuc5p"
  }
 ]
}