{
 "submission_id": "15iwua7",
 "title": "What healed your depression?",
 "selftext": "",
 "created_utc": 1691244971,
 "permalink": "/r/AskReddit/comments/15iwua7/what_healed_your_depression/",
 "score": 51,
 "url": "https://www.reddit.com/r/AskReddit/comments/15iwua7/what_healed_your_depression/",
 "comments": [
  {
   "comment_id": "juwfk82",
   "message": "You guys are healing your depression?",
   "created_utc": 1691245048,
   "score": 153,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwfry6",
   "message": "A lot of reading up on depression and PTSD. I couldn’t afford therapy, so reading and learning about why I do the things I do, and react the ways I do to things was paramount. \n\nIt’s easier to work through the things going on inside your head when you can understand why they are happening in the first place.",
   "created_utc": 1691245137,
   "score": 40,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwffem",
   "message": "Money.",
   "created_utc": 1691244993,
   "score": 70,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwgj0b",
   "message": "A number of things\n\n* Dog at home, shop cat at work\n\n* Talk therapy, medication\n\n* Took a week off work for mental health, and went on a road trip with my dog\n\n* Major promotion at work increased my salary by over 40%\n\n* Cut out sugars, sodas,. Ate more vegetables, fruits, drank water and juice.\n\n* Started exercising - simple walks through a local park. Most of the time my dog tags along.\n\n* Find a hobby - I discovered a passion for nature photography during the road trip. It brings me peace.",
   "created_utc": 1691245455,
   "score": 37,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwl95y",
   "message": "Music and not giving a fuck",
   "created_utc": 1691247457,
   "score": 15,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwqeor",
   "message": "Vitamin D, yoga and a big smile! Jk, I’m on a shit ton of meds",
   "created_utc": 1691249570,
   "score": 17,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwkz7k",
   "message": "Wait you guys depressions healed",
   "created_utc": 1691247340,
   "score": 8,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwm1ko",
   "message": "Meds",
   "created_utc": 1691247786,
   "score": 7,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwvluc",
   "message": "• Stray Kids (it helps to follow a fandom)\n• Working out\n• Better Routine\n• Stepping out my comfort zone every once in a while\n• more poitive music\n• Eating cleaner\n• writing poetry\n• sketching\nReally, just things that genuinely made me feel good about myself, it does help. And in the long run, it does happen to be better for you.",
   "created_utc": 1691251645,
   "score": 7,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwog9d",
   "message": "Wait, we be healing depression? What?",
   "created_utc": 1691248770,
   "score": 7,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwute2",
   "message": "Not healed completely but in the process. Realised need help when the symptoms started becoming more physical. Turns out it's completely Okay to seek help and you don't have to do this alone. 💙",
   "created_utc": 1691251339,
   "score": 5,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwg0hf",
   "message": "meds",
   "created_utc": 1691245236,
   "score": 5,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwlt1f",
   "message": "My depression was called by Alcohol Addiction and when I stopped drinking my depression also stopped",
   "created_utc": 1691247688,
   "score": 4,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux3u4u",
   "message": "Getting a non-soul sucking job, dumping the leech of a boyfriend.\n\nMagically my \"depression\" was cured. It's a medical miracle.\n\n(So clearly I didn't have medical depression, it was more of a situational depression but when you're smack in the middle of of surrounded by fire going \"This is fine\" it's really hard to tell.)",
   "created_utc": 1691254909,
   "score": 5,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwhwco",
   "message": "Drilling a hole in my head to let out the bad shpirits",
   "created_utc": 1691246041,
   "score": 9,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwfs7j",
   "message": "Time and new projects. Basically I recalled what I wanted before what got me into depression",
   "created_utc": 1691245140,
   "score": 9,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwg4vq",
   "message": "Stopped drinking and mushrooms 🍄",
   "created_utc": 1691245286,
   "score": 8,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwuuyi",
   "message": "Healed? Rriiiiiggghhhhttt...",
   "created_utc": 1691251357,
   "score": 4,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwzf2m",
   "message": "My dog. I finally felt like I had a friend that truly loved me.",
   "created_utc": 1691253162,
   "score": 4,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwhl0w",
   "message": "Becoming a powermod, banning people for no reason, and never leaving the house. Per se.",
   "created_utc": 1691245908,
   "score": 3,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwk59a",
   "message": "I wasn't exactly depressed during this period but for multiple reasons second year of junior high was pretty rough for me.(Things such as a porn addiction as well as a video game one along with poor academic performance etc not really gonna delve more into details.) I'm currently on vacation at my hometown and getting to see my friend group there helped me a lot since it gave me an opportunity to go out more often which led to a dedox from all my addictions and overall just really helped me out.I think I have even discovered some dreams and aspirations for the future and I hope next year of school will go smoother.sorry if this was hard to read  im not a native english speaker.",
   "created_utc": 1691246989,
   "score": 3,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwnwxl",
   "message": "Quitting a very toxic job helped but unfortunately it still comes back every once and while",
   "created_utc": 1691248550,
   "score": 3,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juws3wb",
   "message": "Video Games",
   "created_utc": 1691250261,
   "score": 3,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwss4j",
   "message": "Time",
   "created_utc": 1691250539,
   "score": 3,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwzyd6",
   "message": "Magic mushrooms. There is a lot of research on it.\n\nOne morning I prepared a bit of fruit, juice, and made something like tea with green tea and magic mushrooms. Then after drinking the tea, I was tripping for hours until about six hours later things got back to normal. Except that the depression simply was not there anymore. \n\n\\-Highly recommend, but read up on it first. A setting where you feel comfortable and safe is very important.",
   "created_utc": 1691253378,
   "score": 3,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxrv8x",
   "message": "I found a SIR and spent the last year letting someone else make decisions for me, including being in therapy. The sex has been amazing, I have recovered mentally and financially and I am enjoying life. Not for everyone, but sometimes us “Control freaks” need to be out of control for a while.",
   "created_utc": 1691264231,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwpkud",
   "message": "I'm still healing, but what started making me less depressed was musical theatre and Catholicism!! I feel validated, appreciated for what I am, though I'm still fighting those bad thoughts. If you're going through this, remember the darkest hour of the darkest night comes right before the dawn. 🤍",
   "created_utc": 1691249227,
   "score": 5,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwfjug",
   "message": "Going outside and walking, making friends",
   "created_utc": 1691245044,
   "score": 3,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwnwyr",
   "message": "Acknowledging that I was suffering from depression to begin with.",
   "created_utc": 1691248550,
   "score": 2,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwtm89",
   "message": "I got a temp raise at work for 6 months, made 48 an hour. I wasn't told it was temp BTW. During those 6 months I started thinking about the future and things I could do and I was feeling happier. The my pay got slashed back to 30 an hour, and if I didn't accept I'm fired. And back the depression comes lol.\n\nI know 30 an hour probably sounds good, the city I live in has an average rental rate for apartments of 2900 a month. At the end of the day I'm paycheck to paycheck. Can't even save up for retirement.  I'm in my 30s.",
   "created_utc": 1691250867,
   "score": 2,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwwq6y",
   "message": "Antidepressants lmao. (But I assume when/if i go off it my depression will come back so idk if im healed or not)",
   "created_utc": 1691252084,
   "score": 2,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux3suw",
   "message": "Memory loss",
   "created_utc": 1691254894,
   "score": 2,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux4ug6",
   "message": "A change of circumstance.  My depression was circumstantial and I just didn't realize it because I had a low degree of self-awareness. Sometimes depression starts on the outside, even though it's viewed as starting on the inside.",
   "created_utc": 1691255296,
   "score": 2,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux5rrj",
   "message": "Short term depression can have a path to healing. Long term traumatic depression is about management.",
   "created_utc": 1691255641,
   "score": 2,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux8id1",
   "message": "An Ayahuasca journey at a great place. Lots of therapy and then a couple evenings of Ayahuasca. Realized I had locked myself inside and was surrounding myself with thoughts of shame and insecurity. I wasn't being me. I freed myself and let go of the shame and I felt the depression lift. Then realized I was making all my decisions based on fear. When I was scared I ran away from it, when I wasn't scared I would do it. But what I was scared of was what mattered to me, and what wasn't scary didn't mean anything to me. So I was not doing what would be fulfilling and make me proud and I was only doing what left me empty and was meaningless. So I faced my fears, worst night of my whole life, and now I do what makes me feel proud even if I'm scared. My life is totally different than it used to be.",
   "created_utc": 1691256667,
   "score": 2,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxc1e5",
   "message": "Thyroidectomy\n\nMy GP had sent me to a dayhab clinic for a month. No better.\n\nTell my endo that 'yes I know my TSH levels are normal but shits fucked take it out.'\n\nProblem solved",
   "created_utc": 1691257984,
   "score": 2,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxp875",
   "message": "3.5 grams of psilocybin four times a year. Totally changed my life.",
   "created_utc": 1691263138,
   "score": 2,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxscsq",
   "message": "Pet rats",
   "created_utc": 1691264433,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwon18",
   "message": "weight lifting. I started working out for aesthetics but as time went by, it improved my depression. I also tried therapy and meds before the gym but I felt numb and still unheard.   \n\nThere are days I don't want to work out and would much rather stay in bed, but most of the days when this happens, I force myself to go since I know one or two days will turn into a week and then a month and I don't ever want to be in the same dark space I once was.",
   "created_utc": 1691248846,
   "score": 3,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux2f6d",
   "message": "Literally the only thing that healed my depression after 8 years is god. I was outed 2 times in 2014 which caused a major depression. Around 2018-2011 i started working for a shity job at Walgreens which enhanced my depression and anxiety. Then i got fired and everything started looking up after that. I finally got my license, got a better  stressfree job and Best Buy (im a tech nerd) and now im im going back to school to getting my computer certifications. And now I’m in the process of going into my dream job (Apple retail) Literally I didn’t think any of this would be possible especially interviewing with my dream job!! God is good and I wouldn’t be where I am today’s without him!!🙏🏽🙏🏽",
   "created_utc": 1691254354,
   "score": 5,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwmhmd",
   "message": "Fluoxetine, bupropion, and aripiprozol. Therapy can be cathartic, but it's not the end all for me. The fluoxetine and bupropion allow me to regulate my mood but I get into kind of a dull plateau, which is highly functional, but not super fun. The aripiprozol lets me get excited and happy about things. I'm still not a \"happy\" person, but I can have fun with my kids, be social, and not just want to go to sleep all the time.",
   "created_utc": 1691247968,
   "score": 3,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwxyiu",
   "message": "Meditation and therapy.",
   "created_utc": 1691252576,
   "score": 2,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwyjzu",
   "message": "Antidepressants",
   "created_utc": 1691252815,
   "score": 2,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwgp9s",
   "message": "Jesus Christ. I finally admitted that I needed help and he pulled me out of that darkness. I still struggle with it sometimes but the joy He has given me goes beyond understanding.",
   "created_utc": 1691245531,
   "score": 255,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwyqy5",
   "message": "Clinical is ongoing therapy and possibly meds. If it's something like grief, there's therapy and support groups,  and maybe short term meds.",
   "created_utc": 1691252895,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwtx2k",
   "message": "Understanding that underlying the concept of mind/soul-body is a philosophical position called dualism. Dualism argues there is \"mind/soul-body\" two entities. Well, there are philosophical and scientific arguments that explain that no such duality exists. This counter philosophical position is called non-dualism.\n\nSo, read up literature on this position, ranging from religious to academic. Slowly that changed my outlook, especially of the fields that arise out of dualism as accepted first premise to a non-dualist philosophy.\n\nAdd on top of that, learning about linguistics, improving speech, comprehension, expression and grammar. (Still learning of course)\n\nThat did it, cured it all for good. For what does not exist cannot be ill/diseased i.e mind. \n\nTL:DR These words and thoughts; train them people and see the change for yourself.\n\nMay you find joy and peace in just living as you are.",
   "created_utc": 1691250985,
   "score": 0,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux34yj",
   "message": "The Dharma. Honestly that bald headed fucker cracked the code of the mind over 8,000 years ago",
   "created_utc": 1691254636,
   "score": 0,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux9519",
   "message": "Microdosing 🍄\n\nI don’t wanna be that guy who’s preaching as if it was a game changer for everyone but it worked very well for me. \n\n.2-.3g and the effects kick in after 45 minutes. Brain fog is gone, anxiety is gone, energy is up, creativity through the fuckin’ roof too. I only microdose when I need it, in very busy social environments and there’s no addiction or side effects.",
   "created_utc": 1691256902,
   "score": 0,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxmied",
   "message": "I genuinely don’t believe I ever had it \n\nThat’s what healed it\n\nCrazy I’m too busy for you to tell me I do in person face to face and *poof* I’m healed",
   "created_utc": 1691262034,
   "score": 0,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwrnlg",
   "message": "Alcohol",
   "created_utc": 1691250075,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwxdj0",
   "message": "I am def not healed yet but a whle ago met an amazing friend on reddit who listens to me, gives me some amazing advice, cares about me, and is an overall amazing therapist and friend for me. And that has helped me so unbelievably much.",
   "created_utc": 1691252344,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juwyfy3",
   "message": "meaningful occupation plus workout",
   "created_utc": 1691252771,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux0uvw",
   "message": "I quit using methamphetamine, left a graveyard shift job that was making me miserable, started bicycling 6 miles a day. Began a new career I'm very happy with. Some breakthrough experiences with hallucinogens/microdosing mushrooms along the way helped.",
   "created_utc": 1691253737,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux240g",
   "message": "Mushrooms and therapy",
   "created_utc": 1691254236,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux33gw",
   "message": "I was born depressed. I keep it at bay with sex, drugs, and rock \u0026amp; roll. When that all inevitably stops working, I'll take the next step.",
   "created_utc": 1691254619,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux4cls",
   "message": "Microdosing and 20 MG of Prozac",
   "created_utc": 1691255108,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux5h0c",
   "message": "Talk therapy, SSRIs and The Feeling Good Handbook by Dr. David Burns.",
   "created_utc": 1691255532,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux622h",
   "message": "Confidence. Situational awareness and confidence. Losing that unheals me.",
   "created_utc": 1691255746,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux7i7n",
   "message": "For the moment, baldurs gate 3.",
   "created_utc": 1691256285,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux7qpo",
   "message": "Nothing. I have treatment-resistant depression. Been in therapy and taking meds off and on for over 20 years. Guess I’m just not meant to be happy.",
   "created_utc": 1691256376,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux8o9c",
   "message": "A random Gartic Phone vc in discord.",
   "created_utc": 1691256728,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "jux9j8r",
   "message": "Doing acid one time in college gave me a completely new perspective on life and cured my depression.",
   "created_utc": 1691257048,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxbauj",
   "message": "One thing that helps with me is thinking of it as a chronic condition, kind of like an allergy. (Sort of.) It's a condition that comes and goes.  \n\nThinking of it like that gives me a bit of agency over it. When it goes, take notice and make use of the brief boost in energy one gets. Once you've pushed it back a bit, there are many techniques you can use to stave it off again. All the classics: get outdoors, go buy some healthy food, exercise, clean up your kitchen, get a haircut, whatever works for you. Just keep throwing shit at that wall so it doesn't close in on you again.  \n\nI started keeping a record of what works and what doesn't. If something works, I try to keep it up. Writing it down every day (after I do it) works for me as a reminder. And the best thing is that the things that work for you feed upon themselves when you do them. They give you more energy to keep it going, they spread seeds like plants in a garden.  \n\nIt's not all good days, but treating it like a chronic condition *and actually treating it*, is what helps me.",
   "created_utc": 1691257706,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxblty",
   "message": "It's interesting but I started to develop depression like symptoms a while back, never reallt understood why. But I met a really good new friend and she's been a really awesome person to talk to and she listens when I need it. I also have her and a couple others who I've just been able to talk to regularly and it's really nice. Not necessarily healed but I feel really good knowing there's people I can talk to.",
   "created_utc": 1691257823,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxd5e3",
   "message": "Making peace with myself. Growing. Making better choices. Deciding not to accept everyone else's opinion. Accepting myself.",
   "created_utc": 1691258407,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxdhz7",
   "message": "I don’t think I’ll ever be able to heal my depression. I think it’s a part of me now",
   "created_utc": 1691258538,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxdks6",
   "message": "Sharing lol. I didn't even share all of it.",
   "created_utc": 1691258568,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxdxmv",
   "message": "It's supposed to heal? Mine isn't.",
   "created_utc": 1691258700,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxdy45",
   "message": "Dumped my bf",
   "created_utc": 1691258706,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxdzps",
   "message": "nothing lmao",
   "created_utc": 1691258722,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxearo",
   "message": "my summer camp that i went to as a teenager. i’d been suffering through a lot of stuff the summer after 7th grade, especially because my mom had been diagnosed with cancer. i was signed up for six weeks at camp, and i genuinely had the best times of my life there, and i can still remember almost every second. i went again after 8th grade for two weeks, which was the last summer i could go before i aged out, and i still remember my last day like it was yesterday. when it ended, it felt like someone died.",
   "created_utc": 1691258839,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxeim0",
   "message": "I got help. Got on the right meds. Took the little victories.  Got On a consistent sleep schedule went to school and got a job",
   "created_utc": 1691258922,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxfa2j",
   "message": "My depression is a constant. I can make it better with exercise, diet, therapy, feeling good about small accomplishments, and maybe medication. It will never go away completely because it is part of my wiring and/or a side effect of being neurodivergent in a world that doesn't tolerate neurodivergence well.",
   "created_utc": 1691259207,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxfv3k",
   "message": "I still deal with it from time to time (like when my grandmother and dad died in the same year…)\n\nBut getting out of high school and getting a job did wonders for that teenage depression I had.  Getting out of a generally toxic environment and away from people who were keeping me down, and doing something physical and somewhat constructive…wow.  Total mindset change.\n\nFeeling down and depressed sometimes is fairly normal.  When it continues for months, or years, and leads to suicidal thoughts or physical harm (I tended to cut) is when it starts to go to far.  That’s when you need to find someone to talk to, be it a family member, friend, or even a doctor…just someone you trust and know won’t steer you wrong or give bad advice.\n\nWe all need trusted, supportive people in our lives.  Even just one.",
   "created_utc": 1691259424,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxgfbl",
   "message": "When my mom, siblings and I got kicked out of our house by our grandparents (my dad cheated and his parents owned the property), we moved and it got a little better, not many thoughts of self hurt, etc but when I moved out with my bf it helped so much. He brushed out my knotted depression hair which just gave me this.... Heaviness lifted off my chest. He helped me through a lot of the times I wasn't in a good mental state and I love him for that",
   "created_utc": 1691259634,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxgphc",
   "message": "definitely not healed but a lot better after detaching from my parents and any other people that just kept using me and treating me terribly all the time. being alone is far easier than being around people like that but I think I'd still like to find people that do actually like me. that part is what keeps the depression.",
   "created_utc": 1691259741,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxgwut",
   "message": "Micro dosing. Bam.",
   "created_utc": 1691259819,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxgz7x",
   "message": "Depression can’t always be healed, seasonal and short term sure. It really depends on what triggers it and what other mental ailments you have along with it.",
   "created_utc": 1691259845,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxhn2y",
   "message": "Surround myself with people that I vibe with. Don't hang out with people that make you feel shit. \n\nDon't look at the past, it happened. It cannot be changed, but the future can. \n\nI'm not saying its all sunshine and daisies, we have good days and bad.",
   "created_utc": 1691260107,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxhtfd",
   "message": "Healed? I learned to cope with it. Putting one foot in front of the other. As cheesy as it sounds that worked for me. Doing the \"uncomfortable\" task. Hint...it is easier than your brain wants you to think it is.",
   "created_utc": 1691260177,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxikt9",
   "message": "Nothing, it just went away on its own, no rhyme or reason. And I had it really bad too, didn't care about anything or anyone and now I'm a pussy who cares about everything and everyone\n\nIt helps to have someone to talk to but don't bring them down with your depressed thoughts, no body really cares about other people's problems",
   "created_utc": 1691260473,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxj452",
   "message": "MMDA and a \"summer of love\".",
   "created_utc": 1691260682,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxjnzz",
   "message": "The Red Hot Chili Peppers",
   "created_utc": 1691260895,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxjy9d",
   "message": "video games and having empathy for others\n\ni mostly play games on my free time\n\ni often compliment others, donate to charities, smaller streamers, and i tip very well. even if it's for the smallest gestures like letting me go first in line at the checkout or drive thru\n\nit gives me some happiness",
   "created_utc": 1691261010,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxjyy5",
   "message": "Money or death will. I will probably never get the former 😅",
   "created_utc": 1691261018,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxk53q",
   "message": "Haven’t found out yet",
   "created_utc": 1691261087,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxkuke",
   "message": "stopped trying to be normal and decided to just roll with it.\n\nI think I heard a saying about how a fish is really bad at climbing trees and shouldn't compare themselves to monkeys. A lot of people are just in the wrong world.\n\nAlso, therapy and drugs.",
   "created_utc": 1691261374,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxl763",
   "message": "Medication, therapy, opening up about it to my loved ones, a major change in my diet, as well as I became a lot more physically active. I pretty much went and overhauled my whole life as I was desperate to feel better.",
   "created_utc": 1691261509,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxlb7k",
   "message": "Cbd gummies, losing weight, eating healthier (just stopped with shitty frozen food), quit drugs and alcohol, got some hobbies, keep myself busy with tons of jobs, and allowed myself to make mistakes\n\nDidn’t heal me, but sure as dick made it much better. I’m still unwell sometime but at least I don’t plan on killing myself anymore.",
   "created_utc": 1691261553,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxlbii",
   "message": "You can't",
   "created_utc": 1691261556,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxlxm8",
   "message": "I (28yo at the time) went through a hard break up after years of emotional abuse in my previous relationship. I had nowhere to go so I lived in my car for 3 months until I managed to save some money to rent a cheap place and start over (was lucky to have a job where I could shower and had a microwave where I could heat up ready meals from the supermarket). \n\nYoga and gym kept me going for a while, together with keeping myself busy at work (took a lot of side projects in the company on purpose so I would not have time to think about anything else), but after finding a place to live I succumbed into alcohol, weed and some other drugs. \n\nThe way I see it looking back now is like when you go to the beach and seat under the sun for hours, when you go back home you kind of think \"oh, im not really burned actually\", but only later when you have a shower and go to bed you realize how much sunburn you got. \n\nI ended up leaving the country and starting fresh, gave up on drinking and all drugs, and for me the most important:\n\nKickboxing, 5 times a week, 2 hours sessions. That is what keeps my depression away while helps me connect with people and reward my body and my mind for the hard work. I feel sometimes the depression lingering when facing some sad times in life, like we all do, but I found out that exercising and keeping myself busy with small projects its the most effective way to combat what I believe to be a very serious illness. \n\nI try to give myself a fighting chance with a more or less decent diet (some junk food every now and then makes me happy too), exercise, social connection and whenever I can, some sun. Also, I have my own concept of who God is and how much He loves us, so I guess that faith helps me above all as well. \n\nFor anyone going through hard times and is reading this, I hope you know that, one day after the other, little by little, things will get better. So don't give up. Im now 32yo, and for the most part, I believe I am quite happy. \n\nA little last advice: I learned that our mind is the most powerful thing, so be careful with what you put inside it. What you read, watch and listen to, this can all play a very positive or negative effect in your life. Much love to everyone, stay bless : )",
   "created_utc": 1691261801,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxm2tm",
   "message": "Nothing heals it. Time and medication can keep it at bay for a certain period of time. \n\nAlso, taking actions that help others is very helpful. I like to do thoughtful things that do not get found out. It is impossible to feel crappy when you are doing something thoughtful for another person.",
   "created_utc": 1691261858,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxm96r",
   "message": "Mushrooms",
   "created_utc": 1691261929,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxmpbp",
   "message": "That happens?",
   "created_utc": 1691262113,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxmvvb",
   "message": "Training calisthenics and music.",
   "created_utc": 1691262191,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxmxam",
   "message": "Nothing, I just found different things to distract me",
   "created_utc": 1691262208,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxn0jp",
   "message": "new, exciting gf",
   "created_utc": 1691262244,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxnb3x",
   "message": "My cat",
   "created_utc": 1691262363,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxnhq2",
   "message": "You can’t heal depression, I think it’s a natural part of being human. whether it’s just having the blues or a clinical problem, there’s really no avoiding it. But for me, personally around the time, the world sort of stopped with Covid, and I felt very isolated and alone with my thoughts; I started listening to the Grateful Dead, and that really brought me a lot of peace and joy.",
   "created_utc": 1691262437,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxnqi9",
   "message": "I wouldn't say I was healed by any means but I feel better after gratitude journaling (it sounds happy but simetimes those prompts hit hard and it feels good to get it out), walking in nature and finding things like rocks and shells and feathers to collect, and a home spa day where I do a face mask and a hair mask and I paint my nails and just really focus on making myself feel good and clean.",
   "created_utc": 1691262536,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxnxi8",
   "message": "Honestly being idle is the worst thing for it, being busy doing anything and everything working out what you like and dislike and what you’re good at vs bad at just staying too busy is a great start",
   "created_utc": 1691262615,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxo0l4",
   "message": "I adopted a dog. He gets me up in the morning, makes me walk in the evening, and makes me laugh several times a day.",
   "created_utc": 1691262649,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxodvz",
   "message": "My recovery journey started with medication and ended with me leaving a long-term toxic relationships. My now-husband suggested I take a break from the medicine and after the withdrawal period, I haven't needed them since. Been 3 years now, with some occasional ups and downs, but the change of environment really helped.",
   "created_utc": 1691262798,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxogoe",
   "message": "LSD-25.\n\n100ug to start.\n200ug to dive deep.\n+350ug to find yourself in the universe.\n\nIf you have any variation of schizophrenia, \nplease DO NOT ingest LSD-25. \n\nIf you’re on ANY SSRI medication, please do your due diligence and factor ALL RISKS associated with dosing.\n\n\n\nEdit - \n\nMy depression isn’t “cured”, but my suicidal ideation is gone, I’m able to enjoy things I used to be passionate about again. I find myself laughing at my own thoughts and ideas, things are interesting again, colors are vivid and I’m able to laugh \u0026amp; cry again. \n(It was borderline impossible for me to do so before)\n\nI forgave myself for things I’ve done, and I learned to deal with lifes uncertainties, and to let go of anything that isn’t positively adding to my life.\n\nIt helped MASSIVELY curve almost all other substances I was using to cope.\n\nMy Setraline dosage has been slowly decreasing, I’ve learned to learn \u0026amp; apply healthy coping mechanisms, and how to accurately express how I’m feeling in any situation.\n\nI am a lifetime away from the nights I spent in a Psych Ward after attempting suicide back to back on the same night.\n\n\nI don’t condone or recommend anyone uses or attempts to treat their clinical depression with LSD-25.\n\nI can only share what has worked for ME and ME ALONE.\n\nLife is short guys. Very short.",
   "created_utc": 1691262832,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxot6m",
   "message": "Medication and therapy, heavy on the former.\n\nI discovered through trial and error that I need to be on at least a prophylactic dosage  or my brain decides to go back to a baseline depression level. The antidepressants allow me to function at a more neutral level so I can address the issues in therapy.\n\nAlso [antidepressants are so not a big deal](https://youtu.be/OG6HZMMDEYA).",
   "created_utc": 1691262970,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxou4q",
   "message": "Antidepressants lol",
   "created_utc": 1691262980,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxp3o7",
   "message": "Exercise.",
   "created_utc": 1691263087,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxp65z",
   "message": "Working, making money, investing, exercising, and smoking weed.",
   "created_utc": 1691263116,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxplgq",
   "message": "meds and changing my mindset",
   "created_utc": 1691263289,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxq29g",
   "message": "An Epiphany, philosophy, a large amount of reasoning out the finer details, love of the small things and finally the best woman I have ever met.",
   "created_utc": 1691263477,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxq2fq",
   "message": "Being content with the present",
   "created_utc": 1691263479,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxqjat",
   "message": "11 years now and I still haven’t found a way.",
   "created_utc": 1691263673,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxqspp",
   "message": "Antidepressants, anxiolytics, exercise, and a good therapist. And a job that doesn’t make me want to end the universe.",
   "created_utc": 1691263785,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxqu38",
   "message": "Nothing. I don't believe depression is \"fixable or heal-able\". I remember when I started therapy again a few years back and Mt therapist asked what my goal was by going to therapy. I told her I know I'm always gonna have to deal with this that sometimes I won't get out of bed sometimes ill want to die sometimes ill cry for apparently no reason but I want to know how to cope with those days and learn from it them move past it. I think a more reasonable goal that healing it is to learn to live with it but to not let it hold you back so much. Like one thing I do on bad days is hike because ultimately I'd rather be depressed and crying amongst the mountains and streams rather than crying watching the same show I've seen 100 times.",
   "created_utc": 1691263801,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxqw3m",
   "message": "Cannabis",
   "created_utc": 1691263823,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxriw6",
   "message": "Gort and Quandale.",
   "created_utc": 1691264088,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxrkqz",
   "message": "Pure spite.   \nAt some point I just got so angry about my own despression that just started to force myself to change everything that kept me down.   \nI basicly just decided to be angry instead of sad and used the resulting energy to change things.",
   "created_utc": 1691264110,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxrocc",
   "message": "I read a lot of materials about how to improve myself and the one thing that stuck with me is how your physical body affects your mind even a better posture when you feel bad makes a difference. I can trick my mind to feel better if I want to but it takes time and exercise.",
   "created_utc": 1691264151,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxs8gx",
   "message": "My daughter.",
   "created_utc": 1691264382,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxsdhw",
   "message": "Honesty. I lived a life where I suppressed my emotions and hid a lot of my situations to not feel judged. \nI drank alcohol to cope and I feel like it hindered my ability to be happy without it. It made happiness unreachable when sober and sadness was always within reach.\nNow I’m honest about who I am and I actually have friends I like, and can move away from things and people I don’t like. Most importantly, I let myself feel my feelings and keep it moving. My life isn’t amazing, but it’s mine and it feels like it.",
   "created_utc": 1691264441,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxsf6m",
   "message": "Talking.\n\nAt first to a therapist.  Then to a sponsor.  Then to a bunch of people who have become like family to me.",
   "created_utc": 1691264460,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxstla",
   "message": "Work. Bills. Life. Focusing on logistics and the practical keeps me grounded and able to function,",
   "created_utc": 1691264629,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxtjjq",
   "message": "Understanding myself, my drives, my likes/dislikes, and my limitations regarding what triggers certain emotions and behaviors within myself, and knowing when/how to avoid these triggers.\n\nHaving something in the horizon to look forward to.\n\nHaving opportunity.\n\nRomantic love.\n\nMoney.\n\nIf im lacking any one of these things, I become depressed.",
   "created_utc": 1691264933,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxtkl7",
   "message": "Gaslighting myself into not being depressed",
   "created_utc": 1691264945,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxtree",
   "message": "A new day",
   "created_utc": 1691265021,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxtvrp",
   "message": "Years and years of therapy gave me the tools: mindfulness, insight, patience, self love, etc.  Ketamine assisted therapy sessions helped convince me that I wasn’t cursed to always feel like death, and made my tools sharper.\n\nBut it will never be “cured.”  It’s part of me, a darkness that lets me better appreciate the light, a signal that I have to take care of myself.",
   "created_utc": 1691265069,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxu54g",
   "message": "Unfortunately, what I have can't be fixed.",
   "created_utc": 1691265176,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxue6r",
   "message": "The only time in the last decade I had a really good grip on my depression was when I fell head over heels in love with someone.. I didn't deal with my depression, I put her requirements of me above the problem and I felt great ... For a while 😞",
   "created_utc": 1691265280,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxumij",
   "message": "Being in love again",
   "created_utc": 1691265379,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxuqab",
   "message": "Him.",
   "created_utc": 1691265423,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxur9a",
   "message": "Helped, not healed.  Hitting the gym on the regular.  Especially lifting weights.",
   "created_utc": 1691265435,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxurhs",
   "message": "Getting of that damn phone and actually go outside in the forrest and have a good time exploring.",
   "created_utc": 1691265437,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxutcm",
   "message": "There’s no one cure for depression. Instead, lots of smaller things combine to do the work:\n\n- Lifestyle changes to sort out your work/life balance, exercise regularly, and get enough sleep\n- Dietary changes to eat more healthily, cut out triggers (like alcohol/caffeine), and to stay properly hydrated\n- Talking therapies to give you the mental tools to address your problems\n- Communicating with your friends/families etc. to build up a support system \n- Medication, to help ease the transition and make all of the above more effective\n\nObviously, all of the above is much easier if you have the means to access it all.",
   "created_utc": 1691265458,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxv1ff",
   "message": "Prozac. That shit was a gift from the gods. Literally saved my life.",
   "created_utc": 1691265549,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxv4ep",
   "message": "Divorce.",
   "created_utc": 1691265583,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxv4sz",
   "message": "Still healing from a divorce, but finding a group of people who share the same interests, reading and journaling, and walking my dogs everyday",
   "created_utc": 1691265588,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxv7ud",
   "message": "Therapy, anti depressants and eventually medical marijuana when I moved to an MMJ state.",
   "created_utc": 1691265623,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxva9g",
   "message": "Friends online",
   "created_utc": 1691265650,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxvbt0",
   "message": "Nothing. I have been struggling with and working at it for 22 years.",
   "created_utc": 1691265667,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxvdu5",
   "message": "Depression doesn’t “heal” but Lexapro, therapy and an active lifestyle help",
   "created_utc": 1691265690,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxvhba",
   "message": "Taco Bell porno and diesel trucks",
   "created_utc": 1691265730,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxvokj",
   "message": "If you've always been depressed how would you know maybe looking back normal seems like childhood but acting like that it's not healthy.",
   "created_utc": 1691265812,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxw3oj",
   "message": "Mushrooms and endurance training.",
   "created_utc": 1691265981,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxw5sp",
   "message": "Not cure it, but take me from just barely surviving to believing I could turn my life around- yoga. But I did a high intensity version every single day for months and months. And I’m aware that some people can’t even leave the house. It became a focus for that year, and it made me feel something again",
   "created_utc": 1691266006,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxwc2o",
   "message": "Divorce, and a whole lot of weed. Prescribed of course. It helped with the PTDS and trauma from the abuse from my wife.\n\nI've felt great (as good as it gets) since leaving her. My bad days are fewer, further apart and are shorter than before.\n\nI still hate winter though. That's still rubbish. And I forget stuff... But my depression is much better managed.",
   "created_utc": 1691266078,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxwhs9",
   "message": "Tao Te Ching",
   "created_utc": 1691266144,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxwiw9",
   "message": "Becoming busy and productive, earning money.",
   "created_utc": 1691266156,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxx0kn",
   "message": "Therapy, sobriety, and honestly just admitting and accepting that this is a disease I have to put work into maintaining like every other. \n\nMy sister has a congenital heart defect and she has a million appointments, prescriptions, and certain restrictions she has to deal with in terms of behaviors. This is something she has to live with and take care of if she values her life. \n\nI had to admit to myself that mine was the same. This wasn't going away. All the little \"things\" I put into keeping my demons at bay are just as important as prescriptions. Exercise is not something I can just shrug off. Keeping positive habits- journaling, a meticulous calendar that accounts for various aspects of my mental wellbeing, adequate sleep - not optional or maybe I'll get to it. All important things I have to keep going when I'm feeling good. Seeking out help when needed. Taking days for myself when needed. \n\nI find that when all my systems are running, it's like a well-orchestrated symphony. It took me years to put all this into place. Piece by piece. \n\nAnd I'm actually happy now.",
   "created_utc": 1691266357,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxx6li",
   "message": "Daily exercise and routine, trying to take responsibility of things I would usually be defeatist about. Ultimately accepting only I can fix what’s wrong with me and not relying on other people.",
   "created_utc": 1691266426,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxx88f",
   "message": "Somebody told me \"You don't look depressed. I know exactly how you feel, you just need to be happy instead of sad! It's all in your head. There are people with worse problems in the world. You should be grateful for what you have. Things could be so much worse for you. Think about something else. Snap out of it!\" and I was cured. /s",
   "created_utc": 1691266445,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxxa05",
   "message": "You can heal depression?? I don’t have it but that sounds great!",
   "created_utc": 1691266465,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxxaxu",
   "message": "I take Pristiq and spend time with my family, friends, and my dog. It helps but does not heal. I don't expect it to end while I am alive on this earth.",
   "created_utc": 1691266476,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxxs0u",
   "message": "I wouldn't say I'm currently healed but I'm definitely in a much more controllable state than I was a few months ago when I wanted to kill myself.\n\nAs repetitive as this may sound - Therapy AND Meds. I've never been one to believe it for myself when I was very depressed but the SSRI I'm taking (Escipra aka Lexapro) + weekly therapy (now bi-weekly) has made me feel like I'm a lot more in control of my emotional state and my future, even though I may still end up screwing it all. I've still got a long way to go in terms of being the best version of myself and not going back to my old ways and habits every now and then, but I like how I'm feeling now and I'm just riding the wave.",
   "created_utc": 1691266670,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxy0tn",
   "message": "I was very depressed for most of my life. I was healed in 2 stages. The first was my church laying hands and praying for me. The second was vitamin d supplementation. These happened many years apart.",
   "created_utc": 1691266772,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxy1lv",
   "message": "Psilocybin helped",
   "created_utc": 1691266781,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxy34d",
   "message": "Talking about it and coming out.",
   "created_utc": 1691266798,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxycbm",
   "message": "🍄 and talking to random strangers on the beach",
   "created_utc": 1691266905,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxynut",
   "message": "Intramuscular Ketamine injections every 4-8 weeks.",
   "created_utc": 1691267041,
   "score": 1,
   "submission_id": "15iwua7"
  },
  {
   "comment_id": "juxzl6p",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15iwua7"
  }
 ]
}