{
 "submission_id": "15iy40s",
 "title": "What is the worst job you've ever had?",
 "selftext": "",
 "created_utc": 1691248174,
 "permalink": "/r/AskReddit/comments/15iy40s/what_is_the_worst_job_youve_ever_had/",
 "score": 76,
 "url": "https://www.reddit.com/r/AskReddit/comments/15iy40s/what_is_the_worst_job_youve_ever_had/",
 "comments": [
  {
   "comment_id": "juwn8yl",
   "message": "Cleaning toilets at mcdonalds",
   "created_utc": 1691248279,
   "score": 237,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwtdf0",
   "message": "I worked at a DVD store, doing floor stuff - organizing shelves, putting out new stock, that sort of thing, fun job for me.\n\nWe had a rewards program you could sign up for. Very few people did, and our numbers were bad. So my boss got the brilliant idea to put cute little 19 year old me in a low cut top to stand in the anime section and encourage the dudes to sign up for it. I guess he figured dudes who buy anime are sad and lonely and would be pleased at any attention from a girl. The sad thing is that it totally worked.\n\nIt was super degrading and I only worked there for a few more weeks before I got another job that didn't depend on my cleavage.",
   "created_utc": 1691250771,
   "score": 151,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwtw9i",
   "message": "DCFS /LSSI case aid, through a private contracted company. My job was to take children from their foster parents to there biological parents for visitations, while sometimes just me and the child either having fun or taking them to appointments. It was both one of my favorites and also defiantly the worst. A lot of good comes out of being a case aid. The goal is to protect the children, and that could either be reuniting parents with the kids, and permintly removing there parental rights in some more extreme cases.   \n\n\nOne day one of my clients a young man that I would meet for two hours a week at a group home, with both his parents. I also would go without the parents, 2 hours a week,  and just take him out to the park, the arcade, to a movie, zoo and so on, more of a big brother role.   \nWe did this a lot because it gives the children a break from something they had no fault of their own, and they would often open up (non-probing) and say something that might be relevant, or not yet known.   \n\n\nThis young man was a good kid he hated the place he was at, and hated his parents (justified) but he was just a pleasant 13 year old boy,  I generally enjoyed playing catch or just talking about new music, a new movie, how his school was going, his life in general. He was my client for 5 months and one afternoon while driving to go take him out, I get a call from my boss telling me to turn around and comeback to the office, and that my appointment was canceled.   \n\n\nI got there there was my boss and her boss both with sad looks on thier face. I was told that my client escaped the home and layed on the train tracks and killed himself.  I went home that night and cried for a while. I realized that even though I wanted to do good in the world this might be to much for me.  I quit that week, and went back to a brainless labor job. This was nearly 20 years ago.",
   "created_utc": 1691250976,
   "score": 99,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwog8i",
   "message": "Concert security. I was a huge fan of the artist and couldn’t turn around to watch. It was so tempting and an overall bad time.",
   "created_utc": 1691248769,
   "score": 106,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwqhd1",
   "message": "Silverado Plumbing in Tucson. It was a bunch of 40 year old women who acted like they were the mean girls in high school.",
   "created_utc": 1691249599,
   "score": 195,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwricn",
   "message": "Had to engage with people's YouTube content and watch their videos fully including ads and send them proof. A 100 videos a day.",
   "created_utc": 1691250014,
   "score": 135,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwt3qu",
   "message": "I've never had a bad job. I have had bad bosses. The stress was horrible.",
   "created_utc": 1691250665,
   "score": 163,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juww7x1",
   "message": "Worked for a third party company that sells AT\u0026amp;T service (so basically your typical AT\u0026amp;T store).\n\nFirst store I worked at the manager would drink on the job and would throw tantrums in front of customers. I actually felt afraid to be with him by myself.\n\nI was then told I had to transfer to another store that needed help. The manager would not accept anything less than the top service plan we offered. She’d have me purposely add things to peoples plans without asking. She would meddle with peoples plans in order for us to make money off of it. I ended up walking out of that job.\n\nSo if you have AT\u0026amp;T, really look at your plan and what they’re charging you. People will do shady shit just to get a small commission off of it.",
   "created_utc": 1691251887,
   "score": 118,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux7j7y",
   "message": "Walmart Distribution Center. When Amazon was under fire for their mistreatment of employees, i watched an interview and the distribution center I worked at was SO much worse",
   "created_utc": 1691256296,
   "score": 139,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwtkk9",
   "message": "Hoeing tobacco. I was 14 and it was a summer job for $40 a day. 7am to 4 pm. I did it for one day",
   "created_utc": 1691250849,
   "score": 159,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwsmzw",
   "message": "A testing covid site having to test 100s of people a day was A LOT of stress because it was peak covid had a great team though which made it better but sneezing kids and adults and boatloads of schools and the management was horrendous I got covid three times working at that place 😅",
   "created_utc": 1691250480,
   "score": 247,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux3scs",
   "message": "Worked in a pig slaughterhouse pulling leaf lard off of pigs.",
   "created_utc": 1691254889,
   "score": 74,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux6jto",
   "message": "I worked at a daycare center, and the building was so old and run down. My classroom carpet was disgusting, it had pee and vomit spots all over. Broken toys, ripped up books. No supplies. Just horrible! Mice would run around the children, while they slept on their cots at nap time. I ended up quitting, and calling the state on them.",
   "created_utc": 1691255929,
   "score": 111,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux12q7",
   "message": "McDonald's. \n\nMy schedule was all over the place. I could have 40 hours one week, 25 the next then 0 after that. It was random. \n\nThe kitchen was hot at all times during the summer, but they refused to fix the air conditioning. We had half the staff quit at the same time due to the excessive heat which put a heavy strain on the rest of us. \n\nManagement would sit in the office playing games on their phone for their entire shift. \n\nJunkies coming in and passing out was a common occurrence. A lot of the time they had to be given narcan in the middle of the restaurant. \n\nCustomers were the most horrible human beings. I had to physically defend myself multiple times. A lot of customers were also verbally abusive, and having the cops escort Karens off the property was an almost daily occurrence. \n\nThere's a lot more, but my phone is about to die.",
   "created_utc": 1691253825,
   "score": 76,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwok3r",
   "message": "Burger King. Was my first job and I got fired after a month because at the end of the day instead of throwing away left over Burger I gave them to homeless people. Not allowed so they fired me. (That was back in 1999)",
   "created_utc": 1691248813,
   "score": 23,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxfis8",
   "message": "Anti drug costumed bird for DARE at the Illinois State Fair during a heat wave.",
   "created_utc": 1691259296,
   "score": 71,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwr35m",
   "message": "Washing dishes at cracker barrel",
   "created_utc": 1691249845,
   "score": 52,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwnkfl",
   "message": "Being a sign spinner in California. Standing in the hot sun all day inhaling car exhaust. And it sure does make your feet hurt a lot more when you're just standing in one spot instead of walking around.",
   "created_utc": 1691248407,
   "score": 90,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwzgd8",
   "message": "So far? Graveyard shift at a grocery store, my mental health took a fucking plummet because of being up all night and sleeping through the day.",
   "created_utc": 1691253176,
   "score": 83,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux3dcg",
   "message": "official reddit replier",
   "created_utc": 1691254727,
   "score": 91,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwt0eu",
   "message": "I worked at a call center that seemed shady enough that I expected it to be raided by the cops. I lasted a week. And it did eventually get raided.",
   "created_utc": 1691250629,
   "score": 76,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux4goe",
   "message": "Copied from a similar question a while ago.\n\nPaint factory where they treated metal and sprayed it, don't know the perfect words for it in English sorry.\n\nPeople nearly closed the oven before I left it, yelled at me from 6 am until I left work (9,5 hour work days). Had to work with chemicals that got me so high that I stuck a massive magnet to a metal palletcart, so nearly lost my fingers. Also almost lost my eye when my boss \"secured\" a package so tightly that the  metal band snapped and hit me an inch away from my eye. Got a neat pirate scar now though. Could've probably sued them but never did.\n\nThe chemical is known to result in painters disease, because it vaporises your brain essentially. No protection offered. Got that shit in my eyes almost every day. Swept 5 kilos of dust weekly.\n\nLeft after 3 months.",
   "created_utc": 1691255149,
   "score": 41,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux6m6h",
   "message": "Special education teacher in middle school. Broke me.",
   "created_utc": 1691255954,
   "score": 35,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux52dl",
   "message": "I've had shit jobs but nothing compares to this guy that called into a radio contest for worst job titles as his was 'Chicken butthole remover.' He stood on the slaughter line and made sure the carcasses were butthole free, if they weren't he was to fix it.",
   "created_utc": 1691255379,
   "score": 66,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux3v0k",
   "message": "Insulation, specifically crawl spaces... F that.",
   "created_utc": 1691254919,
   "score": 32,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxde74",
   "message": "A school counselor.  You are essentially the school’s dumping ground for things no one else wants to do and you barely get to do any counseling.  I left after 5 years but looking back, I should have left after the first year.",
   "created_utc": 1691258499,
   "score": 35,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxdrgb",
   "message": "Was once told the marketing job I applied for was \" bridging the gap between client and consumers for fortune 500 companies \"\n\nWanna know what the job *actually* was?\n\nStanding in a Suit in a BJs for 10 hours trying to sell people AT\u0026amp;T\n\nI lasted 4 days",
   "created_utc": 1691258637,
   "score": 34,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwwjpq",
   "message": "Selling shoes in a store where I had to run up and down 2- 3 Floors for every shoe I needed. Pay? Almost zilch. I got fired after a month because: 'I didn't run fast enough'",
   "created_utc": 1691252014,
   "score": 43,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwnv31",
   "message": "Shoney’s. Waiting tables for $2.13 an hour, especially on Sundays when the church crowd would come rushing in. They would get seated in parties as large as 25 people, all with separate tickets, and all rude AF. And church people are the worst tippers on earth, many of them don’t tip at all except for leaving church tracts in place of money.",
   "created_utc": 1691248529,
   "score": 95,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwz8kl",
   "message": "Clothing retail (Kohl’s). It wasn’t about the place itself, it’s just about the job itself. My favorite was working the register and jewelry because I was actually doing something important. Having to clean up people’s clothes and fold/hang clothes for HOURS is stupid. I hate doing my own laundry so constantly doing it for others and never finishing was the worst time in my life. There’s no benefit to that part of the job at all. I can’t say that I’m making anyone happy. I had a better and more rewarding time when I was a CNA wiping people’s butts.",
   "created_utc": 1691253091,
   "score": 24,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxcqhb",
   "message": "Probably working for a moving company. Everybody dreads moving day, for me that was every day",
   "created_utc": 1691258249,
   "score": 24,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwzn0t",
   "message": "I worked at a deli that lots of older people frequented. They were always so mean over the dumbest things like if I sliced the meat and i wasnt EXACTLY 1 pound every single time.",
   "created_utc": 1691253251,
   "score": 16,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux6fcq",
   "message": "I’ve worked some pretty shitty and tough manual labor jobs, I currently work in a pretty prestigious, division of medical device sales and do quite well for myself. Somewhere in the middle I worked for enterprise Rent-A-Car. I have to say that I likely would not have gotten my medical device sales job without my experience there, so for that, I have to give a credit, but I also can confidently say you have a shadow of a doubt that that was the most miserable experience of my life. Never in my entire existence have I’ve been treated so poorly by not only customers but the corporation. The level of abuse that they put you through on a daily basis plus the hours they all work/force you to work, plus the absolutely shitty pay by far made that the worst job I have ever had in my life. I am extremely happy person who everyone describes as a go. Lucky, happy, vibrant individual, those few years of my life with the only time I ever wanted to not exist anymore. wasn’t suicidal, just didn’t care if I died because it was so FUCKING miserable.",
   "created_utc": 1691255885,
   "score": 16,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux5h3o",
   "message": "Orielly auto parts \n\n\nManager was a Dick, customers sucked ass, pay was even worse, wanted to die 100% of the time I was working there",
   "created_utc": 1691255533,
   "score": 18,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juww008",
   "message": "Like the movie Office Space, every job I've had is the new worst one.\n\nBecause I stupidly refuse to leave and as I get older the less willing I am to put up with the trivial BS.\n\nThese are a bad combo.",
   "created_utc": 1691251800,
   "score": 22,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux37or",
   "message": "Paperround. Flyers and local newspapers. A lot of work for way to little compensation.",
   "created_utc": 1691254664,
   "score": 12,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxfeav",
   "message": "Transfering chickens from a small long cage on a semi truck to a coup in a barn. To reach the chickens we had to crawl on our bellies in the cage, then grab 3 chickens in each hand, climb down the ladder, walk to the barn and stuff them in a cage all while the fucking chickens are clawing at your arm. All of this happened in 90\\* weather and when we were done they didn't pay us but promised that they would send us a check. Never happened.\n\nI was only 16 when that happened. Learned a couple of important things that day...",
   "created_utc": 1691259249,
   "score": 15,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux4bbu",
   "message": "Day care worker is so much harder than it looks.",
   "created_utc": 1691255094,
   "score": 19,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux4rvl",
   "message": "Hotel housekeeping. If it comes out of the human body, I've cleaned it up. I started in a by-the-hour motel when I was 14, owned by a woman who didn't bother with hazardous waste procedure and cleaned up what looked like a murder scene with nothing but bleach and kitchen gloves. I walked into that room, and was absolutely positive that when I pulled the shower curtain open there was going to be a body in the bathtub. Thankfully there wasn't, just blood everywhere. Owner refused to let me report it, made me clean it, and I didn't want to get in shit for bleaching a murder scene at 14 so I never did call the cops.",
   "created_utc": 1691255269,
   "score": 21,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxgy4g",
   "message": "I was an art teacher for a kid with autism. The kid himself was fine (although a lot of work). It was the parents who were insane.  \nMy uninformed diagnosis was that both parents were also autistic and/or dealing with other psychological issues.  \n\nThey paid me dirt, the rules were insane, and eventually I got fired because she could smell the detergent on my clothes. They are/were the types of parents who believe vaccines cause autism and in chem-trails and heavy metals and also that gluten, detergent, and other chemicals also contributed to their son’s autism.  \n\nThe kid was fine, but I felt really bad for him because they essentially created an isolated world for him, and it was very clear he was curious and was starting to be interested in girls (he was 15). They let him throw tantrums over the tiniest things. All of his food was made vegan, organic, GF and from scratch. It was sad. He basically ate pita bread with vegan crumble 5x a day.  \n\nI didn’t even teach him that much. We just played video games but I wasn’t allowed to win: he was pretty good, but every so often if I was winning I’d have to lose. One day I just won by accident in some stupid Wii game we were playing and it was a stage 5 meltdown. He threw the controller at me and started screaming like an Orc and ran around the house punching the walls. I was told I had to wait there, unpaid for 2 hours until he came out of his mania, then the mom bitched me out and cried while driving me home.  \n\nShe also sometimes made him wear a literal fucking gas mask when we hung out because she saw some air trails in the sky and was worried I had heavy metals on my skin/clothing.  \n\nAbsolutely fucked. And they paid me minimum wage for 4 hours for 2 days a week, but I’d actually be there 6 hours plus travel.  \n\nI was a poor student and this was like 2009 during the recession when jobs were hard to come by.",
   "created_utc": 1691259834,
   "score": 21,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwwwys",
   "message": "Dollar Tree, never again!",
   "created_utc": 1691252160,
   "score": 16,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux5cz2",
   "message": "Picking okra and tomatoes in the hot North Carolina sun.... with long sleeves and jeans on so the prickly fibers didn't fuck up my skin",
   "created_utc": 1691255489,
   "score": 15,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux3clx",
   "message": "The one I have now, unfortunately.",
   "created_utc": 1691254719,
   "score": 23,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux5m1n",
   "message": "ER Veterinarian. It was a week on then week off, but the week on was around 100 hours. Having to put to sleep so many animals with such sad stories. Very short staffed. I had such PTSD from that job I couldn’t drive down that street for about five years after I quit. \n\nSecond worse was construction holding the stop/slow sign. We had 12 hour shifts and just standing there in the hot Sun, not allowed to sit down, and with nothing to do but stare straight ahead. Nobody close enough to talk to.",
   "created_utc": 1691255583,
   "score": 31,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux1ql0",
   "message": "Worked in some warehouse where we would be sorting maps to be converted digitally. Small room in a warehouse which was fine. But worked with a long time employee in the same room that was a religious nut job. She played some Bible hymn station the whole time. Wouldn’t let me talk unless it was about scripture, wouldn’t allow me to wear headphones to listen to anything else, then explained to me how I’m a destined to go to hell no less than 30 times a day. \n\nI don’t know what triggered this. But I made it 2 months before tapping out. The company had zero desire to do anything about it. I’ve done gross things in previous jobs. Cleaning up bathrooms where crazy people smeared shit on the walls, vomit, period blood, you name it.  Those jobs sucked and were disgusting, but would take those any day over being stuck in a small room with a religious psychopath ever again.\n\nEdit. Small context missing that didn’t make sense",
   "created_utc": 1691254090,
   "score": 19,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux43tn",
   "message": "Local sandwich place with lots of locations throughout my city. First they sent me to orientation at their headquarters on one day, where I arrived and was told there was no orientation that day. Rescheduled it and came back another day. It was supposed to be paid with lunch provided, and neither of those things happened. \n\nNow onto actually starting the job. The manager sat me down at a table, gave me a list of every sandwich with every ingredient, and left me to “memorize” it for about 10-15 minutes. She then proceeded to throw me right on the lunch rush at noon and stand there berating me for not going fast enough and making mistakes. She made up her mind from the beginning that she didn’t like me and would only schedule me eight hours a week. (I was in school and only wanted part time, but come on.) I was always the first to get sent home early and have shifts cut when labor was low, so I rarely even worked those full eight hours. This became a self-fulfilling prophecy where I never worked enough to get good at the job, and since I sucked at the job in her eyes she cut my hours. Once when a coworker asked if I could cover the drive-thru, this manager went “No she can’t! She’s too…..” and didn’t finish the sentence. \n\nI lasted four months while I found another job. Gave my notice and just got snapped at that I’d better be sure because they wouldn’t rehire me. Oh devastating /s. The only lasting bad thing about it was we always enjoyed going to eat there growing up and that left a permanent bad taste in my mouth about it, literally.",
   "created_utc": 1691255017,
   "score": 11,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxgdmw",
   "message": "Schlotzskys. Now that I’ve left a part of me misses it. But I didn’t forget everything. I didn’t forget how awesome it was in the beginning. How managers acted like leaders. I didn’t forget how downhill it went after it got bought out. The new owners took away any form of discounts \u0026amp; single handedly killed my old store. How they stopped caring about the employees \u0026amp; it became just another way to line their pockets.",
   "created_utc": 1691259616,
   "score": 15,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxtc9u",
   "message": "Catching chickens.  When I was in high school, a friend's dad owned a company that would go around to chicken houses and load the chickens into crates that were put on a truck for transport to the processing plant.  He was a man short for his crew one night and asked me if I could help.  I already had a job, so I didn't need the money, but I agreed to help my friend.  That was the worst job I've ever done, and nearly the worst I can imagine.  It was HOT in there, and it smelled horrible.  The air was dusty and full of tiny, floating feathers.  The job required that you work FAST and catch these chickens, ending up with four or five per hand, holding the chickens by the feet.  The part that really sucked was that there were two different types of chickens in there, and they could not go into the same crate.  If you had a handful of chickens and one of them was the wrong kind, the guy who was loading them into the crates would make you drop the one that didn't belong, usually resulting in dropping the entire handful.  I found the two varieties of chickens nearly indistinguishable, so that happened pretty often.  Also, the chickens obviously didn't want to be caught, so they would scratch the piss out of your arms.\n\nAt the end of that night, I knew I would never do that again, and gladly went back to my regular job... at Kentucky Fried Chicken.",
   "created_utc": 1691264849,
   "score": 8,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwy6sj",
   "message": "Working for travel insurance claims  in March 2020 onwards. I would create claims for cancelled flights, hotels, traveling car centers, etc. Except after COVID really hit, the companies were only offering vouchers for future use and we could not issue any refunds.\n\n\u0026amp;#x200B;\n\nTelling people who just lost their jobs we can't get them their money back was awful. It was 8 hours every day for months of endless verbal abuse from customers. I completely understand where they were coming from, but man that job sucked.",
   "created_utc": 1691252669,
   "score": 13,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux3xie",
   "message": "Vet tech in training. They ended up making me help with all the euthanasia cases. At least a couple a day. I started crying all the time and getting completely wasted every night. Had to quit after a few months.",
   "created_utc": 1691254948,
   "score": 16,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux8wz6",
   "message": "Loading trucks at UPS. I was horrific at it. Just 3 1/2 hours of packages coming down the belt. I’d have to load 3 or 4 trucks. Ideally you would load the packages neatly on the shelf they belonged on in the numerical order they belonged in. I would be having Tetris dream nightmares about the job.\n\nOnly reason I took the job was for the teamsters medical benefits. I told my supervisor that the day that ACA passed I was gonna come in and quit. I did. I have a lot of respect for the guys and ladies working the preload it isn’t an easy job and it’s worse during peak season.",
   "created_utc": 1691256818,
   "score": 12,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxgni5",
   "message": "One of those stupid mall kiosks that beckon to you to check out their bullshit. I made it 2 days. I never even collected my pay.",
   "created_utc": 1691259720,
   "score": 12,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwqswa",
   "message": "Cell phone sales for a sprint authorized seller. \nMandatory phone meetings at 3am. I'd you don't seem 20 phones a month you get zero commission. Having to compete for sales with the store manager. And having to hear about his awful sex life",
   "created_utc": 1691249730,
   "score": 14,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux4ilb",
   "message": "Call center worker for a contract company- our client was a health insurance carrier.  Because we were contracted, we didn’t have the same authority and information as the client company.  Cue angry customers because we couldn’t give them the info they needed.  Worked my way up to team lead.  Call volume was insane so team leads were dropped to the phones for escalated calls.  Still had to listen to 2 calls a week for each rep (about 20 on my team) and meet with each rep once a week for those calls.  Plus in a rotation for interviews for new staff and the random disciplinary action and prepping for a weekly team\nmeeting. And somehow do all this with no OT allowed and crap pay.  \n\nMoved to another company where I wasn’t a contract worker for a client.  Still sucked but was a lot easier when I had the tools to do my job.",
   "created_utc": 1691255169,
   "score": 8,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux7clw",
   "message": "Walmart, in all honesty.",
   "created_utc": 1691256226,
   "score": 11,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux8kgb",
   "message": "Corn detasseling when I was like 13. Omg that sucked.",
   "created_utc": 1691256688,
   "score": 6,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxbdmv",
   "message": "coal mine. 12 hour days 7 days a week. i lasted 2 months",
   "created_utc": 1691257736,
   "score": 12,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxgfwo",
   "message": "Telemarketer for AAA",
   "created_utc": 1691259640,
   "score": 7,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux2496",
   "message": "Physical therapy aide. I pretty much ran the whole show while the PTs did next to nothing. Checked patients in and out, set up appointments, set up equipment and walked patients through more than half of their exercises while waiting on the PT to actually show up for their time with the patient (they were constantly late), did paperwork, took phone calls, cleaned and stocked every room, did laundry etc. All for $15/hr (and they acted like it was good).\n\nAfter getting yelled at for being on my phone with 5 minutes left in my shift and nothing left to do, I stood up for myself and told the therapist never to use that tone with me ever again, and if they had a problem we could talk about it like adults. They let me go the next day because \"things weren't working out\" but it was 100% because I stood up for myself. Never again.",
   "created_utc": 1691254238,
   "score": 10,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux81g2",
   "message": "Mortgage Loan Officer - I quickly realized how much I loathed working a full-time sales job as an independent contractor. The brutal realization that 95% of my leads will say no or find ways to weasel their way out of a potential deal; having to know everything there is to know about your job, and be quick to answer the right questions that pertain to your clients otherwise you’re not going to close loans. The fact that I have to market myself to get business and actually talk to people, whether in person or over the phone, is soul-sucking for me. My contract was terminated after only 6 months and I haven’t bothered doing this sort of thing ever since. \n\nI spent more than a thousand dollars to set myself up for success, and was quickly jaded and had zero patience or determination to follow-thru with this job. I also decided leaving my then-promising career to do this just to make more money and work from home. I ended up taking my wife and moving in with my parents for a year, trying to crawl us both out of a hole I threw us into. Fortunately, we finally crawled out 4 months ago and our marriage has never been stronger!",
   "created_utc": 1691256489,
   "score": 6,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxcneb",
   "message": "Cutting fancy glass for use in mosaics.\n\nA glass cutter is basically a pen, with a small metal wheel on one end, and a metal ball on the other.\n\nFancy glass is thick, heavy expensive and sharp. The weight, thickness and texture changes drastically. One may be a 3 centimeter smooth green glass sheet, the next may be a textured 5 centimeter piece of orange.\n\nThere is NO training.\n\nGlass dust is a thing.\n\nMy finger tips were swollen with tiny, shards of glass and I broke much more glass that I was worth.\n\nIt was a short gig.",
   "created_utc": 1691258215,
   "score": 8,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxdkxe",
   "message": "I worked at a seasonal Christmas tree farm in college one winter.  Thought it would be an interesting experience and a good way to make some quick cash along with my server job over the holidays.  \n\nBasically everyone I worked with was a convicted felon, sex offender, etc.  Each morning, we’d unload shipping containers of Christmas trees in the cold; they’re heavy as hell, and they’re covered in sticky pine sap that is like glue - it gets on everything and it takes weeks to scrub off.  \n\nWe’d unload the trees, unbind them, set them up around the lot on temporary stands, water them, help customer’s pick their trees, and then basically rewind the process; take them off the stands, bind them, haul their heavy asses to the customer’s cars, strap them on, rinse \u0026amp; repeat.  You’d be lucky to get a small cash tip on top of the minimum wage under the table hourly cash tips from the company.  \n\nEvery so often, we’d get a really wealthy client who wanted the biggest tree in the lot delivered to their house/mansion, so we’d have to figure out how to load that to our delivery truck, get it to the client’s house, and then unload it without scratching anything or breaking anything in the client’s house.  Then we’d get really excited if we got a $20 tip for our efforts.  \n\nAbsolute misery.  0/10 would not recommend.",
   "created_utc": 1691258570,
   "score": 16,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux042v",
   "message": "Every I.T job I ever had.",
   "created_utc": 1691253440,
   "score": 13,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux39oz",
   "message": "Dick’s Sporting Goods. That was my last straw in retail",
   "created_utc": 1691254687,
   "score": 12,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux524j",
   "message": "My first job was at a Mexican restaurant named Jalapeno Joe's. The owner was verbally abusive, and treated the Mexican employees very badly while he was very kind to the American workers. The worst part was that he was Mexican himself smfh",
   "created_utc": 1691255377,
   "score": 9,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux66xn",
   "message": "Sanitation lead at a trampoline park. It was minimum wage, first job. Ever been under a trampoline in one of those parks? No? Good, you DON'T want to",
   "created_utc": 1691255798,
   "score": 6,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux6zsf",
   "message": "Housekeeping easily. Making beds is no fucking joke. How people can do it for 10+ years is crazy. I lasted a week. \n\nI've worked at McDonald's wasn't bad. Corporate structure. Always busy. I've worked as a banquet chef at a large hotel doing 400+ people events. I loved that job. \n\nI was a receiver at a restaurant for product - 4 hours of putting cases away. Sometimes it was never ending. Really got to know the Sysco drivers and had good friendships. That job destroyed my back. Rotating 50+ pound cases of potatoes, or number 10 cans absolutely shredded my L4 L5 vertebrae. \n\nI've been a line cook at a bar, I've made 50 gallons of chili at a time every week. None of the jobs were BAD they just had bad moments. Like during closing, arguing with the wait staff because they want tips, and I want to close the kitchen. Being absolutely buried in tickets.",
   "created_utc": 1691256091,
   "score": 6,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux8xgy",
   "message": "Worked sanitizing machines at a chorizo factory. They would text you when production was done for the day and they'd want you there within 10 minutes and then bitch at you if you were 5 minutes late. They would make you rush at the beginning of the shift than spend 3 or 4 hours at the end just doing meaningless things to pass the time",
   "created_utc": 1691256824,
   "score": 6,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux9uew",
   "message": "Working for Little Caesars. Your bosses don't appreciate you and they are major cheapskates. Wouldn't even allow each shift a crew pizza but also didn't give you a break so you could go somewhere else to get something to eat.",
   "created_utc": 1691257167,
   "score": 10,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxcova",
   "message": "Warehouse at a certain well known surf/skate casual clothing company based in San Diego.\n\nHired on as a temp promised to transition to full employee because of my resume and was told that's just how they do things. Turns out from talking to other temps that have been there a year+ it's just a straight up lie.\n\nLiterally got yelled at because I couldn't scan items in half the building due to the network in the building not covering the areas.\n\nSimply walked out after a week.\n\nBummer because I liked the product.",
   "created_utc": 1691258231,
   "score": 5,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxdzgo",
   "message": "Walmart in the 90s.  I was trained that no matter what department you worked in, if a customer asked where something is, you would walk them to it.  The other employees did not do this but being new I would, though I would usually ask another employee where something was with customer standing there.  Employees were really rude to me and it was xmas so I get it is busy.  I kept getting loaned out to other departments since I kept pissing off my manager.  She didn't like how I let customers cut their own fabric but no one showed me how.  I was punished by getting sent to toy department.....did I mention it was xmas.   I quit after a couple weeks.",
   "created_utc": 1691258720,
   "score": 8,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxfcb1",
   "message": "Subway.  Hated that place with a passion.  Still can’t into one, the smell makes me instantly nauseous",
   "created_utc": 1691259229,
   "score": 8,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxfma2",
   "message": "Processing salmon in Alaska! Glad for the experience, but 16 hour days for three months in the middle of nowhere was intense. You only got a day off if no fish came in. \n\nLodging was a little shack on the beach with a foam pad. We had to burn ALL waste. So the bathrooms had trash bins that you would toss used TP in. The smell was so bad. \n\nAll the food was flown in by bush plane. So it was dehydrated stuff and salmon for every meal. I honestly never got tired of eating salmon- but the dehydrated stuff sucked.",
   "created_utc": 1691259332,
   "score": 7,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwnmb1",
   "message": "Worked for a decent company that bought a crappy company and the decent company's division I was part of was taken over by the crappy company's equivalent.  Majority of the management were not only self centered but toxic and cruel.",
   "created_utc": 1691248429,
   "score": 11,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxch14",
   "message": "Dollar tree. They were opening a new store and hired a bunch of teenagers, including me. \nWe walked into an empty building on the first day and had to build the fucking store. From checkout counters to shelving. I had a bit of construction experience, so a lot of the work fell on me. For minimum wage. Manager was a cunt. Only positive was I met a really cute, sweet girl and we dated for a bit. A couple cool cats that became my friends. \nA few months in we were having lunch together, and we heard manager ripping into an employee who didn't speak great english, and she was being racist af.\n5 of us quit that day in the middle of the shift. Told the manager she was a racist cunt in front of customers and walked out as she was still screaming that we couldn't just quit. We were laughing as she followed us out into the parking lot.",
   "created_utc": 1691258147,
   "score": 12,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxebts",
   "message": "Soft woods lumber company. Lumber was cool. Them they moved me to a different department where I had to listen to a good old boys club constantly talk about strippers, their old and used wives they don't want to go home to. Calling the warehouse workers monkeys. Constantly talking over me or disregarding my knowledge.",
   "created_utc": 1691258849,
   "score": 9,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwybkk",
   "message": "Phone operator. That job made me so cynical. It’s hard to even empathize anymore. People suck.",
   "created_utc": 1691252720,
   "score": 5,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwzeeu",
   "message": "My first job working in the kitchen of a fairly nice restaurant. The owner was a stereotypical chef--extremely anal and impatient. He stood over me constantly and yelled at me to work faster, and fully expected me to be able to do tasks as quickly as he could on my literal first day. I also discovered pretty quickly that I am just not good at that type of work. \n\nI lasted 4 days, then school was starting back and I asked him about setting my work schedule on school. He told me \"just focus on school.\" Thank goodness!",
   "created_utc": 1691253155,
   "score": 9,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux0cz2",
   "message": "Cleaning chicken houses.\n\nThere was a guy who got paid more than anyone else and he washed the mats they laid eggs on: a ~1ft^2 piece of artificial turf. There were about 1000 of them.",
   "created_utc": 1691253538,
   "score": 3,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux0yys",
   "message": "Cleaning apartments for the next tenant.",
   "created_utc": 1691253782,
   "score": 6,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux1dyt",
   "message": "Housepainter. Most tedious shit I've ever done.  \n\nI also worked in a fish shop and had to clean the grease trap. That was preferable.",
   "created_utc": 1691253950,
   "score": 5,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux1jd8",
   "message": "Data Analyst.  This is probably a job some people love, but it wasn't for me.  That was the job I realized I hate staring at screens all day and I was starting to develop muscle tension from the high cognitive load.  I hated frantically copy/pasting from stackoverflow and pretending I know more about both statistics and web development than I actually did.  Working at UPS was way better",
   "created_utc": 1691254011,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux2tc9",
   "message": "In order:\n\nSubtitute school teacher.\n\nFull time school teacher under the principle we named The Kumquat\n\nWorking under Tom Lucido and Ted Septien at AAA\n\nHosing out the peach processing bins at the cannery at the end of shift",
   "created_utc": 1691254508,
   "score": 6,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux2ysn",
   "message": "One summer in college I found a job at a local cotton mill. For 12 hours each day I rolled barrels of cotton back and forth between two different stages of processing. Once my feet got used to it, it wasn’t physically demanding. But I couldn’t take the tedium and boredom. There was no time to stop and talk to anyone and no thought involved in the job at all. I’m an introvert but I discovered I need a little human interaction in a 12 hour period. I left after about a month.",
   "created_utc": 1691254569,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux3m7s",
   "message": "Working at a hog confinement. Hogs are about the most stubborn animals to work with, and the fumes/dust you breathe in make it feel like you smoked 4 packs of cigarettes by the time your shift is over.",
   "created_utc": 1691254824,
   "score": 6,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux67o7",
   "message": "Public Tax accountant. Abusive owners, multiple 70 hour work weeks per year, monotonous work, and pressure from multiple people. I will never go back to that miserable existence, the money is not worth it to me.",
   "created_utc": 1691255805,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux7unj",
   "message": "i got roped into a telemarketing job, they totally framed it as “setting appointments via phone for sales representatives” which basically just meant calling random phone numbers trying to get them to schedule an appointment. \n\nsome of it was funny because i was constantly getting trolled, but i had a few instances where people threatened to kill or rape me if i came to their house (i was a few months into being 18). i ended up quitting after 2 weeks when they threatened to fire me if i didn’t come in the day after my grandma died. not to mention they lied about pay, only person that wasn’t making $5/hr below the job listings wage was someone who was 5 years in",
   "created_utc": 1691256419,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux82t2",
   "message": "Trash sorter. Worked at the trash recycling plant, was tasked to open trash bags and go through them to see if anyone had thrown any recyclable materials out with their general waste. If so, take it out and dump it in the appropriate recycling piles.\n\nDid it from 8am until 2pm. Stuck my hand (with glove, thank fuck) into a bag with used diapers and broken bottles. Tossed it and walked away.",
   "created_utc": 1691256504,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux85ag",
   "message": "Worked as a youth treatment specialist at a group home for teenaged sex offenders. We specialized in sex offender relaps prevention but we also taught them independent living skills so they wouldn't go back to an environment they may re-offend in. If they completed the program they could also be taken off the registry.",
   "created_utc": 1691256528,
   "score": 5,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux95c0",
   "message": "John Deere planters. When I got hired as a temp I didn't get any training. They just threw me out on the floor and told me to figure it out. After about a month the hours started getting added more and more til I was working 12-16 hours a day, 7 days a week. I did that for two months. Eventually they noticed I wasn't doing a whole lot. When asked I said \"well nobody has trained me. I have no direction because there's no supervision. I get that we're busy but training should be a priority too\" got fired for that. If I'd have stayed I would've had to work a full 2 years with no benefits and no pto. Getting fired was a blessing. Best money I ever made but cost me my sanity and time for myself and my family. I missed my cousins funeral for that place. Fuck John deere. It's a sweatshop disguised as a factory.",
   "created_utc": 1691256906,
   "score": 6,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux9t97",
   "message": "Dollar tree. You don't get any time for yourself. You always have to cover someone's shift and get in trouble if you don't answer the phone when they call. I started out as a cashier and then became assistant manager but didn't really want to, I let them pressure me to cover for someone who ended up quitting, so I was stuck in a position that was causing an extensive amount of stress.",
   "created_utc": 1691257155,
   "score": 3,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxawf6",
   "message": "Stacking tires into tank silhouettes for tank target practice in the middle of the Mojave desert. 120+ degrees, MRE's for food and water from a black plastic 5 gallon can. An occasional rattler or scorpion in the tires.",
   "created_utc": 1691257555,
   "score": 6,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxb6ke",
   "message": "I've worked in multiple fast food jobs and they were all soul crushing. But the worst job I had was supposedly cold calling sales at a small telemarketing place. \n\nIt was the worst job because I think I was attempting to scam people. I did it for one day and I felt so horrible after that I didn't go back. The boss made a big deal about how it definitely wasn't a scam but everything about it felt so shady and I regret doing it even for one day. I was desperate for work and wanted so badly to get out of the restaurant industry but I just got another restaurant job the next day because being treated like shit was still better than feeling like I was taking advantage of people.",
   "created_utc": 1691257660,
   "score": 7,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxbewj",
   "message": "Working at Applebee's as a dishwasher",
   "created_utc": 1691257750,
   "score": 5,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxe2m5",
   "message": "Newspaper delivery.  Only lasted 1 night.  I thought it would be a great way for additional income.  I had to be there at 1 am for sorting, putting together and bagging.  Then I delivered with the trainer until around 9 am.  It was too much for my 20 year old self 🤣",
   "created_utc": 1691258753,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxi7qu",
   "message": "Baling hay in August in the South.",
   "created_utc": 1691260331,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxjrdv",
   "message": "i waitressed once for,  about two hours.....no thanks...but the worst was a nursing home i got fired from,,, i loved working with the residents and have most of my working life... took this job because it was close to home...\n\n the place was a pit, understaffed and the administration/owners were nasty people...i watched a cna push a woman in a w/c. the womans foot got tangled in the front wheel when the aid backed it up....broke the woman's foot before i could do anything...i got fired because  i spoke to the aid \"harshly \" for not using foot peddles when transporting.\n\ni know i made a difference to some families while i was there and i also became legal guardian for a woman with huntington's, got her the hell out of there.\n\nmy next job, i was at was for over 25 years and they begged me not to retire.",
   "created_utc": 1691260933,
   "score": 6,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxx2pa",
   "message": "Preschool, where I discovered I was being paid $4 less than my co-teacher, who had the exact same degree as me, but less experience. Hired at the same time. The difference? Our race. I walked out.",
   "created_utc": 1691266380,
   "score": 5,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwp3ur",
   "message": "life",
   "created_utc": 1691249034,
   "score": 14,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juwzwsq",
   "message": "Teacher at a public school\n\nStressful beyond imaginable",
   "created_utc": 1691253360,
   "score": 14,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux1gqz",
   "message": "The two hours I worked at Amazon.",
   "created_utc": 1691253981,
   "score": 10,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux4r90",
   "message": "Working in menards yes I am still in retail but john millionaire can suck it 3years after I quit covid happens and and all of a sudden people making 18 bucks a hour when I made 10 bucks a hour suck my cock",
   "created_utc": 1691255262,
   "score": 5,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux6ikn",
   "message": "Retail, Home Depot",
   "created_utc": 1691255916,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux6iy5",
   "message": "I fantasised about stripping when I was younger. Started at a club when I was 21. Lasted two weeks.\n\nIt just turned out it wasn't for me.",
   "created_utc": 1691255920,
   "score": 7,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux8gpr",
   "message": "Front desk at a Quality Inn. Instead of just giving people regular shifts, you worked first, second and third. My body didn’t know when to sleep or wake after months of this. Mental health went to shit also",
   "created_utc": 1691256649,
   "score": 5,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "jux9zuc",
   "message": "Working tills at a grocery store, the boredom was all encompassing",
   "created_utc": 1691257224,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxcl4p",
   "message": "Fast food. Never…. Ever…. Again",
   "created_utc": 1691258190,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxeh53",
   "message": "Selling books door-to-door. It was summer in Louisiana in the poorest neighborhoods. I felt like a monster preying on the vulnerable, not to mention walking in the intense summer heat. I made it a month and somehow managed to make $500.",
   "created_utc": 1691258906,
   "score": 5,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxehsm",
   "message": "Outbound sales in a call center. I was originally hired for a different client but stuff happened and they moved me over to sales for an internet and tv provider. It was soul killing work making over 500 calls a day, lucky if 10 actually picked up and most of those were upset. But they somehow expected us to get 3 sales a day in those conditions.",
   "created_utc": 1691258913,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxeo1w",
   "message": "Appliance delivery.\n\n$10 an hour to haul 300 pound refrigerators, washers, dryers, whatever, into people’s homes and install them.\n\nI have a herniated lumbar disc, likely from that job, that I haven’t worked in almost a decade.",
   "created_utc": 1691258978,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxepia",
   "message": "I did a day of temporary work in a meat-packing plant where I was bagging up pigs' ears for eight hours, all while watching disembodied pigs' heads go past on a conveyor belt. I came home stinking of blood (although funnily enough my dogs were very happy to see me).",
   "created_utc": 1691258994,
   "score": 3,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxf825",
   "message": "Vet tech. Emotionally, physically, and mentally draining. Abuse from clients and management doesn’t care about you.",
   "created_utc": 1691259186,
   "score": 6,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxfpf2",
   "message": "To make dried apricots on a commercial scale, they are treated with sulphur to help preserve color and shelf life. Large trays of cut fruit are run into a hut with burning sulphur for a few hours then put out in the sun to dry. My job was to push stacks of trays into one end of the hut and pull the sulphured trays out of the other end, then lay the trays out to dry. The sulphur gas and residue made eyes water, sinuses drain and impossible to breathe - similar to being tear gassed.  This was in 100 degree California central valley heat as well. Do that routine about once an hour for a 10 hour shift, 7 days a week for about a month during fruit season.",
   "created_utc": 1691259364,
   "score": 5,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxgta7",
   "message": "Worst job was frying fish at Captain D’s. Grease burns galore. \n\nWorst company was Jersey Mikes. Horrible management.",
   "created_utc": 1691259782,
   "score": 3,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxmavh",
   "message": "Picking up large bales of hay on a farm in August. I only did it for one day, because the farmer was a thief.  That day was awful though, because I was only 13 and the shit head adult in charge let his mange ridden mutt dog drink from our water storage. The dog looked diseased and as dead as I was from the heat, I couldn't drink from that water and he wouldn't let us go get clean water. At the end of the day the thief farmer showed up and payed us half of what he promised. If I had known where he lived I would have slashed a lot of tires that night. I put in a lot of hard work that day and we all pushed ourselves to go fast and do a good job and that peice of shit robbed us all. This was around 1984, give or take a year.",
   "created_utc": 1691261948,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxmggc",
   "message": "Homes and Land Magazine, the first job I had coming out of college. I was a graphic designer and you'd think working for a magazine or newspaper wouldn't be what you might call a sweatshop but it was. Low pay, and we had to lay out 4 pages an hour. You had to do things so fast, it was like they didn't want you to think too much. And they didn't care what your background was, they would move you to different things that had nothing to do with your expertise. Once you were hired, you were just property.\n\nOnce in a meeting they announced they were moving people to other jobs and I had no interest in the job they moved me to so I said \"no thanks\" and they were so confused because nobody ever did that. Even management was so confused that someone could possibly have enough dignity that they would express an opinion on an executive decision. The business was a serious holdover from the days when people just got a job and from then on you just did what you were told. \n\nThey were like \"what do you mean, \"no thanks\"?\" I was like, \"I won't do that. I will continue doing the job you hired me for, or I will look elsewhere for that job.\" They asked me to stay another few weeks and then I worked for a newspaper which I loved and still miss to this day!",
   "created_utc": 1691262012,
   "score": 3,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxy7av",
   "message": "CVS Pharmacy. Verbally abused every day for things that were out of my control. But unlike being berated for, idk, the wrong cocktail or not having a dress in stock (I worked food and clothing retail before), I was being berated for people’s medications that they needed to live. \n\nThe American privatized healthcare system prioritizes profits over lives so there was nothing I could do when a young father broke down in tears at the news of his baby’s lifesaving medication costing $1000+ per month.\n\nThere was nothing I could do when a woman came into the store screaming that her mother passed away because we couldn’t deliver her medication on time because CVS purposefully understaffs its stores to the point where we are barely functioning on a good day - hundreds of medications were late on a daily basis.\n\nLines out the door because it was just me running to the back, filling prescriptions, and running back to the cash register to check out customers while the pharmacist on duty was giving vaccines.\n\nLunch breaks were not an option until CVS was legally required to shut down their pharmacy on a daily basis starting Feb 2022 to allow their workers to eat - these breaks only last 15-30 mins. There was only 1 table and 2 chairs so most of us ate on the floor, on the rare days there were more than 2 people working there at a time.\n\nViolence by customers - my coworkers were being pushed, punched, etc. My adrenaline was that of an animal being hunted for sport for 8-10 hour shifts. And I was lucky tjat I worked part time; my managing pharmacist worked 14 hours every goddamned day of the week. She suffered 3 miscarriages.\n\nI lived near my workplace so my coworkers would beg me to come in when they were drowning. Then my manager told me I had to stop because “corporate can’t afford to pay” the extra hours, so they took me off the schedule for 2 weeks. Decided it was the best time to put in my 2 weeks. Later that month CVS corporate hosted a private concert by John Legend for their top ranked employees and then took them to Disney World. I guess that’s the material value of their customers dying due to dangerously understaffed and overworked pharmacies.",
   "created_utc": 1691266846,
   "score": 5,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juy9qnd",
   "message": "Used to have a job as a forklift driver for a Greek-owned industrial bakery. They made things like Pita and bagel chips for other labels. Think Stacy's Pita chips. We made those. My specific job was to pull Pita bread out of the cooler. Mind, the Pita bread that we were running through an oven and seasoning was physically made in Greece and shipped to the US via air. If that sounds like a bad idea - shipping half-baked bread halfway around the world - you're already seeing why this factory didn't stay open long.\n\nWhen I would pull pallets out of the cooler, they would come out wrapped, then under the wrap were four ten-pound boxes per layer, 12 layers tall. The boxes were very low-grade cardboard, and the Pita chips were in an unsealed bag inside of the box. Very frequently, when we got to the last 1/3 or so pallets on a shipment, we would end up with mold riddled through the boxes. Like, open a box and feel your face melt a little kind of smell. This happened every single shipment. Reporting it to management had absolutely zero effect, and I never got direct instructions on how to handle the situation.\n\nOne day, I found one of these and told my crew to just throw out the boxes that had mold, as we always did. We kept checking boxes and pallets until we got clean goods. The packaging line complained to the shift manager that they had nothing to do. The SM threw a fit that we were throwing away 'good product.' And started throwing boxes literally full of mold onto the shaker table to be sent through the oven. I told them I'd rather quit than get my hands dirty with an FDA violation. She called my bluff. I quit on the spot and filed an anonymous report with the FDA as soon as I got home. My team also quit with me, but I don't know if any of them also reported the place. A few months later, I was back in that part of town by chance. I stopped by the front door of the factory. There was a signed FDA notice on the door, and all the lights were off.",
   "created_utc": 1691271635,
   "score": 5,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxa2zi",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxbdk6",
   "message": "Cleaning cars for Avis.  I don't know what it was about the Grand Prix but I used to say they were rented by grand pricks.  Every single one of them came back looking like it was driven through a corn field and hit a wake of buzzards while hauling 3 muddy, shedding golden retrievers in the back and a child smearing a Big Mac into the dashboard.\n\nCleaning the cars on a hot summer tarmac was bad but the bosses made it so much worse.  I will not rent from them over the way they treated their employees 28 years ago.   I only worked there for about a month before I could not take any more of the management abuse.   \n\nAlso farming.  Farming sucks rocks.",
   "created_utc": 1691257736,
   "score": 5,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxlzrq",
   "message": "Call center. I'd rather clean toilets, it's less demoralizing",
   "created_utc": 1691261825,
   "score": 3,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juy9rjz",
   "message": "KFC cook in 1998.  Lasted a month.  Place was chronically understaffed.  Had to do lunch rush by myself and got yelled at for being slow.\n\nHad to crawl into giant rotisserie ovens and scrape seasoning and bits of skin out of every nook and cranny.\n\nTold to serve green chicken because the mold will be fried away and hidden by the breading.  They routinely failed health inspections.\n\nThe manager was breading chicken and sneezed in the floor vat, shrugged, and kept working.\n\nMade us stay until 2 am to wash dishes (again understaffed), then had to open at 7 the next morning. \n\nOh, and minimum wage, so $5.15 an hour.\n\nHaven't eaten at KFC since. Worked at McDonald's for a year afterward.  It was paradise in comparison.",
   "created_utc": 1691271646,
   "score": 4,
   "submission_id": "15iy40s"
  },
  {
   "comment_id": "juxpl9a",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15iy40s"
  }
 ]
}