{
 "submission_id": "15j15x4",
 "title": "Why did you breakup with your last ex?",
 "selftext": "",
 "created_utc": 1691255727,
 "permalink": "/r/AskReddit/comments/15j15x4/why_did_you_breakup_with_your_last_ex/",
 "score": 27,
 "url": "https://www.reddit.com/r/AskReddit/comments/15j15x4/why_did_you_breakup_with_your_last_ex/",
 "comments": [
  {
   "comment_id": "juxl5ym",
   "message": "I've never been the one to break up with someone. My last partner broke up with me two weeks before our wedding because the guy that always got away, was single and in town. They dated for a year, he stole her money, knocked her up, disappeared. She called me back after all that and asked if we could get back together. I laughed, and hung up.",
   "created_utc": 1691261495,
   "score": 69,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxm1re",
   "message": "He decided to see other women but forgot to tell me about it.",
   "created_utc": 1691261847,
   "score": 46,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "jux7dyh",
   "message": "ngl it was because he talked in a really annoying voice all the time \u0026amp; his dick was so big it physically hurt to have sex every single time",
   "created_utc": 1691256240,
   "score": 28,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxl7fj",
   "message": "Because we brought the worst out in each other.",
   "created_utc": 1691261512,
   "score": 18,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxq96x",
   "message": "My dad had passed away, and I really needed support, so she came over after I had found out he had died, and I bawled my eyes out for 45 minutes. Then when I was done for a few minutes, she said \"Damn you cried for 45 minutes\". Bitch, what's that supposed to mean? I knew that day that things were not gonna last between us. She became more distant after that, as if me struggling was just suddenly like \"Nope, not fun for me anymore so I'm not gonna try\" for her. I'm currently in a relationship with the best girl I could have ever asked for, and I want to marry her, and might propose to her in a year or two.",
   "created_utc": 1691263558,
   "score": 17,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxnlsa",
   "message": "She fucked one of my friends and got pregnant while I was working my ass off here in Korea.",
   "created_utc": 1691262482,
   "score": 13,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxi8o5",
   "message": "Emotional abuse. \n\nWhen I realized that preferred being at work than at home with my gf, I knew it was time to end things.",
   "created_utc": 1691260340,
   "score": 11,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxobol",
   "message": "She'd made a comment about everyone being too hard on Putin and he's a great guy. Proof that he's a good guy is that he likes animals. I just couldn't wrap my brain around it.",
   "created_utc": 1691262774,
   "score": 8,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxk80z",
   "message": "She was a cunt lol 🤷🏽‍♂️",
   "created_utc": 1691261120,
   "score": 15,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxltaj",
   "message": "Abuse . All kinds of abuse .",
   "created_utc": 1691261752,
   "score": 6,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxmw7z",
   "message": "They were very politically stubborn and ironically close-minded. I often like to think about other perspectives and alternatives, I find it stimulating, and I like to think it helps keep me grounded. \n\nThey would get so emotional when I wouldn't %100 agree with them, and even when I did agree on a fundamental level, I couldn't bring up other perspectives otherwise they would immediately claim I was lying and usually imply I was representing an opposing extreme.\n\nExample: Displaying overt sexuality of any nature in kids shows rubs me the wrong way. I was subsequently considered homophobic and transphobic.\n\nWe were extremely compatible in nearly every other aspect of life. However, even after bringing up my distaste of politics in our relationship, they would always assume I was against them, and it became too exhausting.  I just called it off after another fight where i agreed for the most part, but considered varying circumstances as important to take into consideration.",
   "created_utc": 1691262195,
   "score": 5,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxp5pm",
   "message": "He didn't exist. I broke up with an illusion of him. 🙈",
   "created_utc": 1691263111,
   "score": 5,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxpbdu",
   "message": "He wanted to try his chance with a church girl, so I gave him the chance. She said no, he tried coming back, I said no.",
   "created_utc": 1691263172,
   "score": 5,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxi2bk",
   "message": "She started school and didn't have any time for me",
   "created_utc": 1691260272,
   "score": 4,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxnn1p",
   "message": "He was a 21 year old US Marine.",
   "created_utc": 1691262497,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxo6y5",
   "message": "He abused me on every level and was super controlling. Even tried to give me a bedtime",
   "created_utc": 1691262719,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxv6nm",
   "message": "She ate cereal for every meal.",
   "created_utc": 1691265609,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "jux693b",
   "message": "She was nonexistent so I had to end it",
   "created_utc": 1691255819,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxp0j9",
   "message": "She was and continues to be (ex with kids together) extremely abusive in every way possible without doing anything illegal. Unfortunately, keeping my distance from her means distance from my kids too. It's a fine line between my own safety/sanity and keeping my kids safe. Family court in my state doesn't care about emotional, financial or administrative abuse. I can't wait until the kids are 18.",
   "created_utc": 1691263051,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxp60n",
   "message": "He was an abusive liar. Nuff said.",
   "created_utc": 1691263114,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxpdfr",
   "message": "he had cheese dick. he was 5 yrs older than me. so he’s like 27, with cheese dick. had to pick up after him a lot too.",
   "created_utc": 1691263197,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxq7lo",
   "message": "She said she would call me one night (I asked her to) and she didn’t, texted the next morning that she was busy. She had been logged into the dating site where we met the entire night she said she was busy.",
   "created_utc": 1691263539,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxrc1l",
   "message": "She was emotionally manipulative 🙃",
   "created_utc": 1691264008,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxqzo5",
   "message": "He broke up with me, via text, because he thought I was looking for something more serious than he was (which was true). \n\nFound it with an old friend of mine. Happily married for four years now.",
   "created_utc": 1691263865,
   "score": 4,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "jux9767",
   "message": "I was a senior, and she was a junior. I was going off to college, and it bothered her that I would be leaving. We decided to spare each other the heartbreak and end it before I left.",
   "created_utc": 1691256925,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxbqsy",
   "message": "he only lasted 2 minutes. I thought it would get better throughout the relationship, but sadly it didnt.",
   "created_utc": 1691257874,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxcrad",
   "message": "She drinked way too much",
   "created_utc": 1691258257,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxlc21",
   "message": "hmm... we chilled too much.\n\nto the point where i got unsettled. I need to be active and make a change around me to enjoy life. \n\nShe just needs to lay back and be comfortable. I'm jealous and intolerant towards this",
   "created_utc": 1691261561,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxmucf",
   "message": "We weren't compatible long term",
   "created_utc": 1691262173,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxjrui",
   "message": "Because I wanted to move to a small, hippy dippy little town and live on an acreage. He went along with it till 8 months after we were engaged when it finally came out (on my birthday!) that he really didn't like the idea of leaving the city, he was just going along with it because he wanted a relationship.",
   "created_utc": 1691260938,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxn9on",
   "message": "Wife asked me to",
   "created_utc": 1691262346,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxlf4a",
   "message": "She broke up with me because apparently i saw on insta she was with another boy and thats ok if they were friends but when i asked she said it was her bf and they were out on a date even though we were dating\n\nAnd she made me buy her things at this party christmas witch was the last time me and her went out together i brought her christmas presents, cider, food and my parents took her in their car and she left me",
   "created_utc": 1691261596,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "jux6wmq",
   "message": "She had more sexpartner then me. . .   \n\n\nI had 1.",
   "created_utc": 1691256061,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxj7gi",
   "message": "He didn’t make me a priority in his life",
   "created_utc": 1691260717,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxvcof",
   "message": "I can't even remember. But I'm glad we broke up because recently I learned he was a young earth creationist",
   "created_utc": 1691265677,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxgvnp",
   "message": "The Army moved me a couple thousand miles away. She couldn’t handle the distance and we broke up within 2 months.",
   "created_utc": 1691259806,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxhubr",
   "message": "The beginning was awesome, we'd cook together, watch some Netflix, play games, cuddle and all that jazz. Unfortunately, I realized I had to walk on eggshells around her through several incidents such as me mispronouncing the name of a restaurant and her getting genuinely upset over it. And as much as I respect her, I like to keep negativity outta my life so I ended up cutting it off for good. Funnily enough best lovemaking we ever had, tho.",
   "created_utc": 1691260187,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxl0m3",
   "message": "Honestly, it was a mess. He was suspicious of me cheating when I never even talked to any other guy. I blocked all the guys that he felt jealous of. Then I found out that he had a crush on my best friend, and they had been texting each other for months. My friend didn't like him back, but nonetheless, it was heartbreaking. My friend is still frie d with him and I see them being playful with eachother. I've told the friend that I find it uncomfortable, but that's it. I can't exactly force them to be apart. It's their decision.",
   "created_utc": 1691261440,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxm7pt",
   "message": "She was always angry. She actively looked for reasons to be angry.",
   "created_utc": 1691261913,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxnzxo",
   "message": "He was British who wanted to move to Singapore. I did not want that at all.",
   "created_utc": 1691262642,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxr46d",
   "message": "Lied about A LOT of stuff while I was financially supporting her and 2 kids that weren’t mine.",
   "created_utc": 1691263918,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxr5im",
   "message": "She was manipulative and really abusive,  she even played the victim after outlr break up to make me look like a pile of shit.",
   "created_utc": 1691263933,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxrs0i",
   "message": "I was not longer a priority",
   "created_utc": 1691264194,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxs9jl",
   "message": "Because apparently she slipped, fell, and landed on his dick.",
   "created_utc": 1691264395,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxshbg",
   "message": "He became mean, distant and a naccisists.\nAt some point he told me andrew tate was just a guy trying to help other men. He didnt understand why him lying to me caused me to not trust him.",
   "created_utc": 1691264484,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxt85d",
   "message": "She was unsubscribed from life due to hospital negligence",
   "created_utc": 1691264803,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxtdfl",
   "message": "Got in an argument, went to a party later with her and she snuck homemade ghb in my drink, woke up in the hospital with my stomach pumped and IVs in my arm, told her if I ever saw her again I wouldn't hesitate to knock her the fuck out",
   "created_utc": 1691264862,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxtoi8",
   "message": "We just...weren't that invested in eachother. It was comfortable, we had a good time together, but there wasn't a future together. After almost a year I decided I was worth more than just being someone to pass time with. So I broke it off.",
   "created_utc": 1691264989,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxtpb2",
   "message": "Long story short, incompatible mental illnesses. I couldn't get my shit together while someone was actively drowning me in theirs. Put on your own oxygen mask first, kids.",
   "created_utc": 1691264998,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxu75d",
   "message": "He was an absolutely shitty parent to his kids. THEN I found out he had FOUR MORE KIDS with three other women and really had nothing to do with any of them. Plus, he was really, really dumb.",
   "created_utc": 1691265199,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxu7ga",
   "message": "I didn't have any gf",
   "created_utc": 1691265203,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxu7uw",
   "message": "Tried to control my time with friends.  Then got overall controlling, along with struggling to manage their first real job. I realized the complete immaturity and ended the relationship.",
   "created_utc": 1691265208,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxu9wg",
   "message": "I was working extra overtime to save up for a vacation she wanted to do together. Ended up putting on about 10 pounds and going to the gym less. Right after the vacation she said I was no longer attractive to her and broke up with me. 😔 \n\nI have since lost the extra weight and learned a valuable lesson. Always focus on yourself first and foremost.",
   "created_utc": 1691265232,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxuabu",
   "message": "I got dumped because she found better.",
   "created_utc": 1691265237,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxufgx",
   "message": "She was still in love with her ex",
   "created_utc": 1691265295,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxur6d",
   "message": "Always texted me, emotional abuse, kept begging me for kids. (I am immature to have kids)",
   "created_utc": 1691265434,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxutcr",
   "message": "Abusive and gaslighting.",
   "created_utc": 1691265458,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxuxh3",
   "message": "Man child. He wouldn't find a job. So, after three years, I've realized that the relationship wasn't going anywhere, and felt I just wasting my time.",
   "created_utc": 1691265505,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxv8bt",
   "message": "Distance :(",
   "created_utc": 1691265628,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxvgqt",
   "message": "The spark just wasn’t there anymore. She also just lost all ambition to do anything to make herself/us better. She also had a terrible problem with money that always made me have to suffer. She’s a great person but just not what I was looking for anymore",
   "created_utc": 1691265724,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxvmse",
   "message": "Guess I dodged a bullet, huh? 😂",
   "created_utc": 1691265791,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxvq9f",
   "message": "He was a creep, well to be precise a pedo. \n\n\n\n(He wanted to have sex, I was 13 and didn't and still don't know his age.)",
   "created_utc": 1691265832,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxw0gx",
   "message": "She kept asking me for money for her 7 year old daughter after our first date which I think is a huge red flag",
   "created_utc": 1691265945,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxw0rg",
   "message": "he broke up with me after ignoring me for 3 days because I made a joke calling his co-workers \"stupid\",,, he cheated on me months before",
   "created_utc": 1691265948,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxw4b5",
   "message": "Her friend got us together (i didn't really want to get together but i went for it since i never had a GF before) and after an awkward few messages an uncomfortable dog walk and double date to the cinema that ended up making her cry we both decided that we had nothing in common and to just stay friends. A few months later i see her again acting like a self entitled asshole to some random person that walked into her by accident by calling them names and making them cry before they ran away. Sooooo i dodged a bullet there",
   "created_utc": 1691265988,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxwj8c",
   "message": "She dropped kicked my cars windshield",
   "created_utc": 1691266159,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxwlxx",
   "message": "She cheated on me and broke it off by letting me know and also calling me a drug addict for smoking weed, at that point I realized I had no idea who I had been talking to for 4 months",
   "created_utc": 1691266190,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxwmnp",
   "message": "My parents didn’t approve",
   "created_utc": 1691266198,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxworh",
   "message": "She bought a house behind my back, in a town that she knew I didn't want to live in.",
   "created_utc": 1691266222,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxwqtk",
   "message": "She wanted me to change my entire personality so her friends wouldn't think she was an idiot for dating me. Like I get I can be immature at times, but I do take things that are serious, seriously. \n\nThat said, it was also the hipocracy of her saying that after not too long before that, she and her friends were laughing at another friend who had accidently streamed hentai in the discord group chat. \n\nBut no, me making a few immature jokes here and there was the bigger issue. \n\nIt is what it is lol.",
   "created_utc": 1691266246,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxwsdx",
   "message": "For a year, I basically supported her and her kids because she couldn't get a job due to her residence status being all messed up. Then one day we got into an argument/discussion about it being 50/50 if we were to live together and she felt that I have to pay for everything because that's always how it's been in her family, she was raised in Mexico. That's what started the argument in the first place. Then she said one day she hopes to find someone who will support her. That comment set me off, she pretty much told me thanks for everything but you're just temporary till I find someone else to pay all my bills. She tried playing it off saying that I misunderstood her (because she said that to me in Spanish. I speak Spanish just fine). What piss me off the most she kept on trying to say I was mad about it not being 50/50 and wouldn't acknowledge what she said about her finding someone else.",
   "created_utc": 1691266263,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxwve8",
   "message": "I went to Australia for a year and when I can back to surprise her after 3 months her boyfriend was living in our apartment.",
   "created_utc": 1691266297,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxx1on",
   "message": "Same reason I gave when this was posted a few months back",
   "created_utc": 1691266369,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxx3tw",
   "message": "His exwife started stalking me and sent death threats, stalked my exhusband and said I was having an affair with a married man, told the (ex now) boyfriend that my exhusband called her and that he and I were still involved, she pretended to commit suicide. I was dating this guy for 2 months. Not worth the drama",
   "created_utc": 1691266393,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxx5ke",
   "message": "He lied too much and would gawk at other chicks right in front of me",
   "created_utc": 1691266414,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxx6xy",
   "message": "Cuz she broke up with me.  And now we’re back again 😂❤️",
   "created_utc": 1691266430,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxx72e",
   "message": "My friend (her cousin) told me she said she was having second thoughts about me and thinking about getting back with her ex. I phoned her and calmly asked if this was true and she said it was and I said we should break up and we did. \n\nIt was civil, we didn't have a fight about it but I was more hurt than she was and I still lived her for a while. She got back with her ex for a bit and they were on and off a few times which was clearly not a good sign but now she is in a relationship she has been in for many years and I am happy for her.",
   "created_utc": 1691266432,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxx91v",
   "message": "I barely remember the relationships I was in back before I met my wife. Basically I ghosted everyone after I met her. We married a few years later, still together.",
   "created_utc": 1691266454,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxxfjk",
   "message": "Cheating.",
   "created_utc": 1691266528,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxxj6q",
   "message": "I left him because I was so sick and tired of being manipulated, controlled and mentally abused all the time. \nI didn't realize what was going on till I finally snapped",
   "created_utc": 1691266569,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxxqac",
   "message": "No choice.  She cheated",
   "created_utc": 1691266651,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxy06m",
   "message": "She liked being on the Internet all night and fucking other people better than me.",
   "created_utc": 1691266764,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxy1l3",
   "message": "Decided she wanted to get married and have kids with me immediately, after dating for 2 months. Gtfo",
   "created_utc": 1691266781,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxy2zx",
   "message": "I got a new puppy. She said she didn't like him and that I was giving the 8 week old puppy too much attention. So he now uses her pillow",
   "created_utc": 1691266797,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxy8bc",
   "message": "Which one?? I think I got scared because it never ever worked out. And the emotional fallout was not worth the attachment. The older I get the shorter my relationships get. 🤦‍♂️",
   "created_utc": 1691266858,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxyikw",
   "message": "Cheated",
   "created_utc": 1691266978,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxyj38",
   "message": "We decided we worked better as friends so just went back to being friends. Still in touch with her almost 30 years later.",
   "created_utc": 1691266984,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxykxy",
   "message": "my last ex broke up with me.  LDR, she got super closed off when she met some group while streaming and then broke up with me to 'work on herself'",
   "created_utc": 1691267006,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxyl24",
   "message": "The last person I broke up with bc she informed me of her decision to have a sperm bank baby to which I was not to be a second parent.",
   "created_utc": 1691267008,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxylsp",
   "message": "He flirted with one of my friends and kept making comments about how hot other girls were. I'm very grateful I broke up with him because I met my now-husband shortly after:)",
   "created_utc": 1691267016,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxym0a",
   "message": "I told her I won’t be entertaining a relationship with her ever again and saved all of the messages which turned into threats. I told her if she wants me to be with her she will not force me to put her parenting abilities into question with a judge. She promptly stopped all communication with me, because she’s a good mom, and I finally had peace.",
   "created_utc": 1691267019,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxynah",
   "message": "I got her pregnant and fucked off cause I'm a deadbeat.",
   "created_utc": 1691267034,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxys9o",
   "message": "He decided drugs and ither women were more important than me and our children.",
   "created_utc": 1691267092,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxywnj",
   "message": "We graduated high school and went our separate ways.  I stayed in-state for college, he went to the East coast, and neither of us wanted to try to maintain a long-distance relationship.",
   "created_utc": 1691267145,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxywyx",
   "message": "My girlfriend wanted me to kick my son out of my house, sell it and go hugely into debt for another house and I’m a few years away from retiring, which I could never do saddled  with a new giant mortgage.",
   "created_utc": 1691267148,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxyxik",
   "message": "We liked each other, but she felt that her future was in one city, and I felt that mine was in another. We're still friends. I married a great geek girl. And, so did my ex, which might also explain things.",
   "created_utc": 1691267155,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxz07p",
   "message": "Gaslighting manipulative bitch",
   "created_utc": 1691267186,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxz2mo",
   "message": "She got off birth control and was fucking my best friend for a year to get preggo once just to make me eat her with another man’s baby in her. He’s super hung and I’m average and fixed.",
   "created_utc": 1691267214,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxz359",
   "message": "Because stone cold said so",
   "created_utc": 1691267219,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxz672",
   "message": "She went on a date with another guy",
   "created_utc": 1691267253,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxz7s2",
   "message": "My ex brought a \"friend\" over to watch a movie.  I sat on the far left, he sat on the right and my ex sat in the middle.  When I put my arm over her she jumped to the right into his arms.  Also didn't help that right before that she told me I should go spend the night at my moms house because I was going to be mad.  I called her bluff and that is what happened.",
   "created_utc": 1691267271,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxz8kx",
   "message": "JOKE'S ON YOU! I never been in relationship!",
   "created_utc": 1691267280,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzcwr",
   "message": "Not a break up. Cancer took her away",
   "created_utc": 1691267330,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzgbf",
   "message": "We had different ideals at the time, plus I felt like she wasn't independent enough. I needed more alone/me time. It's interesting, because we've stayed casually in touch, and we're actually a lot more compatible now. She's taken on more hobbies and I've loosened up on some of the ideals I thought were so important.\n\nFeels like that ship has sailed though.",
   "created_utc": 1691267368,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzj0i",
   "message": "Just realized we weren’t compatible and stringing the relationship along was wrong.",
   "created_utc": 1691267400,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzj38",
   "message": "She slept with two of my best friends because she didn’t want to break my heart by breaking up with me because she wanted other options instead of marriage.",
   "created_utc": 1691267401,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzobq",
   "message": "I got dumped instead of being the one to end it, but it was because her family doesn’t like me because I’m from Alabama. That’s the only reason they gave.",
   "created_utc": 1691267461,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzpaj",
   "message": "Because he was looking for pregnant women to bang on Craigslist",
   "created_utc": 1691267472,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxztd8",
   "message": "He got cold feet and called off our wedding 2 months before the date. I took a month to myself to collect my thoughts and came back, did damage control all by myself (called the guests and vendors lying about what happened to save his image) humiliated, and emotionally defeated, gave him 6 months to make it right. All I asked for was a single date that had effort behind it like making reservations and dressing up nice. I wanted a sincere and vulnerable conversation. I wanted help replanning the wedding too. \n\n6 months. He fought with me every other day when I tried talking to him trying to work it out. 6 fucking months and he refused.",
   "created_utc": 1691267519,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzts8",
   "message": "Mine left me in the middle of moving in together.  A 6 year relationship. He’d been picking on me for months, which I was trying not to react to, about how I was too short, fat, ugly, and dumb for him. When he left, I was just glad to see him go. I think he was upset that I didn’t cry or beg. No idea what (or who) he’s doing now, but a small and petty part of me hopes he’s lonely. I don’t want him back. I just hope nobody else wants him either 😈",
   "created_utc": 1691267523,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzu8l",
   "message": "I was pregnant and he wouldn't get a job, wouldn't help around the house, wouldn't help me at all. On Valentines Day I came home from work early but I had to run to my parents house for something, we lived 10 minutes apart, I would have been gone for 30 minutes tops. He pitched a huge fit about us never spending any time together and how I was always at my parents house. I was over it and I just walked out. He went to his moms that night and I packed up all my stuff in one trip and moved back in with my parents.\n\nHe's met his daughter twice in three years. Hasn't paid child support in months. I haven't heard a word from him in almost a year. None of his family has ever met my daughter or even expressed interest in wanting to meet her.",
   "created_utc": 1691267528,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzz1p",
   "message": "She ended up havin a penis.",
   "created_utc": 1691267584,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzzny",
   "message": "The breaking point was that he wanted me to love him more than I love my religion. He was also emotionally abusive and a little bit physically and sexually abusive lol, but since I was in the midst of it that didn't matter as much to me",
   "created_utc": 1691267591,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy01yy",
   "message": "Bitch was crazy!! Also an alcoholic who couldn't stop doing cocaine.",
   "created_utc": 1691267618,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy02x0",
   "message": "Total disregard for my life",
   "created_utc": 1691267628,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy05hh",
   "message": "She was extremely practical. Annoyingly so. It became more evident when we moved in together which was also a week before covid lockdown first started. She became a homebody and lost interest in going out and doing much of anything. She would tell me i was spending too much money on my hobbies, which are definitely not cheap, but i was still dumping income into savings and doing well financially. \n\nShe gained a lot of weight during lockdown and got down on herself about her body. I never criticized her but always invited her to hike or fish or just come to the gym with me. Never told her she had to, just asked if she wanted to come with me. She never did. She used to love hiking and acted like she'd never been and would mever want to.\n\nShe told me i couldnt buy a pickup truck because we supposedly didnt need one and they werent good on gas... But i spend a lot of time fishing, often on the beach, and my car was full of sand and smelled like low tide. Pickup seemed logical to me. That was the final straw.\n\nIts a shame because we wouldve at least still been good friends had we not been  stuck inside together for 2 years.",
   "created_utc": 1691267657,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy061b",
   "message": "I'm about to break up with a girl who I've been steadily losing any attraction for, she's nice but I can't fake it",
   "created_utc": 1691267663,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy07pj",
   "message": "After 5 years, 2 of them engaged, she said “I don’t live you and never did. I don’t want to marry you and never will. But you can still drive up here on the weekends to take me out”\n\nNOPED right outa that one!",
   "created_utc": 1691267682,
   "score": 1,
   "submission_id": "15j15x4"
  }
 ]
}