{
 "submission_id": "15j15x4",
 "title": "Why did you breakup with your last ex?",
 "selftext": "",
 "created_utc": 1691255727,
 "permalink": "/r/AskReddit/comments/15j15x4/why_did_you_breakup_with_your_last_ex/",
 "score": 203,
 "url": "https://www.reddit.com/r/AskReddit/comments/15j15x4/why_did_you_breakup_with_your_last_ex/",
 "comments": [
  {
   "comment_id": "juxl5ym",
   "message": "I've never been the one to break up with someone. My last partner broke up with me two weeks before our wedding because the guy that always got away, was single and in town. They dated for a year, he stole her money, knocked her up, disappeared. She called me back after all that and asked if we could get back together. I laughed, and hung up.",
   "created_utc": 1691261495,
   "score": 218,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxm1re",
   "message": "He decided to see other women but forgot to tell me about it.",
   "created_utc": 1691261847,
   "score": 84,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "jux7dyh",
   "message": "ngl it was because he talked in a really annoying voice all the time \u0026amp; his dick was so big it physically hurt to have sex every single time\n\nedit: thanks for the upvotes y’all lmao\n\nedit 2: holy shit y’all keep liking this 😂",
   "created_utc": 1691256240,
   "score": 63,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxl7fj",
   "message": "Because we brought the worst out in each other.",
   "created_utc": 1691261512,
   "score": 59,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxq96x",
   "message": "My dad had passed away, and I really needed support, so she came over after I had found out he had died, and I bawled my eyes out for 45 minutes. Then when I was done for a few minutes, she said \"Damn you cried for 45 minutes\". Bitch, what's that supposed to mean? I knew that day that things were not gonna last between us. She became more distant after that, as if me struggling was just suddenly like \"Nope, not fun for me anymore so I'm not gonna try\" for her. I'm currently in a relationship with the best girl I could have ever asked for, and I want to marry her, and might propose to her in a year or two.",
   "created_utc": 1691263558,
   "score": 67,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxnlsa",
   "message": "She fucked one of my friends and got pregnant while I was working my ass off here in Korea.",
   "created_utc": 1691262482,
   "score": 57,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxi8o5",
   "message": "Emotional abuse. \n\nWhen I realized that preferred being at work than at home with my gf, I knew it was time to end things.",
   "created_utc": 1691260340,
   "score": 243,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxobol",
   "message": "She'd made a comment about everyone being too hard on Putin and he's a great guy. Proof that he's a good guy is that he likes animals. I just couldn't wrap my brain around it.",
   "created_utc": 1691262774,
   "score": 173,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxk80z",
   "message": "She was a cunt lol 🤷🏽‍♂️",
   "created_utc": 1691261120,
   "score": 105,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxltaj",
   "message": "Abuse . All kinds of abuse .",
   "created_utc": 1691261752,
   "score": 140,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxmw7z",
   "message": "They were very politically stubborn and ironically close-minded. I often like to think about other perspectives and alternatives, I find it stimulating, and I like to think it helps keep me grounded. \n\nThey would get so emotional when I wouldn't %100 agree with them, and even when I did agree on a fundamental level, I couldn't bring up other perspectives otherwise they would immediately claim I was lying and usually imply I was representing an opposing extreme.\n\nExample: Displaying overt sexuality of any nature in kids shows rubs me the wrong way. I was subsequently considered homophobic and transphobic.\n\nWe were extremely compatible in nearly every other aspect of life. However, even after bringing up my distaste of politics in our relationship, they would always assume I was against them, and it became too exhausting.  I just called it off after another fight where i agreed for the most part, but considered varying circumstances as important to take into consideration.",
   "created_utc": 1691262195,
   "score": 9,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxp5pm",
   "message": "He didn't exist. I broke up with an illusion of him. 🙈",
   "created_utc": 1691263111,
   "score": 169,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxpbdu",
   "message": "He wanted to try his chance with a church girl, so I gave him the chance. She said no, he tried coming back, I said no.",
   "created_utc": 1691263172,
   "score": 195,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxi2bk",
   "message": "She started school and didn't have any time for me",
   "created_utc": 1691260272,
   "score": 7,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxnn1p",
   "message": "He was a 21 year old US Marine.",
   "created_utc": 1691262497,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxo6y5",
   "message": "He abused me on every level and was super controlling. Even tried to give me a bedtime",
   "created_utc": 1691262719,
   "score": 246,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxv6nm",
   "message": "She ate cereal for every meal.",
   "created_utc": 1691265609,
   "score": 41,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "jux693b",
   "message": "She was nonexistent so I had to end it",
   "created_utc": 1691255819,
   "score": 5,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxp0j9",
   "message": "She was and continues to be (ex with kids together) extremely abusive in every way possible without doing anything illegal. Unfortunately, keeping my distance from her means distance from my kids too. It's a fine line between my own safety/sanity and keeping my kids safe. Family court in my state doesn't care about emotional, financial or administrative abuse. I can't wait until the kids are 18.",
   "created_utc": 1691263051,
   "score": 40,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxp60n",
   "message": "He was an abusive liar. Nuff said.",
   "created_utc": 1691263114,
   "score": 125,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxpdfr",
   "message": "he had cheese dick. he was 5 yrs older than me. so he’s like 27, with cheese dick. had to pick up after him a lot too.",
   "created_utc": 1691263197,
   "score": 43,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxq7lo",
   "message": "She said she would call me one night (I asked her to) and she didn’t, texted the next morning that she was busy. She had been logged into the dating site where we met the entire night she said she was busy.",
   "created_utc": 1691263539,
   "score": 136,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxrc1l",
   "message": "She was emotionally manipulative 🙃",
   "created_utc": 1691264008,
   "score": 213,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxqzo5",
   "message": "He broke up with me, via text, because he thought I was looking for something more serious than he was (which was true). \n\nFound it with an old friend of mine. Happily married for four years now.",
   "created_utc": 1691263865,
   "score": 161,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "jux9767",
   "message": "I was a senior, and she was a junior. I was going off to college, and it bothered her that I would be leaving. We decided to spare each other the heartbreak and end it before I left.",
   "created_utc": 1691256925,
   "score": 10,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxbqsy",
   "message": "he only lasted 2 minutes. I thought it would get better throughout the relationship, but sadly it didnt.",
   "created_utc": 1691257874,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxcrad",
   "message": "She drinked way too much",
   "created_utc": 1691258257,
   "score": 9,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxlc21",
   "message": "hmm... we chilled too much.\n\nto the point where i got unsettled. I need to be active and make a change around me to enjoy life. \n\nShe just needs to lay back and be comfortable. I'm jealous and intolerant towards this",
   "created_utc": 1691261561,
   "score": 43,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxmucf",
   "message": "We weren't compatible long term",
   "created_utc": 1691262173,
   "score": 62,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxjrui",
   "message": "Because I wanted to move to a small, hippy dippy little town and live on an acreage. He went along with it till 8 months after we were engaged when it finally came out (on my birthday!) that he really didn't like the idea of leaving the city, he was just going along with it because he wanted a relationship.",
   "created_utc": 1691260938,
   "score": 10,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxn9on",
   "message": "Wife asked me to",
   "created_utc": 1691262346,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxlf4a",
   "message": "She broke up with me because apparently i saw on insta she was with another boy and thats ok if they were friends but when i asked she said it was her bf and they were out on a date even though we were dating\n\nAnd she made me buy her things at this party christmas witch was the last time me and her went out together i brought her christmas presents, cider, food and my parents took her in their car and she left me",
   "created_utc": 1691261596,
   "score": 5,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "jux6wmq",
   "message": "She had more sexpartner then me. . .   \n\n\nI had 1.",
   "created_utc": 1691256061,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxj7gi",
   "message": "He didn’t make me a priority in his life",
   "created_utc": 1691260717,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxvcof",
   "message": "I can't even remember. But I'm glad we broke up because recently I learned he was a young earth creationist",
   "created_utc": 1691265677,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxgvnp",
   "message": "The Army moved me a couple thousand miles away. She couldn’t handle the distance and we broke up within 2 months.",
   "created_utc": 1691259806,
   "score": 13,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxhubr",
   "message": "The beginning was awesome, we'd cook together, watch some Netflix, play games, cuddle and all that jazz. Unfortunately, I realized I had to walk on eggshells around her through several incidents such as me mispronouncing the name of a restaurant and her getting genuinely upset over it. And as much as I respect her, I like to keep negativity outta my life so I ended up cutting it off for good. Funnily enough best lovemaking we ever had, tho.",
   "created_utc": 1691260187,
   "score": 132,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxl0m3",
   "message": "Honestly, it was a mess. He was suspicious of me cheating when I never even talked to any other guy. I blocked all the guys that he felt jealous of. Then I found out that he had a crush on my best friend, and they had been texting each other for months. My friend didn't like him back, but nonetheless, it was heartbreaking. My friend is still frie d with him and I see them being playful with eachother. I've told the friend that I find it uncomfortable, but that's it. I can't exactly force them to be apart. It's their decision.",
   "created_utc": 1691261440,
   "score": 21,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxm7pt",
   "message": "She was always angry. She actively looked for reasons to be angry.",
   "created_utc": 1691261913,
   "score": 41,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxnzxo",
   "message": "He was British who wanted to move to Singapore. I did not want that at all.",
   "created_utc": 1691262642,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxr46d",
   "message": "Lied about A LOT of stuff while I was financially supporting her and 2 kids that weren’t mine.",
   "created_utc": 1691263918,
   "score": 32,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxr5im",
   "message": "She was manipulative and really abusive,  she even played the victim after outlr break up to make me look like a pile of shit.",
   "created_utc": 1691263933,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxrs0i",
   "message": "I was not longer a priority",
   "created_utc": 1691264194,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxs9jl",
   "message": "Because apparently she slipped, fell, and landed on his dick.",
   "created_utc": 1691264395,
   "score": 193,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxshbg",
   "message": "He became mean, distant and a naccisists.\nAt some point he told me andrew tate was just a guy trying to help other men. He didnt understand why him lying to me caused me to not trust him.",
   "created_utc": 1691264484,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxt85d",
   "message": "She was unsubscribed from life due to hospital negligence",
   "created_utc": 1691264803,
   "score": 181,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxtdfl",
   "message": "Got in an argument, went to a party later with her and she snuck homemade ghb in my drink, woke up in the hospital with my stomach pumped and IVs in my arm, told her if I ever saw her again I wouldn't hesitate to knock her the fuck out",
   "created_utc": 1691264862,
   "score": 108,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxtoi8",
   "message": "We just...weren't that invested in eachother. It was comfortable, we had a good time together, but there wasn't a future together. After almost a year I decided I was worth more than just being someone to pass time with. So I broke it off.",
   "created_utc": 1691264989,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxtpb2",
   "message": "Long story short, incompatible mental illnesses. I couldn't get my shit together while someone was actively drowning me in theirs. Put on your own oxygen mask first, kids.",
   "created_utc": 1691264998,
   "score": 249,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxu75d",
   "message": "He was an absolutely shitty parent to his kids. THEN I found out he had FOUR MORE KIDS with three other women and really had nothing to do with any of them. Plus, he was really, really dumb.",
   "created_utc": 1691265199,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxu7ga",
   "message": "I didn't have any gf",
   "created_utc": 1691265203,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxu7uw",
   "message": "Tried to control my time with friends.  Then got overall controlling, along with struggling to manage their first real job. I realized the complete immaturity and ended the relationship.",
   "created_utc": 1691265208,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxu9wg",
   "message": "I was working extra overtime to save up for a vacation she wanted to do together. Ended up putting on about 10 pounds and going to the gym less. Right after the vacation she said I was no longer attractive to her and broke up with me. 😔 \n\nI have since lost the extra weight and learned a valuable lesson. Always focus on yourself first and foremost.",
   "created_utc": 1691265232,
   "score": 53,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxuabu",
   "message": "I got dumped because she found better.",
   "created_utc": 1691265237,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxufgx",
   "message": "She was still in love with her ex",
   "created_utc": 1691265295,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxur6d",
   "message": "Always texted me, emotional abuse, kept begging me for kids. (I am immature to have kids)",
   "created_utc": 1691265434,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxutcr",
   "message": "Abusive and gaslighting.",
   "created_utc": 1691265458,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxuxh3",
   "message": "Man child. He wouldn't find a job. So, after three years, I've realized that the relationship wasn't going anywhere, and felt I just wasting my time.",
   "created_utc": 1691265505,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxv8bt",
   "message": "Distance :(",
   "created_utc": 1691265628,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxvgqt",
   "message": "The spark just wasn’t there anymore. She also just lost all ambition to do anything to make herself/us better. She also had a terrible problem with money that always made me have to suffer. She’s a great person but just not what I was looking for anymore",
   "created_utc": 1691265724,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxvmse",
   "message": "Guess I dodged a bullet, huh? 😂",
   "created_utc": 1691265791,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxvq9f",
   "message": "He was a creep, well to be precise a pedo. \n\n\n\n(He wanted to have sex, I was 13 and didn't and still don't know his age.)",
   "created_utc": 1691265832,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxw0gx",
   "message": "She kept asking me for money for her 7 year old daughter after our first date which I think is a huge red flag",
   "created_utc": 1691265945,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxw0rg",
   "message": "he broke up with me after ignoring me for 3 days because I made a joke calling his co-workers \"stupid\",,, he cheated on me months before",
   "created_utc": 1691265948,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxw4b5",
   "message": "Her friend got us together (i didn't really want to get together but i went for it since i never had a GF before) and after an awkward few messages an uncomfortable dog walk and double date to the cinema that ended up making her cry we both decided that we had nothing in common and to just stay friends. A few months later i see her again acting like a self entitled asshole to some random person that walked into her by accident by calling them names and making them cry before they ran away. Sooooo i dodged a bullet there",
   "created_utc": 1691265988,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxwj8c",
   "message": "She dropped kicked my cars windshield",
   "created_utc": 1691266159,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxwlxx",
   "message": "She cheated on me and broke it off by letting me know and also calling me a drug addict for smoking weed, at that point I realized I had no idea who I had been talking to for 4 months",
   "created_utc": 1691266190,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxwmnp",
   "message": "My parents didn’t approve",
   "created_utc": 1691266198,
   "score": 4,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxworh",
   "message": "She bought a house behind my back, in a town that she knew I didn't want to live in.",
   "created_utc": 1691266222,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxwqtk",
   "message": "She wanted me to change my entire personality so her friends wouldn't think she was an idiot for dating me. Like I get I can be immature at times, but I do take things that are serious, seriously. \n\nThat said, it was also the hipocracy of her saying that after not too long before that, she and her friends were laughing at another friend who had accidently streamed hentai in the discord group chat. \n\nBut no, me making a few immature jokes here and there was the bigger issue. \n\nIt is what it is lol.",
   "created_utc": 1691266246,
   "score": 43,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxwsdx",
   "message": "For a year, I basically supported her and her kids because she couldn't get a job due to her residence status being all messed up. Then one day we got into an argument/discussion about it being 50/50 if we were to live together and she felt that I have to pay for everything because that's always how it's been in her family, she was raised in Mexico. That's what started the argument in the first place. Then she said one day she hopes to find someone who will support her. That comment set me off, she pretty much told me thanks for everything but you're just temporary till I find someone else to pay all my bills. She tried playing it off saying that I misunderstood her (because she said that to me in Spanish. I speak Spanish just fine). What piss me off the most she kept on trying to say I was mad about it not being 50/50 and wouldn't acknowledge what she said about her finding someone else.",
   "created_utc": 1691266263,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxwve8",
   "message": "I went to Australia for a year and when I can back to surprise her after 3 months her boyfriend was living in our apartment.",
   "created_utc": 1691266297,
   "score": 42,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxx1on",
   "message": "Same reason I gave when this was posted a few months back",
   "created_utc": 1691266369,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxx3tw",
   "message": "His exwife started stalking me and sent death threats, stalked my exhusband and said I was having an affair with a married man, told the (ex now) boyfriend that my exhusband called her and that he and I were still involved, she pretended to commit suicide. I was dating this guy for 2 months. Not worth the drama",
   "created_utc": 1691266393,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxx5ke",
   "message": "He lied too much and would gawk at other chicks right in front of me",
   "created_utc": 1691266414,
   "score": 67,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxx6xy",
   "message": "Cuz she broke up with me.  And now we’re back again 😂❤️",
   "created_utc": 1691266430,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxx72e",
   "message": "My friend (her cousin) told me she said she was having second thoughts about me and thinking about getting back with her ex. I phoned her and calmly asked if this was true and she said it was and I said we should break up and we did. \n\nIt was civil, we didn't have a fight about it but I was more hurt than she was and I still lived her for a while. She got back with her ex for a bit and they were on and off a few times which was clearly not a good sign but now she is in a relationship she has been in for many years and I am happy for her.",
   "created_utc": 1691266432,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxx91v",
   "message": "I barely remember the relationships I was in back before I met my wife. Basically I ghosted everyone after I met her. We married a few years later, still together.",
   "created_utc": 1691266454,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxxfjk",
   "message": "Cheating.",
   "created_utc": 1691266528,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxxj6q",
   "message": "I left him because I was so sick and tired of being manipulated, controlled and mentally abused all the time. \nI didn't realize what was going on till I finally snapped",
   "created_utc": 1691266569,
   "score": 135,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxxqac",
   "message": "No choice.  She cheated",
   "created_utc": 1691266651,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxy06m",
   "message": "She liked being on the Internet all night and fucking other people better than me.",
   "created_utc": 1691266764,
   "score": 5,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxy1l3",
   "message": "Decided she wanted to get married and have kids with me immediately, after dating for 2 months. Gtfo",
   "created_utc": 1691266781,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxy2zx",
   "message": "I got a new puppy. She said she didn't like him and that I was giving the 8 week old puppy too much attention. So he now uses her pillow",
   "created_utc": 1691266797,
   "score": 120,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxy8bc",
   "message": "Which one?? I think I got scared because it never ever worked out. And the emotional fallout was not worth the attachment. The older I get the shorter my relationships get. 🤦‍♂️",
   "created_utc": 1691266858,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxyikw",
   "message": "Cheated",
   "created_utc": 1691266978,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxyj38",
   "message": "We decided we worked better as friends so just went back to being friends. Still in touch with her almost 30 years later.",
   "created_utc": 1691266984,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxykxy",
   "message": "my last ex broke up with me.  LDR, she got super closed off when she met some group while streaming and then broke up with me to 'work on herself'",
   "created_utc": 1691267006,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxyl24",
   "message": "The last person I broke up with bc she informed me of her decision to have a sperm bank baby to which I was not to be a second parent.",
   "created_utc": 1691267008,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxylsp",
   "message": "He flirted with one of my friends and kept making comments about how hot other girls were. I'm very grateful I broke up with him because I met my now-husband shortly after:)",
   "created_utc": 1691267016,
   "score": 106,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxym0a",
   "message": "I told her I won’t be entertaining a relationship with her ever again and saved all of the messages which turned into threats. I told her if she wants me to be with her she will not force me to put her parenting abilities into question with a judge. She promptly stopped all communication with me, because she’s a good mom, and I finally had peace.",
   "created_utc": 1691267019,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxynah",
   "message": "I got her pregnant and fucked off cause I'm a deadbeat.",
   "created_utc": 1691267034,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxys9o",
   "message": "He decided drugs and ither women were more important than me and our children.",
   "created_utc": 1691267092,
   "score": 98,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxywnj",
   "message": "We graduated high school and went our separate ways.  I stayed in-state for college, he went to the East coast, and neither of us wanted to try to maintain a long-distance relationship.",
   "created_utc": 1691267145,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxywyx",
   "message": "My girlfriend wanted me to kick my son out of my house, sell it and go hugely into debt for another house and I’m a few years away from retiring, which I could never do saddled  with a new giant mortgage.",
   "created_utc": 1691267148,
   "score": 211,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxyxik",
   "message": "We liked each other, but she felt that her future was in one city, and I felt that mine was in another. We're still friends. I married a great geek girl. And, so did my ex, which might also explain things.",
   "created_utc": 1691267155,
   "score": 112,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxz07p",
   "message": "Gaslighting manipulative bitch",
   "created_utc": 1691267186,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxz2mo",
   "message": "She got off birth control and was fucking my best friend for a year to get preggo once just to make me eat her with another man’s baby in her. He’s super hung and I’m average and fixed.",
   "created_utc": 1691267214,
   "score": 137,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxz359",
   "message": "Because stone cold said so",
   "created_utc": 1691267219,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxz672",
   "message": "She went on a date with another guy",
   "created_utc": 1691267253,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxz7s2",
   "message": "My ex brought a \"friend\" over to watch a movie.  I sat on the far left, he sat on the right and my ex sat in the middle.  When I put my arm over her she jumped to the right into his arms.  Also didn't help that right before that she told me I should go spend the night at my moms house because I was going to be mad.  I called her bluff and that is what happened.",
   "created_utc": 1691267271,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxz8kx",
   "message": "JOKE'S ON YOU! I never been in relationship!",
   "created_utc": 1691267280,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzcwr",
   "message": "Not a break up. Cancer took her away",
   "created_utc": 1691267330,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzgbf",
   "message": "We had different ideals at the time, plus I felt like she wasn't independent enough. I needed more alone/me time. It's interesting, because we've stayed casually in touch, and we're actually a lot more compatible now. She's taken on more hobbies and I've loosened up on some of the ideals I thought were so important.\n\nFeels like that ship has sailed though.",
   "created_utc": 1691267368,
   "score": 15,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzj0i",
   "message": "Just realized we weren’t compatible and stringing the relationship along was wrong.",
   "created_utc": 1691267400,
   "score": 71,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzj38",
   "message": "She slept with two of my best friends because she didn’t want to break my heart by breaking up with me because she wanted other options instead of marriage.",
   "created_utc": 1691267401,
   "score": 12,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzobq",
   "message": "I got dumped instead of being the one to end it, but it was because her family doesn’t like me because I’m from Alabama. That’s the only reason they gave.",
   "created_utc": 1691267461,
   "score": 128,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzpaj",
   "message": "Because he was looking for pregnant women to bang on Craigslist",
   "created_utc": 1691267472,
   "score": 195,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxztd8",
   "message": "He got cold feet and called off our wedding 2 months before the date. I took a month to myself to collect my thoughts and came back, did damage control all by myself (called the guests and vendors lying about what happened to save his image) humiliated, and emotionally defeated, gave him 6 months to make it right. All I asked for was a single date that had effort behind it like making reservations and dressing up nice. I wanted a sincere and vulnerable conversation. I wanted help replanning the wedding too. \n\n6 months. He fought with me every other day when I tried talking to him trying to work it out. 6 fucking months and he refused.",
   "created_utc": 1691267519,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzts8",
   "message": "Mine left me in the middle of moving in together.  A 6 year relationship. He’d been picking on me for months, which I was trying not to react to, about how I was too short, fat, ugly, and dumb for him. When he left, I was just glad to see him go. I think he was upset that I didn’t cry or beg. No idea what (or who) he’s doing now, but a small and petty part of me hopes he’s lonely. I don’t want him back. I just hope nobody else wants him either 😈",
   "created_utc": 1691267523,
   "score": 34,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzu8l",
   "message": "I was pregnant and he wouldn't get a job, wouldn't help around the house, wouldn't help me at all. On Valentines Day I came home from work early but I had to run to my parents house for something, we lived 10 minutes apart, I would have been gone for 30 minutes tops. He pitched a huge fit about us never spending any time together and how I was always at my parents house. I was over it and I just walked out. He went to his moms that night and I packed up all my stuff in one trip and moved back in with my parents.\n\nHe's met his daughter twice in three years. Hasn't paid child support in months. I haven't heard a word from him in almost a year. None of his family has ever met my daughter or even expressed interest in wanting to meet her.",
   "created_utc": 1691267528,
   "score": 34,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzz1p",
   "message": "She ended up havin a penis.",
   "created_utc": 1691267584,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juxzzny",
   "message": "The breaking point was that he wanted me to love him more than I love my religion. He was also emotionally abusive and a little bit physically and sexually abusive lol, but since I was in the midst of it that didn't matter as much to me",
   "created_utc": 1691267591,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy01yy",
   "message": "Bitch was crazy!! Also an alcoholic who couldn't stop doing cocaine.",
   "created_utc": 1691267618,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy02x0",
   "message": "Total disregard for my life",
   "created_utc": 1691267628,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy05hh",
   "message": "She was extremely practical. Annoyingly so. It became more evident when we moved in together which was also a week before covid lockdown first started. She became a homebody and lost interest in going out and doing much of anything. She would tell me i was spending too much money on my hobbies, which are definitely not cheap, but i was still dumping income into savings and doing well financially. \n\nShe gained a lot of weight during lockdown and got down on herself about her body. I never criticized her but always invited her to hike or fish or just come to the gym with me. Never told her she had to, just asked if she wanted to come with me. She never did. She used to love hiking and acted like she'd never been and would mever want to.\n\nShe told me i couldnt buy a pickup truck because we supposedly didnt need one and they werent good on gas... But i spend a lot of time fishing, often on the beach, and my car was full of sand and smelled like low tide. Pickup seemed logical to me. That was the final straw.\n\nIts a shame because we wouldve at least still been good friends had we not been  stuck inside together for 2 years.",
   "created_utc": 1691267657,
   "score": 30,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy061b",
   "message": "I'm about to break up with a girl who I've been steadily losing any attraction for, she's nice but I can't fake it",
   "created_utc": 1691267663,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy07pj",
   "message": "After 5 years, 2 of them engaged, she said “I don’t live you and never did. I don’t want to marry you and never will. But you can still drive up here on the weekends to take me out”\n\nNOPED right outa that one!",
   "created_utc": 1691267682,
   "score": 145,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy0zbl",
   "message": "He made me drive him and his girl “bestie” (who I never really trusted or liked) home from a Halloween party and they both sat in the backseat, like I was their damn Uber driver.",
   "created_utc": 1691267996,
   "score": 129,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy2xuw",
   "message": "Dude put *zero* effort into anything, crossed boundaries even when I told him not to, and was generally just an *incredibly* selfish, entitled, lazy slob. Idk what I ever saw in him. \n\nFunny enough, I met my now-partner (R) through the same mutual friend who set my ex and I up. Several years after I dumped my ex, R and I got close, the rest is history. He’s a solid dude - I’m damn lucky now.",
   "created_utc": 1691268803,
   "score": 98,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy1f03",
   "message": "incompatibility. Im a pretty romantic dude, but what I want is \"casual\" compared to what she needed (No female friends for me. No gaming, No gigging, a majority of our time spent together wasted on talking about \"how perfect we are for eachother\" rather than just *being*)",
   "created_utc": 1691268179,
   "score": 70,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy0fow",
   "message": "I had suspicions she was having sex with other people, then found out she was still talking to her ex (on top of confirming she was having sex with other people) and then tried to say she was pregnant with my kid. See ya later.",
   "created_utc": 1691267772,
   "score": 48,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy0u0l",
   "message": "Couldn’t stay off drug for 90 days to satisfy his probation requirements to stay out of prison. They gave him three very lenient chances and he blew them all within 30 days each time. But nooo he doesn’t have an addiction, it’s all the courts fault.",
   "created_utc": 1691267935,
   "score": 48,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy3ptc",
   "message": "He ghosted me after 5 years of dating. Just stopped texting me one day. No closure or explanation. He also spent those 5 years gaslighting me into why we can't live together, why I'm crazy for bringing up children, why he never can take a vacation together, why he only wants to see me once a week so he can get in boy time too. Wasted my whole damn youth on him.",
   "created_utc": 1691269134,
   "score": 23,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy61w6",
   "message": "Because the kid came out with more melinin than than my entire Scandinavian heritage combined built up over generations, Im pale as fuck, just thinking about going in the sun gives me gives me PTSD.\n\nHowever she still claims its my child, yet he looks a lot like the neighbor.  Then again, im employed, so I am an easy Cash Cow.",
   "created_utc": 1691270085,
   "score": 55,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy67pv",
   "message": "He was turning 30 and had no life goals. He was okay not having a job and not being a homeowner. I was 25 and knew it would always be like that if I didn’t leave. \nHe passed away at 35. I think about him often :/",
   "created_utc": 1691270154,
   "score": 175,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy0lsy",
   "message": "She had an unhealthy relationship with her mother. Toward the end she took her mother with her to a music festival that I wanted to go to, and took her mother on our planned vacation to Halloween horror nights because her mother would cry and say they never spend time together even though they saw each other almost daily. We had one car and I had just worked a super long day and was tired and just wanted to go home so I was waiting for my ex to come pick me up in our shared vehicle. In stead she pulls up with her mother in her car. I have to sit in the back alone of course and be excluded from conversation and I’m told we are going to her mothers house to spend the night. I have no clothes to change into and I just want to go home and relax but I’m told that I’m being in reasonable and we are going to go watch horror movies(I don’t like horror movies) and eat food from a restaurant that I hate. They refused to drop me off at home so I got out at a light walked home and moved out. It was a long time coming but that was the final straw after almost 5 years of dealing with this insufferable toxic family.",
   "created_utc": 1691267841,
   "score": 17,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy0ouy",
   "message": "All she cared about was her career. Like, that’s everything she talked about. When I asked her how she was doing, she would talk about this amazing thing that was going on in her professional life. Never in 3 years of dating did she ever show that she cared about me. She would only do it when I would try to leave, she would be super attentive for a couple days and then back to the same old stuff. She had to be the center of attention in every conversation. She was such a miserable person and she made miserable as well.",
   "created_utc": 1691267875,
   "score": 114,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy0xq6",
   "message": "She was just unbearably immature and insecure about everything. On top of that sometimes really stupid.\n\nAs examples one time during sex she asked out of the blue \"do you think I'm successful?\" and she nurtured our cultured sourdough with protein powder instead of flour because \"it makes people strong, so it will also make the sourdough strong\". On a regular basis she started crying because of random things that happened in her childhood (for example not having enough money for fancy school lunch and getting pre packed sandwiches instead). She really needed/still needs professional help on that but doesn't want any and I couldn't stand that anymore.",
   "created_utc": 1691267977,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy1h43",
   "message": "Narcissistic. \n\nI was always the one in the wrong. It was always about her and my thoughts or feelings were not a priority. World revolved around her. \n\nFelt so much better later down the road. Life is too short to put up with that",
   "created_utc": 1691268203,
   "score": 201,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy1qkf",
   "message": "Because he was a miserable drunk and heroin addict. I’d put up with him going to jail after 3 DUI’s, rehab, a car wreck after over dosing on heroin, and his awful family as well. They blamed me for his active addiction, but he’d been addicted to every substance in existence since before I was even out of HS. His mother is also in love with him and I’m pretty sure he’s the father of his cousin’s son. Anyway. The last day we were together before I finally I threw him out, he had sworn he was done with booze and drugs, but snuck vodka into a sprite bottle after getting out of work early. I went to pick him up and he wasn’t acting drunk yet. We went to Walmart for a late night grocery run, and I remember so vividly watching him go from normal to sloppy. The sloppiest i had ever seen him. The guy had traumatic brain injury so his type of drunk was completely incoherent, unbearable, and such a fucking asshole. He was stumbling all around the aisles, shouting and being just generally embarrassing to be seen with. I knew I’d reached my breaking point with the relationship because I had spent two years fighting for him to get better and do the right thing and he just refused. I normally would argue, get mad, cry, etc. but that night I was just done. Completely indifferent and silent. After I put the groceries away, while he berated me, kicked the bags I was trying to pickup, screaming incoherent bullshit, threatening to kill the cat I just got just begging for some kind of reaction- I took my kitty and we went to bed with no fight. I had work in the morning. Idk if he just wanted to fight, knew he was losing me and was desperate for a reaction or all of the above, but a few hours later at around 3 am he burst in the door and threw himself on top of me and started kicking the shit out of me. He wasn’t a very big dude so I got him off of me and went into the living room and he chased after me. He hit me upside the head with something, still don’t know what, and knocked me to the ground and started choking me. My best friend of ten years luckily lived in the apartment up the stairs which had access to our downstairs apartment and it was unlocked, so I SCREAMED at the top of my lungs for him. He is a six foot two gay man arm muscles the size of my head with a bitch slap from the gods, and my ex was terrified of him- so of course the second my big blonde savior crashed through that door he scrambled off of me and sat down on the chair trying to act like he did nothing wrong. BFF says “oh FUCK no, I am tired of you and the way you treat my girl. I’m calling the fucking cops.” And ex sees red but still is terrified of BFF, and says “try it and I’ll slit your throat” under his breath and that’s when I saw red. Because I’d always been one of those people who just took the bullshit, but one thing I never tolerated was anyone disrespecting my best friend. I lost my shit, ripped off his brand new shoes that I’d bought him with my full time job, and literally lifted him by the seat of his pants Lorax style and threw him shoeless out into the freezing February rain. Adrenaline gave me my funniest break up story. \n\nIt was Valentine’s Day. \n\nHe tried several times to get back together with me and I went NC. His new fiancée still stalks my social media even though I am happily married with a beautiful daughter. Moral of the story: don’t waste your time with alcoholics/drug abusers. They are awful partners. Also, don’t get with a 32 year old when you’re 20. They don’t think you’re mature for their age. Women their age just know better.",
   "created_utc": 1691268310,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy23ju",
   "message": "She is a compulsive liar.",
   "created_utc": 1691268458,
   "score": 21,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy26ir",
   "message": "She was too controling.",
   "created_utc": 1691268493,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy28zr",
   "message": "He was physically abusive and I found out he was still messaging and meeting up with prostitutes.",
   "created_utc": 1691268521,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy2oic",
   "message": "I was broken up with. I unknowingly got triggered by her calling me a “pushover” and that triggered a memory that happened as my ex wife broke up with me where she called me a “pussy” for some reason. So me being triggered by this came as a complete surprise and I…just shut down. And then I continued messing up with communication over the next week. \n\nSo I don’t blame her at all. I’m just still disappointed in myself that I couldn’t communicate to her what was happening 😢",
   "created_utc": 1691268695,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy3vdk",
   "message": "I'm divorced because my husband had an affair for 3 years. After our child died. Such a great guy.",
   "created_utc": 1691269199,
   "score": 31,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy432b",
   "message": "I broke up with my ex-wife because she cheated on me with some random guy she met at a sci-fi convention. She took off with him. She shaved half her head and dyed the other half purple. She started wearing a dog collar and joined the carnival with him. Thankfully, she and I did not have any children. I am not kidding. This really happened.\n\nFast-forward 7 years. I am happily remarried to a wonderful woman. We have have four children (two from her previous marriage), and have never been happier.",
   "created_utc": 1691269287,
   "score": 72,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy48g9",
   "message": "I’ve been married for 14 years this month, but I broke up with my ex before my husband because a) he would not say he loved me after a year and b) he refused to tell his family I existed. Totally within his right but I didn’t feel like being a secret.",
   "created_utc": 1691269347,
   "score": 84,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy4aqr",
   "message": "My ex broke up with me to be a vagabond and just wonder the world while I wanted to have a career and buy a house that we could call ours. She did that for a few months and now lives in a shack about 2 hours from where I currently live. I was pretty sad at first, but then realized I was financially supporting her a lot for the 7 years we were together. I think we are both happier now, but i had a menty-b for a few months post break up to realize that.",
   "created_utc": 1691269372,
   "score": 64,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy6bx1",
   "message": "We dated before and didn’t work out. Tried it again although now we both had kids. After a month he was making plans to move into my house, wanting another kid, and his kid was awful to mine. Mine would end up bawling when they would come over. I noped out and then he went on a bender for two weeks, repeatedly told me to go kill myself and showed up at my door in the middle of the night drunk demanding to come in. I did not let him in and blocked him.",
   "created_utc": 1691270203,
   "score": 3,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy2m9d",
   "message": "I started taking my schizophrenia meds and she just dissapeared :(",
   "created_utc": 1691268671,
   "score": 4,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy2s1x",
   "message": "never had ex married to my only gf i had",
   "created_utc": 1691268736,
   "score": 4,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy0iey",
   "message": "It just wasn't the best fit. He's a great person and I wish him the best.\n\nThe last person, though...I'm not sure what to call what that was. But he talked about coming to visit him and booking tickets for various things and then just ghosted. He's done this before a few years ago and I know he has some mental health struggles, so I don't hold it against him too much. But it does feel terrible, especially when we have so much fun together. I'm guessing it was the long distance thing, but who knows. Maybe it was just me.",
   "created_utc": 1691267803,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy0o8n",
   "message": "He constantly lied to me and manipulated the situation to make me look bad to others. He had a “good guy” complex (where he had to look like such a good guy to everyone around him) and it was all so disingenuous. He also tried to hook up with multiple of my friends while we were together and freshly broken up which just added salt to the wound. I will always consider my decision to leave as one of my better life choices. Still wish him the best.",
   "created_utc": 1691267869,
   "score": 7,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy0psd",
   "message": "Emotionally neglectful, he cheated a few times (one instance involved a trip to his parents' house over Christmas, and he left me stranded at their house to drive to Florida to cheat).\n\nHe was military, once he went on a deployment and came home for R\u0026amp;R. Once he went back, he e-mailed me, \"I don't want to be married to you anymore.\" That's all, we did get back together before the end of the deployment and his return but that didn't last long till we separated again.\n\nOverall, just a shitty husband.. we divorced, and several years later, we became good friends after he apologized for everything.",
   "created_utc": 1691267886,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy13sp",
   "message": "He didnt respect my boundaries inside or outside the bedroom, he also used \"babytalk\" a lot which is an absolute ick of mine. We just had no sexual chemistry but he didnt realize it and was dumbstruck when i called it off. I still question how he did not notice?",
   "created_utc": 1691268049,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy1agu",
   "message": "We both changed too much and grew apart. Sorta just gradually stopped loving each other and stopped being right for each other, got boring and anxiety inducing",
   "created_utc": 1691268127,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy1hm8",
   "message": "he told me he loved me less than a week in despite me telling him it made me uncomfortable. his bath had a ring of hair (he was very hairy) around the walls, he left a skid mark in the toilet while i was there. the ex before then (the other one lasted like 3 weeks) i ended it bc he would stand me up constantly, compulsive liar, cheater, fuckboy.🙄",
   "created_utc": 1691268209,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy1jt5",
   "message": "Because I was planning our wedding and thinking about my best friend… who I’ve now been married to for 12 years.",
   "created_utc": 1691268234,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy1nia",
   "message": "He was mentally, sexually, and emotionally abusing me. He pretended to be suicidal and “check himself in” at a behavioral hospital in a different state only to go on facebook and post photos from said “hospital” that was actually a lovely hotel in Gulf Shores, Alabama where he was meeting his side boo. I made the mistake of going back to them once before and I made sure never to do that again. Also, he got married to that woman some time later.",
   "created_utc": 1691268275,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy1odd",
   "message": "I dipped because he used to beat me. Love your self enough to leave … \u0026amp; never look back. I am a survivor.",
   "created_utc": 1691268285,
   "score": 53,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy1tcf",
   "message": "She cheated and denied it. I had access to her Facebook account and saw the messages. Not only did she cheat but she called me and told me said she needed to go to the hospital, so I took her. While in the waiting room I was questioned by police because she said she was raped and didnt clarify that I was not the one who allegedly raped her. After the hospital visit she wanted to get tacos. She was crazy.",
   "created_utc": 1691268342,
   "score": 20,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy22s8",
   "message": "Found out she was cheating on me..\n\nWell, I found out that she was cheating on her bf, who she was cheating on her fiancé (who was stationed in the Middle East) with\n\nIt was good times 😅",
   "created_utc": 1691268449,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy2b4s",
   "message": "She left the country due to COVID hitting, she then had an affair with a new work colleague. I spoke to her alot but I had it turned on me that I wasn't doing anything to help her, and that I wouldn't move the other side of the world for her. Turned messy but we split up and then she blamed me for her having mental health issues. About a year after she had the cheek to message me asking to come and get some of her stuff",
   "created_utc": 1691268545,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy2d48",
   "message": "It’s been a while but it happened because she was years younger than me and lived hundreds of miles away. She deserved better.",
   "created_utc": 1691268567,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy2hn2",
   "message": "We lived at the two ends of the world",
   "created_utc": 1691268620,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy2vu9",
   "message": "She never loved me, she was just using me",
   "created_utc": 1691268779,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy2y94",
   "message": "She went back to HER last ex.",
   "created_utc": 1691268808,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy31j7",
   "message": "they threw my teacup off the balcony - nice teacup too!",
   "created_utc": 1691268847,
   "score": 13,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy3ahl",
   "message": "Rave drug addiction",
   "created_utc": 1691268952,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy3gjp",
   "message": "He got into playing video games for hours on end and stopped giving a fuck about me",
   "created_utc": 1691269024,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy3h94",
   "message": "Basically because he was an AH. he was never there for me at the end of our relationship. he treated me crappy, and I was just over it. Definitely don't regret dumping him.",
   "created_utc": 1691269032,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy3i7g",
   "message": "She cheated on me. While we living together.",
   "created_utc": 1691269043,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy3iqn",
   "message": "Broke up with him because some other girl told me he cheated. And it was the girl he told me not to worry about. They're married now. \n\nMy most recent ex, broke up with me on my birthday, few weeks ago. For a girl he cheated on me 5 years ago with. He left me for her.",
   "created_utc": 1691269050,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy3j1l",
   "message": "Lack of sexual fulfillment",
   "created_utc": 1691269054,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy3k1q",
   "message": "He would ask me the same three questions in a row (only time we talked after the first week) and refused to acknowledge me if i tried to text him first. We are teenagers but just put some pazzazz in it or something.",
   "created_utc": 1691269065,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy3p6n",
   "message": "Well let's see.  Choked me (not for fun), hit me, threw her keys at me, spit on me, drove over my baseball gear twice, and broke a trophy I won playing baseball.  Did I miss anything?  Oh yeah, every time she did these things is was right as I was leaving for work.\n\nSicilian women, damn man.  They are like shotguns.",
   "created_utc": 1691269127,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy3w26",
   "message": "Because after 6 years, as we truly got to know each other, I realized it wasn’t the right fit for me. Sometimes life requires making very hard decisions, I made that decision.",
   "created_utc": 1691269206,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy41fu",
   "message": "She was constantly at my house even when I was working. Making a mess of the place and a disgusting one at that. I had to save a guitar amplifier from the gooey remains of a drink that had leaked through the paper cup she left on there with some other candy.\n\nI was already really depressed and just couldn’t handle somebody in my space actively making things worse. I said I needed to work on myself (which was true, I did - and very specifically, I needed to work on myself without her around to fuck it up, but I didn’t say that part out loud).",
   "created_utc": 1691269269,
   "score": 15,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy45ui",
   "message": "She was verbally abusive to her kids and then one day she got mad at her 12 year old boy and went to kick him in the leg and he turned and she kicked him square in the nuts and I couldn’t take it anymore so I bailed on the situation. Her family knew about her abuse and I think she got help after I left",
   "created_utc": 1691269318,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy4751",
   "message": "I could make a better living if I moved away.",
   "created_utc": 1691269333,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy4k5u",
   "message": "Insecurities were exhausting and was emotionally manipulative. Always asking me I why I was talking to other guys. Threats of suicide when he wouldn't get his way. Finally I said \"no\" and hung up. He called back BEGGING me not to leave him. It was at that point when I finally realised I could've said no from the beginning.",
   "created_utc": 1691269478,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy4n5t",
   "message": "I just can’t really handle her anymore. She wants me to be someone else. I’m gonna be me, she can go find someone else.",
   "created_utc": 1691269511,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy4oao",
   "message": "BPD is a serious condition and I found out the hard way...",
   "created_utc": 1691269523,
   "score": 73,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy4qtb",
   "message": "I started thinking his ex wife was right.",
   "created_utc": 1691269551,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy4sa2",
   "message": "We lived two separate lifestyles. She came from a side where she never had to worry about money and dad paid for everything even some of our dates and myself was where I did what I needed to get by or was conservative with my money. She couldn’t grasp my side of the lifestyle and would toss stuff onto orders because she “wanted them” without asking which she was used to being able to do.",
   "created_utc": 1691269567,
   "score": 14,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy57ck",
   "message": "I loved her so much it still hurts me badly a year later. We lived 3 hours apart and with our careers neither of us could move to the other persons city. I broke it off when I’m usually the one that was dumped. Still question if this was the right decision every day. Haven’t spoken to her since the day we broke up. I’ll never forget her crying. Love is beautiful and so painful. To each their own",
   "created_utc": 1691269732,
   "score": 8,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy7ls9",
   "message": "He was very insecure and paranoid, voicing worries that he wasn't good enough for me and that I'd dump him and find someone else. It was annoying, so I did.",
   "created_utc": 1691270742,
   "score": 9,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy8c4n",
   "message": "My first marriage: I was married for 15 years, and he said he wanted to date other people. That was a deal breaker for me.  This was after marriage counseling, I nursed him back to health after a serious accident (but when I dislocated my shoulder I ended up driving myself to the hospital), and he didn't work for the last few years of our marriage, didn't do any housework, his hygiene became non-existent, and on and on.   I had enough.  \n\nI then was single for several years with lots of first dates, and rarely a second date.  Then I met my current husband.  Upgrade.",
   "created_utc": 1691271049,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy8f9z",
   "message": "He picked me up after a Christmas party where I'd had too much to drink.\nFor some reason after seeing me throw up out of the car  on the way back he still thought it would be okay to have sex with me that night. I don't remember a thing but found out what happened the next day. Felt completely betrayed and unsafe in my own home we had bought together",
   "created_utc": 1691271085,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy8qrj",
   "message": "Because I woke up",
   "created_utc": 1691271215,
   "score": 2,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juyainb",
   "message": "The day before he was due to move in with me I found out he had installed Spyware on my laptop",
   "created_utc": 1691271971,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juyampj",
   "message": "Because he was an abuser, an addict (several addictions, also stole money from me to feed his insatiable drug habit), was constantly trying to cheat, threatened my safety, was a compulsive liar... I ended up trapped with him during the pandemic and things got progressively worse. I escaped the first chance I got.",
   "created_utc": 1691272018,
   "score": 1,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juybyek",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy4492",
   "message": "I’m still sad about this (granted it’s only been about three months but still).\n\nHappiest, healthiest, most supportive and positive relationship I’ve ever had. I recently had to move away and she is tied to where she is for several more years while getting her doctorate. We debated doing long distance but both agreed that neither of us can really handle that and it would only make things needlessly difficult. \n\nWe came to the decision to separate mutually while we still loved each other than to put that strain on our relationship and risk separating later for worse reasons. \n\nI still love her dearly and can’t even think of looking at another woman right now. \n\nI have faith that one of two things will happen. In a few years we can reconnect and live near each other again somehow or I find someone else I can love in that time.",
   "created_utc": 1691269301,
   "score": 58,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy74df",
   "message": "He tried to burn my house down with me and my dogs inside, while I was sleeping",
   "created_utc": 1691270539,
   "score": 82,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy3fq2",
   "message": "I came out as a transgender woman. She supports me but she’s very much straight and couldn’t be in a relationship with another woman. We’re still friends but it’s a little awkward.",
   "created_utc": 1691269014,
   "score": 11,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juydh7l",
   "message": "I dated this women for a month until I found a news article on twitter about her being arrested for bestiality with a male dog, it also stated police found that she made videos of it and put it in snap chat",
   "created_utc": 1691273231,
   "score": 9,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juylmyb",
   "message": "I don’t date, I just foster them until they find their forever homes",
   "created_utc": 1691276803,
   "score": 72,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy17ks",
   "message": "She could fart louder than me.  As an insecure man, I found this to be a deal-breaker.",
   "created_utc": 1691268094,
   "score": 25,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juyesgl",
   "message": "My dog had a medical emergency (that resulted in him being put down a few days later) and my bf just kept on playing video games while it happened.",
   "created_utc": 1691273819,
   "score": 63,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy97zj",
   "message": "I broke up with someone I loved because we had incompatible life trajectories, and we had different ideas about kids. It sucked, I felt terrible about it, and it took me a while to feel good about myself enough to date again. Now I’m dating someone who is basically perfect for me, and visa versa",
   "created_utc": 1691271415,
   "score": 30,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juy7uk6",
   "message": "He manipulated me into marrying him, put me in crippling debt, told me he wanted kids then forced me to have an abortion, was physically abusive, extremely emotionally abusive. All the things",
   "created_utc": 1691270845,
   "score": 28,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juywkvh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juyasg0",
   "message": "Guy was a verbally abusive drunk. And he got drunk a lot. \n\nI got sick of listening to slurring voicemails accusing me of wanting to be with other guys and not loving him, calling me a bitch and a whore, etc. It got old, real fast. \n\nNever cheated on him.",
   "created_utc": 1691272086,
   "score": 26,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juyww77",
   "message": "it’s one of the biggest asshole moments of my life but I met a woman in one of my classes that I knew I was going to marry. I didn’t want to mess around on my gf at the time or do one of those “secretly test the waters with this new girl to see if there’s anything there” things, so I broke up with her. I did end up marrying the woman from my class but breaking up with the other woman was really hard because she didn’t do anything wrong, and she was a great gf. I just knew I was supposed to be with my now-wife.",
   "created_utc": 1691281969,
   "score": 12,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juyel56",
   "message": "He had an avoidant personality. Every time we got closer he would start to flake and get really distant. I was able to understand that and even dealt with it. Then he started lying about random things. He made some really strange lifestyle changes that I couldn't understand (moved into communal housing), and either sold most of his things or moved them into a storage unit. I felt like he was trying to hide something major and it all felt sketchy so I noped out.",
   "created_utc": 1691273726,
   "score": 16,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juyay8f",
   "message": "He threatened me with physical violence and then dismissed me and made fun of me when I got upset about it. \n\nIt was part of an escalating pattern of abuse, and it was the final straw; I finally stopped making excuses and broke up with him a few days later, and I am still pissed as fuck.",
   "created_utc": 1691272153,
   "score": 15,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juydvrf",
   "message": "Emotional/mental abuse and infidelity. I became a shell of who I once was. I was made to feel ugly, repulsive, and stupid. I remember looking in the mirror after a good sob sesh and not recognizing myself. \n\nWhen I decided to leave it felt like a massive weight was taken off my shoulders. If you’re reading this and you’re being abused - mentally, emotionally, physically, what have you - leave, and don’t look back. You won’t regret it.",
   "created_utc": 1691273406,
   "score": 21,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juzfj4y",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juzn8iq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15j15x4"
  },
  {
   "comment_id": "juz9fx0",
   "message": "You know those partnerships where you love the person so deeply with the dark depths of your soul that you spend your time together slowly destroying one another until you no longer recognize yourselves?\n\nYeah, it was like that.",
   "created_utc": 1691287941,
   "score": 13,
   "submission_id": "15j15x4"
  }
 ]
}