{
 "submission_id": "15j2uu0",
 "title": "Children of addicts, did you ever forgive them? Why or why not?",
 "selftext": "",
 "created_utc": 1691259969,
 "permalink": "/r/AskReddit/comments/15j2uu0/children_of_addicts_did_you_ever_forgive_them_why/",
 "score": 156,
 "url": "https://www.reddit.com/r/AskReddit/comments/15j2uu0/children_of_addicts_did_you_ever_forgive_them_why/",
 "comments": [
  {
   "comment_id": "juxplft",
   "message": "My sister is an addict and currently in prison. Her three kids (15f, 13f, and 9m) have been there through the thick of it for the last seven years. The two older ones have expressed that her addiction basically stole their childhood and are prepared to ignore her calls and attempts to reconcile until she has cleaned up for good. I don't know if they'll ever forgive her.",
   "created_utc": 1691263288,
   "score": 78,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxoxks",
   "message": "No. All my mother gave me was fetal alcohol syndrome. I was taken from my parents, just like all my siblings before me, the moment I was born. Because drunk morons obviously don't make good parents. I fucking hope I'm the youngest of the litter because those two should not have kids. If they had shred of common sense and humanity within them I wouldn't exist. But here I am because they didn't care enough. My mother didn't care enough to stop drinking or straight up have an abortion if she couldn't stop.\n\nI don't know if they're dead or alive and honestly I don't care.",
   "created_utc": 1691263018,
   "score": 196,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxrsf5",
   "message": "I tried to forgive my father after being estranged for like 12 years. I tried really hard. He was dying and I wanted him to die with love in his life but he kept fucking up so we’re estranged again.",
   "created_utc": 1691264199,
   "score": 138,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxzrl7",
   "message": "Nope. My egg donor had me followed by 3 other siblings. She couldn’t raise any of us due to a severe addiction. Left me and my brother in a abusive home. My brother has special needs due to being born addicted to crack. Right when they took us me being 18 months old and him being 6 months old we were found under a dumpster where she had left us. My other siblings she fled to California with but lost custody eventually of them as well. I found her when I was 18 and she was still using so I stayed away until 24 when she was “clean” with methadone. Aka not really clean shits just as bad. Can’t find it in me to forgive her for choosing drugs over her children.",
   "created_utc": 1691267499,
   "score": 50,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxzshd",
   "message": "Nope, I lived with my dad when I was younger and he was always either drunk or meth’d out most of the time.  He was always absent and I pretty much relied on my friends and neighbors to eat and shit because he never cooked and spent up money on beer and drugs. When I was around 9 or 10 I woke up to the cops banging the shit out of the door, he crashed into someone and killed I think 2 people, driving drunk af.  He’s in jail for the foreseeable future and I now live with my mom who hates me because she re married and had had kids with someone else.  I’m apparently an inconvenience to her perfect family dynamic🫤",
   "created_utc": 1691267509,
   "score": 3,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxxwf3",
   "message": "My dad busted his back in the early 90s, and the doctors threw an endless supply of morphine at him. \n\nOpiate addiction is a real bitch. Seen things that make me refuse pain killers even when I should take them.\n\nMe and my brother would have never survived the town we grew up with out him.\n\nI know a lot of people that have addictions that destroy them. It destroyed his body and, in the end, killed him. \n\nBut he never became the monster that they can become. Actually, for a man so damn busted up, I am ashamed that he always had a better sense of humor than me. \n\nAny wrongdoings that were committed over the years were forgotten, and no ill will was ever formed.\n\nHis passing was hard. \n\nThat being said, I suffered a form of ptsd over dealing with his overdoses.\n\nGuess that's not a problem anymore.\n\nI'd prefer he was alive. \n\nI always went easy on him. If I couldn't quit smoking, who was I to demand he quit painkillers? Maybe that logic was a mistake, but who knows. \n\nMy experience comes from him getting busted up when I was 2 and him dying from overdose at 32. 30 straight years of opiate addiction. So ya know. There is a lot to live through in 3 decades.",
   "created_utc": 1691266721,
   "score": 34,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxvvab",
   "message": "Yes I forgave them\nMy mother got help and was able to pull herself together\nMy father never quit drinking and ended up dying over it. I still forgive him. You don't want to hold on to contempt or anger the rest of your life trust me. You don't even need to include them in your lives, forgiveness is FOR YOU to move on, and heal.",
   "created_utc": 1691265887,
   "score": 58,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxy13d",
   "message": "Nope. He’s done a lot of work to get sober, but no part of it was for our family. I sit in a room with him and find myself thinking he’s failed the 12 step program even though he quit drinking ten years ago cause he never apologized to the people he was supposed to love and take care of. Good on him for getting his shit together, but he’s still a bad person and I resent him",
   "created_utc": 1691266775,
   "score": 81,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxtqwb",
   "message": "they are addicts. blaming them, holding them accountable, expecting them to understand and be self-critical is too much to ask.\n\nSo i finally got my justification to be distant. Forgiving? Whatever, the past is the past.",
   "created_utc": 1691265015,
   "score": 33,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxuh1q",
   "message": "My old man was an alcoholic. Instead of rehab he chose to shoot himself in the head. I will never forgive that fucking coward.",
   "created_utc": 1691265313,
   "score": 30,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxse1r",
   "message": "Forgive? I doubt it, he wasn't exactly peachy before the pills.\n\nI've tried to forget, erasing him from my life helped a bit.",
   "created_utc": 1691264447,
   "score": 12,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxz71m",
   "message": "Died before I had the chance...",
   "created_utc": 1691267263,
   "score": 3,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy0p36",
   "message": "My dad had a drinking problem throughout my childhood, and I do forgive him. I forgave him once I hit adulthood and felt myself buckling under some of the same pressures. He was never abusive, neglectful sometimes and not always pleasant to be around in his cups, but it runs in the family (granddad drank until some colleagues had an intervention, great-granddad drank himself to death - for all I know this shit could go back centuries) and I can't see myself doing any better in his shoes. He is much better now, and I try to take care of myself and not follow in his footsteps in any of the bad ways.",
   "created_utc": 1691267878,
   "score": 30,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxwefw",
   "message": "I forgive them for being addicts. It's a disease. And the way their early lives went (Mom was raised by a single mom in the 60s, Dad's home life was a dysfunctional dumpster fire), I'm not surprised they turned to alcohol and drugs for comfort.\n\nI forgive them for their mistakes raising us kids. They did their best, and it's obvious that the love was there, even when the common sense wasn't.\n\nI forgive them for dying early. I wish they wouldn't have, they both suffered greatly, but it can't be helped.\n\nI don't forgive them for having kids in the first place. What an irresponsible, selfish decision. They unleashed three impoverished, traumatized adults on the world. The only reason two of them are middle class now is because of a grandfather's inheritance. (The other one, me, is barely making it due to cancer) We should not have had to be born to save their relationship or satisfy Mom's desire for a baby or whatever their reasoning was.\n\n(This doesn't mean I want to be dead, don't worry, it just means they made a couple of terrible decisions)",
   "created_utc": 1691266106,
   "score": 15,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxrgs1",
   "message": "Yes. It took some time, but eventually I realized she did her best.",
   "created_utc": 1691264063,
   "score": 6,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxz997",
   "message": "Don't know how to answer this as it implies there is something to forgive and I haven't talked to them in almost three decades, but it's not like I cut them out or anything, just sort of how things worked out (I was in middle school) and they didn't really express much of interest in keeping in touch and neither have I. I say \"them\" but it was just one parent, and the other parent will kind of give me an update on them  (we are talking like once a decade here) and I just go oh ok and never have any idea what they want me to do with the information. So I guess forgive as I certainly don't blame them for being an alcoholic but I also have no interest in having them in my life.",
   "created_utc": 1691267287,
   "score": 8,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy1v3j",
   "message": "Not really. “My kids were enough a reason for me to stop.” But weren’t a good enough reason to not start in the first place. It’s given her a lifelong opportunity to play the victim.",
   "created_utc": 1691268362,
   "score": 5,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy2d0t",
   "message": "I forgive my mom at 13 as she’s was the one who raised me when being a higher functioning alcoholic and drug addict until things not gonna disclosed lead to her starting to slowly die from her addicted disease until going to rehab with help her brother and his family. She was hard worker who supported me and my siblings while living on an island and even didn’t give up on us as she’s the one person we trusted and was our rock and guide. \n\nI forgive her as she’s the one person I love and loyal to as we’re close but can’t forgive my stepdad due to having been psychologically and physically abusive mainly witnessing him hit or fight my mom while drunk and gaslighting her or us when we see it. Mom I can forgive and love her for being able to get better for herself and us but my dad sorta not really but to in order to move on. My mom is now almost 8 years sober and is successful:)",
   "created_utc": 1691268566,
   "score": 5,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy3k60",
   "message": "I dunno if I will. My dad had a rough upbringing and started drinking at 15. But he still managed to marry my mom and support a family by getting up at 5am to work at his IT job.\n\nBut he was still a total asshole to me growing up. It's hard to reconcile the fact he tried so hard to support me with the fact he'd get drunk and call me a Bitch at times.",
   "created_utc": 1691269067,
   "score": 8,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy453y",
   "message": "No drugs was always more important than us n to this day it’s still true when the men she got with ditched it’s when she ditch all us in the system once our daddy’s left her she didn’t care we were disposable so in all honesty I hope she deis a horrible death 🤷🏼‍♀️",
   "created_utc": 1691269310,
   "score": 7,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy5oby",
   "message": "No. Between the people she screwed over in the long term while pretending to be mother of the year, the multiple attempts at stabbing me for drinking money, decades worth of surprise legal issues, and trying to accuse my wife of eating kittens ...nah, I think I'll pass. Irredeemable monster through and through, that's not even an addiction anymore. (Though it was all for as many drinks and pills as she could cram down her gullet at once. To this day somehow alive and ripping people off pretending to be some guru investor in the desert somewhere...)",
   "created_utc": 1691269926,
   "score": 11,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy6azn",
   "message": "Yes. My uncle John was an addict. And he was on the right track and trying to get his life together. He couldn't take it though and ended his life. He was a good person and I love him a lot.",
   "created_utc": 1691270192,
   "score": 9,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxtgpg",
   "message": "For your own sake, you need to forgive. Carrying that anger your whole life will not benefit you. Let it go.",
   "created_utc": 1691264900,
   "score": 3,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxx2h5",
   "message": "My older siblings haven't spoken to our former addict mother for 15+ years. That's their choice and I don't hold it against them.\n\nI feel holding onto that anger is a burden, exhausting. I have a normal relationship with her, especially being a recovering addict myself.",
   "created_utc": 1691266377,
   "score": 4,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxzsig",
   "message": "Not really.  I tried many times while he was alive, but he’d just gamble and steal from me again.  I just make sure to treat my kids with the respect I was never given.  I’ve never really understood the forgive but never forget.  If you still think about it, and are angry at their actions, what does forgiveness mean?",
   "created_utc": 1691267509,
   "score": 9,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy4yeu",
   "message": "Yes I did. My mother had 5 children and her and my dad made sure we always had what we needed. The hard thing for my mother is that she moved to a country away from her extended family and my father didn’t have any family close. So she was at home all day looking after us. There was a lot of time that things were normal but she would slip up and drink and it would last 2-3 weeks where she would be drunk every day and as a young child I recognised it very quickly. She would come to us in the evening slurring her words and asking us to play games or watch films which actually scared me because I knew she was drunk and I didn’t want to be near her. It made me sick seeing her become a different person. It broke my heart and kind of broke me. My older brother would start fights with my dad and the whole house would erupt into chaos. Originally I kept running away because I couldn’t process or stop what was happening. Eventually I began to dissociate sometimes and pretend it wasn’t happening. But the violence from my brother and father clicked me back into reality and I had to step in. As a young boy I was exposed to the worst types of violence and threats which did benefit me in a way as I never took shit from people at school and never felt threatened by bullies because compared to my brother they were nothing. There was choking, broken bones, fists flying, threats of being stabbed and killed.\n\nIn terms of my mother she eventually admitted herself after she almost ran away with another man and realised she needed help. She has been sober for over a decade and worked incredibly hard to make up for what she did and caused. So whilst I still remember and feel for everything that happened, I’ve come to learn that she was simply someone who became lonely and desperate and wanted to escape but couldn’t control her addiction. I know despite everything she always wanted to be a good mother.",
   "created_utc": 1691269632,
   "score": 34,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy5mf3",
   "message": "i did at first. i had come to know addiction well by the time i spoke to her again. my mother was young and not ready for a child, let alone two. she developed an oxycontin habit and lost it all, including us.\n\nmy brother and i got put in foster care so i wasn't living with her by the time i was 5. rarely saw her cause legally i was to have no contact. she reached out to me when i was a teenager. we texted every now and then. she'd gotten her shit together and was living well.. she offered me a place to stay if i ever needed it. took her up on it when i was 18.\n\nwhen i was moving out of her place i decided to try and have a real talk with her.. to attempt to relate to one another. i revealed that i had quit heroin the year prior. my addiction consumed the entirety of my teenage life and ruined everything. her immediate reaction was to judge me. i found out she didn't believe i had real mental problems and i could 'get over it'. she blatantly told me my childhood (that she was unconcious through half of..) was not traumatic. she began treating me with a mistrust that hadn't been there previously.\n\nwe smoothed things over but i don't think i will ever really forget the way she treated me when i needed someone who knew what it was like. the first and only time i needed mom.",
   "created_utc": 1691269904,
   "score": 19,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy6wcr",
   "message": "Yes.\n\nMy bio-father has/had a drug an alcohol problem.  Went into rehab when I was quite young.  Really embraced sobriety and was a good dad.  Ended up marrying a woman who really loved chaos and enabled him.  When I was about 11 she let me know that he wasn't ever actually an addict my mom just made him really unhappy. At that point,  he did a weird thing though, he starting drinking occasionally but I never saw him drink to excess after that.  Almost like he could control it, which went against EVERYTHING I've ever learned.  I did Ala Teen and they told me it was impossible.  BUT his behavior/personality was 100000% an addict.  Nothing was his fault, everything and everyone was making him a victim.   He was an incredibly toxic and traumatizing person.  BUT he grew up with a violent alcoholic father.  His life growing up was horrible.  When I became a mother and my kids were older, I saw the life they lived and compared to the life he lived and it broke my heart.  He didnt even have a chance.  So I was able to find empathy for that terrified little boy who had no safe place to go ever and forgive the man he became.  \n\nThat being said, forgiving someone who isn't sorry is incredibly hard.     I cut him out of my life about 15 years ago and didn't forgive him until quite a few years after that and still don't have him in my life.  My forgiveness is for my own well being, not his.  I needed it to let go of the baggage and when I did, a weight was lifted and I actually found peace and could start healing.",
   "created_utc": 1691270446,
   "score": 9,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy7t7p",
   "message": "No.      \nBut if I start explaining I'll be here all night writing an essay.         \nAlcoholic abusive father. Ongoing. Just waiting for him to die and free us from this misery.",
   "created_utc": 1691270829,
   "score": 6,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy8nop",
   "message": "My parents aren’t addicts but a lot of my other family are/were. One thing I’ve learned is that you can love a drug addict but you should never trust one, with anything for any reason. No amount of love and support can fix an addict who’s unwilling to try.",
   "created_utc": 1691271181,
   "score": 22,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy9mwd",
   "message": "No. They're still the same person.",
   "created_utc": 1691271591,
   "score": 4,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy9myr",
   "message": "I forgave him in the sense that, I let go of any power he had over me influencing my emotions, or residue of childhood PTSD. I see forgiveness as having less to do with them and more to do with me. I forgive to let go. Even so, he will never be welcome in my life for as long as I live.",
   "created_utc": 1691271591,
   "score": 35,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyb64z",
   "message": "Not a parent but older siblings,  and no. They stole from me with no remorse, yelled, hitted me on the face, kicked me out of any room they didn't want me in, and without a single consequence for it. One of them died recently of an overdose, and I didn't even look at tickets to fly to his funeral. I will never forgive them for the way they ruined my childhood since, to this day, they don't even acknowledge or care to apologize or give me the thousands of dollars they stole from me. They bought my relationship away, and it was a non refundable sale. The one who is still alive could die in front of me, and I would just walk away and let him rot on the floor.",
   "created_utc": 1691272244,
   "score": 10,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juybfts",
   "message": "I think I have. Despite everything that he's done and said while under control of his vice, I only ever get one dad. He's been clean for years now, and he seems much calmer and more level-headed. Although, secretly, I wonder if he ever wants to go back to the creature again.",
   "created_utc": 1691272357,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyc0xi",
   "message": "No reason being their behaviour is worse even after getting sober. I don’t want my son to look up to or idolize a pathological liar, woman abuser, and all around peice of sh!t. This is Not my sons father but my own",
   "created_utc": 1691272607,
   "score": 6,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyc2ex",
   "message": "My father was an extreme alcoholic, he beat my grandfather, my mother, my brother and me. it's been a long time since he beat us up, but I haven't forgiven him.",
   "created_utc": 1691272624,
   "score": 4,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juycdg9",
   "message": "I feel their pain it hursts asf",
   "created_utc": 1691272755,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyd9pb",
   "message": "She (mom) is dead. I didn’t forgive her when she was alive and I don’t now. I really don’t think about it anymore. I moved on.",
   "created_utc": 1691273140,
   "score": 8,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juydbun",
   "message": "I will never forgive my mom or grandma for picking up a cigarette. I understand why, and I empathize, but I won't forgive them for knowingly fucking up their lungs. I'm proud of my grandma for finally quitting, but I'll never truly forgive them.\n\nMy day on the other hand, I'm damn proud of. He was fucked up on all kinds of drugs for a while, then got clean, found god, and married a wonderful Venezuelan woman and had my half sister. He's going on 16 years clean now.",
   "created_utc": 1691273166,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juydtp6",
   "message": "I'm not a child of addicts/alcoholics, but my daughter has completely disowned her mother for being the drunken asshole that she still is. I am sure there will be no reconciliation.",
   "created_utc": 1691273381,
   "score": 9,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juydtus",
   "message": "My mom basically ruined the first 10 years of my life and I still deal with the effects of that, 26 years later. I get so frustrated having to deal with the trauma because it was 100% not my fault, I didn’t ask to be born and I wish she would’ve tried harder to be a good mother to her two little girls. So …I don’t know if I can forgive her.",
   "created_utc": 1691273383,
   "score": 4,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyecmw",
   "message": "my mother is/was at least an alcohol addict.\n\nI m/17 her first son, was the reason she stopped drinking for around 9 months, and my half-sister f/don't ask me how old she is, she is younger then me was the second reason she stopped drinking for 9 months. I am at another family, I don't know about my half sister.\n\nI can't quite be mad at her, she is the reason i am not already in a dept, since she doesn't care about me, nor does her family. Also, she seemingly stopped drinking and smoking early enough, so that I am not phyiscally disabled.",
   "created_utc": 1691273618,
   "score": 3,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyffrz",
   "message": "Yes— I saw the pain first hand from my dad and the problems it caused him. Luckily my mom was there for me and we got out of the worst of it when I was young, but I didn’t build a relationship with him for years and years. I still rarely see him and have never lived with him, but I have the perspective now to see that the drinking only ruined his own life and he basically had to pick up the pieces from the beginning. My heart really goes out to him and every other person struggling with alcoholism because it truly is a disease, not something as easy to do as “just stop drinking”.",
   "created_utc": 1691274106,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyfxie",
   "message": "My father was an alcoholic. As man in line for a pension with a home and several real estate properties drank them, and our future away. As a result, we grew up in a roach-infested, low rent apartments on food stamps. I loved him and knew he loved us, but when he was drinking he was the worst version of himself.\n\nI, in turn became a drug addict.\n\nIt was only when I got in recovery did I realize not only were there valid reasons I turned to drugs, there were even more reasons for him. He had a horrific childhood an seen some shit.\n\nI forgave him because I understood his addiction like my own.",
   "created_utc": 1691274326,
   "score": 233,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyg52s",
   "message": "No. She refuses to take responsibility to this day. Why should I do all the work to maintain a relationship I never asked for.",
   "created_utc": 1691274421,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juygj6k",
   "message": "No. He is going to die from it and leave me and my siblings with the ongoing fallout from the trauma of our past. We will have to grieve the father who maybe cared but never cared enough and never bothered to do better for us. I know that I will also feel guilty about not having much of a relationship with him because I had to distance myself… so I anticipate his death being a very interesting mental battle. And I’ll struggle to forgive him for that too.",
   "created_utc": 1691274602,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyobx1",
   "message": "After we had a house fire my parents quit smoking meth cold turkey, and on that day.  We were fortunate to keep the property.  We spent 8 months in a 20 for camper. My little brother, mom and dad, and myself.  Also 2 medium sized dogs. In that time my father would work all hours he could, and my mother would spend her days making sure the tiny space we lived in, and the property was maintained while looking after my brother and I. At night after dinner,  my mom would boil creek water on the little stove and sponge bathe us and read Goosebumps books out loud as we didn't have television.  Years have gone by since then, and still no meth use.  My mother is now part of town council, the local fire department, and an active member of our local church.  My dad is now a line cook at Applebee's and actually making very good money.  We were also able to keep the property and they now have a new house on it and amazing gardens, a Vinyard, and an apple orchard. I never felt closer to them as I did when we lost everything and had to build each other up again.  Yes, I absolutely forgive my parents.  I couldn't ask for any better than I have.",
   "created_utc": 1691277959,
   "score": 31,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juynmtv",
   "message": "Not really no.\n\nI don’t need to explain why either.",
   "created_utc": 1691277657,
   "score": 8,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyia5a",
   "message": "No I do not. She abused me. I have low contact with her and she has zero involvement with her grandkids",
   "created_utc": 1691275393,
   "score": 6,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyl1pt",
   "message": "I forgive one of them.\n\nMy mother always did her best to raise us, even through her struggles with addiction to alcohol and drugs (pills, coke, and weed- though the weed was long before I was born and afaik she was not addicted by the time I was born). She was really there for us- she would work multiple jobs, do everything to find us a place to live... I still feel afraid of her when she drinks now, but she never actually hurt us and was always pretty much the sole provider for me and my brothers. I forgive her.\n\nMy father was quite the opposite. While my mother had years-long periods of sobriety (and is currently sober afaik as we talk regularly), he was never ever sober. His addiction to pills and alcohol traumatized me and my brothers and he never took care of us. My mom literally didn't trust him alone with us because he couldn't take care of kids (she tried once and he left us upstairs alone as toddlers with no food, while sick and needing care) and eventually ended their marriage- though he still refuses to legally divorce her for fear of her taking his money, him needing to pay child support for my one 15 year old brother (me and other brother are legally adults) or alimony or something. He has never taken care of his children and his wife was miserable the entire time they were married. He has gone in and out of rehabs but always relapses. He visits us once every few months and even while sober he completely refuses to respect my boundaries and my desire to have no relationship with him, including trying to hug me and take photos with me without my consent. I ended up moving states and am so glad to be rid of that fucking scumbag excuse for a father.",
   "created_utc": 1691276552,
   "score": 7,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juym1q4",
   "message": "My mother was addicted to drinking and other drugs throughout her life. That combined with mental illness makes it almost impossible to be around her. She isn't drinking now because I moved her to an assisted living place that it is too far to walk to the liquor store. But even without drinking, her brain is so messed up. And I really can't talk to her because you never know what will trigger her to be nasty. She lives about 2 miles frome me. And I only see her when I have to take her to my grandmothers house for Christmas.  She has no friends and really tries to run my life. I really won't miss her when she is gone.",
   "created_utc": 1691276979,
   "score": 8,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyv7or",
   "message": "Nope. Not after my mom left me stranded across town until well after 10 PM as a tween and finally showed up half asleep at the wheel, doped up on pills. Or the time I had to call an ambulance because she overdosed when I was 11. Or any of the countless other times that she chose pills over her child. My sisters don't understand why I'm so distant but they had a completely different version of her than I did. They never knew hunger. They never had to live in a motel. They never got put in dangerous situations.",
   "created_utc": 1691281179,
   "score": 9,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyjkq0",
   "message": "No, my mother is a meth addict and a narcissist and has not changed her ways in the last 22 years, I doubt she ever will, but I’m okay with not having a mom, I have plenty of friends and family to replace that missing piece",
   "created_utc": 1691275933,
   "score": 5,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juylr2s",
   "message": "Nope, they're awful people who only love themselves and I will never speak to them or see them again. (It's been 17 years so far).",
   "created_utc": 1691276852,
   "score": 5,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juynghx",
   "message": "Yes. I posted on another thread a couple weeks ago about growing up in meth house hold were every one was on meth except me and the kids. My dad sold meth and was addicted to meth for a very long time. My oldest sister, her husband, and my two cousins lived with us and they were all on meth. I had two older nephews who also lived with us off and on who turned to meth. \n\nEveryone but one nephew is clean now, my dad is no longer with us. \n\nI stayed with my dad, despite the violence and shitty lifestyle, until he died. He did get clean before he died and was so for maybe a decade. I was his only child. (My older sister's are from my mom's first marriage) he didn't have anyone else and he turned out to be my best friend in the world. My world has been empty without him, I've never been the same.",
   "created_utc": 1691277583,
   "score": 8,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyni18",
   "message": "Eh, yes on the drinking no on being a horrible person while sober. Is he such a bad person after years of drinking or is this just who he is? My mom says that he was a good person before drinking so idk.",
   "created_utc": 1691277601,
   "score": 4,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyoyp0",
   "message": "No. I think he feels guilty now that he is old and sick. But that's not my problem to solve.",
   "created_utc": 1691278246,
   "score": 6,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyjibp",
   "message": "I try but I can't. It sure doesn't help when she pats herself on the back and talks about how good of a job she did raising us. I thought that one day I would be able to forgive her, but now that I'm a parent it makes me sick to even imagine putting my son through what she put us through. And she still has the nerve to talk about how great she did and how much of a victim she is. Fuck that.",
   "created_utc": 1691275905,
   "score": 5,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juymsue",
   "message": "My father was an addict.  Ultimately, it led to his death in a nursing home at the young age of 52.  He was alone and had no friends or family beside him during his last few months/days.  He chose this lifestyle and even though we tried to help him countless times, he would always prefer the pills over everything else.  Do I forgive him? Yes.  However I hope he forgives me for not being there during his final day.",
   "created_utc": 1691277304,
   "score": 4,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyrzgg",
   "message": "My father is clean now but he still has the effects of drugs on his brain like 30 years on, he’s got shit memory, no empathy, mood swings, no patience etc so I avoid him cause the damage is still there and we all still pay the price",
   "created_utc": 1691279656,
   "score": 4,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyt505",
   "message": "Father is a current alcoholic, albeit only hurts himself so far.\n\nMother is a dead alcoholic/user.\n\nStep Mother is also a dead alcoholic/pill popper \n\n\nI have forgiven enough to move on, but it's either really hard or really easy to forgive a dead person. Not sure which yet. \"Out of sight out of mind\" seems to fit.",
   "created_utc": 1691280204,
   "score": 4,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyuuj6",
   "message": "No. After my destroyed credit, tons of missing items valuable and not for years all the physical,emotional, mental and financial abuse I just haven't found a way to and I don't care to. She also conveniently \"doesn't remember\" things. So yeah hell no my son will never experience that shit of a person.",
   "created_utc": 1691281006,
   "score": 5,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juynw6w",
   "message": "I got away from my alcoholic father the first instant I could, when I was 16. I haven't had any contact with him since (over 20 years). I have somewhat forgiven him in my heart, because I realized he was self-medicating for depression (which I also have but treat it in healthier ways). I'm not still angry at him. But I will never let him back into my life.",
   "created_utc": 1691277768,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyqm7u",
   "message": "Yes I did. I recorded some interviews with my alcoholic father in the months before he died and was able to gain a lot of closure as a result. It not only allowed me to empathise with him, but also gave him an opportunity to take responsibility for the pain he caused me and my family. \n\nSome of my relatives still hold a lot of anger towards him, but I'm no longer one of them - I just see him as a man who struggled his entire life to find any sort of peace. Although I certainly acknowledge the damage he did, I've forgiven him entirely and will always hold a place in my heart for him. I miss him every day.",
   "created_utc": 1691279013,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyragn",
   "message": "Mom did her best raising me, don't blame her for any mistakes she made raising us.\n\nDad was the only person who encouraged my nerdiness growing up, he died of drug and alcohol complications. Nothing to even forgive, it just is what it is.\n\nLove them both, bad times and good. Nothing to forgive, since I don't blame them for anything.",
   "created_utc": 1691279332,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyrnkb",
   "message": "My mom has been an addict for a long time now. She didn't notice that she was pregnant of me and also used cocaine, marijuana and wjo knows what other stuff. Tbh, the worst thing was, when my dad went to work she left me alone when I was little to get shit. Did it in the same room as I was in. Now my parents are divorced, but she ruined my childhood since all the money she had went to drugs.",
   "created_utc": 1691279502,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juymojf",
   "message": "Yes. Forgiveness is the absence of an emotional response. The harsh emotions I experienced toward my addict parents damaged me more than them, so forgiveness was essential to my own mental health. Addiction is a part of, and not a failing of, the human condition. I found it easier to forgive when I looked at addiction as such. I wish society could reframe it, as well. It may be easier to treat if we did.",
   "created_utc": 1691277253,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyhlbz",
   "message": "Yes I did but not for them, for myself. But I am 34 and I haven't seen/heard from my father since I was 12 and my mother was released from prison at 13 and haven't seen/heard from her since I was 14. I don't know if they even know if they know about my 10 and 12 year old boys, don't even know if they are alive or dead. It's hard to be alone in the world but it's better than being drugged down with them.",
   "created_utc": 1691275085,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyhys9",
   "message": "I have forgiven my father, he got his life together. My mother on the other hand I'm having s harder tome letting go of.",
   "created_utc": 1691275257,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyj34a",
   "message": "My father eats too much sweet food, don’t forgive him",
   "created_utc": 1691275729,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juym1c5",
   "message": "Mom still drinks, but I moved away from her and my step-dad so it’s tolerable. Dad stopped drinking (and smoking cigarettes) for 16 years. Picked the drinking back up again a couple years ago, probably from my step-mom drinking in front of him like she doesn’t have her own set of problems, and it deeply started to bother me. His sobriety partly inspired my own sobriety, but to see or hear about him drinking didn’t inspire faith in me to stick around. Covid certainly accelerated that feeling as well as the fact he’s barely been around for most of my life; why I moved closer to him to begin with. It’s almost two years since I estranged from that side of the family.",
   "created_utc": 1691276974,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juymcy0",
   "message": "My dad is still an alcoholic and my mom was addicted to opiods until I was 17? I think.\n\nI'm still scared when my mom is behaving a certain way that reminds me of how she was when high. I feel bad asking but I always ask did you take something? She used to take money from me as well and I didn't find out until I was older that is was her. I've always been a bit of a pushover though and even when she asked I would let her have it. I guess I did forgive her, however I think I will always be scared she will go back and certain things defintiely affected me. \n\nMy dad has always been an alcoholic. He seemed to have gotten worse with each his kids in the preteen-early teen years. I have no desire to be drunk and I don't like when my friends get drunk. I dont react to him when he tries to fight anymore though. Rarely I will, only if he insults my mom. I do love him, but its so complicated. It probably always will be. I don't forgive him, its hard to when I see him get drunk whenever the family spends time together.\n\nI'm not sure if this is the answer you want. I'm someone who smiles through trauma and I forget it. I have a high tolerance to this kinda stuff, I always have I think.\n\nMy mom was always the primary parent for my brothers and I. She tried her best. She has been clean 4 or 5 years now. I love her a lot.",
   "created_utc": 1691277114,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juymya6",
   "message": "I don''t know",
   "created_utc": 1691277367,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyn3py",
   "message": "I did. My father left when I was 4 and hardly ever saw him until I was an adult. \n\nWell I ended up becoming an alcoholic myself and at 30 I decided to quit. \n\nI thought to myself if I had kids while I was drinking would I have done the same thing my father did to me? I couldn’t say no, so from that day I forgave him.",
   "created_utc": 1691277429,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juynu0l",
   "message": "Yes. I learned my parents life was far worse than anything they put me through. I saw them as flawed humans that needed help and only did the best those flawed humans could possibly do. \nMy father parents both started doing better as we got older. My father stop being an addict a few years before he passed away and the few years before that he really did finally make real effort to stop, he did cut way back before getting real help and then finally stopping completely",
   "created_utc": 1691277742,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyo65a",
   "message": "My mom is an addict. She broke my dad's heart and ran out on the family when i was about 10. She was scarce for a few years after, and now I don't know where she is or if she's even alive. I'm 30.\n\nI was finally able to forgive her 6 or 7 years ago. I don't forget what she put me through and how she used to behave around/about me (including not showing up to my custody hearing, which maybe hurts the worst of all), but addiction is an illness. My mother is very, very, very sick and has been for a long time. As much as what she's done hurt me, I know what she's doing hurts her worse. I don't have to love her, and I don't have to trust her. But I can't help feeling like the last thing she needs is for her child to think of her with anger, even if she doesn't know when I do think about her.\n\nForgiveness is hard. It's absolutely okay if you can't do it. But if you feel like you're able to, and you WANT to, don't stop because you feel like you shouldn't or they don't deserve it. It can be healing. Thinking about my mom is a lot less painful, these days.\n\nI hope she's doing okay, wherever she is.",
   "created_utc": 1691277889,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyp0cu",
   "message": "I never was able to forgive my parents for their extreme oxygen addiction.",
   "created_utc": 1691278267,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyr6bx",
   "message": "Mostly. My father was an alcoholic and died about 12 years ago. My mom is a drug addict and still kicking. I’m an alcoholic in recovery and work on sobriety so I spent a very long chapter of thinking about, writing and saying an amends. Some things may never be forgiven but I was able to at least say my part and got deeper into my role and their choices or lack thereof. We’ve all done much harm to each other. It took me a very long time to see my own role in my resentments and not just with them. With everyone. My moms still mostly out of it but I’m able to have a relationship with boundaries. As previously stated, there are some things that may never be forgiven but I’ve removed  some of the anger, shame and resentment. I will say that it does leave some sadness and I don’t know if it will ever go away, or if i want it to.",
   "created_utc": 1691279277,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyrjw4",
   "message": "Yeah because he eventually gave up on drinking and smoking\n\nProud of dad",
   "created_utc": 1691279454,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyrt05",
   "message": "Kinda. My dad sobered up like 20 years ago but in real formative years he was drinking and most likely is the reason for divorce. I don’t really blame him cause I’m an alcoholic and I get it. But both parents smoked cigarettes and are now dead. My mom did great for the most part raising us, but she pretty much gave up on trying to quit. I shut down when she told us she wasn’t gonna quit when I was like 10. So abandonment issues and I didn’t learn shit from my man-child dad. Therapy helps and I do forgive them, but I don’t know if they ever thought I’d need to forgive them lol cause we just never had serious conversations about anything really",
   "created_utc": 1691279572,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juys85m",
   "message": "Not yet. She still needs to get her act together. I was tired of her barging in on me, drunk as a skunk, accusing me of this and that. Once found her on the floor, like she was dead (found out later she had drank while on Ambien), in hindsight I should have called 911 just to scare her. She's a high functioning alcoholic and is extremely insulted when confronted. She's alienated me, her son, her future DIL because we are the only ones who see her for what she is: a narcissistic alcoholic. \n\nThanks, not only do I no longer have a dad who lives in the country, but now I don't have a mother I can rely on.",
   "created_utc": 1691279770,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juysquq",
   "message": "I forgave my mom because I do think she did her best. Despite her abuse and allowing my siblings and I to be abused, I think she did the best she was capable of. \nShe is a wonderful grandmother and we have an ok relationship. However I am still dealing with a lot of the trauma. I’m not sure if it’s a character flaw or not that I let her be in my life. I love her though.",
   "created_utc": 1691280016,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juytuhm",
   "message": "I have forgiven her yes, I know she didn’t know any better. However, getting over the trauma is difficult",
   "created_utc": 1691280535,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyuigt",
   "message": "I was a parent aide for some time,  I worked exclusively with teenagers who are now young adults.  Many have contacted me via social media, and none of them have relationships with their parents.",
   "created_utc": 1691280848,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyvdah",
   "message": "Yes but only as I grew older. It fucking sucked growing up in such a financially and emotionally unstable household. Now that I mostly have a hold on those in my own life, I can have a different relationship with my parents.",
   "created_utc": 1691281252,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyvdby",
   "message": "Yes and no.  Yes I understand his mistakes and know that towards the end he realized what he lost because of those choices. \n\nEdit: Also his mistakes have taught me to be careful when I consume any substance and to not take chances with certain ones.\n\nNo, because he should've known better sooner with all the chances he had.",
   "created_utc": 1691281252,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyveg2",
   "message": "I haven't, but I understand it is a disease. While I have hard boundaries with my mum, I am kinder and more understanding as an adult.",
   "created_utc": 1691281267,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyvl7x",
   "message": "Both of my parents were alcoholics when I was a kid. It was bad. Whenever they both drank it became an all out fist fight in the house. Cops. Jail time. My dad was locked up first and my mom just gave up entirely on taking care of us. She drank all day everyday and a neighbor made a “noise complaint” one night when she was out. We were watching a movie on the couch, so we all know why she called. \n\nAnyways. I ended up choosing to live with my mom after she got out. She was sober for about six months and then just one day decided she wanted a beer. It was all downhill from there. She quit her job and was living off of unemployment. Never went grocery shopping. Was always going up the street to some bar. \n\nSo I moved in with my dad for high school. She just fell off the face of the earth for like five years. She resurfaced after being found unconscious and with a stomach so bloated she looked pregnant. It was cancer. \n\nMy dad and his girlfriend took her in to help with her treatments etc. And she was fine for about a year. And then she started drinking again. I finally just gave up and cut ties with her. I saw her the day before she died laying in a hospice bed. She didn’t even recognize me and honestly…I felt nothing. My dad called me the following morning to ask if I wanted to say goodbye before they came and took her away. I said no.",
   "created_utc": 1691281356,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyvs6a",
   "message": "No, because he just has a terrible personality. I didn't see my father for over 20 years and by the time I saw him again he stopped using heroin. I didn't really remember him because when I was a kid he was usually unconscious. With him being conscious I got to see what a nasty person he is. I doubt he feels any regret over any of the stuff he did because he's just as self absorbed. It's not the drugs it's him.",
   "created_utc": 1691281447,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyx5zp",
   "message": "No she ruined my life",
   "created_utc": 1691282096,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyxabp",
   "message": "Not really. Sure I had good times but after what she put me through, I'm not getting anywhere with her.",
   "created_utc": 1691282153,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyxlvc",
   "message": "Not entirely. She has been clean for 4ish years now but she was high my whole childhood. I have a relationship with her now but when I was a kid she was too focused on meth to care for me. Due to her addiction I had to deal with lots of abuse and had to teach myself basically everything I know while she did nothing about it. So no I haven't, I love her so much but still haven't forgiven her.",
   "created_utc": 1691282302,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyxqra",
   "message": "My parents were addicts. No issues with my mom at all. Haven’t talked to my dad in about 20 years. I don’t think drugs are why he was such a complete asshole",
   "created_utc": 1691282366,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyy3ks",
   "message": "No, I didn't. Now I am dealing with a incredible complex of emotions after my addicted parent past. Mostly angry because I can't explain the destruction it left in my life. However now as they've passed I get no solace other then that which I find myself.",
   "created_utc": 1691282536,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyyqr6",
   "message": "Yes, my(m17) father was addicted to meth. It took a lot of work on both ends but our relationship is stronger than ever. \n\nThere was a period of time where I had completely gave up on repairing my relationship with him but there was one instance that immediately changed that for me. It was probably 7 am and I just found out that he was on another bender, I walked into his room just to see if he took his phone, so we could track him, and on his desk was a Starbucks drink for me because he knows that coffee helps me cope with stress. I will genuinely never forget that moment, it reminded me that he was still a really good dad and that he still really loved me, once he came home he agreed to rehab and he's been clean for 2 years now!",
   "created_utc": 1691282845,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyyu2v",
   "message": "My dad was a drug addict and left when I was around three years old not that he was around much before that. He did physically abuse my mom in front of me a few times (when he was on a bender, according to my mom) I would still visit him every now and then until I was seven or eight years old. I never actually bonded with him so his absence didn’t impact me the way it would if he had been close. It took me a long time but I didn’t forgive him until my early 20s.  \n\nIt’s easier for some than others to forgive, and I don’t judge anybody who chooses not to forgive their parent and maybe some of you can’t find a way to forgive even if you try which is completely understandable. With that said, I will say not forgiving them only serves to burden YOU.  When I found a way to forgive my father, it was a massive relief off my shoulders. It was a process, but I had to learn what forgiveness actually meant to even start. My heart goes out to anybody struggling with this.",
   "created_utc": 1691282889,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyyz0s",
   "message": "I just cant. My mother almost killed me when I was 2 months old, she was drunk driving around town eith her boyfriend and when my dad found me, i was covered in every liquid imaginable. Piss, shit, spit, tears, sweat, alcohol. She still to this day cant just admit her addiction to alcohol is the reason I got taken away from her. I met her for the first time last year and she drank 2 beers, one fireball, and 4 shots. Shes still addicted, and she still loves alcohol more than her own children.",
   "created_utc": 1691282955,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyz0vr",
   "message": "Found out a few years ago that I had a college fund set up for me when I was born various family members put into it because having one of us finish high school would be great but they dreamed of having me do more.  \n\n\n She spent it on coke.  \n\n\n She is an absolute evil person from poisoning peoples pets on a whim to robbing a disabled person of all their worldly possessions when they were at their moms funeral. The hundreds of cases of spousal and child abuse.  \n\n\n I never wish to see them again.",
   "created_utc": 1691282979,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyz1ts",
   "message": "Nope. Way too fucked up of a childhood to ever forgive. We’re on good terms and friendly. I visit him regularly (he’s in prison so it’s my duty/decision to organise the visits), but I can’t ever truly forgive him for it all. To this day I feel a pit in my stomach around him, worried he’s about to go off into a rage",
   "created_utc": 1691282992,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyzaxd",
   "message": "No. \nBecause their addictions caused them to neglect me.",
   "created_utc": 1691283110,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyzj1j",
   "message": "Both parents are clean now and have normal happy lives and are trying to be good parents so yes I forgave them.",
   "created_utc": 1691283215,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyzwdu",
   "message": "I've lived with addicts who I wouldn't spit on if I passed them while they were on fire, but I've also made friends with people who have reformed themselves and re-engaged with society in a positive manner.\n\nI used to live with an Alco bong fiend who just up and left our share house leaving me with a stack of bills and an inability to cover the full rent. Ended up briefly homeless and then chased by debt collectors further down the line as he'd used my phone number and address for some accounts / cards he'd set up. \n\nOn the flip side one of my best friends is a recovered meth addict I was in a band with and my wife's best friend is also a recovered meth addict who is kicking goals left, right and center. If you met either of them on the street you would have no idea, both really clean cut, lovely, professional and polite people.",
   "created_utc": 1691283391,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz0vas",
   "message": "Not me, but my half brother never forgave his mom",
   "created_utc": 1691283841,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz1214",
   "message": "No. My childhood was ruined because of my parents addiction. I grew up in a really unstable environment, scared all the time and on the edge of homelessness. Ended up in foster care in my teens, which tbh saved my life, but I never got over the anger of my parents choosing drugs over providing a good life for me. I got an apology from one parent which doesn't need make anything better but it was nice to have the acknowledgment that they failed me. The other parent never acknowledge how they failed me and constantly wanted the validation of being told they were a good parent. That parent died of a drug over dose three years ago, which to me was the final choice of drugs over family. My grandma had even been begging said parent to go back to rehab again and they outright refused and said they didn't want to get better.",
   "created_utc": 1691283930,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz20ob",
   "message": "Yes, they got better, I understood their life wasn’t easy at the time and they were just trying to cope like the rest of us and not everyone handles it correctly.",
   "created_utc": 1691284387,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz23m9",
   "message": "Yes, I have fully forgiven and have learned the mental toll of being an addict is incredibly difficult.\n\nI also feel completely cheated out of my childhood and tasked with breaking generational trauma to keep my kids from that mindset.",
   "created_utc": 1691284426,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz2h53",
   "message": "Yea, because all make mistakes and I was  addict too so I understand from their shoes as well. But we all grew out of it and are better people",
   "created_utc": 1691284607,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz2kz4",
   "message": "I tried to forgive my dad. Sometimes I think I have. Then I later realise I’m still angry. \n\nHe died a couple of years ago. I don’t think my feelings have settled yet. \n\nI hope to forgive him eventually because addiction is a disease, but he broke my heart and made my life a living misery over and over again. He left me without anyone as a child, then tried repeatedly, even through fake sob stories, to get my pity when I was an adult. He was never able to connect with me on any level other than ‘his’ object that he could pick up and put down as he pleased.",
   "created_utc": 1691284657,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz3qwj",
   "message": "I didn’t realize he was sorry",
   "created_utc": 1691285206,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz3tbm",
   "message": "Guess he just couldn't resist the temptation to mess things up one last time. Estranged round two!",
   "created_utc": 1691285238,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz4y22",
   "message": "My mom was on meth from the time I  was basically born. My dad raised me. At 11 she overdosed and I didn’t see her again until I was 22. She’s been clean now for about 4 years. I’m 24 now and having her first grandchild. It wasn’t easy at first because there have been so many relapses but this time was actually diffrent and she really wants to be better and be there for her kids and grandkids now. She and her husband turned both their lives completely around and are doing amazing now. Once I saw how serious it was this time, I did chose to forgive her and work to have a good relationship.",
   "created_utc": 1691285773,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz5zzm",
   "message": "Yeah, my dad is a recovered alcoholic. He just had a 10 years anniversary of not drinking a few months back. \nHe was not a mean drunk so i didnt feel like I need to forgive him (and it kinda got to the point when it was a problem when me and my sis already moved for uni), im just glad he stopped as if he didn't he wouldnt be alive by now. My godfather (his drinking buddy) didnt stop and died a few years after my dad got sober from an alcohol-related disease",
   "created_utc": 1691286272,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz6ztn",
   "message": "Alcoholic dad here. When he drank he got bored and looked for reasons to argue. Usually it was my mom because the rest just stayed out of his way. So lots of constant screaming and yelling. He got violent a few times too, even with me but I fought back and eventually moved out.\n\nHe could never stay sober for more than a few days (except when he promised he'd never do it again, but that was usually a few weeks. Months maybe if the last argument was particularly nasty - I think his record is like 3-4 months). In the weekends at 10AM he would already have a few glasses of hard liquor. \n\nFamily vacations were nice but inevitably he'd get shitfaced, so you might enjoy the sights and mountains but his shitty behavior would eventually snap you back into reality.\n\nEvery xmas when it was time to do xmas tree, he'd be absolutely plastered, put the tree up and then yell at my mom that she's not putting up the decor right. I still reel back from it now in adulthood when it's time for me and my wife to do the xmas tree but thankfully I've managed to make good memories of that with her.\n\nNarc and manipulative too, he managed to train the whole family into denying his addiction to be an issue or downplaying it so everyone was freaking out at each other when he'd make these crisis moments, without actually tackling the problem. Of course he never admitted it to be a problem. \"What is he, some kind of alcoholic?! Some deadbeat dad, is that it?\".\n\nI haven't forgiven him and never will, though I do wish to forget sometimes. Haven't spoken to him in years and I don't care to. He called a few days ago, no clue why. Haven't picked up and I don't care to find out what he wants. Even if I wanted to, we have nothing in common. Only thing that man thought me is what not to be.",
   "created_utc": 1691286748,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz7ep3",
   "message": "As a son of a mother who has abused drugs (and me), absolutely not",
   "created_utc": 1691286951,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz7m3f",
   "message": "No because they still doing the same shit causing the same pain and neglect and abandonment. If you are an addict and make great efforts to achieve recovery I applaud that and feel it shows remorse and sorrow. If you continue to be a piece of shit for 50 years bruh fuck you",
   "created_utc": 1691287051,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz7oyq",
   "message": "Yes and no. Both have passed now but when they were still here we got along for the most part. I was in foster care for 6 years of my teens so not living with them helped me become who I am today. Mom got sober 7 years before she died and she was a pretty cool person who I wish I could have known better. I still remember where I came from, who I am genetically, etc but I don't let it determine my life. I've said to other people that I learned how NOT to be a parent from them which is also a good skill to know.",
   "created_utc": 1691287090,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz7w54",
   "message": "My mother was addicted to opioids that the doctor gave her for headaches. When she was high she was not a good mother. When she was sober she was good but that was rare. I had/have a ton of trauma from my childhood that I spent a lot of time and energy healing from.  I did not talk to my mother for 10 years. In the past year I starting talking to her again. After talking with her; I learned more about her past and realized she got dealt a bad hand (abuse, trauma) . She is now sober and has a husband that loves and supports her.\n\n I don't forgive her. However; I have come to a place in my life where I don't need to forgive her. She was a bad mom but she is a good grandmother to my child. If my child has good memories of her then some good came out of this.",
   "created_utc": 1691287191,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz7xvf",
   "message": "Nope, as a father who suffers the same mental illness, he had so many chances and blew them all. Good riddance.",
   "created_utc": 1691287214,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juz90en",
   "message": "You don’t have to fully forgive an addict, or anyone else for that matter.  You can forgive them like 12% on that day, and that can change to 7% or get bumped up to 13%.  It’s not an all or nothing proposition unless that’s the parameters you have inside your head.\n\nThere’s no rule that says it’s all or nothing.\n\nIt seems silly,  but it helped me to change the way I thought about forgiveness that improved my mental health.",
   "created_utc": 1691287730,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juza8b7",
   "message": "TLDR — no. \n\n\n\nMy dad was a possessive and abusive narcissist who constantly physically abuse my youngest step-sister, sometimes hit my other siblings (my other step-sister and my half-brother) and put us through psychological/emotional abuse (his go-to form of it was to beat my youngest step-sister with a memory foam pillow, as it didn’t leave marks or evidence he’d done anything, but it still hurt her like crazy because she was so small and skinny at the time [she was around 8 years old, maybe weighing 75 pounds when he’d do that most often]. Then he’d blame myself or my other siblings for the pain she was in and for making her cry). He would only ever do that when their mother wasn’t home and if my youngest step-sister tried to tell her mom anything, my dad would pull the “she has autism! She doesn’t know what she’s talking about!” (She extremely high functioning. She’s so high functioning you wouldn’t know she’s autistic unless she told you). Myself and my other siblings were to scared to say anything \n\nOnce my mom and later my step-mom divorced my dad, he went crazy with stalking. He’d follow the ex’s around town to the point where my mom moved us to another city to get away from him (but it didn’t work, he followed my mom to our house one night she was done working and lost his mind screaming at her on our lawn). He’d also stand outside our apartment building before we’d moved and wait for her outside. He’d call multiple times per day (when I eventually got my first cell phone in 2012, I made the mistake of giving him my number. Even when I was in school he’d call me non-stop. It was a regular occurrence for me to have 20+ missed calls in under 30 minutes). He’d drag his friends into his stalking (one of his friends lived across the street from my step-mom and he’d stand/sit on their balcony watching her house. \n\nWhen we’d eventually lived together full time (rented a 2 bedroom apartment together for a year before I dipped tf out of there and ran to an abused women’s and children’s shelter). He’d do things to me like make comments such as “if you weren’t my daughter I’d snap your fucking bra strap for sure”, pull me out of the shower while I still had soap in my hair because he had to use it (then he’d hit me and call me a whore/demand I put cloths on when he came out and I was soaking wet and naked waiting to get back in), threaten me with graphically describing what he’d do to my cat if I had the nerve to call the police, etc \n\n\nHe started drinking when he was 12. Went all the way to 42 while becoming a severely abusive/violent/unpredictable alcoholic along the way. Quit for around 3 years or so (through 5 months in rehab) then started up again and drank to his early death at 56 (stroke in his kitchen just shortly after I left). \n\n\nHe made me respect the shit out of my mom/step-mom though. I could only handle a year living with him before I cracked and had to leave. My mom made it to 10 years, my step-mom made it to 12",
   "created_utc": 1691288332,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzbc4e",
   "message": "I forgive them but I keep a safe distance and set boundaries",
   "created_utc": 1691288884,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzbhsm",
   "message": "I did, one brother didn’t and the other brother is in recovery for opioids.",
   "created_utc": 1691288965,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzbqcz",
   "message": "My mom was addicted to crystals and essential oils. She's dead now.",
   "created_utc": 1691289085,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzcia7",
   "message": "I grew up with my mom and my step father addicted to drugs until I was 16 years old. I have forgiven my mom. Despite not having the best childhood, she has tried so hard in the past 10 years and has apologized for not providing for my siblings and I in a way she should have. But my step-father is one of the sole reasons for my PTSD, and no matter how much I have tried, I can’t forgive him as I’ll never be able to forget the things he has done. He also has only been sober from drugs within the past year, which adds on to my resentment for him.",
   "created_utc": 1691289467,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzcqpx",
   "message": "I did my father because it was clear he loved me, even through the addiction - he’s now passed. I won’t my mother, she’s been unloving and neglectful my whole life, treating me as though I have no value. My brother will be there for her, she loved him and it was very obvious she didn’t love me",
   "created_utc": 1691289583,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzdbfs",
   "message": "Forgive? Nope, fuck ‘em. \nWhy? Fuck that. Been dead to me for 20 years.",
   "created_utc": 1691289872,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzdhdw",
   "message": "She never really did anything that needed forgiveness.",
   "created_utc": 1691289957,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juze5cy",
   "message": "In some ways and not others; I'm not sure i can put it into a yes or no answer. My mother was an alcoholic and drug addict, single mother to me, an only child. She went off the rails plenty early before I came along and the cracks got wider when I was born; I was physically, emotionally, and psychologically abused by her. \n\nWhen she managed employment, it was as an aged care nurse. I was lucky to have so much family around me that noticed things going awry, so I was taken from her custody fully when I was around 11, into the care of my grandmother and her husband. She tried to get clean a few times, plenty of stints in rehab and plenty of slippery slopes back down into the depths of the addictions. \n\nBy the time she passed 2 years ago, we were no contact on my terms. It ate me up a lot, and I spent a long time thinking her death would solve my complex feelings. I was very wrong. It hit me so hard and I mourned everything, including the loss of hope of what could have been. I myself used alcohol as a crutch, but quickly figured that I would rather end up in a psych ward than go that way. It felt terrible, but it was still so hard to stop.\n\nIm 25 now and through that I learned how much harder it must've been for her. I resent my abusive upbringing, but I like to think I turned out okay, and I know what I don't wanna do when/if I become a parent, it made me strong, and i cant change it now so i choose not to get too cut up about it. I work with kids day to day and I look at them and it makes me weep thinking what kind of demons someone must have to want to hurt anyone, let alone defenceless children. That makes me angry. But having seen the substance side of things, and having my own mental health issues, I understand how hard life can be on that side. Death was a mercy for her.  I'm sorry life wasn't easier, mum, but I'm glad I didn't go down with you, and I'm grateful for the life you birthed.",
   "created_utc": 1691290289,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juze659",
   "message": "I hate how fucked up American parents are, in my country ull hardly ever find an addict let alone an addict who is also a parent",
   "created_utc": 1691290299,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juze8us",
   "message": "Forgive him?  Yes.  Let him back into my life?  Not again.  I’m a big believer that you can make amends from afar.  It’s his choice to keep using.  But it’s my choice to keep letting him hurt me.  I refuse to put myself through that anymore.  He’s had too many chances.  He actually called my mother and told her his alcohol counselor told him he might be the one to blame for a lot of our ill will.  He was shocked.  That just shows you how much self awareness he has.  I don’t need an apology.  I just hope he and I find peace eventually.",
   "created_utc": 1691290336,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzedgj",
   "message": "Sometimes I (M, 40) do, sometimes I don’t. My father (M, 62) used meth for a long time and disappeared for about ten years. Showed up clean one day and wanted to reconnect…\n\nI’ve visited him a few times for a few days here and there. I live in California and him in Arizona. He’s visited my home once.\n\nHe has put in effort in making sure he sees his grandkids and to keep in touch with me which is why I said sometimes I feel like I’ve forgiven him.\n\nOther times, his behavior and mannerisms show his history with meth, he will be short and almost angry at times along with going off the rails when something happens and he doesn’t like it. He will use any situation to ask for money or try to turn it to make him have the advantage, very reminiscent of addict behavior. Those times are hard to remember whether I’ve forgiven him or not..\n\nI’m glad he’s clean, I’m glad he’s doing better, I’m glad he’s a positive part of my kid’s lives but I am still bitter about the time lost, still angry that I didn’t have him when I needed a father.\n\nI guess I’m still resentful, in some ways…",
   "created_utc": 1691290401,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzeni8",
   "message": "Yes because I became an addict and did the same shit to my kids for about 10 years then got sober at the same exact age as my father. He was 37 I was 10. I got sober at 37 and my daughter was 10. I’m back with her and 14 months sober. Life is so good 😊 thank god for second chances and 3rd 4th and 5th",
   "created_utc": 1691290545,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzf3hx",
   "message": "Yes, because she recovered and turned her life around. She opened up a treatment center to help other addicts.\n\nOf course it took a long time to build the trust again. But learning to give her another chance was a formative experience for me because it taught me that people really can improve.",
   "created_utc": 1691290777,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzf4dw",
   "message": "No, but, they're dead now, so I just moved on.",
   "created_utc": 1691290790,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzffaj",
   "message": "No. Fuck them for fucking me over fucking.my life making it about them and then blaming  me for fucking up and be fucked up.",
   "created_utc": 1691290945,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzgbe1",
   "message": "As a child, I was terrified of second hand third hand smoke, and the fact that my father had an alcohol and smoking problem didn’t make it any better. However he does love me dear, and so I shall love him back",
   "created_utc": 1691291391,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzggsq",
   "message": "Sort of? My dad sobered up after I left home for college. That was over 20 years ago. But he never really repaired with me - he has never really grasped what it was like for me to grow up with an unpredictable alcoholic father in the home. At the same time, he’s not a bad person and his intentions are good (if selfish), so as an adult I have not cut him out of my life. I see him every few months and encourage a relationship with my kid. Unfortunately, my kid kinda picks up on the weirdness between us so they don’t have the closest grandparent/grandchild relationship. It makes me sad. I do love parts of my dad and I have some decent memories of times when he wasn’t drunk and he really loved me. He’s nearing 70 now and I wonder what the end of his life will be like, and whether I’ll regret not trying harder. I know it’s on him to do the work, but I also know that he’s emotionally stunted and always will be, so if I want a closer relationship then I’m going to have to do a lot of the labor to make it happen.",
   "created_utc": 1691291462,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzgssa",
   "message": "At first I did. Once the divorce hit, my dad stopped taking pills/drinking. He was so much nicer, seemed so much healthier, etc. He didn't scream at me anymore, he actually cared about my wellbeing, just generally being a better father than before.\n\n...but then he spent me and my sibling's college funds (50k each, so 100k overall, which was left to us by our late grandpa on our father's side) on gambling + alcohol. Haven't had contact with him for 2 years since that.",
   "created_utc": 1691291626,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzh1wu",
   "message": "No. My father started on the road to recovery and right after his first year of sobriety he started dating a girl only 3 years older than me which was uncomfortable to say the least. He was 42, she was 22 at the time. Even after I put that aside and got busy during university my Father never told me about my grandfathers health, how he had a tumour and was going through chemo. My grandfather passed away suddenly and my Father still didn’t tell me when the funeral was. \n\nI only found out by sending my condolences to a family member and they asked me if I would be at the funeral the next morning. His excuse was he was trying to “protect” me when i’m a full grown adult and throughout my entire childhood never tried to “protect” me from his alcoholic-induced rage fits every night and the trauma that put me through. \n\nHe started drinking again “casually” so he says, only a few months after dating his girlfriend. Which was the dealbreaker for me among other things. \n\nHe abused a substance and in my opinion has had no right to use it again without judgment. As well as having next to no improvement in maturity.\n\nEdit** Forgot to mention he never completed one of the steps in the 12-step program in which you apologize to those you’ve affected in your life. I made this aware to him that I waited for mine and I never got it, not once.",
   "created_utc": 1691291758,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzh5y6",
   "message": "Of course I forgave. It’s a disease. Do you blame someone for diabetes?",
   "created_utc": 1691291814,
   "score": 0,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzhql4",
   "message": "Not really…because one still is one and that’a hard to forgive since I’m an adult now.",
   "created_utc": 1691292108,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzhqoy",
   "message": "I tried. But ultimately, no matter how hard I tried or how much I loved, I couldn’t make them stop. I cut all contact with them (literally entire family, both sides) for my own mental health and I’m doing much better now. They are still in the same vicious cycle as they were 20+ years ago.",
   "created_utc": 1691292110,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzifk9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juzutwl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15j2uu0"
  }
 ]
}