{
 "submission_id": "15j2uu0",
 "title": "Children of addicts, did you ever forgive them? Why or why not?",
 "selftext": "",
 "created_utc": 1691259969,
 "permalink": "/r/AskReddit/comments/15j2uu0/children_of_addicts_did_you_ever_forgive_them_why/",
 "score": 192,
 "url": "https://www.reddit.com/r/AskReddit/comments/15j2uu0/children_of_addicts_did_you_ever_forgive_them_why/",
 "comments": [
  {
   "comment_id": "juxplft",
   "message": "My sister is an addict and currently in prison. Her three kids (15f, 13f, and 9m) have been there through the thick of it for the last seven years. The two older ones have expressed that her addiction basically stole their childhood and are prepared to ignore her calls and attempts to reconcile until she has cleaned up for good. I don't know if they'll ever forgive her.",
   "created_utc": 1691263288,
   "score": 26,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxoxks",
   "message": "No. All my mother gave me was fetal alcohol syndrome. I was taken from my parents, just like all my siblings before me, the moment I was born. Because drunk morons obviously don't make good parents. I fucking hope I'm the youngest of the litter because those two should not have kids. If they had shred of common sense and humanity within them I wouldn't exist. But here I am because they didn't care enough. My mother didn't care enough to stop drinking or straight up have an abortion if she couldn't stop.\n\nI don't know if they're dead or alive and honestly I don't care.",
   "created_utc": 1691263018,
   "score": 37,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxrsf5",
   "message": "I tried to forgive my father after being estranged for like 12 years. I tried really hard. He was dying and I wanted him to die with love in his life but he kept fucking up so we’re estranged again.",
   "created_utc": 1691264199,
   "score": 13,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxzrl7",
   "message": "Nope. My egg donor had me followed by 3 other siblings. She couldn’t raise any of us due to a severe addiction. Left me and my brother in a abusive home. My brother has special needs due to being born addicted to crack. Right when they took us me being 18 months old and him being 6 months old we were found under a dumpster where she had left us. My other siblings she fled to California with but lost custody eventually of them as well. I found her when I was 18 and she was still using so I stayed away until 24 when she was “clean” with methadone. Aka not really clean shits just as bad. Can’t find it in me to forgive her for choosing drugs over her children.",
   "created_utc": 1691267499,
   "score": 7,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxzshd",
   "message": "Nope, I lived with my dad when I was younger and he was always either drunk or meth’d out most of the time.  He was always absent and I pretty much relied on my friends and neighbors to eat and shit because he never cooked and spent up money on beer and drugs. When I was around 9 or 10 I woke up to the cops banging the shit out of the door, he crashed into someone and killed I think 2 people, driving drunk af.  He’s in jail for the foreseeable future and I now live with my mom who hates me because she re married and had had kids with someone else.  I’m apparently an inconvenience to her perfect family dynamic🫤",
   "created_utc": 1691267509,
   "score": 5,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxxwf3",
   "message": "My dad busted his back in the early 90s, and the doctors threw an endless supply of morphine at him. \n\nOpiate addiction is a real bitch. Seen things that make me refuse pain killers even when I should take them.\n\nMe and my brother would have never survived the town we grew up with out him.\n\nI know a lot of people that have addictions that destroy them. It destroyed his body and, in the end, killed him. \n\nBut he never became the monster that they can become. Actually, for a man so damn busted up, I am ashamed that he always had a better sense of humor than me. \n\nAny wrongdoings that were committed over the years were forgotten, and no ill will was ever formed.\n\nHis passing was hard. \n\nThat being said, I suffered a form of ptsd over dealing with his overdoses.\n\nGuess that's not a problem anymore.\n\nI'd prefer he was alive. \n\nI always went easy on him. If I couldn't quit smoking, who was I to demand he quit painkillers? Maybe that logic was a mistake, but who knows. \n\nMy experience comes from him getting busted up when I was 2 and him dying from overdose at 32. 30 straight years of opiate addiction. So ya know. There is a lot to live through in 3 decades.",
   "created_utc": 1691266721,
   "score": 5,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxvvab",
   "message": "Yes I forgave them\nMy mother got help and was able to pull herself together\nMy father never quit drinking and ended up dying over it. I still forgive him. You don't want to hold on to contempt or anger the rest of your life trust me. You don't even need to include them in your lives, forgiveness is FOR YOU to move on, and heal.",
   "created_utc": 1691265887,
   "score": 8,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxy13d",
   "message": "Nope. He’s done a lot of work to get sober, but no part of it was for our family. I sit in a room with him and find myself thinking he’s failed the 12 step program even though he quit drinking ten years ago cause he never apologized to the people he was supposed to love and take care of. Good on him for getting his shit together, but he’s still a bad person and I resent him",
   "created_utc": 1691266775,
   "score": 5,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxtqwb",
   "message": "they are addicts. blaming them, holding them accountable, expecting them to understand and be self-critical is too much to ask.\n\nSo i finally got my justification to be distant. Forgiving? Whatever, the past is the past.",
   "created_utc": 1691265015,
   "score": 7,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxuh1q",
   "message": "My old man was an alcoholic. Instead of rehab he chose to shoot himself in the head. I will never forgive that fucking coward.",
   "created_utc": 1691265313,
   "score": 7,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxse1r",
   "message": "Forgive? I doubt it, he wasn't exactly peachy before the pills.\n\nI've tried to forget, erasing him from my life helped a bit.",
   "created_utc": 1691264447,
   "score": 3,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxz71m",
   "message": "Died before I had the chance...",
   "created_utc": 1691267263,
   "score": 3,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy0p36",
   "message": "My dad had a drinking problem throughout my childhood, and I do forgive him. I forgave him once I hit adulthood and felt myself buckling under some of the same pressures. He was never abusive, neglectful sometimes and not always pleasant to be around in his cups, but it runs in the family (granddad drank until some colleagues had an intervention, great-granddad drank himself to death - for all I know this shit could go back centuries) and I can't see myself doing any better in his shoes. He is much better now, and I try to take care of myself and not follow in his footsteps in any of the bad ways.",
   "created_utc": 1691267878,
   "score": 3,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxwefw",
   "message": "I forgive them for being addicts. It's a disease. And the way their early lives went (Mom was raised by a single mom in the 60s, Dad's home life was a dysfunctional dumpster fire), I'm not surprised they turned to alcohol and drugs for comfort.\n\nI forgive them for their mistakes raising us kids. They did their best, and it's obvious that the love was there, even when the common sense wasn't.\n\nI forgive them for dying early. I wish they wouldn't have, they both suffered greatly, but it can't be helped.\n\nI don't forgive them for having kids in the first place. What an irresponsible, selfish decision. They unleashed three impoverished, traumatized adults on the world. The only reason two of them are middle class now is because of a grandfather's inheritance. (The other one, me, is barely making it due to cancer) We should not have had to be born to save their relationship or satisfy Mom's desire for a baby or whatever their reasoning was.\n\n(This doesn't mean I want to be dead, don't worry, it just means they made a couple of terrible decisions)",
   "created_utc": 1691266106,
   "score": 5,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxrgs1",
   "message": "Yes. It took some time, but eventually I realized she did her best.",
   "created_utc": 1691264063,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxz997",
   "message": "Don't know how to answer this as it implies there is something to forgive and I haven't talked to them in almost three decades, but it's not like I cut them out or anything, just sort of how things worked out (I was in middle school) and they didn't really express much of interest in keeping in touch and neither have I. I say \"them\" but it was just one parent, and the other parent will kind of give me an update on them  (we are talking like once a decade here) and I just go oh ok and never have any idea what they want me to do with the information. So I guess forgive as I certainly don't blame them for being an alcoholic but I also have no interest in having them in my life.",
   "created_utc": 1691267287,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy1v3j",
   "message": "Not really. “My kids were enough a reason for me to stop.” But weren’t a good enough reason to not start in the first place. It’s given her a lifelong opportunity to play the victim.",
   "created_utc": 1691268362,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy2d0t",
   "message": "I forgive my mom at 13 as she’s was the one who raised me when being a higher functioning alcoholic and drug addict until things not gonna disclosed lead to her starting to slowly die from her addicted disease until going to rehab with help her brother and his family. She was hard worker who supported me and my siblings while living on an island and even didn’t give up on us as she’s the one person we trusted and was our rock and guide. \n\nI forgive her as she’s the one person I love and loyal to as we’re close but can’t forgive my stepdad due to having been psychologically and physically abusive mainly witnessing him hit or fight my mom while drunk and gaslighting her or us when we see it. Mom I can forgive and love her for being able to get better for herself and us but my dad sorta not really but to in order to move on. My mom is now almost 8 years sober and is successful:)",
   "created_utc": 1691268566,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy3k60",
   "message": "I dunno if I will. My dad had a rough upbringing and started drinking at 15. But he still managed to marry my mom and support a family by getting up at 5am to work at his IT job.\n\nBut he was still a total asshole to me growing up. It's hard to reconcile the fact he tried so hard to support me with the fact he'd get drunk and call me a Bitch at times.",
   "created_utc": 1691269067,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy453y",
   "message": "No drugs was always more important than us n to this day it’s still true when the men she got with ditched it’s when she ditch all us in the system once our daddy’s left her she didn’t care we were disposable so in all honesty I hope she deis a horrible death 🤷🏼‍♀️",
   "created_utc": 1691269310,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy5oby",
   "message": "No. Between the people she screwed over in the long term while pretending to be mother of the year, the multiple attempts at stabbing me for drinking money, decades worth of surprise legal issues, and trying to accuse my wife of eating kittens ...nah, I think I'll pass. Irredeemable monster through and through, that's not even an addiction anymore. (Though it was all for as many drinks and pills as she could cram down her gullet at once. To this day somehow alive and ripping people off pretending to be some guru investor in the desert somewhere...)",
   "created_utc": 1691269926,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy6azn",
   "message": "Yes. My uncle John was an addict. And he was on the right track and trying to get his life together. He couldn't take it though and ended his life. He was a good person and I love him a lot.",
   "created_utc": 1691270192,
   "score": 2,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxtgpg",
   "message": "For your own sake, you need to forgive. Carrying that anger your whole life will not benefit you. Let it go.",
   "created_utc": 1691264900,
   "score": 4,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxx2h5",
   "message": "My older siblings haven't spoken to our former addict mother for 15+ years. That's their choice and I don't hold it against them.\n\nI feel holding onto that anger is a burden, exhausting. I have a normal relationship with her, especially being a recovering addict myself.",
   "created_utc": 1691266377,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juxzsig",
   "message": "Not really.  I tried many times while he was alive, but he’d just gamble and steal from me again.  I just make sure to treat my kids with the respect I was never given.  I’ve never really understood the forgive but never forget.  If you still think about it, and are angry at their actions, what does forgiveness mean?",
   "created_utc": 1691267509,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy4yeu",
   "message": "Yes I did. My mother had 5 children and her and my dad made sure we always had what we needed. The hard thing for my mother is that she moved to a country away from her extended family and my father didn’t have any family close. So she was at home all day looking after us. There was a lot of time that things were normal but she would slip up and drink and it would last 2-3 weeks where she would be drunk every day and as a young child I recognised it very quickly. She would come to us in the evening slurring her words and asking us to play games or watch films which actually scared me because I knew she was drunk and I didn’t want to be near her. It made me sick seeing her become a different person. It broke my heart and kind of broke me. My older brother would start fights with my dad and the whole house would erupt into chaos. Originally I kept running away because I couldn’t process or stop what was happening. Eventually I began to dissociate sometimes and pretend it wasn’t happening. But the violence from my brother and father clicked me back into reality and I had to step in. As a young boy I was exposed to the worst types of violence and threats which did benefit me in a way as I never took shit from people at school and never felt threatened by bullies because compared to my brother they were nothing. There was choking, broken bones, fists flying, threats of being stabbed and killed.\n\nIn terms of my mother she eventually admitted herself after she almost ran away with another man and realised she needed help. She has been sober for over a decade and worked incredibly hard to make up for what she did and caused. So whilst I still remember and feel for everything that happened, I’ve come to learn that she was simply someone who became lonely and desperate and wanted to escape but couldn’t control her addiction. I know despite everything she always wanted to be a good mother.",
   "created_utc": 1691269632,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy5mf3",
   "message": "i did at first. i had come to know addiction well by the time i spoke to her again. my mother was young and not ready for a child, let alone two. she developed an oxycontin habit and lost it all, including us.\n\nmy brother and i got put in foster care so i wasn't living with her by the time i was 5. rarely saw her cause legally i was to have no contact. she reached out to me when i was a teenager. we texted every now and then. she'd gotten her shit together and was living well.. she offered me a place to stay if i ever needed it. took her up on it when i was 18.\n\nwhen i was moving out of her place i decided to try and have a real talk with her.. to attempt to relate to one another. i revealed that i had quit heroin the year prior. my addiction consumed the entirety of my teenage life and ruined everything. her immediate reaction was to judge me. i found out she didn't believe i had real mental problems and i could 'get over it'. she blatantly told me my childhood (that she was unconcious through half of..) was not traumatic. she began treating me with a mistrust that hadn't been there previously.\n\nwe smoothed things over but i don't think i will ever really forget the way she treated me when i needed someone who knew what it was like. the first and only time i needed mom.",
   "created_utc": 1691269904,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy6wcr",
   "message": "Yes.\n\nMy bio-father has/had a drug an alcohol problem.  Went into rehab when I was quite young.  Really embraced sobriety and was a good dad.  Ended up marrying a woman who really loved chaos and enabled him.  When I was about 11 she let me know that he wasn't ever actually an addict my mom just made him really unhappy. At that point,  he did a weird thing though, he starting drinking occasionally but I never saw him drink to excess after that.  Almost like he could control it, which went against EVERYTHING I've ever learned.  I did Ala Teen and they told me it was impossible.  BUT his behavior/personality was 100000% an addict.  Nothing was his fault, everything and everyone was making him a victim.   He was an incredibly toxic and traumatizing person.  BUT he grew up with a violent alcoholic father.  His life growing up was horrible.  When I became a mother and my kids were older, I saw the life they lived and compared to the life he lived and it broke my heart.  He didnt even have a chance.  So I was able to find empathy for that terrified little boy who had no safe place to go ever and forgive the man he became.  \n\nThat being said, forgiving someone who isn't sorry is incredibly hard.     I cut him out of my life about 15 years ago and didn't forgive him until quite a few years after that and still don't have him in my life.  My forgiveness is for my own well being, not his.  I needed it to let go of the baggage and when I did, a weight was lifted and I actually found peace and could start healing.",
   "created_utc": 1691270446,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy7t7p",
   "message": "No.      \nBut if I start explaining I'll be here all night writing an essay.         \nAlcoholic abusive father. Ongoing. Just waiting for him to die and free us from this misery.",
   "created_utc": 1691270829,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy8nop",
   "message": "My parents aren’t addicts but a lot of my other family are/were. One thing I’ve learned is that you can love a drug addict but you should never trust one, with anything for any reason. No amount of love and support can fix an addict who’s unwilling to try.",
   "created_utc": 1691271181,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy9mwd",
   "message": "No. They're still the same person.",
   "created_utc": 1691271591,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juy9myr",
   "message": "I forgave him in the sense that, I let go of any power he had over me influencing my emotions, or residue of childhood PTSD. I see forgiveness as having less to do with them and more to do with me. I forgive to let go. Even so, he will never be welcome in my life for as long as I live.",
   "created_utc": 1691271591,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyb64z",
   "message": "Not a parent but older siblings,  and no. They stole from me with no remorse, yelled, hitted me on the face, kicked me out of any room they didn't want me in, and without a single consequence for it. One of them died recently of an overdose, and I didn't even look at tickets to fly to his funeral. I will never forgive them for the way they ruined my childhood since, to this day, they don't even acknowledge or care to apologize or give me the thousands of dollars they stole from me. They bought my relationship away, and it was a non refundable sale. The one who is still alive could die in front of me, and I would just walk away and let him rot on the floor.",
   "created_utc": 1691272244,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juybfts",
   "message": "I think I have. Despite everything that he's done and said while under control of his vice, I only ever get one dad. He's been clean for years now, and he seems much calmer and more level-headed. Although, secretly, I wonder if he ever wants to go back to the creature again.",
   "created_utc": 1691272357,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyc0xi",
   "message": "No reason being their behaviour is worse even after getting sober. I don’t want my son to look up to or idolize a pathological liar, woman abuser, and all around peice of sh!t. This is Not my sons father but my own",
   "created_utc": 1691272607,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyc2ex",
   "message": "My father was an extreme alcoholic, he beat my grandfather, my mother, my brother and me. it's been a long time since he beat us up, but I haven't forgiven him.",
   "created_utc": 1691272624,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juycdg9",
   "message": "I feel their pain it hursts asf",
   "created_utc": 1691272755,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyd9pb",
   "message": "She (mom) is dead. I didn’t forgive her when she was alive and I don’t now. I really don’t think about it anymore. I moved on.",
   "created_utc": 1691273140,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juydbun",
   "message": "I will never forgive my mom or grandma for picking up a cigarette. I understand why, and I empathize, but I won't forgive them for knowingly fucking up their lungs. I'm proud of my grandma for finally quitting, but I'll never truly forgive them.\n\nMy day on the other hand, I'm damn proud of. He was fucked up on all kinds of drugs for a while, then got clean, found god, and married a wonderful Venezuelan woman and had my half sister. He's going on 16 years clean now.",
   "created_utc": 1691273166,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juydtp6",
   "message": "I'm not a child of addicts/alcoholics, but my daughter has completely disowned her mother for being the drunken asshole that she still is. I am sure there will be no reconciliation.",
   "created_utc": 1691273381,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juydtus",
   "message": "My mom basically ruined the first 10 years of my life and I still deal with the effects of that, 26 years later. I get so frustrated having to deal with the trauma because it was 100% not my fault, I didn’t ask to be born and I wish she would’ve tried harder to be a good mother to her two little girls. So …I don’t know if I can forgive her.",
   "created_utc": 1691273383,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyecmw",
   "message": "my mother is/was at least an alcohol addict.\n\nI m/17 her first son, was the reason she stopped drinking for around 9 months, and my half-sister f/don't ask me how old she is, she is younger then me was the second reason she stopped drinking for 9 months. I am at another family, I don't know about my half sister.\n\nI can't quite be mad at her, she is the reason i am not already in a dept, since she doesn't care about me, nor does her family. Also, she seemingly stopped drinking and smoking early enough, so that I am not phyiscally disabled.",
   "created_utc": 1691273618,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyffrz",
   "message": "Yes— I saw the pain first hand from my dad and the problems it caused him. Luckily my mom was there for me and we got out of the worst of it when I was young, but I didn’t build a relationship with him for years and years. I still rarely see him and have never lived with him, but I have the perspective now to see that the drinking only ruined his own life and he basically had to pick up the pieces from the beginning. My heart really goes out to him and every other person struggling with alcoholism because it truly is a disease, not something as easy to do as “just stop drinking”.",
   "created_utc": 1691274106,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyfxie",
   "message": "My father was an alcoholic. As man in line for a pension with a home and several real estate properties drank them, and our future away. As a result, we grew up in a roach-infested, low rent apartments on food stamps. I loved him and knew he loved us, but when he was drinking he was the worst version of himself.\n\nI, in turn became a drug addict.\n\nIt was only when I got in recovery did I realize not only were there valid reasons I turned to drugs, there were even more reasons for him. He had a horrific childhood an seen some shit.\n\nI forgave him because I understood his addiction like my own.",
   "created_utc": 1691274326,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juyg52s",
   "message": "No. She refuses to take responsibility to this day. Why should I do all the work to maintain a relationship I never asked for.",
   "created_utc": 1691274421,
   "score": 1,
   "submission_id": "15j2uu0"
  },
  {
   "comment_id": "juygj6k",
   "message": "No. He is going to die from it and leave me and my siblings with the ongoing fallout from the trauma of our past. We will have to grieve the father who maybe cared but never cared enough and never bothered to do better for us. I know that I will also feel guilty about not having much of a relationship with him because I had to distance myself… so I anticipate his death being a very interesting mental battle. And I’ll struggle to forgive him for that too.",
   "created_utc": 1691274602,
   "score": 1,
   "submission_id": "15j2uu0"
  }
 ]
}