{
 "submission_id": "15j5b2j",
 "title": "What's a unique or little-known piece of advice that has had a surprisingly big impact on your life?",
 "selftext": "",
 "created_utc": 1691266048,
 "permalink": "/r/AskReddit/comments/15j5b2j/whats_a_unique_or_littleknown_piece_of_advice/",
 "score": 57,
 "url": "https://www.reddit.com/r/AskReddit/comments/15j5b2j/whats_a_unique_or_littleknown_piece_of_advice/",
 "comments": [
  {
   "comment_id": "juy81fe",
   "message": "What it means to evolve out of childhood is the understanding that you do the right thing solely for the reason that it is the right thing to do. \n\nYou don't do it because it makes you feel good. Often, doing the right thing will feel bad, it might even leave you feeling mad and cheated, but you need to put aside your childish self.\n\n~*This was from dear old dad, who told me this every day with how he interacted with people and the world.*",
   "created_utc": 1691270925,
   "score": 41,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juyfn5b",
   "message": "Not little-known or unique but: stop worrying about what people think of you. If you knew how little time people spent thinking about you, you’d be offended.",
   "created_utc": 1691274196,
   "score": 33,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juy4d58",
   "message": "Reading on one subject related to your work for half hour per day will make you an expert on the topic.",
   "created_utc": 1691269400,
   "score": 24,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juxx3vp",
   "message": "I wish more people knew and understood that they need to wash their a-hole with soap when they shower.  Just letting water run over it is not good enough.\n\nEdit: grammar",
   "created_utc": 1691266394,
   "score": 25,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juxwzuv",
   "message": "Focus on what you do well, and only be good enough with the things you aren't great at. The skills and talent you excel at will reward you in life much more than the skills you struggle with.",
   "created_utc": 1691266348,
   "score": 18,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juyakgf",
   "message": "The answer is always no, until you ask",
   "created_utc": 1691271992,
   "score": 19,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juyfrw9",
   "message": "“If I worry, will the future change?” \n\nThat quote has stuck with me seemingly forever, and it is so true. It helps me control anxiety. \n\nFrom an episode of “Kung Fu” with David Carradine, although that is probably not the origin of the quote!",
   "created_utc": 1691274257,
   "score": 11,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juy4pkt",
   "message": "Dont cater to others when you cant cater to yourself. If you cant treat yourself right, dont focus on other people. \nAlso, bring your wallet everywhere.",
   "created_utc": 1691269536,
   "score": 7,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juy5da2",
   "message": "A good handshake goes a long way. I beat out better qualified candidates for my current job,",
   "created_utc": 1691269800,
   "score": 10,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juy306s",
   "message": "My moms own advice which helped learned to love myself more as I gotten older and to self improve as an adult who’s trying to be successful in college. She told me to chase dreams and now trying to be an artist possibly animator and movie/tv show writer.",
   "created_utc": 1691268832,
   "score": 5,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juykvpm",
   "message": "“Don’t tell yourself no, make *them* tell you no.” Mostly in relation to applying for jobs. One time I was looking at listings and my mom was there and I said I’m not qualified for any of these and she said apply anyway, don’t tell yourself no, make them do it. I have never since been offered a job I really felt I was qualified to do, but I applied for it anyway and they never told me no 🤷🏻‍♀️",
   "created_utc": 1691276482,
   "score": 6,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juymsmr",
   "message": "Don’t give anybody a chance to fuck you over. \n\nFor example; drive defensively. When you forget something in your house, don’t leave the car running, take the keys out and go in to get your stuff. Don’t tell shit to your coworkers about your personal life that they can use against you. Stuff like that.",
   "created_utc": 1691277301,
   "score": 5,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juyidqv",
   "message": "learn to look at different situations on behalf of other people",
   "created_utc": 1691275434,
   "score": 6,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juyyf59",
   "message": "Wash your pillowcase fairly often. It collects dirty and oils that REALLY make you break out.",
   "created_utc": 1691282690,
   "score": 5,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juz0txr",
   "message": "Between stimulus and response, there is a small gap.  You get to choose how to respond to any given stimulus.\n\nIn other words, you choose how to respond to any situation in your life.  You are not hard wired into any reaction.",
   "created_utc": 1691283823,
   "score": 4,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juybxva",
   "message": "The Kama Sutra says there are 3 types of penises and vaginas, and for optimal sexual chemistry, you should match types. \n\nI wish this was more common knowledge rather than the standard big dick worship that is common in our pornbrain skewed culture.\n\n\u0026gt;According to the Kama Sutra, there are three penis or \"lingam\" sizes: \"hare\" (2in-4.8in), \"bull\" (4.9in-6.9in), and \"horse\" (7in+). For women, there are three vagina or \"yoni\" sizes: \"deer\" (short), \"mare\" (average), and \"elephant\" (deep).",
   "created_utc": 1691272570,
   "score": 10,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juyso6l",
   "message": "“You control your own life. What happens to you is only a smart part of your life, believe it or not, what you do with that is the majority. So if you’re not happy and feel stuck, it is up to you to change your circumstances. nobody else will do it for you, you have to do it for yourself. Then you will be good because you can stand on your own.”- my grandfather 👴",
   "created_utc": 1691279981,
   "score": 3,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juyus9p",
   "message": "That who you surround yourself with has more impact on you that you might realize at the time. I cut a bunch of people out of my life and felt utter relief afterwards as time passed.",
   "created_utc": 1691280976,
   "score": 4,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juz3ggf",
   "message": "\"Today sucks. Tomorrow might not. The only way to find out is to be there.\"\n\nBest anti-suicide message I ever saw.",
   "created_utc": 1691285069,
   "score": 4,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juybwu4",
   "message": "Two things can be true at the same time.",
   "created_utc": 1691272558,
   "score": 3,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juyeh66",
   "message": "Enjoy the small stuff eventually small thing become big things 👍",
   "created_utc": 1691273675,
   "score": 3,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juyusqf",
   "message": "If it’s not going to matter to you in five years, don’t spend more than five minutes being angry about it. Whenever I’m super pissed and can’t let something go, I set a timer for five minutes and let myself be as pissed as I want for those five minutes. Then you move on. It’s really therapeutic.",
   "created_utc": 1691280983,
   "score": 3,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juywy0l",
   "message": "Use your knees when picking stuff up off the ground, it can genuinely help stop back problems early into life as an adult",
   "created_utc": 1691281992,
   "score": 3,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juyxm3s",
   "message": "Happiness is getting enough sleep.\n\n(Robert Heinlein, Starship Troopers)",
   "created_utc": 1691282305,
   "score": 2,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juz2btx",
   "message": "I don't know if it's unique or little-known, but I didn't get this advice til I was an adult, so: put toilet paper in the toilet before you poop to avoid poo streaks. \n\nOn a similar note, if you own a vagina and you're constipated, try vaginal splinting. It's a life saver.",
   "created_utc": 1691284537,
   "score": 2,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juy5lk5",
   "message": "If it results in pain, it might not be a good idea.",
   "created_utc": 1691269894,
   "score": 1,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juytfeg",
   "message": "Stop worrying about should've and could've and act on will and can.",
   "created_utc": 1691280341,
   "score": 1,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juyzdv5",
   "message": "'Fear is just a memory'\n\nWas jumped by a police dog as a kid (it didn't like the look of my metal crutches) and was left with a slight cut on my arse and a terrifying fear of any breed of dog. \n\nYears later, was in therapy for help with a few things and when I told this story, I got that line back. I wasn't scared of the animal in front of me... The dog was just a visual reminder of what happened and a trigger for my memories to put me in fight or flight mode. \n\nIt just clicked almost immediately and while i'm still a little uncomfortable around bouncy or barking dogs... I'm not bolting for the door or to hide behind someone.",
   "created_utc": 1691283148,
   "score": 1,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juz0y12",
   "message": "Cleanliness is next to buttsome-ness! Soap up, folks.",
   "created_utc": 1691283877,
   "score": 1,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juz588t",
   "message": "Don't sweat the small stuff. If it won't matter in a year, it doesn't matter now.",
   "created_utc": 1691285907,
   "score": 1,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juz6ecn",
   "message": "In a relationship there are conflicts where you can be right, or you can be happy but not both.  You need to look at the issue and determine what outcome you need.  I have found myself considering this many times in my life.  I find that most, but not all, the issue is really not a big deal and not worth arguing about.",
   "created_utc": 1691286462,
   "score": 1,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juz9866",
   "message": "BEST PARENTING ADVICE I was ever given. \n\nWhen children are “tattling” on another child for something fairly innocuous. It’s not bc they want to get the other child in trouble, it’s really bc they are seeking empathy from the adult and validation that the things they’ve been told aren’t ok - are, in fact, not ok. “Ben snatched my crayon” or “sally ran away with my toy” The kids that “tattle” more tend to be the ones who are seeking that empathy and validation more often.\n\nWhen the adult responds with empathy and validation “I’m so sorry they did that. That’s not ok.” the child will usually accept it and move on.",
   "created_utc": 1691287836,
   "score": 1,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juza0sc",
   "message": "if you put love above your goals you’ll end up with neither",
   "created_utc": 1691288224,
   "score": 1,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juzammg",
   "message": "Always bring/drive your own car (unless of course there’s a chance you might drink \u0026amp; drive). You never known when you need to leave a situation or just plain want to leave. It’s the worst when you’re on someone else’s timeframe.",
   "created_utc": 1691288525,
   "score": 1,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juzbpju",
   "message": "I may have deep pockets.  But I have short arms.",
   "created_utc": 1691289073,
   "score": 1,
   "submission_id": "15j5b2j"
  },
  {
   "comment_id": "juzbtt6",
   "message": "I actually have three:\n\n1. Never get a speeding ticket on the way to the office\n2. Always follow the money, answer is usually there\n3. HR is nacho friend",
   "created_utc": 1691289133,
   "score": 1,
   "submission_id": "15j5b2j"
  }
 ]
}