{
 "submission_id": "15j5kc1",
 "title": "How did you get your scar?",
 "selftext": "",
 "created_utc": 1691266705,
 "permalink": "/r/AskReddit/comments/15j5kc1/how_did_you_get_your_scar/",
 "score": 115,
 "url": "https://www.reddit.com/r/AskReddit/comments/15j5kc1/how_did_you_get_your_scar/",
 "comments": [
  {
   "comment_id": "juxy0wt",
   "message": "I was running with a stick and fell on it eyeball first. I've got a black scar on the white of my eye ever since.",
   "created_utc": 1691266773,
   "score": 86,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyeqsx",
   "message": "My breasts tried to kill me.",
   "created_utc": 1691273798,
   "score": 74,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juxyjwz",
   "message": "Don't work on moving parts. Turn off the moving part.",
   "created_utc": 1691266993,
   "score": 51,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juxyyvm",
   "message": "My father",
   "created_utc": 1691267170,
   "score": 30,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy48iy",
   "message": "Personal clumsiness. Stupidity. Surgery. Carelessness. Yardwork. Surgery.\n\nSo far...",
   "created_utc": 1691269348,
   "score": 25,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juynty4",
   "message": "My younger brother stabbed me. \n\nMom was out at work, and dad was out getting groceries. This happened around when I was 17/18 and my younger sibling was a couple years younger. \n\nI guess we were both having a really shitty day, because after I got done getting mad at a game I was playing, I left my room, slamming my door in the meanwhile. I knew I needed to calm down, because I actually used to have anger management issues, and it's something I work on, to this day. \n\nAnyways, my brother hears this and he gets pissed. Severely pissed. As I'm walking down the steps to reach the kitchen to find a snack, he comes barreling down in anger, yelling at me to stop getting all pissy and that he is sick of it. I told him to shut the hell up and he gotten real angry. After a few choice words that we threw at each other, he threatened to stab me. \n\nNow, for context, while I was getting better at handling my anger (I used to be real bad as a kid. Punching myself or objects I owned. It was bad, and I knew then it was something I had to work on. I made it far now, and I'm able to very easily catch myself before I do anything). \n\nFor context, my little brother...was not doing well. Mentally or socially. Growing up we were fine, but something happened that changed him terribly. I have a few ideas as to what, but I will probably never know for sure. Anyways, around this time, my younger brother was getting in trouble for a lot of things. Skipping school, getting into fights with other kids, yelling at family members, failing classes, skipping summer school that he had to do, small drug usage, bad influences, etc. It was bad, and looking back, it was only a matter of time before he really hurt someone. \n\nBut while my brother and I were arguing, he threatened to stab me, and one thing that was always a common occurrence was that he always bluffed his threats to others. So I called out his bluff. There was no way he had an actual object to stab me with right? \n\nWell, unfortunately, I was terribly wrong. \n\nHe threw a pocket knife at me, and it hit me right above my wrist. Cut me clean open and fell to the ground. It took me a full second for me to register that something hit me, another for my brain to register the blood that was already on the ground, and another five as adrenaline pumped so hard, I rushed to grab a bathroom towel to cover my arm, all while screaming \"What the fuck???\"\n\nAfter calling my dad with my phone, and after he realized he fucked up, calling 911 on his phone, I was taken to the hospital pretty quickly. \n\nI thought I was going to die that day, and that feeling and fear of both my brother, blood, and even death has been with me ever since. \n\nI had to live with him for two more years (went to college for a bit as well) and anytime he was home and I was home, I was terrified. \n\nI honestly haven't been the same since, and while I have a good relationship with my parents now, there were days where I hated them for both allowing him to still live there and for not noticing the signs before. \n\nThose were a hard couple years. To this day, I know that my relationship with my little brother will never be the same, or good ever again, because I don't want one with him anymore. And it's both such a relief, and heartbreaking, all at once.",
   "created_utc": 1691277741,
   "score": 25,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy1xoq",
   "message": "A play sword across my left cheek, pretty cool facial scar.",
   "created_utc": 1691268390,
   "score": 13,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy3vf8",
   "message": "cut my leg open on a rusty piece of metal while playing hide and seek. It bled a lot 100% would not recommend this childhood activity.",
   "created_utc": 1691269199,
   "score": 10,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juxz38x",
   "message": "1/ having a cyst removed \n\n2/ getting punched in New York and steri stripping it instead of getting stitches because I presumed they’d cost like 50,000 dollars",
   "created_utc": 1691267220,
   "score": 10,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyiflv",
   "message": "On my face dog attack. On my stomach melanoma scar.",
   "created_utc": 1691275456,
   "score": 10,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyowxs",
   "message": "Three scars on my right breast(two from lumpectomy, one from the family cat digging her back claws in as she launched herself off my chest), one on my right shin(falling off my bike and hitting it on a concrete wheel stop), and one on my right knee(trying to go down a metal slide while standing.)\n\nMy left side must feel so neglected.",
   "created_utc": 1691278224,
   "score": 8,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy437b",
   "message": "[deleted]",
   "created_utc": 1691269289,
   "score": 7,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juxyphv",
   "message": "1) hockey...2) back surgery",
   "created_utc": 1691267060,
   "score": 6,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juxyqud",
   "message": "Biking accident. Went down a little too fast, hit a pinecone, flipped twice and landed on mixed concrete-asphalt pathway. Ow.",
   "created_utc": 1691267076,
   "score": 6,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy0apl",
   "message": "One of my scars is from the kid next to me, who decided to pretend his soldering iron was a lightsaber and swung it behind him without looking, touching it to my hand.\n\nThe other four scars are from tripping and falling while running around my house lol.",
   "created_utc": 1691267715,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juya6yw",
   "message": "Head first into the self checkout machine... seizures suck! (Harry Potter scar)",
   "created_utc": 1691271834,
   "score": 6,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juxxy0d",
   "message": "Tried to hold a blender with my bear hand.",
   "created_utc": 1691266740,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juxzrmt",
   "message": "Burnt my wrist when making toast for my mum on Mother's Day it was so fucking painful don't recommend",
   "created_utc": 1691267499,
   "score": 5,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy43df",
   "message": "Walked into a table aged 24 months. An upset hangry ferret we had just taken on from an abusive home did a rhinoplasty on my nose. Three operations and worst was from catching my arm on the release arm of a live capture trap.",
   "created_utc": 1691269291,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juya1er",
   "message": "Emergency c-section",
   "created_utc": 1691271767,
   "score": 4,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyg5nj",
   "message": "Civil War",
   "created_utc": 1691274428,
   "score": 5,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyhr2r",
   "message": "Stabbed by a crazy person when I was a paramedic",
   "created_utc": 1691275160,
   "score": 4,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juykfyn",
   "message": "Fell 30' off a cliff.",
   "created_utc": 1691276301,
   "score": 4,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyku3s",
   "message": "Which one? Cancer, gunshot, some guy broke my face, surgery to fix face, industrial accidents (several), a couple burns here and there.",
   "created_utc": 1691276463,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyo84z",
   "message": "Was at the shopping mall with my mom and my sisters. We go up the escalators and my sister pushes me. I’m wearing flip-flops and my bare ankle and heel is exposed getting caught in the gears of the escalator. A chunk of flesh is gone from my foot and now is replaced with a synthetic flesh glue that has been absorbed by my body - the scar/tissue is very noticeable",
   "created_utc": 1691277913,
   "score": 4,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyoc17",
   "message": "I was 12 and crawling under a barbed wire fence when the horse in the fence looked like he was charging towards me so I panicked and rushed under the fence, but one of the barbs caught my back and cut me deep enough to leave a scar.",
   "created_utc": 1691277960,
   "score": 4,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyok9z",
   "message": "The oven... far too many times :(",
   "created_utc": 1691278060,
   "score": 4,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyq6kt",
   "message": "arrow through my hand..",
   "created_utc": 1691278809,
   "score": 4,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyqebg",
   "message": "My 16yo dumb self was running near the sports court because of an assignment our teacher gave us. Basically, it involved running and we had to be in pairs. My partner kept encouraging me to run, and I think I heard her so much that I ran faster than my legs could handle (if that makes sense). I stumbled over my own leg and was thrown forward, face-first onto the concrete. I got up and ran back as if nothing had happened. Minutes later, I realized that one of my elbows was torn and the blood was running down my arm. Part of my pants tore on one side at the waist. Earned two scars.",
   "created_utc": 1691278910,
   "score": 4,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyqsy0",
   "message": "1 from someone in jail\nAnother one from someone different in jail\nA dog\nAnother dog\nA third dog\nA fourth and fifth dog\nAn alligator\nA car\nThe road\nA bicycle\nFather\nAnd about 5 knives \nAnd two scalpels",
   "created_utc": 1691279102,
   "score": 5,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyvuyb",
   "message": "Which scar?\n\nThe most recent one is from heart surgery two years ago.\n\nThe oldest was is from the time Joey Maso pushed me off my bike in the gravel.",
   "created_utc": 1691281484,
   "score": 5,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy1ixz",
   "message": "I climbed the dying tree in my backyard and the beach broke and I hit me head. I was stupid kid",
   "created_utc": 1691268224,
   "score": 6,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juxylxg",
   "message": "Surgery",
   "created_utc": 1691267018,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy19e0",
   "message": "Like so many others… fell off my bike as a kid.",
   "created_utc": 1691268115,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy4luu",
   "message": "Gosh, I have so many (mostly because I was clumsy as a kid). I got one scar on my knee from falling from a hill, two scars from surgery after I broke my arm after falling down from a slide and another above my eye after hitting my face on the edge of the bathtub lol. I've also got self-harm scars on my arm.",
   "created_utc": 1691269496,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy8fgx",
   "message": "Tripped and fell when i was 4 and got a rock lodged an inch into the cartilage right above my knee.",
   "created_utc": 1691271087,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyaxxr",
   "message": "Groin hernia surgery",
   "created_utc": 1691272149,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juycmwj",
   "message": "Open heart surgery two months ago.",
   "created_utc": 1691272869,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyed1z",
   "message": "Broadsided a garbage truck on my motorcycle only wearing a 1/2 lid.",
   "created_utc": 1691273623,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyi5r3",
   "message": "Left hand cushioned the bump stop of a 500Kg Z axis I was working on. Had to tell the guys getting me out which store room had the 5 foot pry bars. Recovered some of my bone from that machine later...",
   "created_utc": 1691275341,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juylesa",
   "message": "I fell threw a window. Cut the back of my left arm down to the bone. Rushed to emergency surgery. Paralyzed for a few months. Infection in my elbow. I was 17.\n\nEdit: I tell people I got bit by a shark.",
   "created_utc": 1691276707,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juylnos",
   "message": "1. Chicken pox.  I have a circle on my forehead like Dr. Manhattan\n\n2. Multiple surgeries\n\n3. Angry cats\n\n4. Piercings gone wrong",
   "created_utc": 1691276811,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juylqca",
   "message": "My father was a drinker, and a fiend.",
   "created_utc": 1691276843,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juylx6q",
   "message": "Car airbag blew up in my face",
   "created_utc": 1691276924,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juynctu",
   "message": "Pipe burst right next to my thigh",
   "created_utc": 1691277538,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juynxbb",
   "message": "Car accident. Broke my pinky, radius, and shattered my elbow in my right arm. Needed 52 stitches.",
   "created_utc": 1691277783,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyojwn",
   "message": "Had my entire large intestine removed due to Crohn’s Disease.",
   "created_utc": 1691278055,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juypxzr",
   "message": "1) I was running to my parents' room, and for some stupid reason there was an old impact sprinkler head on the floor (the ones that jerk back and forth with water pressure). I tripped on it, and one of its sharp bits dug into my knee, just below the kneecap. My parents didn't take me to the hospital, just bandaged it.\n\n2) I was running a Hot Wheels car along shag carpet, when suddenly a 1/2\" shard of glass pierced my hand.",
   "created_utc": 1691278697,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyqmal",
   "message": "Tripped over a curb that had no damn business being where it was, turning tendons to spaghetti strands in my ankle and leading to a two hour surgery to fix everything. Now I have a crescent moon resting on it's back around my ankle bone. Thinking about getting the moon tattooed and my favorite city's sky line tattooed in the bowl of the moon.",
   "created_utc": 1691279014,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyqnw5",
   "message": "Biggest one is a stab wound that had a hell of a time healing. Took about a decade but finally got it covered with a tattoo. Now I guess my main scar is from when I was shaving with a cutthroat and fucking around. Sliced my arm pretty bad but such is life",
   "created_utc": 1691279034,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyqqsu",
   "message": "Was getting a drink out of the water fountain at school and a popular girl thought it would be fun to push my head into the fountain.  Caught my eyebrow on the spigot.  But it was \"an accident\" 🙄",
   "created_utc": 1691279073,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyqw21",
   "message": "Shooting some hoops and going after the ball before it went outta bounds and a kid tripped me on purpose and I smashed head first into the pole. First 9 stitches I ever had, 4th grade.",
   "created_utc": 1691279143,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyrdej",
   "message": "Crescent moon shaped scar on the left cheek of my face - Handle bar went through it and almost came out the right cheek as well.\n\n3 inch scar on back of head - hit with metal pipe and it split my head open.\n\nScar that looks like the handicapped symbol on the inside of my right knee/leg - the motorcycle engine was really, really hot and instantly sizzled me.",
   "created_utc": 1691279371,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyrhkh",
   "message": "Snuck into Edinburgh Zoo 45 years ago and got chased by a keeper. Vaulted a fence to get away and cut my hand.",
   "created_utc": 1691279424,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyrkop",
   "message": "I ran into a gatepost and slashed my eyebrow the way that edgelords claim to have.",
   "created_utc": 1691279465,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyry7o",
   "message": "1. small cut on my right palm, after i stumbled on the stairs, while holding a glass bottle.\n2. complicated fracture on my left ring finger, after a car crash.\n3. left sole, after a blood clot got removed.",
   "created_utc": 1691279640,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyrzae",
   "message": "I have several scars. One long one on my back, another on my chest, and sides cause of open heart surgery. Was born with ASD, VSD, and PDA (patent ductus arteriosus). I have another one on my inner thigh cause I was born with a genital defect as well called hypospadias!",
   "created_utc": 1691279654,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyslif",
   "message": "Was born and immediately had open heart surgery.",
   "created_utc": 1691279946,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juysqgp",
   "message": "accidently touched the bottom of a hot test tube",
   "created_utc": 1691280011,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juysxca",
   "message": "I fell while hiking on (cooled) lava",
   "created_utc": 1691280102,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyt952",
   "message": "1. had a brain tumour.\n2. i have no idea, I had a little scar on my left pinky finger since I was like a toddler I think.",
   "created_utc": 1691280259,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juytgts",
   "message": "Ahem… so firstly when I was around 3 I fell off the door step and got a scar on the right of my forehead and 4 stitches. When I was around 5 I did the same thing again and got a scar on the right side of my forehead at my hairline. When I was 12 I got shoved through a door at school by a 15 year old and slammed my head on a desk, 6 staples back right of the dome. When I was 13 I was washing the shaving foam off my brother in laws car after his wedding and cut my thumb on his broken radio antenna. No stitches but I taped it up. 1 inch scar, right thumb. In the same year I used to jam a knife in my bedroom door frame to use as a makeshift lock, the knife closed and sliced in to my right index finger, on the side. No stitches, I taped it up. When I was 19 I was bitten by a dog, right hand, between my pinky and ring finger but on the hand itself. The hole went clean through so I had a hole through my hand. Doctor wouldn’t see me without an appointment so I once again cleaned it and taped it up. It healed fine but I lost some function in my pinky finger. It has a jagged movement now instead of smooth motion. Those are the scars I can think of right now",
   "created_utc": 1691280359,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juytraq",
   "message": "Work in a football stadium compactor room (trash room) I was operating onf the compactors when it malfunctioned came down and knocked the metal door open which hit me in the head and knocked me on my butt  got 17 stitches in my forehead scar is not real visible anymore",
   "created_utc": 1691280493,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyue23",
   "message": "Bicycles and chain link fences. Multiple scars multiple incidents. I will Share the worst one\n\nSuper freaky to look at your muscle through your fat and skin and not see any blood for what felt like 5 minutes. Soon as my brain acknowledged I was hurt the blood rushed out instantly. Such a crazy feeling and experience I can't describe it any differently. One of those you would know if you had it happen type things. \n\nSome wonderful lady was gardening in her rose garden. I walked up and asked for a Band-Aid or two and showed her my 8-in+ deep cut. Yeah she freaked out a little bit more than I was because it was obvious to her that I needed a lot more than a band-aid lol.\n\nStill love bicycles but damn those sharp chain link fences with the spikes on top.",
   "created_utc": 1691280791,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyute9",
   "message": "The sharp edge underneath the aluminum thwart of a cheap, ABS canoe gouged chunks out of my shins when I rammed into it after my brother steered us into a big rock in a rapids. 20 years later the scars are still very apparent.",
   "created_utc": 1691280992,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyv3xa",
   "message": "I had surgery on my arm where I had MRSA. \nAlso a scar on my stomach from a feeding tube. Looks like a second belly button.",
   "created_utc": 1691281129,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyvagg",
   "message": "Kidney transplant, it’s a pretty big one, too.",
   "created_utc": 1691281215,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyvl0h",
   "message": "_Scars_. Plural.\n\nSurgery for cancer. That's how I got 'em. I have 7 of them.\n\nEdit: Actually plus another (it's technically 2, but they're right next to each other) for putting in and taking out the port for the chemo.",
   "created_utc": 1691281353,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyvt5n",
   "message": "Chainsaw. Grapefruit knife. Axe. Pen knife. Hockey stick. Hockey skate. Lacrosse ball. Pavement. Tree. Scalpel. Tattoo gun. Dog bite. Broken glass. Extension ladder. Lava lamp. Bike chain and sprocket. Fire. Broken automobile A-pillar. Barbed wire. Human teeth. \n\nWhich one are we talking about?",
   "created_utc": 1691281460,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyvtc5",
   "message": "Divot on my forehead: I was 6 or 7 and wiped out face down in our gravel drive my first day without training wheels. My mom later said I gave her a good scare coming up to the house crying with a bloody face.\n\nTemple hairline: Late may of '92 I fell on the gravel drive when I was 3. I can still remember I was running in excitement because my cousins and I were going to watch Snow White.\n\nThree scars on stomach, abdomen, and ribs: The appendectomy I had in early April 2020 at the start of the covid lockdowns. I had spent the three days prior to surgery with what I assumed was a stomach bug. Turned out in was an appendicitis that burst, turned gangrenous, and gave me peritonitis.",
   "created_utc": 1691281463,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juywqvk",
   "message": "Brain surgery. Oh and one time I was a dumb kid in high school and thought \"breaking a bottle would make me look badass\" and a shard of glass got in my thumb. And when I was three this other kid hit my forehead with a toy gun. Those are my main three",
   "created_utc": 1691281900,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juywyup",
   "message": "I broke both bones my leg in 3 places and had to have surgery to put a rod in my leg",
   "created_utc": 1691282003,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyx2je",
   "message": "Attacked by a dog.",
   "created_utc": 1691282052,
   "score": 3,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy4uxr",
   "message": "Broke my leg as a teenager and had a metal plate inserted. I still get dinged by metal detectors sometimes.",
   "created_utc": 1691269595,
   "score": 4,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juygw63",
   "message": "Ran over by a car. \nBeaten up by first bf.\nBut my favorite is the scar that I have from reaching in the oven to retrieve the potatoes I was baking. 😌",
   "created_utc": 1691274768,
   "score": 4,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy33yc",
   "message": "I was a kid at a wedding reception with my parents when a huge Donnybrook broke out between the two families and I got hit in the forehead with a woman’s high heel shoe that was thrown needing 15 stitches in and above my eyebrow.",
   "created_utc": 1691268876,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy5p3d",
   "message": "Fell asleep with my leg resting on a heater.",
   "created_utc": 1691269935,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy5sgm",
   "message": "Busted the back of my head open when I fell on a cone of hardened ash.",
   "created_utc": 1691269974,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy68pu",
   "message": "I was drunk, got into an argument, and gave my dresser a headbutt. I was concussed and had a gash in the middle of my forehead. Four staples took care of it. I have plenty of scars from doing dumb shit. This is just the one that sticks out the most",
   "created_utc": 1691270166,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy72wv",
   "message": "They're all surgical.",
   "created_utc": 1691270522,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juy87rn",
   "message": "I have this perfectly straight scar on my back and I don't know how I got it, it's perfectly straight, exactly \" __ \"",
   "created_utc": 1691270998,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyaz4v",
   "message": "Witch one and the hard core ones from loosing fights",
   "created_utc": 1691272163,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juybr3l",
   "message": "Bread knife.",
   "created_utc": 1691272493,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyd1gd",
   "message": "I wear my heart on my sleeve.",
   "created_utc": 1691273042,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyhp32",
   "message": "Tried to land london gap with pop shove-it on a skateboard, ripped my whole elbow open.",
   "created_utc": 1691275134,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyidwy",
   "message": "She put a picture frame into my forehead because I wouldn’t let her leave drunk with her car.",
   "created_utc": 1691275436,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyigqu",
   "message": "Stabbed myself while cutting a baguette to make toast. And constantly scratching my own legs to the point where they bleed.",
   "created_utc": 1691275469,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyk1nk",
   "message": "My younger brother (who I’m pretty sure has anger issues) threw a large metal flashlight at me. I now have an inch long scar on the center of my forehead, that bled a lot and was pretty deep, but was eventually fine with butterfly stickers. Luckily, it’s been fading, but my oldest friends still call me Harry Potter on occasion.",
   "created_utc": 1691276134,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyli6i",
   "message": "Was drunk and slipped down my stairs.  My arm got caught in the little newel posts and broke a couple, which then cut my inner bicep to the point I had to get 15 stitches.  Now I just say it was a bar fight……..",
   "created_utc": 1691276746,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juym2j1",
   "message": "trying to cut the top off a Gatorade bottle by stabbing it with a pair of scissors, the scissors slid on the plastic and stabbed my hand\n\nthe other two are from jumping off a pier and subsequently cutting my foot and ankle on something metal in the water (not sure if it was the pier itself or something else on the bottom, it was a lake so couldn't see into it)",
   "created_utc": 1691276988,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juymch1",
   "message": "Kicked a pencil running up the stairs. \n\nBut now I have a awesome grey/black tattoo between my pinky/ring toe where it broke off.",
   "created_utc": 1691277108,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juymqih",
   "message": "Motorcycle store window..",
   "created_utc": 1691277275,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyn28h",
   "message": "Mine are uninteresting- \n\n7 scars on my right hand, all from being 8 years old and not having the strength to open a pocket knife, accidentally cutting myself multiple times\n\nA deeper scar on my elbow from trying to open a slightly stuck door with a windowed portion, shoulder went through the glass which sliced open my elbow\n\nAnd then the standard knee scars from crashing my bike multiple times as a kid",
   "created_utc": 1691277411,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyn85h",
   "message": "I was drunk and face planted on my friend's asphalt driveway. I had to consult with plastic surgeons and had plenty of ophthalmology appointments to make sure I could keep my eye. I don't drink so much anymore.",
   "created_utc": 1691277482,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyp943",
   "message": "Which one? Seeing how I've had 12 surgeries, an abusive male DNA donor, multiple accidents, fights, and a couple of wild nights with certain females - you will need to be more specific. \n\nI'm just thankful I'm still up and about, and able to do what I like.",
   "created_utc": 1691278379,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyph3w",
   "message": "1) Scolding hot caramel\n\n2) Exploding glass jar",
   "created_utc": 1691278479,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyph64",
   "message": "From answering this same question multiple times because it keeps getting asked.\n\nAlso, from a toothy blow job I got from my best friend in Junior Hight.",
   "created_utc": 1691278480,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juypp1p",
   "message": "I jumped off a bridge into a creek when I was younger. I landed, fell backward, and used my hands to catch myself unfortunately there was a piece of glass where I put my left hand and it sliced open my palm. Luckily I didn't permanently damage my hand.\nThere's more but I'd be writing a novel.",
   "created_utc": 1691278580,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyq70s",
   "message": "Slippery soapy stone stairs",
   "created_utc": 1691278815,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyqs27",
   "message": "This post should have been titled....\n\n\"You wanna know how I got these scars?\"",
   "created_utc": 1691279090,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juys0az",
   "message": "I was 8 years old and I was walking down the stairs at my uncle's house. I tripped on the last step and hit the back of my head at the nosing.",
   "created_utc": 1691279667,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyshjr",
   "message": "Which one.",
   "created_utc": 1691279894,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juystgi",
   "message": "By not punching back. I was in middle school let a white boy beat me up. Had to get stitches on my lip.",
   "created_utc": 1691280050,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyswny",
   "message": "Cuz I done goofed",
   "created_utc": 1691280093,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juytijp",
   "message": "Fell off a wagon onto a concrete form. Had knee replacement e.",
   "created_utc": 1691280381,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyvgt1",
   "message": "Compressing garbage in a trash can, mostly paper.  Forgot there was a huge chunk of broken glass in it, sliced one of my knuckles.",
   "created_utc": 1691281298,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juywm6u",
   "message": "Pygmy Rapist.\nHe was a little fucker, about knee high.",
   "created_utc": 1691281840,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juywsoa",
   "message": "Was swinging myself back and forth between two tables using my hands and then lost my grip so I fell on the ground and had to get stitches.",
   "created_utc": 1691281923,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juywxcj",
   "message": "Ran with a banana peel towards the kitchen to throw it away, dropped it, slipped on it and went heads first into the kitchen table. \n\nAt least I've got a \"bad ass\" scar accross my lips now.",
   "created_utc": 1691281984,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyx79e",
   "message": "Leg press machine, didnt pay attention and thought i had put the rack back in to hold the weight but didnt, weight came back on me grazing skin off knee before hitting abdomen.",
   "created_utc": 1691282113,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyxjka",
   "message": "Which one? The two cancers or the or the cardiac bypass?",
   "created_utc": 1691282272,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyxkdy",
   "message": "Which one? I've got SH scars on my triceps, one on my wrist, cigarette burns on arms and legs, and one from elbow surgery. Probably plenty more that I'm forgetting.",
   "created_utc": 1691282283,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyxobx",
   "message": "A cat bit me on the finger and then yanked its head, I could see the bone",
   "created_utc": 1691282334,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyxp5v",
   "message": "When I was ten or so I was cutting friction tape off of my hockey stick with a pocket knife. The knife got stuck, then slipped and went right through the center of my palm. \n\nWhen I was a teen I was a burner - I would burn my forearms with lighters. Disposables on the left arm, Zippos on the right. One of the disposable scars is in the shape of a football helmet. The Zippo scar is a jagged crescent.\n\nAnd then there's the scars that people don't see - one on the underside of each of my babymakers. I don't want to make any more babies.",
   "created_utc": 1691282345,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyxpm7",
   "message": "Attempted suicide/completed self-harm.",
   "created_utc": 1691282351,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyxrof",
   "message": "I was cooking a chicken patty and my dog was very curious as to what was going on in the oven. He nudged me a little bit and my hand went right into the coils at the top of the oven. I didn’t yell at him or anything like that, he wouldn’t understand what he did wrong. But damn is the scar annoying.",
   "created_utc": 1691282378,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyxynh",
   "message": "The one on my left finger I got when I was working at a steel door manufacturing company. I was walking back to my station, didn't have my gloves on, and accidently swung my hand into the bottom edge of the frame, slicing it open. \n\nA few days later, a few coworkers and supervisor were gathered at one of the pressing machines, it was extremely hot and I sweat easily, so I had to take my glasses off to wipe the sweat from my eyes, and tripped over a pallet jack (shouldn't have been there) and almost face planted into the bottom edges of different frames and almost sliced my face open.\n\nNeedless to say, I don't work in hot environments like that anymore.",
   "created_utc": 1691282471,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyxzww",
   "message": "Which one? 🤣\n\n1. On my arm is from my sister. She did all sorts of stupid things to me when we were kids. Once I ended up in hospital because of her. \n\n2. Below my chin is from when I fell on ice.\n\n3. Inside of my knee is from a dog bite.",
   "created_utc": 1691282488,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyy0qf",
   "message": "Spilt soup on my arm as a kid.",
   "created_utc": 1691282499,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyy7e1",
   "message": "Ran headfirst into the corner of an old wooden chest lmao. My gramps and I were roughhousing, and I charged him leading to him jumping out of the way, and me splitting my head open on the chest. Forehead scars stick around forever",
   "created_utc": 1691282586,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyye93",
   "message": "Crazy cat I tried to pet",
   "created_utc": 1691282678,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyyi62",
   "message": "I took noodles out the microwaves and dropped some on my arm and it left a scar",
   "created_utc": 1691282730,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyyjp7",
   "message": "A kid intentionally scratched me during recess when I was in 2nd grade",
   "created_utc": 1691282751,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyynkp",
   "message": "I bought it. About 4000 bucks. SCAR 20s.",
   "created_utc": 1691282802,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyyovt",
   "message": "Abdominal surgery to remove half my liver, gallbladder, bile ducts, and to reroute some plumbing so bile would still reach my intestines (fuck cancer, BTW), then emergency surgery 5 days later to clear an infection (fuck sepsis too) and fix bile leak.  Massive scar about the size of an iPhone on my belly and two closed up holes on my right abdomen for biliary drain bags.  Took 9 months for belly wound to close, two years for drain holes to close (resulting in frequent bile leaks on my right side). \n\n0/10, would not recommend.",
   "created_utc": 1691282820,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyyoyt",
   "message": "9 years old. Broken femur and got a rod inserted and removed. \n\n12 years old. Appendicitis and bad staph infection, 4 surgeries and a month in the hospital it looked like I have an ass crack on my stomach. \n\n13 years old. Broke tibia and fibula and needed 2 screws, then got them removed.\n\n24ish years old. Bicycle pedal to the shin, probably should have gotten stitches but now have 2 lines that don't grown hair and don't tan. \n\n28 years old. Destroyed everything but my rotator cuff and had it fixed.",
   "created_utc": 1691282821,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyysvv",
   "message": "The one between my eyebrows was a piece of broken glass falling into my face when I was at work. \n\nThe one on my arm was a piece of glass jutting out along a path my arms had to travel and I wasn’t wearing my Kevlar properly at the time.\n\nThe one on my knuckle was from having my hand shut in the passenger door of an 80s Astro van. I was 5 for that one. Cried so hard on the way to the hospital that I threw up on my mom.",
   "created_utc": 1691282873,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyyvkn",
   "message": "Had the flu. Went to store to get some soup. Started getting dizzy at the checkout. Fell through the plate glass window at the front of store head first. Ouch.",
   "created_utc": 1691282909,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyywft",
   "message": "fell head first down 13 stairs landing face first into metal chairs. cut my lip open.",
   "created_utc": 1691282920,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyyxgt",
   "message": "I was on a 3rd story balcony that collapsed",
   "created_utc": 1691282934,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyz1l2",
   "message": "Okay so basically when I was in 4th grade I was playing outside with my friends one of my friends said oh we should go to the neighbor hood pool (Not where I got my scar) I was like okay and went in to ask my parents they said yes but wanted to know which pool (North or south) I went up back to her house to ask as she opened her door her dog ran out started jumping at me then but my side I haven’t even met this dog before we hadn’t been friends for too anyways my friends mom came running out and started panicking she brought me back to my house and was crying like gurl you weren’t even the one who got bit got 4 stitches",
   "created_utc": 1691282989,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyz2hi",
   "message": "I have a nice big z shaped scar on my knee. When I was around 4 I was climbing up the stairs/ladder to a slide. It was one of those tall old metal ones that no one makes anymore. M\nI was climbing up alone as my older sister (14) was on the swings with my cousin who was about the same age. They weren't supposed to leave me unattended. \n\nI got to the very top of the steps and someone called out to me and I flinched. It was my dad walking up the road seeing me there alone. I was falling at that point. I felt my leg hit one of the steps going down but I guess it didn't hurt due to adrenaline. It was in slow motion, I fell from about 12 feet high at least. I remember falling even now over 20 years later. You end up inside your own head during those scary moments. \n\nMy cousin still doesn't like me ever since she got in trouble back then 🤣",
   "created_utc": 1691283000,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyz5e3",
   "message": "I dropped a glass bowl while doing the dishes.  One of the sharps flew up and sliced my ankle.  I have a moon shaped scar now.",
   "created_utc": 1691283039,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyz6dh",
   "message": "Fell off of a scooter",
   "created_utc": 1691283051,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyz6sy",
   "message": "Dog bite 😵‍💫",
   "created_utc": 1691283056,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyzdww",
   "message": "Eyebrow: running into a filing cabinet (age 4). \nTooth: falling into coffee table (age 3)\nKnee: sliding on my knee across ice, hit bump (age 7) \nArms: cat (age 23-27) \n🤣",
   "created_utc": 1691283149,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyzmel",
   "message": "Which one? \n\nMy latest was from knee surgery 3 and a half weeks ago. Broken bit of my kneecap removed so the knee could move free-er and with less pain.",
   "created_utc": 1691283259,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyzpui",
   "message": "Had a super abusive, way too much older boyfriend lock me outside of our apartment naked during winter. Broke the window of the door to get back in. Still have the scar on my arm below my elbow.",
   "created_utc": 1691283305,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyzqn5",
   "message": "Responded “sure 🤷‍♀️” to the question “hey can I pour some hot glue on your hand?”",
   "created_utc": 1691283315,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyzrly",
   "message": "On the back of a motorcycle, hit by a car running a stop sign going 50mph. Broke my leg in 2 places and I have had 5 surgeries to rebuild my knee. Scars well earned",
   "created_utc": 1691283328,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juyzxkt",
   "message": "I decided to slam my head on the corner of the sink as a toddler",
   "created_utc": 1691283407,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz07ae",
   "message": "#1 - dirt bike muffler.\n#2 - fell out of a canoe",
   "created_utc": 1691283530,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz07i8",
   "message": "Got a piece of glass right through my hand when I was 3, got a grapevine shaped scar and an irreparable thumb ligament",
   "created_utc": 1691283533,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz0apz",
   "message": "Fell down the cement stairs when I was 4 or 5 and pierced the flesh under my bottom lip with my teeth.",
   "created_utc": 1691283574,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz0cz9",
   "message": "Trying to get OUT of the ice cream truck and the door caught my arm. Gave me a nice keloid.",
   "created_utc": 1691283603,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz0d3a",
   "message": "Which one?",
   "created_utc": 1691283604,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz0mp5",
   "message": "Walking along a brick wall as an 8-year old. Summer, shorts on. Jumped off the wall at the end but misjudged the distance. The corner of the top brick sliced up the back of my thigh. 18 stitches. Hurt bigly.",
   "created_utc": 1691283727,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz0o7x",
   "message": "Thyroid cancer. Traveled to neck lymph nodes and wrapped around a vocal cord nerve rendering it paralyzed after they had to remove the cancer from it. Amazingly, my voice is about 85% back to normal. Pretty good deal considering they prepared me to talk at a whisper the remainder of my life lol. The human body is quite fantastic.",
   "created_utc": 1691283747,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz11av",
   "message": "Which one? \nFace: acne\nWrists: self harm\nWaist: corset (never tuck in the strings and then wear it all day)\nEverywhere else: various dumb activities I’ve done over the years",
   "created_utc": 1691283921,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz14hy",
   "message": "I tried to hop up onto a concrete ledge with metal lining the corners. My shin hit the metal pretty hard and took a small chunk of flesh out. It eventually healed, and now I have a little bald spot on my right shin. I was in 5th grade.",
   "created_utc": 1691283963,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz16an",
   "message": "90s kid. Put legs in my shirt and sat on edge of bed. Fell over while gaming with best friend at the time and knocked my eyebrow on corner of TV stand(so lucky it wasn't my eye). Now I'm missing some of my eyebrow. \n\nBled like crazy. Mom thought I was dying.",
   "created_utc": 1691283987,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz17hg",
   "message": "Have an interesting one on my ballsac as it was torn open when I lost my footing on a deck and landed on a trailer hitch.",
   "created_utc": 1691284003,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz1c0t",
   "message": "I was in St Lucia, South Africa, which is a coastal town. I was warned by the tour bus driver not to swim on the left side of the beach as there is a massive undertow that will absolutely wreck your day. I had swum competitively for over a decade at that point and felt fairly confident that I didn't need to worry. \n\nI, dear reader, was very wrong to be so confident. \n\nI was not paying attention and got sucked into that undertow, my top half being pushed forward while my bottom half was being sucked backward. The rest of me got sucked under and awaaaaay I went. Being crushed by a pounding wave, my head was wrenched backward and it literally touched my ass. My body, which was not flexible, made an O shape. Thankfully, my forearms caught most of the damage from the impact with the sand as I was slammed into it. \n\n\nSomehow, I made it back to shore, very sure I had broken my back. I, thankfully, did not,  but as I stood up, the fleshy side of my forearms started just leaking blood. The rest of my time in SA, I had to wear long sleeves because they were protecting the guaze that was protecting my disgustingly scabby arms. \n\nAnd that's how I have two identical scars on both of my forearms. \n\nThis is why we listen to locals and respect the ocean. It'll humble you pretty damn quick.",
   "created_utc": 1691284061,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz1hfv",
   "message": "Jumped into a hot pit of ash thinking it was a sandbox when I was 3 years old. Burned 30% of my body and almost lost my feet. Made for a good story and gave me great content to tell my therapists, though",
   "created_utc": 1691284135,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz1jpv",
   "message": "I got one on my forehead. 7 stitches because I was playing hookie. Went to dive back into my bottom bunk of my bunk bed, and hit the top bunk and split it wide open. Yeah, my dad wasn't happy about that.\n\nGot a smallpox scar from vaccination about 15 years ago.\n\nHad 2 stitches put in my shin after I had a massive fish hook embedded in it when I went like fishing...",
   "created_utc": 1691284165,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz1lnt",
   "message": "I was holding my cat and she became startled, resulting in a 3-4 inch long scratch from her back claws and a forever scar lol. Those back claws hurt so much more than the front ones!",
   "created_utc": 1691284190,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz1ni5",
   "message": "Which ones",
   "created_utc": 1691284213,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz1ooy",
   "message": "Self cutting 25+ years ago. Still have scars all over my forearms.",
   "created_utc": 1691284228,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juz8mvz",
   "message": "I was trying to bathe a cat",
   "created_utc": 1691287549,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juzai76",
   "message": "Was feeling meh and had excruciating pain on my left side. Got in the ER. ER didn’t bother doing an ultrasound and sent me home with antibiotics for UTI. Physician sent me for an ultrasound. Ultrasound tech went all pale and silent. Sent me to have a PET SCAN. Thirty centimeters cyst had taken over my entire lower abdomen. 3 days in ICU and a solid laparotomy later, I have a vertical monstrosity of a scar on my entire abdomen (they used absorbable sutures that my organism devoured in days and had them redone three times). \n\nOn a smaller scale : \n\nfight against a cat. The cat won. \n\nfight against a hot oven. The oven won. \n\nfight against an escalator. The escalator won.",
   "created_utc": 1691288467,
   "score": 2,
   "submission_id": "15j5kc1"
  },
  {
   "comment_id": "juzne3o",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15j5kc1"
  }
 ]
}