{
 "submission_id": "15jc89r",
 "title": "What is one positive memory you have from during the COVID lockdown(s)?",
 "selftext": "",
 "created_utc": 1691283851,
 "permalink": "/r/AskReddit/comments/15jc89r/what_is_one_positive_memory_you_have_from_during/",
 "score": 88,
 "url": "https://www.reddit.com/r/AskReddit/comments/15jc89r/what_is_one_positive_memory_you_have_from_during/",
 "comments": [
  {
   "comment_id": "juzcrr1",
   "message": "My kids moved into a tent in the backyard and stayed out there for a few months. My son would go surfing in the morning while I logged him into attendance at school.  He'd come home, eat breakfast and then do school work.  My daughter and I started an Animal Crossing island together.  I would stay up late catching SOOOO many fish and then leave them in aquariums on her front lawn so she could sell them and buy whatever she wanted for her house.  I spent more time with my kids since they started school.",
   "created_utc": 1691289597,
   "score": 64,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz1239",
   "message": "I'm a giant introverted homebody. Lockdown was great for me. Got to work remote full time and thankfully I didn't lose anyone close to me from it.",
   "created_utc": 1691283931,
   "score": 117,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz4tlm",
   "message": "The traffic going to work was wonderful.",
   "created_utc": 1691285715,
   "score": 76,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz5iml",
   "message": "An excuse not to go visit my annoying extended family",
   "created_utc": 1691286042,
   "score": 35,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz6ln1",
   "message": "It led to me working from home full time, so I got to spend the last three years of my dog's life at home with him every day. Many of my lunch breaks were spent taking him to a nearby beach to go swimming during the summers.",
   "created_utc": 1691286559,
   "score": 23,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzdrsz",
   "message": "My wife and I had lots of sex.",
   "created_utc": 1691290102,
   "score": 28,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzd2c2",
   "message": "I stayed home, played video games, got high, and the news said I was a HERO for doing so.",
   "created_utc": 1691289744,
   "score": 18,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz79hu",
   "message": "I'm an IT repair tech. Most of the offices I work in were either barebone staff or empty completely, but I still had to work on the computers there since people were remote connecting. I was working in one office with only two people, but one of them brought her dog because nobody else was around. Well, I love dogs and they love me; he came over, gave me a sniff and laid down on my feet.",
   "created_utc": 1691286879,
   "score": 18,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz1zle",
   "message": "Christmas 2020 I think was a my favorite.   No rushing to go anywhere, no extra people to cook for, just my family.  It also snowed, 8-10 inches, which we rarely get here.  We opened presents, went sledding, had hot chocolate, and watched Christmas movies.  It was great.  The only good thing about that year.",
   "created_utc": 1691284372,
   "score": 34,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz0z7v",
   "message": "There was so much OT at work in 2021. I made 6 figures for the first time in a very long time.",
   "created_utc": 1691283892,
   "score": 17,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz7ilh",
   "message": "In march 2020 I found out I was pregnant after over a year of trying (donor pregnancy).  That was the last month we were going to try until we figured out what was going to happen with Covid.\n\nI actually thought I had Covid when I found out. I felt sick. But like a sickness I had never felt before. After taking Tylenol, not having a fever, etc, I took a test randomly after my shower- I hadn’t missed my period yet. It was blazing positive. \n\nI got to grow and be very pregnant at home and not be expected to work/continue living life. \n\nWhen I gave birth in nov 2020, I had the best hospital experience. No family visits right away, just my baby, partner and I.",
   "created_utc": 1691287005,
   "score": 32,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz8ys1",
   "message": "No pressure of doing anything crazy or bar related for my 21st. I sat on the floor in my basement bedroom and drank a bottle of wine with my boyfriend as we played oblivion on my Xbox. It was a lovely time.",
   "created_utc": 1691287707,
   "score": 13,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzb02b",
   "message": "The quiet. Very little street traffic.",
   "created_utc": 1691288713,
   "score": 10,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzaop5",
   "message": "I got laid off pretty early on. I had been on the edge of a nervous breakdown right before that and I remember getting the email that morning and feeling the biggest sigh of relief...\n\nLong story short, I got a several months long basically paid vacation to hangout at home with my son until getting another job offer.\n\nI loved lockdown.",
   "created_utc": 1691288553,
   "score": 9,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz4vt4",
   "message": "How much money I was able to save.  I bought a car in February of that year and my first stimulus check I paid it off.  The second and third ones I honestly didn't even need at the time and I just saved it, it took me well over a year, actually almost two years, before I needed that money.\n\nBut of everything wrong with that time I financially did extremely well.  While I of course don't miss the pandemic I do miss the financial security I had",
   "created_utc": 1691285744,
   "score": 9,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz9vbu",
   "message": "I didn't wear pants for two years. Only shorts.",
   "created_utc": 1691288148,
   "score": 8,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz9byn",
   "message": "We had an Orphan’s Christmas for people who couldn’t travel to see their families. We got lucky in terms of visiting bubbles and grocery supplies, so we cobbled together a little feast. Made a Christmas tree out of rubbish and milk crates from a nearby alley. It was really sweet.",
   "created_utc": 1691287887,
   "score": 8,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz3j79",
   "message": "A lot of quality time with kids.",
   "created_utc": 1691285104,
   "score": 5,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz1kl0",
   "message": "My brother snuck up behind me while I was talking to my friend who's a doctor, and pulled down my pants and underwear to try and embarass me by exposing my bare penis shaft. \n\nWell instead of just insulting it's size (He did, it was devastating) he also told me that I most likely have tissue damage down there, which is why it's a light grey/purple color. I had no idea. Because of that information, I got surgery to fix it and I am happy to say today my penis is now semi-functional again. All because my asshole of a brother tried to embarass me.",
   "created_utc": 1691284176,
   "score": 15,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzhay8",
   "message": "I'm that dude who likes a buffer between me and strangers while sitting, whether it be planes, sporting events, bars, movies, etc.\n\nThe period where virtually all establishments were requiring people to space out was GLORIOUS.",
   "created_utc": 1691291885,
   "score": 5,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzaea4",
   "message": "Saved enough money from not eating out or travelling to retire at 50 (instead of 55) and enter law school.\n\nMy wife was on a 6 week trip through SE Asia and literally got one of the last planes home in March 2020.",
   "created_utc": 1691288413,
   "score": 10,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzdmns",
   "message": "Connecting with friends over zoom. We hosted virtual beer pong tournaments and parties with friends all over the country. Hard times brought everyone closer.",
   "created_utc": 1691290030,
   "score": 3,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzdkwe",
   "message": "Going to the store, seeing morons taking up the whole aisle with their carts, and being able to mouth calling them a dumbass under the cover of my mask\n\nI still do it without the mask these days though",
   "created_utc": 1691290005,
   "score": 6,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz1267",
   "message": "Working in a public building that was usually packed and being basically empty.  God it was amazing.",
   "created_utc": 1691283932,
   "score": 3,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz14rv",
   "message": "My first week spent gaming with my buddies 24/7. It was so fun. Became less fun as time went on :/",
   "created_utc": 1691283967,
   "score": 3,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzfw7c",
   "message": "I got about 3 months off of work.  That was the longest time I haven't had to work since I was 15.  I was able to stay home and do things that I actually wanted to do.  Hell, I bought and restored a Honda Goldwing during that time.\n\nI wouldn't want to live through another pandemic, but those 3 months were amazing for my mental health.",
   "created_utc": 1691291180,
   "score": 3,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzji5i",
   "message": "Spending an incredible amount of time with my spouse. We had both just retired. He died of cancer a year ago. I’m grateful for that time together.",
   "created_utc": 1691293031,
   "score": 3,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz3suc",
   "message": "How peaceful and quiet it was to walk my dog outside and not see a single soul. Pretending like we were the only ones in the world.",
   "created_utc": 1691285232,
   "score": 5,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz7ao9",
   "message": "People staying six feet away (in lines, etc). Now they're right back to standing in my personal bubble.",
   "created_utc": 1691286896,
   "score": 6,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzbbk4",
   "message": "Playing in the mud with my kids.  We lived right next door to a town park. My oldest was 5.5 and my youngest was 1.5. I was already a stay at home mom and my husband was able to work from home so we were very fortunate.  The pressure was off me to socialize and get my kids in to programs and social stuff. It was an amazing feeling.  We spent the first weeks of Covid exploring the park- the playground was taped off so the kids dug in the dirt and poked around with sticks and went up hills and down hills and collected rocks and moved boulders around and wrote in the gravel paths… I miss the lock down sometimes.",
   "created_utc": 1691288876,
   "score": 4,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz3wc2",
   "message": "I have 2.  I think I speak for a lot of people that we all had time to clean our houses out of clutter, dirt and grime.\n\n2nd is that my job was considered an essential business so I got to stay open so long as I followed state protocal.  We would have gone under had that not been declared.  Lots of people needed to get their precious metals to sell to pay their bills because they weren't working.  So sad for those in the beginning that could not get into their safety deposit boxes.  Some banks at least allowed appointments after a couple of months.",
   "created_utc": 1691285279,
   "score": 2,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz52c0",
   "message": "Not having to commute to uni.Saved me so much time and money",
   "created_utc": 1691285829,
   "score": 2,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzacif",
   "message": "work in ED, got lot of free stuffs from companies, shoes, jackets, back packs + restaurants in the area sends us meals. i made a lot of money during the pandemic than any other times in my career lol. i live in the city, i ran daily, city almost looked like abandoned. i missed the city during this time when there were only a few people around.",
   "created_utc": 1691288389,
   "score": 2,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzb2z7",
   "message": "Driving to the office to pickup and redistribute paychecks into FedEx envelopes to our frontline workers with a letter of authorization from the company to be allow me out during lockdown and seriously enjoying **NO TRAFFIC**!",
   "created_utc": 1691288754,
   "score": 2,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzhanz",
   "message": "I got accepted to my dream university right before the pandemic hit. And so, in the middle of the pandemic, I moved to a BEAUTIFUL small town where my university is and I've loved it since. First year wasn't so fun at my university though, with it being almost completely online, but still, I really enjoy where I moved to\n\nOh! Also started Doordashing during the pandemic. And I found I can make noteably more than minimum wage doing so. Worked great around my school schedule!",
   "created_utc": 1691291881,
   "score": 2,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzk86d",
   "message": "I utilized that time to focus on myself and mental health. I started doing projects I've been putting off like making ukuleles in my garage, writing music, and listening to great music. Not a day felt wasted. That and I did shrooms for the first time. It was incredible.",
   "created_utc": 1691293422,
   "score": 2,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz9d25",
   "message": "I lost 70 lbs by just going outside and working out on the lawn and changing my diet because a lot of places shut down. Also got me going to my career and a love of the national parks too.",
   "created_utc": 1691287903,
   "score": 3,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz3sab",
   "message": "The cartoonist Simon Hanselmann posting new panels in an ongoing lockdown-related story on his IG. It’s hilarious and obscene, and it made my life feel less horrifying by comparison.\n\nA bunch of characters invite themselves to quarantine at one character's house, and it’s nightmarish but silly.\n\nOne of them takes over the living room so he can make money shoving increasingly-larger dildos up his butt on cam. One character orders the Animal Crossing game that had just come out, and retreats to the garage to escape the real world and play AC nonstop.\n\nIt seriously brightened a dark time in my life. It was eventually released as Crisis Zone.",
   "created_utc": 1691285225,
   "score": 2,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz50fq",
   "message": "When it ended",
   "created_utc": 1691285805,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz1bmx",
   "message": "Among us. So much Among us.",
   "created_utc": 1691284057,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzagk1",
   "message": "I loved it. Got a raise and then a promotion during the whole thing. I miss that time, tbh, but im practically a hermit. Good times.",
   "created_utc": 1691288444,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juztn05",
   "message": "Almost everything about it, could use another lockdown - I miss it",
   "created_utc": 1691298838,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz9nnm",
   "message": "The small spark of hope that enough people would die so the housing market would collapse and I could own a home if I made it through.",
   "created_utc": 1691288046,
   "score": 0,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzfnbc",
   "message": "I’m a huge introvert so I enjoyed being inside! I played a lot of animal crossing and colored lol",
   "created_utc": 1691291058,
   "score": 0,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz3ird",
   "message": "Adrienne and I never skipped a beat. Traveled internationally. Business as usual. Never so much as a sniffle.",
   "created_utc": 1691285099,
   "score": 251,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzfknh",
   "message": "I found the inner strength to stand up for myself and protest the authoritarian response to the virus.",
   "created_utc": 1691291021,
   "score": 251,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz1040",
   "message": "[deleted]",
   "created_utc": 1691283904,
   "score": 247,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz3frg",
   "message": "I got a lot of raises. They were handing them out constantly at my job because people were leaving in droves.",
   "created_utc": 1691285059,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juz9geb",
   "message": "I got a raise.",
   "created_utc": 1691287948,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juza6d8",
   "message": "There was hardly anyone outside and no traffic. I liked the dystopian commute to work.",
   "created_utc": 1691288305,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzb6op",
   "message": "Nice drives and getting back in shape.",
   "created_utc": 1691288805,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzb81l",
   "message": "work was slow most of the time and i could just go on my phone and eat cheetos at my register. this was home depot and it was crazy at first because of the whole toilet paper thing. we still had customers ofc just with the whole social distancing and masks. as a hypochondriac i appreciated how serious the cleaning was. ofc i live in a red county and constantly got told to fuck off for asking them to use masks (PEAK COVID. it wasn’t like when it was optional) but as an introvert i liked how i didn’t have to deal with places being as packed. gas prices were the lowest they’d been since i was 4. obviously it was a very horrible thing that happened and so many people suffered and died because of it and i wish it never happened but there were a few minor perks",
   "created_utc": 1691288825,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzeenm",
   "message": "Me and the boys spent the first 2 weeks of lockdown together at one house. Played video games, went fishing, had boxing matches. Good times.",
   "created_utc": 1691290418,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzepjm",
   "message": "Gaming was at a prime",
   "created_utc": 1691290575,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzfysu",
   "message": "I actually had time to finish a whole cup of coffee before work!",
   "created_utc": 1691291215,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzg5hc",
   "message": "I passed the CPA exam with no distractions.",
   "created_utc": 1691291311,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzg95q",
   "message": "I got quite sick in August of 2021, unrelated to covid. I went back to working in the office full time in September of 2021. The next year and a half was torture trying to manage my illness, work and a “post covid world” I had surgery in Feb 2023 and everyone expects me to just be perfectly fine now despite still dealing with complications around my illness. I miss working remote, where I could rest as needed, wear comfy clothes, not have to commute, and not feel obligated to attend social gatherings. I struggle with feeling guilty if I need to stay home on certain days, I regularly reminisce about early covid and how much easier it made my life. I love what I do, and my role is hard to be 100% remote, but I do sometimes contemplate looking for a more remote-flexible job.",
   "created_utc": 1691291362,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzgjfq",
   "message": "The time I didn't spend commuting, I used to study for the PE. I spent the two hours a day that I'd normally spend on commuting studying, so even though I was studying a lot, I still had a relatively good work-life balance.",
   "created_utc": 1691291497,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzh0d9",
   "message": "It really was peaceful, quiet and helped lower my stress and anxiety levels. My depression also wasn't as bad, either.\n\nLockdowns were great for me.",
   "created_utc": 1691291735,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzh0e4",
   "message": "The only honest answer is people on unemployment getting 600 bucks a week to do absolutely nothing. It was more than they were making before.",
   "created_utc": 1691291736,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzh8fm",
   "message": "Husband works from home and I'm a front line worker. \n\nMy husband has a much deeper and better relationship with our children after two years of on/off homeschool.",
   "created_utc": 1691291849,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzh919",
   "message": "Realizing how short life is and tomorrow isnt promised so do things you enjoy while you can.",
   "created_utc": 1691291858,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzhp95",
   "message": "Cooking over a fire with my wife in our backyard. We bought our house in 2019 and spent 2020 getting it ready. Used the stimulus on new countertops(the old ones were white tile...) Got the yard set up. Planted Trees. Built a closet organizer. It was great. We were both still working. I clocked hours every day for the first month of lock down, and she did therapy sessions from home, but we still got to spend so much time together. It was great. And somehow neither of us ever got Covid, which is insane because my weekends were spent doing CPS pop ins on at risk families for like 6 months.",
   "created_utc": 1691292089,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzijyk",
   "message": "The smog cleared and the sky was blue.",
   "created_utc": 1691292529,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzir6j",
   "message": "I was able to get in the best shape of my life during covid. \n\nHad so much free time and being stuck in my apartment building for a year, might as well get ripped.",
   "created_utc": 1691292634,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzixck",
   "message": "I got engaged!",
   "created_utc": 1691292721,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzj0gy",
   "message": "So many positive memories. I love my space and quiet and just getting to do my own thing all day. The most memorable thing was seeing the smog clear enough around my city after two successive lockdowns, that I could see the entire mountain range outside it for the first time in maybe 20+ years.",
   "created_utc": 1691292767,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzjgn6",
   "message": "Pretty much everything. The best time of my life. Got free money from the government for being self-employed. Was able to spend my days with parents (Dad passed away a year later). Played video games all day and made a large dent in my backlog. I've been doing gig apps for 5 years and during COVID the tips were great. I was actually making a livable wage.",
   "created_utc": 1691293009,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzjsr1",
   "message": "Getting my cat.\n\nDecember 10th, 2021\n\ni was going on a walk to see if i could spot any Christmas lights that early in December.\n\n\u0026amp;#x200B;\n\non the way home, there was this brown, black, and white tabby cat on the other side of the street.\n\ntook her home, fed her, and she never left.\n\npoor baby's stunted though. she was starving out there.",
   "created_utc": 1691293192,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzjtjs",
   "message": "I got to observe my 5 year old learn how to read in online kindergarten while I worked right next to them.",
   "created_utc": 1691293204,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzkcp9",
   "message": "Theme parks.\n\nHaving an annual pass at Disney while it opened back up under Covid restrictions was *phenomenal.*\n\nI have never experienced Magic Kingdom as empty and peaceful as it was. Quiet, spacious, and scenic. No kids screaming or people tripping over each other.\n\nWe will likely never witness Disney in such a state ever again. It was a blast while it lasted. Now it’s like nothing ever happened, but the experience is worse.\n\nI’m a firm believer in the conspiracy that Disney used Covid as an excuse to temper entertainment and cut costs within the parks. It’s why the parks feel so much more lifeless now. \n\nThe magic really is at risk. All I see are their desperate attempts at the tourist’s wallet, instead of actually trying to provide an unforgettable experience.",
   "created_utc": 1691293491,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzkhcx",
   "message": "me and my friend tried to plan a quarantine party to “stick it to the man”. we were freshman and thought we could be the definition of anarchy. we created playlists. pinterest boards. plans. invitation. the whole shebang. we went all out. it was a lot of fun. we never actually threw the party but planning it was fun to do since it was all online",
   "created_utc": 1691293561,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzknnm",
   "message": "My hs halo crew all bought xboxes with halo. We played every Friday for a year straight like it was 2006 again",
   "created_utc": 1691293654,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzkp21",
   "message": "I was able to sleep in, spend time with my family, de-stress and enjoy myself. And as many people began gaining weight being home all the time, I actually applied myself and lost 30lbs.",
   "created_utc": 1691293675,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzkpgp",
   "message": "I got to see all the little fascists come out of the wood work.",
   "created_utc": 1691293682,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzkrov",
   "message": "It was honestly pretty awesome for me. I recognize it was a horrible thing for the majority of people and I don’t invalidate that, but candidly for me it was paradise.\n\nI had received about $7500 in scholarships for my month long capstone field course in geology that was scheduled for April that I was DREADING, and it got cancelled. The best part is, is all those scholarship foundations let me just keep the money. In addition, I was still being paid by my employer while we were closed. \n\nNow I don’t say this in a bragging way, but up until this point I had been poor as FUCK for the last several years. Many times I had to eat only peanut butter, only saltines, or sometimes sleep for dinner. \n\nAt first it was up in the air whether my job was going to pay me or if my scholarships would get pulled back, and I was just about fucked. If that had happened I straight up would have had to go live in my car. I was terrified. \n\nSo when I got this money, I finally had *some* financial stability and bonus, now I could do whatever the fuck I wanted for three months, whereas the previous four years I had gone months at a time without a single day off between school, research, and work. \n\nI loved it.",
   "created_utc": 1691293714,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzkuly",
   "message": "I enjoy everything. It was sad to see all the city people loose their effin minds. The whole thing cost me nothing. My life was completely unchanged. The aftermath has affected me more. Gas prices. Animal feed is tough.i raise 90% of what I consume.",
   "created_utc": 1691293757,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzkyl7",
   "message": "Alcohol to go and the great deals on takeout.",
   "created_utc": 1691293815,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzl2jy",
   "message": "Aside from being homeless for a bit and having to rebuild from nothing, it was all fine because I had a really amazing person to endure it with.  I felt so lucky in that way as a lot of people didn’t have that and got pretty isolated.",
   "created_utc": 1691293874,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzl55g",
   "message": "Getting a new dog",
   "created_utc": 1691293911,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzlg1d",
   "message": "I was able to really get to know my new boyfriend at the time. We had a good routine of him finishing working from home, making dinner together, actually eating at the table and talk, the. play cards while watching the news. It was unlike any other relationship I've been in.",
   "created_utc": 1691294073,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzlim9",
   "message": "My 2 girls were wonderful adapting and learning through various situations. Then my wife decided to give us a 3rd girl.",
   "created_utc": 1691294112,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzljxx",
   "message": "Clear skies, no contrails.",
   "created_utc": 1691294132,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzlkgf",
   "message": "Being home bound during lockdown with my 3 grandchildren and my husband. I’m a homebody anyway so lock down didn’t bother me.",
   "created_utc": 1691294139,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzltch",
   "message": "Quarantined with new gf for months",
   "created_utc": 1691294269,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzm70d",
   "message": "Finally got to sleep a much as I needed to. It was great.  Got to take care of my garden.",
   "created_utc": 1691294473,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juznpfx",
   "message": "All of those things I was planning to watch “someday”",
   "created_utc": 1691295281,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juznutk",
   "message": "Getting paid to work from home",
   "created_utc": 1691295363,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juznxrn",
   "message": "I love working from home and never had the opportunity before",
   "created_utc": 1691295408,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzo6e9",
   "message": "Not having to deal with other peoples’ bullshit. I liked just being alone in my room.",
   "created_utc": 1691295541,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzoiyd",
   "message": "The total lack of stress. No dealing with work bs. Bills were still getting paid. I got into a nice sleep schedule, enjoyed my coffee in peace every morning, caught up on some video games, went on walks. No real obligations, just enjoying my free time guilt-free. It was the most peaceful few weeks I've had in a long time.\n\nNow I just buy the odd lotto ticket here and there to kept the dream alive that I'll get back to that happy place again some day 🙃",
   "created_utc": 1691295736,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzolm5",
   "message": "Witcher season 1. Uh, masks \u0026amp; social distancing. How pro introvert everyone was for a little.",
   "created_utc": 1691295777,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzp978",
   "message": "I had a subaru wagon, i would take my son and our dog and  drive out to a restaurant in the country that made a drive thru, and get ice cream sundaes and just sit at the edge of a field and picnic in the back while listening to music.",
   "created_utc": 1691296156,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzpb02",
   "message": "Unknowingly getting to spend the last few months of my cat's life working from home with him by my desk side 24/7.",
   "created_utc": 1691296186,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzpvjb",
   "message": "During the beginning it felt like we were all in this together, working on artistic projects, watching tiger King, doing zoom calls with friends, then summer hit and politics happened, with the BLM bullshit and people saying covid was fake and not wearing masks",
   "created_utc": 1691296515,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzq02c",
   "message": "I could spend much more time with my family 😀",
   "created_utc": 1691296588,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzq16d",
   "message": "Can it be a pop culture memory? Late night hosts doing their shows from home felt so surreal.",
   "created_utc": 1691296607,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzq4g4",
   "message": "It was all terrible for me I guess the good part  wads a woman named Jennifer who really jumped through hoops for me to get  me housed. Where everyone else was some beuracatic red tape; sorry you live outside our service area etc etc etc. Another woman in San Francisco, also named Jennifer for some reason who helped me with legal paper work even though I didn't live in sf.",
   "created_utc": 1691296659,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzq7mx",
   "message": "It was a fun time trading stock options with everyone :)",
   "created_utc": 1691296714,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzq8c0",
   "message": "Moving in with my girlfriend (now wife) and cooking every meal together.",
   "created_utc": 1691296725,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzq9vc",
   "message": "There were no positive memories for me whatsoever.",
   "created_utc": 1691296750,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzqb3h",
   "message": "I managed to save quite a bit of money when the Malaysian government provided a 6-month loan pause or moratorium for housing and cars in 2020. They did it again in 2021. All it took was replying to a bank SMS with a yes or no for approval. However, now I'm starting to feel the impact of the high interest rate.",
   "created_utc": 1691296769,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzqcza",
   "message": "Though moments of it were difficult. Had I not been furloughed I wouldn't have gotten to spend the time home I got to spend with my kid. We went for walks every day.",
   "created_utc": 1691296801,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzqder",
   "message": "Grocery shopping was way better.",
   "created_utc": 1691296808,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzqene",
   "message": "Watching real housewives new york",
   "created_utc": 1691296828,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzqw2m",
   "message": "Low gas prices.",
   "created_utc": 1691297119,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzqxql",
   "message": "I was contracted by a school district doing IT work at the beginning of the pandemic and lockdown. Because police were busy basically re-enforcing the hospitals and the test centers and the grocery stores like it was the end of the world, there were no cops on the freeway.\n\nSo yeah, going 100MPH+ everywhere on empty freeways, except for the random sports car going 150MPH+, was the best part.\n\nThen I was told the job offer said contract originally included would not be offered because of the lockdown, and it was no longer fun as I spent the rest of 2020 working more hours per day trying to get a job than I do at my current job.",
   "created_utc": 1691297147,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzr0pa",
   "message": "My drive to work. HOOOOOOLLLY people can't drive. But it sure was great when there were barely/no cars on the road. Even now since I live in an area that is majority RV's and the RV industry is taking a hit, my drive is kinda' nice during certain mornings of the week.",
   "created_utc": 1691297199,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzr0ra",
   "message": "I got participate in the animal crossing new horizons hype and play a lot of BOTW",
   "created_utc": 1691297199,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzrdmw",
   "message": "The free checks from the government, plus getting to relax for 5 months",
   "created_utc": 1691297418,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzrizt",
   "message": "My friends and I started playing A LOTTTTTT of Minecraft. Would run a Group FaceTime while playing mobile, and my phone felt like it was going to melt my hands lol",
   "created_utc": 1691297509,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzrkfd",
   "message": "Spent a lot of time with my kitties. Graduated high school.",
   "created_utc": 1691297533,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzrwlu",
   "message": "I actually can't narrow it to just one.\n\n\\- Lots of gaming, both with friends and solo. A particular highlight is beating the first The Evil Within.\n\n\\- I lost so much weight, mainly through CICO. Went from about 220 lbs to 180 lbs in 6 months! I don't know what exactly gave my my drive, but I was determined to stick to my diet.\n\n\\- With great care, after the initial wave, being able to still go out and shop/eat/hang out with friends and family. It's like when I was still on dial-up, yet I got so much done with it.\n\n\\- Getting vaccinated! It was satisfying to test out this \"futuristic\" new mRNA vaccine and help out the community. Also, to stick it to those antivaxxers.",
   "created_utc": 1691297745,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzsa0r",
   "message": "I lifted weights at a gym and not another living soul was in sight. I was laid off but my roommate/landlord didn't have to pay the mortgage for the majority of covid, so we just hung out, games and got wasted.",
   "created_utc": 1691297981,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzsltu",
   "message": "Exercising in my room and watching my progress.",
   "created_utc": 1691298189,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzsnz7",
   "message": "Watching Naruto 😁",
   "created_utc": 1691298225,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzsr31",
   "message": "Started dating my girlfriend during covid. Best thing to come out of that mess",
   "created_utc": 1691298278,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzsws0",
   "message": "playing animal crossing and hanging out with my family! meeting my now ex (online) and having an animal crossing first date. it feels terrible to say, but i look back on the lockdown era so fondly",
   "created_utc": 1691298380,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzt2tn",
   "message": "Was a big \"mask-off\" moment (please forgive the pun) to see what people, businesses and institutions were just completely full of shit. It sounds bad, but this was actually the catalyst I needed to switch careers and I've been infinitely happier ever since.",
   "created_utc": 1691298484,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzt4lr",
   "message": "Mask mandates came along just in time for my 3 surgeries to remove most of my nose, then reconstruct it due to a cancerous tumor.",
   "created_utc": 1691298516,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juztbbo",
   "message": "Driving was so much fun because there were less cars on the road. And I was less hesitant to speed because I assumed cops wouldn’t really want to pull me over and risk getting infected.",
   "created_utc": 1691298633,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juztbxm",
   "message": "Junk walks. My kids wanted to bake cookies all day, make muffins, eat popcicles, ice cream drumsticks. Fine, you can have junk food if we walk. We would grab the junk food and walk for an hour talking, joking, looking at flowers, playing at abandoned parks, going through empty office parks. We saw every street in our neighborhood and the surrounding ones, ate yummy food, and bonded.",
   "created_utc": 1691298643,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juztu73",
   "message": "I met my wife.",
   "created_utc": 1691298966,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juztzn7",
   "message": "We got to see how quiet and beautiful the world could be. Nothing like driving down the interstate or downtown in a major city and seeing next to nobody. That was nice.",
   "created_utc": 1691299065,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzu7ta",
   "message": "My wife and I managed to buy our first house in the summer of 2020. This was before the house prices really went crazy. We wouldn't have been able to get it without my VA loan and the sellers agreeing to pay closing costs. We got very lucky. $275k for a 5-bedroom, 3 full bathroom house that was only two years old.",
   "created_utc": 1691299211,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzua21",
   "message": "Since local musicians couldn’t perform in at their usual venues, many volunteered or hired  for driveway gatherings. Often we’d be out walking and could hear singing or bands performing. We also drove between CO and Phx in 11 hours (one day)  during summer 2020. Now it takes us nearly 20 hours with traffic and road work and we have to split it up over two or three days.",
   "created_utc": 1691299251,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzudpk",
   "message": "Many. \n\nI am an ER doctor so it got pretty rough but it was also amazing to be in the middle of the storm.  \n\nWe worked hard as a family to keep hope up early on when it looked really bad.  Bible verses every night, good songs (esp  Simple Man cover by Caitlin Koch) and the Lord of the Rings line from Frodo and Gandalf:  \"“I wish it need not have happened in my time,” said Frodo. “So do I,” said Gandalf, “and so do all who live to see such times. But that is not for them to decide. All we have to decide is what to do with the time that is given us\"\n\nMy very favorite memory is when my wife get her first vaccine - I finally felt she was safe from me bringing him the virus.",
   "created_utc": 1691299315,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzuej5",
   "message": "My son was born a couple weeks before everything was shut down… working from home, with my wife on maternity leave, gave me a lot of valuable family time that I wouldn’t have had otherwise.",
   "created_utc": 1691299330,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzujw7",
   "message": "Learning DND with my kid and my partner. It was a cozy, quiet time. Scary and weird, too, but some bright spots.\n\nI also liked seeing how nature immediately started moving in on our cities the minute less people were around.",
   "created_utc": 1691299427,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzuz84",
   "message": "Because I still had to drive to work. Which is 30km 1 way.\nThe drive was BLISS. No traffic was a dream for me.",
   "created_utc": 1691299703,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzv34z",
   "message": "i was fishing an average of 8 times per week, it was PARADISE, lol",
   "created_utc": 1691299775,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzv5sd",
   "message": "I got my second oldest dog Thomas. He's a pug, given the choice I would have not picked a pug because I am one of the many people who wish they were able to breathe correctly. But my dad got him for me, so if I have him, I may as well take care of him for as long and as best as I can to make his life as better as it can be.",
   "created_utc": 1691299823,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzvb6l",
   "message": "Sleeping in because of working at home (I am very very grateful it is not \"sleeping in because of being let go from my job\").",
   "created_utc": 1691299922,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzvd4z",
   "message": "The only beer I (40m) ever had with my dad (74). \n\nWe were doing yard work together (he was pretty active) and took a five minute break. Happened to have two cold beers nearby, so we shared.\n\nLater realized it was the first drink we’d ever shared and the last we’d ever share (he passed away about 18 months later). Definitely a fond memory, nonetheless!",
   "created_utc": 1691299958,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzvjhv",
   "message": "I embraced my agoraphobia and loved hiding behind a mask. I felt so safe inside. And I think I healed something inside me with being removed from others. It also felt like humanity was connected, albeit for an awful reason. I also remember waking up thinking, oh no, enjoy this because you will never experience this solitude again.",
   "created_utc": 1691300077,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzvo2u",
   "message": "I rescued four kittens from a neglectful situation. They were so dirty when I got them, I thought they were light brown. After I bathed them, they were bright white! Gorgeous kitties. My cat and dog were the sweetest foster brothers. I would wake up and they would all four be sleeping next to me, with my dog at my feet, my cat on the pillow beside me. I have fostered a lot of cats in my life, but letting go of those kittens was not easy. They all went to loving homes though, and I get to see them! Oh, and we eventually got the mama kitty. My friend who struggles with depression ended up taking her, and she immediately fell in love with him. To this day all he does is post pictures of her talking about how much he loves her.",
   "created_utc": 1691300162,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzw6jy",
   "message": "I found out that wearing a mask has other advantages during hay fever season.  I have continued wearing a mask while mowing grass and when the cottonwood fuzz is flying.  It really helps.",
   "created_utc": 1691300505,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzwli8",
   "message": "My kids were 1 and 3 when it started and even though it was so hard being with them essentially 24/7 without many breaks, I got to see them grow every second of those years. I took so many pictures, was there for every milestone and made so many memories with them. It seriously was a blessing.",
   "created_utc": 1691300784,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzx3jf",
   "message": "Being anti social was normal",
   "created_utc": 1691301127,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzx3xg",
   "message": "My husband having a job!  😁",
   "created_utc": 1691301134,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzx8qo",
   "message": "Living close to an airport, the peace and quiet was nice",
   "created_utc": 1691301227,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzxc3k",
   "message": "It was all pretty amazing, seeing the streets so empty and not having to dwal with idiots. The worst thing about COVID was that it hardly killed anyone at all. I'd have been fine with it killing off 80% of the population or so, as long it didn't kill me and my little family.",
   "created_utc": 1691301292,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzxgr5",
   "message": "Going nowhere and working remotely. Ah, sweet times.",
   "created_utc": 1691301383,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzxpab",
   "message": "I had been living in an apartment at the time for almost 3 years. One of my roommates had been there for almost 4 years. We had barely seen each other in the first few years of living together because I worked full time and was in graduate school, she was in law school full time and eventually worked part-time for my company and I had also had a boyfriend for 18 months. With Covid, I was down to working part time and then had afternoons and evenings free. She worked from home until dinner. We would cook our separate dinners, chat a bit at the dining room table for dinner and then we’d sit at the table afterwards for hours just chatting. I felt like I learned more about her in the first week of Covid then I did all the time we had lived together beforehand!",
   "created_utc": 1691301554,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzxq1v",
   "message": "i was in a really shitty relationship during lockdown so i can’t really think of any good memories from that time tbh",
   "created_utc": 1691301569,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzxrnx",
   "message": "Going to Costco when they were only allowing two people per membership in the store.  No screaming kids running around, small lines, no traffic jams in the aisles.  It was shopping paradise.",
   "created_utc": 1691301602,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzxuot",
   "message": "I ordered a box of slim Jim's, and they delivered 20 boxes by mistake.",
   "created_utc": 1691301663,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzy2dq",
   "message": "I spent so much time with my sons who were 3 and just born. I was so happy and a little stressed. I wish I could do it again. Then again I wish I could meet their mother for the first time again.",
   "created_utc": 1691301817,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzy47u",
   "message": "The comfort of shared solitude",
   "created_utc": 1691301855,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzyg69",
   "message": "Silence. Complete fucking silence in so many places... and if not sil3nce, the closest you could come to it in a commercial setting.",
   "created_utc": 1691302090,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzyisp",
   "message": "Lockdown was a great time for me since I am a homebody. I didn't have that much fun gaming in a long time.",
   "created_utc": 1691302144,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzyj1c",
   "message": "Watching the death count rack up",
   "created_utc": 1691302149,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzyqpz",
   "message": "Not having to go to School From 3/16/2020-4/4/2021",
   "created_utc": 1691302304,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzyw8z",
   "message": "Not really anything. Nothing really changed for me. I never leave home other than to go to work or to he store so it was basically business as usual.",
   "created_utc": 1691302416,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzz5qz",
   "message": "Everybody was living life the way I do. I have severe anxiety and sometimes I’ll be home for weeks at a time without leaving. It was sad when it ended. Everyone went back to living life, working and going out. I’m still at home and it’s getting to be for longer periods at a time. Things out there seem to only be worsening. Things I’ve had anxiety over possibly occurring , making me feel crazy, are actually happening in reality in some instances. There seems to be an actual tension in the air to me. Having always been anxious of the crazy thing my mind would dream up was bad enough but now those things actually occurring is crippling. When is the tension either easing or erupting?",
   "created_utc": 1691302607,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzz9uc",
   "message": "Going back to college because it was easier for me to take finals at home instead of having it proctored on-site.",
   "created_utc": 1691302690,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzzdn5",
   "message": "A lot. No one in my family/friend group was constantly getting involved in stuff and/or flat out dyin, I was gaming and unlocking a lot of achievements, and even got out and did a couple of those weak little “rallies” that were in the middle of that. Good times, good times. Oh and started writing for the magazine that I work with to this day.",
   "created_utc": 1691302765,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzzmy9",
   "message": "Not working every god forsaken day",
   "created_utc": 1691302948,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzzo4i",
   "message": "Opening the big metal cabinet in my late grandpa's basement and finding a treasure trove of canned food, hand soap, disinfectant wipes, batteries, and even a pack of N95 masks. Almost felt like he was still looking out for me somehow.",
   "created_utc": 1691302972,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "juzzqxy",
   "message": "We were pregnant with our son. My wife and I had had a really rocky year prior, so we used 2020 to heal and get ready for him. I really cherish that time bc we came out of our bad times stronger than before and ready to welcome our kid to the world.",
   "created_utc": 1691303030,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv00209",
   "message": "Skipping almost all of my classes",
   "created_utc": 1691303261,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv004wb",
   "message": "learning how to run emulators because i had nothing better to do",
   "created_utc": 1691303322,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv00qko",
   "message": "Animal crossing",
   "created_utc": 1691303777,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv00y1g",
   "message": "Our animal shelter called for emergency fosters because they had to close the next day for lockdown. We brought home a lil dog and found out a month later that we got to keep her.",
   "created_utc": 1691303935,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv011yv",
   "message": "Watched all of The Lord Of The Rings again without stress of schedule",
   "created_utc": 1691304020,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv01f33",
   "message": "Most people were really cool about stuff, helping one another",
   "created_utc": 1691304294,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv01jwz",
   "message": "Meeting my online friends on a Minecraft server.",
   "created_utc": 1691304396,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv01woa",
   "message": "I was a pharmacist for CVS and volunteered to travel around to a bunch of nursing homes and home care facilities to give the Pfizer vaccine when it was first released. I felt like it was rewarding. One of the facilities we went to was really nice. It had a small theater, a bar (that I think only served root beer), an ice cream saloon, and a small area where they kept a rabbit and some birds. The thing is, none of these places had been used in months because everything was on lockdown.\n\nWe had the residents come into a chapel, which was fairly big, to get their shot. Afterwards, we made them wait 15 minutes to make sure they didn't have a reaction. We had probably 20 people in the room at a time (all wearing masks and social distancing). But they were so happy to see each other. Some of them it seemed like had no social interactions for months and many of them hadn't seen their friends in a long time. I hope those people were able to get out of their rooms as quickly as they could after we were done.",
   "created_utc": 1691304663,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv01x17",
   "message": "I was able to take a few weeks off work for possible covid contact. That was nice. Made an extra $2/hr hazard pay for like…2-3 months. My family were all “essential workers” so nothing significant changed beyond having to wear a mask at work.",
   "created_utc": 1691304670,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv01zm5",
   "message": "Getting hit by car.",
   "created_utc": 1691304723,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv022cu",
   "message": "I loved the first week or so, when people thought maybe the world was actually ending.  Like, right before the TP shortage crap.  I wore a painting ventilator to the grocery store and nobody even batted an eye. Folks were giving the serious nod when you'd pass in the aisle.  Loved it.",
   "created_utc": 1691304781,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv02evj",
   "message": "Saving so much money. Oh my god I’m glad I did too because I got laid off but man… I had so much money in my account. Had.",
   "created_utc": 1691305044,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv02ig0",
   "message": "Getting to spend basically an entire year with my daughter. I worked from home and she did Zoom school.",
   "created_utc": 1691305119,
   "score": 1,
   "submission_id": "15jc89r"
  },
  {
   "comment_id": "jv05w2z",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jc89r"
  }
 ]
}