{
 "submission_id": "15jdgqx",
 "title": "Why did you need to cut off a friend?",
 "selftext": "",
 "created_utc": 1691287490,
 "permalink": "/r/AskReddit/comments/15jdgqx/why_did_you_need_to_cut_off_a_friend/",
 "score": 196,
 "url": "https://www.reddit.com/r/AskReddit/comments/15jdgqx/why_did_you_need_to_cut_off_a_friend/",
 "comments": [
  {
   "comment_id": "juz8sku",
   "message": "[deleted]",
   "created_utc": 1691287625,
   "score": 195,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juz9ugt",
   "message": "She was using me for my money. She had a plan for my paycheck every paycheck.",
   "created_utc": 1691288137,
   "score": 152,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzamyw",
   "message": "I recently looked him up under Megan's Law. He's a convicted rapist...of a minor.",
   "created_utc": 1691288530,
   "score": 212,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzb88g",
   "message": "I was fed up with walking on eggshells around him all the time.\n\nSunk cost had me sticking around in that friendship for way too long, but having the pleasure of knowing what actual great friends are like, I made the decision to pull the plug. I wish him well. I still want to see him eat, just not at my table anymore.",
   "created_utc": 1691288828,
   "score": 55,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juz9xgc",
   "message": "Let's just say I began to suspect his obsession with the Confederate flag had to do with more than his family's heritage.",
   "created_utc": 1691288178,
   "score": 78,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juz97p2",
   "message": "They were unbelievably toxic and annoying to even be around. Ruined my reputation and my general self-being, and made me feel like shit for something I wasn’t even at fault for.",
   "created_utc": 1691287829,
   "score": 241,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzagtj",
   "message": "He hit on my wife, and tried telling her first that I said it was okay, and then tried to say I was having an affair with his wife, none of which was true.",
   "created_utc": 1691288448,
   "score": 214,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzakfr",
   "message": "They weren’t who they were pretending to be.",
   "created_utc": 1691288497,
   "score": 170,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzcteq",
   "message": "Trauma dumping. \n\nI became a therapist at some point and definitely wasn't qualified to deal with incest, SA, money problems, etc.",
   "created_utc": 1691289620,
   "score": 138,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzem1i",
   "message": "Disregarding my boundaries. She was going through a lot but hearing about it made me stressed, which is on me, but it caused us to argue more and make me more antsy. When I asked for a day apart because I needed some space, she constantly claimed I would just ghost her and ignored my desires for space. It definitely wasn’t all one sided - I struggle to maintain my mental health when faced with other people’s problems, which is something I need to work on. But insisting I’d just leave and not listening to my needs? At that point our five year friendship wasn’t worth constant stress.\n\nAlso not to get too into it but I have come to the realization that there were some really toxic behaviors with us. We met online when I was 16 and she was 20, I believe - I didn’t know at the time but it wasn’t a very healthy friendship.",
   "created_utc": 1691290524,
   "score": 202,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhtid",
   "message": "He started doing Amway. Every call, every time. Amway. He was my best man and me his.  Done, over, after 20 years.",
   "created_utc": 1691292150,
   "score": 28,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzasn7",
   "message": "He told me he disliked my wife so much he didn’t want to be around her.\n\nWhen I asked him what she did to offend him, he cited several situations that were all of the “bitch eating crackers like she owns the place” magnitude.\n\n(And for the record, I had long disliked *his* wife as well, but I valued our friendship enough that I kept my mouth shut and acted nice.)",
   "created_utc": 1691288610,
   "score": 206,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzcisb",
   "message": "He said to my face that he could give a fuck about feminism like that’s his MAGA, I said I don’t like his tone of talking about this n I’m a feminist, let’s change to another topic. He won’t stop his ridiculous complaining about how feminism so fucked up.",
   "created_utc": 1691289474,
   "score": 29,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzgynw",
   "message": "(Semi truck driver here) Fucker called a black man an “incompetent ni***r” simply because the guy was having a hard time backing up his truck n trailer and had asked for help. I called my dispatcher and told him that I need off this truck and back into my own. Never ever went back to team driving after that. \n\nHe did call me later down the road asking what I was doing these days. I said im that i don’t like to be friends with racist cunts and hung up.",
   "created_utc": 1691291710,
   "score": 112,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzh90y",
   "message": "[deleted]",
   "created_utc": 1691291858,
   "score": 240,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzicps",
   "message": "She told another friend… right in front of me… “yeah, if (my name) didn’t keep in touch, we’d never see each other.” Light bulb went on.",
   "created_utc": 1691292425,
   "score": 53,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzf459",
   "message": "Trump, conspiracy theories, Covid denier, the usual modern American story.",
   "created_utc": 1691290786,
   "score": 192,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzekkg",
   "message": "Leech",
   "created_utc": 1691290503,
   "score": 119,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juz976r",
   "message": "They were toxic and negatively impacting my mental health.",
   "created_utc": 1691287822,
   "score": 64,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzcvai",
   "message": "She wouldn't stop being clingy and bordering obsessed.  I asked her multiple times to please not worry about me or think I was mad at her if I didn't respond to e-mail messages or texts right away, but to no avail.  It didn't help that she'd call or text multiple times a day.",
   "created_utc": 1691289645,
   "score": 104,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzfy77",
   "message": "Her heroin habit and stealing",
   "created_utc": 1691291207,
   "score": 47,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzh58e",
   "message": "She was abusive. Yes, I was her friend between the ages of 11 and 16, so I know this sounds extreme, but she actually displayed all of the signs of an abuser. She manipulated me and lied to me, gaslit and guilt-tripped me constantly, called me names sometimes and insulted me, would turn all my friends against me if she perceived any wrong from me, straight up bullied and alienated me for a year, took advantage of me and guilt-tripped me some more when I started having trauma responses around her, and then would flip to a nice and caring friend at random, especially when I'd pull away, and suck me right back in. Eventually an altercation happened where I was in gym class while injured without a doctor's note, and she yelled at me for not participating in the game to her satisfaction (i.e. running full-speed like everyone else) because my injury was hidden under my clothes, and accused me of lying even though the gym teacher himself okayed me taking it easy as long as I was participating. Then she hunted me down after class and told me we were gonna have to have a serious talk because my behavior has to stop like a disappointed parent scolds their child and made an insult to my intelligence. (I'm really insecure about that because I'm autistic, and anyone who knows me knows to never go there.) Then she strung me along with fake apologies and crap when I got really upset and then turned around and made it out like I was the one who was causing trouble and didn't want to fix what happened. \n\nI couldn't take it anymore. We sat down a little over a month later and ended the friendship. The last time I spoke to her, she tried the whole guilt-tripping me for avoiding her and talking down to me like a parent does their child, and I flatly informed her that I don't think she knows me anymore and walked away. She tried harassing me via text and email (I had her blocked on social media so she couldn't try that) and it fell through because I didn't respond. \n\nI'm 24 now. I've been through worse, and I've grown up. I've managed to heal, and distancing myself from my classmates really really helped. If you're reading this and know who you are, I know that I was toxic too. I was young and immature and dramatic and didn't treat you so good either, and I'm sorry. I hope you're well, and I hope you got therapy and learned how to properly treat people with love and respect. But I will never forget how you treated me, I was already going through enough without your bologna, and I wish you never moved to town. I hope to God I never have the misfortune of ever laying eyes on you again.",
   "created_utc": 1691291804,
   "score": 89,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzc6g4",
   "message": "One was a manipulative thief.\n\nThe other is a raging alcoholic who's still really into all that Qanon shit.",
   "created_utc": 1691289309,
   "score": 106,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzfr80",
   "message": "They ate my leftover chicken nuggets and lied about it.",
   "created_utc": 1691291112,
   "score": 31,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzg91r",
   "message": "He used to tell me all about taking advantage of opportunities and \"not being an angel\" and praising the idea of being selfish.\n\nI didn't realize he was warning me.",
   "created_utc": 1691291360,
   "score": 49,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzh4fr",
   "message": "Used me and took advantage of my kindness. Then lied about it all.",
   "created_utc": 1691291793,
   "score": 80,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzh5ik",
   "message": "He let his family’s wealth entirely define who he was.",
   "created_utc": 1691291808,
   "score": 142,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzh6ws",
   "message": "Disrespect disguised as flakiness.",
   "created_utc": 1691291828,
   "score": 81,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhz0t",
   "message": "Talked behind my back. Changed their voice around dudes that I liked.",
   "created_utc": 1691292230,
   "score": 86,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhzq0",
   "message": "There were too toxic",
   "created_utc": 1691292240,
   "score": 21,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzdmzx",
   "message": "Friend was always kind of snarky, but their life got screwed up, I hung in and helped as best I could, including lending money(repaid).  Helped them avoid some bad consequences of avoidant behavior.  They became really bitchy, mean and even stole some stuff.  After a while, they realized I stopped visiting, declined requests to get together and pushed back hard on rude, unpleasant comments.  Now they're polite, but I've moved on.  We have friends in common; I don't tell others about the bad behavior.  I understand that depression and anxiety can make people irritable, but it went way too far.",
   "created_utc": 1691290035,
   "score": 7,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzfrd6",
   "message": "I finally figured out that all that good natured ribbing he did all the time was him just being a bully. He had issues and I was his favorite punching bag. I finally wised up and got rid of his ass.",
   "created_utc": 1691291114,
   "score": 81,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzh1aj",
   "message": "They got a new job and almost immediately their personality shifted. They started getting randomly paranoid, sharing memes and constantly talking about incredibly racist stuff, and not wanting to go to certain areas. Even though we'd just been there weeks before, all of a sudden they were rampant crime areas. It became impossible to have a conversation with them without it becoming some rant about how his rights were gone and the world was terrible. \n\nMaybe it was always there, but it felt like one day, they're my friend that I've known for decades, and a few months later I'm dealing with a delusional wannabe survivalist.",
   "created_utc": 1691291749,
   "score": 186,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzh8wk",
   "message": "Changing of values, restructuring of mind and sub-consciousness",
   "created_utc": 1691291856,
   "score": 12,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzha0d",
   "message": "My so called friend spread rumors about me so bad, it got to a point where jobs refused to hire me. I was unemployed for almost two years because of it.",
   "created_utc": 1691291872,
   "score": 217,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhrq3",
   "message": "He was arrested for 2 counts of murder",
   "created_utc": 1691292125,
   "score": 21,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzij9h",
   "message": "Drugs and alcohol. Eventually you need to just walk away.",
   "created_utc": 1691292519,
   "score": 228,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzlbpy",
   "message": "I became Catholic.   \nHe's a Freemason.   \n\n\nYou might say ideological differences.",
   "created_utc": 1691294009,
   "score": 4,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juz9mvm",
   "message": "Omg she was out of her mind. Obviously obsessed with anything horror related. She thought most of the creepy pasta characters were real and that she often lived with them. She had a rough childhood though and she had new boyfriends every week it seemed like. I had to cut her off because she became too attached to me, too clingy, and our relationship grew toxic after a while. For the most part I felt bad for her. I hope she got some help... she really needed it",
   "created_utc": 1691288036,
   "score": 31,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzh3i0",
   "message": "It's been 10+ years since we've left high school. They still have the same mentality now that they did then.",
   "created_utc": 1691291780,
   "score": 74,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzcr1h",
   "message": "College friend turned out to be a rapist who took advantage of drunk college girls at frat parties.\n\nHigh school friend got really into Trump/Maga stuff. I mean REALLY into it. \n\nThe rest that I cut out/unintentionally cut out was because I was ghosted entirely or we just stopped talking.",
   "created_utc": 1691289587,
   "score": 81,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juze3r2",
   "message": "The girl I was interested in didn’t really dig the whole Siamese thing",
   "created_utc": 1691290267,
   "score": 3,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzh757",
   "message": "Apparently she liked drugs more than me.",
   "created_utc": 1691291831,
   "score": 63,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzgnlm",
   "message": "Old roommate. He backstabbed me with some harsh words all because of a girl. Then almost frontstabbed me with a knife while I was sleeping. Seemingly had a semi-sober moment in his drunken rage and took it out on my bedroom wall instead.",
   "created_utc": 1691291554,
   "score": 20,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhc30",
   "message": "Got the call that my dad had suffered a stroke and I needed to get to the hospital ASAP. I lived two states away and got the earliest flight I could which was at 5 am. Asked my then roommate if he would be willing to drive me to the airport in the morning. The way he reacted told me it was just the biggest inconvenience for him to wake up early to drive me to the airport so I could make it to my dad before he died. I ended up taking an uber. From that moment on I just could not look at him in the same light. Still had a few months left on our lease but once it was over, I moved out and never spoke to him again. He never tried to reach out either so I guess we weren't as good friends as I thought to begin with.",
   "created_utc": 1691291901,
   "score": 217,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhm3e",
   "message": "She lied to all of our other friends that I was “using them to get through high school” when I asked if she could stop talking about her boyfriend all the time because it was upsetting to me (who happened to be my abusive ex’s best friend). She then tried to make herself the victim of the situation by blaming it on “group think.” She also made jokes about abusing/traumatizing her future kids. I wish her nothing but the best though",
   "created_utc": 1691292044,
   "score": 12,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhmq9",
   "message": "They wanted me to put in all the effort of maintaining the friendship, and iced me out when I started dating someone seriously. We grew up together and I used to have a childhood crush on him, and I think that dynamic didn’t age well.",
   "created_utc": 1691292053,
   "score": 23,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzho36",
   "message": "She said she needed a ride and then she sat there and sold meth to carnies (actual carnival workers) forever. She wanted a ride to her boyfriends house that was about a 15 min walk away.",
   "created_utc": 1691292072,
   "score": 90,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhr42",
   "message": "i have cut lots out.. one who went to the navy lied about me to others like his now wife that i didn't like her and to other friends that i was a drug addict. one who sent me ugly emails from peta featuring holocaust pictures and her husband was covertly hostile to me. another and another because i would have ruined their relationships by being around them. another had a knife to my throat just for the hell of it one day. another because he destroyed his mind with drugs and went crazy spreading lies about me. another because he burned our bridge in favor of his military asshole new friends. another because she turned out to be a crook defrauding charities and killing roosters because she thinks all roosters are rapists. another because they eventually revealed that they hate jews with a passion. all my cousins and aunts because they are all awful humans. two because they were engaged and confessed they wanted to ditch and be my partner instead. the rest are much more upsetting not including stalkers and i would rather not talk about them. \n\ni don't think my standards are too high, i just think that the standard of people has fallen since before i was born perhaps.",
   "created_utc": 1691292115,
   "score": 10,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhsdv",
   "message": "She flaked constantly. It started to feel very disrespectful.",
   "created_utc": 1691292134,
   "score": 29,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhu74",
   "message": "Acted like everyone else was the toxic one. Always asked for money, never gave anything in return. Came up with sob stories as a way to take advantage of the kindness of others.",
   "created_utc": 1691292160,
   "score": 88,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzi9b0",
   "message": "All we ever damn did was go to karaoke at night, get hammered, she got into fights, I babysat her, and we were both hungover all the next day. I begged her to do things during the day, lunch, the beach, events, anything! I was so tired of drinking myself to death and protecting her dumb violent drunk ass, so I just stopped going. After the third night I didn't show, she called to yell at me about how I never want to do anything... I reminded her of the several texts asking to do things during the day. Then she did something stupid while drunk, had a very public ugly cry panic breakdown, called every person we know and told them I abandoned her at the bar or something and whatever she did was my fault somehow. We were damn 30 years old. A mutual friend and her mother were angry with me to the point of telling me off via text.\n\nAbout 3 months later, her mom calls me in tears, begging me to help her alcoholic daughter. I gave her phone numbers, and said I was not going to be involved.",
   "created_utc": 1691292376,
   "score": 231,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzjevc",
   "message": "She went full maga.  You’d disprove something, she’d just charge off on the next nonsense.  She can make up shit faster than you can disprove it.  There just aren’t enough hours in the day.",
   "created_utc": 1691292984,
   "score": 61,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzlis7",
   "message": "he used pictures of me to catfish men",
   "created_utc": 1691294114,
   "score": 247,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzlpyr",
   "message": "6yrs ago my “best friend” held a firearm to me and told me to “put out or get out.” I obviously left immediately. We were severely addicted to painkillers and that was basically the only reason that I stuck around with him for so long. His actions that night actually saved my life. I’ve been clean 6yrs at the end of the month. I never spoke to him again after he traumatized me like that. He passed away about a month ago from a drug overdose. I just hope his mom is okay.",
   "created_utc": 1691294219,
   "score": 22,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzlssv",
   "message": "Kept saying the n word like dude I invited you to hang out with this diverse group of friends and you say my n^#\u0026amp;% at least 20 times a minute. Every single one of us could have kicked his ass and this kid just stood there trying to challenge everyone to a fight after being told he should watch his mouth. Dumbass kid. Is a born again Christian pastor now but i don't buy it. He's just unemployable and has kids.",
   "created_utc": 1691294261,
   "score": 149,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzml12",
   "message": "Q believer, Trumper, Anti-LGBTIQA+, COVID Denier (after many friends died from it). And that is just this year.",
   "created_utc": 1691294682,
   "score": 20,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzho7o",
   "message": "I’ve never had to (to my recollection) and never will hopefully have to. Forgiveness, selflessness, and communication is key 😎",
   "created_utc": 1691292074,
   "score": 3,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juz8tfn",
   "message": "I have no friends because almost everyone is toxic toward me",
   "created_utc": 1691287636,
   "score": 2,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzk57c",
   "message": "We had a one night stand that turned into an affair between me and him for months. I didn’t want his wife to find out so I ended our friendship",
   "created_utc": 1691293376,
   "score": 5,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzg6xw",
   "message": "Just ended a friendship cause she bailed on a planned trip the night before talking about financial struggles which I understand but at no point in the months, days before where she hyped up being excited about it did financial struggles come up",
   "created_utc": 1691291332,
   "score": 5,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzcog4",
   "message": "He was driving slowly AF. I needed to get to my physical appointment, so I turned on the signal and cut him off.",
   "created_utc": 1691289552,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzh5a5",
   "message": "I felt like I was in a teenager relationship around her, and we’re in our 40s.",
   "created_utc": 1691291805,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzj5jn",
   "message": "I feel like God cut people off for me if I'm being honest. I needed the help too",
   "created_utc": 1691292843,
   "score": 0,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzfbo7",
   "message": "Domber.",
   "created_utc": 1691290893,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzfctu",
   "message": "Guess he really took 'getting into character' to a whole new level!",
   "created_utc": 1691290910,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhw1m",
   "message": "I'm sober, he's an schoolchildren, and even we hung out all he wanted to do was drink.",
   "created_utc": 1691292187,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhwke",
   "message": "Over 10 years ago before I married my wife, a very close life long friend said I shouldn't and went on to say terrible things. Needless to say, I am happily married still with 1 daughter and another on the way. Couldn't be happier and haven't spoke to that person since. Heard through other parties that the lady(wifes ex best friend) we got him set up with back then have been off and on and are fairly unhappy and need therapy. I think he might have been self reflecting his issues on to me.",
   "created_utc": 1691292195,
   "score": 7,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhx8w",
   "message": "In one of my friend groups we make edgy/dark jokes. One friend took it too far.\n\nThere was an active shooter a few months ago at a well known college. My little brother was attending that college and was right by the building where multiple people were shot.\n\nSomeone in our friend group chat mentioned the shooting and I texted that I’m freaked out and worried about my brother and he things one of his fraternity brother was one of the persons who got shot.\n\nSomeone in our chat replied with “he’s a frat guy, he will just drink it off.”\n\nSomething about that irked me as he seemed to not be bothered by what was going on and made some other jokes about the shooting. This same “friend” also really only said condescending things to me whenever I said anything or asked for advice. \n\nSo that night I told him off and stopped talking to him cold turkey. I’m all for dark jokes and stuff but not when things are personally affecting me/someone close to us.",
   "created_utc": 1691292204,
   "score": 5,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhykn",
   "message": "relationship became one sided... I was giving it my all, she was just taking...plus, found out she keeps me a secret but at the same time, I'm her emergency contact...",
   "created_utc": 1691292223,
   "score": 46,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzhzbp",
   "message": "Abridged version: A very\none sided friendship. She did all the taking. I did the giving. She Lied about an ex-boyfriend being abusive and lied about her bio dad trying to SA her to gain favors and sympathy. When she told me this she cried and she able to produce fake tears. \n\nShe knew I was a softie and leeched off me for food. Fast forward. I pitched in with other people and threw her a pre-wedding party at work. She still didn’t invite me to the big day. I was devastated. Her marriage lasted less than one year. Then she shacked up with some guy she barely knows and baby trapped him. I cut her off, ignored her and blocked her. She’s a psychopath . I wish I never met her.\n\nEdit: I wanted to add more details. She only gave me one donut. One singular donut out of all the times I helped her with groceries and getting her lunch and food. Her leeching went in for two years. She would leech off of me every week like 3 or 4 out of 7 days. She never texted me to get to know me better or have a fun conversation. Nope it was always me being her personal refrigerator. \n\nOne time she had to be absent for a few months due to something bad happened to her. Her hand or arm was bandaged. She still leeched off of me more than usual! Always telling me she’s about to cry due to she’s “forget“ breakfast or lunch or whatever. Then she tell me she have no money which I call Bullsh9t in restrospect. She said that line many times before she got bandaged.\n\nAfter all I done for her…For three weeks or so she bluntly ignored me and was really unfriendly and cold to me. No hello, No smile. Then gave me a weak a$$ apology in saying that she was so stressed out.  Which I foolishly accepted. Nah, she wasn’t stressed she just wanted to be mean to me. Her ugliness seeped through her pretty face. She was really pretty to look at, but she’s ugly to the bone. \n\nI really wanted to see the good on her. I Guess she never was a good person. I was blind-sighted at the time. \n\nI can see she’s a narcissistic psychopath that wants everyone to worship her. She’s just like Regina George mixed with Cersei. She thinks she’s Queen. And all the peasants must obey her. Honestly in retrospect, I felt I was back in high-school again when I was around her. The friendship did not feel like an adult one. It felt so juvenile.",
   "created_utc": 1691292234,
   "score": 56,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzih5b",
   "message": "After 17 years of being \"Best friends\" I finally figured out that she only kept me around to tear down my self esteem to make herself look better. She never considered anybody else's feelings in what she did or said. If you tried to make plans and she couldn't come, she would bully you into changing it or make a big deal of how you must hate her.\n\nWorst part was she was related to some big wigs in town so if you pissed her off, good luck keeping or finding a job.",
   "created_utc": 1691292489,
   "score": 169,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzihxd",
   "message": "'Friend' in quotations.\n\n\u0026amp;#x200B;\n\nthey were using me for my in-game Roblox items.\n\nthe things i gave them was worth probably at least 50 bucks.\n\n\u0026amp;#x200B;\n\nScrew fake friends",
   "created_utc": 1691292500,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzij09",
   "message": "It was a one sided friendship that I put all the effort into, she was attentive when it suited her. I made the phone calls, was the first to text, initiated all plans, etc. It was exhausting and she only agreed to the plans a fraction of the time. We just grew apart. \n \nI got engaged and realized that I’d be happier to see her parents and younger siblings at my wedding than I’d be to see her. So I stoped trying to initiate contact. She never reached out but did make some snide comments to my sister when she wasn’t invited to my wedding (two years later, we had a long engagement).",
   "created_utc": 1691292516,
   "score": 37,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzijd5",
   "message": "I stopped wanting to tolerate their abusive tendancies.",
   "created_utc": 1691292521,
   "score": 30,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzilzx",
   "message": "Because they were the biggest narcissist known to man. Some examples include:\n\n1. Constantly referring to themselves as iconic, gorgeous, a legend, a celebrity\n2. Posting 700 selfies with a filter everyday,  clearly thinking people are obsessed with them \n3. They would call me constantly just to talk about themselves. When I would speak, they would yawn or interrupt me, or just start texting on their phone and ignoring me altogether\n4. They talked shit about other people and were really nasty to strangers, acting very entitled \n5. They had no empathy and did not take accountability for their nasty behavior. Nothing was ever their fault, they were perfect and it was everyone else who was the problem.  \n6. They were very shallow, vain, and only wanted to hang around pretty people\n7. They used people to social climb \n\nI can go on and on. But basically every symptom of narcissist personality disorder...they had.",
   "created_utc": 1691292559,
   "score": 196,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzipos",
   "message": "Thought it was funny to post publicly on Facebook that we were in a relationship. Blockedt!",
   "created_utc": 1691292613,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzivv1",
   "message": "It was completely one sided and they used me for money and stuff and it was hard because they lost their home and I took them in they moved in with a basket and a bp of clothes and left with about ten full bags of clothes and random stuff and after they moved out they basically stopped talking to me and after a while I realized it was one sided 🙂 5yrs down the drain",
   "created_utc": 1691292700,
   "score": 26,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juziw8x",
   "message": "Done it several times now. Dont live with them if theyre completely disrespectful slobs. Have ended 2 relationships now with men in their 30s because they are the most disgusting inconsiderate lazy assholes I have ever had the displeasure to live with.",
   "created_utc": 1691292705,
   "score": 21,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzj27z",
   "message": "using me to earn \"progressive points\"\n\nnot on my watch Becky",
   "created_utc": 1691292794,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzj3ia",
   "message": "never really cut anyone off but there are a couple that we just slowly over time stopped talking",
   "created_utc": 1691292812,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzj4yh",
   "message": "She moved into my house, drank shitload of vodka and took pills, invited internet strangers over at the beginning of COVID, and revealed herself as a fucking sociopath. When I kicked her out with 30 days’ notice, she told people I was in love with her.",
   "created_utc": 1691292834,
   "score": 162,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzji23",
   "message": "They started using drugs, i cut off a lot of family members because one was always acting like an ass, my other brother owes me $400 and my dad molested me as a child.",
   "created_utc": 1691293030,
   "score": 19,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzjkg5",
   "message": "I couldn’t keep propping him back up. I love the guy, but he’s gotta live his life. I got him jobs, moved him in with me several times, he ate my food, used my wifi, drank my booze, and just quits on everyone. I’m good homie. I’ve got mouths to feed.",
   "created_utc": 1691293065,
   "score": 26,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzjmnd",
   "message": "Every time I mentioned a girl I was talking to or was even slightly interested in he would go out of his way to chat her up, ask her out or try to shag her. He even messaged my ex (who he didn't even know) on Facebook a week after we broke up trying to get with her. Weird, weird bloke.",
   "created_utc": 1691293098,
   "score": 129,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzjppa",
   "message": "I was fed up with her not seeming to give a fuck about our friendship",
   "created_utc": 1691293145,
   "score": 109,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzjr03",
   "message": "Is it \"cutting off\" if I just distance myself because I'm an antisocial dude? Nothing against my friends specifically - I just like my own company too much.",
   "created_utc": 1691293165,
   "score": 14,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzjsjr",
   "message": "You think I have friends?",
   "created_utc": 1691293189,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzju9l",
   "message": "They emotionally (and sometimes physically) abused me my entire childhood. In the teenage/adult years it turned into just emotional, but eventually when I started going to therapy as an adult I learned what had been happening to me for so long. So I went no contact.",
   "created_utc": 1691293213,
   "score": 2,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzjwxs",
   "message": "She would use my house to smoke crack and sleep with guys to get more crack... When she started asking me for money is when I had to end the friendship. I couldn't keep enabling her drug habit.",
   "created_utc": 1691293254,
   "score": 5,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzjx5b",
   "message": "They acted like they were there to help me when they couldn't even help themselves.",
   "created_utc": 1691293257,
   "score": 3,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzk1ws",
   "message": "Kept complaining about her issues yet did nothing to fix them. When she was presented with a solution, she would complain that it was too hard. Constant pity party, negativity, and dumping onto me as if I were a therapist. Then she didn't get the hint when I tried to distance myself. Very draining",
   "created_utc": 1691293327,
   "score": 11,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzk4mb",
   "message": "For threatening me randomly for no reason at all and then he resumed to threaten my family with his dad's gun as he sent a picture of himself holding it to my brother. We were only 19 at the time, but me and my fam have been cool with him. Then he just threatens us to be a dick. Learned he's a fucking fat clown not doing shit with his life.",
   "created_utc": 1691293368,
   "score": 2,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzk9c4",
   "message": "He gave me the worst handjob I’ve ever received.",
   "created_utc": 1691293439,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzk9s5",
   "message": "They stole and activated my debt card and then some how got out of the charges for it. I think he was a snitch getting bigger people",
   "created_utc": 1691293446,
   "score": 7,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzkat9",
   "message": "Leading me on too much as a boyfriend, lying to me about what she was doing, then the final straw was her posting she went with a date to something I was supposed to with her as her plus one.",
   "created_utc": 1691293462,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzkbzo",
   "message": "A guy I knew in high school was very creepy I found out from another mutual he was into younger girls. He makes creepy comments so I had to block him.",
   "created_utc": 1691293480,
   "score": 3,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzkdfs",
   "message": "she gave me the cold shoulder because, and i shit you not, i didnt think she looked like she had 300+ J cups. i waited a while for her to think and tried to make the first step to patch things up but she continued giving me the cold shoulder and got drunk at some point even tho she hates alchool and wouldnt even take a sip while eating so i told her i dont trust her anymore and wished her the best. she blocked me right after",
   "created_utc": 1691293502,
   "score": 2,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzkirj",
   "message": "He asked me if it was ok to call our black friend the n-word",
   "created_utc": 1691293582,
   "score": 3,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzkosu",
   "message": "they lacked respect and felt that they could disrespect me. Generally speaking, that's all it takes. I can accommodate our fallible nature as human beings, but when someone puts me down because they believe that I am weaker or somehow less than them, it's time to go.\n\nThis one high school acquaintance of mine had sounded the alarm and asked me to move a few states away because he had fallen on hard times, only to have this person try to pull a fast one and leave me stuck in a strange apartment in a strange state while he attempted to pick up his bags and move across the country with his new girlfriend after having made plans to travel to North Africa beforehand.   \nI looked that dude dead in his eyes and told him he was no longer a welcome person in my life and promptly moved out and gave my job its two week notice, staying in a hotel for the remaining time. \n\nI learned a lot from that experience and I wound up cutting out many more similar people like him when I got back to my home state after having worked and lived in different cities and states.   \nBe kind, but value yourself and know your worth. If you don't set boundaries, you give people a clear signal as to what you are willing to tolerate.",
   "created_utc": 1691293671,
   "score": 36,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzkqat",
   "message": "Invited himself over during the pandemic, not aware he was contagious and acted like it was no big deal even though he tested himself positive and was only a week into it. That and my friends / work had restraining orders on him that I found out later. \n\nAnd once years before 2020 he invided me over to watch a tv episode with him, didnt have a couch, put the show on a laptop ontop of a table and told me to sit on the floor to watch it, he was sitting on his bed. Id go into more detail but it honestly wasnt worth it.",
   "created_utc": 1691293694,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzkqbo",
   "message": "This actually happened recently. He's been putting me down and talking shit for sometime. I cut him off when he started calling me a bitch and wanted to fight me.\n\nI have some pretty basic qualifications for my friends and he didn't make the cut.",
   "created_utc": 1691293694,
   "score": 46,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzks7l",
   "message": "A few years ago a friend was asking for money every once in awhile. He would pay me back within a few days, a week at most. His checks always cleared so I didn’t think much of it.\n\nThen a few months later, I find out he had been admitted to the hospital for OD’ing on cocaine because it was laced with fentanyl. I also found out that I was not the only one he was asking to borrow money from. \n\nHe recovered just fine, thank God. But I could not continue to hang out with him after this. It was not my fault what happened to him, but by giving him cash I was unknowingly associated with his drug habits that almost cost him his life. I told him after a few weeks of recovery that he had betrayed my trust and I needed time away from him. He understood. \n\nAround a year later, he was on his way to “graduating” his rehabilitation. Part of his journey was to reach out to people he had wronged. He contacted me and apologized. I accepted it and was and still am happy for him for cleaning up his act. But I made it known that I’m never giving him cash again lol.",
   "created_utc": 1691293722,
   "score": 129,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzkuud",
   "message": "Control freak",
   "created_utc": 1691293761,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzkxkp",
   "message": "He turned out to be a leech / mooch. Wined and complained about every little thing. Would talk trash about every one, even me, behind their back, yet hated when people did it to him. He believed in people's dramatic lies without proof and then acted like nothing was wrong when the truth of the lie came to light.",
   "created_utc": 1691293801,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzkz4d",
   "message": "She was my pony tail, getting too long",
   "created_utc": 1691293823,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzl3aq",
   "message": "She never wanted to talk about my problems and life, only her own. When I’d try to open up, she’d shut me down by saying the subject was “awkward.” The final straw was when I tried to tell her that I was experiencing PPD and I needed someone to listen, and she wouldn’t let me talk.",
   "created_utc": 1691293884,
   "score": 82,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzl3xp",
   "message": "She became vegan ,which is I fine, and I can respect that, then she became a believer in conspiracy theories. It started with fears about  5G and spiraling into an anti-vaxxer during COVID to the point that she thought, \"The whole thing was over blown.\" I tried to discuss it with her and provided peer reviewed papers on supporting the vaccine . She countered with some mommy blogger info on Ivermectin.... broke my heart tbh.",
   "created_utc": 1691293893,
   "score": 8,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzl585",
   "message": "He played these stupid head games. He would bombard me with texts, IG msgs, and Snapchats in the span of an hour. He would only call me if he was trashed, I have several maxed-out voicemails where nothing he says is discernible. He knew I had to get rid of my dog, so he started sending me snaps of his cat - like to taunt me. I reached my breaking point with him and ended up blocking him everywhere.",
   "created_utc": 1691293912,
   "score": 19,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzl5fr",
   "message": "He kicked me out of a band without actually kicking me out. He just stopped inviting me to gigs. If you wanted to kick me out, then kick me out, but at least have the common courtesy to tell me face-to-face that you’re kicking me out. Don’t ghost me.",
   "created_utc": 1691293915,
   "score": 137,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzlc2q",
   "message": "This ain't my childhood friend I'm still best friends with my childhood friends but my work friend who I invited over sometimes called my wife a bitch I was right there I was wanting to shoot him with my Colt Python I told him you need to leave though but I was this close to killing him right then and there",
   "created_utc": 1691294014,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzldz8",
   "message": "She took my cellphone. Went through it, deleted a sentimental text message, accidentally made a call using up my balance and made me buy a replacement SIM since I wasn't able to receive calls. I think she'd never used a cellphone before. I asked her to give it to me 3 times, she said no, I left and that was the end of the friendship.",
   "created_utc": 1691294042,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzleob",
   "message": "Backstabbing, lying and delusional bullshit.",
   "created_utc": 1691294053,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzlf33",
   "message": "Fun Bully. I didn’t want to do hard drugs anymore.",
   "created_utc": 1691294059,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzlqlx",
   "message": "I had a friend that always made underhanded comments towards me, never stood up for me and even made fun of me trying to better myself. She was was my best friend of 20 years and I was her maid of honor. There came a day when I just knew our friendship was over. I saw her when she came to visit my parents after my grandma died, but that was a few years ago. We haven’t spoken since. It took a lot to do that and I still get sad if I think about it too much.",
   "created_utc": 1691294228,
   "score": 7,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzlwpj",
   "message": "Because I fell in love with her.",
   "created_utc": 1691294321,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzlyi0",
   "message": "I've cut off a few.....\n\n#1 would make a big scene every time we went out somewhere in public together, it was extremely embarrassing and her treatment of retail workers and restaurant servers was abysmal and out of line\n#2-4 treated me like a free therapist, always unloading all their problems on me but were never willing to reciprocate and listen to my issues, these relationships became too one-sided and emotionally draining\n#5 was single, unemployed and very poor while I was married, middle class working a full-time job, she was a nice person but we just didn't have much in common\n#6 was also a nice person but her husband was a disgusting obnoxious entitled misogynistic creep and I couldn't stand being around him, we also had opposite political views and she also had a large group of questionable friends that were swingers, our lifestyles were just too different\nOh I forgot another one.... #7 was a lovable person with a big heart who I miss dearly but she made the mistake of making a pass at my married bil right in front of his wife (my sister) and blood is thicker than water",
   "created_utc": 1691294347,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzlzlt",
   "message": "Asked me to have a threesome with me and my wife. I very firmly said no. He asked me again like a week later. \n\nI felt like he didn’t respect my boundaries so I cut it off. It was a shame, too, because we had known each other a very long time.",
   "created_utc": 1691294363,
   "score": 17,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzm8vy",
   "message": "Her child could no wrong while mine seemed to do everything wrong, got tired of it real quick",
   "created_utc": 1691294500,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzm8xr",
   "message": "She wasn't there for me when I needed her the most. And when I told her about it she didn't seem to understand or she really didn't want to understand best thing that ever happened to me was putting that bitch on the curb. Call to up one day and told her I'm not fucking with you anymore and hung up",
   "created_utc": 1691294501,
   "score": 18,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzma8t",
   "message": "She called the cops on me and gave them misinformation about the situation. And she had called me a parasite for experiencing multiple personalities and would “punish” me by putting me in distressing situations. She claimed to be a mental health advocate but didn’t believe or respect disorders outside of her own. Ultimately I blocked her after she called the cops on me. I felt like that was beyond too far.",
   "created_utc": 1691294521,
   "score": 5,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzmbs4",
   "message": "Covid brought out the conspiratist in her. The conversations started to get very weird and frankly, infuriating.",
   "created_utc": 1691294544,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzmcrh",
   "message": "Because they weren't a friend. They're nothing to me.",
   "created_utc": 1691294558,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzmcuv",
   "message": "He was constantly doing stupid shit that I didn't want to be involved with. At one point he groped my ex wife and I was like nah bro.",
   "created_utc": 1691294560,
   "score": 16,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzmibn",
   "message": "There’s a Tupac quote “just because you’re not my friend doesn’t mean I don’t want to see you eat. I want you to eat. Just not at my table.”\n\nSo basically that. I was growing. They were stagnant and overly negative. Could I have broken it off better? Yeah. But still, it was for the best.",
   "created_utc": 1691294641,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzmkgm",
   "message": "Drugs , crime, Time to grow up, or end up dead In prison or a junkie..",
   "created_utc": 1691294674,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzmlkp",
   "message": "We became very fast friends in college, and were unseparable. Our morals, humor and vision aligned perfectly, and I genuinely believed there couldn't be a better friend in this whole wide world.\n\nDuring our time in college, she went through a lot of issues. Family, relationship, health, finance. And I did my best to stick with her. I spent as much time with her as I could to help her out in every way possible. And she was always very grateful for it.\n\nMy entire life, I have been a huge people pleaser. I just can't say no to anyone. She pointed out how people just wanted to use me for thay very reason. And stuck with me, saying no in my stead. And I was over the moon. No one had ever stood up for me like that.\n\nUntil, I said no to her. I had just gotten married and moved in with my husband who lives in a joint family. I had major physical and mental health issues. I was in hospital for longer than I was at home. I got diagnosed with depression and was struggling through an identity crisis. I spent months in bed, speaking to no one. No one at all. And all this time, my \"friend\" was nowhere because she was occupied with her postgraduate exams. And I had no issues with that. She had her life to live. Just because I was stuck, didn't mean she had to be stuck as well. Once her exams were over, she dropped me a text. She wanted to meet. And I told her I needed time to gather myself. I had only recently began to come to terms with the major life changes I had faced. I had a lot on my plate. And no time to meet. I proposed we do a video call. But no. She wanted to meet in person. I tried talking to her. Asked her if everything was alright. If anything was wrong at all. \n\nEverything was perfectly fine. She just wanted to meet me, so she wanted me to drive to the other end ofcthe city to meet her. She wouldn't come to me. After I knew for sure that everything was alright, and there was nothing urgent, I told her no. I told her I had a lot that I needed to do for myself, and was unable to make time. And she snapped. All of a sudden, I was a pathetic friend. I never considered her feelings. I was absolute trash. Given the vulnerable mental health, I began spiraling again. I started believing I was a crappy person. For a week straight, I cried every night thinking my poor actions had led to this fallout between us. My husband was my rock through all this. He let me cry all that I needed. Held me all night. And constantly reassured me that I had done nothing wrong. It took me weeks to realize that I had indeed not done anything wrong. So I decided to set things straight. We had an amazing friendship and I didn't want any sort of misunderstandings (if there were any) to change that.\n\nSo I told her we should meet. And she refused. She didn't want to anymore. I gave her time. I thouggt maybe my refusal to meet her put her off. I gave her time. But for months she refused to meet me. I gave up on trying to meet and talk and decided to just call and set things straight. Easy, right?\n\nNo. It was the worst phone call ever. For thirty minutes straight she ranted about how all I cared about was me. About how I was the most selfish person ever. How I was the one who created this distance between us.\n\nI wanted to say a lot. I wanted to mention how it was me who got her through college. It was me who paid for all her lunches and dinners when she didn't want to bursenher family. How I, on the day of my wedidng, left everything and went to her place because she had a fight with her sister. And I didn't mean to rub it in her face. I didn't do anything special, because that's what friends do. They stick with you.\n\nI wanted to ask her why she was never there when I was going through the worst time of my life. But that would have been pointless. In almost a year she had never asked me how I was doing. How things were on my end. I wanted to say so much, but I didn't. Everything she said to me left no space for me to even try and speak.\n\nSo I hung up. And that was the last time I spoke to her. It's been two years. And there are times when I wonder how she is. How her family is. But I know I don't have the mental capacity to correct the image of me that she has built in her mind. And I'm not sure she wants it to be corrected either. So I say a little prayer for her, and move on.",
   "created_utc": 1691294690,
   "score": 95,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzmn7y",
   "message": "She got involved with multiple MLMs and wouldn't take no for an answer.",
   "created_utc": 1691294715,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzmpps",
   "message": "When I was a single mom, I had a bartending job where I worked every Friday night until quite late. Another single mom and I had become friends after our kids did, and I knew she was a lot more financially strapped than I was. So I made a deal that on Fridays, she would pick my kid up and keep them until Saturday and I’d pay her. A couple of years later, my workplace shut down for remodeling, and I didn’t need her to babysit any more. She went off on me, saying she relied on that income, and how dare I take food out of her child’s mouth, blah blah blah. \n\nYeah, that was too much for me. No more friendship.",
   "created_utc": 1691294753,
   "score": 51,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzmpzg",
   "message": "Continually insulted me after I tried to talk to him several times.",
   "created_utc": 1691294757,
   "score": 7,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzmvix",
   "message": "I was going to end up dead or in jail if I kept hanging out with her. I actually stopped being friends with her twice.",
   "created_utc": 1691294842,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzmy65",
   "message": "When a former friend decided to try to keep being mutual friends with me and an ex. I made the mistake of venting my feelings to them about the breakup (I was 21, okay? lol) and said friend decided to tell my friend everything about what I said about them. It caused an argument between us, even tho my words were never even meant to REACH to my ex.\n\nI made the mistake of trusting my friend with venting again (look, I was depressed and really wanted someone to listen) and, surprise surprise, the same thing happened again.\n\nAfter that, even though I had no one else to talk to, I cut that friend from my life bc they betrayed my trust twice and I wasn't willing to risk the stress again. That was over a decade ago and I still have no regrets.",
   "created_utc": 1691294883,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzmzyw",
   "message": "She was an emotional vampire. Everything was either a pity party for her or a celebration of whatever achievement she had gotten. But if I or anyone else needed sympathy or anything, we were obviously very selfish people and were complaining too much. Or if anyone wanted to celebrate an achievement, we were rubbing it in her face.\n\nAlso, she was super flakey. Once, we planned to meet at the gym and she never showed. I texted and called but got nothing until about 2 hours later when she said she was at another friend's house.",
   "created_utc": 1691294910,
   "score": 5,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzn0aj",
   "message": "I couldn't talk any sense in him. He kept hooking up with random strangers and rushing into short-lasting relationships with hookups while complaining all men are trash he couldn't find a decent bf. Told me he tested for STI in a LONG time having unsafe sex with strangers and he's scared for his life that he may got something.",
   "created_utc": 1691294915,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzn0gh",
   "message": "wanted to get sober and they didn't",
   "created_utc": 1691294918,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzn17g",
   "message": "Always asking for something. Always in need of something. I couldn't say what I ate for lunch or dinner because he would ask me to take him some. Always asking for rides. Used guilt trips and other forms of manipulation.",
   "created_utc": 1691294929,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzn1cc",
   "message": "He was a user and a loser.",
   "created_utc": 1691294932,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzn1r5",
   "message": "It was a healthier choice for me. I miss our bickering.",
   "created_utc": 1691294938,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzn32t",
   "message": "Cause I found out he SA’d another friend while they were dating.",
   "created_utc": 1691294959,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzn4cd",
   "message": "Because she’s 40 and keeps choosing a man who has hit her in the face, attempted to smother her with a pillow, and she has 3 kids (previous marriage) who I’m sure are not ignorant of what’s going on…. and somehow thinks that’s acceptable. \n\nAnd she’s choosing him over everyone else. She was supposed to come up this weekend to visit me after canceling on me last month. A few years back she came up a day late because she was so busy with this dude. She was all apologies and did show up but still… we had plans! \n\nSo when she apologized and said she’d book the flight for this month, I rolled my eyes and figured I shouldn’t hold my breath. I was absolutely right. Never heard another word but saw her out partying on Instagram last night. I definitely know I’m not important to her, so I’m wiping my hands of this one. Sucks because we’ve been friends for like 15 years.",
   "created_utc": 1691294977,
   "score": 5,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzn8gk",
   "message": "He convinced a long-term friend of mine to do graffiti and was kind of a jerk to me, although when we first met in 7th grade, he was saying how bullying people was wrong. Over time he slowly became the bully and I unfriended him day of graduation.",
   "created_utc": 1691295035,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzn8nk",
   "message": "she was very controlling and just flat out rude. talked about everybody behind their backs and anytime i told her an issue i had with her it was defense mode. i could only take so much of it.",
   "created_utc": 1691295038,
   "score": 8,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzn9ln",
   "message": "I was a nerdy kid in junior high school and started receiving some bullying (nothing too serious, mostly verbal). One day, I realized my best friend since 2nd grade was laughing along. I learned around that time that we would be moving house the next year, and I felt great about it. Since moving, I ran into him once in college (different majors), and he was back to being a humble farm kid. He seems to be living well, and I wish him happiness.",
   "created_utc": 1691295053,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzncxv",
   "message": "He bought a CBD processing business and then every conversation revolved around how CBD would do everything from cure cancer to fix your relationship with your in-laws.",
   "created_utc": 1691295100,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzneq6",
   "message": "Our friendship seemed to be predicated on her seeing me as less than her. We were both musicians - her more successful than me; I did it mostly as a hobby - and I slowly began to realize that she wasn’t happy for any of my music-related accomplishments and was constantly condescending or trying to one-up me. She did this about other things, too, like physical appearance, but music was the most notable one. I was tired of leaving conversations with her feeling slightly worse about myself while having a hard time placing exactly why, since she did it all in such a fake-nice way.",
   "created_utc": 1691295124,
   "score": 2,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznhy0",
   "message": "Extreme toxicity and sabotage",
   "created_utc": 1691295171,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznim9",
   "message": "I started fainting out of fear of seeing her. She was a genuine psychopath.",
   "created_utc": 1691295181,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznirw",
   "message": "He became trans outta nowhere. Woulda been fine with it if he acted the same, except as a girl, but all his interests changed, said the old him was a lie and dead, and his only interests now are hating men, makeup, having orgies with other strangers and typical satanic sjw vegan stuff. Complete flip of who he was and said he wanted, I believe he was actually brainwashed.\n\nAt the very very least, this means I can't trust him anymore",
   "created_utc": 1691295183,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznl1c",
   "message": "One of my childhood best friends became a child predator. I saw the first sign when we were about 21 years old. \n\nBroke my heart and angered me and everything in between. I feel justified.",
   "created_utc": 1691295215,
   "score": 2,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznl97",
   "message": "When her venting became toxic dumping. I would always try to listen to her. Sometimes I would tell her what I thought might help in whatever situation she was dealing with. She never took my advice and continued to toxic dump. Also she was rich and I was struggling through college and we would go get dinner and she would order apps and dessert and an expensive entree. I would get a cheap entree and this girl really made me split the check with her 50/50. SMH thinking about it.",
   "created_utc": 1691295218,
   "score": 24,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznpxj",
   "message": "i realized that she didn’t have my best interests at heart. she liked to grind me down and make me feel like shit so that i would need her comfort. i doubt she was doing that consciously,  but- regardless- it became unhealthy to even allow a casual friendship with her.",
   "created_utc": 1691295288,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznsu9",
   "message": "Other side of the fence here, I drank to much. We actually live across the street from each other. I see him almost every morning when I take my kids to the babysitter. Been friends for 23 years, but we barely talk anymore. I still drink, but not like I did then, man is like my brother and I don't know how to begin fixing it.",
   "created_utc": 1691295333,
   "score": 61,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznt0l",
   "message": "We were friends for 8 years, and on top of making everyone I brought him around viscerally uncomfortable, he got accused of sexual assault. \n\nIt’s weird, he didn’t need to tell me because I had no connection to those people or the girl in question, but he did, and made sure to paint himself as the victim and her as the liar. I believed him. \n\nBut then I took him with me to a house party, and he had one beer and thought it would be hilarious to wrap his arms around some girls ankles while refusing to let go while everyone demanded he stopped, until he felt like letting go. I had never seen this side of him as most of our relationship was 1 on 1 so it was pretty damn surprising, concerning and a bit frightening to witness (not to mention mortifying).  \n\nHe started saying stuff like “dirty fucking whore” to describe woman who rejected him for being a creep; total incel shit. I would call him hysterical telling him he can’t talk about woman like that and he would argue and act like it was no big deal.\n\nThen he got accused of assault again…and again. I couldn’t bury myself in denial anymore. The guy I thought was a kind, mild mannered, misunderstood person was a narcissistic incel at best and some kind of rapist at worst.",
   "created_utc": 1691295336,
   "score": 150,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznu2t",
   "message": "I just distanced myself because i couldn’t mantain the friendship. It’s mostly my fault",
   "created_utc": 1691295351,
   "score": 5,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznudh",
   "message": "I’d just finally had enough.\n\nWe had been like brothers for a long time. The guy was loyal as all get out and could be a fun hang, but he was also a massively over competitive dick with a chip on his shoulder and an inability to compromise. \n\nThe last time I saw him, we hadn’t seen each other in a few years and it was clear he had not changed at all. Whereas I had. And that was that.\n\nI wish him all the best, still comment on pics of his kids that his wife posts on Instagram, and I hope that he and his family have wonderful, happy, fulfilling lives. \n\nI just don’t  wanna hang with him ever again.",
   "created_utc": 1691295355,
   "score": 2,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznv9t",
   "message": "Kept asking for money every time I visited him so he could buy alcohol.  He didn’t want to hang out, he just wanted to get wasted.  \n\nLast time we spoke, he called and cussed me out because he gave me an invite to join an exclusive torrenting website a few months prior, and I hadn’t logged on in two weeks.   I guess to him at this point, I was ungrateful.  I laughed at him and told him to fuck off.\n\nHe passed away about 18 months later. \n\nStill irks me to this day that our last conversation was an argument over some trivial shit.  He was my absolute closest friend for 30+ years.  I regret having not made amends and not doing enough to convince him to stop self-medicating w/ booze.  I miss him soooo much.\n\nWe were the closest of friends for 30+ years.  Depression and self-medicating got the best of him.",
   "created_utc": 1691295370,
   "score": 18,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznxh9",
   "message": "She posted a Facebook rant about how nobody was ever there for her after the one time I didn't answer the phone during class. And then bitched at me for getting on Facebook to defend myself.\n\nShe only called me to complain about how *lonely* she was at the school she chose to transfer to, but never actively chose to take my advice or make any attempt to find new friends.",
   "created_utc": 1691295403,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznyqx",
   "message": "Meth addiction but it was more the lies that went with it.",
   "created_utc": 1691295422,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juznz2c",
   "message": "Snake in tall grass.",
   "created_utc": 1691295428,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzo2ph",
   "message": "Didn't respect boundaries and made me feel like I owed him things, even though I saved his life twice. I don't like thinking of interpersonal relationships in terms of debt ledgers but he made it feel like that.",
   "created_utc": 1691295484,
   "score": 3,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzo6c0",
   "message": "I had this boyfriend in the past and he was always threatening me and making me scared and saying he would call CPS on me to take me away from my parents (although I wouldn't mind leaving my parents they are extremely toxic), it still scared me that he would force me to live with him and use me as a toy. One day he screamed at me saying he'd \"put me in a testing tube so I can be experimented on\" if I didn't do what I said, I had enough and I cut off every single bit of contact with him and I blocked all of his friends as well.",
   "created_utc": 1691295540,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzo9b5",
   "message": "Consistent victim mentality and main character syndrome",
   "created_utc": 1691295587,
   "score": 2,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzobay",
   "message": "She became a source of toxicity in my life, and in hindsight, everything around and about her was trouble: her family, her friendships, her jobs, her borderline alcoholism, and specially, her utterly dysfunctional relationships. She was dragging me down and, alas, being with her brought little to no good to my life.",
   "created_utc": 1691295617,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzod9w",
   "message": "I’m considering ending a friendship because when we finally made plans, after several months of them “being too busy”, I noticed a huge elephant in the room.\n\nI asked how they think the friendship is going and then they told me I’ve been a bad friend for 8 months straight, without my knowledge at all. They said they’ll probably would’ve just let the friendship fade out if I didn’t point anything out. They also said I own them for that???\n\nNow I just feel weird about the relation because it seems like they’ve been holding a grudge on me, but didn’t plan on telling me -  like what am I supposed to do? I’m not inside your fucking head.",
   "created_utc": 1691295648,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzodc2",
   "message": "I just freeze - I just freeze every time you see through me and it's all over you - electric blue. \\~Icehouse, 1988",
   "created_utc": 1691295649,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzohtt",
   "message": "I knew him from hanging out in the early 90s, when I knew no better. He was a selfish, bitter ball of poison. A scruffy, dirty, alcoholic trainwreck who often stank an awful odour, smoked too much and let his teeth fall apart and go black.  Walk into a pub with him and we’d often be thrown out on sight. \n\nI stayed in contact with him until 2012 because I don’t like to bin people off, however he brought nothing to the table.  Every single thing that he touched in life would turn to shit. Often he had it handed to him on a plate,with a job invented just for him in the family business. All he had to do was fill bottles of ink up and put them in boxes under the grand title of ‘production manager’ on a good wage, yet he managed to get sacked and reinstated on several occasions - for stealing from the charity box or misusing the company credit card.  He also upset all the other employees with his antics, often being drunk at work. A complete pisstaker; totally selfish and totally ungrateful.\n\nThe very last time I saw him, his neck was covered in boils, yet he was rude to me about my appearance and when he shook my hand, a load of muck came off his onto mine and I couldn’t wash it until I got home. It was minging! There and then I decided to never see him again, only speaking to him on the phone a few times in the following years.\n\nHe was advised to wise up and sort himself out by many people including myself over the years but he didn’t care or listen, often laughing at any advice or warnings given.\n\nNow I look back, I think he was some kind of self harmer and I wish he could have been helped, however he’d listen to nobody apart from his dodgy associates or the ‘bloke at the end of the bar’.\n\nHe died of throat cancer aged fifty on Christmas Day 2022.",
   "created_utc": 1691295718,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzohxc",
   "message": "She wouldn't quit complaining about my brother. He wouldn't quit complaining about her. I felt like the mom of two kids. I rented out rooms to both of them. I told her if she didn't quit complaining  she'd have to move. I found another place for my brother to move into but it wasn't fast enough for her. So I wrote her a very detailed note about how she fights with everyone She's never had the same employer for a year, she fights with her identical  twin sister. I just had it, they were both stressing  me out. I'm regretful for being so mean, I do feel she needed to hear it. Both these people were in their 50s.i wish it didn't  end the way it did.",
   "created_utc": 1691295720,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzomec",
   "message": "There were quite a few reasons. The main, or the final nail in the coffin, was that he tried to tell me the Jan 6th. Insurrection was nothing but a peaceful demonstration… as it was unfolding on the news.\n\nY’all, that day was so fucked up that I had a therapy appointment that day. My own psychologist was in no position to hold a session with me. It was that traumatic.",
   "created_utc": 1691295789,
   "score": 1,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzoqd5",
   "message": "We all have our limits, but turning into a Neo-Nazi over a movie? Now that's dedication!",
   "created_utc": 1691295853,
   "score": 8,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzpnzr",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzq85r",
   "message": "I was standing next to my mom's casket and he was texting me a flood of texts about how his parents/mom wouldn't let him come to the funeral. He didn't find out I unfriended him on Facebook till 3 or 4 months later and thought I \"just did it\" at the time. Sometimes I feel like I overreacted but I had alot of other things to do at the time and it felt like he did was prioritizing himself during a relatively large issue I was dealing with",
   "created_utc": 1691296722,
   "score": 3,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzs5wr",
   "message": "After 15 years, I was still on friend probation. She was still deciding whether she would continue to be my friend or not. Every once in a while she would ghost me. And she wouldn't communicate, but would do passive-aggressive things to try to hurt me so I would get mad enough to say something and THEN she would tell me what was wrong.\n\nI realized I would have never treated her like she was treating me, and I deserved better.",
   "created_utc": 1691297910,
   "score": 38,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzsl7j",
   "message": "I had just gained confidence to wear shorts and skirts (i have/had very noticeable scars all along my thighs and legs) and she pointed them out and asked what was wrong with me. She said it in a very rude tone and just stared at me as I cried. Needless to say, I didn’t wear shorts or skirts for years and I stopped talking to her after that.",
   "created_utc": 1691298178,
   "score": 38,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzwpri",
   "message": "He tried to tell me that his work stresses were more stressful than me losing my child, and that's why he wasn't available to offer support when i needed him in my darkest hour.\n\nDon't plan on ever speaking to him again.",
   "created_utc": 1691300864,
   "score": 45,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzyxr6",
   "message": "She supported Sarah Palin and Ted Cruz.",
   "created_utc": 1691302447,
   "score": 4,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "jv00etk",
   "message": "My best friend in high school was a chick. She dated one of my other buddies through high school. \n\nWhen I first met her I had wanted to date her but she liked my buddy so I moved on. Well later on I introduced her to my buddy and she introduced me to her friends. I had a blast.\n\nSeveral years go by we graduate. My buddy and my best friend go to college together and move in together. I go somewhere else. \n\nThey don’t do well together and break up. By this point I have a girlfriend. She’s great and she gets along with best friend.\n\nSeveral more years pass we are still friends she gets married gets pregnant, has some great kids looks to be having an awesome life. I also got married had kids so and so and anyway.\n\nWell then we were having a conversation about how things turned out how cool it was that we were still friends after so long.\n\nThen she turns to me and says she made a bad mistake back in the day. She should have hooked up with me and had kids with me so I would marry her and we would grow old together. \n\nShe said this while rubbing her hand on my thigh. My wife and kids, her husband and kids were in a different room. She shot her shot 8 years too late. If she had asked before dating my buddy maybe. However I love my family and my wife so it was a no brainer. She insisted and tried to kiss me. I said no. We finished out the evening  went home and I haven’t talked to her since. That was 8 years ago.\n\nShe was my friend and tried to get me to cheat on my wife, while also cheating on her husband while also telling me she should have trapped me when we were in high school. The person who I thought had been my best friend who I thought I had known was actually a terrible person.",
   "created_utc": 1691303530,
   "score": 191,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzph79",
   "message": "Len Wein quote:\n\nA true friend is someone who is there for you when he'd rather be anywhere else.\n\nFriends who aren't there through the good and bad, I've cut off.  It is important to have friends who mutually help each other grow and listen, have good conversations, don't judge, and, of course, like ipas..haha",
   "created_utc": 1691296284,
   "score": 24,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzpiwn",
   "message": "She was constantly talking negatively about me, behind my back to mutual friends. Her and another mutual friend were mean girls when they were together and seemed to target me, for whatever reason. She was also very blunt, but not in a constructive way, it was more bullying. \nI finally had enough.  I completely ghosted her, and I know that might have been the wrong way to go about it, but after all her bullying and trash talking I owed her nothing, so she got just that. Life is too short and the mean girl highschool bullshit had to stop.",
   "created_utc": 1691296311,
   "score": 8,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzsygz",
   "message": "Cocaine, needed to stop because my good freinds were bailing on me and told me that's why. I erased a lot of \"freinds\". The few who remained still remain and I owe them my life.",
   "created_utc": 1691298410,
   "score": 3,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juztldn",
   "message": "The concept that she had the right to comment on, critise , and offer her solutions to my life just became too much suddenly. Everything from my weight to job and husband. My jacket would look better on her.  Her husband deciding i should go to university.   5 years later I don't miss her at all.",
   "created_utc": 1691298809,
   "score": 5,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzwqn8",
   "message": "He confessed he liked me, and when I said \"no\" because I'm straight and I have a girlfriend, he kept pushing to \"just try\" \"pretend to be gay and date me\". I said no \"I'm just a friend and I'd like to keep it that way, we will never be morethan that\" I treated him like a brother. We were friends for almost 6 years at that point, so it was a hard decision to cut him off. But I had to because he just kept pushing and pushing to the point I became uncomfortable and felt pressured.",
   "created_utc": 1691300882,
   "score": 28,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzzhc9",
   "message": "she told me I wasn't a good friend after i took work off for a week to watch over her after a suicide attempt. i ordered her food, changed her bandages, updated her family, and literally got no sleep. yet I wasn't a good friend...",
   "created_utc": 1691302838,
   "score": 26,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzzkr3",
   "message": "Used to call me everyday talking about how he did this and that and blah blah blah. But at school he didn't even bother looking at me because his friends will think he's \"wierd\" if he sits with me. nice",
   "created_utc": 1691302905,
   "score": 3,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "jv00pri",
   "message": "She couldn't ever admit she was at fault or take responsibility for anything ever. If something went wrong, it was always someone else's fault, always some excuse as to why she did or didn't do / say something. She always played victim and mixed her stories to always sound like the good guy. But her lies always collapsed on themselves and I reached my breaking point",
   "created_utc": 1691303760,
   "score": 25,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "jv00r60",
   "message": "He would flake on me lots in a very disrespectful way like lying to me. One we were both on holidays in Thailand and we were supposed to go to another city together but he told me he was sick and decided to stay, instead he went somewhere else at the very last possible minute. I was pissed but decided that was fine and stayed friends for another year. He was constantly talking down to me, ditching me, speaking quite rudely to me. \n\nThe last straw was on new years eve when we had plans, i booked a hotel in the city because i lived a good 90 mins away but also had free cancellation. I made backup plans because my spider senses were tingling and again very last minute he told me he had \"cold symptoms\". Like i could have cancelled my $250 acommodation for free and that fucker just wasted my time and money when all he had to do was tell me the day of before 2pm \"sorry, not feeling well\". \n\nAnd he had the nerve to get angry when one of his dates cancelled last minute that fucking hypocryte. Anyways i blocked him on everything without an explanation so i don't know if he tried to contact me again and while it hurt to let him go (still does tbh, i dont have many friends at all) being treated like that will no longer be my problem.",
   "created_utc": 1691303789,
   "score": 3,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzxu8l",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzpz1f",
   "message": "He would only call when he needed something.  Money, a ride, a favor, ...   Then when we would make plans to hang out, or if I needed a favor, he would stand me up and disappear for a few days or weeks.  Eventually I would get a text \"sorry, something came up\"",
   "created_utc": 1691296571,
   "score": 3,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "jv0hpzy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzsmko",
   "message": "She was an alcoholic, and had no boundaries.  And I didn't trust her around my husband.  She liked to \"get with  the men i  liked\".",
   "created_utc": 1691298201,
   "score": 6,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzy6bu",
   "message": "Best friend of over 30 yrs.  I considered and even called him my brother.  I caught him trying to hook up with my wife when she was too drunk to resist.  I kicked him out of my house and haven't spoken to him since, and have no intention of ever doing so again.",
   "created_utc": 1691301897,
   "score": 42,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "jv039ke",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "jv0mb3l",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzwq9n",
   "message": "Not my friend, but my ex-wife's friend (wife at the time).\n\nShe was trying to spend some time away from her boyfriend with her baby, because he was abusive. A few days into her staying at our house, she INVITES the son of a bitch into my house. The same idiot she was trying to avoid.\n\nI kicked him out and told him he wasn't allowed even to the end of my driveway.\n\nCue three days later, I'm heading home from work and I'm going to stop at home before I head to our local high school football game (my ex was working with the band at the time)\n\nWell I get this phone call from her friend saying that she came home and the front door was unlocked and open so I haul ass home.\n\nHer mattress was slightly askew, but the only thing missing was my iMac, my external hard drives and all of my software CD/DVD's. Not even the box with cash in it that was sitting directly behind the iMac. Only the specific things that meant the most to me specifically.\n\nI knew exactly what had happened. She wasn't overly concerned, and knew EXACTLY what was missing when I got there.\n\nThe police came and since we didn't have any security footage, they really couldn't do anything (or at least said they couldn't)\n\nWe kicked her out and I put her on notice that if she or her boyfriend were seen near our house again, it wouldn't be pretty.\n\nWe lost the entire first 2 years of my son's life in digital photos because they stole not only the computer, but the hard drive backups as well. (We managed to get back 80% of them through parents etc but this was like 2007 so cloud backups weren't really widespread solutions at the time).",
   "created_utc": 1691300874,
   "score": 16,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "juzr3oz",
   "message": "She drained me and she also didn’t even notice I was at a really low point at my life when she was venting very triggering things to me\n\nWe both needed therapy. But the dynamic became very uneven and I was the therapist friend",
   "created_utc": 1691297249,
   "score": 15,
   "submission_id": "15jdgqx"
  },
  {
   "comment_id": "jv0sfy2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jdgqx"
  }
 ]
}