{
 "submission_id": "15je5aw",
 "title": "What is a profound statement your therapist has told you?",
 "selftext": "",
 "created_utc": 1691289578,
 "permalink": "/r/AskReddit/comments/15je5aw/what_is_a_profound_statement_your_therapist_has/",
 "score": 224,
 "url": "https://www.reddit.com/r/AskReddit/comments/15je5aw/what_is_a_profound_statement_your_therapist_has/",
 "comments": [
  {
   "comment_id": "juzl4mq",
   "message": "\"You're trying to rationalize something said by an irrational person. You won't make sense from nonsense. \"",
   "created_utc": 1691293903,
   "score": 188,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzdtrs",
   "message": "“Is this harming you or is this just uncomfortable?”\n\nNot every difficult situation is harming us, sometimes it’s just a stretch and those are uncomfortable. If it’s uncomfortable, it’s likely teaching you something and would be worth working through. I’m high strung with anxiety, so this helped me calm down and look at difficult situations more objectively.",
   "created_utc": 1691290130,
   "score": 186,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzgu64",
   "message": "Worrying about something makes you experience it twice ;)",
   "created_utc": 1691291646,
   "score": 221,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzfoks",
   "message": "Forgiveness of another person is not a necessity to move on, despite what people say. But you DO need to forgive YOURSELF for not being able to forgive the person who wronged you, otherwise, you’ll hold onto anger forever. Once you let go of THEM, forgiveness aside, your life is that much better.",
   "created_utc": 1691291075,
   "score": 123,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzhdgd",
   "message": "Not profound but she noticed I was very hard on myself and asked me if I would talk to others the way I talk to myself",
   "created_utc": 1691291921,
   "score": 141,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzm6mz",
   "message": "\\*flips page over to start writing on the back\\*  \n\"Okay, I'm just going to stop you here for a minute.  I have filled up two entire page on just your family history and relationships.  Most people have half a page to a page at most and we're still only into your middle school years.  It's okay to not be okay about this.\"  \nNo one had ever told me that not only was it weird the number of people who came and went in my life, but that it was okay to feel conflicted about it.",
   "created_utc": 1691294467,
   "score": 94,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzmieh",
   "message": "We judge ourselves by our intentions but we judge others by their actions.",
   "created_utc": 1691294643,
   "score": 216,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzcutc",
   "message": "Coping skills are like any other skill. You must develop them over time so you're prepared when bad things happen.",
   "created_utc": 1691289639,
   "score": 37,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzkztf",
   "message": "You don’t have to wait for something terrible to happen before you change your behavior",
   "created_utc": 1691293834,
   "score": 71,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzctis",
   "message": "“You don’t like your parents, do you.”",
   "created_utc": 1691289622,
   "score": 58,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzfpf2",
   "message": "\"You loved them, I don't doubt it, but did you actually *like* them?\"",
   "created_utc": 1691291087,
   "score": 42,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzfufz",
   "message": "That will cost $300 for 45 minutes.",
   "created_utc": 1691291156,
   "score": 41,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzdeiy",
   "message": "My therapist has always told me to not let other people’s opinions about other individuals to impact your opinion with those individuals. Friendships and families can easily get ruined by this if you just go with the flow of everyone else.",
   "created_utc": 1691289917,
   "score": 23,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzp2j6",
   "message": "She pointed out that a lot of the things I do or don’t do that I hate about myself are coping/survival mechanisms. They were important to surviving a shitty upbringing and now that I’m safe they aren’t needed. UnLearning these traits/habits are hard. It’s not my fault and allow myself to recognize that.",
   "created_utc": 1691296046,
   "score": 42,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzplol",
   "message": "you're borderline .things are always going to be difficult for you .",
   "created_utc": 1691296356,
   "score": 21,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzqgur",
   "message": "\"There is no law that says you have to have a relationship with your parents if you don't feel safe having one.\"",
   "created_utc": 1691296866,
   "score": 29,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzpn3q",
   "message": "“Many intrafamily problems boil down to bad manners.”",
   "created_utc": 1691296379,
   "score": 15,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzqoxg",
   "message": "He who smelt it…..did not necessarily dealt it",
   "created_utc": 1691296999,
   "score": 8,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzx9yk",
   "message": "“The normal amount of suicidal thoughts is zero.”",
   "created_utc": 1691301251,
   "score": 57,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzw8zm",
   "message": "i never ever realized this before and it’s gonna make me seem like an idiot but it was profound to me. “you aren’t compatible with everyone” i used to think that i could make a relationship work with anyone as long as the effort was there. but she opened my eyes to realizing that what makes someone special is when you both are compatible with each other because that’s actually a very rare thing to find",
   "created_utc": 1691300549,
   "score": 25,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv02yx8",
   "message": "When I came back from Iraq, I was not in a good place. Was dealing with some serious PTSD, and started to withdraw from the world. Finally, I saw the VA was offering free mental health therapy for returning vets, so I gave them a call. The therapist came out to my place and we talked for a bit, and then he said something that made me think for the first time there was light at the end of the tunnel.\n\n\"You know, you're not half as crazy as you think you are.\"\n\nThat one sentence helped me find my way back. I'll never forget that.",
   "created_utc": 1691305467,
   "score": 71,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv04l3q",
   "message": "Your ability to cut people off and self isolate is a trauma response to never having anyone to depend on when you were young.",
   "created_utc": 1691306711,
   "score": 88,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzrvyj",
   "message": "“You are healthy until an actual doctor tells you otherwise… you are not a doctor and neither is google.”\n\nI have health anxiety and always think something is wrong and being missed by doctors.",
   "created_utc": 1691297733,
   "score": 21,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzu9ea",
   "message": "You don’t have to agree with your partner but you do have to listen.",
   "created_utc": 1691299239,
   "score": 21,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzvbq4",
   "message": "Respond, don’t react.",
   "created_utc": 1691299932,
   "score": 32,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzxkbi",
   "message": "\"Why aren't you as compassionate to your own brain when it's struggling as you are to your friends and family when they need help?\"",
   "created_utc": 1691301454,
   "score": 11,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv004a9",
   "message": "After telling him about my relationship with my ex-husband for several weeks, and I chose a male therapist that time around because I was trying to better parent my son and looking for some male insights into my ex and my son, he said regarding my ex: \"Sounds like the marriage was just about sex to him.\"\n\nThat one statement was like the key to the kingdom of my understanding into every horrible part of my ex-husband's character and motivations. Helped me more than anything else I had read, or any other therapist I had seen,  to see him for what he really is, and not what he tells people he is. \n\nGuys, if you want to go into psychology and therapy, you really could help a lot of people understand a lot of men! Because I am telling ya', so many of us, we just don't understand how men think. I read AskMen often just to figure out what the heck is going on in the male brains of the world, and *why* the world keeps putting men in charge of everything!",
   "created_utc": 1691303309,
   "score": 9,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzh608",
   "message": "\"The correct amount of pain is zero\"",
   "created_utc": 1691291815,
   "score": 19,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzv7dd",
   "message": "He doesn't have to hit you for it to be abusive. \nYou don't have to be a saint to deserve safety.",
   "created_utc": 1691299850,
   "score": 18,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juztxnl",
   "message": "\"Do the people that want to change the world ever get attacked?\"",
   "created_utc": 1691299029,
   "score": 4,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzv0wn",
   "message": "“As humans we’re never always good, we’re always at a state of just okay. We go up and down but we’re never always happy. Lower your expectations.” I was 14 🙊",
   "created_utc": 1691299734,
   "score": 5,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzw42r",
   "message": "“this things that worry you don’t define you. you can change them, they’re not part of your identity”. \nthis because i was having severe anxiety due to feeling i was a horrible terrible evil person and was scared that i couldn’t be better even if i tried.",
   "created_utc": 1691300458,
   "score": 7,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzx1q2",
   "message": "Love is pain, pain is love.\n\nI've been dealing with grief for a long time, and it helped that make sense.",
   "created_utc": 1691301092,
   "score": 2,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzxjw7",
   "message": "“Your dad has to ask for forgiveness. Your mom has to ask for forgiveness. Your therapist has to ask for forgiveness. Everyone does.”",
   "created_utc": 1691301445,
   "score": 9,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzy6pt",
   "message": "Shame cannot exist in the light",
   "created_utc": 1691301904,
   "score": 7,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzz92b",
   "message": "\"People are not finished products.\"\n\nIt's really helped soften my outlook and attitude toward others and myself.",
   "created_utc": 1691302674,
   "score": 29,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzzxcz",
   "message": "Not a statement, but she called out the frequency with which I use the word “hopefully”—in most of those situations, I don’t need to hope, I can take action.",
   "created_utc": 1691303162,
   "score": 7,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv04q7k",
   "message": "I said that I felt guilty for staying with my abuser while waiting for the right time to move out because I was scared of being a victim of violence from them. She said “no, I’m proud of you for being so resilient”",
   "created_utc": 1691306824,
   "score": 4,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juznnig",
   "message": "“Happiness is a choice.”",
   "created_utc": 1691295252,
   "score": 6,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzpkxk",
   "message": "“Denial is a highly underrated coping mechanism.”",
   "created_utc": 1691296343,
   "score": 11,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzi8bt",
   "message": "Good parenting or bad parenting, all parenting leads to therapy.",
   "created_utc": 1691292363,
   "score": 6,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juztky9",
   "message": "I feel like OP needs to be paying some of y’all. I also might have cured by depression with this thread, lol.",
   "created_utc": 1691298802,
   "score": 8,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzx1r0",
   "message": "Ex wife used to get very annoyed because while she was on maternity leave when I got home I’d go and get changed, use the loo, and have a bit of food and drink, all before taking the little one off of her so that she could have a rest. All tolled it was probably 15 minutes extra. She brought this up to our counsellor; in reality I’d been up since 6am doing a morning feed of the baby, hadn’t eaten breakfast or lunch, and only had time to drink cups of tea made for me by someone else.\n\n‘If you’re on a plane and the oxygen masks deploy, you have to put your own on before you can help anyone else. If you aren’t properly looked after how will you look after someone else?’",
   "created_utc": 1691301093,
   "score": 10,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzxhg2",
   "message": "Do you think it is okay for a therapist to smoke pot?",
   "created_utc": 1691301397,
   "score": 3,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzxkpf",
   "message": "When you worry about the future and focus to much on the past you’ve got one leg past another on the future and your just pissing on the present.",
   "created_utc": 1691301462,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzzkvh",
   "message": "\"Guilt is a selfish emotion\" still trying to completely figure that one out",
   "created_utc": 1691302907,
   "score": 5,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv03gsf",
   "message": "\"You have the biggest dick I've ever seen on a man\"\n\nHe was a real nice fella",
   "created_utc": 1691305845,
   "score": 253,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv03reg",
   "message": "I was talking about my relationships with other people, and I said \"you can't peoples minds\", and he said, \"no, you can't\". He looked a bit sheepish, and then said, \" I suppose I shouldn't say that, as a therapist\", and we both laughed.",
   "created_utc": 1691306073,
   "score": 2,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv04je0",
   "message": "Be compassionate to yourself.",
   "created_utc": 1691306673,
   "score": 5,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzn22v",
   "message": "\"We overestimate our ability to grow change and underestimate everyone else's\"",
   "created_utc": 1691294944,
   "score": 5,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzuk3w",
   "message": "\"I can't be your therapist anymore here try this site it's pretty much the same as talking to me but free, its called reddit\"",
   "created_utc": 1691299431,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv04wou",
   "message": "“I’m not here to answer your questions, I’m here to let you find your own answers” \nThis saved me so much money on therapy.",
   "created_utc": 1691306968,
   "score": 10,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzk4g1",
   "message": "''You're fine, it's not a big deal.''",
   "created_utc": 1691293365,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzr1cp",
   "message": "Material things will never make you happy.",
   "created_utc": 1691297210,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzuj6l",
   "message": "Sometimes people are just mean because they are, no rhyme or reason",
   "created_utc": 1691299414,
   "score": 2,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "juzyza3",
   "message": "After my family throwing me through all this weird shit . The lady I talked everyday for a year told me I just think to much.",
   "created_utc": 1691302477,
   "score": 2,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv042rq",
   "message": "Me who cant afford therapy reading all this",
   "created_utc": 1691306314,
   "score": 7,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv05tea",
   "message": "Not to reproduce, because I was depressed.\n\nA lot of therapists aren't very good.",
   "created_utc": 1691307685,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv060a7",
   "message": "If someone can't or won't meet you halfway, that doesn't mean you go further. 100% of the time, that will lead to resentment.",
   "created_utc": 1691307838,
   "score": 25,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv06bvv",
   "message": "\"You don't walk away from this situation, you run,\" therapist at the VA when I told her what my ex was doing to me. \n\nNote to self: Never date a marine who gets kicked out of a country for drug problems. \n\nI wish I could thank that therapist.",
   "created_utc": 1691308092,
   "score": 6,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv06xrk",
   "message": "“ You know, we could just keep talking about this , or you could do what you said you were going to do a month ago, it’s your money”",
   "created_utc": 1691308572,
   "score": 7,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0931h",
   "message": "\"If your life feels like a sinking ship, know that you have to swim first. You have to look after yourself first or you'll drown too. Don't worry about anyone else until you've saved yourself.\"",
   "created_utc": 1691310301,
   "score": 3,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv094m5",
   "message": "\"You can't get others to like you without liking yourself\"",
   "created_utc": 1691310338,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0998a",
   "message": "\"You couldn't have known it would end up this way, you were 8\"",
   "created_utc": 1691310443,
   "score": 9,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0etip",
   "message": "“Neglect is a form of abuse.”",
   "created_utc": 1691314982,
   "score": 10,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0azdj",
   "message": "Therapist: 'If life gives you lemons, make sure to add some sugar and vodka!'",
   "created_utc": 1691311853,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0btoz",
   "message": "There's no such thing as normal.",
   "created_utc": 1691312538,
   "score": 5,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0csl9",
   "message": "That I am not a mind reader, and that my routines will not make any difference to what will happen. It sounds so bloody obvious when you say it out loud.",
   "created_utc": 1691313330,
   "score": 5,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0dwb2",
   "message": "\"A relationship is like a bone fracture: when all parties do the work to repair it, it gets stronger. When one party doesnt, its time to sever.\"\n\nMy therapist told me this when I explained the relationships I have with two of my friends. With one friend we've wronged each other but we owned up to it and worked it out. This person is my best friend in the world! However, one friend I had would always flake out on me when we'd make plans and then I'd see them on snapchat partying with everyone that wasn't me. On top of that communication with this person was always poor on their end so then I decided I can play that game too. Haven't spoken to them since.",
   "created_utc": 1691314232,
   "score": 6,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0bgf8",
   "message": "I told my therapist that there was a such thing as better and worse human traits, and his response was that there was not. I told him hypothetically, if it were very important for us to jump very high, and that this had obvious and lasting wide ranging benefits, humans with the trait of a high vertical jump would have a better trait than those humans that could not. His response: But what if they preferred crawling?\n\nThe profundity did not come from the elegant exposure to the truth we crave, but from the jarring whiplash of realization that this person was so impossibly stupid that there wasn't a damned thing I would ever learn from him.",
   "created_utc": 1691312238,
   "score": 0,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0e9fi",
   "message": "\"you boy, are crazier than a coconut\"",
   "created_utc": 1691314525,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0gv4g",
   "message": "„You have to change your attitude.“ \n\nThank you! Fuck you!",
   "created_utc": 1691316634,
   "score": 0,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0bdfi",
   "message": "Remember, you perpetually demean your own value and think the worst about how people view you.  Remember what’s real.",
   "created_utc": 1691312170,
   "score": 2,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0cg6u",
   "message": "“Don’t should all over yourself.”",
   "created_utc": 1691313044,
   "score": 3,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0eai0",
   "message": "\"Depression and anxiety is a result of many things, stimuli or phenomena. Your depression is a result of you living in the past. Your anxiety is your mind's focus on the future. You'd do well to live in the present.\" She was a tough love type of therapist but this really helped me.",
   "created_utc": 1691314547,
   "score": 7,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0eai4",
   "message": "When you place the decision of whether you are worthy in the hands of others, you give them the power. You need to decide for yourself you are worthy and stop giving the power to others.",
   "created_utc": 1691314548,
   "score": 4,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0edpw",
   "message": "Guess my attempts to explain why pineapple belongs on pizza are futile then! 🍍🍕",
   "created_utc": 1691314620,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0fe6o",
   "message": "'I'm wondering if you can hear all the ways in which you rob yourself of self-worth' \n\nOof to hear it as an active thing and a choice, rather than a passive thing or a fact, continually robbing myself. Totally changed my own personal narrative.",
   "created_utc": 1691315448,
   "score": 4,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0fyz9",
   "message": "Are your friends good people? Then lean on them a little, they won't mind.",
   "created_utc": 1691315913,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0golo",
   "message": "\"Just because you're thinking it, doesn't mean it's true.\" True that, depression is a fucking liar.\n\n\"Trauma doesn't have to be because of intensity, it can also be because of duration.\"",
   "created_utc": 1691316488,
   "score": 3,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0h0h6",
   "message": "“Your brain shuts off and stops focusing on other things if something as basic as your identity / self-awareness is challenged” (we were talking about figuring out my sexuality)",
   "created_utc": 1691316755,
   "score": 3,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0i6sr",
   "message": "\"You said you were an asshole. Are you OK with that? Do you want to change that? If you don't want to change we don't have anything to accomplish here and you can walk out of here and go live your asshole life.\"",
   "created_utc": 1691317692,
   "score": 5,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0jss9",
   "message": "“Your anxiety is not evil or an enemy, it’s like an overprotective friend trying to keep you safe, because it once saw you hurt. Don’t fighting it, prove it wrong”",
   "created_utc": 1691318939,
   "score": 13,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0p1ay",
   "message": "That a persons reaction to a given situation is 100% their own fault. \n\nNo one “makes you” do anything. If they call you a (bad name) and you punch them in the face, that’s on you. You can stand in a room of 100 people and all call them the same name… you’re gonna get different reactions. \n\nYou can’t control people being shitty. You can control how you react.",
   "created_utc": 1691322539,
   "score": 7,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0pbd7",
   "message": "What other people think of you is none of your business.",
   "created_utc": 1691322706,
   "score": 5,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0pcqx",
   "message": "I was married for over 10 years when my wife came out. I was in a tailspin of questions and went to therapy. The therapist said, “Stop berating yourself. She’s been gay all her Life. This is not about you. So, what else do you want to talk about.” That session was short but extremely helpful.",
   "created_utc": 1691322728,
   "score": 5,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0qf1o",
   "message": "Good enough is good enough.",
   "created_utc": 1691323378,
   "score": 2,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0r3kl",
   "message": "\"Sometimes you're going to have to decide if you want to be right or if you want to be happy.\"",
   "created_utc": 1691323784,
   "score": 3,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0kjz0",
   "message": "I don't remember his exact words, but it was along the lines of: \"Do you you know yourself better than other people do?\"\n\nAnd at first I was like, nonono, but he let me sit for a moment until the whole thing sat in.\n\nGrowing up with autism, at times, I did some peculiar things, and people were always telling me why I did them. They called it, \"attention seeking behavior\"\n\nI had difficulty interacting with others my age my entire youth. And once a certain threshold was passed, I'd fly into a blind rage and hurt someone, and I always regretted it. But nobody would believe me when I told them how little control I had over myself when it happened.\n\nI figured out some methods to avoid my threshold that, objectively, did not look good, like hitting myself in the head very hard or flying into a manic state where I'd insult myself. I really believed these were better options than flying into a uncontrollable violent rage, and I also believed that one day, I may go to prison over one of my episodes, but nobody really understood.\n\nAfter a while, I started believing that other people knew me better than I knew myself. Is that not a form of gaslighting?",
   "created_utc": 1691319498,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0m368",
   "message": "\nOHHHH BOY IVE BEEN WAITING FOR THIS ONE OKAY SO HERES THE LIST:\n\nWhen I was in 5th grade and I told my therapist about how my little brother would get me in trouble and tell my parents and they’d believe him over me when he was the one who started it. (For instance he’s punching me and I push him away and he starts screaming or crying and they only see me push him away) the comment made was:\n\n*”Well he is the younger one so he will be loved more because he’s closer to a baby then you are younger siblings have it better-……Your parents love him more then you”*\n\n\nWhen I was 15 in therapy for my ptsd from SA and other gruesome things that happened from being a newborn-5 and a half years old:\n\n*”ok you are too difficult to treat so I’m not going to set any appointments with you anymore. You are just too broken for me to fix and it’s just not worth my time”*\n\n\nWhen I was 16-17 and having family issues to the point where it was it was getting physical every day:\n\n*”Okay stop talking about your family and your issues let’s talk about something else because it’s too messy to fix and they won’t change”*\n\nAlso same age as above^\n\n*”You deserved it.  Other people have had worse SA and Physical A*use than you including my self*” \n\n\nStill to this day I’m flabbergasted.",
   "created_utc": 1691320594,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0m68x",
   "message": "\"Try to accept that you have a huge penis. Some people doesn't even have a penis, so consider yourself blessed with your enormous penis\"\n\nIt really made me appreciate my giant penis❤️",
   "created_utc": 1691320653,
   "score": 255,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0mjz5",
   "message": "Never gone to a therapist because I've never needed one. Fingers crossed it's always like that.",
   "created_utc": 1691320917,
   "score": 255,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0mp91",
   "message": "\"That'll be $120.  Same time next week?\"",
   "created_utc": 1691321018,
   "score": 2,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0n3wy",
   "message": "You have to take good care of yourself, before you can take care of others.",
   "created_utc": 1691321300,
   "score": 2,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0n5pt",
   "message": "Me: I feel like I'm so far behind everyone else.\nTherapist: You are. And that's okay.",
   "created_utc": 1691321334,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0nknu",
   "message": "“I want you to do what makes you happy and not give a single shit what anyone else thinks of you”.\n\nI still try my best on this one.",
   "created_utc": 1691321613,
   "score": 2,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0nm73",
   "message": "It be like that sometime.",
   "created_utc": 1691321641,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0o5ho",
   "message": "She pointed to a poster behind her desk of a kitten hanging on to a tree branch and told me to “hang in there”",
   "created_utc": 1691321987,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0omcl",
   "message": "In an argument, instead of just saying \"you did this\", say \"when you did this, it made me feel...\"",
   "created_utc": 1691322285,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0pb7k",
   "message": "Boundaries are love",
   "created_utc": 1691322704,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0pkvv",
   "message": "Kindness is a choice.",
   "created_utc": 1691322869,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0pwub",
   "message": "“No matter how hard the loss is, its ok to have fun.”",
   "created_utc": 1691323071,
   "score": 5,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0q3cy",
   "message": "Your baseline mental state is 'on edge' and the high cortisol levels that produces in your body is going to cause you to have an early heart attack.",
   "created_utc": 1691323183,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0rg27",
   "message": "Feelings are not facts. They are still valid, and important. But our feelings are not the truth of the matter. \n\nThat was a big one for me when it came to dealing with conflict in my relationship.",
   "created_utc": 1691323993,
   "score": 5,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0rtn2",
   "message": "Instead of being so worried about people liking you, ask yourself if you even like them in the first place.\n\n (Me being socially anxious and feeling shitty about having no friends in college, then realizing all the people I was trying to be friends with were assholes)",
   "created_utc": 1691324220,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0sd19",
   "message": "Everything you want is on the other side of fear\n\nAnd\n\nIf you're not willing to experience anxiety, you are going to experience anxiety.",
   "created_utc": 1691324536,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0sju9",
   "message": "Everyone should have standards for their life. It’s what keeps us aligned with our own values and sense of fulfillment. If you don’t uphold these standards, you’ll find yourself in situations you don’t want to be in, with people you don’t want to be with. \n\nIt sounds so basic but it struck a chord with me. I felt a lot of guilt for starting to say no to some friends who undoubtedly have a bad influence on me, as they would give me a lot of grief for saying no. When she said that, I realized it is perfectly normal and healthy to have standards for my life and I don’t ever have to feel bad or compromise that for someone else if I don’t want to.",
   "created_utc": 1691324650,
   "score": 3,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0spbp",
   "message": "Not me, but someone else \n\n“Don’t let your mood change the plan” \n\nReally helped me",
   "created_utc": 1691324741,
   "score": 4,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0t5cy",
   "message": "She agreed with me that my biggest issue is I’m an addict who chases dopamine. I’ve been reading Dopamine Nation per her request. Whether it’s drugs, porn, or even the validation from others. I find my wife boring but she’s exactly what I need. My ego tells me I want someone more exciting. I’m a wreck…",
   "created_utc": 1691325002,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0tlgc",
   "message": "Not a statement but he thoroughly rebuffed the notion that “if you’re bored, you must be boring too” which is a terrible way to think.",
   "created_utc": 1691325255,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0tmta",
   "message": "Not a therapist but one of my closest friends. We were talking about dating and sex. I told him how I don’t like myself. He said how do you want someone else to like you, when you don’t like yourself? It made me realize I have to stop focusing on the opposite sex and focus more on me.",
   "created_utc": 1691325277,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0y30a",
   "message": "“You can try everything to make a person less shitty, but sometimes a shitty person will remain shitty. Now your job is how to prevent their shittiness from ruining you.”\n\nOf course I rephrase that. But I live by it everyday and life is truly less shitty.",
   "created_utc": 1691327702,
   "score": 4,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0xt3e",
   "message": "When you starve yourself in reaction to other people hurting you, you just hurt yourself more and lose out on joy. You don’t punish anyone else by depriving yourself. You just end up miserable.\n\nAnd for whatever reason, your mother just wasn’t good enough. Stop making excuses for her or defending her. She failed you and that’s a fact. You deserved so much more. \n\nYour dad sounds like a controlling bully. That’s not love.",
   "created_utc": 1691327555,
   "score": 3,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv10xho",
   "message": "I no longer accept health insurance",
   "created_utc": 1691329151,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0vzfh",
   "message": "\"You have choices\". \nI say this to myself sometimes and now my mind is opening up to difference choices I can make for myself, such as how to spend my time, experimenting with different ways to do things and meet my own needs, and that things don't have to be black and white or either /or. 😊",
   "created_utc": 1691326580,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv0xsvn",
   "message": "“You’re only smoking two ounces, when I prescribed you four a month.  Do you always follow half of directions?”",
   "created_utc": 1691327552,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv1267p",
   "message": "Not my therapist, but at my great-uncle's funeral service, the pastor said \"To love is to embrace the certainty of loss.\" \n\nIt really spoke to me, because I'm in my first relationship and I'm always afraid of losing him. Of losing anybody I love. Of death. Those words really helped sum up the fact that love feels so good when you have it, and the better it feels, the worse it will feel when you lose it. Yet you embrace that loss that will inevitably come.",
   "created_utc": 1691329757,
   "score": 1,
   "submission_id": "15je5aw"
  },
  {
   "comment_id": "jv14fo4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15je5aw"
  }
 ]
}