{
 "submission_id": "15jjit2",
 "title": "People without tattoos, what do you think of those who do?",
 "selftext": "",
 "created_utc": 1691307548,
 "permalink": "/r/AskReddit/comments/15jjit2/people_without_tattoos_what_do_you_think_of_those/",
 "score": 85,
 "url": "https://www.reddit.com/r/AskReddit/comments/15jjit2/people_without_tattoos_what_do_you_think_of_those/",
 "comments": [
  {
   "comment_id": "jv06eiw",
   "message": "I don't care at all.  You do you.",
   "created_utc": 1691308150,
   "score": 231,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv088iz",
   "message": "Some are real works of art. Others are just trashy",
   "created_utc": 1691309611,
   "score": 161,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv061yw",
   "message": "I think that they have tattoos",
   "created_utc": 1691307875,
   "score": 214,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0dc49",
   "message": "I’ve only ever judged one tattoo and that was a swastika which I think is reasonable.\n\nI’m just not a tattoo person, I don’t think they’d suit me. I did once get told that I obviously don’t love my kids because I don’t have their names tattooed on me. That was an interesting conversation….",
   "created_utc": 1691313774,
   "score": 95,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv05ubf",
   "message": "I think tattoos are cool personally but I wouldn't want one myself",
   "created_utc": 1691307706,
   "score": 75,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0elf1",
   "message": "Love them, love that someone wants to express themselves that way.\n\nI'd like to get one but I've never felt able to commit to a design.",
   "created_utc": 1691314797,
   "score": 14,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv06fec",
   "message": "I wish I could have them but there are a few reason why not \n\n1. ADHD hyper focus. Any design I would pick I would soon hate/loose interest after awhile. And any design I pick I just can’t trust I will like it in a few years\n\n2. They don’t look good forever. I’m not a fan of how tattoos age and get blurry. \n\n3. Cost. If I wear to get them I would get the best tattoo artist I could find and I cannot afford that.\n\nBut I do love tattoos just not enough to get them for myself",
   "created_utc": 1691308167,
   "score": 64,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0iap8",
   "message": "I don’t care. Do whatever you want. I would say 75% of tattoos look terrible, 20% ‘fine’ 5% good",
   "created_utc": 1691317779,
   "score": 46,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0da0f",
   "message": "95% are cringe af and look horrible. 4% just look horrible. 1% are fine.\n\nBut it's fine. You do you",
   "created_utc": 1691313726,
   "score": 72,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0k1ta",
   "message": "I think tattoos can look absolutely amazing. There just isn't anything meaningful enough to me to put permanently on my body.",
   "created_utc": 1691319121,
   "score": 6,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0alfh",
   "message": "Most ppl look like poseurs today.",
   "created_utc": 1691311540,
   "score": 17,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0jik3",
   "message": "I don't understand the fascination with them",
   "created_utc": 1691318727,
   "score": 27,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0g55k",
   "message": "I'd really like a tattoo but I'm also the kind of person who would be like, \"ahhh fuck,\" as soon as the needle left my skin. So I appreciate your commitment to permanence.",
   "created_utc": 1691316054,
   "score": 5,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0htdq",
   "message": "I think of tattoos as being a choice of a person at a particular snapshot of time.\n\nAnd given I repeatedly want to punch my younger selves in the face for numerous stupid decisions, I'm against tattoos or myself even before getting into how much less they good on our skin tone IMO.",
   "created_utc": 1691317393,
   "score": 5,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0kedh",
   "message": "I like to look at tattoos on other’s bodies. I don’t think I’ll ever get one.",
   "created_utc": 1691319380,
   "score": 6,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0rz45",
   "message": "I’m extremely happy someone has the confidence to put what they want on their body and into the world. I’m happy for them.",
   "created_utc": 1691324309,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0j6sc",
   "message": "I see most tattoos the same way I see Instagram accounts.  \"Hey. Look at me!\"  Over here\" .  Maybe a conversation starter, maybe a ticket to an unstated private club.  Most people I know who have then ruin them with more tattoos that make a change that is more unflattering.  Changing a tattoo rarely makes it better.  I have never aeen a flattering face tattoo.  If your entire personality is in the tattoos you wear, you should seek help.",
   "created_utc": 1691318474,
   "score": 19,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0l5ma",
   "message": "Don't care what they do, it's none of my business.",
   "created_utc": 1691319934,
   "score": 5,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0l9v1",
   "message": "Higher pain tolerance than me. Props to you for sitting through that and having the patience to care for it after.",
   "created_utc": 1691320017,
   "score": 4,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0mk3w",
   "message": "Do whatever you want? I couldn’t care less if you have tattoos or not.",
   "created_utc": 1691320919,
   "score": 4,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0mn3j",
   "message": "I don't care either way. Whatever makes you happy, or whatever.",
   "created_utc": 1691320975,
   "score": 4,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0mq1z",
   "message": "Some of ya got some pretty cool tattoos and some of ya don’t",
   "created_utc": 1691321033,
   "score": 4,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0rw4s",
   "message": "Usually don't care.\nBut if it's like multible in the face I just *think*: \"Why?\"\n\nBut in the end: Your body your choice",
   "created_utc": 1691324261,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv06xrd",
   "message": "I think it might be some primal instinct in me or whatever, but I find tattoos gross personally. Like, maybe my subconscious thinks it a disease or a rash or something.",
   "created_utc": 1691308572,
   "score": 33,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0l4ux",
   "message": "Unless it's on your face, in which case I tend to think \"where do you possibly get a job?\" I don't think about them at all",
   "created_utc": 1691319920,
   "score": 7,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0ars7",
   "message": "Ugly af",
   "created_utc": 1691311685,
   "score": 41,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv06r9c",
   "message": "Mostly, I don’t really care. But most of those scream “poor taste” and “daddy issues”.",
   "created_utc": 1691308426,
   "score": 24,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv060at",
   "message": "To each their own. But that's not a \"back tattoo\" that's a tramp stamp.",
   "created_utc": 1691307838,
   "score": 12,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0dedl",
   "message": "Depends on the tattoo. Most of the time I think that they are destroying the aesthetics of the body because they are either just smacked somewhere on it without underlining it's natural beauty or it's some dumb shit picture where I seriously doubt that they are still happy with it after a few years. And then there are those tattoos that just look like a huge bruise as if your partner has beaten you half to death and you have to get really close to discern it as a tattoo.\n\nPersonally I think most tattoos would have been better to not got done. But to each their own and it's your body and if I find it ugly it's not your problem. If you're happy with it: Go for it.",
   "created_utc": 1691313826,
   "score": 14,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0a2sf",
   "message": "Meh",
   "created_utc": 1691311114,
   "score": 6,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0k0na",
   "message": "One can do what ever one wants - as a trained designer \u0026amp; artist I am just flabbergasted at what kind of artwork people get and where and by whom. I do as well judge people accordingly - as I do your shoes you choose to wear. I could not date a woman with loads of tattoos I don’t like…",
   "created_utc": 1691319098,
   "score": 3,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0m3mj",
   "message": "Attention whoring most of the time",
   "created_utc": 1691320603,
   "score": 11,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0hend",
   "message": "Most are trashy but occasionally there’s something quality. I wouldn’t get one though",
   "created_utc": 1691317073,
   "score": 7,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0jt9p",
   "message": "In general I think they're cool, and I've considered getting some, but there are some exceptions I think are stupid ideas:\n\n1. Tattoos of your girlfriend's/boyfriend's/wife's/husband's name\n2. Face tattoos\n3. Tattoos that are supposed to look photo realistic of someone (they usually just look creepy)\n\nEven with those, it's your body and I'm just not invested enough to care or think about it too much.",
   "created_utc": 1691318948,
   "score": 4,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv07hwz",
   "message": "[deleted]",
   "created_utc": 1691309026,
   "score": 6,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0ap31",
   "message": "I think you see rather or not you went to a professional and paid the money lol\nI envy those with tats who look great because some are simply art and unique and others… Well I'm sorry. Would not tell them to hurt their feelings tho",
   "created_utc": 1691311625,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0at9y",
   "message": "Sometimes I'm a little jealous at peopke who have awesome tats. I'm too afraid that I'll get bored with mine, so I have none.",
   "created_utc": 1691311720,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0ckv2",
   "message": "I dont care at all what other people do to their bodies.",
   "created_utc": 1691313153,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0cxz6",
   "message": "I hope you still like the image in 5-10-25-50 years and not look back 'what was i thinking?'.\n\nIf you chose something very well drawn, meaningful and beautiful good for you.\n\nIf you have a random image badly drawn just because tattoos are cool then yikes!",
   "created_utc": 1691313452,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0e4f6",
   "message": "What someone else does with/to their own body, is none of my business.",
   "created_utc": 1691314411,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0fk5m",
   "message": "Whatever",
   "created_utc": 1691315581,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0fplk",
   "message": "I don’t really think about them at all",
   "created_utc": 1691315703,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0gyee",
   "message": "I love them. Guess I am one of the very few tattoo-enthusiasts who doesnt have a single one on his own skin.",
   "created_utc": 1691316708,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0j5fx",
   "message": "I’m the proud owner of two tattoos. In memory of my parents. What I’ll never understand is the face tattoo. My brother had a wasp tattoo on his upper neck 20 years ago. He’s 73 now and it’s just a yellow/black blob now.",
   "created_utc": 1691318446,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0lmyg",
   "message": "I'm not big on tattoos.",
   "created_utc": 1691320278,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0m88s",
   "message": "Mostly I don’t care, but I once saw a guy with a huge tat of Heath Ledger joker on his forearm which made me think ‘surely that won’t age well’. But then he turned around and ON THE SAME ARM was the bloke from Peaky Blinders. Still, doesn’t affect me so whatever but it stuck out to me as a potentially short-sighted decision.",
   "created_utc": 1691320691,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0msbd",
   "message": "Good for them I guess. I don't care.",
   "created_utc": 1691321077,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0q83b",
   "message": "I got some good advice when I was young and in the military- if you want a tattoo, choose the design and wait a year. If it still has meaning, get it.\n\nI have picked out a number of designs over the years and still don't have one, but I have no issues with those who do. \n\nI think there are a lot of people who would benefit from the advice I received - I've seen some pretty awful ink.",
   "created_utc": 1691323262,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0qe05",
   "message": "There's nothing I'm passionate enough about to permanently etch into my skin. Some of them do look cool, though.",
   "created_utc": 1691323361,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0rxyv",
   "message": "some tattoos are cool, but im hesitant if im going to get one because they're permanent. some ideas if but prolly not\n\noverall,  some look cool and some are a waste, but you do you",
   "created_utc": 1691324291,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv07g3k",
   "message": "I think of them as ATTENTION SEEKERS !!!",
   "created_utc": 1691308984,
   "score": 9,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0d015",
   "message": "Regular humans",
   "created_utc": 1691313500,
   "score": 5,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0mpqe",
   "message": "small tattoos related to their memories or special occasions should be fine",
   "created_utc": 1691321026,
   "score": 3,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0hnvd",
   "message": "Tattoos are trash. A mark of a poor choice made. A mark of a person under the influence of novelty. A person doing a thing because others have.\n\nAKA. Monkey see....",
   "created_utc": 1691317275,
   "score": 6,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0cmuo",
   "message": "Shitposters",
   "created_utc": 1691313198,
   "score": 3,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0lo77",
   "message": "They where cool and edgy before everyone had one.  \n\n\nThese days, they're about as cool as owning a barbecue grill.",
   "created_utc": 1691320301,
   "score": 3,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0c4kr",
   "message": "Hideous. Some are wonderful pieces of art, and I applaud the artist, but choosing to deface your body, permanently, is beyond my comprehension.",
   "created_utc": 1691312786,
   "score": 5,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0fdjs",
   "message": "Low confidence. Bullied at school. Trying to look tough meanwhile they hug a teddybear at night crying themselves to sleep.",
   "created_utc": 1691315435,
   "score": 4,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv05wqe",
   "message": "For the most part I don’t care. Why should I? Will be honest though if it’s extreme tattooing like getting your entire face tattooed like that one mom in Britain I think it looks trashy and attention-seeking but just “regular” tattooed people? More power!",
   "created_utc": 1691307759,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv09346",
   "message": "I’ve seen some really great work, but I’ve never thought it was a good idea to get one. I’ve never though that Michelangelo’s David or The Venus de Milo would be better if Sharpied.",
   "created_utc": 1691310303,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0gnjd",
   "message": "How it will look on old saggy skin",
   "created_utc": 1691316465,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0gwdp",
   "message": "I had had every intention of getting tattoos at ___ age. Those years rolled around and the specific tattoo I’d had in mind didn’t still appeal to me. Got to be older and ended up moving to Japan. I’m pretty grateful I don’t have them now. I think tattoos are great, but some people might think about what path their life might lead and if it will end up causing you problems later. (Depending on the country it might not matter… but then it really could too)",
   "created_utc": 1691316663,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0k1iv",
   "message": "I DONT think anything of them, but I do stare at their tattoos in admiration. I love tattoos and wish I could get some.",
   "created_utc": 1691319115,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0lwcq",
   "message": "I find it a bit strange but whatever.",
   "created_utc": 1691320462,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv05qgy",
   "message": "Want to get one done",
   "created_utc": 1691307621,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv067xt",
   "message": "I don't care most of the time. Sometimes if it's a super cool design it stands out. But I do always hope they realize it will fade as you get old and not look crisp",
   "created_utc": 1691308006,
   "score": 3,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv08rk4",
   "message": "Their body their decision.",
   "created_utc": 1691310040,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0dj0z",
   "message": "“hot”",
   "created_utc": 1691313930,
   "score": 4,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0hnf2",
   "message": "Think they look terrible. Why don’t you just buy a piece of jewelry or something, then you can just get rid of it when it doesn’t look good anymore. \n\nI’ve known very pretty women with bad tattoos and it’s a major turn off.",
   "created_utc": 1691317265,
   "score": 3,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv07txw",
   "message": "Prison, pirate and redlight scene.",
   "created_utc": 1691309286,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv05wql",
   "message": "Chill people. 90% of people who are covered in tattoos are artistic.",
   "created_utc": 1691307759,
   "score": 2,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0kej3",
   "message": "If you have a picture of something that means something to you, that's fine. But I have a hard time with people that cover themselves i tattoos. I also feel many people are short sighted and get tattoed just because a certain style is \"in\" right now - if you want to follow fashion, get a weird hair cut or outlandish clothes, not something that will stay on your skin for the rest of your life.",
   "created_utc": 1691319383,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv070p5",
   "message": "They're squandering all that travel money",
   "created_utc": 1691308637,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0cm0e",
   "message": "I think most of them look terrible but it makes them happy so what do I care?",
   "created_utc": 1691313178,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv05pl5",
   "message": "They are normal",
   "created_utc": 1691307602,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv07j1c",
   "message": "I think they're cool in general especially back, chest and sleeve tattoos but face tattoos are questionable and neck tattoos are either good or bad. I personally wouldn't get a tattoo because I don't want to lose my inability to donate blood as an O positive type.",
   "created_utc": 1691309050,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv07tbr",
   "message": "Good quality tattoos look amazing. Poor quality, dumb ones on the other hand, yeah no",
   "created_utc": 1691309273,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv08ni3",
   "message": "I think people should be very careful getting tattoos because as they get older they may start to regret it. So not against people getting tattoos but they should be cautious",
   "created_utc": 1691309949,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0fxsm",
   "message": "Don't like them, even the one's that are artistically beautiful, I feel like when you see a toddler who has drawn on themselves with felt tip, my instinct is to want to wash it off, to treat it as a blemish.",
   "created_utc": 1691315887,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0j10u",
   "message": "They are, by nature, superficial. So I judge them superficially. I think they look shit. Every single time the person would look better without them.",
   "created_utc": 1691318350,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0kzea",
   "message": "I think they look universally stupid, but I recognise other peoples’ bodies are also none of my business as it should be. 🤷‍♀️",
   "created_utc": 1691319813,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0n1lp",
   "message": "I think they are very show-off kind of people.\nBut it doesn't matter what I think.",
   "created_utc": 1691321256,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv08jug",
   "message": "Their choice Why should others care?",
   "created_utc": 1691309866,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0adke",
   "message": "Basically me who doesn't care at all unless im involve so they fine",
   "created_utc": 1691311359,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0eldn",
   "message": "Usually I love them on other people. However I will likely never get them myself.\n\nThe tattoo trend at the moment seems to be quantity over quality. Many small and imprecisely drawn. As such Recently and more critically maybe; I think they are more likely to retract from a persons overall beauty than contribute. \n\nBut there are some incredible pieces out there and  I always appreciate them when I see them. I am also very glad society is more accepting as I like that people can express themselves in this way",
   "created_utc": 1691314797,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0g5mz",
   "message": "Tattoo + I want to be liked by others, come watch me = meh\n\nTattoo + I love myself and this is how i want to look = yey",
   "created_utc": 1691316065,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0jq0p",
   "message": "I adore art in multiple formats, I love checking out everyones tattoos. I kinda want a few fine line ones (one being ‘Earth 616’ in comic sans on my foot and a small band on my wrist that’s kind of ode to Mcfarlene’s Spidy). Knowing me I’ll never get around to it 😂",
   "created_utc": 1691318881,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0kzzv",
   "message": "One is fine but more that one takes away from the natural look of the body. A sleeve looks cool but people with 20 different and unrelated tattoos to me looks ridiculous and makes me think this person is impulsive and likely has ADD",
   "created_utc": 1691319826,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0lbzn",
   "message": "I think tattoos are generally a foolish decision but I don't really care. Unless your tattoo somehow causes me problems go for it.",
   "created_utc": 1691320059,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0lzza",
   "message": "Usually I'd rather not be around them...  \nMostly because certain other tendencies tag along with tattoos.  \nOf course, let them do whatever, and tattoos are an artistic medium that's kinda awesome, and it's cool of them to preserve such an art form and support those highly skilled artists.\n\nHowever, after a bad experience with one girl I knew for a while...  \nI prefer to just stay away.",
   "created_utc": 1691320533,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0pcu3",
   "message": "Sure go ahead, just keep in mind almost all inks are so fucking toxic you wouldn’t really wanna touch them, much less have them injected. \nDon’t get me wrong, I respect the choice, I thought about it myself, but the toxicity put me off.",
   "created_utc": 1691322729,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0ru12",
   "message": "One or two look great on the body but after that not attractive.",
   "created_utc": 1691324226,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv078n4",
   "message": "Good for them, some designs are very well done!",
   "created_utc": 1691308817,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv07iv2",
   "message": "It's a cool form of art",
   "created_utc": 1691309046,
   "score": 255,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv07t9j",
   "message": "They’re are coollll",
   "created_utc": 1691309271,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0iw2c",
   "message": "Trashy. Low class. Low IQ.",
   "created_utc": 1691318240,
   "score": 255,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0ddjx",
   "message": "I understand how people like some small tattoo, but when people are covering whole body with it, it looks funny",
   "created_utc": 1691313806,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0g839",
   "message": "I just like looking like a desk in detention",
   "created_utc": 1691316120,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0jwzb",
   "message": "putting stickers on your lamborghini is ridiculous, but if you have an old wreck and put a sticker here and there, it can only do good.",
   "created_utc": 1691319024,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0lki7",
   "message": "Ugly.",
   "created_utc": 1691320229,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0mngx",
   "message": "Lame. Was once cool",
   "created_utc": 1691320983,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv060j5",
   "message": "I want to get a tattoo too, but I always wonder how I can keep it cool when get old",
   "created_utc": 1691307843,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv06afh",
   "message": "Within reason.",
   "created_utc": 1691308060,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv08du7",
   "message": "I think they are brave with lots of free time. I am scared of needles in general and I easily get bored. So to be pricked by a needle for a long period of time, for me that would be bravery.",
   "created_utc": 1691309728,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv08t93",
   "message": "I don't care, even really like them sometimes. I find face tattoos a little intimidating, though saying that, when I've seen them, the person behaves in an intimidating way (I haven't seen many in real life), so that doesn't say much. When I've seen them in pictures on people that don't look intimidating, then I don't find them intimidating.",
   "created_utc": 1691310078,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv08xv7",
   "message": "I read an article years ago that said the contents of the ink is a raffle and not controlled by standards - maybe this has changed?  Automotive pigment full of carcinogens was one example cited. I read another article that said the ink gets into the lymphatic system and that it can also conceal dangerous skin cancers. I admire the artistic  skills of the good ones but too many unknowns for me.",
   "created_utc": 1691310180,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv09e4e",
   "message": "First of all im scared for the permanent reasions of a tattoo and it looks bad in my eyes when your are old. Next the paint can be found in organs or bloodlines which is for me health concerning, due to missing paint regulations. But having some tattoos  can be nice but to much tattoos cancel out the effect, in my eyes",
   "created_utc": 1691310556,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0chlu",
   "message": "They can be really interesting but aren't for me. I don't worry about what other people do to their own skin though.",
   "created_utc": 1691313076,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0dx8q",
   "message": "It depends on the tattoo. There's a spectrum of wearers from a tattoo of a butterfly on an ankle I'll never see, to tattoos I always see, due to them being on necks or hands etc.\n\nGenerally I feel that the more visible the tattoos are, the more the wearer has a \"look at me\" personality. Maybe that's right, maybe that's wrong but it's what I feel.",
   "created_utc": 1691314253,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0ehi8",
   "message": "People can do whatever they want... but I think most tattoos are terrible and don't improve anybody's looks at all. I'd prefer someone without them.",
   "created_utc": 1691314707,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0g6ll",
   "message": "Depends where\n\nBelow the collarbone= rational person with tattoo(s)\nAbove the collarbone= unemployable on purpose",
   "created_utc": 1691316087,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0i6cn",
   "message": "Literally don’t care. But as someone in their late 30s, it’s funny that being tattooless makes me the rebel/unique person!",
   "created_utc": 1691317683,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0j1yi",
   "message": "I like tattoos just fine I guess I just feel like having stencils all over your body like bumper stickers on a car seems regrettable no offense",
   "created_utc": 1691318370,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0j82g",
   "message": "I'm not a fan of tattoos.  They especially look trashy on the face and neck. That said ultimately you do you.",
   "created_utc": 1691318502,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0kk8g",
   "message": "Most tattoos that I see in public are pretty poor quality, badly designed and badly rendered, and placement seems to ignore the shape of the body. Honestly people are treating their skin like a doodle pad rather than a canvas.\n\nExceptions to this are rare but really stand out.\n\nBut, other than casually critiquing the art to myself I don’t give a damn, not my body, not my business.",
   "created_utc": 1691319504,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0kxv6",
   "message": "I'm a Sadist and they are a Masochist",
   "created_utc": 1691319782,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0nfml",
   "message": "Do what you want, but don't apply for welfare if your face tattoo is making it difficult to get a job.",
   "created_utc": 1691321520,
   "score": 0,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0quj1",
   "message": "It’s not so much I care about the person. Because who has time to truly care about a stranger’s life choices? Especially when they believe they’re right about them…\n\nBut I personally see them and think that it’s a poor life choice that does not look good unless that person takes extremely good care of their body (and the tattoos) as they age. These are the first couple of generations with more people that have large visible tattoos and I’m worried because I’ll see 50+ year olds with small tattoos that look faded, blotchy and awful.\n\nI’m just imagining millennials and Gen Z getting to that stage of adulthood and looking a mess. Tattoos look good on young, taunt skin but it’s rare for it to continue to look good on much older adults. And any tattoo I would get in my 20s, I just know wouldn’t suit who I’d become in my 30s, 40s, and beyond. I just think it’s a bad idea but you know…do you? I certainly wouldn’t advise anyone I know and care about to get one",
   "created_utc": 1691323634,
   "score": 1,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0ey0n",
   "message": "Show offs.",
   "created_utc": 1691315084,
   "score": 253,
   "submission_id": "15jjit2"
  },
  {
   "comment_id": "jv0ldfq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jjit2"
  }
 ]
}