{
 "submission_id": "15jsaen",
 "title": "What's the most dangerous thing you've ever done?",
 "selftext": "",
 "created_utc": 1691335498,
 "permalink": "/r/AskReddit/comments/15jsaen/whats_the_most_dangerous_thing_youve_ever_done/",
 "score": 6,
 "url": "https://www.reddit.com/r/AskReddit/comments/15jsaen/whats_the_most_dangerous_thing_youve_ever_done/",
 "comments": [
  {
   "comment_id": "jv1tvwq",
   "message": "Operated an unarmored dozer to skim the roadsides in Iraq to disable/expose IED’s. 2003-2004",
   "created_utc": 1691341501,
   "score": 7,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1zhhk",
   "message": "Navy guy here. Aircrew. I had every right to refuse to fly, which probably would've encouraged the rest of the crew to follow. The conditions were a series of swiss cheese holes lining up and I called it out. I allowed a higher ranking person to talk me down. I ended up being right and we definitely could have died that day. The aircraft was struck by lightning so many times it was hard down for months, and we almost ran out of fuel. Roughest few minutes of my life in a situation we never should have been in.",
   "created_utc": 1691343718,
   "score": 158,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1gq9s",
   "message": "Scuba with tiger and bull sharks, although I was more concerned with the barracuda that would just stare at me.",
   "created_utc": 1691336162,
   "score": 68,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1feqs",
   "message": "295kph on a Hayabusa on the Paris Peripherique... I was young and reckless once...",
   "created_utc": 1691335618,
   "score": 246,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1haso",
   "message": "Petting a rhino.\nTotally would do it again",
   "created_utc": 1691336398,
   "score": 134,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1snf4",
   "message": "Accept drugs from a stranger.",
   "created_utc": 1691341007,
   "score": 43,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1ws17",
   "message": "Crash landed a plane when the undercarriage failed on.the first week of a new french air traffic controller.",
   "created_utc": 1691342641,
   "score": 178,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1frer",
   "message": "Jumped off a small rock onto wet sidewalk. VERY close to busting my head open from an eight inch drop",
   "created_utc": 1691335762,
   "score": 39,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1i0y3",
   "message": "Climbed out of an 18 story building (from the 15th floor) down to the bottom with ZERO safety gear.\n\nEdit: As people want details.\n\nI was 16yrs old, drunk and had done some acid, I was renting a room on the 15th floor of an 18 story building, I climbed off the balcony down to the bottom, it took about 30min, I did it again a few months later, we was having a gathering, nobody believed I had done it (even tho there was witness at the gathering) so I did it again.\n\nNext crazy one was.... We had got back from clubbing, it was about 4 in the morning, I had done 3 E's and drank all night, totally wasted, I climbed outside, up on to the roof, enjoyed the view, went for a piss off the corner, chatted to a few pigeons and climbed back down.",
   "created_utc": 1691336696,
   "score": 79,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1nhoe",
   "message": "You know those tags on mattresses that say \"do not remove under penalty of law\"?\n\nWell I ripped one off\n\nAnd I'll do it again",
   "created_utc": 1691338921,
   "score": 69,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1vviz",
   "message": "Use to inject meth and do Coyote runs for the Cartels",
   "created_utc": 1691342289,
   "score": 143,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1wwy5",
   "message": "I run into burning buildings. Dangerous but fun.",
   "created_utc": 1691342695,
   "score": 157,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1homu",
   "message": "I carelessly dropped the bottle of Sulfuric Acid on the floor at the chemistry class in high school",
   "created_utc": 1691336556,
   "score": 31,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1tosj",
   "message": "Rode a 1000CC motorcycle from Carmel Ca. to Big Sur Ca. in about 12 minutes on Hiway 1.  Ended up with a swollen jaw from the leather jacket slapping my face.",
   "created_utc": 1691341423,
   "score": 69,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1ztew",
   "message": "Poured baking soda followed by a boatload of vinegar down a clogged drain. When that didn't work, I followed it with a drain cleaner. Fun fact drain cleaner can have bleach in it, which I didn't know and didn't think to check.\n\nAnyway don't do that.",
   "created_utc": 1691343852,
   "score": 243,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1u6qu",
   "message": "Climbing free solo has to be up there. No rope or protection of any kind on 60-80ft tall routes. Had one close call and never did it again.",
   "created_utc": 1691341618,
   "score": 250,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1xie7",
   "message": "Told my gf to calm down",
   "created_utc": 1691342930,
   "score": 17,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv20g9p",
   "message": "Used an extension ladder to get 30 ft higher on a 120 ft boom lift",
   "created_utc": 1691344104,
   "score": 41,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1sz1x",
   "message": "Getting drunk and playing hide and go seek in an abandoned mine.",
   "created_utc": 1691341138,
   "score": 169,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1fhrh",
   "message": "Lighter+deodorant",
   "created_utc": 1691335653,
   "score": 70,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1fceq",
   "message": "ate a bowl of cereal… without any milk",
   "created_utc": 1691335591,
   "score": 134,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1zdm7",
   "message": "When I was a kid, I walked out on very thin ice on a river on my way home from school. A neighbor found me, and I never understood why he was so angry and yelled at me. I get it now.",
   "created_utc": 1691343675,
   "score": 7,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1vm4p",
   "message": "Joined the Army in 2006. Glad I'm still here",
   "created_utc": 1691342189,
   "score": 94,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1sowo",
   "message": "Drove once when I was tired. Drifted into the other lane a couple times, it's a miracle nothing happened. Never again",
   "created_utc": 1691341024,
   "score": 105,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1ktj5",
   "message": "Dm'ed Putin in 2021 christmas that ukrainians were talking shit about him.",
   "created_utc": 1691337829,
   "score": 152,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv214yd",
   "message": "Tried to pet a chihuahua while high on shrooms",
   "created_utc": 1691344375,
   "score": 118,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1u78n",
   "message": "Drive while on acid/LSD. It wasn't my best choice and not one I'd make again, but I was young and my friends were struggling and needed to go home, so I drove them.",
   "created_utc": 1691341623,
   "score": 60,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv22p1p",
   "message": "Landed a helicopter after an engine failure.",
   "created_utc": 1691345007,
   "score": 45,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1knys",
   "message": "Walked up to a couple badgers. I didn't know what they were and thought they were cute.",
   "created_utc": 1691337768,
   "score": 33,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1x4bl",
   "message": "Not by choice, but I found myself in the middle of a shootout once.",
   "created_utc": 1691342777,
   "score": 89,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv211tj",
   "message": "Taking a shit with 2 squares of paper left on the tp roll with no more left in the house.",
   "created_utc": 1691344340,
   "score": 79,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv21c7s",
   "message": "I told my girlfriend to calm down.\n\nI then suggested her mood swing might have been related to her menstrual cycle.",
   "created_utc": 1691344458,
   "score": 24,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1lovt",
   "message": "Ate pineapple on pizza. The risk was worth it.",
   "created_utc": 1691338180,
   "score": 59,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1hjk2",
   "message": "meet a stranger i met online x\\_x ickkk",
   "created_utc": 1691336498,
   "score": 35,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv2122e",
   "message": "Oh man…. Let’s see…. Drove 5 hours during a blizzard in Alaska; been chased by a mama moose (I ran into traffic to get away); hiked on an icy mountain with the sun going down and my husband slipped and slid about 100ft (somehow he ended up unscathed); my truck slid sideways on ice towards a cliff(somehow stopped in time but I was crying); was on a sinking boat between Oahu and Molokai in the channel of bones (we were taking on water, but made it to Molokai in time to buy a pump); swam with whales; jumped off waterfalls; swam near a barracuda.\n\nEdit to add: gave birth. Baby got stuck and had an emergency c-section. If it were any other time period, I’d be dead.",
   "created_utc": 1691344343,
   "score": 58,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv2cu1d",
   "message": "\u0026gt;So I have posted this before but here is one of the dumbest things my friends and I did as teenagers and I still stand by what I said at the end that we **should have got an adult involved** Any teens reading this, if you ever find yourself in the below situation, get an adult, don't worry about how much trouble you could potentially get into.\n\n  \n  \n  .\n \n \n  \n  \n\nI was 16 at the time, I spent the night at a friend's house. There was supposed to be four of us there that night but there was only three. See we were covering for our fourth friend who decided to spend the weekend with her \"boyfriend\" (some skeevy ass 25 year old pedo punk). So we're hanging out, listening to music it is almost midnight, the phone rings. It is our fourth friend, she and her boyfriend got into a fight and he put her out of his house, she is calling from a payphone because he kept her cell. We're like fuck, that sucks, tell us where you are and we'll come grab you... \n\n\nBITCH IS IN FUCKING BALTIMORE MARYLAND! So my first reaction is we should get my dad, this is some serious shit and we need an adult. The other two freak the hell out and point out just how much trouble we would all be in if a parent got involved. I point out how much trouble she is currently in, alone, no phone, on the streets, of a big city, at midnight, over 200 miles from home, and argue that we really should get help with this. They use my argument against me, yeah she could be in some serious trouble and we are wasting time arguing. **FUCK** So we print off directions, load into my piece of shit car and off we go. Now before this the biggest city I had ever drove in was Charlottesville...  \n\n\nSo we make this two or so hour trip, arrive in this big ass city, in another fucking state, at 2:30 in the morning with absolutely no one knowing where the hell we are. We pull up to the store our friend called from, and surprise the bitch isn't fucking there! So we ask the guy in the store, yeah she was there but she argued with some guy for a bit and when the clerk threatened to call the cops she left with the dude she was arguing with. We end up driving around a bit hoping that she is somewhere near by, the store clearly was in walking distance so she has to be somewhere near there. \n\n\nWell one friend has the idea that if she left with the dude it had to be the boyfriend so she probably has her phone back, we call and yeah, she's with him, everything is good, she meant to call us but they were talking and he was apologizing and trying to make up with her. We tell her that we are in the fucking city, we were worried and scared that something bad would happen to her so we came up. She tells us we blew things out of proportion which parent did we drag up there for nothing, we tell her we are there alone, her whole tone changes, *you guys are so sweet, you're the best friends a girl could ever have, I love you all, you should swing by and hang for a bit, meet the boyfriend* So we get directions from her, we roll up and dude is acting all nice, sorry to worry you guys, you know how emotional friend is, she just stormed out I was so worried, glad she has such great friends that would come all this way.  \n\nAll the while we're over here like yeah dude is creepy but we're remaining polite, friendly, trying not to let it show that dude is creeping us out. Dude invites us in, we decline, he insists, we tell him we will in a bit but for now we are thinking about running back to the store for a drink, we invite friend along, dude tries to come too, I'm like dude I don't have room, he's like well girlfriend can sit on my lap, one of our other friends is like bad idea, there was a cop at the shop and we don't want to get pulled over since our parents don't know we're here. Dude is all yeah the cops here are major assholes, our friend insists on staying with her boyfriend, we end up convincing her to ride with us so we don't get lost. Dude is all like hurry back, he then invites us to spend the night, it's little after 3 am, you guys don't want to drive all that way back home at this hour, come in, meet my friends, spend the night and head home in the morning. We're like our parents don't know where we are, it's a bad idea, we're just gonna go grab drinks for the road, bring your girlfriend back, and try to get home before parents wake up. Dude tries again to convince us to at least meet his friends, we're like yeah, sure, we'll say hello after we get back from the store. He kisses our friend and tells her to change our minds about making that long drive home. So we drive off... \n\n\nOnce we're near the store her whole attitude changes again. Apparently there was a huge argument, something to do with his creepy ass friends being there, and how she didn't feel comfortable being alone with any of his friends, he put her out of the house and after she called us she was pretty scared being alone on the street at 1am sp when he came looking for her she left with him because she felt safer with him than on the street, she was so relieved when we called and said we were there and was looking for a way to talk to us alone. She wanted to go home, she was really worried when he offered us the chance to stay over, she was scared we were going to accept the offer.  \n\n\n  So we end up passing the store and heading home, dude starts calling about 10 minutes later, what's taking so long, ect. She lies and says that I am in the bathroom and it is my car so they have to wait, ok cool see you soon babe, another 10 minutes pass and her calls again, she answers and yeah, friend might be sick, we will be back soon, so glad you are so thoughtful to offer them a place to stay the night. Dude calls again, this time he walked to the store and found out we were not there... At this point we are telling her to turn off her phone.  \n\n\nIn the end we make it home, we stopped at our local 7-11 for slushies in case our friend's mom is up when we get in. During the ride home we took that time to attempt to convince our 15 year old friend to dump her 25 year old \"boyfriend\" she argued that she loved him and we we not mature enough to understand, we pointed out that he put her out on the streets of Baltimore at midnight, we just didn't understand him, we point out that she called us scared, and admitted to us that the only reason she went back was he was better than the street...  \n\n\nShe ended up \"dating\" the dude for a few months more despite our protests that he was a bad dude, he ended up dumping her when he came down to visit and tried to pressure her into sex and when she said no he tried to force himself on her, she hit him, he told her that she wasn't worth the effort and he had plenty of bitches back home who would put out when he wanted, she meant nothing to him and she should either be useful and let him fuck her or just go kill herself because no one could ever love someone like her. So that really messed her up for quite some time and honestly none of our parents ever found out that they had 4 teen girls go out of state in the middle of the night...  \n\nTo this day I still thing we should have gotten a parent to go, we should have involved *some* adult, we should have told her mom about the \"boyfriend\" as soon as we got home but teenagers are fucking stupid and we are lucky things didn't go as bad as they could have.",
   "created_utc": 1691349125,
   "score": 104,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1ryyd",
   "message": "Bought my wife jeans without pockets",
   "created_utc": 1691340737,
   "score": 42,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1xth4",
   "message": "Bike racing, free soloing, talking back to my asian mom",
   "created_utc": 1691343054,
   "score": 51,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1z580",
   "message": "Before garage doors had sensors, I used to close the garage and try to run in before the door came down.",
   "created_utc": 1691343582,
   "score": 75,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv25gtp",
   "message": "Got in between two aggressive dogs fighting.",
   "created_utc": 1691346128,
   "score": 33,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1t1ds",
   "message": "Cave diving.",
   "created_utc": 1691341163,
   "score": 27,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1whkt",
   "message": "Not dangerous but just kinda awkward lol \nI had a 17 hour layover in Paris and I slept with some homeless people near a workshop",
   "created_utc": 1691342526,
   "score": 21,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1xde0",
   "message": "Stood up to my 5th grade teacher when she gave us collective punishment. Got in deep trouble and it was worth it",
   "created_utc": 1691342875,
   "score": 13,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1u6lx",
   "message": "I was on a bicycle and played chicken with a blazer, even though I ended up in the hospital I like to think I won because I lived.",
   "created_utc": 1691341616,
   "score": 14,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1yogr",
   "message": "Backyard wrestling. Used lightbulbs, flaming tables, jumped off of houses etc it was definitely wild and stupid",
   "created_utc": 1691343394,
   "score": 16,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv21wv7",
   "message": "One time I tried to pass a guy in a diesel pickup truck hauling something on a big trailer. When I was halfway he must have saw me and decided to speed up but I didn’t noticed so after another 15 seconds I still wasn’t around him and another car was coming now. First time I had to put the pedal to the floor because I was already too far ahead of him. I did learn to never pass anyone, because people out there will cause you harm just to not get overtaken.",
   "created_utc": 1691344690,
   "score": 45,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv22yva",
   "message": "Violently masturbating to the word BOOBS spelt out on a calculator",
   "created_utc": 1691345116,
   "score": 11,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv230pj",
   "message": "Been born.\n\nResults in a 100% likelihood of death.",
   "created_utc": 1691345137,
   "score": 62,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv244zb",
   "message": "Told my wife her butt did look big in that dress.",
   "created_utc": 1691345591,
   "score": 25,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1nhdu",
   "message": "bar fight",
   "created_utc": 1691338917,
   "score": 9,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1ttj9",
   "message": "Climbed a pretty tall bridge drunk in Switzerland one time. Easily could have fallen and died",
   "created_utc": 1691341475,
   "score": 10,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1yhmo",
   "message": "I was a child. I was jumping on a trampoline and fucked up the landing. Somehow I landed on my head in a way that I felt stress on the crucial part of the spine (C-somethings, from the brain to the upper body part of the spine).  \n\nI remember thinking “oh that was VERY dangerous”",
   "created_utc": 1691343319,
   "score": 11,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1z7gv",
   "message": "As a kid, I got the tractor sliding sideways down a hill, it was leaning pretty far to the right when it stopped but it didn’t tip over.",
   "created_utc": 1691343608,
   "score": 13,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv21mzr",
   "message": "When I was 16 I jumped my dirt bike over a two lane highway (no traffic) and almost landed into a 6' concrete sewer opening that started on the other side, the top of which was lined up exactly where my head / neck was. I had assumed it was like every other highway hillside in the area that had a smooth grassy downside on the other side. If I had landed 6' feet to the left I would have been decapitated, or at best had the front of my helmet smashed in. Was going about 40mph and landed RIGHT NEXT TO IT. My left knee was inches from the right edge of the tube.\n\nNever blind jumped again. Ever.",
   "created_utc": 1691344576,
   "score": 21,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv229rw",
   "message": "Dated a woman who thought she was cute and felt that her vagina was special and more valuable than the equipment that comes standard on every other woman. \n\nThat is by far the most dangerous thing I've ever done.",
   "created_utc": 1691344836,
   "score": 5,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1ym9d",
   "message": "Woke up to face yet another day ?",
   "created_utc": 1691343370,
   "score": 15,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1wxnh",
   "message": "Ate at Taco Bell...",
   "created_utc": 1691342703,
   "score": 14,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1lo1j",
   "message": "Sleep when I'm broke asf",
   "created_utc": 1691338171,
   "score": 3,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1wclo",
   "message": "Drive. \n\nI’m not a great driver.",
   "created_utc": 1691342473,
   "score": 9,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1y6xz",
   "message": "Swam after my canoe that blew away in a thunderstorm.",
   "created_utc": 1691343203,
   "score": 7,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1zk12",
   "message": "I did about 100 skydives in the span of 2 years. It’s probably the most inherently dangerous thing I’ve ever done, but in actuality, skydiving is probably safer than driving your car to work every day.",
   "created_utc": 1691343747,
   "score": 7,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv204l0",
   "message": "Reaching under heavy pipes supported by a 2x4. It didn't hold, nor did the bones in my hand. Oops!",
   "created_utc": 1691343974,
   "score": 11,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv224a0",
   "message": "Did 195 on a motorcycle at 3 in the morning. Will not do that again. Biggest rush I ever had riding. Scariest thing was the the thoughts of what could have gone wrong and how fast it could have gone wrong.",
   "created_utc": 1691344774,
   "score": 9,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv22viw",
   "message": "Tried to swim under a fishing dock to the other side blackout drunk. I lost direction and couldn't make my way from under the dock. Pure luck I made it out of there, I am still struggling with alcohol.",
   "created_utc": 1691345079,
   "score": 10,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1sq8j",
   "message": "Staying awake for 4.5 day on drug marathon",
   "created_utc": 1691341038,
   "score": 9,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1vzbk",
   "message": "Run with bulls, I'm addicted to the rush, I do it every summer",
   "created_utc": 1691342330,
   "score": 9,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1z4ly",
   "message": "Fallen asleep at the top of a self phone tower, or fallen asleep at the edge of a wildfire we just put out. The latter almost killed me. Injecting meth. Also attempted suicide by hanging (woke up to someone lifting me up to take tension off the rope). There was no light, just blackness and numbness.",
   "created_utc": 1691343575,
   "score": 11,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1zs10",
   "message": "drive around all day drinking beer and eating seconal",
   "created_utc": 1691343837,
   "score": 3,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1zxpr",
   "message": "Climbed a radio/cell tower on LSD. Absolutely no protection",
   "created_utc": 1691343900,
   "score": 11,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv227ub",
   "message": "rode horses for 12 years",
   "created_utc": 1691344814,
   "score": 6,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv22jcw",
   "message": "\\- A close friend had a fight with her then-boyfriend. He's 6'2, drunk, and having a PTSD induced violent episode. She locked herself in the bathroom and called me, while he was standing outside and trying to break in. I physically put myself between him and the door, pulling the cliche \"If you want to get to her, you'll have to go through me\" (Which was 100% a bluff. He could get rid of me in two seconds). Then proceeded to talk him down and make him get out of the house. He apologized profusely when he got sober. I recall he stopped drinking after that incidence.\n\n\\- An ex-girlfriend was suicidal, threatening to jump off a roof. I went there, held her hand, and told her I wasn't going to stop her, but I'm not letting go (so if she jumps, there's a good chance I'll fall as well). I had no idea how she would respond. It could either stop her, or make things infinitely worse. (She called me some awful names for the good part of 15 minutes, but let me take her back inside.)\n\n(Yeah, groups of 20-years-olds with every possible flavour of trauma sure are fun.)",
   "created_utc": 1691344943,
   "score": 17,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv238j4",
   "message": "I fell into a tree well while skiing.  I also had no choice but to ski done slides a couple of times.  But that ended without incident.",
   "created_utc": 1691345225,
   "score": 9,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv23f4x",
   "message": "Raced a proper racecar at extreme speed at the Nürburgring with only two practice laps, alone.",
   "created_utc": 1691345300,
   "score": 11,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv24dyf",
   "message": "Go into a burning building",
   "created_utc": 1691345694,
   "score": 5,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv24t9i",
   "message": "When I was in high school we used to free climb on 50-60 foot cliffs at night for fun. We also did a bunch of urban exploration (I grew up in a rust belt city in the late 80’s, early 90’s so there were plenty of places) where we’d have to climb up other buildings and jump across to gain access. Stupid stuff like that mostly.",
   "created_utc": 1691345866,
   "score": 8,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv28zlk",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv1zuce",
   "message": "Lied to my friends and family about where I was going, took a bus from Canada to Los Angeles to meet a guy from a chat room.",
   "created_utc": 1691343862,
   "score": 17,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv21uvu",
   "message": "The ocean. One change of the tide and you can be a goner if you’re not paying attention",
   "created_utc": 1691344667,
   "score": 4,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv226zg",
   "message": "Used a mix of HF (hydrofluoric acid) and some other acid (can't remember the exact one, nitric most likely) in a very exothermic reaction to reveal grain boundaries of aluminium samples. Each time I dipped the aluminium piece in, it would start bubbling heavily, almost to the point of jumping out of the test tube. I was wearing gloves, but no lab coat as I didn't know I would need to do that on that day, and I was wearing a shortsleeved t-shirt.\n\nFor those that don't know, hydrofluoric acid contact with skin is nearly painless, but over the next few hours, it dissolves the calcium in your bones and inside your heart, best case scenario is years/a life of health issues, worst case is heart attack. \n\nI know it was stupid to do it, but if I didn't I would have needed to restart the course the next semester. The supervisor was the director of the physics department and was desensitized to the dangers of such experiments...",
   "created_utc": 1691344805,
   "score": 7,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv22l8c",
   "message": "I touched an ancient vase with mi index finger at the British Museum.",
   "created_utc": 1691344965,
   "score": 6,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv25n4i",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv22mrq",
   "message": "Swam across a lake after misjudging the distance. \n\nFall break 3 of us were walking around the lake and saw our condo and decided to swim to it. Half way we were all tired and freaking out a bit. I looked up and saw one guy way off course because he was just desperation swimming. It made me laugh which put me under a bit. I said “we’re gonna drown” which made me laugh more and struggle more. I ended up using the survival float (thank you swimming lessons) to regain my composure. Then used an elementary backstroke (is that still what they call it?) to make it there. Everyone made it. I don’t know how everyone else did. We didn’t and we’ve never talked about it since.",
   "created_utc": 1691344982,
   "score": 6,
   "submission_id": "15jsaen"
  },
  {
   "comment_id": "jv2aisi",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jsaen"
  }
 ]
}