{
 "submission_id": "15jv6l0",
 "title": "Anyone ever find a dead body unintentionally? What’s the story?",
 "selftext": "",
 "created_utc": 1691342763,
 "permalink": "/r/AskReddit/comments/15jv6l0/anyone_ever_find_a_dead_body_unintentionally/",
 "score": 85,
 "url": "https://www.reddit.com/r/AskReddit/comments/15jv6l0/anyone_ever_find_a_dead_body_unintentionally/",
 "comments": [
  {
   "comment_id": "jv27ut0",
   "message": "Walked out back one morning to let my dogs out. It was early, so it was pretty cold out. I look over and I see my neighbor sitting in a lawn chair in his yard. I get closer thinking he might have fallen asleep or something the night before and it was just too cold to be chilling there. As I got close, I see he isnt moving and then I see a puddle of blood next to him. Then I see the shotgun. He shot himself in the chest. He was an older guy, former cop, who lost his wife like a year prior. He may have gotten some bad medical news himself shortly before he did it too. It was surreal though.",
   "created_utc": 1691347098,
   "score": 250,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv1xbgl",
   "message": "I didn't but a coworker did.\n\nHe was inspecting a county ditch through the woods and there was a body on it.\n\nCalled the sheriff and left work for the day.",
   "created_utc": 1691342854,
   "score": 110,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv20dqq",
   "message": "Leaving my house for quick errand briefly noticed an elderly lady parked on side of the road. When I returned, her car was still in same location and as I looked closer she appeared unconscious so I stopped but her doors were locked so dialed 911, It was determined she had passed away.  This occurred when living on Lake Lanier in North Georgia.",
   "created_utc": 1691344076,
   "score": 206,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv24sbj",
   "message": "My brother did / went for a walk in the local park to clear his head - found a guy hanging from a tree. He said it was obvious the guy was quite dead and beyond help when he called the emergency services.  This was in a uk suburb near a school not exactly an out of the way location!",
   "created_utc": 1691345855,
   "score": 126,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv25vg7",
   "message": "Had a paper round when l was a kid. Part of my round was delivering to a retirement block. On this day l stepped out of the lift and as l approached the door to the corridor l saw a trail of blood running underneath it. As l opened the door an old lady was laid head first down on the floor with blood pouring from her head, her front door open. Tried to help her but she was clearly gone. I chucked the paper over her body and into her flat (?) and ran down to the warden's flat. \n40+ years later, remember it as clear as day. Got offered counselling and a trip to McDonald's from the police.",
   "created_utc": 1691346293,
   "score": 71,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ewk3",
   "message": "Yes. When I was 11 I woke up and was looking for my mom. Couldn't find her anywhere. Walked to her side of the bed and she was dead on the floor\n\nThat was in 92. She was 27. I'm 43 now. My hardest birthday was 28. I felt so young still and my life was just picking up and just imagine all the stuff she missed",
   "created_utc": 1691349972,
   "score": 37,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv1x8ez",
   "message": "Yep, but I handled it and hid both the bodies better",
   "created_utc": 1691342821,
   "score": 186,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv27vfd",
   "message": "I drove past an elderly lady sat on her walker at the side of the road, half an hour later driving back again she was still there in the middle of winter. \n\nPulled over and went to check on her, just as she took her last breath. Someone else stopped and we did cpr until paramedics arrived so I guess technically she wasn't a dead body until they pronounced her in the back of the ambulance?",
   "created_utc": 1691347105,
   "score": 191,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2f3an",
   "message": "I was at a family reunion forever ago. On my 13th birthday Papaw and I wake up early to go fishing on the big lake right next to the campsite. We get in my uncles bass boat and start making our way out to find a spot. eventually come across a jet ski, with the front end and handle bars all fucked up, floating amongst some rocks. I will never forget it, we both immediately looked at each other, and we knew what we were going to find. We didn't say a word, just took the boat over to the rocks and sure enough, there's a guy face down in the water in the rocks, obviously dead. We called the cops and waited so they could find him easier. They showed up maybe 20 minutes later and pulled him out, whole front of his head was just fucked. Apparently he was drunk and riding his jet ski fast as hell the night before and smashed into the rocks head on. Poor dude, think he was in his 40's if I remember right. We fished all morning and didn't say a fucking thing. Didn't catch shit either lmao.",
   "created_utc": 1691350049,
   "score": 230,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2apw2",
   "message": "This was in the neighborhood of 25 years ago.\n\nWent for a day hike a couple of hours away from my apartment. I was on a rarely used, unofficial trail that connects two trail systems and saw a patch of color that didn't look right in the undergrowth a few yards away. I walked over to check it out and quickly realized I was looking at a sweater. Got a few steps closer and turned right the fuck around when I saw a skeletal looking hand sticking out of it. I was involved in a lot of not particularly legal shit back then, so I made an anonymous call to the state police from a rest stop payphone on my way home.\n\nA friend of mine had family ties to law enforcement in the area, so I asked him if he could find anything out for me months later. Turned out to be a woman who was murdered by her husband shortly after they moved to the area.",
   "created_utc": 1691348257,
   "score": 240,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv1xbiu",
   "message": "How do you find one intentionally?",
   "created_utc": 1691342855,
   "score": 136,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv1xqou",
   "message": "Some friends of mine heard a rumor there was a body just past the train bridge that ran through the woods not quite near our houses.  Almost died crossing that fucking bridge but sure enough we found it. 2/10 would not recommend",
   "created_utc": 1691343022,
   "score": 255,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv20yjv",
   "message": "*sigh* let's read these comments then",
   "created_utc": 1691344303,
   "score": 220,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv26f4z",
   "message": "Popular forest in my region, me and a few friends cut through it walking home after school. One of them scream, followed by another scream, followed by my frozen shock. Poor dude hung himself, the flies and the noises they made still itch my brain",
   "created_utc": 1691346515,
   "score": 253,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2d8t1",
   "message": "This just happend three days ago: me and my friends were on vacation in Germany, We went to a really big castle on a hill, surrounded by a wall. Behind the Wall everyrhing was 50 meters lower. We were walking around the castle when a friend of mine stopped and asked me if I could come take a look because he saw something odd. We looked down and we saw the body of a woman. At first I thought she was just unwell or sleeping maybe but looking better you could see her hips were placed weird and her neck as well. After a while it was clear the person has passed away. Since it was 50 meter below us we couldn't reach her. Some people called the police and then we had to go. \n\nThe day after we checked the news and saw an article about a dead woman that was found near the castle. They are investigating if it was suicide or something else. We don't really have a clue what happend, if she fell from the wall or that she was walking below and something fell on her. To be honest, the view of seeing someone dead is really weird. Some of my friends were really disturbed by it, which I understand. The rest of the day was not so much fun.",
   "created_utc": 1691349293,
   "score": 213,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv29s3k",
   "message": "As a kid I walked down my driveway to walk to town, saw my elderly neighbour facedown in his hedge at the bottom of his drive. He had been gardening and had a heart attack. I pulled him out, he was completely stiff, clearly had been dead for a while. Fucked me up as a kid as I knew him fairly well.",
   "created_utc": 1691347872,
   "score": 108,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2haa0",
   "message": "A long time ago I had a job as a deckhand for a tugboat operation on the Mississippi. Basically the job entailed guiding a tugboat to break down all of the barges that they sandwich together on the way down the river and putting them where the ocean going tugs can get them on the next stage of their delivery. \n\nAnyway it was late at night and we were breaking barges apart when we were assaulted with a nasty smell. I got the tugboat captain to move his searchlight down and sure enough there was a dead body that had been sandwiched in between two barges. \n\nIt was in pretty bad shape, so I grabbed a gaff pole and hooked it while we waited on the Coast Guard to arrive. Physically loading the body was an ordeal that I won't go into, but you can imagine what condition a body would be in after it had been submerged for a couple of weeks.\n\nMuch later we found out it was a bridge suicide from St. Louis. The body must have drifted down and got caught in a barge tow and worked it's way eventually down to New Orleans.",
   "created_utc": 1691350965,
   "score": 174,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv21l2x",
   "message": "No, but for a brief moment I thought I might be in that situation...\n\nWhen my son was 11 or 12 we were at a park next to some woods. He was in the wooded area and comes running out \"MOM! There's a SKELETON back here!\"\n\nThankfully just a dead coyote.",
   "created_utc": 1691344555,
   "score": 124,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv23sa6",
   "message": "I worked as a medical assistant and called a patient back to the room and he didn’t answer me so I went up to him to wake him up because I thought he fell asleep. He was gray and tongue between his teeth covered in sweat. CPR and 911 was called but he was dead.",
   "created_utc": 1691345448,
   "score": 172,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2eovd",
   "message": "A buddy of mine skipped school one day to go fishing. He thought his fishing line was caught on debris, but as he reeled in a human hand surfaced. He called the cops and they yelled at him for skipping school.",
   "created_utc": 1691349884,
   "score": 5,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2eanx",
   "message": "I drove my daughter up a side road on the outskirts of town to take her to her part-time job. Weather was sunny and clear. Dropped her off and not two minutes later going back home all traffic was now stopped. There were only 3 cars stopped in front of me and I could clearly see a handsome blond boy, early 20s, lying across the road next to his motorcycle lying on the ground. He was just eerily still and you could tell he wasn't waking up. I didn't see a helmet. News later said he was hit by a truck - he must have been just seconds behind us when we were on the way to my daughter's work. He was pronounced dead at the scene.\n\nI don't know him but I think about him sometimes. Such a shame to die so young. There's a roadside shrine to him now that we see everytime we drive to my daughter's work. It's sad.",
   "created_utc": 1691349721,
   "score": 186,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv24ubr",
   "message": "A friend of my husband (my husband was riding shot gun in their work truck) jumped out and ran over to see if a man was dead after he drove into oncoming traffic in his semi. He didn't hit anyone but hit a rock face after going off the road... ..  if anyone knows what a body looks like when being thrown into a windshield and then being crushed, you understand.\n\nMy husband says his friend has PTSD from it, the guy switched careers to one where he didn't have to drive anywhere.",
   "created_utc": 1691345878,
   "score": 46,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2i2d5",
   "message": "We found a coffin with parts of skeleton and a piece of clothing in it. Not quite the same, but creepy anyway.\n\nI was about 10 or 11, at our school we had multiple sports fields. The rugby pitches in particular though we're at the top of a hill we had to climb steps to reach. This meant at break times, we weren't allowed up there because teachers couldn't see you. So of course, lots of kids went that way. It was easy to get out of school grounds and pop to the chip shop, or sweet shop depending on what you wanted and be back with plenty of time.\n\nOne day we'd had rain every for about a week and the field was properly water logged. We left the field our usual way, which is down a small bank, through some trees and eventually back onto the pathway that led to the village shops. As we went down the bank, me and my friend slipped. I grabbed something to stop falling, and it was the edge of a coffin. The lid of which was half off, we dared ourselves to look in and there was skeletal remains and some clothing. Possibly trousers.\n\nWe were proper freaked out. We told out headmaster, said we knew we shouldn't be on the field, but wanted to practice rugby kick goals and had lost the ball in the bush. Teacher told us we were probably mistaken and calmed us down. Dont know much more of what happened after, but we couldn't use the shortcut anymore as it had caution tape around it, and the coffin was removed.\n\nI'd guess the coffin was buried a long time ago, and came out due to ground movement from all the bad weather. Later in life, I found out the top field where we played rugby used to be a church in the 30s, but it was destroyed and the school had it as part of their grounds since the 70s (I was there in 1992). So ground movement seems possible... But it was just one.",
   "created_utc": 1691351280,
   "score": 76,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv29hsa",
   "message": "Worked at a hospital, so it was kind of par for the course, but yes. Walked into a room a few times and found that they had yet to move the remains to the morgue.",
   "created_utc": 1691347760,
   "score": 53,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ehoc",
   "message": "I am also interested in the intentional stories",
   "created_utc": 1691349802,
   "score": 14,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2eswn",
   "message": "There’s a creek in my city, suitcases were thrown back there. Someone opened one, it was arms. They had been sawn off. There were more suitcases, more body parts. A whole person had been dismembered with a meat saw and stuffed in suitcases and then thrown back there.\n\nSomeone in the apartments near by overdosed on heroine. Her boyfriend panicked when she overdosed. He used to be a butcher so he chopped her up and disposed of her.\n\nHe got caught because the store near the apartment had excellent cameras and the owner reported a strange purchase right before the news dropped of the body being found. Ol boy bought 8 gallons of bleach and that’s ultimately how he got caught.",
   "created_utc": 1691349929,
   "score": 73,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2iud3",
   "message": "No, but I often wonder what it was like for the person who found my dad sitting in his truck in a parking lot, 2 or 3 days after a double pulmonary embolism. Thanks whoever you are, sorry about that experience.",
   "created_utc": 1691351595,
   "score": 66,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv292wq",
   "message": "Not me but my dad and mom. \nMom oticed a man sitting on a bench at the cemetary had not moved since the last time they walked by him. \nDad did go to him and saw that he had shoot his head away with a shotgun. \nHe called the police and did tell my mother later that evening about it.",
   "created_utc": 1691347591,
   "score": 32,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2hi18",
   "message": "My great uncle decided to commit suicide.  We came home from Church to find him, in the kitchen, his brain matter in the sink and a shotgun hole in the ceiling.\n\nBut, at work, it wasn't uncommon to find a body during the summer and fall.  People would go swimming, boating, or hunting and fall into the river.  They would often wash up on the perimeter of the site in various states.  Sometimes you could smell a floater from a distance and other times they were fresh enough not to smell.",
   "created_utc": 1691351053,
   "score": 120,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2hs0u",
   "message": "My youngest sister would babysit for the woman at the end of our block. She was a divorced woman with 2 kids. \n\nThe ex-husband hadn't heard from her for a few days and came by her house to no answer. Came to my house to see if maybe the kids were there with my sister and if she had an answer why he hadn't heard from his ex-wife.\n\nSister wasn't home but he and I went to the house. Knocked a few times, and then he just went to open the front door. It was unlocked, and her body was in the living room. She was dead, and her children were kidnapped by her then boyfriend. The Ex-husband was rightfully shocked a d terrified, immediately called the police and reported as much info as he knew. My little sister had to answer some questions about the boyfriend, help give a description vehicle type. Just basic stuff. \n\nI think they caught the boyfriend in San Antonio, if I remember. Couldn't find the article about it online",
   "created_utc": 1691351165,
   "score": 231,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2jdf0",
   "message": "My grandma. I’d just seen her the day before, painted her nails, chilled out with her, went back the next day with flowers for her birthday and she had passed. 29th August 1928 - 29th August 2013 🤍",
   "created_utc": 1691351811,
   "score": 44,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2bofs",
   "message": "Some lady jumped in front of a train with about 200 highschool and college kids ready to go to a concert on the platform. Ruined the night.",
   "created_utc": 1691348653,
   "score": 39,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2f7gq",
   "message": "I didn’t find one ,but a guy killed himself in a patch of trees trees next to the local Habachi place. No one found him for like a month or two. Bad part was you could smell his corpse and it was unmistakable what the smell was.",
   "created_utc": 1691350097,
   "score": 24,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2hkga",
   "message": "I didn't find a body, but I saw a guy die.  Car accident.  He ran a stop sign.  He was still alive when I got there but he died while the ambulance was en route.",
   "created_utc": 1691351080,
   "score": 97,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2hmc6",
   "message": "I was walking around a track and talking with my mom and I saw a homeless guy lay down next to a tree, I thought nothing of it. I walked past him 4 or 5 times then on the other end of the track I stopped for 15min talking and looking the other way at the city, it was a spring day that felt good after months of winter - when I turned around an abundance was on the other end with the crew was zipping up a body bag.",
   "created_utc": 1691351101,
   "score": 29,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2iedx",
   "message": "Playing in the woods hide and seek. I was running after my cousin and tripped and ate shit over what o thought was a rock. Turned over to get my shoe unstuck and saw it was something white and I pulled my shoe out. I got up and saw it was actually a pelvis (I didn’t know what the bone was named at the time but I knew what a bone was) and I screamed and my older cousins came running out from there spots to see me crying and trying to get away from the fuckin skeleton sitting in the dirt and we went and told my parents. We were pretty deep in the woods so one of us stayed near by it and another one of us waited ab 50 feet away but to where we could still see each other and basically made a trail of human bread crumbs to make sure we got back to the body to show the cops",
   "created_utc": 1691351415,
   "score": 235,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2jjw9",
   "message": "Yes. My son. Suicide.",
   "created_utc": 1691351885,
   "score": 33,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2jzc0",
   "message": "I was with my then girlfriend, later wife, who shared a penthouse in Boston with her brother.  We went out into the deck one Sunday morning and saw a sweater draped over the railing.  23 floors below was a guy who jumped.  He hit the ground so hard that his shoes exploded from the force.  Police came and interviewed us and we went in with our day.  Very sad.",
   "created_utc": 1691352060,
   "score": 94,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2cndn",
   "message": "I used to work at a quick lube in the mountains. Homeless people get drunk, pass out outside, and freeze to death every year. One morning we found a guy frozen to death on the back driveway of the shop. Apparently he had gotten into a fistfight then stumbled away drunk, he tripped over the curb and just didn’t get up.",
   "created_utc": 1691349050,
   "score": 29,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv21r3d",
   "message": "Occasionally I find one in my basement or the trunk of my car that I forgot about. Does that count?",
   "created_utc": 1691344624,
   "score": 11,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2gusn",
   "message": "Was driving at night on a very quiet road when all of a sudden there were a jam of cars and there was this dead motor biker  body with a pool of blood and it was fucking scary",
   "created_utc": 1691350787,
   "score": 30,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2heno",
   "message": "I basically walked into what was either a medical emergency or a crime scene. I got off the bus, and I saw the fire department on the corner. I can’t remember if the police were on scene yet though. As I got closer, I noticed a white sheet on the ground, with feet sticking out from under it. There wasn’t any tape around the area or anything. I’m guessing the paramedics just pronounced the person.",
   "created_utc": 1691351015,
   "score": 45,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2iai1",
   "message": "Just driving down the road in a Michigan winter, saw some headlights in a field that looked off.\n\nStopped to check it out, they were off because the suv was upside down. The driver has been ejected and it landed on her. Nothing to see but a pair of legs sticking out like the wicked witch.",
   "created_utc": 1691351371,
   "score": 88,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2j7jl",
   "message": "I went for a walk with my girlfriend along the river around 1am last summer while we were walking we came across another couple visibly distraught, as we kept walking we noticed a busy slumped over on a bench with a pill bottle on the ground, cops were there shortly after, bench was removed the next day.",
   "created_utc": 1691351745,
   "score": 44,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2jeg1",
   "message": "Went to find out who parked in my spot turned out to be a guy who gassed himself in his car. Looked like a boiled lobster.",
   "created_utc": 1691351822,
   "score": 85,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2jmkw",
   "message": "Many years ago, I was pulling out of a grocery store. At the exit from the parking lot there were 2 cars ahead of me. As each car tried to exit onto the street it would u-turn and go back the other way. When it was my time to exit, I saw why. There was glass all over the road. As I was u-turning I looked towards the road and saw a body laying in the dirt. I quickly parked my car, ran over to it and saw an elderly woman, covered in blood, not breathing, not moving. \n\nI started chest compressions. After about a minute or so I thought “ok, what do I do next?” This was in the time when CPR recommended breaths in between compressions. However, there was a lot of blood so I just kept doing compressions. Pulses never returned. After a minute or two more emergency services arrived. She was dead. I turned around to see about 6-7 people gathered looking on.\n\nTurns out my perspective was VERY tunnel vision-ed. The car she was ejected from was facing the wrong way on the street and her deceased husband was still in the car at the wheel. Supposedly there was another vehicle involved which I can’t remember at all.\n\nI went home and shook the whole time while taking my groceries in and putting them away.",
   "created_utc": 1691351916,
   "score": 107,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2k336",
   "message": "About 9 years ago, I was halfway through my maternity shoot at the very end of an abandoned pier off the Delaware River.  There were also some younger folks enjoying a party along the way. We were pretty far from them catching a great sunset. \n\nAll of a sudden we saw port authority on their boats and policy taking statements from the kids, we thought, eh, probably got busted. \n\nWe say fuck it, way too much going on and walk back to the car (obviously not part of the party, so we walked right past everyone) and I looked down on the rocks as we walked back to our car and there was dead body, washed up, bloated, and pretty gnarly. \n\nMy photographer looked at us, we looked at him, had a laugh, and he says “Circle of life, great shoot!”",
   "created_utc": 1691352103,
   "score": 15,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2kgc6",
   "message": "Canyon lands. Man had killed himself a couple of days before we found him. Had to wait around for several hours before police found us and we had to make a report.",
   "created_utc": 1691352253,
   "score": 49,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2kgx4",
   "message": "Worked at a movie theatre. It was a weekday morning, so usually pretty slow for us. Went in to clean a showing of The Hateful 8, there were only two people in the theatre. One in the very back, and one towards the front. \n\nWalk in to clean the theatre, see the guy up front. Figure he was sleeping, happens sometimes. Say a couple things to see if he’ll wake up. He does not not. Get spooked and call my manager. Manager shook him a couple of times, realized something was wrong, called the police. \n\nDude was dead.",
   "created_utc": 1691352260,
   "score": 127,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2gu0f",
   "message": "Back when I was really young there was a guy that died on the sidewalk outside our house in New Jersey. I remember going outside to wait for my dad to walk to the bus stop and thinking there was a trash bag in the way. I didn’t realize what really happened (I mean I realized it was an issue because my dad went inside to call the police but I didn’t realize it was a person) until my mother was talking about it years later as one of the reasons we moved (she was telling her friend ‘keyspam found a dead addict outside’ and I was like oh shit when??).",
   "created_utc": 1691350777,
   "score": 33,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv21wxd",
   "message": "Omd was bleeding on the side of the road in Edinbrugh and dad said it was asleep",
   "created_utc": 1691344691,
   "score": 3,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2g3vw",
   "message": "A wise man never sees a dead man",
   "created_utc": 1691350476,
   "score": 0,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2befn",
   "message": " Never unintentionally.. no",
   "created_utc": 1691348537,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2c9zi",
   "message": "[deleted]",
   "created_utc": 1691348896,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ajvc",
   "message": "I have never found a dead body, unintentionally or otherwise.",
   "created_utc": 1691348188,
   "score": 254,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv1ycji",
   "message": "Ya found a dead ant",
   "created_utc": 1691343264,
   "score": 241,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ki0h",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2l8yk",
   "message": "Who finds a dead body on purpose? Except for criminal investigators or something?\n\nI intentionally went looking for my friend who went missing, unintentionally found him deceased.",
   "created_utc": 1691352576,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2lhme",
   "message": "It's the intentional dead bodies you have to worry about.",
   "created_utc": 1691352674,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2lput",
   "message": "I'm in corrections at a prison hospital. Finding dead people is kind of a common occurrence, unfortunately.",
   "created_utc": 1691352767,
   "score": 15,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2lq8y",
   "message": "Oh shoot! That's one way to avoid small talk with the neighbors. Poor guy, RIP.",
   "created_utc": 1691352771,
   "score": 0,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2m1fq",
   "message": "Nah I found it on purpose to set me and my three childhood friends on a wacky, spooky, and bonding journey before I had to switch schools and move away forever",
   "created_utc": 1691352899,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2mbru",
   "message": "I was a security guard at a pharma manufacturer in California.  Another guard and I were checking perimeter fencing and saw the aftermath of an OD suicide.  It was an employee.",
   "created_utc": 1691353016,
   "score": 59,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2mi3v",
   "message": "Not me ! a local young lad found 9 or ten dead bodies either hanging or drowned with the final one being his own mother hanging all by the time he was 15 . East Ireland 🇮🇪 even went on to Spain and pulled on in while he was on a jet sky . Was a short film about it , got in to Galway film festival. Film was called Do not Enter .",
   "created_utc": 1691353088,
   "score": 21,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2mr4t",
   "message": "Were in holiday (honeymoon) in Japan with a small group.\nOne elder man did not show up in the morning of the second day. \nEmployee of the hotel asked me to come with him and guided me to his room.\nThere he was lying dead on the floor surrounded with men in protective suits and our guide which told me he had to go to the police for some paperwork and I should tell the group to move on without him and that the guy is feeling unwell und has to go to the hospital with him.",
   "created_utc": 1691353191,
   "score": 29,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ms5f",
   "message": "Just wandering around the funeral home where a family member was cremated, and I just happened to see a casket with a man laying inside, his arms crossed over his chest. He had the mortician makeup on, complete with a pair glasses. It was only a bit over a week after the first time I saw a dead body.",
   "created_utc": 1691353203,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2n2y6",
   "message": "Sort of…I was in the car when we pulled up to a gas station in North Jersey. So, my dad gets out to get something, it certainly wasn’t to pump the gas because we don’t do that here. Anyway, he starts freaking out there’s a dead body here somewhere, and the attendant is like what do you mean? My father’s like there’s a dead body, I can smell it, I know it, I know that smell, I found enough of them in Vietnam. Call the police! I know there’s a dead body here. Well, he wouldn’t let me out of the car, I just stayed in the car. But the police came, and yes there was a dead body in the ditch nearby. The police said, how did you know? And he said because you don’t forget what a dead body smells like, it has a very particular odor, a sweet smell. It was all you could smell sometimes after a battle.",
   "created_utc": 1691353323,
   "score": 25,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2o32q",
   "message": "I was waiting for the bus home from work and a drunk guy going 140km/h (86mph) rammed it into the opposite bus stop full of people. I went there with the intention to do first aid to anyone that needed it. When I came closer, it was obvious that everyone who was hit didn't make it. I just called the emergency phone number, gave them information and then navigated the paramedics to the bodies.",
   "created_utc": 1691353734,
   "score": 112,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2okpy",
   "message": "Mother found a corpse at sea while pedal boating with her sister as a kid. This was off the coast of Senegal 60 years ago.\nTurns out an airliner had crashed at sea about a week earlier, with a fair number of missing passengers.",
   "created_utc": 1691353934,
   "score": 77,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ovc4",
   "message": "Story time\n\nIn 2017 I used to work as a photographer for one of the biggest shoe stores in Gdansk, Poland. Like one of those with limited, mostly overpriced rare kicks mixed with normal new balances and nikes. I was responsible for doing packshots (pictures of the product on white background you see on every website) and more lifestyle type of content for social media. The latter was really fun, because I got to take 5 or 6 pairs and go somewhere to shoot with my friend, who would just put them on for pictures. Guy was very athletic so if I envisioned him standing on his hands, jumping very high or run super fast for photo, there was no problem with any of that. The golden rule was that location had to match the shoe in some way. For example soccer cleats somewhere on the field, basketball shoes on court, running shoes on track etc. It was my role to get creative with it. One day I had to do a pair of Timberlands, some Puma running shoes and Vans’ in collaboration with Nintendo. I Was really looking forward to those Vans, because I managed to book local arcade spot before it opened, so creatively it was dope. We shot quick pictures of running shoes on local track and decided to take Timbs to a nearby forest, where we knew there were some old, post war bunkers. It was winter, so grey concrete, some snow and trees seemed like a perfect spot for mustard-colored shoes to „pop up”. And it was „in theme” since in Poland 6 inch Timbs are more of a winter shoe than work boots. So my friend put the shoes on, went to a spot near the entrance to the bunker where I told him to stand and froze... He turned around and said „Come here and tell me that I’m not seeing what I’m seeing…” So there I went thinking he found some money or phone or something. Nope, there was a body like 2,3 steps inside the „hallway”. Completely covered with some rugs and cardboard except the f*cking creepiest, now engraved in my memory paper white face, with open eyes and open mouth „looking” right at us. He was lying on his side and his head was turned up towards us, what made it even creepier. We just stood there for like 20 seconds not moving, not breathing in complete silence. Like we were waiting for him to say something or I don’t know, stand up. It was clear that guy was dead but we yelled „hey” a few times because we couldn’t believe what is happening. The fact that this guy was near the entrace and there was this whole, huge, dark f*cking hallway with bunker room behind it started to create weird scenarios in our heads straight from zombie/friday 13th movies. We went back to the car and called the police. Patrol car came in like 2 minutes. We pointed two cops where to go since we really didn’t want to go there again. Turned out it was a homeless guy who got very drunk and went to sleep right after downing whole bottle of vodka. Froze to death. Cops said they knew him, he was about 60, in and out of prison. It took them like 2 hours to take our statements. I remember one of them not believing that taking pictures of shoes can actually be a proffesion, so I had to show him what pictures we’ve taken already that day. Next day there was like a brief mention in one of those local newspapers saying that police is looking for any realitives of a guy. Oh, and we didn’t go to the arcade to take those pictures. Went to a bar and got drunk instead.\n\nOn a „funny”, shorter note. In 2022 my car was stolen and I had to go to a police station to report it. When cop was putting my info to the system he looked at me from behind his computer and said „holy shit, you’ve just randomly found the body?!” Had to tell the story again. Still, didn’t find my car.\n\nPs. Sorry for my english, It might be the longest i ever wrote in that language :)",
   "created_utc": 1691354053,
   "score": 102,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ownr",
   "message": "as opposed to intentionally?",
   "created_utc": 1691354069,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2p6k9",
   "message": "I passed an older lady while walking my dog. She was acting a bit strange but nothing alarming when I saw her. Shortly there after, she approached some neighborhood kids, maybe 14 to 15 age range, trying to give them her car keys saying to take it she doesn't need it anymore.  As I was walking back into the house, I heard a pop and figured one of the skater kids had some firecrackers. Late June, so again, no real concern.  The cops swarmed* the block. She had a mental health crisis and shot herself in the heart with a .22 just feet from those poor kids.",
   "created_utc": 1691354181,
   "score": 85,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2q25x",
   "message": "Smelled a really bad/sweet death smell seeping into my apartment, noticed it was much stronger under sinks/ in cabinets and realized I hadn’t seen the old man downstairs in a few days who usually sits on porch all day and went to knock and spotted dozens on flys in window. Called maintenance and they called police immediately the old man passed a few days back. Terrible smell that I’ll never forget. RIP old dude.",
   "created_utc": 1691354536,
   "score": 61,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2pibf",
   "message": "I was a park ranger at a mountain resort/park and would get up at 5-6 am to clean the facilities, then do a quick sweep of them before the end of my shift 1-3pm. \none morning i was just doing the regular cleaning schedule and the afternoon before everything was smooth, the mornings were sometimes really eerie as it was usually foggy in the fall and dark. The first few facilities were a bit messy from the evening activities, then I approached a pit toilet that was always in a creepy spot that was on top of a hill near a trail head that looked down into the forest, first light was approaching and it was foggy in the forest so I still needed my headlamp.\n\nI knew something was off then i saw a whole pack a cigarettes smoked and a empty bottle of fireball at the picnic table near the toilet but i just brushed it off as a group of mountain-bikers hanging out after a days ride. I cleaned ip that mess then went into check the toilet, idk what mountain bikers eat but they always seem to destroy the toilets so I was expecting the worst.\n\nI opened the door and shined my light in and theres a man hanging from the rafters with his belt wrapped round his neck. Called the police and my manager. Everything felt cold for the rest of the day. Only been working there for a couple months and saw so much.",
   "created_utc": 1691354312,
   "score": 22,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2sq89",
   "message": "I was driving my scooter home, through an Amsterdam neighbourhood. I heard a bang and saw a guy dressed in leathers and a helmet run across the street and get on his motorbike, speeding off. When I looked where he ran from, there was a body on the street, face down in a puddle of blood.\n\nAnother one:\n\nI was glider flying on a hot summer day at a busy but small airfield. Thunderclouds appeared, so time to pack up. I was assisting at the winch truck, which was there to launch the gliders. Winch operator got nervous having a few hundred meters of steel cable on a drogue chute in the air (lightning rod) and cut it with the hydraulic knife. So far so good.\nWe continued wrapping up and I decided to pick up the steel cable from the middle of the airfield. Grabbed a car, radioed the tower my intentions and proceeded.\n\nI found the cable, pretty much in the middle of the very flat field. It had already started to rain. I got out of the car standing on the wet grass, holding the very long steel cable, trying to hook it to the car. \n\nI managed to do so, but then there was a loud bang, at the edge of the field, near the static line and hangars. At first I thought it was a plane engine malfunction or something like that. \n\n I saw people rushing toward a smoking mass, I still thought it was an engine. I drove towards it, thinking I could help while I got closer I noticed it smelled....weird. Hair at the back of my neck raised, but still not realising, I got closer . I saw a single jump boot on the ground, ripped to shreds. I looked over at the other people there and realised they were performing CPR on the smoking mass. A parajumper got hit by lightning. Instant crispy death. Then I realised where I was the moment it happened and how lightning apparently not always chooses the shortest distance to the ground. \n\nI chose to stay inside for quite a while during subsequent thunderstorms...\n\nI will refrain from sharing the war stories from former Yugoslavia.",
   "created_utc": 1691355620,
   "score": 140,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2pkou",
   "message": "I live in New York. A few weeks ago my train (uptown 6) stopped suddenly and wouldn’t let anyone off for a few minutes. When they finally did, I saw the train conductor walking along and looking under the train with a flashlight. I looked down and saw a man with a white shirt and a bunch of bright red blood underneath. He jumped in front of the train.",
   "created_utc": 1691354339,
   "score": 27,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2pzhv",
   "message": "I was renting a room off one of the regulars in the pub I was running. He wasn't old, mid 50s I think, but he wasn't well and wasn't sure what was up with him.  Poor bloke ended up having to give up his job so I suppose me renting the room was good for him as he had some income. Anyway I went out of town for a weekend to go and stay with my wife (girlfriend at the time). I left Friday morning, said bye to my landlord, and came back Sunday evening. I stopped off at work first to check they'd been alright without me for the weekend and had a beer, before leaving and going home. This was about 10pm, probably 10:20 when I got done walking home. Got in and found my LL on the steps, assuming he'd passed out from having a few drinks, which wasn't unusual, I'd stumbled upon him passed out more than once. I tried to shake him awake and was going to help him into bed but he wouldn't wake up, so I checked his pulse and realised he was dead. I panicked and a mutual friend, crying down the phone that he was dead. She and her partner, another friend of mine, rushed over about 5 minutes later and they checked his pulse. We rang 999 and they told us to get him off the steps and try chest compressions but we argued that he was already gone (he had rigor mortis, his hand was gripped on the staircase spindle) but they kept insisting we try so my friend got him down and tried resuscitation to no effect. The police turned up shortly after and we gave details etc and I was put in the back of a police car while we waited for SOCO, my friends told to go home. Now, me and the landlord were both messy people, and it looked like there was a scuffle at the top of the stairs and he'd been pushed and broke his neck. The mess at the top of the stairs was actually just him stumbling over drunk one night and neither of us tidied up. Anyway SOCO eventually turned up and determined he hadn't broken his neck, they weren't happy we'd moved him off the stairs though, despite being told to do so. They then said they were locking down the house and all I was allowed to take were my phone and work keys, until his next of kin could let me in, as there was no tenancy agreement or anything saying I lived there. They took me to my parents house, must have been about 5am at this point. A week later I found out he'd died of pneumonia, after passing out",
   "created_utc": 1691354506,
   "score": 38,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2q9id",
   "message": "Not me , but my brother. He and our (14 at the time)neighbor went swimming in local lake. While there, they spotted wierd looking log in the water. My brother joked \"it's not a log, it's a dead body!\". Neighbor went to check it, and after initial shock they went out of water and called police. It was some tourist who went missing a couple of days ago, went swimming while drunk.",
   "created_utc": 1691354619,
   "score": 27,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2qpdb",
   "message": "This was my housemate back in November.  We'll call him Charlie, 31 M.  It was 2 days before his 32nd birthday.  It was a very traumatic day.\n\nWe lived with in a house with a mother and son who had a huge family wedding that weekend, so they were away with family functions.  We also lived with a very old blind dog who caused daily inside bathroom accidents.  Around 10:00 AM that morning, a little after I woke up, I was cleaning up after the dog in the backroom.  I looked out to see Charlie in a patio chair with a blanket.  \n\nI noticed he was sitting with his head low to one of the arm rests.  For some reason, I think my instinct knew he was dead before my reasoning could compute it.  I know this sounds irresponsible, I told myself he was just sleeping because I was just talking to him around 1:00-2:00AM about what he wanted to do for his birthday.  I also had never seen a dead body before.  I told myself I would check up on him in 30min - 1 hour because I didn't want to wake him up.  He worked two jobs and 80 hours a week at least, so thought he could use the sleep.\n\nAbout an hour later, I was going out to get some breakfast.  I went out to wake up Charlie so he could keep an eye on the dog.  \n\nI yelled his name a few times, and he wasn’t responding.  As I walked closer, I noticed his eyes were open.  I put my hand on his shoulder to try shaking him, but again, I received no response.  I put my hand on his neck for a pulse, and I did not need to be a medical professional to know he’d been gone for hours and hours; Charlie probably passed in the early morning.  He was almost as cold as the air.  It was singularly the most horrific thing I’ve ever seen with my own eyes.  I remember running inside and staring at him without blinking through the backdoor in terror and nausea for 2-3 minutes.  \n\nI called 911, and within 90 seconds, emergency responders were in my backyard.  A friend from the neighborhood came over to help me wrangle what seemed like 18 police officers, firefighters, EMTs, and medical examiners.  The autopsy came back with a cause of 100% fentanyl.  I knew he was an addict but had no idea he was using fetanyl.  I believe I am also the last person to see him alive and speak to him face to face. It was hard to eat for about a good 2-3 weeks after that.",
   "created_utc": 1691354799,
   "score": 36,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2qps7",
   "message": "When I was 14, my father had a heart attack at home. The paramedics could not help anymore. He died that Thursday at about 6 or 7 pm.\nWhen the paramedics had left, I entered my parent's bedroom. I guess I wanted to get some stuff from there.\nI saw my father's corpse lying on his bed covered with a blanket.\nThat day, I lost my dad, saw him dead, found out that PMs leave the corpse where it died.\nAnd I learned what dead silence means and feels like.",
   "created_utc": 1691354804,
   "score": 38,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2t312",
   "message": "No me but my boy. Driving home on christmas eve found someone laying on side of road. Got out and checked on them. It was way too late, hit by drunk driver.",
   "created_utc": 1691355762,
   "score": 22,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2v8w6",
   "message": "When I started my paramedic career, I was working industrial for a while and ran into another medic who found a pretty horrific one.\n\nA vac truck, middle of a particularly rough Canadian winter had the hose build up with ice. Buddy decided he would knock the ice away with his hand without shutting the machine off. He succeeded. However, the super intense suction caught his coveralls which in turn sucked in his arm. \n\nWhen they found him I was told the vacuum sucked out all of his insides. There was some bones and skin left. That must have been a terrifying few seconds as your entire body is being sucked out of your arm hole into a vacuum truck.",
   "created_utc": 1691356650,
   "score": 48,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2vdwe",
   "message": "My brother did. He was having a few drinks with his roommates. Went to bed and came down in the morning to find one of them had choked on his vomit after staying up to drink more.\n\nStill can't stand the smell of gin.",
   "created_utc": 1691356708,
   "score": 27,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2qe9m",
   "message": "Rob Hubel's YouTube series- [Do You Want to See a Dead Body?](https://youtu.be/j48WOIm_Arc)",
   "created_utc": 1691354674,
   "score": 2,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2r0ub",
   "message": "Spring or 1990, I was near North Ave beach in Chicago with a boyfriend. We walked down to the water, there were huge concrete \"steps\" before some really big rocks, and we stopped there. I was seriously afraid he might be proposing.  Then he said \"Oh shit.... don't look down.\" So of course I did, and I immediately saw what I thought was a mannequin. But a very bloated, blue mannequin. I thought we were being punked. It took me a second to realize that it was a dead male body in swim trunks. We had to go to a PAY PHONE because of course, the one time you need a police officer, there wasn't a single one around. We didn't walk around with cell phones back then. We called 911 and about 15 minutes later, a older, large, very grumpy officer pulls up in his squad car looking like Andy Sipowitz. With a cigarette hanging from his mouth he yelled... \"HEY.... are you the guys with the dead body??\" I shit you not. He acted like he was delivering a pizza. As a 19 year old girl I felt like I had dropped into The Twilight Zone.  After that a bunch of people figured out what was going on, and ems pulled up, and they had to cover the body with a tarp because it was wedged in some rocks. A huge crowd gathered, and a Dad even put his son on his shoulders so he could SEE THE BODY BETTER as the tried to get it on a gurney. . I was mortified. We eventually just walked away ... nobody even asked our names or anything. I heard on the news a few days later that \"Police recovered a body...\" and I was a little irritated. They might have  recovered it but WE found it.",
   "created_utc": 1691354929,
   "score": 21,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv30j38",
   "message": "Going back home with my mom when i was 12, in the road there was a accident with a motorcycle, and a trail of blood alongside a guy fallen on the ground, his head was a bit open and there was paper on the wound (i think someone has tried to stop the bloodstream) but pretty sure that guy was dead, minutes after i was talking with mom how life is fast and told her the whole story of the game Heavy Rain (idk why, it was the context)\n\nanyway, same mom told me when she was a kid, travelling by car with my grandparents, saw a burned car on the road and a toddler's arm hanging off the window, clearly burned, a fucking movie scene.",
   "created_utc": 1691358912,
   "score": 12,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv31f34",
   "message": "I did with my partner. His nephew was living with us and abusing fentynyl. We found him one morning in his room when he wouldn't wake up. It's been horrible. I still kind of look the other way when I walk past his room and the door is open. Idk really know why. But I do.",
   "created_utc": 1691359296,
   "score": 28,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv31o0b",
   "message": "Found a dead body surveying a property for a construction job. It was around Halloween about ten years ago and I initially thought it was a Halloween decoration but it was a guy who shot himself in the woods.",
   "created_utc": 1691359405,
   "score": 13,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv31omd",
   "message": "Maybe this doesn’t count but working in a nursing home I’ve discovered people who have died unexpectedly.",
   "created_utc": 1691359412,
   "score": 5,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv32ba4",
   "message": "Yea, i found my dad. Thats the story. It sucked.",
   "created_utc": 1691359684,
   "score": 22,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv3313d",
   "message": "I was 17, coming home from a closing shift at my first job.  I walked in the house and saw my mom slumped forward in the chair she always sat in while reading. At first I thought she’d fallen asleep that way and laughed to myself. Called out to her a couple times and as I walked closer I noticed her hand on the floor had what looked like bruising on the bottom side of it.  That’s about when I realized she had died and been dead for some time.",
   "created_utc": 1691360005,
   "score": 31,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv33f84",
   "message": "Yes. I went on a morning run along the beach few years back. My ex and I. As we approached the beach he asked for me to choose run left or right sea he asked which way I want to run. I chose to the left. After about a mile or so we saw something ahead, from distance looked like a driftwood log. When we got closer I realised it was a person. There were couple people already and my brain instantly made up this scenario it was a photoshoot. I think they had Nordic walking sticks I took for tripod or something. As we got closer we realised it was a young woman who has drowned and been washed ashore. It was not pleasant sight and my ex hugged me instantly to shield the view.\n\nWe called police and were allowed to go. I keep thinking I wish I said let’s run to the right.",
   "created_utc": 1691360184,
   "score": 21,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv33o1o",
   "message": "I was a mail carrier. Had an elderly lady on my route named Mrs. Wardlow. \n\nI would bring your mail into her home and pull her trash cans to and from the curb. \n\nI took a couple days off. When I did, my sub wouldn't know to bring the mail inside. When I get back to work, I carry her mail in. I find her sitting in her chair. At first I thought she was asleep and let her alone. I finish my day carrying mail.\n\nThe next day, she was still in her chair and I knew something was very wrong. \n\nCoroner said that I was very likely the last to see her alive. She'd been dead at least three days when I called. \n\nI hate that the mailman was the last person to talk to and see her before she passed away.",
   "created_utc": 1691360295,
   "score": 30,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2pg45",
   "message": "I was twelve going on thirteen first time I saw a dead human being. It happened in the summer of nineteen-fifty-nine. A long time ago. But only if you measure in terms of years. I was living in a small town in Oregon called Castle Rock. There were only 1281 people, but to me it was the whole world. I never had friends like the ones I had when I was 12. There was me Gordie LaChance, Teddy Duchamp, he was the craziest guy we hung around with. He didn't have much of a chance in life. His dad was given fits of a rage. One time he held Teddy's ear to a stove and almost burned it off. Chris Chambers was the leader of our gang and my best friend. He came from a bad family and everyone just knew, he'd turn out bad. Including Chris.",
   "created_utc": 1691354288,
   "score": 2,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2q6tn",
   "message": "Found my favorite uncle, Uncle Alfresco, dead on the floor, shot through the back of the head. Plus no bicycle. It was a disappointing Christmas on many levels.",
   "created_utc": 1691354588,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2qzcf",
   "message": "One time I walked in a forest searching for asparagus. I saw a man whose leg was trapped in a bear trap of something like that. He asked shouted something like:” pelp” I said : “sorry sir, I don’t understand you” And left. \nThan I passed by next week searching for other asparaguses since it rained and the motherfucker was dead…",
   "created_utc": 1691354912,
   "score": 254,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ubun",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2wyjt",
   "message": "So Me and my brother were floating down a river that runs from the  suburbs of our city to the Mississippi river, about a 9 hour trip . We get about half way when we the reach a rough part of the city. River is badly polluted, it's recently been dredged so the bank is sitting like 10 feet high in either side to help with flooding. We look and see what looks like a man's torso and legs but can't tell so paddle closer to the bank and start screaming. There's no response as by now we can definitely tell it's a person, but can't see his top half. It's the middle of July at noon in the South ain't nobody sleeping through that we call the cops give them the gps coordinates and keep on down the river. The cops had the audacity to ask us to stay with body since it's deep in the woods to help them find it. HELL NO. We weren't staying in the hood deep in the woods,so we lied and said the river was pulling us down stream. Not 7 minutes later a helicopter starts circling our position as we keep paddling. We finish 2 hours early as we decided not to make any stops and just had lunch in the boat. Get a call from the sheriff's department later confirming our description of the man and proceed to get hammered and go see a movie to take our minds of it. So glad we couldn't see his face, but it was the last time I probably ever float that section of river.",
   "created_utc": 1691357372,
   "score": 7,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2qw9g",
   "message": "Like 15 years ago I lived at home with my dad and worked nights. He rented out the bedrooms upstairs to two single guys. One morning I'm getting home around 730am, and theres about 1 tenant and 3 other dudes upstairs making a commotion outside the other tenants door. They say they're there to pick him up for work, he's never late and is always waiting outside, the tvs on so he's deff home. The first tenant I guess let them in when they started knocking. Anyway, I decide this is my time to be a hero, I kick in the door with the force of a thousand waterfalls. There he is, dead as fuck. Already rigamortis has set in. He's sideways and hunched over next to his herion kit, his mouth is filled with and has been leaking foam/vomit. The guy od'd. He looked like one of the corpses from the ring. \n\nI called my dad and 911. After my dad wakes up were waiting outside for the ambulance to retrieve the body, our neighbor across the street who must be an emt comes running across, \"have you tried giving him mouth to mouth?\" \nMy dad and I start laughing hysterically and I said \"no way, wait till you see his gross ass mouth\"",
   "created_utc": 1691354877,
   "score": 3,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2sem7",
   "message": "Glasgow, Scotland: My uncle went to pick up his car from a mechanic after not hearing from him for several days. \n\nHe walked into the garage and saw the corpse hanging right above the bonnet of his car, boots just about brushing against it. \n\nThe guy was a friend who struggled with depression and alcohol his whole life (see: Glasgow), and we went to the funeral. I’ll always remember this line from the eulogy: “[Deceased’s Name] was a man of a hundred strengths…and alas, a single weakness.”",
   "created_utc": 1691355490,
   "score": 31,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2v91g",
   "message": "Yes. I have been the first to discover two suicide cases. One was a stranger floating in the Chesapeake and I was with several other guys. The next was a friend, whom I discovered alone.",
   "created_utc": 1691356652,
   "score": 13,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv38ezm",
   "message": "One day my mom called, said my 89 year old grandad wasn’t answering his phone.   I lived closest, and could I check on him.   I did, he’d passed away the night before.  He was in his easy chair with the phone in his hand where my dad had talked with him the night before.  Not a bad way to go,  but I was hoping and wishing he might have been outside gardening.    Not really a surprise but, still, a shock.   He was the best.",
   "created_utc": 1691362442,
   "score": 26,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv3d2tl",
   "message": "Weirdest day of my life. I was going to highschool listening music on my headphones and then I heart a loud but dry bang. I took my headphones out but couldn't figure it out where it came from. After walking a few minutes I saw a man laying halfway to the street with a trail of blood running from his head into the asphalt and a small hole on his forehead. A policeman was diverting traffic so people wouldn't run him over. Putting 1 and 1 together it really looked like the man tried to run but police shot him in the head and he fell. I went to school and a few hours after I googled and found out the mídia was saying the man simply felt I'll and died. I got confused because I heard the bang, I saw the hole in his head. How was the police there after just a few minutes after he \"fell\"? Idk, I don't like conspiracy theories but that really looked like an execution by the cop and cover up in the media.",
   "created_utc": 1691364570,
   "score": 7,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2tlv6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2yzdw",
   "message": "Tbf if anyone found a dead body intentionally, I'd be curious to hear the story too",
   "created_utc": 1691358245,
   "score": 12,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv3581g",
   "message": "As a child I apparently found a detached hand and a part of torso in a forest, near a railroad. I told about the hand to my parents when I got home, I have absolutely no recallection of the event even tho I was 7 years old. My parents informed the police, and they investigated it, but the cops apparently knew instantly whats going on. So someone comitted suicide on that railroad and some of the body parts was found by me few days later about 700 metres away from the impact location.",
   "created_utc": 1691360996,
   "score": 19,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv3595z",
   "message": "I hadn’t heard from a friend in a couple of days. We’d met in rehab and she continued to struggle with alcohol and ED. I was going to a bbq and had a weird feeling, so I drive by her house to check on her. She had died in her bed. \n\nIt was beyond tragic and still fucks with me today.\n\nShe died in squalor leaving behind her two Pomeranians. The police let me take them home until someone could get them. This was March 2020, about a week before everything locked down.\n\nI miss you all the time, Beks. I’m glad you’re finally free",
   "created_utc": 1691361011,
   "score": 24,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv3oekr",
   "message": "TLDR; found my uncle as a little girl dead from years of substance abuse. in the last year I have become him. \n\n\nDamn reddit, I didn’t plan to make you my diary today but I really need it. It’s an important day. Ignore voice to text errors. My first memory where I recall not just an idea, but visual details, is being asked by my grandmother to wake up my uncle so the three of us could go to breakfast. He was early 50s and had a lifelong history of very serious alcohol abuse, and I would suspect, just looking at the state of him in pictures, drug use. \n\nIt’s really inconsequential things that I remember because I didn’t understand that anything serious was happening, but the shades were drawn and it was really really dark in there. It was a guestroom but he would crash there sometimes if he needed somewhere to sleep. My dad kept us away from my grandmas house those times. The headboard was to your left when you walk in, he was on the left side of the bed towards the far wall. And then some amount of time that I don’t remember at all but I have a weird feeling that it was too much time….like, maybe I was poking at him, or scared of going all the way in there because it was too dark. I didn’t know him very well. There’s a gap there, and all I see is a pack of Kools, a wife beater, and the very very wrinkly skin of a man who ran himself absolutely ragged.\n\nThen I’m in the living room telling my grandmother that uncle Robbie won’t wake up, she asked what I meant, I said I don’t know he won’t wake up, and I can only imagine that my grandmother knew what that meant after so many years. Next memory is EMTs or coroner, shuffling around and my dad holding me and me just kind of looking around observing with again zero impact of the situation. \n\nI don’t think this had any trauma on me or anything at the time or most of my life, because I didn’t have the capacity to know how sad it was. My grandmother sacrificed every bit of a life for herself for her kids after my grandpa ran back to Ireland. My dad protected him at all costs as his older brother. Even with those two things, from the way it has been told to me in short stories (more often than not a funny version of a not funny situation in which a car is flipped or hes shown up with another elopement wife, or he and his drunk friend fly an old Cessna over Boston back when this wouldn’t get you shot down, and he jumps out near blackout with a poorly packed parachute. my dad was a parachute rigger in the Navy, and then owned a skydiving company when I was a kid. He once said addicts LOVE skydiving, because he wonders if it’s the only thing left that gives them a rush… Makes me wonder what he’s addicted to. All in all, uncle Robbie was a lost cause from the get, and all you could do was laugh at the shit he pulled when he decided to come around. Eventually, voids become who you are, and not a wound to heal if you leave them long enough.\n\nIt’s such a huge moment as not only my first memory, but a morbid one, and one that looks way too familiar right now. He was a very forgotten soul, all the stories are of him are coming and going out of the woodwork, a new girl, a crashed car, but always going back to it to be invisible again. This topic of my finding him came up in a offhand comment a few weeks ago and my dad said he didn’t remember that, but he was distracted and I don’t think the impact of what I said translated at all. He’s not the only one who brushes off that comment, I think the assumption was that I was too young to remember any of it.\n\n I’m going into this too much because a little catharsis is needed today. I sent myself to rehab for the booze, and got sober in August of last year, but because of a horribly abusive system in the state of MA it was a mistake and it destroyed the self-worth that I had left. I was passed around by patient brokers bc I had the golden ticket of insurance for them. I felt good and strong and I was happy, and I knew I was doing well enough to leave but then their blank check would be gone so they had to convince me that I was hopeless, I’d be dead in a ditch on Tuesday, my family was tired of my bullshit… I had had no consequences besides the slow erosion of my quality of life up until then. I made the choice to go on my own, I was proud of that choice, most of my family was surprise, I had a six-figure job, no criminal record, a loving husband…. One week of detox, and then back to work turned into a year yesterday I was and I am destroyed.\n\nWhen I finally made it out of the system almost 4 months, 3 facilities, 2 sober homes, and $123K later, half of a person with bipolar diagnosis that has been untreated for quite some time I realize. I see now that I was in mania which I’ve recognized I’ve gotten in the past, but when you’re in a constant state of either going into or coming out of being drunk, there was a bit of a stabilizing affect. I went scorched earth. Never spoke to my job again, despite having an open invitation to return, why would they want me? Left my husband, which granted was on my mind for some time, but my God that he deserves another way for it to be done. My dog is gone with him. I’ve stopped talking to my family. I’m in a shit apartment alone, all day every day. I’m sick and we don’t know why the word demyelinating got thrown out for the couple times. I tried to get help the word substance use disorder and no insurance because I missed an enrollment date and the state magically has lost any record of my trying to reach out. It was too much. A shitty friend from rehab did what only a very shitty person would do which is introduced me to a drug I’m too embarrassed to say. It’s been almost 8 months of day in and day out mind numbing isolation. My family knows I’m not okay, but NO ONE would dream that I’m this far gone. It’s not just a use it that the bipolar has swung to a low that is a whole new world without the alcohol. \n\nI mentioned needing this because I’ve been building up to ending it with my dealer for a couple weeks and he’s thankfully on board. I sat in the car and watched him delete my number and text after blocking it, I did the same, and he wish me luck. Not like I’m ever going to go to rehab again so here we go… \n\nHere’s to day one of white knuckling it so that one day I don’t have to be found by confused little girl who thinks nothing of who you were as a person because you were mostly a ghost to us, and now I know all too well, a ghost to everyone else too. I hope you found some happiness amid the pain that most people oversimplify into words that eat away at how you see yourself and how you operate in the world. I’m sorry that the stories I’ve heard have you reduced to a single dimension, and beneath saving before you even had chance to fight your way out. You probably picked up the bottle, a pipe, or a needle to cope with that new and terribly dark world view. It’s 25 years later, and I could never have imagined that in any lifetime I’d be able to understand who you were and how you died. \n\nI see you now.",
   "created_utc": 1691369825,
   "score": 38,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv3nq93",
   "message": "I work as a paramedic so I find dead folks a couple times a week usually.  One that really caught me off guard though was when we responded to a call for a cardiac arrest.  The job text came over as “caller states she her neighbor is dead”.   \n\nSounds reasonable enough.  We arrive and find an elderly lady wringing her hands in front of her neighbors door.  She explains that he didn’t show up for tea this afternoon, therefore he’s dead” \n\nWe roll our eyes and knock on the door. There’s no answer, and our department policy states firefighters have to break down the door to confirm that he isn’t dead inside.  \n\nThe firefighters arrive and don’t want to take the door because it’s an iffy call at best.  After much back and forth, a police officer agrees to get boosted through the window.  He gets in, comes to open the front door and announces, “yep. He’s dead.”  \n\nThe neighbor says they’ve had tea together every day for the past 40 years and she told us so”.   My partner and I were just dumbstruck at how sure she was and how right she was",
   "created_utc": 1691369507,
   "score": 19,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2q8gn",
   "message": "Sitting in my flat  when all of a sudden I hear what I think is a car crash.\n\nLook outside, see no cars on the street, I walk onto my terrace and look over the railing.\n\nDead guy, had jumped from the roof, his body hitting the pavement sounded like a car crash, I vividly remember seeing his brain laying a few yards from his body.\n\nThere wasn't any blood and the brain was *way* more pinkish white than I imagined a brain to look like.\n\nIt was the (adult) son of someone that lived in one of the penthouses on top of my building, he was visiting his parents and was having troubles that apparently became too much for him so he jumped off of my sixteen story building.",
   "created_utc": 1691354607,
   "score": 12,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2xqr2",
   "message": "Went swimming with my family when i was around 13 years old. Was a lake which is pretty busy with swimming. There was a section with like 2 slides which end in a separate pool. Me and my brother went to these slides cuz y'know, we were kids and love slides. First time we went off them and dropped into the pool, i felt something against my feet. Thinking not much off it, maybe it was a branch or something, I didn't pay it a lot of attention. Second time we went off the slide, i felt it again, and thinking \"oh maybe someone will actually hurt himself on this\" I reached down to remove the branch from the pool. I grabbed it, pulled it up and there I was holding a leg. After a second or two I pulled a kid, maybe 8 years old max, out of the water and placed him on the ground. The lifeguard who was (supposed to) watching the slides and pool screamed in horror and thats when things really sprung into action. I ran towards the nearest person to tell them to call 112, the alarm code in my country. Others tried applying CPR already. At the end a helicopter came but it was too late already. Later when I was 18 I became a lifeguard for a few years myself.",
   "created_utc": 1691357707,
   "score": 16,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2upsf",
   "message": "I found both of my parents dead bodies, months apart. Mom went into cardiac arrest in her sleep, dad killed himself months later.",
   "created_utc": 1691356431,
   "score": 15,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv397tb",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2yh9q",
   "message": "A dodgy neighbour came round and told me he hadn't heard from another neighbour. The missing neighbour was an alcoholic and we used to hear him taking his bottles out to the bin and I realised I hadn't heard him in a day or 2, so I went to his flat to look for him. \n\nI went to his place and knocked. No answer. I knocked and shouted, no answer. Then I opened the letterbox and immediately said 'Call the police NOW! It's definitely an emergency! \n\nThe police came, I told them what I could smell and what I suspected and within seconds they had bashed the door in. They quickly confirmed the stench was indeed my dead friend.\n\nI never went in the room, I didn't want to see what I could smell, but it is a smell that will stay with me forever. The police told me it was not a pretty sight and I was better off remembering him the way he was, and I wasn't going to argue!\n\nI never did find out what he died of but being an alcoholic diabetic can't have been good. \n\nHe was a good guy, I liked him. I was a vulnerable teenage girl and he was a middle aged gay man. It was nice to have a no strings attached friendship.",
   "created_utc": 1691358026,
   "score": 15,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv33lqe",
   "message": "Security guard on his first day of work at the hospital I work at did. \n\nWe suddenly had a problem with crows dropping stones on cars in the parking lot. It went on for weeks. The hospital asked if they could have someone shoot the crows. The police said no of course. A new guard on his first sweep of the parking lot found a car with a body inside of it. The body and car were removed, and the crows left.",
   "created_utc": 1691360266,
   "score": 12,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv372pm",
   "message": "When I was 13 I got a job thru the local city cleaning houses for poor old people. \n\nI came by after school  one day to do a couple hours for a dear old woman. She was so sweet, she'd tell me all sorts of stories about her childhood. I knocked, but no answer, so I let myself in. \n\nI walked thru the apartment looking for her. Found her in bed. She was so still and quiet. I went next door and her neighbour called the cops and stood with me while we waited.\n\nWhen I got home that day my Mom asked why I was so early and I told her it was because  Lorena had died. My good old Mom said...What did you do?\n\nThis was like 50 years ago. I dont think anyone thought to ask a 13 year old if they were okay after finding a dead body.",
   "created_utc": 1691361839,
   "score": 12,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv390tw",
   "message": "I worked in a hospital pharmacy and was looking for outdated meds in the NICU, while checking the refrigerator I came across a dead baby in the crisper drawer. \n\nSmall hospital with no morgue so they stored it in the fridge",
   "created_utc": 1691362717,
   "score": 11,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2xklo",
   "message": "Found a man floating in a waste water pond. He drowned trying to save his dog. The dog was still swimming half beached on a pontoon.",
   "created_utc": 1691357635,
   "score": 10,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv37l2k",
   "message": "I am a highway maintenance worker/patroller.  One afternoon this summer, an operator using a loader with a mower boom called on the radio to say he found a vehicle on the side of the road that he saw earlier and was still there, hours later.  He said he thinks he saw someone in the vehicle.\n     I was nearby and told him that I would check it out.  When I arrived, the operator was there waiting for me.  He told me there was a man slumped over in the van but the door was locked.  I grabbed a shovel to break the window but decided to try the passenger door first.  It was unlocked.  I found the man slumped over between the bucket seats.  \n     I shouted and shook him to see if he was passed out.  He was not.  He was unresponsive. As I checked for a pulse, I found his face was purple and that he was stiff.  I found no pulse. As I lifted his head, bile spilled from his mouth.  I called the traffic room and informed them of the mans condition. \n   We then waited for emergency services.  \n    The man had been able to pull his van to the shoulder and put it into park.  Thus avoiding any damage or injury to anybody else.  Rest in peace sir and good job.",
   "created_utc": 1691362069,
   "score": 9,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv3vb98",
   "message": "I was 14 at the time. Lived with my mother, I woke up at 9am, went to my bathroom and my mother was on the floor. I called ambulance and performed CPR, when I found her, she was face down so I had to roll her on to her back. The worse part was, she was an alcoholic, so I was used to finding her asleep in random places… this particular morning I was poking her telling her I was late for school and she needs to wake up, I then made her a coffee and kept shouting at her to wake up and have her coffee,she obviously didn’t. She died due to alcohol poisoning.",
   "created_utc": 1691373160,
   "score": 9,
   "submission_id": "15jv6l0"
  }
 ]
}