{
 "submission_id": "15jvgfn",
 "title": "What are your views on prostitution?",
 "selftext": "",
 "created_utc": 1691343415,
 "permalink": "/r/AskReddit/comments/15jvgfn/what_are_your_views_on_prostitution/",
 "score": 45,
 "url": "https://www.reddit.com/r/AskReddit/comments/15jvgfn/what_are_your_views_on_prostitution/",
 "comments": [
  {
   "comment_id": "jv1yu0f",
   "message": "Needs to be legal and regulated.  It’s going to happen anyway, may as well keep every party safe.",
   "created_utc": 1691343455,
   "score": 22,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv24w7o",
   "message": "As long as it's consensual and they aren't trafficked it's fine",
   "created_utc": 1691345898,
   "score": 110,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv297js",
   "message": "Just laughing that I had to sort by controversial to see both sides.",
   "created_utc": 1691347643,
   "score": 39,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv23nid",
   "message": "Kyle, every boy pays for kisses. Do you know what I am saying? If you got a girl and she kisses you, sooner or later you're paying for it. You gotta take her out to lunch, take her to a movie, and then spend time listening to all her stupid problems. Look, look at Stan right there. He's got to sit there and listen to all her stupid motherf___ing problems 'cause she kisses him. If you ask me, that's a lot more than the $5 my company charges.",
   "created_utc": 1691345394,
   "score": 196,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2ea45",
   "message": "Legalise it, tax it, protect the workers",
   "created_utc": 1691349715,
   "score": 64,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv224cx",
   "message": "I earned £250.50 from prostitution in one weekend. My friend asked me who I got the 50 pence from. I said “All of them.”",
   "created_utc": 1691344775,
   "score": 32,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv254us",
   "message": "biggest issue usually from my experience is, that alot of girls have been trafficked, trapped, tricked in one way or another into prostitution.\n\nother then that, it should be legal, girls should have same law protection like others.\n\nreality is/was, its considered dirty, noone wants to deal with it, and it also brings usually alot of psychos out of their holes (from what the girls told me, i worked in a night bar and had different clients).",
   "created_utc": 1691345994,
   "score": 193,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2bg1e",
   "message": "The women are 95% miserable. A special 5% stand out and really enjoy their line of work.",
   "created_utc": 1691348556,
   "score": 156,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv207oj",
   "message": "It really needs to be legal so it can be regulated. The way they do it Holland seems healthy. Most other places there are waaaay to many women who are in serious trouble with pimps and human trafficing, which puts a whole new ethical dilemma on the matter.",
   "created_utc": 1691344008,
   "score": 117,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv1yy88",
   "message": "It should be legal and unionized.",
   "created_utc": 1691343502,
   "score": 48,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv27b4x",
   "message": "Legalize now and listen to the needs of those who are sex workers. Make it as safe as possible for them. Moralism is not helping.",
   "created_utc": 1691346877,
   "score": 60,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2c2f6",
   "message": "Not for me\nI feel terrible for the kids that get forced into it",
   "created_utc": 1691348811,
   "score": 27,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv282eo",
   "message": "A wicked business that pollutes the people who are involved in it and destroys the quality of life for sex workers.",
   "created_utc": 1691347184,
   "score": 70,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2ejpy",
   "message": "nice try, officer",
   "created_utc": 1691349825,
   "score": 12,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv273k5",
   "message": "Legalize it.\n\nIt's not my thing, but keeping it illegal, for moral reasons, is stupid.\n\nThe idea about morality was that a woman shouldn't do it.  Today, more than ever, women are \"giving it away\" from the age of 13 on up.  Marriage is no longer sacred or even between two people.  Morally, prostitution is mild compared to many things today.  Politicians should be illegal compared to prostitutes.  They both sell things.  Sex is just more acceptable.\n\nProstitution would allow people to make money.  Given how hard times are, this is something that could help many people out, if they are the type.  \n\nRegulate it, with set fees, medical benefits, protection from violence, and acceptable standards and let it be.  It would reduce crime, at the very least. It would also help control STDs/STIs.  \n\nThe government could tax it, like everything else, so they make money off of it.  Right now, they make money off of fines and incarcerate.",
   "created_utc": 1691346791,
   "score": 20,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2gzjh",
   "message": "In theory transactions between two consenting adults isn't anybody else's business.  In reality, there's a lot of human trafficking associated with that industry.   Then again when the government simply outlaws something they ceed control to criminals.",
   "created_utc": 1691350841,
   "score": 44,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2d9gs",
   "message": "“It should be legal” doesn’t take into account that the vast majority of prostitutes in the world are trafficked, abducted, molested, sold as sex slaves against their will… \n\nMoreover, this “industry” is particularly violent towards women (for clients and hustlers). The violence of the encounters can leave permanent damages to the women (ripped vaginas and anuses, infections, STDs…).\n\nFinally, prostitution conveys the concept that you can buy consent. That you can purchase women’s body. It contributes to the world considering women as objects that can be sold.\n\nSo when you say “offer and demand”, the main issue is that the demand is soooo strong, women are forced everywhere in the world for sex… and don’t even collect the majority of the income generated. \n\nFor the few consenting prostitutes: please help yourself, you should be way better protected by institutions. Never should you be fine, imo.",
   "created_utc": 1691349301,
   "score": 60,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv28k8j",
   "message": "On a paper level. It shouldn’t be outlawed. As two consenting adults should make that choice. But legally allowing sex work doesn’t often reduce sex trafficking. And in cases like Amsterdam many sex workers struggle to get paid adequately as people go to take pictures for tourism, rather than [pay for their services](https://www.bbc.com/news/world-europe-46919294.amp).\n\nAnd that’s not taking into account sex workers are more likely to be victims of violence. So my opinion is I don’t really know what’s the best path forward",
   "created_utc": 1691347383,
   "score": 38,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2ft4t",
   "message": "too expensive",
   "created_utc": 1691350350,
   "score": 8,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv27pse",
   "message": "It shouldn't be illegal and we certainly shouldn't shame sex workers but I also think it's important to consider the broader socio-economic context in which sex work operates. \n\nWould people resort to prostitution if all their basic needs were met and if our society didn't operate under a capitalist paradigm? What if everyone had access to quality education, decent work, affordable housing, comprehensive healthcare, and sufficient social security? Would people still choose sex work? \n\nThis isn't to say that everyone in sex work is there because they have no other choice - some certainly do choose this profession, and their choice should be respected. However, it's an unavoidable fact that economic necessity is a major factor that drives many people into this line of work. The solution isn't to criminalize or stigmatize these individuals but to address the underlying socio-economic inequalities that limit their options.",
   "created_utc": 1691347042,
   "score": 16,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2eaa3",
   "message": "Doesn’t affect me. Not my body. None of my business.",
   "created_utc": 1691349716,
   "score": 8,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2fg2t",
   "message": "Dont date them",
   "created_utc": 1691350197,
   "score": 5,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2br2s",
   "message": "It's a service, it's a job, and it should be legal and regulated.",
   "created_utc": 1691348683,
   "score": 11,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2attb",
   "message": "We still don't have a working system anywhere in the world. Even the places that have it legal and regulated have a lot of work to do to make it even mildly oké. \n\n\nLook at the Netherlands,  legal and regulated, but also one of the 5 countries in the world with the most human trafficking. \n\n\n[netherlands among worst nations human trafficking](https://nltimes.nl/2022/10/18/netherlands-among-worst-nations-human-trafficking-number-reports-declining)\n\n\nSo for me, against it because there is still no right way for it.",
   "created_utc": 1691348302,
   "score": 16,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv1zevw",
   "message": "They should give out frequent rider cards",
   "created_utc": 1691343690,
   "score": 15,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2bqb8",
   "message": "I don't have strong opinions on whether or not it should be legalised/regulated, I just don't want it being advertised like fast food or household cleaning products for your children or your nan to see, it should be kept on the down-low IMO.",
   "created_utc": 1691348674,
   "score": 5,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv249vn",
   "message": "First, I don't buy into the 'sex work is work' premise.  It's clearly some different category of work, and not just the, \"go get a job, you lazy bum!\" thing your parents mean when they tell you that.\n\nThat being said, I suppose if people are going to do it, they should at least be protected or be able to live off the proceeds of it.",
   "created_utc": 1691345647,
   "score": 29,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2bhbu",
   "message": "It's exploitative and harmful, and people who argue otherwise are usually people that want to have sex with prostitutes and pretend the prostitutes are \"consenting.\"\n\nIt's disgusting and shameful.",
   "created_utc": 1691348571,
   "score": 83,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2dx0e",
   "message": "\"Selling is legal. Fucking is legal. Why isn't selling fucking legal?\" \n\nGeorge Carlin had it right.",
   "created_utc": 1691349566,
   "score": 16,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv222qd",
   "message": "Needs to be legalized and regulated.",
   "created_utc": 1691344757,
   "score": 10,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv28a4t",
   "message": "Making it legal will only make it more accepted and make the black market even bigger.\n\nSaying legalize it always comes from people who don't realize how bad sex trafficking is. How prostitution and the positive portrayal of it plays a huge part in it's growth.\n\nThe literal example I use is Orlando. Everyone goes there to the happiest place on earth and having a great time. Meanwhile in the hotel they are staying in and the road they drive down and allot of the hotels they drive past are girls that had been kidnapped and forced into prostitution. Girls get funneled throughout that city constantly. Some being shipped out from there to other countries, islands. Happens all over the country, moreso in Orlando than others.\n\nGirls that everyday get left behind and left wondering where they are, how they got their, and how long they have been gone. Most places have no resources for these girls either.\n\nLegalization will not help this. Tell yourself whatever lies you need to. \n\nNo drug dealers are losing money after drug legalization, they are making more money. It's easier to not get caught.",
   "created_utc": 1691347270,
   "score": 59,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2hq93",
   "message": "Just be careful and responsible.",
   "created_utc": 1691351145,
   "score": 3,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2hrv9",
   "message": "I don’t care as long as there’s no exploitation or abuse and clear contracts about what a sex worker is willing to do.",
   "created_utc": 1691351163,
   "score": 8,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2kh9e",
   "message": "popping in to remind folks that women AND men can be sex workers",
   "created_utc": 1691352263,
   "score": 6,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2kleg",
   "message": "Legal as long as not exploited. Competant adults should be allowed to do what they want with their bodies. Plus it's just sex.",
   "created_utc": 1691352309,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2kloy",
   "message": "Can´t be safe no matter how regulated",
   "created_utc": 1691352312,
   "score": 9,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2klpm",
   "message": "I’m PROstitution.",
   "created_utc": 1691352312,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2kq6i",
   "message": "I dont use it, but i totally understand it. Totally would sell my tits on onlyfans... Except im a fat guy 😂",
   "created_utc": 1691352364,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2krng",
   "message": "they need unions badly",
   "created_utc": 1691352381,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2kz3i",
   "message": "Oldest profession in the book - regulate it and tax it",
   "created_utc": 1691352464,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2mpnm",
   "message": "Construction workers - and other physical laborers sell there body for money too - often with worse or as bad consequences as sex workers. The problem is sex workers don’t have the same support, respect, government regulations (labor laws) as other physical laborers.",
   "created_utc": 1691353174,
   "score": 37,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2o09d",
   "message": "It’s gonna happen on way or another. The boomers need to get over it, make it legal and regulate it, and shut the hell up about it.",
   "created_utc": 1691353702,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv23bh7",
   "message": "Where I am it's legal and it should be like that everywhere.\nIt should be regulated so there can be less \"forced\" ones and everything be more secure for who choose that work.",
   "created_utc": 1691345258,
   "score": 8,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv27gk9",
   "message": "I don't care about it",
   "created_utc": 1691346937,
   "score": 4,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv25834",
   "message": "Legalize it and regulate it. People are going to do it regardless, but making it safe, controlled, and regulated increases safety for all parties and eliminates some common areas of risk and abuse.",
   "created_utc": 1691346031,
   "score": 5,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2ienl",
   "message": "Prostitution has been around for centuries, it’s not going to fade away but at least treat it like it’s a real job. \n\nLegalize it, have workers regularly tested, give them health insurance, etc.",
   "created_utc": 1691351418,
   "score": 4,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2apr5",
   "message": "Should be criminalised from the client side. I feel many people these days recognise that the need for money to survive allows for exploitation in all sorts of labour, I just can't support the idea of extending that exploitation into sex work.",
   "created_utc": 1691348256,
   "score": 5,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv27dj0",
   "message": "It should have far more respect than it has as a profession.",
   "created_utc": 1691346903,
   "score": 6,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv26ibp",
   "message": "It costs too much.",
   "created_utc": 1691346550,
   "score": 6,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2bnyd",
   "message": "Please dont",
   "created_utc": 1691348647,
   "score": 5,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2agwg",
   "message": "As George Carlin said \"Why is it illegal to sell something that's perfectly legal to give away?\"",
   "created_utc": 1691348153,
   "score": 11,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2fwkn",
   "message": "Short term career, long term stds",
   "created_utc": 1691350391,
   "score": 3,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv20hzu",
   "message": "Don't care as long as theres concent",
   "created_utc": 1691344123,
   "score": 6,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2497f",
   "message": "I think ppl in the prostitution industry and porn industry are free to do what they do but if ur doing any of that dont have kids . Just forget about it and be  responsible that you might ltrrly end the kids life the moment he is born",
   "created_utc": 1691345639,
   "score": 16,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv25vjm",
   "message": "Typically from the bottom. I don’t like to work hard when I’m paying.",
   "created_utc": 1691346294,
   "score": 3,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2alss",
   "message": "Legalize, unionize, protect it by law.\n\nI give my body to some office job, others give theirs to many hours of hard physical labor, others still to serve the health of the nation, keep our world clean, save us in any number of different ways. Sex workers give their bodies to serve the needs of others, too.\n\nAll work is hard work, all work is dignified, all deserves equal protection.",
   "created_utc": 1691348210,
   "score": 14,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2bdo1",
   "message": "Sex work is real work. All the stuff about how legalizing it is dangerous is BS. It’s dangerous now. Legalizing it would allow safe establishments to be set up, which would protect the workers far better than they are now",
   "created_utc": 1691348529,
   "score": 14,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv28uuj",
   "message": "Not interested.",
   "created_utc": 1691347501,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv28xrd",
   "message": "My view is I’m disappointed that the opposite of prostitution isn’t constitution like should be.",
   "created_utc": 1691347534,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2malt",
   "message": "The stigma should remain",
   "created_utc": 1691353003,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv28q1i",
   "message": "I tried it a few times, but couldn’t find any customers.",
   "created_utc": 1691347448,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2bkby",
   "message": "Gonna get downvoted by the reddit hive mind, but the risks outweigh the rewards. We'll 100% see a rise in STDs and unwanted pregnancies. And it's not like rapes would decrease. 80% of rapes are committed by someone the victim knows. It's not like it's all just incels raping the first person that comes along that they can get their hands on.",
   "created_utc": 1691348606,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2e59o",
   "message": "Usually I view it from the paying side.",
   "created_utc": 1691349660,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2f826",
   "message": "#haram.",
   "created_utc": 1691350104,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2fbum",
   "message": "As a man, I would advise other men to avoid it. It’s a slippery slope",
   "created_utc": 1691350148,
   "score": 5,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2fcju",
   "message": "Eh… fuck 'em.",
   "created_utc": 1691350157,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2fuvc",
   "message": "Should be illegal everywhere. Sex shouldn’t be bought and sold.",
   "created_utc": 1691350371,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2gzvt",
   "message": "It should be legalized, regulated and taxed. In addition, the women should have to undergo weekly medical exams, and the men must wear a condom. That way, you protect the women.\n\nIt's going to happen whether it's legalized or not; this way you put the pimps out of business.",
   "created_utc": 1691350845,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2hyfw",
   "message": "Legalize it and regulate",
   "created_utc": 1691351237,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2i1c9",
   "message": "Should be legal, should be regulated and should be responsibly facilitated.",
   "created_utc": 1691351269,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2988l",
   "message": "Usually from behind",
   "created_utc": 1691347650,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2eba3",
   "message": "Everyone doing a job ever is “selling their body” so 🤷🏻‍♀️",
   "created_utc": 1691349728,
   "score": 35,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv27xju",
   "message": "Too expensive.",
   "created_utc": 1691347129,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2auhs",
   "message": "Legalize and unionize.",
   "created_utc": 1691348310,
   "score": 3,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv20ttd",
   "message": "It’s a fun job but better to do it on the side. The money is good but the clients are sometimes too demanding. Some days you might work long nights so it’s a bit exhausting but you do get to build a strong portfolio. I personally wouldn’t commit my life to a career in prostitution albeit it’s a very respectful endeavor. Good luck",
   "created_utc": 1691344251,
   "score": 0,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv262qk",
   "message": "From behind, usually.",
   "created_utc": 1691346374,
   "score": 255,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv24nvq",
   "message": "It should be illegal🤷",
   "created_utc": 1691345805,
   "score": 248,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv28tle",
   "message": "I wonder why someone would do that?",
   "created_utc": 1691347487,
   "score": 0,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2cntw",
   "message": "Should be legal.",
   "created_utc": 1691349055,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv260w5",
   "message": "Should be legal and safe, at the same time I get sad that a lot of women are almost forced to go into that field even if they don't want to. All power to willing and happy sex workers if they are legit ok with it then hell ya. But I feel like the world has failed alot of women into having sex work as their only option",
   "created_utc": 1691346354,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv21w3v",
   "message": "It isn't the right role for me",
   "created_utc": 1691344681,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv23fc3",
   "message": "God bless them one and all 🙏",
   "created_utc": 1691345302,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv29lub",
   "message": "For the people who choose to do this line of work its fine, why not? A job is job.\nFor the people who are forced in to this it’s completely the opposite. Not okay.",
   "created_utc": 1691347804,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv29ocq",
   "message": "I don't give a fuck",
   "created_utc": 1691347831,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv29z0j",
   "message": "Your body your choice. It should be legal and taxed.",
   "created_utc": 1691347950,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2jsqr",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2h5vh",
   "message": "I didn't want to respond initially because it's a complicated topic. However, my issuee is less prostitution itself but lucrative services like modeling, Only Fans, pornography, etc. Young girls and boys learn that it can be enough to have a body for sell. That's more my concern. \n\nProstitutes appear everywhere as they get pressured, lured and blinded to get into the system. Those who do it voluntarily are probably rare but they should dominate the market. The customers... well, they all have problems too. Some men (who are main customers) don't have the chance to get a serious date and they feel lonely. I understand that as well. The whole culture is playing a role.",
   "created_utc": 1691350915,
   "score": 13,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2ig07",
   "message": "I don’t think anyone should aspire to do it, but they’re deserving of respect. \nI just hope they’re being safe always, whatever they do.",
   "created_utc": 1691351434,
   "score": 3,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2u5j4",
   "message": "What consenting adults do together isn’t anyone else’s, especially the governments, business.",
   "created_utc": 1691356198,
   "score": 3,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2jsgk",
   "message": "Sex work is work. Labor laws need to apply.",
   "created_utc": 1691351982,
   "score": 4,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2dktj",
   "message": "For those who think regulation and legalizing would contribute to safer ways - you are wrong.\n\nYou do not want regulation, laws and government in such an industry. \n\nNor would it diminish human trafficking (as they are not in the same ballpark).",
   "created_utc": 1691349429,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2sg3e",
   "message": "It’d be a lot safer if legal.",
   "created_utc": 1691355506,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2tnex",
   "message": "Feel sympathy for them \n\nBut hate the working environment",
   "created_utc": 1691355992,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2tq9e",
   "message": "Its not for me, personally. But I believe all sex workers deserve respect, and they should be properly protected and respected",
   "created_utc": 1691356024,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2tsxm",
   "message": "In short: hoes up, pimps down.\n\nI’m totally okay with buying and selling of sexual services as long as everyone involved is consenting. However, I’m against trafficking, again because consent. \n\nIt’s real simple. No one except you should be making money on your back.",
   "created_utc": 1691356054,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2zeta",
   "message": "Consensual and the non human trafficking kind? \nIts alright. It really badly needs regulation tho. A way where the prostitutes wont have to risk their safety everyday. \nI just wish their day to day life was safer than what it is.",
   "created_utc": 1691358430,
   "score": 3,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2zxpy",
   "message": "No different than any other labour.\n\nConstruction, farm work, prostitution, whatever; they're all just trading their body for money.\n\nThere is literally no difference unless you believe that sex is somehow inherently immoral, in which case, I have bad news about your parents.",
   "created_utc": 1691358656,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv30j07",
   "message": "Why does it matter. Let people market their bodies.",
   "created_utc": 1691358911,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv310x9",
   "message": "Legalize, regulate, tax and protect. \n\nI'm regularly getting metaphorically fucked in the ass by my boss, but it is legal, regulated, taxed and comes with some protections.\n\nThe same rules should definitely apply when it happens literally.",
   "created_utc": 1691359127,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv31575",
   "message": "20 bucks is 20 bucks",
   "created_utc": 1691359178,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv3162k",
   "message": "Can you name something else that going pro is a social woe aside from politicians?\n\nI'm not interested but I don't think it should be illegal.",
   "created_utc": 1691359188,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv318y6",
   "message": "Under utilized.  I think one reason there's so much abuse, both child sex abuse and domestic violence, not to mention clergy of all kinds being in the news, is because many men are severely sexually frustrated.  A legal outlet for that could save a lot of problems.",
   "created_utc": 1691359222,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv31bw0",
   "message": "If it wasn’t prohibited, the tax revenue could help fund hospitals and schools. The individuals whom are involved with the trade could contribute to their retirement savings. Also, the stress relief that the healthcare system would receive if the prohibition was ended would be tremendous because the trade would be made safer for users and workers whom could partake in the trade stress free knowing individuals involved have been tested for various diseases. Not to mention how many individuals would not be subjected to the title of “criminal” for partaking in the world’s oldest trade.",
   "created_utc": 1691359258,
   "score": 3,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv31ozr",
   "message": "Should be legal but actively discouraged",
   "created_utc": 1691359416,
   "score": 3,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv31q94",
   "message": "Make it legal, regulated and taxable to keep sex workers safer. Decriminalising it would hopefully mean less abuse and murder.",
   "created_utc": 1691359431,
   "score": 3,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv31urn",
   "message": "It should be legal, safe, and taxed.",
   "created_utc": 1691359485,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv33izb",
   "message": "For it - so long as it’s regulated, consensual, and clean.\n\nMy cloud in the sky dream job is to own a brothel. Like a high class one… membership only. I want the main floor men, top floor women, and the basement anything and everything goes. Still need a name…",
   "created_utc": 1691360231,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv33vg3",
   "message": "full regulation\n\nlots of places allow it but ban brothels, i would say instead make it only legal in centrally licensed brothels that have medical, police and social services present to be allowed to operate\n\nalso add in licensing requirements to ensure protitutes are tested regularly, legal to work and know what to do if somthing isnt right",
   "created_utc": 1691360387,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv34mph",
   "message": "it's a job just as legitimate as any that deserves equal respect as any",
   "created_utc": 1691360726,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv34xhf",
   "message": "If it’s between consenting adults, and nobody is lured into trafficking or any other form of abuse. No harm done in legalizing it",
   "created_utc": 1691360860,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv351i1",
   "message": "The working girls are cool. The pimps? Fuck no.",
   "created_utc": 1691360911,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv35355",
   "message": "Legalize it, have them get a medical card and tax it.",
   "created_utc": 1691360932,
   "score": 6,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv354de",
   "message": "Your body your choice",
   "created_utc": 1691360948,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2d0ux",
   "message": "It’s sad we live in a society where women or men feel they have to give up their body to strangers just to survive. Wake up, this country doesn’t care about you.",
   "created_utc": 1691349202,
   "score": 4,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2d9hq",
   "message": "The biggest issue is that sex work is linked heavily to human trafficking all over the world. If there were a 100% guarantee that no sex worker was being in any way coerced, and were absolutely free to walk away at any time,  I'd have no objections or concerns whatsoever, though some regulation would be advisable.\n\nAn independent adult should be able to choose.",
   "created_utc": 1691349301,
   "score": 3,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2eoq2",
   "message": "As long as you're using protection, not spreading STDs, and is consensual, I'm good. And there's no trafficking involved.",
   "created_utc": 1691349882,
   "score": 3,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv2u3ea",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv36b2l",
   "message": "Legalization and normalization would make it safer for the workers who are going to do it regardless, and would make the sex staved sect of the population much less aggressive.",
   "created_utc": 1691361492,
   "score": 2,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv3hoal",
   "message": "4k ultra HD",
   "created_utc": 1691366679,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv3ihpl",
   "message": "If I ever get to the point I have to pay for it, just shoot me.",
   "created_utc": 1691367055,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv3iwop",
   "message": "\"you do you, bro\"",
   "created_utc": 1691367247,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv3jpgz",
   "message": "\"Selling is legal. Fucking is legal. So why isn't selling fucking legal?\"\n- George Carlin",
   "created_utc": 1691367612,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv3jqfv",
   "message": "This is the 6th post I've seen in the past 30 minutes talking about prostitution and sex work.",
   "created_utc": 1691367624,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv3kh2n",
   "message": "Should be legalized and allow brothels to be opened. Now idk if brothel is the right word for it but I mean a place that’s well regulated and allows the “purchase” of a man or woman for a specified period of time.\n\nThe idea would be that each worker sets their own price within a price range approved by the owner and the owner would take a certain cut of each transaction. The owner in turn would be responsible for providing healthcare and security for the workplace as well as having each person do regular std testing and allow each worker the right to refuse any customer for any reason.\n\nThe owner should be forced to have their workers report to a government facility either monthly or quarterly to tell a government worker about conditions and how they feel about the job. I feel this would eliminate the ability to abuse sex workers and get away with it.\n\nThe owners should also either partner with or operate a daycare for their workers. They’re bound to have kids or some of them anyway and we shouldn’t make them miss work because daycare is expensive.\n\nObviously contraceptives will be used and papers will be signed by all involved that STDs and pregnancy may happen and they will take responsibility for any children that may be conceived. Dna testing will be required of course. Contraceptives will be provided by the owner in whatever form the workers choose, a list will be compiled by the owner of approved contraceptives.\n\nStd positive workers will be employed to allow those who also have that std to still partake and will also reduce the discrimination around this who have them.\n\nI want this because there’s far too many men who either can’t get a woman or feel women aren’t worth the time and I feel this will help to alleviate those thoughts and might reduce the amount of people who hate the modern dating culture. I also hope it eliminates the women online who try to get men to buy them and instead allows them to work in safe conditions to make money.",
   "created_utc": 1691367971,
   "score": 1,
   "submission_id": "15jvgfn"
  },
  {
   "comment_id": "jv3itn9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15jvgfn"
  }
 ]
}