{
 "submission_id": "15jv6l0",
 "title": "Anyone ever find a dead body unintentionally? What’s the story?",
 "selftext": "",
 "created_utc": 1691342763,
 "permalink": "/r/AskReddit/comments/15jv6l0/anyone_ever_find_a_dead_body_unintentionally/",
 "score": 91,
 "url": "https://www.reddit.com/r/AskReddit/comments/15jv6l0/anyone_ever_find_a_dead_body_unintentionally/",
 "comments": [
  {
   "comment_id": "jv27ut0",
   "message": "Walked out back one morning to let my dogs out. It was early, so it was pretty cold out. I look over and I see my neighbor sitting in a lawn chair in his yard. I get closer thinking he might have fallen asleep or something the night before and it was just too cold to be chilling there. As I got close, I see he isnt moving and then I see a puddle of blood next to him. Then I see the shotgun. He shot himself in the chest. He was an older guy, former cop, who lost his wife like a year prior. He may have gotten some bad medical news himself shortly before he did it too. It was surreal though.",
   "created_utc": 1691347098,
   "score": 151,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv1xbgl",
   "message": "I didn't but a coworker did.\n\nHe was inspecting a county ditch through the woods and there was a body on it.\n\nCalled the sheriff and left work for the day.",
   "created_utc": 1691342854,
   "score": 69,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv20dqq",
   "message": "Leaving my house for quick errand briefly noticed an elderly lady parked on side of the road. When I returned, her car was still in same location and as I looked closer she appeared unconscious so I stopped but her doors were locked so dialed 911, It was determined she had passed away.  This occurred when living on Lake Lanier in North Georgia.",
   "created_utc": 1691344076,
   "score": 69,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv24sbj",
   "message": "My brother did / went for a walk in the local park to clear his head - found a guy hanging from a tree. He said it was obvious the guy was quite dead and beyond help when he called the emergency services.  This was in a uk suburb near a school not exactly an out of the way location!",
   "created_utc": 1691345855,
   "score": 47,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv25vg7",
   "message": "Had a paper round when l was a kid. Part of my round was delivering to a retirement block. On this day l stepped out of the lift and as l approached the door to the corridor l saw a trail of blood running underneath it. As l opened the door an old lady was laid head first down on the floor with blood pouring from her head, her front door open. Tried to help her but she was clearly gone. I chucked the paper over her body and into her flat (?) and ran down to the warden's flat. \n40+ years later, remember it as clear as day. Got offered counselling and a trip to McDonald's from the police.",
   "created_utc": 1691346293,
   "score": 44,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ewk3",
   "message": "Yes. When I was 11 I woke up and was looking for my mom. Couldn't find her anywhere. Walked to her side of the bed and she was dead on the floor\n\nThat was in 92. She was 27. I'm 43 now. My hardest birthday was 28. I felt so young still and my life was just picking up and just imagine all the stuff she missed",
   "created_utc": 1691349972,
   "score": 43,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv1x8ez",
   "message": "Yep, but I handled it and hid both the bodies better",
   "created_utc": 1691342821,
   "score": 82,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv27vfd",
   "message": "I drove past an elderly lady sat on her walker at the side of the road, half an hour later driving back again she was still there in the middle of winter. \n\nPulled over and went to check on her, just as she took her last breath. Someone else stopped and we did cpr until paramedics arrived so I guess technically she wasn't a dead body until they pronounced her in the back of the ambulance?",
   "created_utc": 1691347105,
   "score": 27,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2f3an",
   "message": "I was at a family reunion forever ago. On my 13th birthday Papaw and I wake up early to go fishing on the big lake right next to the campsite. We get in my uncles bass boat and start making our way out to find a spot. eventually come across a jet ski, with the front end and handle bars all fucked up, floating amongst some rocks. I will never forget it, we both immediately looked at each other, and we knew what we were going to find. We didn't say a word, just took the boat over to the rocks and sure enough, there's a guy face down in the water in the rocks, obviously dead. We called the cops and waited so they could find him easier. They showed up maybe 20 minutes later and pulled him out, whole front of his head was just fucked. Apparently he was drunk and riding his jet ski fast as hell the night before and smashed into the rocks head on. Poor dude, think he was in his 40's if I remember right. We fished all morning and didn't say a fucking thing. Didn't catch shit either lmao.",
   "created_utc": 1691350049,
   "score": 21,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2apw2",
   "message": "This was in the neighborhood of 25 years ago.\n\nWent for a day hike a couple of hours away from my apartment. I was on a rarely used, unofficial trail that connects two trail systems and saw a patch of color that didn't look right in the undergrowth a few yards away. I walked over to check it out and quickly realized I was looking at a sweater. Got a few steps closer and turned right the fuck around when I saw a skeletal looking hand sticking out of it. I was involved in a lot of not particularly legal shit back then, so I made an anonymous call to the state police from a rest stop payphone on my way home.\n\nA friend of mine had family ties to law enforcement in the area, so I asked him if he could find anything out for me. Turned out to be a woman who was murdered by her husband shortly after they moved to the area.",
   "created_utc": 1691348257,
   "score": 20,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv1xbiu",
   "message": "How do you find one intentionally?",
   "created_utc": 1691342855,
   "score": 83,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv1xqou",
   "message": "Some friends of mine heard a rumor there was a body just past the train bridge that ran through the woods not quite near our houses.  Almost died crossing that fucking bridge but sure enough we found it. 2/10 would not recommend",
   "created_utc": 1691343022,
   "score": 101,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv20yjv",
   "message": "*sigh* let's read these comments then",
   "created_utc": 1691344303,
   "score": 44,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv26f4z",
   "message": "Popular forest in my region, me and a few friends cut through it walking home after school. One of them scream, followed by another scream, followed by my frozen shock. Poor dude hung himself, the flies and the noises they made still itch my brain",
   "created_utc": 1691346515,
   "score": 13,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2d8t1",
   "message": "This just happend three days ago: me and my friends were on vacation in Germany, We went to a really big castle on a hill, surrounded by a wall. Behind the Wall everyrhing was 50 meters lower. We were walking around the castle when a friend of mine stopped and asked me if I could come take a look because he saw something odd. We looked down and we saw the body of a woman. At first I thought she was just unwell or sleeping maybe but looking better you could see her hips were placed weird and her neck as well. After a while it was clear the person has passed away. Since it was 50 meter below us we couldn't reach her. Some people called the police and then we had to go. \n\nThe day after we checked the news and saw an article about a dead woman that was found near the castle. They are investigating if it was suicide or something else. We don't really have a clue what happend, if she fell from the wall or that she was walking below and something fell on her. To be honest, the view of seeing someone dead is really weird. Some of my friends were really disturbed by it, which I understand. The rest of the day was not so much fun.",
   "created_utc": 1691349293,
   "score": 11,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv29s3k",
   "message": "As a kid I walked down my driveway to walk to town, saw my elderly neighbour facedown in his hedge at the bottom of his drive. He had been gardening and had a heart attack. I pulled him out, he was completely stiff, clearly had been dead for a while. Fucked me up as a kid as I knew him fairly well.",
   "created_utc": 1691347872,
   "score": 9,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2haa0",
   "message": "A long time ago I had a job as a deckhand for a tugboat operation on the Mississippi. Basically the job entailed guiding a tugboat to break down all of the barges that they sandwich together on the way down the river and putting them where the ocean going tugs can get them on the next stage of their delivery. \n\nAnyway it was late at night and we were breaking barges apart when we were assaulted with a nasty smell. I got the tugboat captain to move his searchlight down and sure enough there was a dead body that had been sandwiched in between two barges. \n\nIt was in pretty bad shape, so I grabbed a gaff pole and hooked it while we waited on the Coast Guard to arrive. Physically loading the body was an ordeal that I won't go into, but you can imagine what condition a body would be in after it had been submerged for a couple of weeks.\n\nMuch later we found out it was a bridge suicide from St. Louis. The body must have drifted down and got caught in a barge tow and worked it's way eventually down to New Orleans.",
   "created_utc": 1691350965,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv21l2x",
   "message": "No, but for a brief moment I thought I might be in that situation...\n\nWhen my son was 11 or 12 we were at a park next to some woods. He was in the wooded area and comes running out \"MOM! There's a SKELETON back here!\"\n\nThankfully just a dead coyote.",
   "created_utc": 1691344555,
   "score": 29,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv23sa6",
   "message": "I worked as a medical assistant and called a patient back to the room and he didn’t answer me so I went up to him to wake him up because I thought he fell asleep. He was gray and tongue between his teeth covered in sweat. CPR and 911 was called but he was dead.",
   "created_utc": 1691345448,
   "score": 19,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2eovd",
   "message": "A buddy of mine skipped school one day to go fishing. He thought his fishing line was caught on debris, but as he reeled in a human hand surfaced. He called the cops and they yelled at him for skipping school.",
   "created_utc": 1691349884,
   "score": 14,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2eanx",
   "message": "I drove my daughter up a side road on the outskirts of town to take her to her part-time job. Weather was sunny and clear. Dropped her off and not two minutes later going back home all traffic was now stopped. There were only 3 cars stopped in front of me and I could clearly see a handsome blond boy, early 20s, lying across the road next to his motorcycle lying on the ground. He was just eerily still and you could tell he wasn't waking up. I didn't see a helmet. News later said he was hit by a truck - he must have been just seconds behind us when we were on the way to my daughter's work. He was pronounced dead at the scene.\n\nI don't know him but I think about him sometimes. Such a shame to die so young. There's a roadside shrine to him now that we see everytime we drive to my daughter's work. It's sad.",
   "created_utc": 1691349721,
   "score": 7,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv24ubr",
   "message": "A friend of my husband (my husband was riding shot gun in their work truck) jumped out and ran over to see if a man was dead after he drove into oncoming traffic in his semi. He didn't hit anyone but hit a rock face after going off the road... ..  if anyone knows what a body looks like when being thrown into a windshield and then being crushed, you understand.\n\nMy husband says his friend has PTSD from it, the guy switched careers to one where he didn't have to drive anywhere.",
   "created_utc": 1691345878,
   "score": 12,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2i2d5",
   "message": "We found a coffin with parts of skeleton and a piece of clothing in it. Not quite the same, but creepy anyway.\n\nI was about 10 or 11, at our school we had multiple sports fields. The rugby pitches in particular though we're at the top of a hill we had to climb steps to reach. This meant at break times, we weren't allowed up there because teachers couldn't see you. So of course, lots of kids went that way. It was easy to get out of school grounds and pop to the chip shop, or sweet shop depending on what you wanted and be back with plenty of time.\n\nOne day we'd had rain every for about a week and the field was properly water logged. We left the field our usual way, which is down a small bank, through some trees and eventually back onto the pathway that led to the village shops. As we went down the bank, me and my friend slipped. I grabbed something to stop falling, and it was the edge of a coffin. The lid of which was half off, we dared ourselves to look in and there was skeletal remains and some clothing. Possibly trousers.\n\nWe were proper freaked out. We told out headmaster, said we knew we shouldn't be on the field, but wanted to practice rugby kick goals and had lost the ball in the bush. Teacher told us we were probably mistaken and calmed us down. Dont know much more of what happened after, but we couldn't use the shortcut anymore as it had caution tape around it, and the coffin was removed.\n\nI'd guess the coffin was buried a long time ago, and came out due to ground movement from all the bad weather. Later in life, I found out the top field where we played rugby used to be a church in the 30s, but it was destroyed and the school had it as part of their grounds since the 70s (I was there in 1992). So ground movement seems possible... But it was just one.",
   "created_utc": 1691351280,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv29hsa",
   "message": "Worked at a hospital, so it was kind of par for the course, but yes. Walked into a room a few times and found that they had yet to move the remains to the morgue.",
   "created_utc": 1691347760,
   "score": 5,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ehoc",
   "message": "I am also interested in the intentional stories",
   "created_utc": 1691349802,
   "score": 5,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2eswn",
   "message": "There’s a creek in my city, suitcases were thrown back there. Someone opened one, it was arms. They had been sawn off. There were more suitcases, more body parts. A whole person had been dismembered with a meat saw and stuffed in suitcases and then thrown back there.\n\nSomeone in the apartments near by overdosed on heroine. Her boyfriend panicked when she overdosed. He used to be a butcher so he chopped her up and disposed of her.\n\nHe got caught because the store near the apartment had excellent cameras and the owner reported a strange purchase right before the news dropped of the body being found. Ol boy bought 8 gallons of bleach and that’s ultimately how he got caught.",
   "created_utc": 1691349929,
   "score": 5,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2iud3",
   "message": "No, but I often wonder what it was like for the person who found my dad sitting in his truck in a parking lot, 2 or 3 days after a double pulmonary embolism. Thanks whoever you are, sorry about that experience.",
   "created_utc": 1691351595,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv292wq",
   "message": "Not me but my dad and mom. \nMom oticed a man sitting on a bench at the cemetary had not moved since the last time they walked by him. \nDad did go to him and saw that he had shoot his head away with a shotgun. \nHe called the police and did tell my mother later that evening about it.",
   "created_utc": 1691347591,
   "score": 9,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2hi18",
   "message": "My great uncle decided to commit suicide.  We came home from Church to find him, in the kitchen, his brain matter in the sink and a shotgun hole in the ceiling.\n\nBut, at work, it wasn't uncommon to find a body during the summer and fall.  People would go swimming, boating, or hunting and fall into the river.  They would often wash up on the perimeter of the site in various states.  Sometimes you could smell a floater from a distance and other times they were fresh enough not to smell.",
   "created_utc": 1691351053,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2hs0u",
   "message": "My youngest sister would babysit for the woman at the end of our block. She was a divorced woman with 2 kids. \n\nThe ex-husband hadn't heard from her for a few days and came by her house to no answer. Came to my house to see if maybe the kids were there with my sister and if she had an answer why he hadn't heard from his ex-wife.\n\nSister wasn't home but he and I went to the house. Knocked a few times, and then he just went to open the front door. It was unlocked, and her body was in the living room. She was dead, and her children were kidnapped by her then boyfriend. The Ex-husband was rightfully shocked a d terrified, immediately called the police and reported as much info as he knew. My little sister had to answer some questions about the boyfriend, help give a description vehicle type. Just basic stuff. \n\nI think they caught the boyfriend in San Antonio, if I remember. Couldn't find the article about it online",
   "created_utc": 1691351165,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2jdf0",
   "message": "My grandma. I’d just seen her the day before, painted her nails, chilled out with her, went back the next day with flowers for her birthday and she had passed. 29th August 1928 - 29th August 2013 🤍",
   "created_utc": 1691351811,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2bofs",
   "message": "Some lady jumped in front of a train with about 200 highschool and college kids ready to go to a concert on the platform. Ruined the night.",
   "created_utc": 1691348653,
   "score": 7,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2f7gq",
   "message": "I didn’t find one ,but a guy killed himself in a patch of trees trees next to the local Habachi place. No one found him for like a month or two. Bad part was you could smell his corpse and it was unmistakable what the smell was.",
   "created_utc": 1691350097,
   "score": 3,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2hkga",
   "message": "I didn't find a body, but I saw a guy die.  Car accident.  He ran a stop sign.  He was still alive when I got there but he died while the ambulance was en route.",
   "created_utc": 1691351080,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2hmc6",
   "message": "I was walking around a track and talking with my mom and I saw a homeless guy lay down next to a tree, I thought nothing of it. I walked past him 4 or 5 times then on the other end of the track I stopped for 15min talking and looking the other way at the city, it was a spring day that felt good after months of winter - when I turned around an abundance was on the other end with the crew was zipping up a body bag.",
   "created_utc": 1691351101,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2iedx",
   "message": "Playing in the woods hide and seek. I was running after my cousin and tripped and ate shit over what o thought was a rock. Turned over to get my shoe unstuck and saw it was something white and I pulled my shoe out. I got up and saw it was actually a pelvis (I didn’t know what the bone was named at the time but I knew what a bone was) and I screamed and my older cousins came running out from there spots to see me crying and trying to get away from the fuckin skeleton sitting in the dirt and we went and told my parents. We were pretty deep in the woods so one of us stayed near by it and another one of us waited ab 50 feet away but to where we could still see each other and basically made a trail of human bread crumbs to make sure we got back to the body to show the cops",
   "created_utc": 1691351415,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2jjw9",
   "message": "Yes. My son. Suicide.",
   "created_utc": 1691351885,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2jzc0",
   "message": "I was with my then girlfriend, later wife, who shared a penthouse in Boston with her brother.  We went out into the deck one Sunday morning and saw a sweater draped over the railing.  23 floors below was a guy who jumped the 25 floors.  He hit the ground so hard that his shoes exploded from the force.  Police came and interviewed us and we went in with our day.  Very sad.",
   "created_utc": 1691352060,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2cndn",
   "message": "I used to work at a quick lube in the mountains. Homeless people get drunk, pass out outside, and freeze to death every year. One morning we found a guy frozen to death on the back driveway of the shop. Apparently he had gotten into a fistfight then stumbled away drunk, he tripped over the curb and just didn’t get up.",
   "created_utc": 1691349050,
   "score": 6,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv21r3d",
   "message": "Occasionally I find one in my basement or the trunk of my car that I forgot about. Does that count?",
   "created_utc": 1691344624,
   "score": 6,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2gusn",
   "message": "Was driving at night on a very quiet road when all of a sudden there were a jam of cars and there was this dead motor biker  body with a pool of blood and it was fucking scary",
   "created_utc": 1691350787,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2heno",
   "message": "I basically walked into what was either a medical emergency or a crime scene. I got off the bus, and I saw the fire department on the corner. I can’t remember if the police were on scene yet though. As I got closer, I noticed a white sheet on the ground, with feet sticking out from under it. There wasn’t any tape around the area or anything. I’m guessing the paramedics just pronounced the person.",
   "created_utc": 1691351015,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2iai1",
   "message": "Just driving down the road in a Michigan winter, saw some headlights in a field that looked off.\n\nStopped to check it out, they were off because the suv was upside down. The driver has been ejected and it landed on her. Nothing to see but a pair of legs sticking out like the wicked witch.",
   "created_utc": 1691351371,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2j7jl",
   "message": "I went for a walk with my girlfriend along the river around 1am last summer while we were walking we came across another couple visibly distraught, as we kept walking we noticed a busy slumped over on a bench with a pill bottle on the ground, cops were there shortly after, bench was removed the next day.",
   "created_utc": 1691351745,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2jeg1",
   "message": "Went to find out who parked in my spot turned out to be a guy who gassed himself in his car. Looked like a boiled lobster.",
   "created_utc": 1691351822,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2jmkw",
   "message": "Many years ago, I was pulling out of a grocery store. At the exit from the parking lot there were 2 cars ahead of me. As each car tried to exit onto the street it would u-turn and go back the other way. When it was my time to exit, I saw why. There was glass all over the road. As I was u-turning I looked towards the road and saw a body laying in the dirt. I quickly parked my car, ran over to it and saw an elderly woman, covered in blood, not breathing, not moving. \n\nI started chest compressions. After about a minute or so I thought “ok, what do I do next?” This was in the time when CPR recommended breaths in between compressions. However, there was a lot of blood so I just kept doing compressions. Pulses never returned. After a minute or two more emergency services arrived. She was dead. I turned around to see about 6-7 people gathered looking on.\n\nTurns out my perspective was VERY tunnel vision-ed. The car she was ejected from was facing the wrong way on the street and her deceased husband was still in the car at the wheel. Supposedly there was another vehicle involved which I can’t remember at all.\n\nI went home and shook the whole time while taking my groceries in and putting them away.",
   "created_utc": 1691351916,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2k336",
   "message": "About 9 years ago, I was halfway through my maternity shoot at the very end of an abandoned pier off the Delaware River.  There were also some younger folks enjoying a party along the way. We were pretty far from them catching a great sunset. \n\nAll of a sudden we saw port authority on their boats and policy taking statements from the kids, we thought, eh, probably got busted. \n\nWe say fuck it, way too much going on and walk back to the car (obviously not part of the party, so we walked right past everyone) and I looked down on the rocks as we walked back to our car and there was dead body, washed up, bloated, and pretty gnarly. \n\nMy photographer looked at us, we looked at him, had a laugh, and he says “Circle of life, great shoot!”",
   "created_utc": 1691352103,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2kgc6",
   "message": "Canyon lands. Man had killed himself a couple of days before we found him. Had to wait around for several hours before police found us and we had to make a report.",
   "created_utc": 1691352253,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2kgx4",
   "message": "Worked at a movie theatre. It was a weekday morning, so usually pretty slow for us. Went in to clean a showing of The Hateful 8, there were only two people in the theatre. One in the very back, and one towards the front. \n\nWalk in to clean the theatre, see the guy up front. Figure he was sleeping, happens sometimes. Say a couple things to see if he’ll wake up. He does not not. Get spooked and call my manager. Manager shook him a couple of times, realized something was wrong, called the police. \n\nDude was dead.",
   "created_utc": 1691352260,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2gu0f",
   "message": "Back when I was really young there was a guy that died on the sidewalk outside our house in New Jersey. I remember going outside to wait for my dad to walk to the bus stop and thinking there was a trash bag in the way. I didn’t realize what really happened (I mean I realized it was an issue because my dad went inside to call the police but I didn’t realize it was a person) until my mother was talking about it years later as one of the reasons we moved (she was telling her friend ‘keyspam found a dead addict outside’ and I was like oh shit when??).",
   "created_utc": 1691350777,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv21wxd",
   "message": "Omd was bleeding on the side of the road in Edinbrugh and dad said it was asleep",
   "created_utc": 1691344691,
   "score": 3,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2g3vw",
   "message": "A wise man never sees a dead man",
   "created_utc": 1691350476,
   "score": 2,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2befn",
   "message": " Never unintentionally.. no",
   "created_utc": 1691348537,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2c9zi",
   "message": "[deleted]",
   "created_utc": 1691348896,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ajvc",
   "message": "I have never found a dead body, unintentionally or otherwise.",
   "created_utc": 1691348188,
   "score": 0,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv1ycji",
   "message": "Ya found a dead ant",
   "created_utc": 1691343264,
   "score": 243,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ki0h",
   "message": "As opposed to intentionally?",
   "created_utc": 1691352272,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2l8yk",
   "message": "Who finds a dead body on purpose? Except for criminal investigators or something?\n\nI intentionally went looking for my friend who went missing, unintentionally found him deceased.",
   "created_utc": 1691352576,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2lhme",
   "message": "It's the intentional dead bodies you have to worry about.",
   "created_utc": 1691352674,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2lput",
   "message": "I'm in corrections at a prison hospital. Finding dead people is kind of a common occurrence, unfortunately.",
   "created_utc": 1691352767,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2lq8y",
   "message": "Oh shoot! That's one way to avoid small talk with the neighbors. Poor guy, RIP.",
   "created_utc": 1691352771,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2m1fq",
   "message": "Nah I found it on purpose to set me and my three childhood friends on a wacky, spooky, and bonding journey before I had to switch schools and move away forever",
   "created_utc": 1691352899,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2mbru",
   "message": "I was a security guard at a pharma manufacturer in California.  Another guard and I were checking perimeter fencing and saw the aftermath of an OD suicide.  It was an employee.",
   "created_utc": 1691353016,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2mi3v",
   "message": "Not me ! a local young lad found 9 or ten dead bodies either hanging or drowned with the final one being his own mother hanging all by the time he was 15 . East Ireland 🇮🇪 even went on to Spain and pulled on in while he was on a jet sky . Was a short film about it , got in to Galway film festival. Film was called Do not Enter .",
   "created_utc": 1691353088,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2mr4t",
   "message": "Were in holiday (honeymoon) in Japan with a small group.\nOne elder man did not show up in the morning of the second day. \nEmployee of the hotel asked me to come with him and guided me to his room.\nThere he was lying dead on the floor surrounded with men in protective suits and our guide which told me he had to go to the police for some paperwork and I should tell the group to move on without him and that the guy is feeling unwell und has to go to the hospital with him.",
   "created_utc": 1691353191,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ms5f",
   "message": "Just wandering around the funeral home where a family member was cremated, and I just happened to see a casket with a man laying inside, his arms crossed over his chest. He had the mortician makeup on, complete with a pair glasses. It was only a bit over a week after the first time I saw a dead body.",
   "created_utc": 1691353203,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2n2y6",
   "message": "Sort of…I was in the car when we pulled up to a gas station in North Jersey. So, my dad gets out to get something, it certainly wasn’t to pump the gas because we don’t do that here. Anyway, he starts freaking out there’s a dead body here somewhere, and the attendant is like what do you mean? My father’s like there’s a dead body, I can smell it, I know it, I know that smell, I found enough of them in Vietnam. Call the police! I know there’s a dead body here. Well, he wouldn’t let me out of the car, I just stayed in the car. But the police came, and yes there was a dead body in the ditch nearby. The police said, how did you know? And he said because you don’t forget what a dead body smells like, it has a very particular odor, a sweet smell. It was all you could smell sometimes after a battle.",
   "created_utc": 1691353323,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2o32q",
   "message": "I was waiting for the bus home from work and a drunk guy going 140km/h (86mph) rammed it into the opposite bus stop full of people. I went there with the intention to do first aid to anyone that needed it. When I came closer, it was obvious that everyone who was hit didn't make it. I just called the emergency phone number, gave them information and then navigated the paramedics to the bodies.",
   "created_utc": 1691353734,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2okpy",
   "message": "Mother found a corpse at sea while pedal boating with her sister as a kid. This was off the coast of Senegal 60 years ago.\nTurns out an airliner had crashed at sea about a week earlier, with a fair number of missing passengers.",
   "created_utc": 1691353934,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ovc4",
   "message": "Story time\n\nIn 2017 I used to work as a photographer for one of the biggest shoe stores in Gdansk, Poland. Like one of those with limited, mostly overpriced rare kicks mixed with normal new balances and nikes. I was responsible for doing packshots (pictures of the product on white background you see on every website) and more lifestyle type of content for social media. The latter was really fun, because I got to take 5 or 6 pairs and go somewhere to shoot with my friend, who would just put them on for pictures. Guy was very athletic so if I envisioned him standing on his hands, jumping very high or run super fast for photo, there was no problem with any of that. The golden rule was that location had to match the shoe in some way. For example soccer cleats somewhere on the field, basketball shoes on court, running shoes on track etc. It was my role to get creative with it. One day I had to do a pair of Timberlands, some Puma running shoes and Vans’ in collaboration with Nintendo. I Was really looking forward to those Vans, because I managed to book local arcade spot before it opened, so creatively it was dope. We shot quick pictures of running shoes on local track and decided to take Timbs to a nearby forest, where we knew there were some old, post war bunkers. It was winter, so grey concrete, some snow and trees seemed like a perfect spot for mustard-colored shoes to „pop up”. And it was „in theme” since in Poland 6 inch Timbs are more of a winter shoe than work boots. So my friend put the shoes on, went to a spot near the entrance to the bunker where I told him to stand and froze... He turned around and said „Come here and tell me that I’m not seeing what I’m seeing…” So there I went thinking he found some money or phone or something. Nope, there was a body like 2,3 steps inside the „hallway”. Completely covered with some rugs and cardboard except the f*cking creepiest, now engraved in my memory paper white face, with open eyes and open mouth „looking” right at us. He was lying on his side and his head was turned up towards us, what made it even creepier. We just stood there for like 20 seconds not moving, not breathing in complete silence. Like we were waiting for him to say something or I don’t know, stand up. It was clear that guy was dead but we yelled „hey” a few times because we couldn’t believe what is happening. The fact that this guy was near the entrace and there was this whole, huge, dark f*cking hallway with bunker room behind it started to create weird scenarios in our heads straight from zombie/friday 13th movies. We went back to the car and called the police. Patrol car came in like 2 minutes. We pointed two cops where to go since we really didn’t want to go there again. Turned out it was a homeless guy who got very drunk and went to sleep right after downing whole bottle of vodka. Froze to death. Cops said they knew him, he was about 60, in and out of prison. It took them like 2 hours to take our statements. I remember one of them not believing that taking pictures of shoes can actually be a proffesion, so I had to show him what pictures we’ve taken already that day. Next day there was like a brief mention in one of those local newspapers saying that police is looking for any realitives of a guy. Oh, and we didn’t go to the arcade to take those pictures. Went to a bar and got drunk instead.\n\nOn a „funny”, shorter note. In 2022 my car was stolen and I had to go to a police station to report it. When cop was putting my info to the system he looked at me from behind his computer and said „holy shit, you’ve just randomly found the body?!” Had to tell the story again. Still, didn’t find my car.\n\nPs. Sorry for my english, It might be the longest i ever wrote in that language :)",
   "created_utc": 1691354053,
   "score": 1,
   "submission_id": "15jv6l0"
  },
  {
   "comment_id": "jv2ownr",
   "message": "as opposed to intentionally?",
   "created_utc": 1691354069,
   "score": 1,
   "submission_id": "15jv6l0"
  }
 ]
}