{
 "submission_id": "15k0m31",
 "title": "What do most people not know their phones can do?",
 "selftext": "",
 "created_utc": 1691355867,
 "permalink": "/r/AskReddit/comments/15k0m31/what_do_most_people_not_know_their_phones_can_do/",
 "score": 134,
 "url": "https://www.reddit.com/r/AskReddit/comments/15k0m31/what_do_most_people_not_know_their_phones_can_do/",
 "comments": [
  {
   "comment_id": "jv2tslp",
   "message": "Tap and hold the space bar to move your text cursor tool back and forth with precision. Every time I do it in front of someone they've been like\"wait, do that again\" and they act like I just made their lives way better.",
   "created_utc": 1691356051,
   "score": 244,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2u8rx",
   "message": "Many phones have built-in document scanning features that allow users to scan and save documents as PDFs using the device's camera",
   "created_utc": 1691356235,
   "score": 46,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv38nya",
   "message": "Destroy your alibi",
   "created_utc": 1691362555,
   "score": 35,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3asab",
   "message": "If you take a picture of a flower you can hold it down and click info and it will search up what it is",
   "created_utc": 1691363518,
   "score": 230,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2teh7",
   "message": "Make phone calls",
   "created_utc": 1691355892,
   "score": 69,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2x369",
   "message": "Text me back ☹️",
   "created_utc": 1691357426,
   "score": 66,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2w4lr",
   "message": "You can use the translate app with your camera to translate printed text in real-time.",
   "created_utc": 1691357016,
   "score": 73,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2tvk6",
   "message": "on Android you can do splitscreen between 2 apps at once \n\nI like to surf reddit and watch youtube at the same time",
   "created_utc": 1691356084,
   "score": 60,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv307ix",
   "message": "Be left alone for days.",
   "created_utc": 1691358772,
   "score": 187,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2vyfg",
   "message": "On Android you can torrent directly onto it, then cast the file onto most smart TV's.",
   "created_utc": 1691356945,
   "score": 52,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2u77g",
   "message": "I don't remember how to unlock it, but Samsung phones have a cat. It's a virtual cat that you can feed and play with.",
   "created_utc": 1691356217,
   "score": 160,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv317dh",
   "message": "Apple iPhone 14+(?):Take a picture of text, then go to the photo you just took in the photos app, and tap and hold the text in the photo and you can copy, and all that",
   "created_utc": 1691359203,
   "score": 80,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2tvdl",
   "message": "Turn off, while we're eating dinner.",
   "created_utc": 1691356082,
   "score": 162,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv345gq",
   "message": "On an iphone, if you hold the flashlight button, it gives you a dimmer.",
   "created_utc": 1691360510,
   "score": 29,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2tew0",
   "message": "#GOOGLE.",
   "created_utc": 1691355897,
   "score": 32,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv34czk",
   "message": "Tell Google, Meta or whoever everything you do and everywhere you go.",
   "created_utc": 1691360604,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3bfel",
   "message": "You can add shortcuts on your iPhone that are triggered by double or triple tapping the back of your phone.",
   "created_utc": 1691363814,
   "score": 92,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv377mu",
   "message": "Be put down and ignored while driving.",
   "created_utc": 1691361903,
   "score": 16,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2tszm",
   "message": "Remain in a pocket for five minutes while the owner gives their full attention to a person they’re talking to.",
   "created_utc": 1691356055,
   "score": 77,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3c4mc",
   "message": "I watched live DVB-TV on mine a few minutes ago (with an SDR dongle).  Also do FM radio (but a lot of phones used to do that), plus track aircraft (ADS-B), listen in to air traffic control, etc.\n\nI've connected a Bluetooth mouse and keyboard before now (in Android, a cursor appears if you can get any mouse device connected, Bluetooth or USB).  Works on all Android phones.\n\nI also have Samsung Dex, so plugging it into HDMI turns it into an Android desktop.\n\nI have a spirit-level app that uses the orientation sensors, and I've used that when doing DIY.  Also a ruler app for things smaller than the screen.  I've used a bright-white app to see 35mm film (I have some cinema frames of famous movies).  I've  connected webcams and microscopes and the snake-cams you use in drains just over USB.\n\nI've connected it to my car OBD to diagnose faults showing on the ECU and reset other people's car ECUs.  I emulate the old TI graphing calculator I used to use when I was in school (and it's the quickest way to do some calculations and better than the built in calculator apps).\n\nI've read credit and access cards with NFC (to show people that their secure cards aren't as secure as they think) as well as pulled passport images out of passports just by touching them.  I've taken credit card payments on it (using a Square / iZettle / etc. reader) and printed our receipts for people (bluetooth receipt printer).\n\nI've scanned entire documents using the camera, encoded video on the go (FFMPEG), controlled projectors and TVs (with a headphone adaptor to run irplus WAVE like a universal IR remote).\n\nI use it for Wake-on-LAN and scanning local wireless networks, I use it as a remote Steam client and played games using it as a controller, and using controllers with it to play old emulated games.  I've used it as a go-to aligner for my telescope (strap it to the telescope and then tell it what you want to look at and it guides you there).\n\nAnd I use it to charge other devices, and charge from other devices (including my laptop, both ways).\n\nPeople sometimes ask me why I use a particular type of phone, and there's a reason.  You can't do all the above with \"just apps\", you have to have certain features in the hardware for it to work and some expensive phones have nowhere near the stuff I use all the time.\n\nMy hardware gets used, a lot, for all kinds of things.  It has to be able to do all kinds of things to be useful to me.  Your flashy iPhone doesn't do half the stuff I want to be able to do, even if I only need that feature every now and then.",
   "created_utc": 1691364132,
   "score": 39,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3epa5",
   "message": "On apple phones, the apple logo on the back is a button. In setting you can make it so it can do things like turn on and off your flashlight, lock your phone, and more",
   "created_utc": 1691365307,
   "score": 220,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2vcbl",
   "message": "My Mum, yes really, had to tell me the volume key on my phone can take photographs as well as the on screen button. This has changed how I take photos. Though I told her that you can double tap the power key to get the camera up, it's not as slick as my old K800i but it's pretty handy.   \n\n\nI am usually surprised as the performance of my phones, I buy phones from Cubot, they are around £100 for the mid-range I buy and they do everything I need. I have been watching videos from Smoorezz on youtube who covers cheaper and nastier phones (in fact he's only reviewed Cubot once as they are a \"proper\" phone manufacturer) he tests games like GTA 3, SA and others as well as doing a benchmark test. I ran the same on my old Cubot which is 2 years old and my new one, both came out with pretty impressive specs and if I wanted to I could run 3D GTA games smoothly on my phone at maximum specs. \n\n I was surprised as I don't expect to do anything on my smartphone that isn't browsing Reddit, watching youtube, browsing the web, listening to music, taking and recording decent enough video and photographs, finding my way when i'm lost and a few other basic features.\n\n\u0026amp;#x200B;\n\nI'm sure most people with a high end £1000 Samsung or iphone don't realise exactly the sort of power they yield and i'm sure most don't run intensive applications on them.",
   "created_utc": 1691356690,
   "score": 37,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2ywsz",
   "message": "Your samsung s series can wirelessly charge other devices",
   "created_utc": 1691358214,
   "score": 139,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv37vkw",
   "message": "iPhone -- if you enable it in settings, you can physically tap on the back of the phone two times or three times to trigger some function. I have a double tap set to open the carousel of open apps and a triple tap set to bring up the menu with the flashlight and volume controls. You can set it to do pretty much anything you want.\n\nIf you shake your phone, it will ask if you want to undo whatever you were typing.\n\nA new favorite feature of mine is it can select text in a photo. Any photo! It doesn't have to be one you've taken and the text can be skewed or stylized any which way. If you long press on the subject of a photo it will also let you copy just the subject so you can have a transparent background.",
   "created_utc": 1691362202,
   "score": 42,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2twrs",
   "message": "Support a short table leg",
   "created_utc": 1691356098,
   "score": 103,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2ym8y",
   "message": "Turn off",
   "created_utc": 1691358087,
   "score": 7,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2tvx9",
   "message": "iPhones double up as a spirit level; there’s an option for it in the native Measure app.",
   "created_utc": 1691356088,
   "score": 109,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv33s0m",
   "message": "call their parents",
   "created_utc": 1691360344,
   "score": 12,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2v3x2",
   "message": "They won't explode if you don't look at them every minute",
   "created_utc": 1691356592,
   "score": 11,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2ufjn",
   "message": "Wait until they're done driving.",
   "created_utc": 1691356312,
   "score": 3,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv31jkd",
   "message": "make mac and cheese",
   "created_utc": 1691359350,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv37dhr",
   "message": "On Android volume down + power button snaps a screenshot",
   "created_utc": 1691361975,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3f1rj",
   "message": "Calling someone works both ways",
   "created_utc": 1691365465,
   "score": 3,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2wi0l",
   "message": "For iPhone, hold the spacebar to make a trackpad, you’ll see the keys go blank, drag your thumb tip around to move the cursor. Drop the cursor where you want it, and delete or type as needed.",
   "created_utc": 1691357173,
   "score": 7,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv32z8h",
   "message": "Turn off",
   "created_utc": 1691359982,
   "score": 2,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2th9a",
   "message": "work as an effective projectile on musicians in concerts",
   "created_utc": 1691355923,
   "score": 6,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv37q7n",
   "message": "Off topic but I can't think of the last new phone feature that made me say \"goddamn , I gotta shell out $1k for this shit!\"",
   "created_utc": 1691362134,
   "score": 3,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3g38d",
   "message": "Fit in their rectum",
   "created_utc": 1691365941,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3hsv6",
   "message": "It can stay in their pocket while they are walking somewhere in public.",
   "created_utc": 1691366737,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv36b5b",
   "message": "Anything is a dildo if you’re brave enough.",
   "created_utc": 1691361494,
   "score": 27,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2vqyf",
   "message": "Burn and explode",
   "created_utc": 1691356859,
   "score": 254,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv39e16",
   "message": "Listen to them and sell that data.",
   "created_utc": 1691362884,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2tnxg",
   "message": "[deleted]",
   "created_utc": 1691355998,
   "score": 0,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv2vldp",
   "message": "Not let you go on it if it overheats",
   "created_utc": 1691356794,
   "score": 0,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3cfye",
   "message": "Leave you in debt.",
   "created_utc": 1691364276,
   "score": 255,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv34h3i",
   "message": "Google",
   "created_utc": 1691360656,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv394df",
   "message": "Latest iPhones (I guess from SE 2020) have functions for the apple on the back and you can set it up by going in Settings\u0026gt;Accessibility\u0026gt;Touch\u0026gt;Back Tap at the end",
   "created_utc": 1691362762,
   "score": 4,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv39l1h",
   "message": "If you tell siri to cast lumos then the light on the iphone will turn on",
   "created_utc": 1691362971,
   "score": 82,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv39m00",
   "message": "rectal probes",
   "created_utc": 1691362984,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3bnax",
   "message": "\"Print\" a document to get a pdf!  I help people with this *so much* in my job where people need to send me documents.  Often they're expecting to see a \"save\" or \"save as pdf\" option, and that may just not be there.  They're surprised when you suggest trying \"print\" without access to a printer, and pleased when they see that it works.",
   "created_utc": 1691363914,
   "score": 129,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3bsrf",
   "message": "Alert you if it hears loud noises or certain sounds.",
   "created_utc": 1691363983,
   "score": 11,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3ce49",
   "message": "Android: Use the print option via Share to quickly save most files and webpages as a PDF.",
   "created_utc": 1691364254,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3ekf1",
   "message": "Metal detection.\n\nAbout 5 years ago, a coworker and I knew a hallway in our building had a pipe cleanout that we needed to access, buried under the concrete floor. We didn't know where exactly. He downloaded a metal detector app, it flagged a spot, we dug, and it was right there.",
   "created_utc": 1691365246,
   "score": 249,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3fomj",
   "message": "That’s amazing!! Now if only my stupid brain would allow me to remember something useful like this! 😂",
   "created_utc": 1691365755,
   "score": 255,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3fx8h",
   "message": "Transform into a kiler cyborg assassin from the future sent to terminate Keanu Reaves",
   "created_utc": 1691365864,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3hhqr",
   "message": "Work without being on speakerphone. Why are soany fucking people on speakerphone when it isn't necessary.",
   "created_utc": 1691366593,
   "score": 0,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3ii69",
   "message": "Power button + volume up turns my display to greyscale.",
   "created_utc": 1691367062,
   "score": 10,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3izdg",
   "message": "Make a phone call",
   "created_utc": 1691367282,
   "score": 0,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3j6wr",
   "message": "  Awesome lol thank you",
   "created_utc": 1691367378,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3k05e",
   "message": "You can play music for yourself during a call.",
   "created_utc": 1691367748,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3k3ti",
   "message": "hold down the 0 (zero) on iphone and you can make degrees   ex 360°",
   "created_utc": 1691367796,
   "score": 218,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3kl3p",
   "message": "Give you answers to any questions you have.",
   "created_utc": 1691368022,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3ksyk",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3ktmq",
   "message": "You can actually add settings into your pull down access board on IOS. You go to ease of accessibility and you can add a 1-click shortcut to screen recording, song recognition, etc. My favorite is speaker as I can always see how much battery my off brand headphones have left without digging into an app to see.",
   "created_utc": 1691368134,
   "score": 11,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3kykn",
   "message": "The iPhone comes with a built-in level.",
   "created_utc": 1691368197,
   "score": 2,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3kzyp",
   "message": "Most phones today are actually able to have the sound turned off of videos in public spaces!",
   "created_utc": 1691368214,
   "score": 72,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3l4mb",
   "message": "Use your phone cam to translate text.",
   "created_utc": 1691368274,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3mirq",
   "message": "Hold down a part of a photo you want to isolate and it will remove the background.",
   "created_utc": 1691368933,
   "score": 196,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3mg2v",
   "message": "Copy text out of images. I love this for recipe photos in subs like r/oldrecipes where I am on my phone, using Paprika, and I can save the whole thing with a few taps and drags.",
   "created_utc": 1691368897,
   "score": 35,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3qm8g",
   "message": "Repeatedly clicking the side button like 8 times or sometimes dials 911. Didn’t know that until I did it.",
   "created_utc": 1691370886,
   "score": 218,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3m1iz",
   "message": "If you tell it “Lumos/Nox” it’ll turn the flashlight on and off. Kinda an old thing people forgot about, I think.",
   "created_utc": 1691368706,
   "score": 5,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3ohil",
   "message": "I found this out a year ago but on iPhone, I can say “hey Siri, Lumos” and she turns on the flashlight… I thought that was pretty cool. Lol",
   "created_utc": 1691369864,
   "score": 3,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3qdgw",
   "message": "Some people complain that they miss the time when you could just leave the house and be unreachable.  They seem to not know that you can just turn your phone off.  Or even leave it behind.",
   "created_utc": 1691370770,
   "score": 104,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3vuc2",
   "message": "That it can just be a PHONE.",
   "created_utc": 1691373416,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3x6f4",
   "message": "Actually, talk with it to your ear..",
   "created_utc": 1691374065,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3yef9",
   "message": "Lots of things.\n\nTransfer things to usb stick,\nTransfer things to 2.5 hdd,\nCapture video from rca cables with an easycap and the usb camera app.\nRAW file photo editing.\nCan connect keyboard to it and play cool software synthesizers.\nCan be used as a Digital audio workstation (DAW).\nCan play nostalgia games with emulators and its really awesome if you use a controller and an old crt tv.\nConverting sound files and videos.\nCan be used as a TV with antenna.\n\nIf you are a programmer you can even start your car with the phone, or create cool dash like deloreans there are tons of cool things endless possibilities.",
   "created_utc": 1691374663,
   "score": 2,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3ltrn",
   "message": "Be charged to 80% in 90 seconds by putting it in the microwave at no more than 800W.",
   "created_utc": 1691368603,
   "score": 251,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3nyye",
   "message": "On Samsung galaxy phones you can download an app called \"GoodLock\" from the galaxy store allowing full costumization of the phone such as keyboard, AOD, pull down menu, clocks, lock screen widgets, notifications, status bar, and more.",
   "created_utc": 1691369620,
   "score": 0,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3rcvh",
   "message": "A lot  of people spend a lot of time and effort typing messages into their phone.  It seems that they don't know that their phone includes a little-known feature that allows you to actually talk to the person.",
   "created_utc": 1691371247,
   "score": 0,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3tic0",
   "message": "Listen to your conversations and produce adds based on what you are talking about.",
   "created_utc": 1691372292,
   "score": 1,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3vt2x",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3tuk6",
   "message": "When headphones are not available the speaker does not have to be used and in general the volume can be turned down.",
   "created_utc": 1691372455,
   "score": 79,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv46zob",
   "message": "If you talk a lot of about something near your phone you’ll get ads and content for that subject  ;)",
   "created_utc": 1691379105,
   "score": 39,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3rinz",
   "message": "Apparently get them convicted of murder according to most crime shows I watch.",
   "created_utc": 1691371324,
   "score": 7,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3w8ej",
   "message": "It can track you! Even if:\n\n•your location is off\n•phone is on airplane mode\n•phone is turned off. \n\nTaking the battery out is the only way to make yourself non-trackable (or leave it at home!).",
   "created_utc": 1691373605,
   "score": 109,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3ss6f",
   "message": "You can backspace on the calculator by swiping to the left or right.",
   "created_utc": 1691371938,
   "score": 217,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv45swh",
   "message": "If you take a picture of a plant, your iphone can tell you what plant it is.",
   "created_utc": 1691378470,
   "score": 3,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv4795f",
   "message": "to check if your tv remote is working, point it at your phone camera, the phone will pick up the flash and it'll be visible on screen.   \n\n\nlifesaver working in AV.",
   "created_utc": 1691379249,
   "score": 142,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv487zx",
   "message": "If you feel like your brightness is still too high you can actually reduce the white point further in settings",
   "created_utc": 1691379791,
   "score": 210,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3nqy5",
   "message": "On iPhone scroll up a bit on messages to access the search bar. \n\nClicking on it will pull up all sent links and photos, additionally type in any keyword to find messages matching it.\n\nI’ve utilized it a ton just to look back on a text to confirm info. I feel like it’s well known but have shown a few people about it.",
   "created_utc": 1691369516,
   "score": 19,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3lv0z",
   "message": "power down for long lengths of time if you choose to. May be beneficial for the majority of people.",
   "created_utc": 1691368620,
   "score": 2,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3muat",
   "message": "Read deleted messages 24h even if you didnt read them before the sender deleted them and you only saw the \"deleted\" notification. Turn on \"notication history\" in settings and voila. (atleast on some androids)",
   "created_utc": 1691369085,
   "score": 40,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3syhv",
   "message": "If you messed up your typing on an iPhone you can shake it to undo",
   "created_utc": 1691372024,
   "score": 18,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3u72x",
   "message": "That they will survive when put down for extended periods of time.",
   "created_utc": 1691372624,
   "score": 2,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3ujh4",
   "message": "Keeping the same phone number. Some people are allergic to that.",
   "created_utc": 1691372791,
   "score": 27,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3wkp2",
   "message": "With an iPhone to an iPhone text “Pew Pew” without the quotes and it does lasers to that person in the text.",
   "created_utc": 1691373771,
   "score": 233,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3wnox",
   "message": "How the fuck would I know? 🤣",
   "created_utc": 1691373812,
   "score": 2,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv407wz",
   "message": "scan something into a PDF",
   "created_utc": 1691375571,
   "score": 2,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv418bb",
   "message": "If you pick up the phone and dial my number you could make my day. For some reason everyone always forgets",
   "created_utc": 1691376086,
   "score": 4,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv43mdr",
   "message": "Just found out yesterday that you can adjust the brightness of the flashlight. Hold down on the flashlight button(:",
   "created_utc": 1691377325,
   "score": 2,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv43rx0",
   "message": "You can watch videos other than porn",
   "created_utc": 1691377404,
   "score": 2,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv49iyd",
   "message": "I remember one of the first iPhones after the App Store opened (3G maybe?) had an app that looked like a mug of beer and when you tilted it it looked like you were drinking it. Lol we thought it was the most advanced thing!",
   "created_utc": 1691380522,
   "score": 84,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv4dciu",
   "message": "In the photos app you can search a phrase like “cat” or “green car” or certain texts or anything really and it will bring up every photo related. It’s not perfect but it’s saved me tons of time searching for old photos. I’ve showed this to dozens of people and nobody has ever said I already knew that lol… Hope I can help someone else!",
   "created_utc": 1691382806,
   "score": 12,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv4f4em",
   "message": "Ultra dark mode on iPhone. I don’t endorse anyone using their phone in a movie theater, but this way is infinitely more discrete. I typically use it when putting my baby to sleep and I want to scroll Reddit without keeping the kid awake.\n \nSettings -\u0026gt; accessibility -\u0026gt; Display \u0026amp; Text Size. Turn on “Reduce White Point” and set it to 100%. \n\nNext you can set a shortcut like this:\n\nSettings -\u0026gt; accessibility -\u0026gt; accessibility shortcut. Select Reduce White Point.\n\nNow you can swap between normal display and ultra dark mode by triple pressing the power button. You’re welcome.",
   "created_utc": 1691383925,
   "score": 101,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv47ekz",
   "message": "#Edit one photo in a set you have taken and apply the changes you’ve made to the other photos, saving much time editing photos taken in similar lighting, in the same spot.\n\n1 Open the Photos app and select an image to edit. Then tap Edit. \n\n2 Make any adjustments to the photo you desire, then tap Done.\n\n3 With the image selected in Photos, tap the three dots icon, top right. Then tap Copy Edits.\n\n4 To paste edits to a single image, select another image in the Photos app, tap the three dots icon and then tap Paste Edits.\n\n5 To paste edits to multiple images, go to your Photos library or to an album and tap Select, top right.\n\n6 Tap each image you'd like to paste edits to. When selected, an image will feature a blue tick.\n\n7 Tap the three dots icon, bottom right, then select Paste Edits.",
   "created_utc": 1691379331,
   "score": 113,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv4hfyp",
   "message": "On Android if you pull down to expand the shortcuts with like Bluetooth, wifi, etc. You can click the words under the circle to get more options",
   "created_utc": 1691385474,
   "score": 163,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv4gi25",
   "message": "You can call someone in public transportation without being on speaker",
   "created_utc": 1691384833,
   "score": 22,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv4457e",
   "message": "Motorola phones have a double chop gesture to turn on flashlight mode. https://www.youtube.com/watch?v=edtCMqK8Rn8",
   "created_utc": 1691377594,
   "score": 21,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv47lm1",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv43snv",
   "message": "You can turn the keyboard clicks OFF",
   "created_utc": 1691377415,
   "score": 69,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv4kgrc",
   "message": "Most people are unaware that their phones can act as remote controls for various devices and appliances.",
   "created_utc": 1691387580,
   "score": 28,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv484r2",
   "message": "Be turned the fuck off during movies…",
   "created_utc": 1691379741,
   "score": 5,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv4kfzu",
   "message": "you can use your phone as a level and tape measure",
   "created_utc": 1691387565,
   "score": 41,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv473b4",
   "message": "I don’t know what I don’t know. But I do know about pressing the space bar to move back and forth.",
   "created_utc": 1691379160,
   "score": 5,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv4knt7",
   "message": "Most people don't know their phones can also double as a teleportation device to escape awkward social situations.",
   "created_utc": 1691387722,
   "score": 6,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv4f9a0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv4yntl",
   "message": "Be used as a weapon. I'm serious. Once I was about 15 and a guy came over to me and put his arms on each side of me. He was a lot older than me and I remember him saying I needed to be quiet. He then said something I don't feel comfortable sharing online but before he could do anything I took the corner of my phone and smashed it into his collar bone. I was nowhere near \"strong\" but it made him fall back and I had enough time to run and get help.\n\nUse your phone as a weapon especially Motorola those things are sturdy.",
   "created_utc": 1691398835,
   "score": 60,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv3psze",
   "message": "When entering a url, hold the period to automatically add “.com”",
   "created_utc": 1691370495,
   "score": 12,
   "submission_id": "15k0m31"
  },
  {
   "comment_id": "jv43xjq",
   "message": "I often use my IR blaster for my AC at home because I don't remember where I put the actual remote",
   "created_utc": 1691377485,
   "score": 9,
   "submission_id": "15k0m31"
  }
 ]
}