{
 "submission_id": "15k133x",
 "title": "What do you think About the micheal Jackson child grooming/molestation accusations? Do you think they’re true?",
 "selftext": "",
 "created_utc": 1691357022,
 "permalink": "/r/AskReddit/comments/15k133x/what_do_you_think_about_the_micheal_jackson_child/",
 "score": 192,
 "url": "https://www.reddit.com/r/AskReddit/comments/15k133x/what_do_you_think_about_the_micheal_jackson_child/",
 "comments": [
  {
   "comment_id": "jv2wr1k",
   "message": "Who the fuck knows. \n\nThat guy was so fucked in the head as a result of a lifetime of use and abuse by everyone around him, and his development so stunted, that I doubt he had any fucking concept at all about normal adult boundaries. \n\nSo who the fuck knows what lines were and weren't crossed, because neither a child nor Michael Jackson probably understood where those lines were, or even that they existed. \n\nI think it's entirely possible, but I don't necessarily assume it just because of all the other weirdness.",
   "created_utc": 1691357282,
   "score": 144,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3g15n",
   "message": "The only thing I think is indisputable is this; Michael Jackson was absolutely inappropriate with children for decades and nobody in his inner circle did anything about it. Whether he was molesting them, I cannot say; but he should've never been allowed to maintain the kind of contact with kids he did regardless.",
   "created_utc": 1691365915,
   "score": 14,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv433em",
   "message": "To me, it doesn't matter what his intentions were or if contact was ever made. Even the cleanest version of the story, that he loved children innocently and had young children staying with him with no ulterior motive, lavishing them with gifts then eventually finding a new child to repeat that with. Even that would strike me as unacceptable behavior. What we have heard from those who have come forward, I fully believe is largely true (and I assume discrepancies come with the time between the events and now, and the ways trauma effect memories). I think absolutely everyone wanted to believe there was no way Michael Jackson could do such a thing. Maybe even he didn't believe it. But he did, to me that's undeniable given what we know now.",
   "created_utc": 1691377049,
   "score": 143,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3r70t",
   "message": "I'm the words of Scottish comedian frankie Boyle \n\n\" I'm not saying Michael Jackson was a pedophile, but if I was a millionaire pedophile, I'd have Disneyland in my back garden.\"",
   "created_utc": 1691371168,
   "score": 121,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3c391",
   "message": "Let's imagine that he was innocent. Then he would have just been an adult that reached out to children that he had no relation with and hadn't previously met to go on trips with him and spend the night with him.",
   "created_utc": 1691364115,
   "score": 210,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3bwsd",
   "message": "True or not he did admit to sharing his bed with children, which is pretty fucked up.",
   "created_utc": 1691364034,
   "score": 14,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv2wnem",
   "message": "100% true. Dude had booby traps alerting him when people were approaching his bedroom",
   "created_utc": 1691357238,
   "score": 37,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv2wf85",
   "message": "Yes, I think they are.",
   "created_utc": 1691357140,
   "score": 67,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3ineh",
   "message": "I watched the HBO documentary with the victims. Their stories seemed pretty credible to me.",
   "created_utc": 1691367128,
   "score": 136,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3gent",
   "message": "Yes absolutely. Here's a list of some of the evidence against him. Like for instance one of the victims being able to describe the pattern underneath of his privates caused from his vitiligo\n\nhttps://www.vanityfair.com/hollywood/2019/03/10-undeniable-facts-about-the-michael-jackson-sexual-abuse-allegations",
   "created_utc": 1691366088,
   "score": 112,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3ohrw",
   "message": "Yes, there is pretty damning evidence. I also believe he befriended famous kids and never touched them simply for the fact that he would have kids who would \"prove\" he wasn't inappropriate with kids. \n\nIf a few celebrity kids are interviewed and say everything was innocent, the \"poor\" kids just look like they are out for money. Famous kids are credible, poor kids are not.",
   "created_utc": 1691369868,
   "score": 94,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv2wcd8",
   "message": "They're true. Michael was abused as a child but that doesn't mean he's not an abuser himself.",
   "created_utc": 1691357107,
   "score": 71,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv365x7",
   "message": "I can’t say anything definitively, but it’s really odd that a grown man would like to hang out with children that often. Especially sleep with them, like literally sleep beside them. That’s just weird.",
   "created_utc": 1691361427,
   "score": 66,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3iwxb",
   "message": "Yes, he was a diddler. Really sad upbringing and was (likely) abused by his dad.",
   "created_utc": 1691367250,
   "score": 45,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3icic",
   "message": "He was hiding plain sight. He was wearing a pedophile costume. Right there, in front of everyone. He built a fairground in his back garden, ffs.",
   "created_utc": 1691366989,
   "score": 50,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3px9i",
   "message": "I would love nothing more to believe the man innocent but where there's smoke...",
   "created_utc": 1691370553,
   "score": 15,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv36ib8",
   "message": "I think he might have really thought he wasn't doing something wrong, but probably fit the accusation",
   "created_utc": 1691361584,
   "score": 18,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv40nvb",
   "message": "A child being able to specifically describe your penis is very clearly evidence of that child suffering abuse.",
   "created_utc": 1691375796,
   "score": 19,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv352qs",
   "message": "I never ignore accusations of child molesting, even when the guy accused is 1) an icon and 2) deceased.",
   "created_utc": 1691360927,
   "score": 32,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3xcfw",
   "message": "I don't.\n\nNeverland Ranch had over 1,000 children attend it every single day for free (it was an amusement park).  And hundreds of children spent the night at Neverland Ranch.\n\nEpstein's island was just so much smaller than this.  Epstein used about 100 girls the entire time the underage human trafficking operation was running.  And they were able to track down about half of those girls.\n\nThere was a very thorough investigation into Jackson.... from 1992 before the allegations until 2005 the FBI was investigating Michael Jackson.  A guy named Frank Paul Jones began threatening Janet Jackson and then was arrested busting into Jackson's home.  Like law enforcement officials are supposed to because of this they were given the power to tap Jackson's home and monitor him for 13 years.\n\nIn 2003 the FBI raided Jackson's home.  They got all of his computers, his surveillance system, all of the surveillance videos up to 5 years (including the bedroom where the act would have happened) and his collection of Playboys.\n\nThey invested millions into this investigation and nothing in their investigation found any evidence of wrong-doing.  The only evidence that was ever presented was the circumstantial and inconsistent testimonies of a child drugged up on barbiturates that have a habit of creating false memories.\n\nIf the police could find half of all Epstein's victims and find evidence of human trafficking after just one year.... why couldn't the FBI and the police not find any after 23 years?",
   "created_utc": 1691374147,
   "score": 18,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3wq4c",
   "message": "The FBI and other law enforcement agencies investigated him for years, had surveillance on his house for a long time and found nothing incriminating. \n\nPeople knew he was a little weird around kids and tried to make up allegations to get money out of him.",
   "created_utc": 1691373845,
   "score": 5,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3thjm",
   "message": "He admitted at a minimum he would spend nights alone in his room with young boys. I think he’s 100% guilty but even if not he’s so incredibly stupid I have no sympathy if the accusations were false.",
   "created_utc": 1691372281,
   "score": 16,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3tc2n",
   "message": "YES. Absolutely. We have multiple, detailed accounts of him being a child rapist. I know he’s beloved for his music but the benefit of the doubt he gets is insane.",
   "created_utc": 1691372208,
   "score": 17,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3739k",
   "message": "Most likely. He was found not guilty in 2005, but he also paid off victims so they wouldn’t sue him, he’s paid tens of millions in hush money. An innocent man would refuse to pay a single penny if someone falsely accused him of such heinous crimes.",
   "created_utc": 1691361847,
   "score": 39,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3upy8",
   "message": "No one can say for sure what occurred. Michael Jackson had extremely odd behavior, and for someone with his caliber of fame, left behind alot of mystery (even to members of his own family). While I do not feel comfortable discussing the hypothetical molestation of children, Michael’s personal boundaries and friendships with children were inappropriate by modern standards. If you had a random neighbor who was having close friendships and sleepovers with children, the local community would be extremely concerned. Such cannot be said for charismatic celebrities",
   "created_utc": 1691372876,
   "score": 3,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3ygqy",
   "message": "HBO did a show on this. Oprah did the post screening interview with two victims, one who recanted. Hard truth.",
   "created_utc": 1691374695,
   "score": 2,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3tly0",
   "message": "Probably? But moreover, if there is any truth, I think that those parents should be charged with child endangerment. Unlike the priests who hid it, it was pretty obvious if he was that he was.",
   "created_utc": 1691372339,
   "score": 9,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv34svj",
   "message": "Yeah. Everything points to it. If it looks like shit, and it smells like shit….chances are, it’s shit.",
   "created_utc": 1691360802,
   "score": 15,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3jykl",
   "message": "A total diddler.  Makes me sick that they still play him on the radio.  Change the channel every time.",
   "created_utc": 1691367728,
   "score": 15,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3pln3",
   "message": "I think it’s likely true, no true proof more just a vibe\n\nIt also wouldn’t surprise me if it was the result of a cycle of abuse especially with his fame at a young age w/ the Jackson 5",
   "created_utc": 1691370398,
   "score": 9,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3uxxy",
   "message": "Haven’t some of the kids come out and said they were false after he died? Could be false memories but i could swear that happened.",
   "created_utc": 1691372982,
   "score": 2,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv2wax5",
   "message": "I think the guy was absolutely strange, but I don't believe he was a pedophile. Obviously I have no idea, as I wasn't there, that's just what I think.",
   "created_utc": 1691357090,
   "score": 20,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3xlms",
   "message": "Thought it was proven by his victims describing the \"vitilago\" or w.e it's called on his penis / scrotum.\n\nThey slept in the same bed and he showed them dirty mags,  FYI.",
   "created_utc": 1691374271,
   "score": 6,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv452cr",
   "message": "I mean he did have an amusement park at his house 🤷🏻‍♂️",
   "created_utc": 1691378081,
   "score": 3,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv47yfl",
   "message": "I think he was asexual but had a messed up life because of his father.",
   "created_utc": 1691379641,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3snle",
   "message": "He was an adult man with hormones and a sex drive. Dude got boners. He had a child-like mind so he was happiest surrounded by children. Dude molested kids, fuck it’s so damned obvious. \nI don’t listen to his music and if it comes on I just ignore it. Fuck that guy, his horrible father, and brainwashed family.",
   "created_utc": 1691371875,
   "score": 8,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3hm78",
   "message": "I stopped listening to the MF.\n\nKids dont lie about that sort of thing.\n\nbelieve the children.",
   "created_utc": 1691366651,
   "score": 7,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3vtj6",
   "message": "they were true. you should read the case files. MJ had a skin condition vitiligo which he was desperate to hide so he bleached his skin many times until it couldn't be seen above his clothes. reports of the children that accused him of molesting them says that they identified this condition since they saw him without his clothes and that is why they collected photographic evidence of his genitals and unclothed body for the investigation. they couldn't have known that he had it unless he undressed in front of them. there is just too much evidence that he was guilty to think he wasn't.",
   "created_utc": 1691373406,
   "score": 3,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3b8oa",
   "message": "All these people saying \"Yes.\" Even though there's video proof, one of the kids grew up and said it didn't happen and that their mum just wanted money? \n\nI believe he may have been behaving inappropriately but not in a perverted or malicious way.",
   "created_utc": 1691363726,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv39eqa",
   "message": "I won’t say \"he’s a full blown child molester\" but he’s definitely not 100% innocent and people who believe he’s completely innocent are ignorant.",
   "created_utc": 1691362892,
   "score": 12,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3zx6t",
   "message": "Personally I never believed it. I heard the production company that made Leaving Neverland was sued for editing interviews to push their agenda and they lost the lawsuit. Everyone that knew him closely is in disbelief. I think there are obviously some mental health issues that were neglected and it led to him preferring friendships with children rather than adults. Yes it's weird that he had sleepovers but there were details that were left out...  they say the parents were there in the room as well and nothing was ever reported until Michael stopped helping them with rent and car payments and shopping sprees. It's all sad and weird and nobody really knows what happened. To me it just seems like shitty people trying to take advantage of a mentally ill millionaire",
   "created_utc": 1691375421,
   "score": 254,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3ycyb",
   "message": "Don't know. Don't care. \n\nHis music defined a generation. And I still enjoy it.",
   "created_utc": 1691374643,
   "score": 253,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv39oop",
   "message": "It’s known fact now.",
   "created_utc": 1691363017,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3o23k",
   "message": "I'm not denying that Michael was a strange man and that it doesn't look good for him, but I firmly believe he was innocent of the allegations. The first accuser, Jordie Chandler, denied that Michael had ever been sexually inappropriate towards him until his father (a dentist known for supplying celebrities the good drugs) drugged his son into \"admitting\" that Michael had molested him. [This video](https://youtu.be/-_452akeOkU) is a recording of Evan Chandler planning to accuse Michael of molesting his son.\n\nAdditionally, it's a known fact that the accusations which brought him to trial were from a family known to harass celebrities and falsely accuse people of sexual assault. She had previously falsely accused a JC Penney employee of assault, lied under oath, and was later convicted of welfare fraud. George Lopez, Jay Leno, and Chris Tucker all testified to the Arvizo family's predatory nature.\n\nAdditionally, Macaulay Culkin has always maintained that Michael never abused him, and Wade Robson himself originally testified to Michael's innocence.\n\nEvery accuser has not only had credibility issues, but also financial issues which would motivate them to go after the easy target, the immature and naive man-child that people would believe anything about",
   "created_utc": 1691369660,
   "score": 2,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3f5sg",
   "message": "What year do you think this is",
   "created_utc": 1691365517,
   "score": 3,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3fpb1",
   "message": "I don't believe that they're true, but I do think it's possible that they could be. With him admitting to sharing his bed with children, though, he did make himself an exceptionally easy target. All it takes is for a parent of one of these children to put a little bit of an extra spin on it and you could wind up with a few extra million dollars. I believe in the love of money and the ugliness that it can bring about.",
   "created_utc": 1691365764,
   "score": 252,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3nu3x",
   "message": "Overall I think he just enjoyed the happines of the kids around him. He was enjoying the moment with them, maybe he worked so hard as a child that he didn't experience a normal childhood and that was his coping mechanism. Overall, I believe he wasn't doing any of that of which he was accused. If michael was a women, most people would have looked at it as awelsome.",
   "created_utc": 1691369556,
   "score": 253,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3o4kl",
   "message": "Bestie that was 15 years ago\nDon't you mean : were true?",
   "created_utc": 1691369693,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3ufhk",
   "message": "Yeah I think they're true, but people don't care because music.",
   "created_utc": 1691372737,
   "score": 5,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv46bkd",
   "message": "Seems a little odd to be starting a dialogue on a dead man, and not on the current living rumored pedophiles.",
   "created_utc": 1691378744,
   "score": 255,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv46dat",
   "message": "I remember a talk show interview with Lisa Marie not long after her divorce from Michael. She talked about the brief period they were married.  The one thing that stood out was she said she'd overheard Michael talking in a deeper male voice multiple times when engaged in business calls. She called it a normal male voice.\n\nIf there's anyone who had no reason to lie it'd be her. What would she possiblly have to gain? Anyway, if he deliberately adopted a falsetto and hid his real voice, he could definitely be hiding other things. He was an amazing artist, but deeply fucked up.",
   "created_utc": 1691378770,
   "score": 3,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv46vha",
   "message": "I watched Leaving Neverland and I feel for Wade and James.\nI 100% believe with no doubt that MJ was a pedophile. He just had the money and fame to hide it.",
   "created_utc": 1691379042,
   "score": 3,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3kwvw",
   "message": "Honestly at this point I think he was just a severely mentally traumatized person that had reverted to a child like state. He was so out there and nobody was there to help him. I’m open to believing he was just that messed up he really did just think of himself as a child.",
   "created_utc": 1691368175,
   "score": 252,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3c6g1",
   "message": "I think he had a good heart and grew up in a messed up situation. I really don’t believe all that though for some reason. He may have seemed weird, but anyone would if they spent their entire lives in the spot light.",
   "created_utc": 1691364155,
   "score": 248,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3lfoh",
   "message": "There’s a documentary I watched called square one that talks about the initial accusation. The doc seeks to discredit the first accuser by showing that the first accuser’s dad had made threats to end Jackson’s career. He was a deadbeat who suddenly wanted to see his son after his ex and son befriended MJ. After being granted a visitation weekend the dad kidnapped him for months where his lawyers former secretary testified that the dad, son, and lawyer would spend hours a day crafting a testimony until the young boy went from “Michael did nothing” to “Michael did this this and this”.\n\na woman also interviewed in the doc claims she worked with the first accuser, who was now grown up, (she was the only one who knew he was the first accuser) and was in a meeting with him when Jackson was announced dead. The meeting (according to her) turned into a “do you think he really did it?” Conversation and she claims he said “no he didn’t”\n\nAt the end of the day he was acquitted and we’ll probably never know if he did it or not. He was either a monster who hurt children or he was innocent, albeit very strange, and had his legacy tarnished for no reason.",
   "created_utc": 1691368418,
   "score": 253,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3tn49",
   "message": "Bro, i never ever ever got that vibe. Tbh i feel like his father groomed him for stardom,bso he had a public persona and his real life. I think all he ever wanted was to be a kid again and for other kids to have great memories. The sleeping in the bed thing is weird but who knows!",
   "created_utc": 1691372355,
   "score": 253,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3udmz",
   "message": "I remember the trial. Kids who never met told the same stories.\n\nI think he should have been found guilty.",
   "created_utc": 1691372712,
   "score": 4,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3tbht",
   "message": "How many times will this be brought up omg….. throughout the years before/during/after his passing this conversation has been tired tf out. My god, i dont know but damn ive seen this brought up so much😱",
   "created_utc": 1691372199,
   "score": 253,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3rfz8",
   "message": "At this point, nobody's opinion matters. He could've been innocent or guilty. But his music is forever. And will be emulated for years to come. So love him or hate him, he's Michael Jackson.",
   "created_utc": 1691371288,
   "score": 255,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3ssp2",
   "message": "If you have any critical thinking skills at all: yes. But the brainwash and delusions with this one is deep",
   "created_utc": 1691371945,
   "score": 3,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3vjaf",
   "message": "I absolutely believe he was a creep, groomer, and molester. 100% certain.",
   "created_utc": 1691373268,
   "score": 2,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3arww",
   "message": "oF course THEY ARE, you dunce. -\\_-",
   "created_utc": 1691363513,
   "score": 253,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3cjvf",
   "message": "I believe he likely acted inappropriately, but not sexually or illegally. \n\nAnd while ONLY sleeping in the same bed with another person's child is creepy and shouldn't be done, there's nothing illegal about it, and it probably didn't cause any trauma for the kids. IIRC, several of those kids have come out, saying they actually enjoyed it and that it was fun and harmless.",
   "created_utc": 1691364327,
   "score": 249,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv2wbis",
   "message": "What's a mole station",
   "created_utc": 1691357097,
   "score": 244,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3krrs",
   "message": "Probably but there is no way knowing the actual truth.",
   "created_utc": 1691368110,
   "score": 254,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3lkob",
   "message": "I dont believe the rumors. He was certainly awfully close with kids, but as others said I would rather take it as stunted development as him having sex or being in other ways inapropiate with them. It was more that Kids were easier to be trusted than adults.",
   "created_utc": 1691368484,
   "score": 255,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3u2wh",
   "message": "OP must be young. \n\nHe’s 10000000% guilty",
   "created_utc": 1691372568,
   "score": 2,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3uce5",
   "message": "I remember the trial. Kids who never met told the same stories.\n\nI think he should have been found guilty.",
   "created_utc": 1691372695,
   "score": 2,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3ntkz",
   "message": "Absolutely",
   "created_utc": 1691369549,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3p1sc",
   "message": "100%",
   "created_utc": 1691370135,
   "score": 2,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3wjpx",
   "message": "I think they're true but he was functionally a child and it's just the tip of a very fucked up iceberg that the public wouldn't even want to reconcile.",
   "created_utc": 1691373758,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3xhvc",
   "message": "He’s dead so idc.",
   "created_utc": 1691374220,
   "score": 255,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3yh1n",
   "message": "He made Thriller…Thriller 🥲",
   "created_utc": 1691374699,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3zwpo",
   "message": "All I know is that Macauly Culkin has said that Michael Jackson never did anything inappropriate with him at all and he was just very childlike. And they remained casual friends as Macauly aged until Michael's death. I don't think he has any reason to lie about it",
   "created_utc": 1691375414,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3bue7",
   "message": "I saw the Jackson Five and Little Michael Jackson at the Indiana State Fair in maybe 1974,  it was a great show,  he was wearing a gold sequined vest, and could he ever dance!",
   "created_utc": 1691364004,
   "score": 251,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3ksdn",
   "message": "Probably but there is no way knowing the actual truth.",
   "created_utc": 1691368118,
   "score": 253,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3hloy",
   "message": "It's possible but seems slightly unlikely. He's dead so it doesn't really matter now",
   "created_utc": 1691366645,
   "score": 250,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3e80m",
   "message": "Whatever happened may have appeared to be grooming but the guy was virtually a child himself. I think his behavior reflected an immaturity and not giving a single care as to how his behavior would be construed by the rest of society.",
   "created_utc": 1691365089,
   "score": 251,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv348f6",
   "message": "Thriller is such a banger I don't care if Wade Robinson had to get touched a little in the process",
   "created_utc": 1691360547,
   "score": 239,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3rxiw",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3qmqs",
   "message": "I’d like to point out that although MJ had a disturbed upbringing there is no evidence that childhood abuse leads to becoming an abuser. The rate of abusers with a history of being a victim is lower than among abusers with no prior history.",
   "created_utc": 1691370893,
   "score": 253,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv38bcg",
   "message": "Probably true, but too many great songs to cancel him",
   "created_utc": 1691362396,
   "score": 246,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3ewyf",
   "message": "I haven't the slightest clue. I was a kid when all that was going on and I'm not enough if a fan to follow such things.",
   "created_utc": 1691365405,
   "score": 251,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv2wj4q",
   "message": "I think. Who cares heis dead.",
   "created_utc": 1691357187,
   "score": 245,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3uqpj",
   "message": "I don’t know if he ever touched a kid but if he did I think it’s probably because his childhood was kinda taken from him. Tbh I feel bad for him. R.I.P.",
   "created_utc": 1691372887,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3xmcd",
   "message": "Just lose it, aaah aaah aaah aaah aaah!",
   "created_utc": 1691374280,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3ypaf",
   "message": "I never thought they were true. I know he was messed up mentally though. Lisa Marie said a number of years ago (before she too died) that she tried to steer him in the right direction but he couldn't see it. I'm sure his upbringing was the core reason.",
   "created_utc": 1691374812,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3yrxv",
   "message": "Probably bullshit.",
   "created_utc": 1691374849,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv3zyyo",
   "message": "Ae. Not ea.",
   "created_utc": 1691375446,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv42817",
   "message": "Hell ya. Elvis and arrow Smith were too",
   "created_utc": 1691376596,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv42a2g",
   "message": "Deadass true.",
   "created_utc": 1691376627,
   "score": 5,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv42ffb",
   "message": "I don't know. But why the parents let their children stay over with a stranger is ridiculous",
   "created_utc": 1691376704,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv43ctc",
   "message": "Look at Macauley Culkin. Something happened to that boy. He denies it, but maybe because he doesnt want the world weighing in on it. He is an addict and he says he drinks because if he didnt he would be doing something worse.",
   "created_utc": 1691377186,
   "score": 3,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4422e",
   "message": "I'm seriously not sure. Macauley Calkin came out during his divorce from his parents and plainly stated that they tried to force him to say Michael molested him when Michael had never done such a thing to him.",
   "created_utc": 1691377549,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv442li",
   "message": "Who the fuck really knows. All I know it’s that with that kind of money he was worth…and the money he could generate he was absolutely a target. He was surrounded with yes people who were on the payroll and didn’t want to rock the boat and tell him anything he didn’t want to hear. He was investigated for years intensely and nothing would stick. Concretely. So possible? Yes. Proven? No.",
   "created_utc": 1691377556,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv44m95",
   "message": "Who knows, who cares.\n\nIn the end everyone that got even near him was after his money. So I don't doubt for a second that every single one of them, including his hardcore fans, would do anything to get either him or his money. That would include saying things that are not true and will cause severe problems. So however you look at it, that mess wasn't going to end well whether he is guilty or not of those accusations. People are vile and greedy, specially if you place them near money. Which is pretty much the same as toilet paper, but oh well.",
   "created_utc": 1691377841,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv453wy",
   "message": "What a timely question. Should we also stop to debate if OJ did it?",
   "created_utc": 1691378103,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv45kr5",
   "message": "No, proven not guilty. However, yeah he was weird and not super appropriate",
   "created_utc": 1691378351,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv45rk5",
   "message": "I don’t care how rich I got, I would never pay $25M to\nsomeone who was lying on my name.",
   "created_utc": 1691378450,
   "score": 3,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv470a9",
   "message": "No, I don’t think they were true.",
   "created_utc": 1691379114,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv47svq",
   "message": "100%",
   "created_utc": 1691379556,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv48ckl",
   "message": "He has books of naked young boys that screams  pedophile to me",
   "created_utc": 1691379864,
   "score": 11,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv48nnj",
   "message": "There’s plenty of testimony that backs up what we all knew - his relationship with children was wildly inappropriate. Abused children become abusers. It’s a shame the way he way treated growing up, but he absolutely should have been stopped and faced consequences. As should the parents that sent their sons to sleepovers with a grown man.",
   "created_utc": 1691380041,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv496bs",
   "message": "i dont, i think he's part of a successful targeted smear campaign",
   "created_utc": 1691380328,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv496rz",
   "message": "I just don't know. I think Michael had the mind of a child and was somehow stunted in his emotional development. Which could be why he enjoyed spending so much time with children. \n\nBut I really don't know.",
   "created_utc": 1691380334,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4a9v3",
   "message": "Michael sucked the precum off that boys dick.",
   "created_utc": 1691380949,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4adhf",
   "message": "I believe it completely. Regardless of whether or not any sexual abuse took place, and I think it did, his relationships with these children were extremely inappropriate. His behavior with young boys would not be tolerated so long if he were at his peak today. If it were a neighbor or pizza delivery man who behaved as he did with children, the same benefit of the doubt would not be extended.",
   "created_utc": 1691381006,
   "score": 2,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4arcc",
   "message": "I don’t like to think about questions that cannot be proven. If I wasn’t there and there’s no absolute hard evidence, both perspectives exist simultaneously so I prefer to just think of Micheal as the man he was on stage.",
   "created_utc": 1691381227,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4b9rz",
   "message": "MTV's Kurt Loder confirmed it. That's good enough for me.",
   "created_utc": 1691381532,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4cdle",
   "message": "If he was anyone else and had this amount of accusations against him almost everyone would accept that he had molested children. \n\nBecause people love his music and grew up idolizing him they simply cannot accept it.",
   "created_utc": 1691382202,
   "score": 1,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4f2x5",
   "message": "I believe he was definitely an abuser and was probably abused himself as a child.  I don't know why but often people who were abused themselves become abusers.  This is ok not my opinion and could be wrong.  People that don't know him but love his music need to stop saying it's all lies, people trying to take his money.  Just because you're a fan doesn't always mean it's a good person.",
   "created_utc": 1691383899,
   "score": 2,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4f33z",
   "message": "I believe the accusations are true. The documentary leaving never land was an eye opener for me. If anyone hasn’t watched it yet, I recommend it.",
   "created_utc": 1691383903,
   "score": 2,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4f56r",
   "message": "Multiple men who were confirmed to have been in his close circle when they were boys have come forward. They all have similar stories. He would find a boy who seemed vulnerable. He would “fall in love” with them. He would talk with them on the phone for hours - a grown man talking to 10 yo boys like they were dating. He would then work to separate them from the parents, eventually convincing the parents to let him take the boys on tour with him. Then the abuse would start, slowly at first. He would woo and seduce them until they were so immersed in his fame and so showered with gifts and so completely turned around that they didn’t even realize that what was happening was abuse sometimes. When they grew out of his preferred age range, they were dropped, often traumatically. Then they were left to pick up the pieces and try to figure out what the hell happened. For some, it took a long time to come to terms with the reality that this man they loved and thought loved them, who would talk to them for hours and make them feel special, was molesting and assaulting them. He would tell them they were “special friends…‘rubba friends’”- which is a sickening term for rubbing up against each other in bed. These boys felt a loyalty and a love for him, to the extent that they even defended him as adults in court. But then they had kids of their own, realized how incredibly fucked up it all was, and decided to speak out. This is not unusual for kids who were groomed over a long period of time by a pedophile. There is often confusion, guilt, shame, misplaced loyalty, denial, and an unwillingness to “betray” the abuser. If you don’t believe me, look it up. \n\nThis is a man who built a children’s amusement park in his backyard. This is a man who admitted multiple times on camera to spending the night with other people’s kids in his bed. This is a man who multiple families testify would come over to their homes just to spend the night with their children. He *was not* reliving his “lost childhood.” He was clearly and transparently molesting children. He is a textbook preferential pedophile. Look it up if you don’t know the term. \n\nHe had alarms in the hallway leading to his bedroom. He had books featuring naked boys. He had pornographic magazines that that had children’s fingerprints in them. He was clearly grooming kids for sexual abuse by showing them pornography. \n\nEven without all of the supporting evidence, so many men coming forward and saying, “Yes, this man abused me when I was a boy” is enough for me. We have first-hand, eyewitness testimony from victims that *we know* he spent months or years having bizarrely intimate relationships with. He would hold their hands, sit them in his lap, dress them to match his outfits, and sleep with them in his heavily protected and isolated bedroom. What more evidence does anyone need?",
   "created_utc": 1691383939,
   "score": 4,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4hkth",
   "message": "I feel this - MJ is the greatest performer that ever lived, and he also abused children. They're not mutually exclusive. You can recognize his talent and genius, while also acknowledging that there were young boys who had far too much knowledge of his anatomy.",
   "created_utc": 1691385564,
   "score": 2,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4iisy",
   "message": "Yes I think their true, and yes I have a really hard time listening to his music anymore",
   "created_utc": 1691386214,
   "score": 3,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4j55i",
   "message": "Sadly,  I believe he molested kids. After Lisa Marie Priestly’s son Benjamin Keough took his own life at the age of 27 my first thought was I wondered if he was another victim of Michael Jackson. \n\nSo many things point to his guilt but the one thing that haunts me till this day is his hidden room with the stairs case lined with snitchy dolls. So much ew",
   "created_utc": 1691386645,
   "score": 3,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4co4g",
   "message": "I reckon bro had such a shitty and terrible childhood that he wanted to experience it all as an adult when he had the money to do so. He probably had some unknown at the time or unexplained mental illness, maybe he was emotionally immature and just loved being around kids. Up until his death as far as im aware there were never any actual physical evidence he abused any children. As with most high profile celebrities theres always gonna be some kind of accusation laid out before them. \nFor example, amber heard and johnny depp\n\nIn saying all that, im not excusing those celebrities who actually have abused children in some way, and gone to jail/commited suicide over it. I am saying that no one actually knows what went through MJs mind throughout all those years and leading up to his death.\n\nIm not surprised if i get downvoted or sent hate comments on this. Just my personal opinion",
   "created_utc": 1691382383,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4eiyl",
   "message": "IDK AND NO ONE CARES",
   "created_utc": 1691383551,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4f7ch",
   "message": "https://youtu.be/8hGF-QLsMQY\n\nYou can refer to this video. This video give a lot of evidence to prove that MJ did not do these things. Although it is Cantonese narration but there is English subtitles that you can refer with.",
   "created_utc": 1691383976,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4ihhr",
   "message": "I’m more interested in getting to the bottom of Jeffery Epsteins little black book of associates especially those who visited his island home. You know, the people who are still alive and still very likely abusing kids. \n\nMichael Jackson will never have a day in court, for better or worse. Investing in that will only sate peoples curiosity which is less important than actually helping victims and prosecuting perpetrators.",
   "created_utc": 1691386188,
   "score": 0,
   "submission_id": "15k133x"
  },
  {
   "comment_id": "jv4oifv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15k133x"
  }
 ]
}