{
 "submission_id": "15k6e0c",
 "title": "What is the hardest lesson you’ve had to learn?",
 "selftext": "",
 "created_utc": 1691370934,
 "permalink": "/r/AskReddit/comments/15k6e0c/what_is_the_hardest_lesson_youve_had_to_learn/",
 "score": 62,
 "url": "https://www.reddit.com/r/AskReddit/comments/15k6e0c/what_is_the_hardest_lesson_youve_had_to_learn/",
 "comments": [
  {
   "comment_id": "jv3top5",
   "message": "sometimes, your best isn't good enough.",
   "created_utc": 1691372376,
   "score": 174,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3u81j",
   "message": "No one is gonna do it for you, you have to do it yourself",
   "created_utc": 1691372637,
   "score": 101,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3v5su",
   "message": "Sometimes doesn't matter what you do or how you treat someone, they just don't care, it'll never be enough. You can't force love. It hurts but that's it.",
   "created_utc": 1691373086,
   "score": 65,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3v8k1",
   "message": "That your parents are not invincible.",
   "created_utc": 1691373123,
   "score": 63,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3xim1",
   "message": "You can do everything right and still lose, and it just is what it is.",
   "created_utc": 1691374229,
   "score": 82,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3ugwg",
   "message": "Everything ends, enjoy the present and cherish those around you right now, don't live for the future (to a degree).  Appreciate when people spend time with you and value yours as well, time is the most precious thing we can give or receive.",
   "created_utc": 1691372757,
   "score": 66,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3ue0k",
   "message": "Most people only have their best interests in mind",
   "created_utc": 1691372717,
   "score": 24,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3x99d",
   "message": "Stop depending on people , be okay with being alone. Don’t rush into things and expect someone to fulfill your needs be satisfied with yourself before trying to love anyone else.",
   "created_utc": 1691374102,
   "score": 25,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3ybt7",
   "message": "Just cause they are family, doesn't mean they don't value money more than your life.",
   "created_utc": 1691374627,
   "score": 22,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv40r35",
   "message": "You can trust very few people in this world.",
   "created_utc": 1691375842,
   "score": 17,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3rq3v",
   "message": "Tuck it first , then zip.",
   "created_utc": 1691371425,
   "score": 15,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3qxf2",
   "message": "that young relationships will not likely not last!! just enjoy your time together. yall are young and dont realize how big the world really is.",
   "created_utc": 1691371037,
   "score": 40,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3wuyh",
   "message": "You can give people the benefit of the doubt all you want, BUT, not everyone has good intentions. Not everyone even has neutral intentions. Some people (more than you would think) have bad intentions against people who have done them no harm. Maybe even against people who have done right by them. And they will never willingly admit, own up, take blame etc. for those intentions. Once YOU have seen their true colors, trust their actions not their words. Bc they won’t admit to having it out for you. And if you don’t trust what they’ve shown you about their true intentions, you’ll end up getting backstabbed and betrayed again and again.",
   "created_utc": 1691373911,
   "score": 13,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv444mv",
   "message": "Not everybody gets a happy ending",
   "created_utc": 1691377586,
   "score": 12,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3x1se",
   "message": "Ignored very obvious signs of a serious eye issue.\n\nIt turned out that my retina had detached. Unfortunately, I got stuck with a horrific, incompetent surgeon who was unable to fix it, and now I have lost the vision in that eye.\n\nI try and forgive myself for not going to the hospital, because I was also finishing up treatment for breast cancer. I was not in a good frame of mind. \n\nHowever, I had a gut feeling, and I completely ignored it.",
   "created_utc": 1691374003,
   "score": 11,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3tfwk",
   "message": "Feelings are not truth. \n\nSo if someone makes you feel good, it doesn't make them right. \n\nIf someone makes you feel bad, it doesn't make them wrong.",
   "created_utc": 1691372259,
   "score": 23,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv49zm4",
   "message": "That life moves on no matter how sad/bad you feel about a situation",
   "created_utc": 1691380787,
   "score": 12,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3r4ez",
   "message": "You can only depend on yourself. All friends and family will leave and/or hurt you in the end. Life is doomed from the start.",
   "created_utc": 1691371133,
   "score": 21,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3u4e1",
   "message": "Responsible credit card use.",
   "created_utc": 1691372588,
   "score": 13,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3rjcc",
   "message": "Don't get in trouble at Disney World. Not me, but there was this guy back in October of 2021 that my wife and I saw at the park. Idk if he was drunk, high, or all of the above but it was wild. He pulled down his pants while approaching Goofy, turned around, spread his butt cheeks apart and shouted at the top of his lungs, \"MAKE IT MAGICAL FOR ME!!!\" I have never seen security get called and escort a man away so quickly in my life. I only half believed what I saw until I saw somebody else post about in around the time it happened on the WDW subreddit.",
   "created_utc": 1691371334,
   "score": 14,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3xb3p",
   "message": "Everything you do and everything you don't do, has consequences.",
   "created_utc": 1691374128,
   "score": 6,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv46hnx",
   "message": "Financial  responsibility was the hardest, though rewarding when you get it under control.\n\nA secondary that I've seen be difficult for close friends is to learn to be able to be happy by yourself. Others can increase your happiness, but you shouldn't depend on anyone for it. This is possibly the best advice I could give someone that's looking for a relationship.",
   "created_utc": 1691378833,
   "score": 6,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4730n",
   "message": "You don’t know everybody intentions.\n\nLetting go of what happened.\n\nCan’t trust everybody\n\nEverybody’s not better than you",
   "created_utc": 1691379156,
   "score": 6,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3rcdt",
   "message": "that being a parent is not easy at all. let alone a single parent.",
   "created_utc": 1691371240,
   "score": 15,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3rb1m",
   "message": "Not sure, but I love a challenge!",
   "created_utc": 1691371223,
   "score": 6,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3uimz",
   "message": "Life isn’t fair",
   "created_utc": 1691372780,
   "score": 6,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3tal0",
   "message": "The people you love and would be there for don’t always have your back",
   "created_utc": 1691372187,
   "score": 8,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3xlkd",
   "message": "No one's coming to save you.",
   "created_utc": 1691374270,
   "score": 4,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv44hku",
   "message": "\nLife",
   "created_utc": 1691377772,
   "score": 4,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv451ua",
   "message": "Don’t put your happiness in other people",
   "created_utc": 1691378073,
   "score": 3,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv452wu",
   "message": "College algebra. It took me 5 years, and that's including summer semesters, to pass. And I only passed by the skin of my teeth.",
   "created_utc": 1691378089,
   "score": 4,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv46jao",
   "message": "You don’t get what you deserve, you just get what you get.",
   "created_utc": 1691378857,
   "score": 4,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3sxhf",
   "message": "It does come from the Bible but it's still very much relevant to even non believers: don't cast your pearls before the swine",
   "created_utc": 1691372010,
   "score": 8,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3wjbz",
   "message": "Flammable and inflammable mean the same.",
   "created_utc": 1691373753,
   "score": 5,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3y2kz",
   "message": "Other people’s opinion of you is none of your business",
   "created_utc": 1691374502,
   "score": 6,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv40ex7",
   "message": "Looking out for others without prioritizing yourself",
   "created_utc": 1691375671,
   "score": 3,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv41oja",
   "message": "Letting go",
   "created_utc": 1691376319,
   "score": 3,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv42f0t",
   "message": "Effort and success are not the same thing.",
   "created_utc": 1691376698,
   "score": 3,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv46iby",
   "message": "Sometimes it just doesn’t pay off to be the nice guy.",
   "created_utc": 1691378842,
   "score": 3,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3ufaj",
   "message": "Fear can't control you. Time won't stop to wait while you find a way to conquer it.",
   "created_utc": 1691372735,
   "score": 3,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv421k2",
   "message": "Time waits for no one",
   "created_utc": 1691376504,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv48d9q",
   "message": "It's a good thing life isn't fair. If it was fair, it would mean all the bad things that happened to you happened to you because you deserved them.",
   "created_utc": 1691379876,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv49ixp",
   "message": "That alcohol is extremely bad for me.",
   "created_utc": 1691380521,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv49k3c",
   "message": "You do your best , and its like \"thats it?\" Don't try to  impress others,  impress yourself! Only YOU  know what it took, your opinion is the most important",
   "created_utc": 1691380539,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv49mdb",
   "message": "Letting go of the past and what could have been",
   "created_utc": 1691380576,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4a3an",
   "message": "Love is conditional",
   "created_utc": 1691380845,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4boff",
   "message": "That other people's  bad choices can drag you down.",
   "created_utc": 1691381778,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4bq7a",
   "message": "Warning, this is a sad story, so please move along if you don’t want to hear that \n\n￼I am 18 years old female ￼. I got disowned by my abusive dad, 4 to 5 months ago. \nLet me start from the semi-beginning I was born in the UK and lived here until I was seven years old when we left the country \n\nI didn’t see what was coming every time \nWhen we were still in England, ￼ he was abusive, physically, and mentally ￼ If we screamed, he would hurt us, ￼￼even harder, so he groomed us to be quiet, even though I was in pain ￼ he made saw that we could never go to people for help made us feel worthless. This made us feel like there was ￼￼no ￼way out. ￼\n\nEvery time he came home we were terrified, ￼ I would do nothing when I say nothing. Nothing he will come and hit me and pull my hair. He will take it out on me even more I was bruised everywhere he made, so not to touch my face, but somehow I still had blood in my mouth \n￼ \n￼￼\n\nI and my two older sisters had it the hardest, ￼so when I was seven years old when we moved ￼to my parent's home country that when it got harder \n\n\nI got tortured ￼and Locked in the dark. I almost died many times by his own hands. Even I don’t know to this day how I made it out alive.\n\n￼ when I was ￼ 11 or 13. I constantly wanted to die because of all the abuse, I was always scared, and terrified to do anything wrong even then I was hurt. I don’t know what I do wrong but he still hurts me saying I did ￼￼ something wrong but I don’t know what I did wrong \n\nAt the time that was the only way I thought I would be free now I know ￼If I take my own life he wins at the end of the day. I would never do it now that I’m older even if ￼I am just 18 ￼\n\n I wasn’t allowed to make friends because he was scared they will find out. So he made so I don’t speak. Every time I said anything to anyone here with us slap me hit me torture ￼ me for hours. ￼\n\nSo I was basically mute but I was in a different country, so people assumed I’m mute because I didn’t know the language \nThat’s true I didn’t know the language, but even if I did, I wouldn’t be able to speak ￼I only knew English at the time. \n\nHe will send me to people to do free labor coming home, exhausted but he would not let me go to sleep. He says there’s more to do. why would I have a daughter if I can’t use her? \nI was always terrified for years. I even became paralyzed in half of my ￼face. \nThen I found my opportunity to go ￼to England. \n\nHe wanted the younger kids to learn English. So we moved back to England when I was 17 years ago ￼ the first month the abuse ￼was a bit less, cause he was scared the police will find out because the youngest kids could speak out \n￼but he was still abusing us older ones. But we knew that if we didn’t act now we could potentially never have another chance cause the plan was to move back to our parents country by the end of the year￼￼\n\nsomething happened and my sister ￼ ￼blurted out ￼\nshe will call the police on him if he didn’t take his hand off of her so he hit her pulled out her hair and kicked her out of the house at 3 AM she was too scared to go to the police \n\nyeah, and he took all of her money he left with nothing luckily she had an at the time it was her fiancé that she kept in secret he let her stay in his apartment and he went to sleep with his friend at the apartment, and then the all the abuse that was going to my sister came 10 times stronger to me because I was the last older sister he made me sleep on the floor. \n\nHe kicked me every time he walked by ￼ and every time he walked by he said how he wanted to kill me. Says how he hopes I’m dead ￼￼￼ \npull my hair most of my hair was ripped out I had a broken rib then he was continually punching me and I blurted out. I will call the police if you don’t stop I was out of the house that night at 4 AM. Luckily I had a secret friend because we weren’t allowed to make friends. She helped me and took me to her home. If it wasn’t for her, I would’ve been on the streets ￼￼\n\nI was too terrified to do anything ￼ because I was always ￼ in a box and couldn’t communicate with people I was scared of everything never been alone but I knew that anything is better than the way I was living \n￼\n￼ ￼ because I didn’t report it when I was freshly out of that house ￼I didn’t have any proof didn’t have any pictures of all the bruises ￼I  had no proof of anything that happened.\n So there was nothing that the police can do cause I didn’t report it at the time \nbut I was terrified I was scared, \n￼, oh, I didn’t mention ￼he made sure to take all my money before he kicked me out. \nHe didn’t leave me a dime. \nLegally, I’m homeless I went to the council ￼for help. They open the case closed. It opened it closed it ￼They don’t help at 18 years old. Legally, I’m not a minor. So they told me to go back home. Told me to go ￼listen to your parent's And I explains it was domestic violence. Didn’t listen to me they don’t believe me a18 years old. If I was a minor things would be different but that’s how it is. \nI had to drop out of school I love school. I wanted to be something one day maybe I still have time but I don’t know. \nAnd on top, I’ve gotten sick like sick sick I have heart problems I’ve been in and out of urgent care four times in the past month. The doctors are not helping me either ￼my mom says it was probably from all the abuse I got\n\nMy mom is a sweetheart that I don’t mention she’s terrified she is still in that abusive ￼ relationship and she comes from a culture that she has no escape from. so yeah that’s my life so far hoping it gets better. I try to do the ￼ s I can. I put a smile on even when I’m sad. I’m getting no help from the government so I’m on my own ￼ I have to try to do everything on my own but I am tired to I am truly tired no only physically I’m sick but I’m getting no help at all from the government, so yeah plus wanted to to tell my story because I never could befall to thank you for listening if you got this far ￼ Search the hardest lesson I had to learn, is to stand up for myself",
   "created_utc": 1691381808,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4cem5",
   "message": "Don’t cry over people who aren’t crying over you",
   "created_utc": 1691382219,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4cjbj",
   "message": "That you're wrong",
   "created_utc": 1691382299,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4ct2m",
   "message": "Always always always pay attention to their actions, not their words.",
   "created_utc": 1691382470,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4d3h9",
   "message": "Sometimes bad things happen to good people",
   "created_utc": 1691382650,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4dgpa",
   "message": "Just because your nice doesnt mean people are going to be nice back",
   "created_utc": 1691382880,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4diao",
   "message": "No one is coming to rescue you, you have to do that yourself.",
   "created_utc": 1691382908,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4e82n",
   "message": "Some mistakes are unrepearable",
   "created_utc": 1691383360,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4eopp",
   "message": "There's no shame in asking for (and accepting) help.\n\nI still struggle with this.",
   "created_utc": 1691383651,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4f21y",
   "message": "time will not stop because i’m sad or depressed. the world will move forward regardless if i move forward or not.",
   "created_utc": 1691383884,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4gkhm",
   "message": "That anybody can be mean to you for no reason 😢",
   "created_utc": 1691384878,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4i9dr",
   "message": "Not everyone in your life will stay",
   "created_utc": 1691386029,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4mpj2",
   "message": "Partial differential equations. Kicked my ass in grad school.",
   "created_utc": 1691389238,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4s4ca",
   "message": "Don't trust people too much. \n\nI actually revealed my biggest fear in Middleschool, it was used against me combined with bullying...\n\nBad memories, a genuine fear to go to school or even leave my home, not much sleep in the nights...",
   "created_utc": 1691393473,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv531bm",
   "message": "ITT: People, or bots, dropping motivational quotes they’ve seen on IG.",
   "created_utc": 1691402375,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3s89n",
   "message": "When I finally quit porn and jerking it and saw my erections at their full potential.",
   "created_utc": 1691371668,
   "score": 3,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3zaq2",
   "message": "Someone who really loves you, won't ask you for money.",
   "created_utc": 1691375109,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3zc4p",
   "message": "It's OK to say No at work.  Managing priorities and timelines is pretty much impossible without saying No from time to time.",
   "created_utc": 1691375128,
   "score": 2,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4ax5l",
   "message": "You can't always trust your parents.",
   "created_utc": 1691381322,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4btmn",
   "message": "That true love doesn’t mean anything",
   "created_utc": 1691381866,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv40n1h",
   "message": "Credit cards aren’t free money",
   "created_utc": 1691375785,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv43j44",
   "message": "Love isn't unconditional",
   "created_utc": 1691377277,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3u104",
   "message": "That someone can say they love you, always will and will never leave you but they can change their mind. Believing that ended up in me having a broken heart",
   "created_utc": 1691372543,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3x5ai",
   "message": "Years of working on it, I still have anger issues\n\nHowever what sparked that lesson, also sparked a few other.\n\nNo matter how good it's going, and how hard you worked to get there. It can quickly all go away\n\nYou have to keep going. It might fucking suck, it might fucking suck for a long time, but the world won't wait for you. By the way, it's been a little bit over a year, and it's still a sore but fond spot. I miss you guys, and here's to you!",
   "created_utc": 1691374049,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3xxg2",
   "message": "Dont stretch your penis, it will destroy your life",
   "created_utc": 1691374431,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3yi16",
   "message": "That some things even if they are a danger to you , you can’t do anything abt it, you can’t report or talk abt it to anyone bc it’ll only get bigger.",
   "created_utc": 1691374713,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv3ytwk",
   "message": "Watch your back because you’re on your own.",
   "created_utc": 1691374876,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv40v6f",
   "message": "The Road to Hell is paved with Good Intentions\n\n\u0026amp;#x200B;\n\nits aactually like a horror  movie if you truly experience honestily trying your best, doing the right thing, and horrific life changing terrible things happen that no matter what u do u can't prevent and know u will have to live with the consequences and aftermath the rest of your existence\n\n\u0026amp;#x200B;\n\nthis is not the same as having bad things happen, I mean, you practively acted to accomplish a goal and it became a nuclear bomb in your life, if you hadn't tried to do this \"thing\" you would'nt have had the bad outcome",
   "created_utc": 1691375899,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv45h7g",
   "message": "Join the Government or die.",
   "created_utc": 1691378300,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv45ktk",
   "message": "Communication and Coperation skills.",
   "created_utc": 1691378352,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv45p41",
   "message": "People can be really convincing liars to get something they want",
   "created_utc": 1691378413,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv47cwx",
   "message": "you can't fix others, and others can't fix you.",
   "created_utc": 1691379306,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv481s1",
   "message": "People suck",
   "created_utc": 1691379694,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv48m4f",
   "message": "If you are stressed/overwhelmed at work, make a t-chart list that consists of:\n\nWhat I Will Care About\n\nand\n\nWhat I Will NOT Care About\n\nWrite down the things you think are actually really important under the \"will\" list. Even more importantly, choose all the things you currently get stressed on but aren't important and list them on the \"NOT\" list.\n\nThen, make conscious efforts to not care about the things under your \"WILL NOT CARE\" list.",
   "created_utc": 1691380016,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv498pr",
   "message": "Trust nobody. It's a dog eat dog world",
   "created_utc": 1691380363,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv49gwr",
   "message": "“No one is going to come and save you.”\n\nThat you have to show up for yourself and become brave and fearless on your own.",
   "created_utc": 1691380490,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv49qod",
   "message": "Growing up doesn't suck, being responsible does",
   "created_utc": 1691380644,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4a2qr",
   "message": "Dealing with the mother-in-law, I ended with a “fail” but gained my piece of mind back",
   "created_utc": 1691380836,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4a371",
   "message": "The one I haven't learned yet.",
   "created_utc": 1691380843,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4aq6h",
   "message": "Don't try to be like somebody else, because then you'll never know your real self.",
   "created_utc": 1691381209,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4bmf3",
   "message": "People will always look out for themselves first. If you wait for someone to come by and advocate for you it's likely you won't get anywhere. So to get ahead in life, you have to advocate for yourself.",
   "created_utc": 1691381746,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4cuo9",
   "message": "And a close second is often times the enemy of good is better.",
   "created_utc": 1691382497,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4d4fq",
   "message": "That my body has limits, and those limits are less than what most people my age have. And that I must advocate for my needs.",
   "created_utc": 1691382665,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4djpc",
   "message": "Don’t fuck up your credit",
   "created_utc": 1691382932,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4dr1n",
   "message": "Rejection isn't a reflection of my worth or ability.",
   "created_utc": 1691383058,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4ecyt",
   "message": "You can do everything correctly and still end up a failure. Success requires effort, skill, and determination, but there is no substitute for luck.",
   "created_utc": 1691383446,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4ejnh",
   "message": "You cannot help someone who’s really not willing to truly help themselves.\n\nif they’re an alcoholic or junkie, they will continue to be so regardless how much you love, support, or finance their problem. Enabling them only hurts them by prolonging the problem.",
   "created_utc": 1691383563,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4erc4",
   "message": "You can do everything right, be the bigger person, be a *good* person and still lose",
   "created_utc": 1691383698,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4f4wb",
   "message": "How to break the cycle of generational drug abuse,mental illness sweeping under the carpet and to love raw. I must thrive.",
   "created_utc": 1691383934,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4fego",
   "message": "My happiness matters, too.",
   "created_utc": 1691384108,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4fiwp",
   "message": "the powerful do what they will, and the weak suffer what they must",
   "created_utc": 1691384189,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4fx1z",
   "message": "later doesn't always come, its ok to have long term plans but remember to live in the present.",
   "created_utc": 1691384448,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4g2q1",
   "message": "You will rarely receive good karma for making extraordinary sacrifices for others. Most of the time you simply suffer for the sacrifices you make,  and just have to rebuild your life.",
   "created_utc": 1691384552,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4gare",
   "message": "You have to keep going, or else your path will end here.",
   "created_utc": 1691384700,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4gaxv",
   "message": "The world doesn't stop because my heart is broken.",
   "created_utc": 1691384703,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4gbq7",
   "message": "sixth grade math",
   "created_utc": 1691384718,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4glb5",
   "message": "Nobody really cares about you the way you family does",
   "created_utc": 1691384893,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4gu6f",
   "message": "People don't change, they just become more and more of who they are.",
   "created_utc": 1691385061,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4gv45",
   "message": "You aren’t important.",
   "created_utc": 1691385079,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4gwwk",
   "message": "The hardest lesson has yet to be learned.  \n\n\nKinda like Homer's \"This is the worst day of your life, so far\"",
   "created_utc": 1691385113,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4gzmo",
   "message": "We aren't perfect.\nWe make mistakes. \nSo People will disappoint us.",
   "created_utc": 1691385162,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4h3ce",
   "message": "cheaters will always find a way to cheat",
   "created_utc": 1691385233,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4hjdr",
   "message": "Don’t be afraid to fail. That’s how you learn.",
   "created_utc": 1691385537,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4hq4q",
   "message": "To be careful of the situations you meet people in. Even if you mean well and wanted to help someone, some people are jealous by nature and will bring you down with them. Sometimes being “selfish” can help you in the long run.",
   "created_utc": 1691385661,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4hrga",
   "message": "Believe someone when they show you who they are the first time.",
   "created_utc": 1691385685,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4hsae",
   "message": "Also family is just a word til proven otherwise.",
   "created_utc": 1691385701,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4i181",
   "message": "Your job, love it or hate it, is not your life.  You work to live.  Please don't live to work.",
   "created_utc": 1691385871,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4i1pj",
   "message": "You can’t force somebody to make good choices. Sometimes they have to see it out and live through the consequences to truly understand",
   "created_utc": 1691385881,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4ibzk",
   "message": "You can only do so much for a person,the rest is up to them.",
   "created_utc": 1691386080,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4ij7p",
   "message": "Even if I get my ass kicked by my girlfriend, if I defend myself I would become a felon",
   "created_utc": 1691386221,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4iqup",
   "message": "In this world, there is no right, no wrong, no good or bad. There are only things that are socially accepted. You have to make the choice on what to believe in.",
   "created_utc": 1691386372,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4iraf",
   "message": "That no one gives a shit about you and there is no such thing as a friend. It's what they can get out of you.",
   "created_utc": 1691386380,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4ivha",
   "message": "*Anybody* can turn on you.",
   "created_utc": 1691386461,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4iwx6",
   "message": "That the best indicator of someone's future behavior is... their past behavior. They ain't gonna change.",
   "created_utc": 1691386490,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4j10s",
   "message": "Sometimes, relationships you think will last forever have to end.",
   "created_utc": 1691386566,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4jgjn",
   "message": "That women don't owe me anything.\n\nIn my teens and even early twenties I had a few crushes. On rejection or worse, they were interested in one of my friends more than myself I would throw a full on dick move where I would de-friend them, talk shit about them and generally act like an infant because my feelings were not reciprocated.\n\nLooking back it was epically EPICALLY cringe.",
   "created_utc": 1691386872,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4jhd2",
   "message": "That it's not the angels fault they suck at baseball they just cant help it",
   "created_utc": 1691386889,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4jji7",
   "message": "Ha! Are you ready, Reddit??\n\n*MISERY LOVES COMPANY*\n\nWhen you learn that *most* of your closest peoples *hate* to see you happy (and you realize that you came from a toxic environment, not one of the nice ones where people are actually kind to each other).\n\nYou literally feel like you’re at the bottom of a barrel.",
   "created_utc": 1691386932,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4jnbh",
   "message": "Learned how to be able to say NO whenever someone is asking to borrow money",
   "created_utc": 1691387008,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4jr3a",
   "message": "If you can roll with the punches, you get to determine your own level of happiness.",
   "created_utc": 1691387082,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4jyoa",
   "message": "No one owes you anything",
   "created_utc": 1691387230,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4k32p",
   "message": "When you get divorced, lawyer up.",
   "created_utc": 1691387315,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4kfl7",
   "message": "Sometimes the right decisions and the smart decisions are mutually exclusive.",
   "created_utc": 1691387556,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4kr0h",
   "message": "You have too see the actual person and not this great version of them you have in your head because they were nice/funny/kind when you met them.\n\nThis goes for both friendships and romantic interests.",
   "created_utc": 1691387784,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4kumq",
   "message": "You’re the only one you’ll ever have that will never leave. - Joe Charbonneau",
   "created_utc": 1691387859,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4lhvy",
   "message": "That I could not drink safely.",
   "created_utc": 1691388331,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4ll61",
   "message": "The world continues to function through deception. To deny this is to participate. Learn to identify and navigate deception and manipulation.",
   "created_utc": 1691388398,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4m20w",
   "message": "You can't \"fix\" or change anyone. Whatever they tell you or show you about themselves, accept that's what you're going to get from them.",
   "created_utc": 1691388748,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4m76b",
   "message": "That Reddit is literally the worst place to ask for advice.\n\nOh wait...I didn't need to learn that one.",
   "created_utc": 1691388855,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv4mc77",
   "message": "Self confidence. No matter how hard it is for you. You can always try and be your best or do your best but failure can happen to anyone. Don't beat yourself up over it. You can overcome any hardship and when it feels like it's too much you always have family and friends to support you.\n\nHarsh reality is family and friends don't last forever but their love and confidence in you does, and ultimately that's what they're trying to instill in you.",
   "created_utc": 1691388960,
   "score": 1,
   "submission_id": "15k6e0c"
  },
  {
   "comment_id": "jv54cdq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15k6e0c"
  }
 ]
}