{
 "submission_id": "15kamaf",
 "title": "If you knew someone was cheating on their SO would you tell their SO? Why or why not?",
 "selftext": "",
 "created_utc": 1691383649,
 "permalink": "/r/AskReddit/comments/15kamaf/if_you_knew_someone_was_cheating_on_their_so/",
 "score": 170,
 "url": "https://www.reddit.com/r/AskReddit/comments/15kamaf/if_you_knew_someone_was_cheating_on_their_so/",
 "comments": [
  {
   "comment_id": "jv4nukt",
   "message": "Absolutely. I was married for 23 years, he cheated for 7. It wasn’t until he moved on to a new mistress that the old mistress told me. Apparently quite a few people at his workplace knew. He stole years of my life.",
   "created_utc": 1691390116,
   "score": 171,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4eqzh",
   "message": "Yes, because I would want someone to tell me if I was being cheated on. Even if it’s a random stranger",
   "created_utc": 1691383691,
   "score": 200,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4pfpv",
   "message": "Yes, cheaters are among the crappiest of people and I have no sympathy.\n\nIf your needs are not being met, talk about it like an adult.\n\nIf you like the other person better, end your friggen relationship.\n\nIf you are no longer happy, talk about it, go to counseling, or end your friggen relationship.\n\nNot hard but people always seem to want to defend them.",
   "created_utc": 1691391339,
   "score": 75,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4etax",
   "message": "[removed]",
   "created_utc": 1691383732,
   "score": 21,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4jv7d",
   "message": "Hell yeah, everyone deserves the truth and cheaters deserve nothing",
   "created_utc": 1691387161,
   "score": 20,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4ffmj",
   "message": "If my friend is doing the cheating, then I tell them to get their shit together; if my friend is the SO being cheated on, then yeah I tell them. If neither of them are friends or family, I stay out of it.",
   "created_utc": 1691384130,
   "score": 37,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4tyhu",
   "message": "Yes. I’ve been cheated on and many of ours “friends” knew and didn’t tell me. I felt betrayed by everyone.",
   "created_utc": 1691394960,
   "score": 18,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5gnbk",
   "message": "Yes absolutely. My husband had an affair and I'm so angry at the years I wasted on him.",
   "created_utc": 1691411181,
   "score": 6,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4g44b",
   "message": "Nope. No one’s business and you don’t know what’s going on behind the scenes. Only exception would be for my best friends.",
   "created_utc": 1691384577,
   "score": 20,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4eunr",
   "message": "[removed]",
   "created_utc": 1691383756,
   "score": 16,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4qoq5",
   "message": "My best friend is cheating on her boyfriend and I am in a difficult position. I really want to tell him but I don’t really know him and I think it’s none of my business? But I would want to know if I was in the same position. Actually she has been cheating on him the whole time.",
   "created_utc": 1691392321,
   "score": 11,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4f8rn",
   "message": "it would highly depend on their personalities and my relationship.\n\n If they were close to me, and I knew they were devoted then yes, I would tell them. \n\n However, there are a lot of people who have open relationships or are only together for ...reasons I'm not privy too nor do I need to ask.\n\n If I certainly knew in fact that one person was being unfaithful to a devoted partner I'd probably have to talk to the partner and ask direct questions that might not go over well, and place myself in the middle of something or some-place I really have no business getting into.\n\n If I did that, I'd have to have solid proof and know their SO wouldn't be humiliated that I already knew it...\n \n Not enough info for me to know what I'd do...",
   "created_utc": 1691384002,
   "score": 7,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4fu9s",
   "message": "Nope. Either they already know, or they won't believe you. Either way, they'll resent you for bringing it to their attention.",
   "created_utc": 1691384396,
   "score": 30,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4kj5e",
   "message": "No. I got into it with some dumbass kids on reddit last night that thought because you stay out of it, your defending cheaters. Some immature mental gymnastics. \n\n\nAnyways, no. Stay the hell out of it. Might push either one of them to do something stupid if you shoot off your mouth. To you or themselves .She/he could work things out and make you enemy #1 for coming between their relationship. These people in here saying to run your mouth aren't thinking about the consequences because they think it's the righteous thing to do and that's all they see in it. And while they think it's the right thing to do they're only thinking about themselves so they can sleep at night and boost about how much of a hero they were.",
   "created_utc": 1691387627,
   "score": 5,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4evyl",
   "message": "Fuck no.  I'm not getting in the middle of that shit. I've got better things to do.",
   "created_utc": 1691383779,
   "score": 26,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4mrhc",
   "message": "Yes. You are a piece of scummy shit if you don't unless there is some kind of threat to you.",
   "created_utc": 1691389278,
   "score": 7,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4ijcn",
   "message": "Nope, not unless it's a real close friend. Then it's best to mind your own business",
   "created_utc": 1691386224,
   "score": 2,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4k0ns",
   "message": "No, it could make their relationship stronger or be something they both know and work around.",
   "created_utc": 1691387269,
   "score": 2,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4hqol",
   "message": "Nope. Their relationship is none of my business. Just like my relationship is none of theirs.",
   "created_utc": 1691385671,
   "score": 5,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4kn1k",
   "message": "Yes. If I was 100% sure, then yes. Because I would hope someone would extend the same courtesy to me.",
   "created_utc": 1691387707,
   "score": 6,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4gvrv",
   "message": "Had a roommate in college that was cheating on his GF constantly. I wanted to tell her, but I had no way of doing so. I never knew her name and he didn’t have her listed as his gf on Facebook or any pics with her on Insta. I’m hoping she wised up and ditched him eventually",
   "created_utc": 1691385091,
   "score": 3,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4rrrd",
   "message": "Of course. There should be no need to explain why.",
   "created_utc": 1691393191,
   "score": 3,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4rzuu",
   "message": "100% yes",
   "created_utc": 1691393371,
   "score": 4,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4heb1",
   "message": "Yes you tell.",
   "created_utc": 1691385442,
   "score": 3,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4yy1n",
   "message": "Nope. Simply not my business.",
   "created_utc": 1691399069,
   "score": 4,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4zrzg",
   "message": "No.\n\nNever involve yourself in other people's domestic shitfests.\n\nThat's basic 'how to human' stuff.",
   "created_utc": 1691399745,
   "score": 4,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5744q",
   "message": "No. I would keep my nose out.",
   "created_utc": 1691405421,
   "score": 4,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4g3n4",
   "message": "Hell no! Don’t want to caught up in someone’s drama!",
   "created_utc": 1691384569,
   "score": 4,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4k0cy",
   "message": "It depends on the situation. If it is just an associate I don’t know if I would. Everyone has their own dynamics relationship wise. And I think diving in without knowing them a little better in terms of boundaries, expectations, and previous rules is naive. \n\nIf it’s a friend and they cheated on their partner and it was a one time thing. I would just advise them to not do that again, and encourage them to handle it in their own way. If this friend however is a habitual cheater, having an affair etc.. I would distance myself from them. And more than likely tell their partner but anonymously. \n\nIf I found out my friend’s partner was cheating on them I would just spill the beans. Because if you are that reckless to the point I found out. Clearly you dont care for my friend’s health in any way.\n\nIf it is an individual I have told before, and the continually chose to be with said person in spite of infidelity. I probably wouldn’t mention anything. Because if you were willing to forgive it before in the past, more than likely you will in the future and that is their issue to resolve",
   "created_utc": 1691387263,
   "score": 2,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4ltcm",
   "message": "NEVER interfere with other people's relationship.  You have no idea what will happen.  I had a roofer client  who when informed his wife was cheating on him by a friend, he shot his wife and the man who was banging her.  Let the person being cheated on find out organically.",
   "created_utc": 1691388568,
   "score": 2,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4p9xb",
   "message": "Yes. I hate it when my friends are living a lie when they can just rip off the bandaid and move on with their lives. If there anything to be salvageable, it wouldn't have led to cheating in the first place.",
   "created_utc": 1691391215,
   "score": 2,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4t8kg",
   "message": "Absolutely. I feel like that would be your duty simply as a decent human.",
   "created_utc": 1691394383,
   "score": 2,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4x1j8",
   "message": "Most likely not.  For a few different reasons:\n\n1. Unless they are people that I know intimately well, I do not know enough about their situation to get invovled. Maybe there are extenuating circumstances, maybe they have an arrangment, etc.  In short, it is none of my business.\n\n2. I have a friend who is a couples therapist and her take (we have discussed this hypothetical) is \"stay out of it. You don't know the people, you don't know the situation, and you don't know what the potential consequences of getting involved could be.\"\n\n3. Personal experience.  My BIL has affairs all the time, but he and his wife have an \"agreement.\"  One of my best friends was cheating on his wife, who I also know very well. I was moritfied and upset with him.  Then he told me about the shit going on behind the scenes and without going into other people's dirty laundry, I thought, \"okay I get it now.\"  I had a GF who I was crazy about in college.  She got drunk and hooked up with some dude at a party one night very early into our relationship.  She told me about it a year or so later...honestly, at the time, I wished she would have not told me. It killed our realtionship and since an incident (rather than a long affair), I honestly could have done without knowing.   Doesn't matter now...more than 20 years ago but I remember telling her when we were splitting, \"you shouldn't have told me.\"",
   "created_utc": 1691397486,
   "score": 2,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4s3ld",
   "message": "Yes. No one deserves to be cheated on, and if said person doesnt know, I am morally obligated to tell them",
   "created_utc": 1691393456,
   "score": 2,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4i1nw",
   "message": "Yes, if I had proof. If I didn't, I'd try to get proof before sending it to them.",
   "created_utc": 1691385880,
   "score": 0,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4iez2",
   "message": "No, if its not my business I won’t care. Don’t wanna be in the middle of people’s dramas..",
   "created_utc": 1691386139,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5hdtm",
   "message": "Nope.  They won't believe you, and your relationship with them will end. Not your problem.",
   "created_utc": 1691411578,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4ny53",
   "message": "Yes. I'd tell the cheater that if they don't tell them, I'm going to. Been cheated on a few times and knowing that pain sucks ass. wouldn't want to see someone else have to go through that.",
   "created_utc": 1691390190,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4ggrg",
   "message": "No, because they probably suspect it already and will resent you for getting involved.",
   "created_utc": 1691384809,
   "score": 255,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4eufq",
   "message": "Most likely but it would probably depend on the relationship I have with the pair",
   "created_utc": 1691383752,
   "score": 0,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4f0fz",
   "message": "Case by case basis, im not telling the wife of my boss he is cheating. But I might tell on a coworker or an acquaintance.",
   "created_utc": 1691383857,
   "score": 0,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5db3z",
   "message": "Nope. Learned that lesson the hard way a couple times. Lost friends and everything. Unless theyre one of my closest friends or my immediate family who I know wont dump me when their partners try to gaslight them into thinking I’m a liar cuz I’m jealous. \n\nNot my monkeys, not my circus. As much as this site loves to expose cheaters, life is so much more peaceful when you stay out of other peoples relationship problems.\n\nMaybe this is an unpopular opinion, but I deserve my peace. The idea that I’m expected to bring drama and chaos into my life because some dirt bag decided to cheat is unreasonable and unfair. That doesn’t make me or anyone else with the same opinion a bad person.",
   "created_utc": 1691409321,
   "score": 0,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4jam4",
   "message": "No, because I'm the one she's cheating with. 😈",
   "created_utc": 1691386753,
   "score": 255,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4ks4c",
   "message": "No, because then I would be snitchin.",
   "created_utc": 1691387807,
   "score": 255,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4prud",
   "message": "Not me, not my drama.",
   "created_utc": 1691391599,
   "score": 0,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4pyip",
   "message": "No. Not my problem. I would if it was a very good friend that was cheated on, if not, not my problem.",
   "created_utc": 1691391745,
   "score": 0,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4i6y9",
   "message": "I ain't telling my wife shiiitttt",
   "created_utc": 1691385982,
   "score": 253,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4eyf4",
   "message": "Unless it's my brother. Yes I would.",
   "created_utc": 1691383822,
   "score": 251,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4jm81",
   "message": "…depends on who they both are to me.",
   "created_utc": 1691386986,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4lu31",
   "message": "Do I like or care for the person being cheated on?  Do I stand to gain something by telling the victim?  Do I dislike either of the cheating people?  Then Yes.  Otherwise no mind your own damned business.",
   "created_utc": 1691388582,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4m2jd",
   "message": "If my partner was cheating on me, I’d really want to know. I’d want someone to tell me. However, I’ve been in a position where someone I know got cheated on and initially I was a bit scared to tell them because in past experiences with them they’d always take their partner’s side no-matter what, and that’s expected cos it’s their partner. So I wasn’t too sure they would receive this well. But it kept eating me up and I told them. I got into shit for it, they both stopped talking to me. So I’d say it’s 50/50. They might not respond in a way that you like, so be prepared for that. Now I just don’t like to get involved in anyone’s relationship.",
   "created_utc": 1691388759,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4mhlu",
   "message": "Had a situation I knew about at work a few years ago. Never said a word to anyone. You may think I’m a piece of shit, and you may even be right. But ultimately, I am there to collect a paycheck and go home, not kick over hornet’s nests.",
   "created_utc": 1691389071,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4mp9e",
   "message": "I want to say yes. But currently I know of an affair and haven't told , since I do not have proof and it would put me in a very difficult position at work.",
   "created_utc": 1691389233,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4q5x5",
   "message": "It would depend on the dynamic and what it could potentially cause for the one being cheated on or how they would react. What I would most likely do is sit down and have a discussion with the cheater and let them know that they need to come clean and give their s.o the respect they deserve hearing it from their cheating SO. Also, inform them that if they didn't come clean, then I would have to let their SO know because it is beyond wrong and disrespectful.",
   "created_utc": 1691391906,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4qvah",
   "message": "No, I stay out of other peoples business. There's a chance you become the enemy.",
   "created_utc": 1691392466,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4r5gi",
   "message": "I did tell a girlfriend of a friend on my and she got angry at me and accused me of trying to break them up a year later she found out and forgave him but they both hate me I don't really care but I now don't do anything to help people",
   "created_utc": 1691392693,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4rbm3",
   "message": "Its a weird thing for me. On one hand I've been cheated on and it's awful. I wish someone had told me earlier that it was happening and I didn't find out in a shit way.\n\nOn the other hand, it's a very messy situation that could end poorly. Especially if it's someone you are close with and care about.  So I'd be torn. I'm also admittedly aggressively non confrontational so I try to avoid situations like that.\n\nI'm gonna say it would still probably be a yes. But id spend way too much time trying to figure out how to do it the right way.",
   "created_utc": 1691392829,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4sj63",
   "message": "Well not necessarily cheating but I new a guy who was trying to see videos of “the two of them” behind her back. I told her and to my shock she accused me of stalking because I didn’t show proof, so my only advice is get proof hard first before telling.",
   "created_utc": 1691393809,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4sscw",
   "message": "Depends who the SO is. I don't get involved in the business of people I don't know.",
   "created_utc": 1691394016,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4ssop",
   "message": "Nope. I would ask myself why I would want to tell and it wouldn’t be for something good. It’s none of my business how two partners in a marriage behave.",
   "created_utc": 1691394023,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4udhn",
   "message": "I dunno cause for me anyone who tells me negative news I now associate negative feelings towards them (i know that’s not fair).\n\nPlus I’m the real world scenarios are unpredictable, snitch on some abusing cheater they may kill you, do other things people are crazy. Maybe anonymously",
   "created_utc": 1691395303,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4vm8z",
   "message": "You know how many people get into drama by getting involved trying to tell on someone who is cheating . Lot of times they won’t believe you or you  going to get hated on for being the messenger. Def not . It’s none of my business, many people have gotten into deep shit by “trying to be a good person”",
   "created_utc": 1691396315,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4vwln",
   "message": "Depends. Assuming no abuse involved, I would confront the cheater and insist on them confessing themselves. It will be better for everyone involved if it comes directly from them instead of the cheated on person finding out another way. I would give them a brief timeframe and if they don't do it by said timeframe that I will then unfortunately have to reveal it myself. Hopefully the situation resolves without me having to get involved further besides being supportive in the aftermath.",
   "created_utc": 1691396544,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4w9c3",
   "message": "yes. the SO has a right to know",
   "created_utc": 1691396837,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4wb2x",
   "message": "Definitely. I've been cheated on. It sucks I'd tell anyone else about it",
   "created_utc": 1691396877,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4wc6n",
   "message": "Of course, I'd tell! Karma might come back to bite me, and I've already got enough bite marks.",
   "created_utc": 1691396903,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4wf27",
   "message": "Depends how close we are\n Friend or family yes\nAcquaintance probably not\nSome people don't want to hear it or won't believe anyway",
   "created_utc": 1691396970,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4wobh",
   "message": "If I was unwavering confident and was completely certain, I would. If I just had suspicions, it would largely depend on how well I knew the SO. If they were a friend, I would break the news to them; if they were an acquaintance, I'd probably think it wasn't my place to get into all of that.",
   "created_utc": 1691397186,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4wsme",
   "message": "I didn't know what was going on when I told my friend.\n\nAll I knew at the time was that my friend's husband had a dating profile on a dating app.\n\nI emailed the link to his profile to my friend. She asked him about it. He lied about it. Of course, the truth came out.\n\nAll one can do is provide the information. It's up to the recipient of that information to do with it what they will. 🤷🏼‍♀️",
   "created_utc": 1691397284,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4y83k",
   "message": "i went to my college town a few months ago to get the last of my stuff from my former roommate. my ex hit me up when i was there and told me she was single and i laid some dank pipe for a couple of days. over a month later i wanted to show my friend a pic of her so i found her insta on his account (she has me blocked) and it turns out she was married. i didn’t go out of my way to message him because i’m on the other side of the country and didn’t want to start something i had no control over. Hopefully she stopped cheating since then and has a good marriage going forward, but doubt it.",
   "created_utc": 1691398467,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv4zzuq",
   "message": "If it were a friend, then yes, I'd tell them.  I don't care about strangers - not my business.",
   "created_utc": 1691399920,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv50pib",
   "message": "No, its not a life or death thing and i have no right to put my nose in the personal lifes of others.\nIts their problem.",
   "created_utc": 1691400496,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv51ihq",
   "message": "Of course. If my SO was cheating on me I'd want to know, and the other person would most likely want to know too.",
   "created_utc": 1691401159,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv52pzf",
   "message": "100%. I can’t stand cheaters and I’d want someone to do the same for me (if I didn’t find out myself)",
   "created_utc": 1691402125,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv543aq",
   "message": "On the one hand my religion does tell me to conceal other people's sins. On the other hand I can't stand injustice and adultery is one of the worst things one can do to another person. So I'd probably tell the husband or wife.",
   "created_utc": 1691403200,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5445h",
   "message": "No i wouldnt. Dont get involved in Other peoples drama",
   "created_utc": 1691403219,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5511f",
   "message": "If I had the definitive proof/witnessed something with my own eyes - then yes I would absolutely tell them because I would want someone to tell me in that scenario and it’s the moral thing to do. If it was based on hearsay or speculation then it’s best left alone until proven otherwise.",
   "created_utc": 1691403906,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5656r",
   "message": "Yes, because I'd appreciate it if someone told me if my partner cheated on me.\n\nNo, because its not my relationship, therefore not my problem. \n\n\nThese are the 2 possibilities that popped up in my head while reading the question, but I'll probably choose option 1, don't want to end up as the bad guy",
   "created_utc": 1691404724,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv576nf",
   "message": "Yes because it's the correct thing to do.",
   "created_utc": 1691405469,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv57izb",
   "message": "Heck to the YEAH! After I tell them they're being cheated on, I would advise them to politely break up if possible.",
   "created_utc": 1691405702,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv589op",
   "message": "I once did and the SO laughed. I was not sure what to make of it. He did not care or did not believe!",
   "created_utc": 1691406199,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv58yw3",
   "message": "I did it twice\n\nLost the friend both times",
   "created_utc": 1691406658,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv597a8",
   "message": "I would be hesitant to, even though I would want to, but I’ve seen it happen where the one who was cheated on acted more angry at the person who told them than they were at their partner, they must have just wanted to live in blissful ignorance.",
   "created_utc": 1691406811,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv59nco",
   "message": "As a French I have the utmost respect for privacy. Meddling in someone's personal life is an absolute taboo.",
   "created_utc": 1691407102,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv59q6b",
   "message": "Yes and no. If I found out I would give them 24 hours to come clean. If not then I’m going to step in.",
   "created_utc": 1691407151,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv59tey",
   "message": "From experience I can tell you  they will come to hate you. I do it anyways, it’s for the greater good. Who wants a friend you can’t warn of fire.",
   "created_utc": 1691407207,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv59z7j",
   "message": "Yes. It is better to know the truth then make the other SO be suspicious of there other SO throughout the hole marriage.",
   "created_utc": 1691407309,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5awcq",
   "message": "If I know at least one of the people involved, yes I would tell them, otherwise I wouldn't get into the business of strangers",
   "created_utc": 1691407887,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5blik",
   "message": "Mind your business.",
   "created_utc": 1691408310,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5bvhd",
   "message": "Yes, even though I have done this already and it backfired. I was made to look like an uncaring, lying person lol.",
   "created_utc": 1691408479,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5c57w",
   "message": "I think I would. Only because with 2 different girlfriends who had cheated, I've had people who I had considered friends not tell me. Only when I had found out on my own were they like \"yea sorry dude, I knew but didn't know what to say.\" Or some similar bullshit. \n\nSo not only was I hurt by finding out I had been cheated on but realizing people I thought were my friends, actually weren't. I get that it could be a shitty thing to have to lay on someone but I think if you're truly friends with someone, you'd want to look out for their best interest and be truthful.",
   "created_utc": 1691408643,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5cami",
   "message": "As someone who has been on the \"cheated on\" side, I would prefer it if someone had told me.  I felt like everyone else knew and no one cared enough about me or my marriage to tell me.  I felt like a laughing stock.\n\nIn my previous job I walked in on two people having an affair.  The woman was my brother-in-law's best friend's wife (I've also known him longer than his wife has).  I talked to my sister about it and she and her husband did talk to him about it.",
   "created_utc": 1691408731,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5cbm0",
   "message": "Depends how much the cheater pays me or keep my mouth shut",
   "created_utc": 1691408747,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5ceq3",
   "message": "Okay so this is a longish story but I’ll give you all the sparks notes version. \n\nI did this and it completely fractured my friend group at the time, throwing my life into chaos for a while but I would still do it again because I think it was right. These are not real names btw. \n\nSo I had a fairly large friend group in my undergraduate degree. It started with me meeting Lindsay in my first year, we hit it off really well and were really close friends, nothing romantic at all purely platonic - I had a long term partner and I was not physically attracted to Lindsay. Over the course of the next four years we got closer with some of our classmates and we had a good friendship group - I was still really close with Lindsay but my other closest friend was a guy named Simon. Fast forward to the end of our degree and 10 of us decided to go on a little all inclusive vacation to celebrate being finished. I brought my partner and Simon brought his and another of our friends brought her bf. Myself and Simon and our partners were in same room - family suite because like I said we were pretty close. So the vacation is going really well, excursions, dancing, drinking, general tomfoolery etc etc. On day 4 we had all planned this little boat tour but Simon and Lindsay both backed out - Simon felt sick and Lindsay didn’t really want to go and instead wanted to go look for souvenirs- totally fine. So we make our way to the dock to leave and I forget my sunglasses but the tour guide says that he can wait 15 mins and that “I better be a fast runner” so I take off back to the room and when I get to the room I bust open the door and I catch Lindsay full on getting railed doggy style by Simon. I can’t really process what I’m seeing but it’s obvious what I’d happening lol. \n\nSimon tells me not to tell his partner because it was an accident. I didn’t really say anything to him. I go on the tour and following that I discuss with my partner what I saw - we both agree that I should tell Simons gf. I don’t know her super well but we do spend a fair amount of time together and are definitely friendly with each other. So I tell her what I saw and she is in utter disbelief. She confronts Simon and they break up and to keep things short she stays with us and Simon shares a room with another of the friend group. Lindsay then tells the rest of our friends that the reason why I told Simons gf was because I was jealous that Simon fucked her and I didn’t lol. But to my dismay some of our friends took her side and vilified me - because of course we have been friends all these years and I must be pining after her. I lost it at her for even suggesting that and she never even apologized or tried to justify why she said that. My partner was on my side and several of our friends were on my side because they cheated and she was trying to displace what they did but it created a huge rift. Anyways, I no longer speak with any of them - my partner and I lasted for a couple more years and then I did speak with Simon when his father died but otherwise no contact at all. Lindsay reached out last year to see how I was but I ignored her message and she sent me another asking if I was still mad about that entire situation but I ignored that too",
   "created_utc": 1691408798,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5cuw0",
   "message": "Not anymore. I've always been someone who wouldn't let people do that. If I heard about it second hand, I'd keep my mouth shut. People who GLOAT about cheating or use their friends group as a shield are the worst. But, in my experience even honesty isn't well received. Twice now the person being cheated on double downed and stuck with their partner and then accused me and others of 'trying to break them up out of jealousy'\n\nNot worth getting involved.",
   "created_utc": 1691409060,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5d7z1",
   "message": "No mostly because you’ll be the enemy after that. One will hate you for being a narc and the other will hate you for being the barer of bad news and a constant reminder. Unless it is close family member stay out of it. I did it one time with a buddy. Never again.",
   "created_utc": 1691409270,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5dijc",
   "message": "Yes, because I'd want to be told.",
   "created_utc": 1691409440,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5dul5",
   "message": "It depends on which one I'm friends with, and if both, which one I'm more friends with.\n\nI would also only tell if I had proof.",
   "created_utc": 1691409629,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5eaa2",
   "message": "No. I stay in my own fucking lane. Not every couple lives according to the rules that govern my relationship",
   "created_utc": 1691409879,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5ei86",
   "message": "Tried to once. Dude confronted her, told her I told him. He believed her sob story. Dude no longer is my friend. Happened 20+yrs ago, so meh.",
   "created_utc": 1691410001,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5eoex",
   "message": "No. I haven't seen this sort of thing work out in a positive manner.",
   "created_utc": 1691410097,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5f1hc",
   "message": "I would tell them to admit to cheating and if they don’t I’d tell the SO",
   "created_utc": 1691410300,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5fhde",
   "message": "only if i knew for 100% without a doubt it was happening. even if it backfired on me in the long run. my conscious would be clear. i would expect someone to tell me if they knew.  \n\ncheating has become such a normalized thing that way too many people now are comfortable just looking the other way about it. it’s gross.",
   "created_utc": 1691410545,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5fodi",
   "message": "YUP!  And I have told people. One refused to hear it and hated me for it until she couldn't ignore the truth anymore and realized every else hid it from her and I was the only honest friend.",
   "created_utc": 1691410653,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5gr5x",
   "message": "Not my circus, not my monkeys.",
   "created_utc": 1691411240,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5i368",
   "message": "Depending on the situation and my general assessment of the persons character I would give them the chance to do it themselves within a certain timeframe. Give them a chance to earn up to their own mistakes. But I would definitely let them know. I really don't like cheating. But I'm also of the opinion that everyone makes mistakes and if my demand of them telling their SO themselves makes them both have a discussion about their situatition and decides to stay together in a more honest relationship - great. If they break up - great.",
   "created_utc": 1691411947,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5iacq",
   "message": "None of my damn business. I dont care LOL",
   "created_utc": 1691412051,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5ix45",
   "message": "Not my business",
   "created_utc": 1691412381,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5jp5e",
   "message": "Depends on the person. If it’s my bestie yes. Anyone else, nope.",
   "created_utc": 1691412772,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5ken8",
   "message": "If I was 100%, nope.  It's their relationship, not mine.",
   "created_utc": 1691413130,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5kokn",
   "message": "I\\`m married with cuckold, dunno why are you guys dont like cheating, or relations is great",
   "created_utc": 1691413268,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5lch5",
   "message": "Yes. I was cheated on. I found out the hard way. I will never speak to the three of her friends who helped her hide it ever again, even if WE are working on our shit. \n\nThey have been my friends for 24 years too. You don't hide it, that only makes things worse. If you are in the friend situation, you give them a chance to come clean themselves, but if they don't, you tell.",
   "created_utc": 1691413591,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5lv64",
   "message": "No — that’s none of my business.",
   "created_utc": 1691413841,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5mbmw",
   "message": "I honestly don’t know.  \n\nThere are situations where I would definitely speak up.  However I’ve also been in a situation where I knew someone was having an emotional affair and didn’t say a word because I knew telling her husband would make life very dangerous for her.   (Why didn’t she just leave? Strict religious upbringing.)   While I don’t condone cheating, I also really didn’t want my friend to get the shit beaten out of her.",
   "created_utc": 1691414060,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5n1ll",
   "message": "Only if it was a close friend",
   "created_utc": 1691414406,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5o3jk",
   "message": "If their SO is my friend yes, otherwise no. That is just a lot of unnecessary potential drama that I'd be inviting into my life.",
   "created_utc": 1691414899,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5orkb",
   "message": "Did that once and it was hell ending up in the middle. Never again. Hear no evil. See no evil. Speak no evil",
   "created_utc": 1691415211,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5oscn",
   "message": "I told my best friend that his wife was cheating on him and it really blew up, we barely see eachother anymore and they stayed together. I couldn’t have not said anything but I really wish I had never had found out.",
   "created_utc": 1691415222,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5p0p2",
   "message": "Absolutely. Fuck cheaters.",
   "created_utc": 1691415328,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5p5yr",
   "message": "Only anonymously. Perhaps with pictures. But never get in the middle.  I have enough on my plate",
   "created_utc": 1691415394,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5pgkr",
   "message": "Yes, and I have.  Even if it was “none of my business”, I don’t care.",
   "created_utc": 1691415531,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5pidi",
   "message": "Only if I had undeniable proof.\n\nThat said, I told my brother that his wife was cheating on him and he refused to believe me. Even after two of his best friends told him they had also seen her going out with other men (We even had cell phone pics of it). She eventually left him for one of the guys we seen her with but he still never acknowledged that she was cheating. \n\nIt was the beginning of the end of my brother and I's relationship. \n\nEdit: spelling",
   "created_utc": 1691415554,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5pr2p",
   "message": "Yes, so they won’t get HIV or HPV.",
   "created_utc": 1691415664,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5qjle",
   "message": "No\n\nAs much as I would want to and as much as I understand why a lot of people would say yes (and as much as I actually agree with them) in the end I wouldn't. I don't want to be involved in anyone's personal life like that. And as much as people say \"I would want to know\" the reality is that more than likely you'll be blamed somehow. Like, there's no way to tell someone their SO is cheating and not catch at least some of that stink. It could be everything from them not believing you and/or resenting you for telling them to them just not wanting anything to do with you afterwards because you remind them of it. And a whole bunch of stuff in between. \n\nI guess the only way I would do it is if I could figure out a way to do it anonymously. But lets face it: cheaters are pretty good at manipulation so....they can lie their way out of it.",
   "created_utc": 1691416020,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5r1g2",
   "message": "Most of the advice I got was to NOT inform the SO for reasons such as you becoming the bad guy when they reconcile or, you prying into their personal business or, them not trusting you and breaking off contact or, the other SO finding out you tattled and then coming after you  \nBut you could hint about it and let the seed of doubt lead them to the truth!",
   "created_utc": 1691416240,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5r412",
   "message": "No it's none of my business. I have no interest getting involved in peoples personal lives like that \u0026amp; hope they stay out of mine. What if they're in a secret poly relationship \u0026amp; find it embarrassing? What if they're just together for financial reasons? Not sure why the majority feels the need to intrude on people's personal life like that.",
   "created_utc": 1691416271,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5rgek",
   "message": "I will but anonymously. Anything can happen in today's world",
   "created_utc": 1691416418,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5rhwt",
   "message": "Absolutely.  I would hate to see someone pour their heart into a relationship that is a lie.",
   "created_utc": 1691416436,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5rsox",
   "message": "Absolutely no. In past I would, but I come to conclusions that it's not good idea.\n\nIt's as same as if I would lie that it happend without evidence. Making evidence is stalking, reasonably you can get sued for that.\n\nAlso it doesn't help any of them. Some people take for worse when public knows about cheating of their partner, while they would not care about it in privacy.",
   "created_utc": 1691416565,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5rxj0",
   "message": "Not unless it's a friend or family member. I'm not getting involved. Did before and learned my lesson. You'll be square in the middle of all the BS that follows.",
   "created_utc": 1691416621,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5sd8u",
   "message": "Depends on who they are. I mostly mind my own business. Immediate family or close friend, yes (with evidence). Everyone else? Not my circus. Not my monkeys.",
   "created_utc": 1691416809,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5sk70",
   "message": "I would like to think that I would, but then I remember that the one time I had the opportunity to do so, I didn’t. \n\nI worked at a restaurant and one of the chefs was a POS who cheated any chance he got. His girlfriend, the mother of his children, was a little firecracker who could be quite scary when she was angry. Everyone in the restaurant knew what he was getting up to, except her. I could have said something, but I was stuck in that “not my place” mindset. If the chefs don’t like you, they can make your life hell, and I was scared if I was the one who said something I could never work there again. And it’s not like I had proof or had ever even seen him do anything myself, it was all just what other people had told me. I convinced myself it wasn’t worth saying anything, and that someone else would. \n\nIn hindsight I wish I had told her everything I had heard. She’s far from perfect herself but she didn’t deserve to be made a fool of by that asshole for so long. If I’m ever in that situation again I hope I make better choices.",
   "created_utc": 1691416891,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5sqob",
   "message": "I only found out about my ex wife's affair a year after our divorce, one that she asked for when she had decided that this other guy was a better option than staying with me, and I only discovered it by accident. When confronted about it, she acted like she was the victim and that I deserved being treated the way I had been.\n\nYes, I would've have wanted someone to tell me because I spent a year beating myself up thinking I had failed her when in truth I had been lied to, betrayed and tossed aside.\n\nIf she was so certain being separate from me was the key to her happiness, I would rather for her to see if that was true and grow as a person rather than waiting until another guy came along to use as crutch to avoid the pain of being alone.",
   "created_utc": 1691416968,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5sr14",
   "message": "yes, but I would make it out like it was common knowledge they were in an open relationship.  then when they say they aren't, act all confused and tell them why I thought that.",
   "created_utc": 1691416972,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5t8bb",
   "message": "I would ask myself the following questions\n\nFirstly, how do I know? Is it just hear say? Is it something I've seen? Is it something I have evidence off?\n\nSecondly, how well do I know this person? Do I know someone who knows them better, who would be more appropriate to take this info to?\n\nThirdly, how involved do I want to be in the drama this will generate and what will the out come be for me? \n\nHere's a real world example. I saw in finance officer at my work snogging a junior employee. In work time. On work properly. \n\n1. Eye witness. 2. Never met the guy. 3. I don't want to get fired for this. \n\nResult I said nought.",
   "created_utc": 1691417175,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5tavh",
   "message": "Nope. Not my circus, not my monkeys.",
   "created_utc": 1691417206,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5tqxq",
   "message": "I would because I would want someone to tell me. I would show them evidence to, so they wouldn't go off just my words alone. That's a heartbreak I wouldn't want anyone to go through.",
   "created_utc": 1691417396,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5u7uc",
   "message": "Not my circus - not my monkeys.",
   "created_utc": 1691417598,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5u9g1",
   "message": "It really depends, there are some instances where I'd stay out of it, but 99% of the time, I'd say something. \n\nEx: I once lived in an apartment and a young-ish married couple lived in an apartment above me. I noticed that the guy would have a woman over while the wife was at work. It was pretty common and was always the same woman, and always while the wife was gone, it became pretty obvious he was having an affair. He wasn't careful about it at all, he'd walk her to her car and they'd make out before she left sometimes, like a young high school couple or something. \n\nI didn't go out of my way to tell her about it but I ran into her at the mailboxes one day and we were making small talk and I just asked her who the woman was who always comes by and hangs out with her husband. She had no idea what I was talking about but I gave her a description of her and she knew who it was immediately. And that was that. \n\nHe wasn't happy about it and accused me of trying to break up their marriage to get with the wife, which was odd since I lived in the apartment with my gf at the time. I just told him I had just asked her who the chick was and told him he was going to get caught eventually, whether it was from someone else telling her or her coming home early one day or something. He said I didn't know the whole story and blah blah blah. I agreed that I didn't know the whole story and, judging by his wife's reaction, she didn't either. \n\nWhy get married or move in with someone if you don't want to be monogamous and the other person isn't into an open relationship?",
   "created_utc": 1691417617,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5v8ib",
   "message": "I would tell them ASAP. No-one should go through being cheated on, and whoever is cheating deserves to be exposed quickly",
   "created_utc": 1691418025,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5vaad",
   "message": "Snitches get stitches",
   "created_utc": 1691418045,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5vkq9",
   "message": "Yes I would, but discreetly. They deserve to know. That’s not fair to let someone get away with that, in my opinion. But very subtly and “leading them to it” so I don’t get some kind of weird target on my back because emotions could be running high",
   "created_utc": 1691418165,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5vp1r",
   "message": "The truth will get out.  One way or another.   It’s better sooner than later.  My best friends in the world are dealing with this…one cheated on the other and…it has been so awful but the common theme is people knew and didn’t say anything and if they had it’s possible it would have made the aftermath easier",
   "created_utc": 1691418215,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5vucb",
   "message": "Depends on my relationship to the SO.  If we’re friends or I have some other reason to look out for their best interests, then yes (probably anonymously, though).  Otherwise I mind my own business.",
   "created_utc": 1691418276,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5w01a",
   "message": "Depends on the circumstances.\n\nIs said person trapped in an abusive relationship with nowhere to go? I.e foreign land, not working, knows no contacts or helplines, kids involved? Then no. Probably reach out to said abuse victim too for help in the separation\n\nCheating on SO just because they can? Then yeah it's fair game",
   "created_utc": 1691418342,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5w7tk",
   "message": "It depends on the situation. If I know with 100% certainty, I would probably reach out to the spouse. \n\nIf it’s just hearsay, I’m minding my own business. \n\nIf I know one of them personally (coworker, friend, etc), I’d reach out. \n\nIf I don’t know either of them, I’m minding my own business.",
   "created_utc": 1691418431,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5w97o",
   "message": "I would,  they deserve to know .",
   "created_utc": 1691418447,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5wfmz",
   "message": "If it were my close friend or relative, I would tell them.  Otherwise, it’s probably not worth the collateral damage.",
   "created_utc": 1691418521,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5wvfn",
   "message": "I’ve done this before. You only end up as the bad guy, they will crucify you before anything else. You’ll lose friends this way. Only thing you can do is stay out of it or   advise the cheater to own up to it.",
   "created_utc": 1691418701,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5wx43",
   "message": "I wouldn't. I know couples that have an open relationship. Its none of your business unless they are your direct family",
   "created_utc": 1691418720,
   "score": 1,
   "submission_id": "15kamaf"
  },
  {
   "comment_id": "jv5x92f",
   "message": "Unless that SO is a family member or a long time close friend. No. None of my business and I don't have all the info. What if it's their kink.",
   "created_utc": 1691418858,
   "score": 1,
   "submission_id": "15kamaf"
  }
 ]
}