{
 "submission_id": "15kbp69",
 "title": "What would you tell your 20 year old self if you were to go back in time and why?",
 "selftext": "",
 "created_utc": 1691387142,
 "permalink": "/r/AskReddit/comments/15kbp69/what_would_you_tell_your_20_year_old_self_if_you/",
 "score": 54,
 "url": "https://www.reddit.com/r/AskReddit/comments/15kbp69/what_would_you_tell_your_20_year_old_self_if_you/",
 "comments": [
  {
   "comment_id": "jv4oyfb",
   "message": "take care of our teeth.",
   "created_utc": 1691390970,
   "score": 62,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4m07h",
   "message": "Raise the standards you have for the company you keep. Don't do drugs. Finish college.",
   "created_utc": 1691388710,
   "score": 48,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4k71d",
   "message": "Go up and shoot your shot at that person you find attractive.. you never know",
   "created_utc": 1691387390,
   "score": 32,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4nl6z",
   "message": "\"You forgot to buy ketchup\". I just turned 21",
   "created_utc": 1691389916,
   "score": 35,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4qtnu",
   "message": "Tell your dad to go to the doctor. Now.",
   "created_utc": 1691392430,
   "score": 20,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4ngh2",
   "message": "Stop feeling sorry for yourself. Just leave. Take that bus out of town and forget everyone you know. \nWhy? Because I wish at that age I had the balls to start from scratch.",
   "created_utc": 1691389815,
   "score": 18,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4poax",
   "message": "Choose travel over love",
   "created_utc": 1691391524,
   "score": 13,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4k55y",
   "message": "Hey, your family will be very accepting of your sexuality, there is no need to hide it any longer.",
   "created_utc": 1691387355,
   "score": 23,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4mvir",
   "message": "Be single, be single and don’t force any relationships because they will disappoint you.\nLive your life and love yourself first and everything will fall into place.",
   "created_utc": 1691389364,
   "score": 25,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4oj7g",
   "message": "Take pictures of everything. Too many memories you thought would last fade fast. \n\nEither finish college or stop wasting time and join the Marines.\n\nDon't rack up credit card debt on stupid shit.",
   "created_utc": 1691390643,
   "score": 12,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4qrgj",
   "message": "Stay the fuck away from drink and drugs and just concentrate on having a career/skills",
   "created_utc": 1691392382,
   "score": 10,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4mgt0",
   "message": "Don't listen to the adults who failed you as a child and embrace freedom to normalize everything you want and need in life. Break the cycle and find pure bliss.",
   "created_utc": 1691389055,
   "score": 9,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4klx3",
   "message": "Hey 20-year-old me, embrace failure, because it'll lead you to opportunities you never even knew existed and teach you invaluable life lessons along the way - just make sure to laugh at yourself while embracing that epic journey, my friend!",
   "created_utc": 1691387684,
   "score": 6,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4qp7h",
   "message": "Everything is going to work out. Do exactly what you did before, because the children are worth every moment and the husband takes off in 1993 anyway.\n\nYou are going to have a good life.",
   "created_utc": 1691392332,
   "score": 5,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4oviy",
   "message": "Hey 20 year old me. Let me talk to ya for a minute.\n\n*FUCK YOU.*\n\nAlso, invest every cent you make into Bitcoin, and sell at 60k. And fuck you.",
   "created_utc": 1691390907,
   "score": 17,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4m2uz",
   "message": "Dude, invest in Bitcoin early, hit the gym judiciously, chase that crazy hobby you've been postponing. Trust me, you'll thank me later.",
   "created_utc": 1691388766,
   "score": 5,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4mrve",
   "message": "Hey there, buddy! I'd tell my 20-year-old self to embrace the crazy opportunities, remember that failures lead to epic learnings, and never forget to take occasional breaks because life is not just about the hustle, it's also about the present journey.",
   "created_utc": 1691389286,
   "score": 5,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4ogp3",
   "message": "Considering I'm 20, I'd probably go back and tell my 20 year old self a few months ago to go back and slap my 12 year old self in the face (he deserves it)",
   "created_utc": 1691390588,
   "score": 3,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4qvnb",
   "message": "You'll be alive at 21 and for many years after that — Armageddon isn't coming so start living life. \n\n(I was raised Jehovah's Witness and was taught the end was coming any day. I'm still recovering from being in that cult.)",
   "created_utc": 1691392474,
   "score": 4,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4jy1n",
   "message": "Hey, 20-year-old me! Listen up, you absolute dumbass. Here's some advice from your older, wiser self: \n\n\u0026amp;#x200B;\n\n1. Stop chasing after that toxic ex of yours. She's way more trouble than she's worth. Trust me, you'll save yourself years of heartache and therapy bills.\n\n2. Start taking care of your body, you lazy sack of shit. That metabolism isn't gonna stick around forever. Hit the gym, eat some veggies, and lay off the beer pong tournaments. Your beer gut will thank you.\n\n\u0026amp;#x200B;\n\n3. Don't be so damn hard on yourself. You're not expected to have your life together at 20. Embrace the mistakes, the failures, and the awkward moments. They all lead you to where you need to be.\n\n\u0026amp;#x200B;\n\n4. Invest in Bitcoin. Seriously, just do it. I don't care if you don't understand it. Just put some damn money in it and thank me later.\n\n\u0026amp;#x200B;\n\n5. Lastly, don't be afraid to take risks. Travel, try new things, and step out of your comfort zone. Life's too short to play it safe. And for god's sake, stop using your mom's Netflix account. Get your own shit together, dude.\n\n\u0026amp;#x200B;\n\nAlright, that's enough tough love for now. Good luck, young idiot. You're gonna need it. Cheers! 🍻",
   "created_utc": 1691387218,
   "score": 6,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4okgw",
   "message": "Stop buying CDs \u0026amp; DVDs for your collection.",
   "created_utc": 1691390670,
   "score": 6,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4p1z3",
   "message": "Get your shit together, stop trying to tackle a career top-down, invest in Amazon, and go reconnect with your friends back home *this fucking instant* you moron.",
   "created_utc": 1691391046,
   "score": 3,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4pjv4",
   "message": "Don’t do drugs, invest in your future through education, save some money, travel overseas, and build lasting relationships with good friends.",
   "created_utc": 1691391429,
   "score": 3,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4ppnt",
   "message": "To never move to the city where I studied (the people my age were the most horrible, fake and false, scheming, toxic creatures I've ever known.)\n\nTo pump as much money into bitcoin and then jump out when it reached 55k, then go short until it turns around, go long and bail out at 65k and forget about financial troubles for the rest of my life.",
   "created_utc": 1691391554,
   "score": 3,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4pure",
   "message": "Hey doofus, I love you now but stop drinking, doing blow and walk away from this lifestyle. Focus on maintaining your physical and mental health. Stop caring about what  people think and pursue whatever you can to be independent and happy. Your parents and 90% of your friends are fuckin skitz, m8.",
   "created_utc": 1691391664,
   "score": 3,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4qzgw",
   "message": "You'll do great, live in the moment and stop worrying too much about thw future.",
   "created_utc": 1691392560,
   "score": 3,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4r4oh",
   "message": "Don’t party; meditate instead.",
   "created_utc": 1691392676,
   "score": 3,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4rzu3",
   "message": "You’re smarter than you realize. Bet on yourself. Don’t fear failure.",
   "created_utc": 1691393371,
   "score": 3,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4necj",
   "message": "Invest in bit coin and never ever visit wallstreetbets",
   "created_utc": 1691389768,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4no7i",
   "message": "Gather as much of something called “Bitcoin” when it comes out as you possibly can",
   "created_utc": 1691389981,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4pan0",
   "message": "CHECK YOUR BANK BALANCE FREQUENTLY WHEN IN MEXICO, YOU ARE SPENDING WAY MORE THAN YOU THINK YOU ARE",
   "created_utc": 1691391231,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4phi0",
   "message": "STOP LISTENING TO MUSIC SO LOUD!!!",
   "created_utc": 1691391377,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4pkvi",
   "message": "Pack both your bags and hers. Sell the extra rig.  Move as sat away as possible and don't tell either of your parents. \n\nThe city we lived in was terrible for both of us, and the ONLY toxic part of that relationship was our parents. Hers were racist and mine were sexist and controlling",
   "created_utc": 1691391451,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4prxr",
   "message": "Don’t smoke weed, keep your atheism to yourself so you don’t get kicked out. stay at home and finish school, ignore that bitch Ashley and never give that cunt a second chance, she’s a sociopath and she’s gonna take you for everything you’ve got and ghost you.",
   "created_utc": 1691391601,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4q0tk",
   "message": "You are so fruity. Just come on out the closet girl",
   "created_utc": 1691391797,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4qjzx",
   "message": "Get your shit together immediately",
   "created_utc": 1691392215,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4ql6q",
   "message": "\nDon’t ever sell your condo — rent it out. Otherwise you’ll never be able to buy again. Also, sell your soul for that corporate job. Self-employment’s not going to work so well when you run into medical issues later.",
   "created_utc": 1691392241,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4qls7",
   "message": "\"If something doesn't feel right, it's probably because it isn't.  You get that sick feeling in your gut for a reason.\"\n\nI let myself be convinced that I was worrying over nothing by the people around me.  Turns out 9 times out of ten, my anxiety was trying to tell me something.",
   "created_utc": 1691392256,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4qqtq",
   "message": "STAY IN THE MILITARY!!!!! DO NOT GO HOME!!!!",
   "created_utc": 1691392368,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4qxfc",
   "message": "Break up with your boyfriend...\n\nThat ex was an ass and it caused me to do things I'm not proud of..",
   "created_utc": 1691392514,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4r4tj",
   "message": "\"In about a year, you will fall in love with a woman who will die from renal cancer when she turns 50.  Find a way to keep that from happening.\"\n\nI don't know if I would do that to myself, though.  It would probably make me insane.",
   "created_utc": 1691392679,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4rc5k",
   "message": "You deserve friends who treat you kindly and make you feel good. If you have a bad gut feeling about somebody, trust it. Trust yourself.",
   "created_utc": 1691392841,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4rdlt",
   "message": "20 is the year i got married. I would say this: \"you love your new wife. She will love you unconditionally and help you through every struggle you have. In three years you are going to get depression hard. It WILL change your relationship if you let it go too long. Go to the doctor early and make sure to get on meds so you can get through it. The one you need is fluoxetine. That's what fixed it. You also have a tumor in your pituitary gland. Get an MRI to show it. You need cabergoline to get that under control. Again, quickly. If you do that, more things will fall in place for you and prepare you for a happy life. You can do this. I know you can because you've done this already. Concentrate and breathe.\"",
   "created_utc": 1691392873,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4rgfl",
   "message": "Go back to school, nobody you think is your friend is actually your friend and for the love of god lay off the energy drinks.",
   "created_utc": 1691392935,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4s0gh",
   "message": "I’d tell my younger self that your medical problems do not define you. You are so much more than what has happened this year. So please don’t give up hope and look on the positive side of things.",
   "created_utc": 1691393385,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4s1rc",
   "message": "Don't study , get into business fail in it and learn from it and diversify yourself.",
   "created_utc": 1691393415,
   "score": 2,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tpim",
   "message": "Get A Degree In Accounting, And Tax Preparation! I should have, since I would do taxes for friends. My dad told me that college was a waste of time. Teach me to listen to my parents, whom neither finished high school.",
   "created_utc": 1691394756,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vhk8",
   "message": " Lose the weight NOW and don’t gain more. It ruins everything",
   "created_utc": 1691396208,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4pa3e",
   "message": "Don't get married. Because it's a trap.",
   "created_utc": 1691391219,
   "score": 3,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4qdcd",
   "message": "DUDE BUY AS MUCH BITCOIN AS YOU CAN, LIKE SERIOUSLY, SELL ALL YOUR SHIT AND JUST KEEP BUYING IT",
   "created_utc": 1691392067,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4jzaz",
   "message": "Stay back! You've seen Timecop. The same matter can't occupy the same space at the same time.\n\nAnd yes, I know that in the last 20 years every cell in my body has died and been replaced, so we're technically not the same matter anymore, but do *you* want to argue with Van Damme?",
   "created_utc": 1691387242,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4l9ob",
   "message": "Hey, 20-year-old felineappreciator14, don't sweat it if things don't always go according to plan - some forks in the road might just lead to unexpected tacos, who knows! 🌮",
   "created_utc": 1691388164,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4m24e",
   "message": "Dont stretch your penis. It will destroy your life",
   "created_utc": 1691388750,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4mwrw",
   "message": "Don't blow through stop signs. Literally and figuratively",
   "created_utc": 1691389389,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4n0w1",
   "message": "I'm gonna tell myself to try harder at life Bc in a few years i will fall in love with a good girl and fumble after initial success",
   "created_utc": 1691389478,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4n7jl",
   "message": "Hey buddy, I know things might seem a little overwhelming right now, but trust me on this: embrace failure, try all the flavors, and follow your heart—you'll end up exactly where you need to be!",
   "created_utc": 1691389621,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4n7rk",
   "message": "You'll live.",
   "created_utc": 1691389626,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4ncf4",
   "message": "Not to marry my ex. He was an absolute waste of time. Literally pointless relationship.",
   "created_utc": 1691389726,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4nhms",
   "message": "You'll reconnect with u/icarusonfireagain in due time. And it's worth the wait.",
   "created_utc": 1691389840,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4nqpz",
   "message": "Put the biggest bet you can on Man City to score 100 points in the league",
   "created_utc": 1691390035,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4nvd2",
   "message": "You are fucked!",
   "created_utc": 1691390132,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4o03r",
   "message": "You’re going to make it through this, and you’ll be more than just ok. Don’t. Give. Up.",
   "created_utc": 1691390231,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4o8rv",
   "message": "I would explain to myself what the 20s, 30s, 40s, 50s, 60s will consist of in terms of what we are going for\n\nim not that old btw, but once you are in the middle… you can see the writing on the wall",
   "created_utc": 1691390417,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4on6e",
   "message": "“Believe In Yourself And Don’t Be Afraid Of Going After Your Dreams Because You’re Worth It”!!!!",
   "created_utc": 1691390727,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4ook5",
   "message": "Actions to take to prevent/prolong the death of loved ones.",
   "created_utc": 1691390756,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4p1aq",
   "message": "I’m 24 and already don’t remember being 20 💀 I don’t think it was very eventful. \n\nI probably would have told myself to not take that Japanese class that lowered my gpa.",
   "created_utc": 1691391031,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4pc9s",
   "message": "1. Move out sooner. You'll be a lot happier.\n2. Don't take that job. You'll be miserable.\n3. Don't bother chasing \"her\".",
   "created_utc": 1691391266,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4pifc",
   "message": "Go to sleep",
   "created_utc": 1691391398,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4pnlz",
   "message": "We live to 20?",
   "created_utc": 1691391509,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4pte2",
   "message": "I'm just reading these because that's in the future for me 😁",
   "created_utc": 1691391633,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4px0l",
   "message": "Tell your brother you love him, someday you won't be able to. Oh and definitely buy that weird digital coin thing you were debating for $600, maybe a few of them.",
   "created_utc": 1691391713,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4qqv1",
   "message": "Talk to dad... Change his mind 😔",
   "created_utc": 1691392369,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4qy7z",
   "message": "Don’t make my mistakes.",
   "created_utc": 1691392532,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4r0ko",
   "message": "Stop socializing and stop chasing girls. They are temporary and don’t worth your time. Study harder and graduate with a higher gpa",
   "created_utc": 1691392584,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4r1xs",
   "message": "DON’T GET MARRIED TOMORROW!!!\n🥺",
   "created_utc": 1691392615,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4r81u",
   "message": "How relationships and attraction actually work, and how different it is for men and woman. I would also tell myself to skip master's program (bachelor being enough) \u0026amp; give myself some business ideas.",
   "created_utc": 1691392751,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4r8us",
   "message": "Quit jacking off",
   "created_utc": 1691392768,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4ranu",
   "message": "I'd give myself advice on being more mindful and empathetic, and also how to open up to those around me.",
   "created_utc": 1691392808,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4ri0p",
   "message": "Let it go",
   "created_utc": 1691392970,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4rk4h",
   "message": "Don't depend on others. Work hard and get your own money.",
   "created_utc": 1691393017,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4rl78",
   "message": "Mine/buy bitcoin",
   "created_utc": 1691393042,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4rlk7",
   "message": "Even if he's (ex-bf) transferred to  be at the same university as you, do not get back together with him. . . \n\nSelf-explanatory.",
   "created_utc": 1691393050,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4rmaa",
   "message": "Go after what you believe you can do and learn to accept that your mother doesnt care about you 🤷‍♀️",
   "created_utc": 1691393066,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4rmaj",
   "message": "Buy bitcoin.  Hold til it hits 50k.  Sell it all and never think about it again.",
   "created_utc": 1691393066,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4rogm",
   "message": "Go and talk to that girl everyone want you to ask  her out. Your current crush is only using you as an emotional tampon when she is alone and has no one to talk to. Eventually you will find out on your own but it will be too late to hit on that girl whose at the end was interested in you at that time but she will be in a relationship",
   "created_utc": 1691393116,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4rpzb",
   "message": "I would tell myself to not feel bad about all the drugs I do. Blaming is pointless and in the end they were one of the most important parts of the journey that has helped my success in my own life.. My drug addiction has saved me from myself",
   "created_utc": 1691393149,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4rsit",
   "message": "invest in crypto",
   "created_utc": 1691393208,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4s0es",
   "message": "Finish college and help your family",
   "created_utc": 1691393384,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4s0vr",
   "message": "Stay in school you fucking idiot",
   "created_utc": 1691393395,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4s1qj",
   "message": "You're going to meet the great love of your life in a year or two and it's not the dick head you are with. Get your shit together girl",
   "created_utc": 1691393415,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4s3pq",
   "message": "Do drugs or something. What am I? Your parents? Those guys suck.",
   "created_utc": 1691393459,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4s6bo",
   "message": "You have to stop living for someone else, your love will always be there but it's not worth the abuse anymore. Leaving is the only way to heal yourself and get him to realize he's better than that. You'll still be able to watch him grow and succeed from afar and find someone who cherishes every part of you too.",
   "created_utc": 1691393519,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4s8k0",
   "message": "Invest in your personal skills and development because COVID will screw up how adult you feel. You'll get a job much easier if you work on your skill set.",
   "created_utc": 1691393568,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4sdbi",
   "message": "Seeing as that’s barely less than three years ago, and knowing the fragile mental space I was in for a lot of it regarding major life \u0026amp; belief changes I went through at the time, I would absolutely avoid telling her anything, for fear she’d react against what I’d intend to communicate and land us in a worse place lol",
   "created_utc": 1691393679,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4sgni",
   "message": "Invest is doge coin for a couple months, and sell at like 1$. Remember when that shit was worth like 1 cent, when I was 20, and like 3 months later it was worth close to 80 cents per. Hell, just throwing a measly 100$ at it would help me a buttload for my future.",
   "created_utc": 1691393752,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4shwq",
   "message": "Please pay attention to the synchronicities. You're awakening, sweetie. Don't be scared. Discernment is key and they were always trying to help...",
   "created_utc": 1691393781,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4sj6b",
   "message": "Learn to invest early and wisely.",
   "created_utc": 1691393809,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4skjp",
   "message": "It would go something like this.\nHey 20yr old Atom I'm you from the future and I just want to share some advice with you of how things go for us so you can relax and stop worrying and stressing and causing us both mental health issues in the future so here goes.\n\n1. Stop worrying about work and the apprenticeship, you ace college but that's no reason to not buckle down and learn a bit more while you got the chance and work don't worry your outta there in 3yrs time, you take a break and get a great job with a bunch of great lads and you actually enjoy your job, you also get promoted before your 40 and end up on a  decent pay so stop stressing and worrying.\n(Hated college and didn't take it seriously, I did great there but after I finished wished I had just buckled down a bit more and learnt more while I was there and as for my old job back then Hated that too, the pay was awesome but OMFG was it stressful and hard work, was so happy to be let go from there and although I write about how much I hated it I am soo fucking greatfull for the opportunities they gave me that helped me get to where I am now).\n\n2. Relax a bit more and stop being so uptight trust me if you knew the things I know now you wouldn't people please so much and just enjoy things, people and friends come and go the friends you have now you don't anymore, you have better friends the kind that are there and don't stress you and use you. \n(I always used to people please as I was scared I would end up with no friends).\n\n3. You will meet plenty of women, one will help bring you out of yourself and boost your confidence be good to her, you have so much fun together but unfortunately it doesn't last forever and when your older you realise how important she was to you and wish you had treated her better and kept in touch, don't go being a fool and a walkover for these people Andrea, Denise and Emma I can't go into details as there are things you need to go through in life and unfortunately it includes these 3.\n(Was so scared that I wouldn't meet the right person as I was always shy around women).\n\n4.Finally... Loosen up, relax enjoy life it's going to pass you by, be wise with your money and stop think you'll work it back it takes you forever to get financially sorted again and most importantly spend more time with Mam \u0026amp; Dad you have no idea of how bad you are going to miss them when their gone.\n(As you can see by the above I was very uptight and a nervous wreck right from Comprehensive school up until I would say 40ish, my life hasn't been bad but do wish there were some things I did differently as 99.99% of the population do lol).",
   "created_utc": 1691393839,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4snb5",
   "message": "No fap!",
   "created_utc": 1691393902,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4sntr",
   "message": "Get certified in a trade and then work it. You'll be much happier. Especially if you can get into one that has some amount of outside work.",
   "created_utc": 1691393913,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4svom",
   "message": "As soon as you graduate, get as far away from your parents as you can. Every major life decision you make as a result of caving under pressure from them is going to turn out an abject disaster. And for f—k’s sake, unplug from right wing radio and Fox News. That’s not who you are, that’s who you think you have to be to make them happy.",
   "created_utc": 1691394091,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4sxhq",
   "message": "Things are going to be okay.\n\nThey're going to be rough for a while. A long while. It's going to seem like there's no way out, and that they only get worse.\n\nBut in the end, you'll win.\n\nYou'll have more than you imagined possible. You'll achieve things that will make you proud. It won't be the fantasies that you imagine, no, but it will be real and it will be yours.\n\nBut you have to keep going to get there. You'll want to give up, and give in. It will get dark. So very, very dark.\n\nBut in the end, the light will be waiting, and it will be beautiful.",
   "created_utc": 1691394131,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4sxom",
   "message": "To enjoy being young because before you know it, you won’t be.",
   "created_utc": 1691394135,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4sz4l",
   "message": "Don't hold yourself back. Do the things that you love no matter what everyone says. It's your life and future that is at stake. \n\nChoose the life that you want for yourself and not for others. As I have said, do the things that you love. Choose for yourself. You're a slave to no one. Stop comprising yourself. \n\nYou may face more challenges but hey I know you can do it. You are strong! Don't doubt yourself.\n\nDon't compare yourself to others. You have your own path. They may be more advanced or skilled than you but who cares. No one cares. Just trust the process. Enjoy the process. \n\nDon't be so hard on yourself. Just be yourself. You don't need others to confirm your worth.",
   "created_utc": 1691394168,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4szcw",
   "message": "Calm down, dial it back a bit, and watch others closely. Get some therapy too before your mental health starts affecting the person you care about the most because within less than a year it’s going to reach her, and it’ll hurt both of you.",
   "created_utc": 1691394174,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4szmz",
   "message": "You have less time with Dad than you think you do.",
   "created_utc": 1691394181,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4szxu",
   "message": "Leave her, focus on school",
   "created_utc": 1691394188,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4t08j",
   "message": "Enjoy",
   "created_utc": 1691394194,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4t1lk",
   "message": "\"buy apple, microsoft, and google stock\"",
   "created_utc": 1691394225,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4t1rz",
   "message": "To buy Bitcoins at less than a dollar and sell them during the peak in 2018 so that you can buy a farm somewhere in Eastern Europe and retire.",
   "created_utc": 1691394229,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4t28l",
   "message": "Don't die. Keep surviving you mother fucker\n\nBut I already knew that at the time so nothing",
   "created_utc": 1691394240,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4t2ey",
   "message": "Buy and buy and buy and hold....... Apple, Google and Facebook until you are 40. Then you can retire and travel or not for the rest of your days.",
   "created_utc": 1691394244,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4t2jf",
   "message": "You’re NOT fat.",
   "created_utc": 1691394248,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4t5e2",
   "message": "Invest in Amazon. Pretty evident why.",
   "created_utc": 1691394312,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4t9gm",
   "message": "Go vegan. I wouldn’t have to be ashamed it took me so long to align my actions with my morals.",
   "created_utc": 1691394403,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4t9jd",
   "message": "a) don't prioritize your relationship to your schooling. Fight tooth and nail to finish because trying to get back into it after leaving is a fucking nightmare.\n\nb) i know you don't want to, but go to the dentist. you can find out much sooner that the issues you're going to deal with for the next 10 years could have been entirely avoided and dentures at 30 wouldn't be your reality. \n\nc) the likes and comments on your snappy facebook statuses will dwindle, eventually people will find out you're not really that funny, you're just mean, and that ugly costs you. \n\nd) have a bigger plan than (be famous eventually). you're mentally ill, not a star in the making. \n\ne) credit cards are not the way when you have addictive tendencies. You have nothing to show for that debt, either. \n\nf) commit to something. Anything. Start the podcast, the makeup channel, whatever. Just pick something and do it, because ten years later all we have are the ideas, still.",
   "created_utc": 1691394405,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4taz2",
   "message": "Absolutely nothing…\n\nLong story short…\n\nI’ve had a fiancé lie which lead to the funeral of my first born and the relationship deteriorate over night. I was arrested before all charges were dropped, and she was the one who ended up before a judge with a criminal record. I’ve had a girl I dated for only a month get pregnant then drive me to near bankruptcy over a custody battle when I wanted to keep my son in my life. I’ve battled depression my whole life. Struggled with drug and alcohol abuse on and off. Lost a parent at a very young age. I dropped out of high school, just to finish college with a scholarship. I’ve made bad choices, and I’ve made good choices. I have a son who’d I’d die for and a career I love. \n\nEverything in my life that’s ever happened to me has made me who I am today. I’m not perfect, but I wouldn’t change a thing",
   "created_utc": 1691394438,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tej7",
   "message": "go to therapy lol",
   "created_utc": 1691394516,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tet7",
   "message": "Stop being so kind to people who don’t deserve it. And if they start drama because of it, turn your cheek the other way because they are only mad that they can’t use you anymore.",
   "created_utc": 1691394522,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tetw",
   "message": "- college will get you nothing. Drop out now and make every contact you can in theater. A global crisis will kill that career path dead in 2020. Get as many productions staged as you can beforehand.\n- get your books published ASAP. In 2023 AI is going to kill that dream too. Your only hope is to get grandfathered in beforehand\n- don’t wait till your 30’s to take romance seriously. This thing called “dating apps” will destroy the dating economy irreparably. Be married by 30.\n- in 2014 things are going to start getting weird. Then it’s going to go batshit in 2016 and it’s going to stay weird until 2020 when the crippling weirdness just becomes the new normal. You can’t fathom how much you’ll hate it. CHERISH the precious few years of sanity the world has left\n- don’t worry about moving to a major city. The universe isn’t screwing you. It’s saving you. Enjoy the cheap rent. It’ll let you travel the world later, have expensive hobbies, and be totally fine\n- I know you’re in the middle of a major mental health crisis and this will be hard to hear, but taking this suffering on now was the correct call. It’s going to stay rough for a while. The word you need to know is “fusion”.\n- progressive lefties are the most cutthroat piranha you’ll ever meet. Every confidence you say to them now will be weaponized against you post-2014. Relating to the prior point; you’ll get the aforementioned “mental crisis” resolved by 2014 at your current trajectory. Thank the gods you’ll be operating in high gear by the time the crazy starts.\n- your “best friends” are not your friends…well, one is. Love her to pieces. The rest can fuck themselves by the time it’s said and done. Don’t worry, you’re good at making new friends.\n- quit drinking soda ASAP! Quit alcohol when you’re ready. Just know that when you do it’s going to do a bizarre amount of damage to your social life\n- oh you’re a resolute atheist, huh? Bwaaaaa! By the gods, you can’t know how funny that is in retrospect.",
   "created_utc": 1691394522,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tjtt",
   "message": "Drop your degree und study something that really interests you. Forget medical school though as you will develop an allergy against hand sanitizer.",
   "created_utc": 1691394632,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tkar",
   "message": "Buy apple, amazon, and bitcoin. Oh, and when you’re 22 theres going to be this hot bartender on the roof….. She wants you so go for it!",
   "created_utc": 1691394643,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tmzo",
   "message": "Buy that Porsche 911. That’s the only chance you’ll ever have",
   "created_utc": 1691394701,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4todr",
   "message": "Follow the rabbit hole, find your passion and build on it..\nDon't let people you think are your friends dictate your path. Find it yourself.\n\nTook me until 30 to get diagnosed with ADHD and ASD. These 2 diagnoses helped me unravel years of misunderstandings. \n\nIf i had the drive I had now back then, I'd have gotten my qualification 10 yrs earlier and would be significantly better off for it.",
   "created_utc": 1691394731,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4touo",
   "message": "Break up with her. She's going to steal the next 11 years from you, and you deserve better.",
   "created_utc": 1691394742,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tplw",
   "message": "I would be like\n\"I am you from the future. In about 3 months terrorists are going to crash planes into the world trade center. These are their names, this is where they are now. This is the FBI #, CIA #. Here are some future events to show I'm not lying, but don't tell them about time travel.\"",
   "created_utc": 1691394758,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tquu",
   "message": "Don't waste those bitcoins on weed",
   "created_utc": 1691394786,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tskj",
   "message": "to make more of an effort to see ur mom before she passes.",
   "created_utc": 1691394825,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tt1j",
   "message": "You have this subconcious desire to try and rescue people from hostile, traumatic environments. You can’t. Your efforts will only result in such people abusing you.",
   "created_utc": 1691394836,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tvk4",
   "message": "You don't have OCD, you're just autistic. You're smart enough to be a biologist, go for it. Go into medicine, be a zoologist, go into medical research. You can do it, don't let anyone make you feel like you're not good enough.",
   "created_utc": 1691394892,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tvpo",
   "message": "I need my future self to tell me what to do. Not me telling my younger self.",
   "created_utc": 1691394896,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tyd1",
   "message": "Don’t be impulsive!  In the past my tendency to not think before I act or speak has lead to poor decisions! 67f",
   "created_utc": 1691394957,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4tzio",
   "message": "Get out of your comfort zone , continue with job, don't get married for wrong reasons",
   "created_utc": 1691394983,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4u0kc",
   "message": "She may be an amazing shag....but don't do it",
   "created_utc": 1691395008,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4u3ad",
   "message": "Nothing. Ever seen Election? There’s a scene near the end where Chris Klein’s character is ruminating on how his life might have turned out if the high school student body president election had turned out differently. He finally turns to the camera and says “Or I might be dead.” It’s meant to show that he’s a bonehead but I think it’s a great philosophy. Change any one tiny thing and you could be cutting your life short. Let yourself fuck up. Bad financial decisions, toxic relationships, simple wrong turns while driving. Any corrections could end you if you think about it.\n\nThat said, I might tell myself to invest in Google…",
   "created_utc": 1691395070,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4u3bz",
   "message": "Wu Wei",
   "created_utc": 1691395071,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4u3ym",
   "message": "You have bipolar. \n\nAlso don’t drink.",
   "created_utc": 1691395084,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4u506",
   "message": "L♡L",
   "created_utc": 1691395110,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4u53g",
   "message": "Invest portion of your income into bitcoin each month...\n\nHad those fuckers back in 2012.\nWould've been like €600.000 right now\n\nBut stepped out",
   "created_utc": 1691395112,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4u8ve",
   "message": "don't bother with uni",
   "created_utc": 1691395199,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4u9rv",
   "message": "Buy BitCoins",
   "created_utc": 1691395218,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4ueiu",
   "message": "It gets so much better, just wait and see. Don’t do anything stupid in the mean time.",
   "created_utc": 1691395327,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4uer4",
   "message": "imma be 20 in 3 years",
   "created_utc": 1691395331,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4ufkb",
   "message": "Don't do it, talikod sabay lakad palayo",
   "created_utc": 1691395350,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4ui8q",
   "message": "Im 23 so no deep mostly cringe like most of the comments but anyways buy a house in 2020 lol",
   "created_utc": 1691395412,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4um7w",
   "message": "Buy 10000000000 bit coin and become the richest guy in the universe . You will still be sad and lonely but at least you live in a fortress \\o/",
   "created_utc": 1691395499,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4un6a",
   "message": "middle aged women love screwing 20 year old guys",
   "created_utc": 1691395520,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4uofv",
   "message": "I'm in my mid 20's, but I'd tell my 20-year-old self to not be as anti-social and to stop being an island. I understand that most people aren't going to be your cup of tea, but you don't need to be such a dick about it. If anything, the world revolves around who you know vs. what you know, and knowing more people will make your future much easier for you. \n\nI still became successful, but it would've been easier if I had more connections.",
   "created_utc": 1691395549,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4upe6",
   "message": "Buy $100 worth of bitcoin (sold at around 0.0008 at the time) and liquidate all of it at the beginning of November 2021. Then buy QYLD and live off the dividends.\n\nAlmost forgot. Keep fighting for the girl you met whom asked to braid your hair.",
   "created_utc": 1691395570,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4uql1",
   "message": "I would tell my parents to get a divorce and get help to process their own childhood traumas, instead of letting it destroy the family 30 years later.",
   "created_utc": 1691395595,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4urus",
   "message": "I am 20 years old right now, so does that mean that, I can talk to myself without the time travel bit ?",
   "created_utc": 1691395624,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4ut6u",
   "message": "Study the Bible more and you knew you didn’t want to marry him so dnt.",
   "created_utc": 1691395653,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4uxdf",
   "message": "dont go back to the psycho",
   "created_utc": 1691395747,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4v0by",
   "message": "- Stop joking around so much\n- Listen more to everyone\n- Respect people who better at the job than you and learn from them\n- Save money more aggressively\n- Buy a house that is more than you can afford\n- be more honest with the girls you date\n- be kinder to your family\n- be a better friend",
   "created_utc": 1691395813,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4v2sd",
   "message": "Stop smoking, it’s obvious.why.",
   "created_utc": 1691395868,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4v69j",
   "message": "How's that pandemic going?",
   "created_utc": 1691395947,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4v6hq",
   "message": "I'm 18",
   "created_utc": 1691395951,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4v7pn",
   "message": "Buy apple stocks.",
   "created_utc": 1691395979,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4v8h6",
   "message": "Switch to lactose milk earlier.",
   "created_utc": 1691395997,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4v9ab",
   "message": "You need ADHD meds, exercise, and new friends.",
   "created_utc": 1691396015,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vemm",
   "message": "Be kind too everyone, regardless of how you think it will affect your own social status.",
   "created_utc": 1691396138,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vflu",
   "message": "I'd be going into the future; I would ask my future self what I regret doing/not doing, and for any tips and knowledge in fields of art and such",
   "created_utc": 1691396161,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vhqy",
   "message": "Do it! do it all over again! Nobody knows shit! They makeup it up as that go along! Just keep doing it!",
   "created_utc": 1691396212,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vih0",
   "message": "\"I think I got lost. I went back in time and now I'm in the future. Anyways, will I get bitches?\"",
   "created_utc": 1691396228,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vitw",
   "message": "Stay single for the next 5 years !",
   "created_utc": 1691396236,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vjld",
   "message": "Buy stock in Google and Amazon",
   "created_utc": 1691396254,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vkwq",
   "message": "Quit rushing and stressing trying to uphold someone else's standard.  Just soak up the experience and learn everything you can.  You are going to find your path to making your positive impact in the world. You are going to find the person that you want to share it all with. Be patient and keep learning.",
   "created_utc": 1691396283,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vlkd",
   "message": "That breaking up with your long-term girlfriend (who you moved to another country for) after you caught her cheating isn't the end of the world, and shouldn't change your life plans/dreams.  Essentially, I'd be the friend in Jacques Brel's song \"Jef\".",
   "created_utc": 1691396299,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4voxb",
   "message": "Don't go to brussels",
   "created_utc": 1691396375,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vp5j",
   "message": "Don’t ghost your friends",
   "created_utc": 1691396380,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vpp3",
   "message": "Go to the doctor",
   "created_utc": 1691396392,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vqgf",
   "message": "Do not try opiates",
   "created_utc": 1691396408,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vr9h",
   "message": "You don’t have to marry him",
   "created_utc": 1691396427,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vrmm",
   "message": "well I'm 23 now and when I was 20 we were in the middle of the pandemic, so I would probably tell myself good luck and hang in there",
   "created_utc": 1691396435,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4vt62",
   "message": "Start existing?",
   "created_utc": 1691396469,
   "score": 1,
   "submission_id": "15kbp69"
  },
  {
   "comment_id": "jv4w0cy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kbp69"
  }
 ]
}