{
 "submission_id": "15kg2v6",
 "title": "What was a red flag that made you stop talking to a person immediately?",
 "selftext": "",
 "created_utc": 1691401935,
 "permalink": "/r/AskReddit/comments/15kg2v6/what_was_a_red_flag_that_made_you_stop_talking_to/",
 "score": 19,
 "url": "https://www.reddit.com/r/AskReddit/comments/15kg2v6/what_was_a_red_flag_that_made_you_stop_talking_to/",
 "comments": [
  {
   "comment_id": "jv52lqs",
   "message": "When someone shows signs of controlling behavior, such as trying to dictate what you wear, who you talk to, or where you go. This behavior can be a sign of potential psychological abuse.",
   "created_utc": 1691402028,
   "score": 53,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv55n56",
   "message": "racist/sexist remarks",
   "created_utc": 1691404365,
   "score": 37,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv57j6i",
   "message": "A guy I met on a dating app was nice on the first date, and then on the second date started giving me a lecture as he was DRIVING ME to a \"beach picnic\" about how he felt neglected because he expected more from me and asked me directly when we would be having sex. [Feeling lectured about not having sex on the first date, on the SECOND date, yes. **RED FLAG**]. I was VERY UNCOMFORTABLE with that conversation, obviously. \n\nHe ended up not taking me to the beach but (of course!) to his apartment. I told him I thought we were having a picnic at the beach. \n\nI guess we both red flagged each other. Me for refusing to go into his apartment, and he called me a bitch once I said, \"no\" I'm not going upstairs to your apartment.\n\nAnyway, I walked to the beach by myself and caught public transit home.",
   "created_utc": 1691405706,
   "score": 20,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv55udn",
   "message": "Being highly critical, bad mouths other people. Have a colleague that finds fault in anyone. Completely off putting.",
   "created_utc": 1691404510,
   "score": 18,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv54eze",
   "message": "Unsolicited nudes",
   "created_utc": 1691403450,
   "score": 16,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv54bst",
   "message": "Dude had no boundaries at all, would sit very far into my personal bubble and wouldn't listen to \"you don't need to be this close.\" several times over during his training at the office. \n\nNo surprise he turned out to be a pervert.",
   "created_utc": 1691403383,
   "score": 14,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5b0f4",
   "message": "Openly saying \"I'm not a nazi, but...\" And literally anything he said after that.",
   "created_utc": 1691407955,
   "score": 11,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv57aca",
   "message": "Fundamentalist.\nAnti vaxxer.\nDoesn't respect boundaries. \nMalignantly stupid.",
   "created_utc": 1691405537,
   "score": 14,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv59tin",
   "message": "I was dating this guy for a short time and out of nowhere he brought up some internet guy who killed himself cause his ex had alienated him from his kids (allegedly) and then old mate started going off more generally about women making up domestic violence claims. Yeeted out of there immediately.",
   "created_utc": 1691407209,
   "score": 7,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5ao9j",
   "message": "Her response to everything was \"okay, cool\" \n\nAnd I mean EVERYTHING",
   "created_utc": 1691407748,
   "score": 7,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5b978",
   "message": "They only wanted to talk about themselves",
   "created_utc": 1691408104,
   "score": 7,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5asm4",
   "message": "Had been on a couple of dates with a girl in my late teens. She was a teenage mother who'd had her kid at 17, he was a year old. She'd invited me over after he was asleep for some non-sexy hangout time (she'd said she wasn't ready for it yet) and she said she liked the idea of an all-nighter playing board games. I asked if she wanted me to pick up some Red Bull for when it got late and we started flagging, and she said \"I was thinking something a little more illegal\"\n\nI noped tf out of there immediately.",
   "created_utc": 1691407823,
   "score": 4,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5bsuv",
   "message": "Not many people I've completely cut off, but I've really pulled back on the reins of friendship with a few people once I saw that every issue in their life apparently stemmed from seemingly only the people around them and never actually themselves.",
   "created_utc": 1691408435,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5d1n2",
   "message": "She told me she didn't allow her kids to be vaccinated for a single thing.",
   "created_utc": 1691409168,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv54o8r",
   "message": "As soon as I told him I lived in USA he immediately became really interested and talked about how (if things worked out) maybe he could move up here. I don’t remember where he said he lived, but I know it wasn’t anywhere good.\n\nYeah he couldn’t have been more obvious that he wants to find someone to use to get citizenship 🙄",
   "created_utc": 1691403644,
   "score": 5,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5err0",
   "message": "When he told me I had no reason to be jealous of girl A because he’d never been attracted to her and if I should be jealous of anyone it should be girl B 🤣",
   "created_utc": 1691410149,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5flzs",
   "message": "A guy would not stop talking about my kids. As a single mom I am used to guys I date asking questions. They are trying to figure out the situation and I totally get that. That said usually the conversation will change and we move on to something else. This guy though ONLY wanted to talk about my kids. I kept teying to change the subject and everytime he would bring back around to my kids. He eemes weirdly obsessed with them so I noped right out of that.",
   "created_utc": 1691410617,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5g17w",
   "message": "When you notice that they try to sabotage you or talk your accomplishments down (often as a result of jealousy)",
   "created_utc": 1691410848,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv52qe5",
   "message": "Well, let me tell you, there was this one time I was chatting with this person and they casually mentioned that they believed pineapple belongs on pizza. I mean, come on! That's an absolute deal breaker right there. I couldn't continue the conversation after that. Pineapple on pizza? No, thank you. Next!",
   "created_utc": 1691402134,
   "score": 8,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv55p0i",
   "message": "She simply told my own story disguised as her own to the whole class. And she replaced our friendship with the 'popular' kids. And saying \"we shouldn't meet in public anymore.\"",
   "created_utc": 1691404403,
   "score": 2,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5d4oe",
   "message": "People who can never seem to realize they’re the problem. I can understand being stubborn and blinded by your emotions once in a while but some people see themselves as the victim in every single situation.",
   "created_utc": 1691409215,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5eg97",
   "message": "Guy kept making jokes about things involving children. Some mutual friends, the dude and I were out day drinking on a weekend, downtown, and some kids were walking by. The third time it happened I was going to make a comment to him and I realized he was watching some of the kids walking further down the side walk. He was licking his lips the way you do when you see a girl you wanna bone. He looked over and saw me looking at him like 'dude wtf?' and he had that look like he'd been caught. \n\nGave me the willies and I cut the dude out of my life. Warned some of our mutual friends with children to be vigilant when he was around. Didn't say anything further than that but one of the girls said she caught him checking out one of her neighbor's kids while they were swimming. Not something I could just call the police and say 'yeah there's this creepy dude and he's looking at children like they're made of meat...' so I just did the next best thing I could and avoided him all together.",
   "created_utc": 1691409970,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv532co",
   "message": "When they start saying that people like me should not exist, like that my gender-affirming surgery would be mutilation or when they say Andrew Wakefield was right.",
   "created_utc": 1691402398,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv56t6h",
   "message": "He was super toxic",
   "created_utc": 1691405208,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv55fmc",
   "message": "Around late 2019/early 2020, I met a man online.who was around my age or a year older (I was 21F) at the time). He was one of the only people I’d talk to  online. I met him when I use to stream on Twitch. \n\nI realised looking back that there were a few red flags with this friendship. One of which being that he was a bit of a creep. He insisted on buying me various video games even if I said no. He said inappropriate things that made me uncomfortable, even when I protested and he even mentioned having a crush on me, I rejected him and he didn’t talk to me for awhile. He just made me feel weird and I didn’t understand why at the time.\n\nI didn’t cut him off until he started bullying my younger brother, who was 13 at the time. He wasn’t even an annoying teenager. He would just be doing normal teenager stuff and this “friend” would think it’s rude or annoying. Plus he didn’t like that my brother and I had a close bond. I didn’t want to put mg brother through that and blocked him.",
   "created_utc": 1691404210,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv59t38",
   "message": "Hating me behind my back",
   "created_utc": 1691407202,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5c8wo",
   "message": "Clinging and jumping to conclusions. Like, an ordinary chit chat and plain socialising is definitely a date in their heads. Happened more than once unfortunately. Even while they knew that I'm taken",
   "created_utc": 1691408703,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5cixk",
   "message": "When they can't take \"no\" for an answer and try to control what you do even though you've told them politely multiple times not to do something - they do it anyway.",
   "created_utc": 1691408867,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5cju5",
   "message": "“All my exes are crazy”👀",
   "created_utc": 1691408883,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5d0ll",
   "message": "In person? Ranting about his ex.\n\nI just start seeing myself being ranted about in a few months. No thanks.\n\nOnline? There was this guy that I started to chat to and he seemed genuine and nice at first. After a few messages back and forth he told me that he would like to see me in a sexy pose in a cute little dress, pigtails and with a lollypop in my mouth. He totally meant it. I blocked+reported him but he is still around.",
   "created_utc": 1691409150,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5edq8",
   "message": "Unsolicited dick pic. Block/delete every time.",
   "created_utc": 1691409932,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv52l0f",
   "message": "They started laughing uncontrollably for several minutes, even though the joke wasn't that funny",
   "created_utc": 1691402012,
   "score": 255,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv52krc",
   "message": "They were racist 🤷‍♂️",
   "created_utc": 1691402006,
   "score": 255,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv55ced",
   "message": "Signs of being a cry bully, or they go full tilt with their political views/activism like we are at that point in a friendship or whatever. Just giving me hurdles or roadblocks that are not part of a healthy friendship or what have you.",
   "created_utc": 1691404143,
   "score": 0,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5dcyu",
   "message": "They make comments about your body and ask invasive questions like do you have an eating disorder? It’s the assumption that you are not ok and have an eating disorder… that’s just such a weird thing to ask someone after they lose weight!",
   "created_utc": 1691409350,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5cjey",
   "message": "I used to be a professional musician. I retired from it, and you would never guess to look at me or hear me speak. I still like to leave little bits of my past around like pictures and such, because if I've never met a person - and the very first thing they reference is that - I know their priorities are screwed up and that is my ultimate red flag. I like it when people don't even recognize that aspect of me. Just because I was a well known performer doesn't mean I am someone who matters. I'd like to think my ideology and choices I make - are what make me who I am. A person will never be able to see the true me, if they only consider materialistic moments in my life. If I have a dating profile I leave a few pictures on there. Some people never reference it and THEY get a second message. Those who say \"Ohhhh you're a musician, HOT. What song would you play for me\" or \"Would you write a song about me if we dated\". The answer is no, and it warrants the end of that conversation.",
   "created_utc": 1691408876,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv59z2w",
   "message": "They liked me.",
   "created_utc": 1691407306,
   "score": 0,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv53k59",
   "message": "This was one of them when I was still dating using Tinder and Bumble. And I might have been an idiot for this, but I matched with this girl and we got to talking and she was hitting a lot of check marks, I told her I like to play video games to escape from my real world issues and she sounded hesitant to tell me something (later found out she hated games and thought it was a waste of time and for children). Before I knew that about her I told her I was playing Twilight Princess and she said “Oh I like that one. It’s the one with the guy in green named Zelda right?” I told her I had to get off the phone and then blocked her after that. At the time it bothered me because she said it so un-enthusiastic about it and I don’t want someone who is just trying to relate to my hobbies If they aren’t genuinely asking like now with my current Girlfriend she doesn’t understand a thing about WoW but I know when she asks me about “what mounts did you farm today?” She is asking me genuinely because she likes how happy and excited I get to talk about something I enjoy.",
   "created_utc": 1691402788,
   "score": 250,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5aoof",
   "message": "Making the conversion about how life is so hard for them, if life is hard get up and do something about it, and don't complain to me about how hard it is for you, get a therapist to talk about hard your life is, not a regular person!",
   "created_utc": 1691407755,
   "score": 252,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5bsax",
   "message": "If they don't like batman then you know they are pure evil they probably kick puppy's when they are sleeping",
   "created_utc": 1691408426,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5ecqe",
   "message": "If she is egocentric, full of herself, and fake or a liar.",
   "created_utc": 1691409917,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5egou",
   "message": "\" When they brag \"",
   "created_utc": 1691409977,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv59iii",
   "message": "They weren't responding and kept sending me links to shady websites. Also, they were repeating something about bitcoin...",
   "created_utc": 1691407013,
   "score": 0,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5eqnc",
   "message": "Rudeness",
   "created_utc": 1691410131,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5ew2o",
   "message": "Was a friend of a friend from college who was visiting the country and asked to hang out (pretty common for college friends/friends of friends whom I haven't seen in years). I have a lot going on but suggested a lunch catch up on a Thursday and he shoots me with a \"yeah I'll let you know.\" A week later and no response, so I make plans for the day assuming he's forgotten. Then an hour before lunch on Thursday, I get a message from him - \"so, where are we going for lunch?\" I couldn't make it to the city in an hour from where I was, but I feel bad and suggest Friday as I'd be in the city for work anyway. Again, I get an \"I'm busy but I'll let you know.\" Nevertheless, I keep my lunch hour open on Friday. \n\nWell lunch rolls around and I get a message from him with \"I'm still out with my friends, but I'm staying at \\[hotel name\\], can sneak away for like 20 minutes to hook up ;P\" I'm a bit confused, but I give him the benefit of the doubt and ask \"what do you mean by hook up?\" He says \"you know, the dirty stuff ;)\" \n\nI instantly tell him I have a boyfriend and that's not at all what I thought he meant when he first told me he wanted to catch up, but even if I didn't have a bf I still wouldn't be interested. He sends a bunch of laughing emojis with a \"my bad\" and tries to ask about my bf, so I block him.\n\nAlso felt incredibly disgusted that he thought the way he was treating me with the \"I'll let you know's\" was the way to get into a girl's pants, and sad that that has likely worked for him in the past. Red flag in a \"friend\" and definitely in a human being.",
   "created_utc": 1691410216,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5exp8",
   "message": "I met a girl who only ever talked about herself. When she wasn't talking about herself, she was insulting all of her friends. I noped out of there real quick.",
   "created_utc": 1691410242,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5ezmj",
   "message": "When they said I had white privilege.",
   "created_utc": 1691410271,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5f078",
   "message": "A fellow worked in the same building, and we said hello on the elevators for a few months. We finally were able to talk when we were both outdoors at the same time. Well, he began by explaining how many degrees he had, how many homes and how much money, etc. Then he asked about me. I simply stated that the break was over and we could talk next time. It really turned me off as it didn't sound like bragging, but more like probing to see how additional assets (mine) could be combined with his. I never spoke to him again.",
   "created_utc": 1691410280,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5f2xj",
   "message": "She has 3 kids to 3 different guys. Expected me to help raise them",
   "created_utc": 1691410324,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5f7nv",
   "message": "Bullying. Yelling. Homophobic narcissist.",
   "created_utc": 1691410395,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5ffbm",
   "message": "When the guy on the dating site claimed his social anxiety was so bad that even a library was too public a place to meet, and asked if we meet alone in one of our homes. Fuck no.",
   "created_utc": 1691410515,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5fhvm",
   "message": "I knew someone she was about my age , at the time didn't realize how \" clingy \" she could be and whatever I said jokes or actual stories I told her her fave thing to say to me was \" I don't get it \" I practically had to smack her in the head to understand things I told her ....",
   "created_utc": 1691410553,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5g8je",
   "message": "\"Well, speaking *as a mother*...\"",
   "created_utc": 1691410956,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5g98c",
   "message": "I met a woman through mutual friends and therefore thought I could trust her.  When I found out that she conned some people I had introduced her to, I immediately stopped all communication with her.  I had to apologize to friends, who in turn no longer trusted me. \n\nMy friends were shocked when I told them and they cut all ties with her also.  Turns out they knew her pre-cocaine, which explains an awful lot.",
   "created_utc": 1691410966,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5gd52",
   "message": "He not only dated someone much younger than them (which wasn’t as bad at first) but also kept wanting nudes/sex acts knowing they were so young even tho the girl didn’t feel comfortable",
   "created_utc": 1691411025,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5ge38",
   "message": "Has to be name brand. Food: eww you got the great value brand. Shoes: you should buy some Nikes. Got a used car: it's nice but it isn't a new beamer....etc",
   "created_utc": 1691411040,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5ggau",
   "message": "When he started insulting me when he is drunk.",
   "created_utc": 1691411074,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5ggis",
   "message": "My barber was constantly making chauvinistic comments like men are the king of the castle and women are meant to be submissive. Shit…….. he should try to explain that to my girlfriend and see how that works for him. He is older and comes from a time where that was more widely accepted thought pattern. But still, every haircut all haircut. Done. Bye.",
   "created_utc": 1691411077,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5gh19",
   "message": "Went person-to-person in a little group of bar-hoppers hoping that we were all pro-George W. Bush. Insistent and oddly presuming we all were pro-Bush since it was a conservative area and era (2004).\n\nAt a gay bar, and he was gay. \n\n*I'm* not even gay, but needless to say, my mocking answer did not amuse him and we never crossed paths again. The memory of him puzzles me to this day.",
   "created_utc": 1691411086,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5ghub",
   "message": "When they asked if they could where my skin for a while",
   "created_utc": 1691411098,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5gl8l",
   "message": "Hugo.  I worked with a dick named Hugo.  I was promoted to manager with no experience of three people and they each conspired together to get me demoted.  Hugo was a constant source of disagreement and arguing such that he would never “launch” within his position. So one day when I was trying to explain the purpose of a report and he “disagreed” with the obvious points I made, I decided I was no longer investing my time in Hugo and stopped talking to him.\n\nRecently I read an article that giving someone the silent treatment is an unhealthy and insecure way of existing in the world and it ultimately causes depression and isolation to a few people.  So I tread lightly now, but I’m in my forties so there is a limit to the people I interact with.  Someone in their twenties has acquaintances they don’t have to see often that they can stop talking too with least ramifications.",
   "created_utc": 1691411150,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5gpsl",
   "message": "When I realized way too late that I had been tortured mentally and emotionally as a child.  My mom was already dead but I’ve cut ties with my father and I’m in my late 50’s. Better late than never, I guess.",
   "created_utc": 1691411219,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5h6kq",
   "message": "Started going on a tangent randomly about women and was very angry and demeaning. Noped out. He then claimed it was a joke and kept harassing me with phone calls. Blocked him then he started calling me from a friend’s phone.",
   "created_utc": 1691411470,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5haql",
   "message": "They casually mentioned they were part of a nazi party",
   "created_utc": 1691411532,
   "score": 1,
   "submission_id": "15kg2v6"
  },
  {
   "comment_id": "jv5hf9p",
   "message": "I dated a man for about a week before he tricked me into attending a family reunion and told me he loved me. Nope.",
   "created_utc": 1691411599,
   "score": 1,
   "submission_id": "15kg2v6"
  }
 ]
}