{
 "submission_id": "15kicwe",
 "title": "Anyone been unemployed for several years because of mental health issues then started finding job after? What did you tell the interviewer why you’ve been unemployed for a long time?",
 "selftext": "",
 "created_utc": 1691408693,
 "permalink": "/r/AskReddit/comments/15kicwe/anyone_been_unemployed_for_several_years_because/",
 "score": 26,
 "url": "https://www.reddit.com/r/AskReddit/comments/15kicwe/anyone_been_unemployed_for_several_years_because/",
 "comments": [
  {
   "comment_id": "jv5d96n",
   "message": "You took time off to deal with some health issues. And now that's over. \n\nThus, you will not be a risk for your employer. End of story.",
   "created_utc": 1691409289,
   "score": 29,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5cdk2",
   "message": "I was unemployed for 2 years because of a bunch of reasons. I just said I had to step away from work due to some personal reasons. They don’t really need to know more than that",
   "created_utc": 1691408779,
   "score": 10,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5cb5c",
   "message": "[removed]",
   "created_utc": 1691408739,
   "score": 5,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5ddg7",
   "message": "I took some time off from work. If anyone asked I generally referred to it as a career break. If they wanted details, I said I spent some time relaxing, took some holidays, spent time with friends and family, and played around with some software projects. Nobody's been overly worried by this kind of answer.",
   "created_utc": 1691409358,
   "score": 5,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5l6js",
   "message": "As suggested by another popular post previously - \"I'm under a NDA for that period; can't talk about it.\"",
   "created_utc": 1691413513,
   "score": 8,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5cpz4",
   "message": "I told them in interviews that I took some time of time, took a break and made sure that I was my best self in order to provide for my family and do the best I can for the future employer",
   "created_utc": 1691408982,
   "score": 3,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5o805",
   "message": "“2012-2015, Piled out due to depression and drugs”\n\nSeriously though, I just made up a job and put my dad down as my boss/reference. Luckily he owned his own business at the time and I did do *a little* work for him, so it wasn’t a complete lie. But I’ve never once been questioned about it nor has he received a reference call.",
   "created_utc": 1691414957,
   "score": 3,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5cfri",
   "message": "U might get away with just making up some job history that seems legit and they won't look into",
   "created_utc": 1691408815,
   "score": 248,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5rr6d",
   "message": "self employed",
   "created_utc": 1691416546,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5sqgb",
   "message": "I didn't work for a year and a half. When asked about the gap I said I took some time off and have told them it's for my mental health at times.",
   "created_utc": 1691416965,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5tjev",
   "message": "I was freelancing as an artist.  That's what I was doing when anxiety hit and prevented me from working.  A few jobs did get done, though.  But I had quit teaching and was forced to return to it after 3 years of financial disaster.",
   "created_utc": 1691417308,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5wvc4",
   "message": "This was me. I had to sell and close down a business I had spent years building up, which upset me enormously and caused significant financial hardship, which in turn, caused me to spiral downwards mentally. Twice, I got jobs by sailing through the interview, only to lose them because I just froze and felt incapacitated. \n\nAfter 2 years of doing bits and pieces, basically whatever would pay me enough to get me over the coming few days, I finally landed THE job that would get me out of my bad state. \n\nIn getting that job, I was reasonably upfront, bearing in mind that people weren't \\*quite\\* as understanding towards mental health issues then as they are now. \n\nThe bottom line is that I said I'd sold the business and took some time out after it, some of which was difficult mentally because of the change. I didn't put the jobs I'd lost on my CV and ramped up the \"taking time out\" angle.",
   "created_utc": 1691418700,
   "score": 1,
   "submission_id": "15kicwe"
  }
 ]
}