{
 "submission_id": "15kicwe",
 "title": "Anyone been unemployed for several years because of mental health issues then started finding job after? What did you tell the interviewer why you’ve been unemployed for a long time?",
 "selftext": "",
 "created_utc": 1691408693,
 "permalink": "/r/AskReddit/comments/15kicwe/anyone_been_unemployed_for_several_years_because/",
 "score": 206,
 "url": "https://www.reddit.com/r/AskReddit/comments/15kicwe/anyone_been_unemployed_for_several_years_because/",
 "comments": [
  {
   "comment_id": "jv5d96n",
   "message": "You took time off to deal with some health issues. And now that's over. \n\nThus, you will not be a risk for your employer. End of story.",
   "created_utc": 1691409289,
   "score": 213,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5cdk2",
   "message": "I was unemployed for 2 years because of a bunch of reasons. I just said I had to step away from work due to some personal reasons. They don’t really need to know more than that",
   "created_utc": 1691408779,
   "score": 222,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5cb5c",
   "message": "[removed]",
   "created_utc": 1691408739,
   "score": 5,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5ddg7",
   "message": "I took some time off from work. If anyone asked I generally referred to it as a career break. If they wanted details, I said I spent some time relaxing, took some holidays, spent time with friends and family, and played around with some software projects. Nobody's been overly worried by this kind of answer.",
   "created_utc": 1691409358,
   "score": 38,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5l6js",
   "message": "As suggested by another popular post previously - \"I'm under a NDA for that period; can't talk about it.\"",
   "created_utc": 1691413513,
   "score": 20,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5cpz4",
   "message": "I told them in interviews that I took some time of time, took a break and made sure that I was my best self in order to provide for my family and do the best I can for the future employer",
   "created_utc": 1691408982,
   "score": 45,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5o805",
   "message": "“2012-2015, Piled out due to depression and drugs”\n\nSeriously though, I just made up a job and put my dad down as my boss/reference. Luckily he owned his own business at the time and I did do *a little* work for him, so it wasn’t a complete lie. But I’ve never once been questioned about it nor has he received a reference call.",
   "created_utc": 1691414957,
   "score": 29,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5cfri",
   "message": "U might get away with just making up some job history that seems legit and they won't look into",
   "created_utc": 1691408815,
   "score": 246,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5rr6d",
   "message": "self employed",
   "created_utc": 1691416546,
   "score": 9,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5sqgb",
   "message": "I didn't work for a year and a half. When asked about the gap I said I took some time off and have told them it's for my mental health at times.",
   "created_utc": 1691416965,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5tjev",
   "message": "I was freelancing as an artist.  That's what I was doing when anxiety hit and prevented me from working.  A few jobs did get done, though.  But I had quit teaching and was forced to return to it after 3 years of financial disaster.",
   "created_utc": 1691417308,
   "score": 12,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5wvc4",
   "message": "This was me. I had to sell and close down a business I had spent years building up, which upset me enormously and caused significant financial hardship, which in turn, caused me to spiral downwards mentally. Twice, I got jobs by sailing through the interview, only to lose them because I just froze and felt incapacitated. \n\nAfter 2 years of doing bits and pieces, basically whatever would pay me enough to get me over the coming few days, I finally landed THE job that would get me out of my bad state. \n\nIn getting that job, I was reasonably upfront, bearing in mind that people weren't \\*quite\\* as understanding towards mental health issues then as they are now. \n\nThe bottom line is that I said I'd sold the business and took some time out after it, some of which was difficult mentally because of the change. I didn't put the jobs I'd lost on my CV and ramped up the \"taking time out\" angle.",
   "created_utc": 1691418700,
   "score": 4,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv60xxr",
   "message": "\"I can't talk about that gap. I signed an NDA.\"",
   "created_utc": 1691420342,
   "score": 79,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6i9nj",
   "message": "Keep an Etsy shop on the side.  For the missing time list the shop as a company name and yourself as sole proprietor. Congratulations!  You weren’t unemployed, you were a small business owner!",
   "created_utc": 1691426974,
   "score": 13,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5yk92",
   "message": "\"They made me stop working because I was *too* successful.\"\n\n\"Huh?  Who did that?\"\n\n\"The voices!\"",
   "created_utc": 1691419394,
   "score": 14,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6c504",
   "message": "I've sat on interview boards. Unexplained gaps can be seen as red flags.\n\nYou could say you were looking after a family member.",
   "created_utc": 1691424658,
   "score": 8,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6jk02",
   "message": "From my husband:\n\n\"Aided my aging parents looking after the farm and home.\"\n\nFrom me:\n\n\"Unfortunately, I signed an NDA\"",
   "created_utc": 1691427454,
   "score": 4,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5xzcx",
   "message": "I had a long period with little to no work. It has never come up. Been with my current employer close to 5 years  now.",
   "created_utc": 1691419158,
   "score": 3,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6bhfd",
   "message": "Said I was a stay at home dad. I mean, it was true, but I was also dealing with major depression and trying to get better.",
   "created_utc": 1691424409,
   "score": 4,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv714qw",
   "message": "I was out of work for many years, due to schizophrenia, hospitalizations, med changes, more hospitalizations, ECT twice. Both times after ECT, in 2008 and 2022, I had a full time job within weeks of finishing treatment. \n\nI did outpatient ECT last September to November, twice a week for 12 weeks and I was going to job interviews on days I didn't have treatments, mainly because driving after general anesthesia is not the best idea, so I'd go on days between. I was hired at a decent little machine shop a week before my last 2 treatments.\n\nI didn't tell them this. My dad got really sick (autoimmune, neurological, cancer caused a reaction that attacked a part of his brain controlling muscle and coordination, called paraneoplastic syndrome. He got up one day and couldn't stand up and coordinate his hands anymore. He never walked again) in 2017, and was in the hospital and rehab for months, but needed care at home so I spent a lot of time helping him and my mom. He passed away (the part of the brain attacked meant it was small cell lung cancer. Irony: he had no cancer in his lungs. It was everywhere else. It's a death sentence)\n\nHe passed in 2018, before Covid. I then got a job, Covid shut it down. So I used that a lot as a reason I didn't work. I had a few major mental issues during my dads illness, including a bad psychotic episode and have an exceptional care team and also support from my family until I stabilized. I was very fortunate.\n\nI used Covid when looking for work. Laid off, company shut down. I wasn't an essential worker, no one was really looking. I was a welder and general machinist. My company went under, so did many others. Then, in 2021 - 2022, I fell into a bad depression and ended up hospitalized for ECT fast tracking (being inpatient bumped me on the list, they discharged me when I was no longer suicidal and had outpatient set up. Covid restrictions sucked and there was little to do on the ward compared to before, where it was actually quite a good place with programs and activities)\n\nFor earlier, 2006-2010, when I had my first psychotic break, I just said I had went to different schools and had moved a few times to expand my interests. I also was a competitive horseback rider and exaggerated that a bit. I went into welding, back to school, and nobody asked about gaps.\n\nI rarely disclose. Schizophrenia freaks people out. I'm working full time and overtime (I was hired part time and they've completely ignored my availability I signed with) and I'm so done. They didn't give a fuck, they were desperate for anyone. It's cashier work in a busy tourist area.\n\nI wanted to slowly get back into a job and go to school for industrial automation (I start in September) because I have a computer programming background and welding and machining, both manual and CNC (robot) and was encouraged by my welding instructor, welder friends, as well as people online and a trade union I contacted, to go into CNC programming because I can't weld due to my medications making me even more heat sensitive\n\n. It's hard to stay safe welding in the heat without a med changing it. I can't sweat. This is common with all generations of antipsychotics from rhe 1950s until the newest out. My instructor in trade school encouraged me to do CNC programming aa well, and I'm starting the program in September.",
   "created_utc": 1691434010,
   "score": 3,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv63jim",
   "message": "Just say \"medical/health reasons\"\n\nIt's true",
   "created_utc": 1691421373,
   "score": 3,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv66gxn",
   "message": "Couple of good things to use, there's the truth but if you are afraid that could cost you the job (You don't need to go into detail, just say health reasons that you have recently gotten over) yuo can use self employment (I was a delivery driver until recently, I was a free lance artist, etc etc) Or you were providing end of life care for a family member. People keep saying oh say NDA but employers see through that shit because everyone and their mother are doing that and no one is buying it anymore. Besides most NDA's are not saying you cannot say what you did in a basic sense or admit to working at a place, its covering details, so it just looks bad to anyone hiring with basic knowledge of these tricks, where the other two I mentioned don't look nearly as see through as excuses. Good luck!",
   "created_utc": 1691422500,
   "score": 3,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv66t9g",
   "message": "I was medically retired because of health issues \u0026amp; out of work for over eight years. But, I was also a SAHM at that time. I'd say that my husband \u0026amp; I decided that I'd stay at how with the kids because they had lived having only one parent around a lot due to us both being active duty military. It still took forever to get hired.",
   "created_utc": 1691422633,
   "score": 3,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv67bkm",
   "message": "I didnt say anything and they didnt ask",
   "created_utc": 1691422829,
   "score": 3,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6f6gl",
   "message": "Not years, but I took a sabbatical last year for 6 months. I told my interviewers the truth. I took time off to get my health in order while working on a couple of contract gigs. No one said anything further after that.",
   "created_utc": 1691425813,
   "score": 3,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6f943",
   "message": "“I had some medical issues.”  It’s true.  And most polite folks won’t demand more info than that.  It’s worked for me in interviews for two different jobs that I’ve now had for 4 years each.  No shame.",
   "created_utc": 1691425842,
   "score": 3,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6oug9",
   "message": "I had to step away from work due to health issues.\n\nOr\n\nI was a main or one of the main caregivers for a family member for X amount of years.\n\nPersonally, I have not had anyone *really* scrutinize the timelines on my resume. I *have* had people ask if it was Covid related, as more than one place I worked at closed down despite being essential places during that time. I have learned not to outright lie but not to be too blunt. \n\nYou do not need to, nor should you go into detail. If they want details, do not feel pressured or forced to give them any. Anyone who says something like \"What were you doing from X to X?\" *Condescendingly* should be taken as a red flag. \n\nRemember, an interview is a two-way street and should be looked at as such. Any red flags or bad vibes on their end can tell you a lot about what to expect working there. I have found it helps to have a notebook and pen with me. I'll have common questions and my answers written down along with my questions for them. When they see me writing their answers down, they either get impressed or offended. Do not work for anyone offended by a notebook. \n\nI wish you all the luck",
   "created_utc": 1691429431,
   "score": 3,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6wz91",
   "message": "i guess it depends on what kind of work youre looking for. i worked large portions of my life in the black market cannabis industry, and at one point took a break to try out cooking japanese food professionally. i got a bunch of my grower friends to pretend to be clients for a fake landscaping business and i explained how i \"started\" my \"landscaping business\" and then listed them as references. \n\nthis kinda thing is probably fine for jobs like retail or restaurants or something where you know its unlikely they will do any kind of actual background check or dig around to verify the legitimacy of the company. probably not fine for jobs that are likely to actually check or care about that kind of thing. TBH even if my restaurant jobs found out that i lied and used to grow pot, i dont think they'd really care that much once im part of the team and doing a great job. ive landed a bunch of basic jobs with my fake landscaping resume.",
   "created_utc": 1691432462,
   "score": 3,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7611e",
   "message": "I’ve been working full time for over  decade but there was a period I was unemployed for a couple years. I think you can definitely say you took off for health or personal reasons \n\nBut I think there are other things you can do to boost your resume \n\n1) Volunteer. This is technically still a type of work just not one you get paid for. And  you can add it to your resume \n\n\n2) Try to get temporary work through an agency. This is actually how I got my current job. I did a lot of short term temporary work until I eventually found full time employment. They can definitely help you find something and help with your resume and the interview process",
   "created_utc": 1691435840,
   "score": 3,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv69ul3",
   "message": "I actually had a 3 year gap between jobs because of something similar. I prepared an answer (was just going to say health reasons and not elaborate) but luckily for me it turned out I didn't need it because when I went for my interview of my current job no-one seemed to care or even ask about the gap, it literally never came up and still hasn't. I still don't really know why but I'm not going to ask!",
   "created_utc": 1691423790,
   "score": 2,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6cek7",
   "message": "For me it coincided with the pandemic lockdown/my college graduation so I was able to describe it as difficulty finding a job in my field due to the economy (which is definitely half of the truth, but really if it weren’t for my mental health I could’ve been doing something much more productive). Hooray for anxiety/depression/addiction/depersonalization. After the first year I started doing Uber Eats so at least I was doing something, then I got a job in my field ~2 years after graduating. Doing better now, good luck!",
   "created_utc": 1691424760,
   "score": 2,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6f05g",
   "message": "I was unemployed from late 2017 until I started school again in 2020 until 2022 and then started working again in February. In my case it was a mix of mental health and physical disability and I for sure only talked about my physical disability when I justified the gaps in my resume. \n\nPeople are a lot more understanding when it comes to someone needing to figure out life again after getting that kind of diagnosis than someone just trying to figure out how to not hate life in general.",
   "created_utc": 1691425746,
   "score": 2,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv5xflu",
   "message": "I had to take care of a sick relative who has passed. Just lie. If you say you were sick they may worry about a relapse but if it is someone else you’re just a good person. And there isn’t a way to really verify this story",
   "created_utc": 1691418932,
   "score": 2,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv63fjj",
   "message": "I’ve been unemployed for almost a year now. I just had an interview the other day … I simply said “my boyfriend had to pick up more work hours so I took over looking after his son while he was away”. She didn’t question that.",
   "created_utc": 1691421330,
   "score": 2,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6dbii",
   "message": "I told my boss that I was volunteering for the abandoned children in the rainforest. And I got stranded in the middle of a deasert and had no food or water, and had to walk in the desert with the horse with no name.",
   "created_utc": 1691425111,
   "score": 2,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv64sv4",
   "message": "Future employer does not need to know you were unemployed. If he asks, you can just do what he will be doing later : lie.",
   "created_utc": 1691421861,
   "score": 0,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv68m6u",
   "message": "Mental health break\nCaring for a family member\n Are usually my go to. I’ve never had a follow up question. Also, if your break happened anywhere where 2020-2022 you have the very obvious answer of COVID (quarantine, layoff, etc)",
   "created_utc": 1691423322,
   "score": 0,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7datv",
   "message": "She had to breath and I was holding my breath. For-ward”in”: Way (:too long:)",
   "created_utc": 1691438553,
   "score": 255,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7e892",
   "message": "Long long time. Long time.",
   "created_utc": 1691438898,
   "score": 255,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7ean2",
   "message": "Umm. Fuck BIDEN.",
   "created_utc": 1691438923,
   "score": 254,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv637gw",
   "message": "You could simply tell them you took some time off work to focus on your mental health and now that you've gotten your affairs in order you are looking to rejoin the workforce.  \n\n\nAlternatively when they ask about your lapse in employment you could say \"I've signed an NDA and I'm unable to discuss any details for this period of time.\" I've heard this can also work and has the benefit of not having to disclose your private healthcare information with a potential employer.",
   "created_utc": 1691421244,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv67d1d",
   "message": "I would lie and say I became full time caregiver to incapacitated grandma/mother/father. \n\nOr that I signed and NDA and can't legally say who I was working for, but it rhymes with Floctor Pill.",
   "created_utc": 1691422845,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv67eb5",
   "message": "Turns out, I was busy being the CEO of my dog's fan club. But now I'm ready to conquer the job world!",
   "created_utc": 1691422858,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv67yy2",
   "message": "I was on sabbatical. If they press I say I was doing unpaid work to help a family member. Which is the truth. Don’t need to know I was looking after my special needs son",
   "created_utc": 1691423078,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6d86w",
   "message": "Say you signed an NDA",
   "created_utc": 1691425076,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6jvg3",
   "message": "If it were me I would probably just make something up. Tell them you worked at McDonald’s for 2 years. It’s better than nothing",
   "created_utc": 1691427574,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6kbt6",
   "message": "Just lie buddy, no one gives shit …\n\nexcept for contrarian Reddit trolls with no life experience.",
   "created_utc": 1691427747,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6mubd",
   "message": "If they ever ask just say “I can’t disclose that information due to a NDA” \nThey aren’t allowed to ask follow up questions and if they do ask them to politely move on because you can’t answer.",
   "created_utc": 1691428695,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6nk83",
   "message": "Lie lie lie lie. That’s the solution your prospective employer does not deserve the truth in this instance or really anytime before you get hired.",
   "created_utc": 1691428957,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6ny35",
   "message": "I would say you left the workforce to deal with some personal and family issues. Don’t elaborate.",
   "created_utc": 1691429099,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6o5es",
   "message": "Tell the truth or they may suspect you have been in jail.",
   "created_utc": 1691429174,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6q23y",
   "message": "I was dealing with medical issues. I was unemployed for 4 years",
   "created_utc": 1691429879,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6qsd8",
   "message": "1. Say you were saying care of a very sick loved one *your not lying love yourself damnit.\n\n2. Say you are under a nondisclosure agreement and cannot discuss that at this time.",
   "created_utc": 1691430151,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6rmr5",
   "message": "Say that you studied online. Then do the course online.",
   "created_utc": 1691430466,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6rn6r",
   "message": "\"I took a break from work for health reasons that are now resolved\" that's literally all you need to tell them. Any employer who wants to know more isn't one you want to work for.",
   "created_utc": 1691430470,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6t7nx",
   "message": "I'm not sure if they have the option to find out the truth in your country but if not, I would probably say I was taking care of a relative.",
   "created_utc": 1691431047,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6ubem",
   "message": "tell them you can't discuss it because you signed an NDA",
   "created_utc": 1691431461,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6vp60",
   "message": "i tell them i was taking care of a sick family member",
   "created_utc": 1691431980,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6vt9n",
   "message": "I joined a secret society of couch potato ninjas. Shhh, don't tell anyone!",
   "created_utc": 1691432024,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv6z3ca",
   "message": "Tell them, I signed a non disclosure agreement ans can not speak on the matter",
   "created_utc": 1691433257,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7111q",
   "message": "Self-employed through hobby. Wanted to keep loving my hobby, so I came here to hate this place instead.\n\nProbably do without the second sentence.",
   "created_utc": 1691433973,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv72aoo",
   "message": "When were you unemployed? Can you blame the Rona?",
   "created_utc": 1691434441,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv77ueh",
   "message": "Well, even while unemployed I didn't just stop so I told then what I was doing. Studying, learning how to play instruments, reading books.\nI just told the truth taking out the mental health issue out of the picture :s",
   "created_utc": 1691436525,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv793r6",
   "message": "That I signed an NDA and I'm not allowed to disclose any information regarding that.",
   "created_utc": 1691436997,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7b0zr",
   "message": "If it were me I'd try to frame it as a health issue, and get slightly indignant if they ask for details.",
   "created_utc": 1691437710,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7b6kv",
   "message": "I told them I had to work on some mental health issues and to get better and then I did. The last part is a lie, but they don't need to know that.",
   "created_utc": 1691437766,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7f3jf",
   "message": "Sure…the “I was caring for a family member who was having some severe difficulties” reason is a good one, and if true, very valid and most often respected; but if not true, will quickly be seen as a lie if you develop even the smallest relationship with your co-workers, whether that be professional or personal. Even if we try to avoid it, small talk almost always happens with co-workers, and even if innocent, people will pry and want to get to know a bit more about you. \n\nHonesty is truly the best policy, and as others have stated, just be sure to paint it as an issue of the past that you have dealt with and grown beyond.",
   "created_utc": 1691439217,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7ixlx",
   "message": "\"Independent Contractor\" and finding a job with a high turnover and shitty hours.",
   "created_utc": 1691440623,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7lus1",
   "message": "say you save enought money to take work free time and spending with your family, traveling or things like that",
   "created_utc": 1691441690,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7mzc6",
   "message": "Wanna fill a gap?\n\nSelf employment.",
   "created_utc": 1691442104,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7pam4",
   "message": "Lie and give some bs company u were working for that’s what I always said",
   "created_utc": 1691442975,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7sbnn",
   "message": "Oddly specific, and relatable question. \n\nI worked as a dietary aid in a nursing home for almost five years, ending mid '21. By the end, I was nearly institutionalized for losing so much weight, whilst battling my own mental health rather poorly. \n\nMy dad is incredibly smart about this, as he hires team members for his company. He said to say that 'I was taking some time off, due to all the stresses of working all throughout the pandemic', which was true. Began working full time right as it began, and since I was younger, I was sent into the Covid units to serve. (not important, but somehow never caught it. Crazy. )\n\nSo it wasn't a lie by any means. It's best to be very general, as companies usually don't care about the nutty gritty details. \n\nHope that, if this is about a real life circumstance, you're in a better mental state now. Working under so much strain is incredibly challenging, can affect the work output, and can overall just make things worse. Much love.",
   "created_utc": 1691444128,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7tdki",
   "message": "“I took the initiative to take some time to work on my mental health. Now that I feel like I’m in a much better state of mind, I’m excited to get back into work.” Something along the lines of that would be a good response. Just make sure to frame the reply like it’s not going to be an issue any longer.",
   "created_utc": 1691444534,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7u8qu",
   "message": "“Aliens. Just got back. Hope I didn’t miss too much.”\n\nBut seriously.  Just say you were retraining or focusing on your family.  That’s only if they ask and you don’t feel like telling them the truth.  It’s not their business what you’ve done with your time previously but they might try to use this as a way to determine if you’ll stick around for a while.",
   "created_utc": 1691444870,
   "score": 1,
   "submission_id": "15kicwe"
  },
  {
   "comment_id": "jv7uejk",
   "message": "Not for mental health, but I had some money I saved up. Took almost 2 years off to enjoy life. Just bs a business venture you were a part of or working on",
   "created_utc": 1691444932,
   "score": 1,
   "submission_id": "15kicwe"
  }
 ]
}