{
 "submission_id": "15kjo8v",
 "title": "What are the ways to heal your attention span and rewire your brain overall from the harms done by social media?",
 "selftext": "",
 "created_utc": 1691412150,
 "permalink": "/r/AskReddit/comments/15kjo8v/what_are_the_ways_to_heal_your_attention_span_and/",
 "score": 96,
 "url": "https://www.reddit.com/r/AskReddit/comments/15kjo8v/what_are_the_ways_to_heal_your_attention_span_and/",
 "comments": [
  {
   "comment_id": "jv5pgdj",
   "message": "Digital Detox: Take breaks from social media and digital devices. Consider a digital detox by completely disconnecting for a period of time, allowing your brain to reset and reduce the constant stimuli.",
   "created_utc": 1691415528,
   "score": 89,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5j03c",
   "message": "Spend more time in nature. Hikes. That’s my favorite way to slow down and make sense of stuff and d get organized. And remove the social media that you have, I found that putting it in a folder was still too accessible for me so I finally deleted my Facebook on my Snapchat account after over 10 years for the Facebook and like eight years with the Snapchat , last September and I’ve really had the best year ever.",
   "created_utc": 1691412422,
   "score": 39,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5jmyb",
   "message": "Tetris is supposed to help with PTSD. It seems like the way they think it works would also help accomplish this.",
   "created_utc": 1691412741,
   "score": 12,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5kt5e",
   "message": "About 2 years ago, due to an error on behalf of my provider, i was without internet access at home for a total of 19 days. Initially it was a total pain in the arse. \n\nAfter a couple of days I was used to it. After 3-4 days I noticed my attention span for other things was increasing. After a week my attention span was pretty much as it was a couple of decades ago, before we all had constant online access.\n\nI actually started to like not having constant internet access.\n\nSo my advice is, at least once a year, go turn off your router for a couple of weeks.",
   "created_utc": 1691413331,
   "score": 29,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5imwp",
   "message": "Get off social media for as long as possible",
   "created_utc": 1691412235,
   "score": 4,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5jfzw",
   "message": "Spend time outside",
   "created_utc": 1691412643,
   "score": 4,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5j397",
   "message": "Spend time outside, preferably without a phone.",
   "created_utc": 1691412466,
   "score": 7,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5jity",
   "message": "You'll get a lot of comments saying to do other things but lets be honest, quitting social media cold turkey would be near impossible.\n\nI'd say try to limit your activity slowly, trying to get less time in every so often. Maybe set a goal per week, keep to that goal for a week and try to go less.you don't have to quit completely either, just get to a point that's comfortable to you and engage in other activities as well to fill the gap. Reading or spending time outside could help with focus.",
   "created_utc": 1691412683,
   "score": 5,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5kwqb",
   "message": "I like to ride my bike to clear my head from the internet. Exercise in general is a good distraction.",
   "created_utc": 1691413379,
   "score": 3,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5qo0t",
   "message": "Step one is quit social media, including reddit",
   "created_utc": 1691416075,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5tast",
   "message": "Step 1: Throw phone out window. Step 2: Run away screaming. Step 3: Enjoy newfound freedom!",
   "created_utc": 1691417205,
   "score": 2,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5x3di",
   "message": "Close all social media accounts, seek out therapy if needed and make new friends who are not social media addicts. Best of luck on your journey!",
   "created_utc": 1691418792,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv6ec6p",
   "message": "These helped me a lot:\n\n* Read physical books - doesn't matter what, just anything that interests you. This one is simple and HUGE.\n* Watch movies with a rule: no looking at devices during the movie. And pick stuff that you've always heard was great but never got around to watching - classics, great dramas, Oscar nominees. Stuff that you know is high quality, you always meant to see it, but you were never quite in the mood because on any given night you'd rather see a superhero movie than a heartwrenching Korean drama about class struggle. Make a list and pick a \"good movie night\" day that happens every week.\n* If you've got a family or group: turn off wi-fi, turn off all the lights, pretend the power went out and play some kind of game by candlelight.\n\nThe first two you can do all by yourself (the third one was just based on a fun night I had when the power actually did go out).\n\nAll the media we consume is constantly having a huge influence on your brain no matter what. At least with books and movies, you can actively choose what goes in your head instead of having a random stream curated by an algorithm. And you get a full, rich story to digest instead of a string of 10-second blips.",
   "created_utc": 1691425498,
   "score": 12,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv605ut",
   "message": "less social networks. Especially the TikTok format",
   "created_utc": 1691420032,
   "score": 6,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv62l4r",
   "message": "Leave social media. Rediscover reading, long walks to no place in particular and embrace the art of being bored.\n\nTry doing nothing too, and by nothing I mean just sitting down staring at a wall or out a window. Life in my view is not supposed to be full of things happening *all* the time. \n\nSlowing down and detaching from things for a short time might do you some good",
   "created_utc": 1691421000,
   "score": 6,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv6abk7",
   "message": "Watching good old movies helped me. They have a long story line with less intermittent dopamine hits.",
   "created_utc": 1691423967,
   "score": 5,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5z1lu",
   "message": "Smother yourself with a nice pair of tits. Rest by snu snu",
   "created_utc": 1691419588,
   "score": 18,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv79124",
   "message": "Regular exercise. Anything that gets your heart rate up. My attention and mood are so much better when I’m exercising regularly. I see the most mental benefit for the next few hours following exercise. Mornings are a good time for me.",
   "created_utc": 1691436969,
   "score": 3,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv61ngj",
   "message": "Hippie flip",
   "created_utc": 1691420625,
   "score": 2,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv67qer",
   "message": "I think you can only do two things.\n\n1.If you want to still use smt like Tik Tok then watch every video till the end just dont scroll only exeption is when a video is like more than 2-3min long and you dont have any interests in the content of the video.\n\n2.Option stop using stuff like Tik Toks, Insta reels. Also if you want to still watch those videos than make it uncomfortable to watch that stuff what you could do is every hour you use a media with short videos you do 20 push ups. Thats a good way because you stop watching those short videos and you get muscles in the mean time.\n\nSorry for bad english its not my main language.",
   "created_utc": 1691422986,
   "score": 2,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv737mn",
   "message": "I can’t believe no one has said meditation. Even just 10 minutes a day can greatly change your life and give your brain much needed downtime. As the Buddha said, don’t take my word for it, try it and see what happens. Meditation can be done sitting, standing, lying down, walking. It can be done for seconds, minutes, or hours and all of it is valuable. You can do it with your eyes open or closed. You can do it in silence, with music, or guided. You can literally do it anywhere, anytime, without needing anything. \n\nThere’s tons of ways to meditate, but I find it incredibly valuable to come back to your breath as an anchor. Also- you could be breathing wrong. Your lower belly should be expanding first, pushing outline a balloon. It should feel like a deflating balloon as you breathe in. The way you can tell if you’re doing it correctly is put one hand on your chest and one on your belly. Take a deep breath. Your belly should rise before your chest. Also don’t force super deep breaths, just breath naturally, otherwise, if you’re like me, you’ll feel lightheaded and possibly discouraged.\n\nNow I’m just babbling because this is a topic of interest of mine.\n\nTLDR: Meditate",
   "created_utc": 1691434782,
   "score": 2,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv670va",
   "message": "Set your modem to only allow internet for x amount of hours or for a specific time.",
   "created_utc": 1691422715,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv67fg9",
   "message": "Talk to people, have conversations, preferably with no digital devices in hand.",
   "created_utc": 1691422870,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv67pen",
   "message": "Sure, I'll just book a one-way ticket to Mars and call it a digital detox.",
   "created_utc": 1691422976,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv682uh",
   "message": "By not using social media",
   "created_utc": 1691423119,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv69qzq",
   "message": "The real answer is books. Reading books will train your attention span back to where it should be.",
   "created_utc": 1691423752,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv6ab01",
   "message": "Get off media (like Reddit) and engage in activities that require more concentration and focused attention (reading, practicing math, etc.)",
   "created_utc": 1691423961,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv6d295",
   "message": "It's a one step process: Quit social media.",
   "created_utc": 1691425012,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv6e65i",
   "message": "I don't know if this actually helps, but: watching tv show intros, being in nature, doing jigsaw puzzles, and crafting things",
   "created_utc": 1691425434,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv6i9l2",
   "message": "Downgrade to a flip phone and experience the great outdoors.",
   "created_utc": 1691426973,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv6jyr2",
   "message": "Stay away from the internet for a month.",
   "created_utc": 1691427610,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv6pdeq",
   "message": "Listen to the Cleartape a million times, I guess.",
   "created_utc": 1691429628,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv6rorp",
   "message": "Start reading books again!",
   "created_utc": 1691430487,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv6wmsb",
   "message": "Just take some time off.",
   "created_utc": 1691432332,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv6xj8n",
   "message": "Read books. Start with easy young adult fiction",
   "created_utc": 1691432668,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv6yxlt",
   "message": "can't help you there, lost interest half way through reading that title",
   "created_utc": 1691433195,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv71u96",
   "message": "Read more books.",
   "created_utc": 1691434272,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv73u5g",
   "message": "I just play video games and watch meme compilations on youtube.",
   "created_utc": 1691435017,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv79dsl",
   "message": "Generic answer here:\n\nClose your tabs on social media for a good bit, catch up with hobbies such as drawing, reading, sports or simply take a lovely dander or chit-chat with somebody you know about relatable topics like the weather and hang out with them.\n\nThere's probably many other answers to such a question, but those are some good ones.",
   "created_utc": 1691437101,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv7comd",
   "message": "I just stopped watching so much short content and started watching things that would be 15-60 minutes long",
   "created_utc": 1691438320,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv7d2fg",
   "message": "Go sit by a lake or a tree and sit with yourself. Hard at first, but let your mind breathe. Form your own thoughts rather than the thoughts media plugs into your mind. At first they might still be copy paste resin but after a bit it’ll ease off the endless reel in your head",
   "created_utc": 1691438464,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv7f7jv",
   "message": "If you succeed in doing that you'll just be on the outside looking in, surrounded by idiots that determine if you have money that you can't relate to and you'll just grow more angry.",
   "created_utc": 1691439258,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv7i93w",
   "message": "Get off of reddit as a start xD",
   "created_utc": 1691440376,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv7kq37",
   "message": "Slowmaxing.\n\nRead War and Peace. Go for a three hour walk. Watch the Godfather Trilogy. Put together a one million piece puzzle.\n\nPlant a seed.",
   "created_utc": 1691441280,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv7upwh",
   "message": "I've been going back to physical mediums like drawing, reading, etc. Anything that can occupy time without a screen. Lego is cool too cause you can basically build machines with it.",
   "created_utc": 1691445055,
   "score": 1,
   "submission_id": "15kjo8v"
  }
 ]
}