{
 "submission_id": "15kjz4d",
 "title": "What's the weirdest encounter you ever had with a complete stranger?",
 "selftext": "",
 "created_utc": 1691412959,
 "permalink": "/r/AskReddit/comments/15kjz4d/whats_the_weirdest_encounter_you_ever_had_with_a/",
 "score": 90,
 "url": "https://www.reddit.com/r/AskReddit/comments/15kjz4d/whats_the_weirdest_encounter_you_ever_had_with_a/",
 "comments": [
  {
   "comment_id": "jv5sls6",
   "message": "I was smoking a cigarette outside my college (downtown Boston) and a guy who looked like a homeless Andrew W. K. came up to me and asked me for a cigarette. He was wearing surgical gloves. \n\nI gave him a cigarette and he thanked me, lit it, and we smoked together for a moment. \n\nHe then said to me \"I think I'm gonna kill everyone.\" and I said, 'Nah man don't do that\" and he said, '\"okay.\" thanked me for the smoke and left. \n\nHey, he didn't kill everyone, so maybe that was because of what I said, who knows.",
   "created_utc": 1691416910,
   "score": 126,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5xwkv",
   "message": "I was driving from St Louis to Louisville and stopped at a little exit to put gas in my car.  It’s about 5am.  Sun isn’t up yet.  I decide to go to the bathroom and get some coffee while Im stopped.  I come out of the stall and there’s a large man in the women’s bathroom with overalls on and a hospital gown underneath.  He’s standing at the sink tucking the gown in.  I go to wash my hands and he says “Can you see this hospital gown under my overalls?”  Im a little freaked out.  I nod yes and he says “Im not going back there.  I ain’t crazy.  They’re crazy.”  I walk out and make a beeline for my car.  There’s an attendant out there changing the trash bags in the big trash bins by the pump.  I say “There’s a very large MAN in the woman’s bathroom in a hospital gown and overalls.”  He looks at me and says “Oh that’s just Frank.  He must have got out again.” I couldn’t get away from that little gas station quick enough.",
   "created_utc": 1691419126,
   "score": 67,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5mwr3",
   "message": "One time a girl approached me at a party, told me her bf cheated on her and asked if I could help her get back at him.",
   "created_utc": 1691414341,
   "score": 43,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5osuf",
   "message": "Homeless woman threatened me with a full bread knife as I jogged across a highway overpass",
   "created_utc": 1691415228,
   "score": 39,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6bemu",
   "message": "I was in Seattle last August buying my ticket to go to the top of the space needle. While walking toward the ticket machine, I spot a guy sitting on a bench in nothing but tighty-whities. He's holding a pickle jar. Proceeds to pick a pickle, examines it, and then hucks it about 20ft away. He then selects another pickle. Satisfied with this one, he then enjoys his pickle in all his near-naked glory.",
   "created_utc": 1691424379,
   "score": 42,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5kljg",
   "message": "A lady old enough to be my grandmother’s grandmother stopped me in the middle of a store to tell me “you got some nice lips!”\n\nI was 16. To this day I’m torn between feeling flattered and feeling disturbed.",
   "created_utc": 1691413226,
   "score": 63,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5socx",
   "message": "In a co-ed bathroom at work. I was pooping and heard a man walk in, saw male boots from under the stall. Awkward and I was hoping he would walk out. But instead he ripped the stall door open! I was so shocked it literally scared the shut out of me. He yelled \"you're disgusting!!\" And stormed out. Dude. WTF",
   "created_utc": 1691416941,
   "score": 51,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5pip8",
   "message": "Grocery store parking lot, a random guy came up to me and gave me five 100 dollar bills and then ran away, yelling \"I just bought your soul!\"   I went in and bought groceries with the cash.",
   "created_utc": 1691415559,
   "score": 51,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5ke0f",
   "message": "Saw her alleged bf slip something in her drink and knocked it over. Alerted the bartender who checked footage and they rushed her to the back",
   "created_utc": 1691413121,
   "score": 36,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5k9o7",
   "message": "Not me, but when I was a kid this little old lady approached my mom at the grocery store and said \"I saw what you did! I SAW WHAT YOU DID! SHAME ON YOU! SHAAAAAAME ON YOU!!!\"\n\nMy mom asked what she was talking about and she just kept saying \"shame! SHAME! SHAAAAME!\"\n\nWe had just walked into the store, all I could think of was perhaps she was confusing my mom with someone who dinged a car or something in the parking lot?",
   "created_utc": 1691413060,
   "score": 30,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6e2xy",
   "message": "When I was 13 a guy in Mexico tried to trade me a sombrero for my shorts.  This was at the pyramids near Mexico City.\n\nI also have this weird thing where complete strangers will tell me everything about them within 5 minutes of meeting me.  Sometimes it's funny, sometimes it's dark, but it's always super personal and none of my business. I don't know why they do it.  It has been happening for decades.  One time, the guy stopped in the middle of the sentence and said, \"I don't know why I'm telling you this.\"  We was the only person that self-reflected in front of me.",
   "created_utc": 1691425399,
   "score": 12,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6f8qs",
   "message": "Driving my truck way up in a mountain area on the Western slope of the Rockies,  oh no! I got a flat tire, pacing, cursing, wondering where am I going to get another tire way up here?, an old guy in his truck, stops, gets out of his truck and starts his Mountain man spiel which was quite impressive, so, he says, I have a used tire, it's yours for 10 bucks, OK I said, and here's another 10 bucks for your story telling.  Big grin, we need more people like you up here, to make him laugh again, I said, you need more tires too!",
   "created_utc": 1691425838,
   "score": 14,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6h426",
   "message": "Had an Uber driver tell me it was a year to the day since someone had killed his son near where he picked me up in Minneapolis.  Then he drove me past the church where the killer worked and told me that every day since he's fought the urge to kill the man who killed his son.  And that after he dropped me off at the airport he was going home to hug his wife because that's what she asked him to do every time he wanted to do the other thing.    He wasn't a punk.  He was a grieving middle aged man.  Hit hard.",
   "created_utc": 1691426539,
   "score": 12,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5swbh",
   "message": "Went shopping in Germany, it was an hour across the border from where we lived and we usually went to get some things you couldn't get back in the Netherlands (plus cheap tobacco, those were the days).\n\nParked up at the Rewe and as we walked to the store, a bloke came running my way yelling 'excuse me, sir! excuse me!' in Dutch. So I stopped and turned to face him. He gets really excited and shaking my hand 'it is such an honour! Wow!'...\n\nI'm genuinely completely baffled at this point, after a few mumbled sentences by him, it becomes clear he thinks I'm the crown-prince (now King of the Netherlands), incognito. I've been told once that I looked like the king,... This guy thought I was him in disguise, because of my beard. I had a good laugh and the bloke was super embarassed as he slunk off.\n\nWhat I still don't get is that he saw me arrive in a banged up Volvo, nor who he thought my wife was!",
   "created_utc": 1691417036,
   "score": 20,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5p2qm",
   "message": "I was outside having a cigarette when some car pulled up on the curb, a guy got out, went to the trunk, pulled out a shoe box with a new pair of shoes in it, and asked if he could leave them on the tree lawn in front of my house. I said sure.",
   "created_utc": 1691415353,
   "score": 8,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6gy5g",
   "message": "This was middle school and we went from being strangers to good friends. We were standing at the bus stop no one talking school had just started up so none of us knew each other and we're to shy to start talking when a girl randomly bit my shoulder and said \"I gave you my rabies.\" We were friends until I moved away.",
   "created_utc": 1691426477,
   "score": 8,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5tszc",
   "message": "In a Dennys in Vegas having breakfast . Couldn't finish my grand slam when a young man, visually in rough shape, politely asked me if I had finished eating   \n\nI said yes, but before I could ask him to sit down , so I could order him breakfast , he grabbed my untouched plate of pancakes, dumped the entire jug of Syrup on them , grabbed my fork , and ran out the door .\n\nWe paid our bill and left, tried to find him, but he was long gone .",
   "created_utc": 1691417420,
   "score": 15,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5k7dq",
   "message": "Someone in a van told me I had a nice watch, a nice phone, a nice shirt, and a nice belt buckle once when I was walking home from school",
   "created_utc": 1691413028,
   "score": 14,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6uao1",
   "message": "I was in a Tim Hortons parking lot with my ex, on a Saturday afternoon, we were sitting with our motorcycles, drinking our coffees.  There was a big charity ride in that town that weekend and we had ridden over to go.  An old man in a pick up truck drove in  and parked beside us. He gave us the side eye as he went in to get his coffee, and when he came out, he came up to us and said, \"So, what the hell's with all the bikers in town?\"\nI told him that there was a huge biker event going on at their local park, and that we were raising money for Retinitis Pigmentosa.  He looked confused so I said, \"Its an eye disease.  We're rasing money for research.\"\n\nHe paused for a moment and then said, \"I wonder if that's why my eyeballs ache at night.\"\n\nI asked him what he meant, and he told me that his eyeballs ache every night, he didn't know why, but that when he smoked cannabis, it seemed to help. \n\nI said, \"Sounds more to me like you might have glaucoma.\"\n\nHe got this panicked look on his face and said, \"Oh God, they're gonna pop my eyeballs out, aren't they?\"\n\nMy ex and I calmed him down and explained to him that he should go to his doctor and asked to be checked, because it was a disease that can be controlled fairly easily with medication, and that no doctor would ever pop out his eyeballs.  \n\nHe felt better after we explained it to him, especially when I explained that cannabis was a proven medicine for glaucoma and that he'd been doing the right thing all along, but that he still needed to be taken care of by a doctor or it could get worse.\n\nHe thanked me for easing his mind and promised me he would go to the doctor and get assessed for glaucoma.  We finished our coffees and said goodbye. I hope he did get treated, because even if it wasn't glaucoma, he needed to be seen by a doctor, but his fear was holding him back.  I guess I'll never know.",
   "created_utc": 1691431454,
   "score": 7,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5u1p7",
   "message": "Well, just last week while on vacation, my son and I went to a local swimming area. We hadn't been there 10 minutes when some young woman went off about me being the hottest old guy she has ever seen. She asked if she could give me a hug. She then proceeded to take her bikini top off and come over to give me a big hug! That's when I  could easily smell the alcohol. One of the bystander guys, maybe her BF said, why don't you take her with you?\n\nMy son said, WTH just happened? as we decided to leave and walked away.\n\nBut I have always attracted trouble.",
   "created_utc": 1691417525,
   "score": 10,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6dnzm",
   "message": "When I was maybe 12 I was walking I to a gas station and held the door for a middle aged woman, who proceeded to ruffle my hair and say, very loudly, “thanks friend!”",
   "created_utc": 1691425242,
   "score": 12,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6mt4r",
   "message": "Delayed flight coming home cross country from a business trip during a taxi strike. I got into JFK at 3am. Car that was supposed to pick me up long gone. Scab taxi driver only transportation around. A couple of licensed taxi drivers standing around tell me not to go with him, but don’t know how else I could get home. So I get in the car and he closes the door. Driver gets in, doors lock. I notice there is no door handle on my door / no way to open the door from inside. Driver reaches across me into the glove compartment and takes out and puts on a pair of latex gloves. Tells me he has a skin allergy to the leather steering wheel and off we go. I am seriously reconsidering my life decisions and wondering how he’s going to kill me. I am sizing him up wondering if I can take him in a fight.\n\nHe talks non-stop, asking questions about me, rambles some about his life - sometimes a bit angry and then suddenly laughing. I decide that the best I can do is be friendly and make him like me too much to torture me. I ask all sorts of questions about his family, how he started driving, does he like where he lives - anything I can think of. \n\nIt’s an hour ride to my home, and I don’t know if we’re going to end up there. I am paying very close attention to the route we’re taking.\n\nWe pull up to my front door and he gets out and opens my door. Apologizes for the broken handle. I paid him, thanked him for the ride and got in the house and locked the door.",
   "created_utc": 1691428683,
   "score": 5,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6p7nn",
   "message": "I was in a bar in New Orleans (La Fittes Blacksmith or whatever it's called). It was windy out so I was fixing my hair in the mirror after taking a pee and two pretty drunk frat bros walked in and saw me and said \"you look fine dude\" as I was fixing my hair. I said \"oh really, you think so?\" Kind of buzzed myself. They said \"yeah you got the nice hair and the muscles, you look good!\" I was wearing a sleeveless band T at the time and I had been going really hard in the gym and finally starting to look like it. It was a really genuine and positive exchange and I felt really good about myself afterwards. I imagine this is the sort of thing that happens in women's bathrooms all the time. Not that it matters either but I don't think the guys were gay. I think they were just being genuinely positive and nice rather than hitting on me lol. Either way idgaf though.",
   "created_utc": 1691429569,
   "score": 5,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6sown",
   "message": "I was waiting in the payment line at a store. A hippy-looking older woman was just staring in my direction. I looked at her then looked where she was staring. She was staring at my infant son and he was staring back. She then looked at me and then looked a little embarrassed.  She said, “I’m sorry I was just talking to his soul. He’s remarkable and you’re very lucky parents.”",
   "created_utc": 1691430853,
   "score": 7,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6t2bg",
   "message": "A few years back, I was eating lunch at a local fried chicken fast food place, and I got up to leave at the same time as this other guy.\n\nHe gets to the door before me, and after going through it, he pushes it shut and holds it shut. This place had one of those entrances where it's a door, then a little tile area, then another set of doors that actually lead outside. So he pushes his foot against the bottom of the first set of doors and reaches across until he's got the next door's handle on his fingertips. Then he jumps across the gap, shoves the door open, and sprints to his car. He's out of the parking lot before I'm even out of the restaurant.\n\nI have no idea what all that was about. Even while it was happening I was too confused to even be angry about it.\n\nI think about that guy at least once a week.",
   "created_utc": 1691430992,
   "score": 6,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5rkc9",
   "message": "It was like 12 am, I use to hang out at a skatepark and the lights turned off at 11pm, so after hanging around I would have to skate around 2-3 miles to my friends house to sleep over, while making my way to a bridge there was a guy in his underwear, nothing else, just squatting in the bushes on the opposite side of the street just staring at us and nobody out of the 2 people I was with saw him until I pointed him out, and then he ran off into the woods.",
   "created_utc": 1691416466,
   "score": 7,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5rqz0",
   "message": "In a Walmart line up with my hubby when a woman tapped me on the shoulder and told me I had really nice legs, I thanked her she then said that her husband had been a leg man so she always notices. It made me feel good and made me realize that as women we have to lift each other up not knock each other down so now if I notice something on a woman that I like I reach out and complement her with a huge smile on my face so she doesn’t think I’m being sarcastic",
   "created_utc": 1691416544,
   "score": 12,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6ttdf",
   "message": "Had a random stranger try running me off the rod and into other cars. He then proceeded to yell at me for five minutes uttering death threats repeatedly. He used only one word for me and that was cracker. FFS! I'm fucking russian. If your going to insult me get it right. I'm a dirty cossack. Fucking Florida is great! /s don't move here. The people are assholes.",
   "created_utc": 1691431271,
   "score": 4,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5ovhp",
   "message": "Late sixties, Dallas airport, sliding walkway; Me, long haired hippy, guy in cowboy hat, coming the other way, spits at me.",
   "created_utc": 1691415261,
   "score": 7,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5k8k1",
   "message": "One tried to murder me once but convinced them to let me go",
   "created_utc": 1691413044,
   "score": 6,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5lax5",
   "message": "Walking the street and dude comes up to me randomly says “If you died right now in this instant, would you go to heaven?”\n\nTalk about a conversation starter lol",
   "created_utc": 1691413571,
   "score": 3,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5n0a9",
   "message": "[deleted]",
   "created_utc": 1691414388,
   "score": 3,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5o9mm",
   "message": "I was taking photos a few days ago and a guy stopped and asked me about the moon. Then satellites. Then aliens. Then Prince Andrew. All in the space of about 3 minutes.",
   "created_utc": 1691414978,
   "score": 3,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6dzo9",
   "message": "Worked in a seafood department at a grocery store. A tall stocky dude with a lazy eye comes to the counter and asks what our cheapest fish was. I direct him to the frozen section, and he thanks me and tells me he has a buch of flesh eating piranhas back at home he needs to feed. Pretty convinced the guy was actually a Bond villian.",
   "created_utc": 1691425364,
   "score": 3,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6ffuf",
   "message": "Eating crumpets, drinking earl gray and talking about relationships at 2 am in her house, after a massive drinking session with friends at the time.",
   "created_utc": 1691425912,
   "score": 3,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6ia6k",
   "message": "I used to walk dogs for a living around 18-21 years old. I think I was 20 when an Indian man from the neighborhood came up to me, asked if our dogs could hang out, I said sure and they played together for about an hour. I already hated that but wanted to be polite, plus the client’s dog I was with was a puppy so I could tell she wanted to play. Eventually dude asks to suck me off, I politely decline, he asked if I was sure twice more and I continued with the no. He then tells me about how his wife wants a divorce, how he’s in an arranged marriage and has a secret teenage boyfriend. His wife kicked him out, he spent time in a homeless shelter and met the boyfriend there, he claimed he was raped by his cousin when he was around 10 which made him dislike women from a young age. He went on about his life and I tried to tune it out, especially after he told me he let his dog lick his junk, and once locked up his cum. Eventually his wife or daughter called him over, he ignored it but I told him I had to get going. I told him I’d keep the talk between ourselves and he just said “oh it’s fine, I don’t care” which still blows my mind.",
   "created_utc": 1691426979,
   "score": 3,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6rdxn",
   "message": "I was walking down the sidewalk on my lunch hour and a well dressed, not-bad-looking man called out from behind me that I had something on my foot. \n\nI stopped and lifted my foot to look, removing my high heel to look at the bottom because he was so insistent, and in one graceful movement he dropped to the ground and licked the bottom of my foot, all the way up the bottom.\n\nI screamed and jerked my foot away and ran into the nearest restaurant to call the police. They told me I could not wait in the restaurant, although he was still loitering around outside, so I had to wait until he was out of sight and scurry to my office to meet the police. They did not care but took a report.",
   "created_utc": 1691430374,
   "score": 3,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5q99j",
   "message": "I was doing security one day in 2017 a guy was smoking a cigarette on the roof when I told him hey you can't be up here. He said my apologies I'll just finish my smoke and be on my way. I called the supervisor in to record time for my report. From the corner of my eye I seen the guy charging towards me with a machete. I took off running the funny part is when fear kicked in a manage to go from the 19th floor to the lobby via stairs in under 30 seconds. I hid behind a door with a two way mirror. He looked around and left. I called 911 they never found him.",
   "created_utc": 1691415893,
   "score": 4,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5q60d",
   "message": "At a pool party in Vegas. This drunk 40 milf comes up to me wanting to talk. Go to the bathroom and when I come back she’s leaning on the edge of the pool. Security comes up to me asking me and “my friend” to leave. I explain to them that I just met this person but they still kick us out.  They get her out of the pool and onto a wheelchair. I’m stuck with her inside the casino for a couple hours until her cousin can pick her up. The whole time she keeps wanting to whisper in my ear and flash me. Cousin finally arrives and we carry her inside their car. Thanks me for taking care of her and gives me 100$. Vegas is fun but also crazy.",
   "created_utc": 1691415852,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5rwl9",
   "message": "Dude pulled up in a big white van and asked if I wanted any candy.",
   "created_utc": 1691416611,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5xt91",
   "message": "So this happened like 30 years ago. I stupidly went back to hotel with this couple to buy weed. Total strangers. They were selling small amounts on the street and I wanted more than that. When we got there they wanted me to give them the money in the parking lot and they would come back with it. Yeah, I was young but I wasn't stupid. When I said no the guy started trying to intimidate me, yelling about how they had come all the way back (I had driven us) and he better make something off it. Meanwhile some totally unrelated, well dressed guy walked up and asked if I could help him get into his car. I told him yeah, give me a minute, and spent a few more minutes trying to get the other guy to bring the drugs outside, but no dice, of course.  Then I tried to help the second guy get in his car, which was like a new luxury car, but we couldn't get in so I offered him a ride to the bus stop about half a mile away. On the way he propositioned me. 🤣 It was not a seedy hotel and I was emo/goth back then so I don't think I really looked like a prostitute. But maybe he thought that's what the argument with the first guy was about? I just told him no thanks and dropped him off at the bus stop. Learned my lesson and never tried to buy drugs from strangers again. 🤣 I have helped people get into their locked cars though. Also, despite being in far more sketchy situations after that, I have never been propositioned again.",
   "created_utc": 1691419089,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6af72",
   "message": "I had sex with a girl before I even knew her name.",
   "created_utc": 1691424005,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6afts",
   "message": "While waiting in the queue to buy tickets for the cinema with friends, I was approached by this guy who suddenly insisted I take his ticket. He noticed what movie I was gonna watch and it's the same as his ticket. He was pushing it on my hand saying please take it, like it's crucial I do. So I did lol nothing happened I got a free ticket and I was grateful but like after he handed it to me he haphazardly left the place. Didn't even get to say thank you.\n\nI guess his actions just seem strange to me. Perhaps it was a bet among him and his friends or whatever but I just couldn't figure out for what or why XD anyway, I didn't think much about it then. This question just brought it up to memory.\n\nEdit: grammar",
   "created_utc": 1691424011,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6c3dl",
   "message": "I was traveling back to my country for my holidays and this foreigner was sitting next to me. We were chit chatting for a bit but the flight was 4 hours long and he got progressively more drunk from inflight alcohol. About halfway  through the flight the dude completely switched from speaking english to his mother tongue and wouldn't switch back even though I pointed out I couldn't understand him. I kept nodding my head and responding \"ahh. Yes. Oh okay\" for the next 2 hours as he spoke passionately about something in a language I did not speak. It was weird as f\\*\\*k. I felt like bro opened up to me more than he possibly had to his significant other in the last 10 years or something. Before leaving he gave me his business card and said his final two english words \"call me\". I was like \"I hope I didn't agree to have my organs harvested or something\".",
   "created_utc": 1691424642,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6cxit",
   "message": "I was getting a picture taken for my passport and there was a guy in the store at a machine to develope some photos, I found it a bit strange because it was a big pile and he squatted down to pick each one up seperately as soon as they came out. Later at the bus stop the same guy came and sat down a seat or two next to me, we were in the city centre but the only two at the bus stop. He started a conversation with me, I had the folder with my photos in my hand and he his, and he showed me some of his, turns out all of them were of buses that he took himself, from almost every angle and one where he was allowed to sit in the drivers seat for it. He was really quite fond of them. It was a bit weird but he was a really nice and friendly guy. In the end he got up, walked to the other bus stop across the street, photographed the bus there and got in.\n\nEdit: Definitely not the weirdest encounter but one I think of from time to time.",
   "created_utc": 1691424961,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6d2ez",
   "message": "I was a lot younger and I had jury duty. We had to fill out this huge form beforehand and there were at least 300 people in the room when I started then 295 got excused then and there. (I want to know what they put on the questionnaire that I didn’t. I was honest.) So I ended up in a room with 2 or 3 other people freaked out that I was going to end up on this multiple murder case. Anyway we make small talk about our jobs and I admitted I was fresh out of college and trying to find a career. I was hoping to be in graphic design or something creative. No one asked what field I was looking in instead this woman just blurts out you should work in a slaughterhouse. This courthouse was in an urban area, I came in from the suburbs and it’s one of the most liberal areas of the country. So there was a high percentage that I could’ve been a vegan or peta member. I didn’t know of any slaughterhouses remotely near me, I’m squeamish af and I throw up whenever I smell something rotting in the back of my fridge. Also this lady just looked like an ordinary suburban white mom not a farmer or anything. It was just so damn random. All I can guess is that she was trying out some weird way to get out of being on the jury on me.",
   "created_utc": 1691425014,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6g1co",
   "message": "As a teen a buddy and I were coming down off acid and walking to the corner gas station at 5 am. Ran into a homeless crackhead who told us he had \"too much pussy\" and was looking for us to take some of it off his hands. We politely declined.",
   "created_utc": 1691426137,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6la8u",
   "message": "I was at an open-mic/poetry slam type event in one of the famous dive bars in the city. I was in an outfit at the time. A complete stranger strikes up a conversation with me by asking me if I've earned my Red Wings and if I want to date his sister.",
   "created_utc": 1691428106,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6raek",
   "message": "We were at a Panera bread close to closing time, about to pack up and leave. A worker told our table, and the one other table of people there that we could have some leftover pastries from the counter because they were going to have it to get rid of them anyway.\n\nMy sister-in-law and I found out what everyone at our table would like, and the two of us went to get those pastries. We are in front of an older man and woman, the people from the other table. He looked visibly upset as we started naming the items and he realized it was more than two (there were 6 total people at our table).\n\nHe interrupted us and, in a sneering voice I still remember to this day, said “Remember ladies, pigs get fat and hogs get slaughtered.”\n\nSide note: there were a few of each item left in the case so it wasn’t as if he’s have had to leave without a treat.",
   "created_utc": 1691430337,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6rxql",
   "message": "I was standing in line to pay for my gas after finishing work. I was wearing my work cardigan which only gets washed periodically, and I worked in a place with a lot of perfume. All of a sudden this older woman in line behind me smashes her face into my bicep and inhaled deeply, then tells me I smell really good.",
   "created_utc": 1691430579,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6t2y0",
   "message": "I ,(m27) at the time, decided to let my hair grow long. It was a little more than shoulder length. I kept it nice and clean and combed it a lot. I was working at Kohls at the time as a cashier. Coworker was helping people and I decided to assist since the line was gone and it was only her customers. Two old ladies. This was shortly after they had reopened stores during the pandemic. One of them comes over to me, touches a few locks of my hair, and says ‘Beautiful. It would look wonderful on my dolls’. Then she giggles, the other one tells her ‘Leave the nice man alone, silly woman’ through laughter. I get it was a joke, but what the fuck, lady?",
   "created_utc": 1691430998,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6u0pd",
   "message": "I had just got through a pretty devastating argument with my girlfriend and was riding the elevator down leaving her apartment and I could sorta feel a different energy coming off the only other dude in the elevator. We're standing in silent and he just says, \"You're a very patient person.\"\n\nI said thanks and we went our separate ways. Maybe it's what I needed to hear? Tough to say, but I still think about it a lot.",
   "created_utc": 1691431348,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6yb6i",
   "message": "On my 18th birthday my family took me out to dinner. While we were at the restaurant, I went to use the bathroom. I got into the stall and sat down when I hear the door open. I don't think anything of it until I see an eye peeking in through the crack in the door. It's some little kid, maybe 10 years old. He starts questioning me.\n\nKid: \"Whatcha doin'?\"\n\nMe: \"Um...what do you think?\"\n\nKid: \"You poopin'?\"\n\nMe: \"Yeah, do you mind?\"\n\nAt this point I hear the door open again. The kid starts talking in hushed tones to this new intruder,  who I assumed must have been the kid's brother, but I can make out, \"He said do you mind\" followed by some giggles. The eye comes back to the door.\n\nKid: \"Yeah, I do mind. Do *you* mind?\"\n\nI just wanted the kid to leave at this point, but I didn't want to be rude about it. Eventually after some silence and a fucking eternity of looking into this kid's eye as I'm making bears, he just yells, \"Okay, bye!\", and him and the other kid run out of the bathroom giggling.\n\nI don't even know who they were. As I left the bathroom I scanned the dining area but saw no young kids. The story made my parents laugh, though.",
   "created_utc": 1691432960,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6yqa5",
   "message": "Just this week, a guy came up to me and said, \"hey, how's going?\" I said, \"fine. Sorry, I don't remember ever meeting you.\" (He spoke as if I knew him). He said, \"We used to work together at an army base. They wiped your memory.\" I'm pretty sure that's not true. I don't have any holes in my resume. But I was on my phone reading about alien conspiracies at the time, like one does, so it freaked me out. He didn't look like the classic crazy person that says nonsense.",
   "created_utc": 1691433118,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6zhvv",
   "message": "Not very interesting (at all), but on a skiing trip earlier this year I saw who I thought was my friend next to me in my peripheral vision, so I started singing (in a comically high pitch) ‘Staying Alive’ (the part where it goes ha-ha-ha-ha stayin’ alive) out loud, and my ‘friend’ sang along. I looked at him after repeating the few verses I could really remember and realised it was a complete stranger who had been singing alongside me the whole time… \nSo I started speed-walking and caught up with my actual friend.\nAwkward, to say the least…",
   "created_utc": 1691433406,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv704og",
   "message": "First day on Uni, which was in a different country than I was from and I had only been in the city for one day. Went clubbing with my new housemates and went to the bathroom. Some girl came running up to me and said “Courage I haven’t seen you in so long it’s good to see you!”. Gave me a huge hug and then walked off. I had never seen her before in my life and never saw her again. Maybe I just have the same name as someone who I look suspiciously like??",
   "created_utc": 1691433640,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv74ur1",
   "message": "I was shopping at my local grocery store and as I got into my car, I rolled my windows down and this little old lady came up and asked if she could guess my ethnicity (I'm a basic as white girl), I said sure. \"French and Irish\" she guesses, which was spot on. She then proceeded to tell me she painted portraits for a living and could tell anyone's ethnic background. I thought it was great and all but then the convo lasted for 45 minutes as she told me about her husband and son's suicides, her growing up in the soviet union and hiding in trees to not be eaten by wolves, and some of the crazy things she did in her younger years.\n\nI still don't know if she was sane or just a little senile.",
   "created_utc": 1691435399,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv79b79",
   "message": "Not me, HER. \n\nSo, there's this guy who lives up the street from me. Similar vehicle, similar age, similar build and height, same haircut, similar truck at the time, the same damn first name and even has daughters like me. It's funny as hell, really. \n\nSo one day I'm coming home from work and there's this 15 yr old emo girl laying down on the sidewalk, maybe passed out, but her legs are basically at risk of getting run over the way she's got them stuck out there into the street. I pull over with the intent to try and wake her up, see of she's okay, whatever is going on. As I'm walking to her, this voice is like \"Hey yeah, I'll take care of her, she's okay, I got this.\" I didn't listen because I don't know this girl, how she got there, if this person is a predator or what. \n\nTurns out it was the other me, and he had just pulled up from the other direction and stopped for the same reason. So there we are looking like twinsies with the same name tags, similar work uniforms, same look, essentially the same vehicles and the same story and concern. But I know him and he knows me. \n\nI could see this girl was questioning if whatever drugs she was on really got hold of her just that bad despite a brief explanation that we knew each other. So, while she waited for a ride from her friend, me and the other me fell right into this parenting/good-cop-bad-cop routine. What's your name? Do your parents know where you are? We just don't want to let anything to happen to you out here. How long have you been here? Your parents must be worried sick. Are you even from around here? You've got a good friend to come pick you up so late. Is everything okay at home? Drugs are bad, mkay. Etc, etc. We just badgered that poor little girl with good intentions delivered in a very rapid-fire kind of way. I'm pretty sure we traumatized her just a little bit. \n\nWhen her friend arrived to pick her up, other me threw up a military style salute at the girl and said \"We shall remember you, Earthling!\"\n\nNever saw that kid again.",
   "created_utc": 1691437074,
   "score": 2,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5kepy",
   "message": "This wasn’t me, but my mom once had a man run up to her while she was working at Lowe’s and told her a Mexican drug cartel is coming to enact vengeance after something he did",
   "created_utc": 1691413131,
   "score": 5,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5op8p",
   "message": "I was at this roadside diner with my mother and grandmother. We were sitting in a booth not too far from the counter, where a trucker was sitting. There was a lull in our conversation so the trucker turned to us, unsolicited and said hello. He had this thick Wisconsin accent, and it was next to impossible to understand what he was saying. I listened as attentively as I could, and he was telling us about how he had recently bought some fancy plates with gilding on the rim, which he microwaved and, in doing so, ruined his microwave. We replied to him politely, I don't remember what we exactly said, and he just turned away and returned to his meal. My mother and I both found a fair bit of humor in the interaction later on.",
   "created_utc": 1691415181,
   "score": 3,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5q566",
   "message": "Was booked on a flight from boston to Melbourne, gate attendant notified the people flying (bos to lax) with connections to Australia to come to the gate.  Me and my wife arrived same time as some random dude, we let him go ahead.  All three of us listened to the attendant explain that the bos-\u0026gt;lax flight wouldn’t make the connection bc the incoming flight was late, they’d route us thru San Francisco first class all the way.\n\nThey changed his ticket\n\nThey changed my wife’s ticket\n\nThen they told me they were all booked up…\n\nHad to go to lax, missed the connecting flight… toured la for a day then got into my other flight a day late.  Oh yeah, and I couldn’t get my luggage so I had to re-wear the same clothes (because la wasn’t safe to walk around to get new clothes).  And the airline tried to blame it on the weather…",
   "created_utc": 1691415842,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5r1gd",
   "message": "My dad I hadn’t seen him from the age of two till I was 22",
   "created_utc": 1691416240,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5mscj",
   "message": "One guy tried to steal my phone when I was 13, and I just told him my Dad was around the corner. Which was a lie and he ran away, I expected him to still take it off a kid and run but I guess he wasn't a pro at it",
   "created_utc": 1691414283,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5p3n9",
   "message": "Guy passing me on the under pass to the trains thought I was his sister's boyfriend because we look similar and I said \"happy to hear your sister has good taste\"",
   "created_utc": 1691415365,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5o0zj",
   "message": "All random religious/political nuts.",
   "created_utc": 1691414867,
   "score": 0,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5q2g7",
   "message": "I was walking down the city streets with my family, when a crack head suddenly walked out in front of us, and dropped some street wisdom on us. Lol.",
   "created_utc": 1691415807,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5rb9s",
   "message": "Some guy that struck up a weird conversation with me but I found out later he was recruting for his cult.    It got WEIRD really fast about how an alien craft was heading this way.   \n\nI'm thinking like: \"How do you know that\".    and that's when i realized this guy's nuts.",
   "created_utc": 1691416357,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5rhv7",
   "message": "I have an absurd amount of facial piercings. Someone stopped me to tell me I'm too ugly for them and said they would run a magnet across my face and to \"take that shit off\". I was in the middle of a date with my boyfriend, it was so random and weird. I didn't ask, and i was in the middle of kissing my boyfriend.",
   "created_utc": 1691416435,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5s3j0",
   "message": "I was eating some noodles with chopsticks as I was walking and 3 men just surrounded me for no reason and started asking me questions about what I was doing",
   "created_utc": 1691416693,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5sg0n",
   "message": "This is Kinda gorie👉👉👉👉👉👉👉👉👉👉👉\n Once I was in a Gas Station with my Family and get out to buy something, and when I head out of the store I see an Man in a Weel Shear with his right leg open, exposing Blood ad bones and Vaines. The dude was eating himself and people didn't notice it. The worse part is that we made eye contact while he eat a peace of his dried meat. It was horrible, weirdly enough I didn't scream or anything. I was a 13 when that happend",
   "created_utc": 1691416840,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv5sxx5",
   "message": "He walked by and said, \"Sup, tourist.\" But I live here 💀",
   "created_utc": 1691417054,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv696gz",
   "message": "I had really, really long natural red hair at the time, and while I was working in some retail job, a woman came up behind me, took a handful of my hair and pulled it. Was completely bizarre and my boss didn't even believe me that it happened so I just sat in the back for a while until the lady left cause she wasn't kicked out for assaulting me. People have touched my hair a lot without asking and stuff like that, but that was the first time anyone actually pulled it.",
   "created_utc": 1691423535,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv69pzr",
   "message": "My sister and I were sitting at tim Hortons around 11 or 12 drinking coffee by the window all of a sudden we both notice a lady Just staring at his in the window like 2 inches from our table it was so creepy then she just wandered off didn't even come in lol",
   "created_utc": 1691423741,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6aik2",
   "message": "I used to travel across the country by rail.  I've had too many weird encounters to really know which might be the weirdest.",
   "created_utc": 1691424040,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6ayv3",
   "message": "I came out of a toilet stall and started washing my hands, some other dude came out and grabbed all the door handles in the toilet room and only then proceeded to start washing his hands. I made eye contact with him through the mirror and he just kept going. I made my way out of there real quick lol, my girlfriend didn't even believe me when I told her the story.",
   "created_utc": 1691424212,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6bdgl",
   "message": "Well, at least now you know your lips are grandma-approved! 😂",
   "created_utc": 1691424367,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6d4kp",
   "message": "Drunk russian guy kept trying to engage me at the cash register but since I only know English I just responded with confused glances and nodding.\n\nOnce I was finished he blocked me from leaving and I started to get mad, he grabbed a snickers from a nearby shelf and let the cashier scan it and then he popped it in my bag. The cashier seemed as confused as me and I walked all the way home, totally confused. 😅",
   "created_utc": 1691425037,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6dg26",
   "message": "I was sitting in a Sonic drivethrough waiting for my food order, and this homeless dude just walks up in front of my car and starts waving his finger around with the most dazed look on his face. He was clearly zooted out of his mind on some kinda drug.",
   "created_utc": 1691425158,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6e2lh",
   "message": "At a donut shop that was once a Dunkin' Donuts, and a little old lady walked up to me, jabbed me with her bony little finger, stating excitedly \"this isn't a Dunkin' Donut!\"",
   "created_utc": 1691425395,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6e9yf",
   "message": "I was in downtown LA, smoking a cigarette, and some guy in a car yelled \"nice hat, asshole!\" I still have no idea why.",
   "created_utc": 1691425473,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6eufe",
   "message": "I hailed an Uber circa 4 am in downtown San Antonio a few months ago to catch an early flight. The driver regaled me with stories about the illuminati and their effects on various banks and architecture in the area. Then he starts on his theories about Jewish folks. I was too stunned to react much. As he was dropping me off, he asked me to pray with him. I noped the f out of there.",
   "created_utc": 1691425687,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6gdy9",
   "message": "My buddy was at a gas station when an older woman approached him (clearly out of it) and asked him to buy her an Ice House.  He, of course, told her no as he was just there to get gas and go.  Apparently she didn’t like that answer because she pulled out a dull knife and made weak, threatening motions at him.  Not wanting to get stabbed/arrested for punching out an old woman, he begrudgingly went inside and purchased her coveted $3 beer.\n\nAnd that’s the story of the Ice House Bandit!",
   "created_utc": 1691426266,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6gz5e",
   "message": "It's an everyday thing, so I couldn't really tell ya",
   "created_utc": 1691426487,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6h8dn",
   "message": "I was standing in line at the Publix deli with my then-girlfriend waiting to order sandwiches. At some point she gave me a kiss.\n\nSome huge dude standing in line a few places behind us saw this, locked eyes with me and said \"WAAAOOOOOOWWW, BEEG KISS!\" He then proceeded to step out of line, say \"God bless you\" to everyone in the immediate vicinity, and then just... Left?",
   "created_utc": 1691426584,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6jhn2",
   "message": "While I was living and traveling in Latin America i casually met one person in many opportunities, different places. Everytime I met him he gave me the same gift without asking anything back. And everytime he told me that he didn't remember we met before.",
   "created_utc": 1691427430,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6luev",
   "message": "I was walking down the street in a residential area near some businesses and a guy walking towards me stopped and asked me:\n\n\"Do you have parents?\"\n\n...\"yeah\" I said.\n\n...\n\nAnd he walked away.\n\nI was dressed casually, minding my own business walking purposefully to my destination. Was quite interesting.",
   "created_utc": 1691428319,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6m52h",
   "message": "A rest stop in West Virgina about 8pm in the summer so it was getting dark but not pitch black.\n\nGuy was in a work uniform and came out of a private closet (so he worked for something that serviced/took care of rest stop areas).\n\nHe has a paper (rest area had bunch of mags of car/truck sales, country property ads etc.) and shows it to me... \"I was thinking of going to look at this truck... what do you think? Is that a good price?\"\n\nI talked to him for a bit, trying to be polite. It seemed like he may have been a little... slow.\n\nIn hindsight maybe he was trying to hookup with me? If he had asked straight up I probably would have done it.",
   "created_utc": 1691428432,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6mdtm",
   "message": "Had a guy hit on me at the library years ago, used a stupid pick up line on me and told me I was so beautiful even though I had 4-5 day of unwashed hair, sweatpants and a raggedy tank top Lmfao. He asked me if I wanted to go on a date. Told him I got a bf. He told me to tell him “well he’s one lucky man!” was just … super odd.",
   "created_utc": 1691428524,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6o49n",
   "message": "a complete random ass grandpa asking me for my no at a mall",
   "created_utc": 1691429162,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6oa7i",
   "message": "I grew up in Queens, went to high school and college in Manhattan. At one point in my career I commuted to Jersey City every day. I can't even narrow it down to the weirdest 50 encounters.\n\nOne that stands out when I was a kid was when I was walking around with my friends, maybe age 16, and some crazy lookin dude came up to us screaming about how JFK was \"a dope in a pine box.\" We still talk about that guy and use that phrase.",
   "created_utc": 1691429223,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6rul3",
   "message": "I was the only rider on a municipal bus around 2 a.m. about 30 years ago and sat near the bus driver. Roads were empty.\n\nOut of curiosity, I asked him if he ever speeds when the roads are empty like that. He said sure and floored it. I'm pretty sure we went well over 60 miles per hour.\n\nI was happy when we got to my stop and I left. Interesting but odd.",
   "created_utc": 1691430548,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6tkad",
   "message": "Oh, just the normal schizophrenic or drug-addled bus riders we all know and love. Or religious zealots. It's all nuts, and it's all in your face. Teabagging for Jesus-an American pastime. *sigh*",
   "created_utc": 1691431177,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6tpzy",
   "message": "He was a drummer for a band at this concert I went to, me and my buddy were crossfaded out of our minds and he approached us asking for a cigarette, I gave him a cigarette and he proceeded to say “since you gave me a cigarette in my time of addiction I shall give you a fun fact… a group of ferrets is called a business” *proceeded to walk away and never seen again somehow*",
   "created_utc": 1691431235,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6ufna",
   "message": "as a kid I was with a family member 2 years younger than me and he said \"you have a mustache\" as an insult and I told him at least I could actually grow a mustache. a random dude told me \"slay girly you told him off\"",
   "created_utc": 1691431505,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6ukus",
   "message": "20 years ago I was getting out of a subway station when an old tiny Asian lady just tried to reach and touch my forehead with a highly panicked look in her eyes. She kept saying something I couldn't understand. From that point I always assumed I was cursed.",
   "created_utc": 1691431558,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6ux1u",
   "message": "When I was a little boy I was walking around town for an art convention. Some random guy just held out a $1000 bill to me and I tried to grab it but he didn’t let go. Then he just kept it. No words exchanged, just held it out to me. Even I knew that the bill probably wasn’t real.",
   "created_utc": 1691431686,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6uxtg",
   "message": "I was at a Wawa and I got myself a sandwich and a shake. So I’m just sipping on my shake, on my phone waiting for my sandwich when this guy comes over and says “Hey I’m Reggie. I can’t believe a fine specimen like you is single” \n\nSo I just said deadpan “Im not single, happy in a relationship “\n\nHe goes “What you sippin on? Can I have a sip”\n\nI was just sippin on my shake, not even lookin up “Fuck no”\n\nHe then got dejected and said “Reggie out!”",
   "created_utc": 1691431694,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6vtrh",
   "message": "Met a guy at a coffee shop. Now he’s my boyfriend.",
   "created_utc": 1691432029,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6vyrs",
   "message": "I actually made a post about this before, but I helped a customer who was pretty obviously under the influence at work, when I started walking home she drove up to me an said, \"You want a ride? I promise I wont r@pe you?\"",
   "created_utc": 1691432082,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6w92m",
   "message": "In my teens, I worked at a department store. I very much looked like a teenager and while I wasn't fat, I wasn't super thin either. At the time, I was 5'6\" and weighed about 150 lbs with an athletic build.\n\nA couple came into the store looking to buy a gift for friends who'd just had a baby. i was working in the children's department that day, so I was assisting them with finding a gift. It was a totally normal transaction, we found a few items they liked, I rang them up, they paid. Nothing out of the ordinary. Just before they were leaving, the woman looks at me and goes, \"And when are you due?\" I just gave her a really strange look and then she goes \"The baby, when's your baby due?\" I just looked at her blankly and said, \"I'm not pregnant.\" Well, she turned the deepest shade of crimson, her husband looked at her like \"WTF?\" and she literally RAN from the wrap desk with her bag. \n\nIt was SO bizarre.",
   "created_utc": 1691432189,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv6wg06",
   "message": "Thanks, Grandma's grandma! My lips are here to make generations swoon!",
   "created_utc": 1691432261,
   "score": 1,
   "submission_id": "15kjz4d"
  },
  {
   "comment_id": "jv7leem",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kjz4d"
  }
 ]
}