{
 "submission_id": "15kjo8v",
 "title": "What are the ways to heal your attention span and rewire your brain overall from the harms done by social media?",
 "selftext": "",
 "created_utc": 1691412150,
 "permalink": "/r/AskReddit/comments/15kjo8v/what_are_the_ways_to_heal_your_attention_span_and/",
 "score": 11,
 "url": "https://www.reddit.com/r/AskReddit/comments/15kjo8v/what_are_the_ways_to_heal_your_attention_span_and/",
 "comments": [
  {
   "comment_id": "jv5pgdj",
   "message": "Digital Detox: Take breaks from social media and digital devices. Consider a digital detox by completely disconnecting for a period of time, allowing your brain to reset and reduce the constant stimuli.",
   "created_utc": 1691415528,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5j03c",
   "message": "Spend more time in nature. Hikes. That’s my favorite way to slow down and make sense of stuff and d get organized. And remove the social media that you have, I found that putting it in a folder was still too accessible for me so I finally deleted my Facebook on my Snapchat account after over 10 years for the Facebook and like eight years with the Snapchat , last September and I’ve really had the best year ever.",
   "created_utc": 1691412422,
   "score": 5,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5jmyb",
   "message": "Tetris is supposed to help with PTSD. It seems like the way they think it works would also help accomplish this.",
   "created_utc": 1691412741,
   "score": 5,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5kt5e",
   "message": "About 2 years ago, due to an error on behalf of my provider, i was without internet access at home for a total of 19 days. Initially it was a total pain in the arse. \n\nAfter a couple of days I was used to it. After 3-4 days I noticed my attention span for other things was increasing. After a week my attention span was pretty much as it was a couple of decades ago, before we all had constant online access.\n\nI actually started to like not having constant internet access.\n\nSo my advice is, at least once a year, go turn off your router for a couple of weeks.",
   "created_utc": 1691413331,
   "score": 3,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5imwp",
   "message": "Get off social media for as long as possible",
   "created_utc": 1691412235,
   "score": 2,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5jfzw",
   "message": "Spend time outside",
   "created_utc": 1691412643,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5j397",
   "message": "Spend time outside, preferably without a phone.",
   "created_utc": 1691412466,
   "score": 0,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5jity",
   "message": "You'll get a lot of comments saying to do other things but lets be honest, quitting social media cold turkey would be near impossible.\n\nI'd say try to limit your activity slowly, trying to get less time in every so often. Maybe set a goal per week, keep to that goal for a week and try to go less.you don't have to quit completely either, just get to a point that's comfortable to you and engage in other activities as well to fill the gap. Reading or spending time outside could help with focus.",
   "created_utc": 1691412683,
   "score": 0,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5kwqb",
   "message": "I like to ride my bike to clear my head from the internet. Exercise in general is a good distraction.",
   "created_utc": 1691413379,
   "score": 0,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5qo0t",
   "message": "Step one is quit social media, including reddit",
   "created_utc": 1691416075,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5tast",
   "message": "Step 1: Throw phone out window. Step 2: Run away screaming. Step 3: Enjoy newfound freedom!",
   "created_utc": 1691417205,
   "score": 1,
   "submission_id": "15kjo8v"
  },
  {
   "comment_id": "jv5x3di",
   "message": "Close all social media accounts, seek out therapy if needed and make new friends who are not social media addicts. Best of luck on your journey!",
   "created_utc": 1691418792,
   "score": 1,
   "submission_id": "15kjo8v"
  }
 ]
}