{
 "submission_id": "15kpwpc",
 "title": "Guys, why are you single?",
 "selftext": "",
 "created_utc": 1691426506,
 "permalink": "/r/AskReddit/comments/15kpwpc/guys_why_are_you_single/",
 "score": 134,
 "url": "https://www.reddit.com/r/AskReddit/comments/15kpwpc/guys_why_are_you_single/",
 "comments": [
  {
   "comment_id": "jv6lwhx",
   "message": "Tl;dr: I like myself better this way.\n\nFull story: I was basically a serial monogamist for most of my life, I bounced from relationship to relationship, rarely single for more than a year. Then my last relationship happened, and to cut a very long story as short as possible, it left me in a place where I didn't really feel up to another relationship right away. At first it was just hurt feelings, then it was fears that I'd have baggage that it wouldn't be fair to bring into a new relationship.\n\nBut eventually, after about 3 years or so, I got to a place in my life where I felt like I was probably ready for another relationship, only to find... I didn't really want one. I know this is a cliche, and I'll try to expand on what I mean by it in a second, but I really felt like I found myself over those 3 years.\n\nWhen I'm in a relationship, I'm like an addict with a constant supply. I lose interest in my hobbies, and don't develop new ones, because I'm happy enough just being in my partner's company. I lose ambition and stop dreaming, because I've already got the 'most important thing' a person could have. In addition to that, when I look at previous relationships, I realize how much they change me. My opinions, beliefs, wants etc tend to morph to more closely align with my partners.\n\nAll this culminates to the feeling that I was never more *truly* myself than I was at the end of that 3 years, and moreover, I very much liked this version of me. So I just decided that relationships weren't for me, and have been single ever since. That was 4 years ago now, and I don't regret it in the slightest.",
   "created_utc": 1691428341,
   "score": 122,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6hktl",
   "message": "being ugly and shy surely isn't helping me out.",
   "created_utc": 1691426714,
   "score": 104,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6q0cy",
   "message": "Don't really know how to meet people. Had no luck with dating apps so I don't use them. Don't drink so bars are kind of out. Just sort of hoping someone falls from the sky at this point lol",
   "created_utc": 1691429861,
   "score": 85,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6p49t",
   "message": "I'm a lazy antisocial asshole.",
   "created_utc": 1691429533,
   "score": 200,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6qb0h",
   "message": "Im tired of getting hurt.\nI want to feel wanted, which rarely ever happens.",
   "created_utc": 1691429972,
   "score": 127,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6h8tw",
   "message": "I don't try. That might just be me in denial, but I legitimately don't try. I make no efforts to not be single.",
   "created_utc": 1691426589,
   "score": 200,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6z4ni",
   "message": "I know there's a lot of negativity in the comments but I've been more optimistic about my future with relationships. I've been working a lot on self improvement, going to the gym, being a better listener, and pursuing my career. Women are starting to notice me more. I'm starting to see them as people rather than some mysterious alien race like I did as a boy.\n\nI still have some insecurity about it but I think my future looks a little brighter now. I feel like such a weird contrast to the other guys I know who are becoming more pessimistic about dating. I used to be that way. Then I realized it wasn't doing me any good.",
   "created_utc": 1691433270,
   "score": 53,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6ho3a",
   "message": "Gotta be happy enough by myself before I can expect to be happy with someone else.",
   "created_utc": 1691426748,
   "score": 102,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6qnp2",
   "message": "[deleted]",
   "created_utc": 1691430102,
   "score": 42,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6jflj",
   "message": "To date I'd have to leave the house more often",
   "created_utc": 1691427409,
   "score": 251,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6tpl0",
   "message": "The ones I’m attracted to don’t find me attractive",
   "created_utc": 1691431231,
   "score": 157,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6sfhc",
   "message": "No one has ever showed interest in me",
   "created_utc": 1691430757,
   "score": 254,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6ha0c",
   "message": "Haven’t found the right person yet",
   "created_utc": 1691426602,
   "score": 170,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6sa71",
   "message": "Relationships are full time jobs and people are annoying",
   "created_utc": 1691430703,
   "score": 199,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6ocqn",
   "message": "I DON'T KNOW MOM!! GEEZ",
   "created_utc": 1691429247,
   "score": 229,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7g7xn",
   "message": "There are plenty of fish in the sea. Unfortunately, I live in the desert.",
   "created_utc": 1691439628,
   "score": 212,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6wjx6",
   "message": "A lot of women seem to be intimidated by the fact that I'm a bonafide hustler, a stone cold pimp and slayer of all the wet pussy.",
   "created_utc": 1691432302,
   "score": 232,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6pbmr",
   "message": "Broke up with my ex so I can fix my own issues but damn I miss her.",
   "created_utc": 1691429609,
   "score": 86,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv75zq8",
   "message": "“When they like me I don’t like them, and when I like them they don’t like me” - George Costanza - Seinfeld",
   "created_utc": 1691435826,
   "score": 168,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6ohbb",
   "message": "The Venn diagram of girls I like and girls that like me looks like Mesut Özil's eyes",
   "created_utc": 1691429294,
   "score": 126,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv72obx",
   "message": "Been screwed over one too many times by the women I date. \n\nCombine that with a bunch of friends of mine that are currently going through divorces, and seeing their wives try to take them for everything they have has kinda made me realize that it's not so bad remaining single.",
   "created_utc": 1691434583,
   "score": 31,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6jt21",
   "message": "I'm not searching and I've got nothing to offer. I need a job, a place of my own and establish myself somewhat before I can even think about dating.",
   "created_utc": 1691427549,
   "score": 66,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6heyy",
   "message": "Because I prefer to be",
   "created_utc": 1691426653,
   "score": 69,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6v8fl",
   "message": "Just don't care to try atm. Love doing whatever I want, whenever I want. Still hasn't gotten old yet. I'm open to coming across someone who will change that, but I don't look for it.",
   "created_utc": 1691431804,
   "score": 36,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6pwv7",
   "message": "I'm not good at communicating and I don't know what I want.",
   "created_utc": 1691429824,
   "score": 54,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6tzic",
   "message": "My girlfriend didn't want to take the risk to her career to move to where I'm stationed, she also decided that long distance was getting too hard for her. It just ended last night and I feel so lost today",
   "created_utc": 1691431335,
   "score": 120,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6ykjt",
   "message": "Learned to be content alone after a divorce.  Forced myself to find happiness in myself.  Now I can't find it anywhere else.   Blade cut's 2 ways",
   "created_utc": 1691433057,
   "score": 12,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6kair",
   "message": "No self esteem. Don't look good enough.... Probably more factors but those are probably the main ones.",
   "created_utc": 1691427734,
   "score": 34,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv75lwr",
   "message": "Because I’m a hard sell. I’m on the spectrum and sooo awkward.",
   "created_utc": 1691435683,
   "score": 48,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv770w3",
   "message": "Divorced.\n\nHer idea, not mine.\n\nWe didn't even have any sort of major arguments much above a whisper when suddenly I got divorce paperwork handed to me and was told \"I'm moving out now.\"\n\nBetween dating, engagement, and marriage, that was 10 years.\n\nThat's more than long enough. I might only be 42 now but that's long enough for me to consider it a lesson learned. Fuck that.",
   "created_utc": 1691436211,
   "score": 33,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6i60q",
   "message": "I haven't found someone with whom to share a relationship yet.",
   "created_utc": 1691426936,
   "score": 16,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6snry",
   "message": "Time. I’m a busy dude, and I’d feel awful if I didn’t have the time to spend with someone I cared about because of other obligations. I wouldn’t want that done to me.",
   "created_utc": 1691430842,
   "score": 23,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv74ch9",
   "message": "After years of being in serious relationships, I decided to retire my penis.",
   "created_utc": 1691435209,
   "score": 45,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6p0td",
   "message": "manufacturing issues. I don't love myself, so i don't think i'm ready to receive love. I can give love no problem. But I want to be comfortable receiving it as well.",
   "created_utc": 1691429497,
   "score": 40,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv73k9g",
   "message": "I just stopped giving a fuck. And realized that being single is 100x better than being in a relationship",
   "created_utc": 1691434914,
   "score": 36,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6ukoo",
   "message": "Small town so not too many options to begin with and I work all the time. When I get home, I just wanna chill lol\n\nI also don’t want to date someone just to date someone either if that makes sense. If we get along well and have common interests and goals, then that’s great!",
   "created_utc": 1691431557,
   "score": 22,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6uolc",
   "message": "By choice, enjoy being single and idea of getting back out there after 6 years scares bejeesus out of me.",
   "created_utc": 1691431597,
   "score": 5,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7b3ci",
   "message": "43 been single almost 10 years, focused on being a prominent dad to my 3 girls, 2 eldest have grown up and moved on, youngest is almost 12, meeting someone was never a factor and I've never been phased being single, it does get lonely on times but I keep myself busy, the dating world today is giving me red flags due to the stories of being catfished or ghosted for no reason which I'd hate so I'm a bit weary meeting anyone, not a bad looking guy always had compliments over the years, keep myself fit and healthy have a decent job, I'm happy with my life and if I meet a woman it'll be by chance and I'm ready in myself to have someone new in my life not because I joined an online dating app which I probably won't be doing",
   "created_utc": 1691437735,
   "score": 11,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7g6ya",
   "message": "being fat and shy surely isn't helping me out.",
   "created_utc": 1691439618,
   "score": 8,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7tof7",
   "message": "It's because of the way light refracts off my face.",
   "created_utc": 1691444652,
   "score": 15,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6uyfv",
   "message": "I'm ugly, and I'm pretty fuckin stupid too",
   "created_utc": 1691431700,
   "score": 32,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6wvwy",
   "message": "My wife says I'm not allowed to date anymore.",
   "created_utc": 1691432427,
   "score": 58,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6l7zc",
   "message": "I learned my lesson with the first marriage.\n\nThat said, the overriding reason I’m single and not dating all that much is simply not encountering enough people in general. Most women my age I come across (no kinky interpretations please) are happily married, lesbians, or show very little receptivity to getting to know me better. The quantity of people is actually pretty high.\n\nI think it’s mostly where I am and where I spend my time.",
   "created_utc": 1691428082,
   "score": 19,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6x5c5",
   "message": "I'm not anymore but I was until my 30s. \nWhen I did date I knew quickly (a month or so) if it was going anywhere or not. Lots of flings and what not but never was in a relationship long. Until I met my now wife. We have been together 8 years now and I knew from day that she was the one. As we cuddled in bed last night she  said how happy she was to have me and how I take such good care of her. As a man receiving a statement like that makes me grin ear to ear and want to make her happy no matter what. \n\nWhen ya know ya know ♥️",
   "created_utc": 1691432525,
   "score": 23,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7a1v3",
   "message": "Like every girl where I’m at has kids, I just don’t want to deal with it",
   "created_utc": 1691437351,
   "score": 14,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6r06n",
   "message": "You know, study first.",
   "created_utc": 1691430232,
   "score": 4,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6thi3",
   "message": "Ive got problems. Not getting out much is one of them.",
   "created_utc": 1691431148,
   "score": 6,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6v5w7",
   "message": "I wish I knew so I could remedy it. 33 and nobody's ever even given me a chance on a first date.",
   "created_utc": 1691431777,
   "score": 8,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6vstk",
   "message": "I'm one of the most boring people I have ever met.",
   "created_utc": 1691432019,
   "score": 18,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv717fl",
   "message": "Cause' I'm ugly, shy, silent, and... Introvert.\n\nAnd I like it!",
   "created_utc": 1691434038,
   "score": 26,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv75q0b",
   "message": "im not convinced it would improve the quality of my life.",
   "created_utc": 1691435726,
   "score": 22,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv78dh1",
   "message": "Too scared of moving from an ex I haven't heard in 10 years? And too scared of being rejected (it's phobia.)",
   "created_utc": 1691436725,
   "score": 6,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7byw1",
   "message": "I'm just kind of sick of peoples shit. I'm expected to put in all the effort. Under the conditions of life, that just seems rude. I don't like dating rude people.",
   "created_utc": 1691438053,
   "score": 7,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7c2b6",
   "message": "Cripplinginly severe social anxiety that's gone untreated most of my life.",
   "created_utc": 1691438089,
   "score": 17,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7c5vn",
   "message": "Last serious relationship I got cheated on and kicked out of my home. Left me fairly traumatized. I also live in a small rural town so the dating pool consists of my friends exes or mine, women with children, or druggies.",
   "created_utc": 1691438126,
   "score": 20,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6tknm",
   "message": "... browsing the responses to see if that incel movement died down or not",
   "created_utc": 1691431181,
   "score": 33,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6kqdk",
   "message": "Im ugly nobody wants to date an ugly person",
   "created_utc": 1691427899,
   "score": 17,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6o2uu",
   "message": "People don't want to be with someone who isn't a 10/10. That's it. Girls want a guy who's handsome, confident, has a good job and money. They don't want to deal with imperfections like traumas, bad childhoods, bad habits, depression or adhd. Same with guys. We want a girl who's cute, loyal, supportive etc. No one wants to have a real, human relationship, with problems, imperfections, challenge, discomfort, or god forbid, emotions.\n\nEverything is a \"red flag\"\nEspecially if we're neurodivergent, have adhd or autism. \n\nIf we want to confide in you, we're called too sensitive. If we want sex, we're perverts. If we dare to call out your insecurities or issues, we're called abusive. If we're not interested in relationships anymore because we're tired of being constantly rejected, bullied and judged, then we're called incels. There's no winning. So I just don't give a fuck anymore.",
   "created_utc": 1691429148,
   "score": 96,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6ton8",
   "message": "Insecure, never socialize, and even if someone seems interested in me I immediately want to diffuse the situation rather than play into any sexual tension that may be there.",
   "created_utc": 1691431222,
   "score": 6,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv73y87",
   "message": "I'm thirteen and not ready for love.",
   "created_utc": 1691435059,
   "score": 10,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6ri27",
   "message": "Because I don't approach girls because I don't want to face rejection. Also, I'm not the best looking guy. \n\nMy height is OK, but my face is lacking. I'm not gonna approach a bunch of girls just to be rejected.\n\nTrying is pointless when rejection is certain.\n\nI'm just gonna start visiting brothels very soon. It is legal where I live, skips all the bullshit and cuts to the chase. Plus I get to have sex with lots of different hot women multiple times a month. I just have to pay for it.\n\nBut you always pay for sex. Relationships and dates cost money as well. Maybe even more in the long run.\n\nPlus, approaching girls in real life at work or school also damages your reputation, if she rejects you. If you keep approaching girls after 1 or 2 rejections, you will soon be known as the creep who hits on everyone.\n\nAlso, you will be the laughing stock if you get rejected, even years later. I remember approaching a girl in school one time.\n\nYears later, some guy in my school came to me and said : \"Hey, is it true that you had a crush on this girl years ago?\"\n\nSo the girl I approached gossipped about it to other guys in my area years later. It is easy to become a laughing stock if you're not careful, especially when you're not good looking.\n\nI much prefer to just visit prostitutes. It eliminates all bullshit.",
   "created_utc": 1691430417,
   "score": 30,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv77tx7",
   "message": "Because I’m too chicken to ask her out",
   "created_utc": 1691436519,
   "score": 14,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6hvfq",
   "message": "I’m a singular entity, incapable of becoming multiple people.",
   "created_utc": 1691426826,
   "score": 6,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6sn44",
   "message": "I am shy, I don't go out literally anywhere that is not uni, work and the gym, pretty low self-esteem, and I don't have the best looks(this si the least influential out of all the things I said)",
   "created_utc": 1691430835,
   "score": 19,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv72fv0",
   "message": "She left me 2 days ago.",
   "created_utc": 1691434496,
   "score": 3,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7amrg",
   "message": "For a long time until recently (like, really recently, as in, a couple weeks ago) the answer was *\"I just haven't gotten around to it yet\"*. There was always something else that needed more urgent focus, from schooling, to work, to fitness, to just generalised \"figuring out life\" stuff; I wanted to be the best version of myself and that came first, because if I'm not happy with myself, how can I expect someone else to be happy with me?\n\nIt's really only recently that I feel like I'm secure in my life about everything else; I've done well for setting myself up in my career, I'm \"decently\" well socially adjusted and compatible, and I'd put myself as pretty okay on the attractiveness scale. So overall, I that I feel like I could do well for myself to be a focused and committed partner.\n\nGranted, at 29, I do feel a bit late to the game...\n\n-----\n\nSo why am I \"still single?\", because I'm literally only just stepping through the door.",
   "created_utc": 1691437565,
   "score": 10,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7bkhy",
   "message": "Many reasons. Reason #1: it doesn't bother me.",
   "created_utc": 1691437906,
   "score": 4,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7tysf",
   "message": "I ask the women out and I keep getting rejected. I fuck a lot of escorts now because I’m done being rejected. I tried dressing nicer. I lost a ton of weight. I give up. Now I’m just going to make a lot of money and travel alone",
   "created_utc": 1691444764,
   "score": 1,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6vrtc",
   "message": "I don't attract the women I am attracted to and I refuse to settle for less.",
   "created_utc": 1691432009,
   "score": 10,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6t4mg",
   "message": "Because I want to be. I can do whatever I want all the time",
   "created_utc": 1691431015,
   "score": 4,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6sww3",
   "message": "Afraid to try and meet someone.",
   "created_utc": 1691430937,
   "score": 5,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6vwy1",
   "message": "Mostly antisocial, extremely socially awkward, and, I don't trust anyone, so, those are three reasons I don't try to date anyone, I also feel like I'll end up doing something stupid and fucking everything up, so, I'll stay alone, and not try to date for now.",
   "created_utc": 1691432062,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6x461",
   "message": "I don’t need anything. I wants some things. I also do not want a bad relationship more than I want to risk it. \nSo I am enjoying a single life I’ve never really had. And doing so many fun things I want to do. With some light relationships sprinkled in there.",
   "created_utc": 1691432513,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7113z",
   "message": "47 with two kids still in school. \n\nI have put them through enough already.",
   "created_utc": 1691433974,
   "score": 3,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv72pjz",
   "message": "I’m not for the first time since 2018, but when I was it was because it was too difficult to find a woman who has similar core values. It’s true that as you get older and the prettier women that you are dealing with, the more superficial they are, and the looks usually compensate for a bland personality. This is from an American perspective, or at least where I’m from in the US. The women are high maintenance.\n\nI’m dating a Brazilian woman and am never looking back.",
   "created_utc": 1691434596,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv73goi",
   "message": "Im content with myself and pretty much just don't want to deal with a relationship. \n\nExpectations feel insanely one sided. I just see no actual benefit. Id rather spend my time doing things i enjoy.",
   "created_utc": 1691434876,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv73prx",
   "message": "Working on myself. Trying to lose the weight i unfortunately added during college. If anything I just want to look good naked again",
   "created_utc": 1691434971,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv748wu",
   "message": "Girl still thinks I want a friend…",
   "created_utc": 1691435171,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7490b",
   "message": "I have no confidence starting a conversation",
   "created_utc": 1691435172,
   "score": 3,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv74vy1",
   "message": "skill issues",
   "created_utc": 1691435411,
   "score": 6,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7819p",
   "message": "Feels like the majority of answers are ugly. I'll add that I don't have many friends or family members and I'm not very funny",
   "created_utc": 1691436598,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv78d4y",
   "message": "Might sound ridiculous but I don’t want to date for “fun”. I want to meet someone naturally and date since I’m interested in them as a person. Admittedly do need to be more social too though to be fair.",
   "created_utc": 1691436722,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv79ay1",
   "message": "Because I’m a bit shy and haven’t found a woman who actually wants a supportive, loving, funny and charming goofball of a man.",
   "created_utc": 1691437072,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv79soa",
   "message": "Nothing to show for decades of trying but two amazing kids. Now I’m old enough to just not care any more.",
   "created_utc": 1691437255,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7agpz",
   "message": "everyone thinks i’m gay but i’m straight",
   "created_utc": 1691437503,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7apwy",
   "message": "Ugly, old and live in a place where there’s nothing to do other than go to the beach, get drunk, visit historical houses belonging to random rich asshole in the 1800’a and some other combination of the three options above.\n\nAnd just in case anymore tries to reply with the beach is awesome, I dare you to go by yourself as a fat man in your early thirties who’s lived by one beach or another your entire life. Not so appealing now is it?",
   "created_utc": 1691437597,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7as96",
   "message": "Ugly, shy, and bad genetics (short with a lopsided face).\n\nI’ve had enough.  It is what it is.  I no longer want to deal with the responsibilities of being in a relationship.  I was never dealt the right cards in my life.",
   "created_utc": 1691437622,
   "score": 4,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7b1x5",
   "message": "Average looking, Dont really try to go out and find someone, live in a rural area, 39 yrs old. So anyone I do run across is either already married or has 4 kids and s drug problem.",
   "created_utc": 1691437720,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7blie",
   "message": "Because I need to worry about getting my own shit together, before I can worry about the well-being of another person.\n\nAlso, I'm kinda out of shape which doesn't help lmao",
   "created_utc": 1691437916,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7c9bk",
   "message": "Having a tiny penis will really shrivel up the dating pool and it also crushes your self esteem.",
   "created_utc": 1691438161,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7ct4z",
   "message": "Laziness and stupidity",
   "created_utc": 1691438367,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7eclk",
   "message": "They all lost the Yu-Gi-Oh duels. My queen must win her prize first before exploring the treasure trove in my parents basement, which has accumulated for 34 years.",
   "created_utc": 1691438943,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7gobm",
   "message": "Still waiting for the right person. (I am lazy and put zero effort into it)",
   "created_utc": 1691439796,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7i3rx",
   "message": "It's a combination of factors, I feel. I struggled with my confidence and mental health in my teens and early 20s, which probably goes some way to explaining why I never had much luck. I briefly had a girlfriend at uni, but I fucked it up because I was so desperate to make it work but had no clue what I was doing.\n\nI'm nearly 24 now, and my mental and physical health is much better. They're not going to put me on the cover of Men's Health anytime soon, but I'm active, I eat well and take care of myself, so I'm a far cry from the fat, smelly, depressed slob I once was. But I still struggle to meet anybody. Clubs really aren't my thing, and because I've always had jobs that require me to work solo much of the time, I've never had much luck through work either. I've tried the dating apps, but 9/10 I've had a match I've either been ghosted or it's been some kind of pisstake. Plus it seems every woman my age is in a relationship already. I feel like I'm old enough now that I'd be judged for going with a teenager (plus I have to be especially careful with that because of my job), but just about every 20-25 year old I know is settling down, getting engaged, having babies, buying houses, etc. I never wanted to settle down young, so that doesn't make me envious, but I do feel there's something missing. I have a decent-paying job that I enjoy, 2 degrees, a car, a house and a good circle of friends, and of course I'm very grateful for all of that. But I am bloody lonely, and I'm desperate for that to change.",
   "created_utc": 1691440322,
   "score": 8,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7jlhq",
   "message": "Too shy to ask someone out",
   "created_utc": 1691440865,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7jnnv",
   "message": "Ya ever heard of smth called social anxiety? And smth called chronically ugly? Pretty nasty stuff ya know?",
   "created_utc": 1691440888,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7lh2q",
   "message": "Wife figured out she was gay. Still my best friend!",
   "created_utc": 1691441552,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7lzmd",
   "message": "No girls even look my way, never even had a single date in my life.",
   "created_utc": 1691441738,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7s3ih",
   "message": "Was married. Happy, content. But screwed everything up. Pushed her away with my bullshit and as much as I like to tell everyone I'm over her. I'm not. So two years later I'm still single and it's for the best.",
   "created_utc": 1691444041,
   "score": 2,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7t7ts",
   "message": "I was sexually harassed in a bar and my girlfriend of 4 years, who I was about to propose, decided it was somehow my fault and dumped me. I'm now single for the first time in my adult life.",
   "created_utc": 1691444470,
   "score": 1,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7tpke",
   "message": "A couple reasons.\n\nBiggest one is, I have mental health issues and physical issues that are already stressful enough. I tend to have a hard time communicating as well and am very quick to emotional outbursts even though I am much better at handling myself now.\n\nTwo, finances. I just bought a car and my interest is super high cause first time buyer and not a great but not terrible credit score. On top of student loans, I am in a bit of a pinch financially until I can refinance the car and pay some loans off.\n\nThree, its the social aspect of things. After work, I am tired and I do not want to have to go out and make new friends. Along with the fact that there are a lot of girls my age are not exactly girlfriend material. Its very hard to interact with them, and even just on a friend level, its either like talking to a brick wall or someone who has an overinflated ego.\n\nFour, I still am working on issues with my last relationship. I dont want to jump into something I aint ready for.",
   "created_utc": 1691444664,
   "score": 1,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7tru9",
   "message": "Because having an SO before you ship out is generally a bad idea.\n\nI plan to start my search again in earnest after I get more settled.",
   "created_utc": 1691444689,
   "score": 1,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7zi95",
   "message": "I like single, but desperately want to meet someone.  Ive gone on many dates, but just felt no connection with anyone yet",
   "created_utc": 1691446945,
   "score": 1,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv806b1",
   "message": "I had a girl tell me one \"you know, you'd be the perfect BF, if only you were taller\" and yes, she was noticeably shorter than me 🥲",
   "created_utc": 1691447217,
   "score": 1,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7krpw",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv6r9cq",
   "message": "Ugly and broke, who the hell wants a ugly and broke man ??",
   "created_utc": 1691430326,
   "score": 3,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv76eam",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv8gp7t",
   "message": "Do you hae any idea how nice it is to come home after a 10 hour blue collar job, to the kitchen i cleaned last night NOT being a disaster, and then being also NOT getting accused of \"not doing enough.\" Because its so nice that Im not giving that up. \nNothings lonlier than being made to feel lonely by someone in the same room. \nFuck that.",
   "created_utc": 1691454122,
   "score": 7,
   "submission_id": "15kpwpc"
  },
  {
   "comment_id": "jv7qoe3",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kpwpc"
  }
 ]
}