{
 "submission_id": "15kx298",
 "title": "what is the most hurtful thing someone said to you?",
 "selftext": "",
 "created_utc": 1691442307,
 "permalink": "/r/AskReddit/comments/15kx298/what_is_the_most_hurtful_thing_someone_said_to_you/",
 "score": 170,
 "url": "https://www.reddit.com/r/AskReddit/comments/15kx298/what_is_the_most_hurtful_thing_someone_said_to_you/",
 "comments": [
  {
   "comment_id": "jv83hw2",
   "message": "When my sister committed suicide my mother looked at me and said the wrong daughter died. It was 20 some years ago I am okay.",
   "created_utc": 1691448583,
   "score": 142,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7w6j7",
   "message": "As a kid I was very depressed overweight and socially stunted, my brother called me a friendless fat loser who should kill myself",
   "created_utc": 1691445621,
   "score": 35,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv85n3h",
   "message": "\"I don't know what is so special about you.\" -My mother after seeing my kids get excited that I was home from work.",
   "created_utc": 1691449474,
   "score": 55,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv84li4",
   "message": "“Oh GROSS” - my crush when the person who was bullying me told my crush I liked them….while I was standing right there. Literally talking to my crush. It was also Valentine’s Day.",
   "created_utc": 1691449039,
   "score": 199,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv82bkp",
   "message": "We were in an argument about his past choices of sleeping around giving me 4 STDs and he said “at least my choices didn’t kill my daughter”. For context my daughter had died that year at 6 months in her sleep (SIDS), everything was done correctly to help prevent SIDS but it just happened. It was not my or anybody’s fault. Anywho - he said that and I started throwing hands. Landed my ass in jail, but all charges were dropped and I was acquitted because that was bullshit and literally everyone in the system told me they woulda done the same.",
   "created_utc": 1691448097,
   "score": 221,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7noxo",
   "message": "You don't deserve that corn dog.",
   "created_utc": 1691442373,
   "score": 17,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7odp7",
   "message": "Your nipple taste like feet.",
   "created_utc": 1691442634,
   "score": 162,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv86gq6",
   "message": "“I don’t give a fuck if you come back”\nMy ex fiancé the night before I left to go visit family in another state.\n\nSpoiler alert, I came back but only to collect my belongings",
   "created_utc": 1691449815,
   "score": 142,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv890hw",
   "message": "My religious mom assumed i was a pedophile just because im gay.  ill never forget that shitty feeling of being thought of like that by my own mother and the fact that she thought I was capable of something like that.  To her, all forms of \"sexual immorality\" are one in the same",
   "created_utc": 1691450872,
   "score": 93,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv891fn",
   "message": "I worked really hard in high school in theatre (still very happy in it over 20 years later). I was accepted to every school I applied and through a donation my high awarded me a scholarship. \n\nIn the glow of pride of this unexpected gift my mother said in front of everyone \"I can't believe they wasted their money on you\". \n\nGuess who DOESN'T get comps to my shows.",
   "created_utc": 1691450883,
   "score": 154,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv87j38",
   "message": "My dad died suddenly when I was eight, I sat across the room from him when the doctor called it. A few weeks later, a nun at my Catholic school told me that my dad would die another thousand deaths if he saw my behavior.",
   "created_utc": 1691450259,
   "score": 3,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8bwm0",
   "message": "My mom once said \"I don't even want to be your friend because you're so gloomy\". I was depressed because you were abusing me mom.",
   "created_utc": 1691452099,
   "score": 208,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7ppb7",
   "message": "\"Is it contagious?\" While taking a step back, as if my stutter would suddenly transfer like the Pest.\n\nThankfully for them, idiocy isn't either.",
   "created_utc": 1691443128,
   "score": 239,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7tk2u",
   "message": "\"We would never do that to you\" \\*Turns around and does it\\*",
   "created_utc": 1691444605,
   "score": 194,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv81ijy",
   "message": "\"What's wrong with you?! You're a freak, and it's F-ing bizarre you're against this! You're such a disgusting freak for not wanting to take this step with me. You disgust me. You don't love me.\"\n\nMy ex berating me because I don't want children since mental !llness runs strong in my family, and I just don't have a maternal bone in my body for children (I am great with dogs).\n\nI haven't been right since. :(",
   "created_utc": 1691447764,
   "score": 138,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv86h3m",
   "message": "I was suicidal (13f at the time) and trying to ask for help.\n\nYou need to pray more!\n\nI mean no offense to any religion. If you break a leg you need more than just prayer. You need a doctor. The same should be applied to mental health care. It is, however, shamed by a great many people!",
   "created_utc": 1691449819,
   "score": 230,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7w3km",
   "message": "I’m tired of having stupid kids.",
   "created_utc": 1691445590,
   "score": 23,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv85gm7",
   "message": "Are you sure you want to eat all of that",
   "created_utc": 1691449399,
   "score": 23,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7r7ad",
   "message": "\"You're a nobody, a nothing\"",
   "created_utc": 1691443697,
   "score": 80,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8aix9",
   "message": "Ouch, my own my mom calling me a bitch and a handful of other names. It killed my emotional state and self-esteem. She’s a cruel woman behind the shadows. I’ve learned how to build myself back up since then but will never forget.",
   "created_utc": 1691451513,
   "score": 36,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv84r4k",
   "message": "My aunt told me that when my mom passed it was my fault because i was an addict. (I know it wasnt now, but at 19 that was rough)",
   "created_utc": 1691449104,
   "score": 15,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv844an",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7sfxi",
   "message": "\"You can be a lot of things in life, but you'll never learn to love someone.\"\n\nMaybe the person was right, but I'm really really trying to do better at this.",
   "created_utc": 1691444173,
   "score": 55,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv88e9z",
   "message": "I have a daughter that is 6 years younger than my son, one day the daughter did something that any normal 2-year-old does and I told my wife I said that's pretty cool he never did that, she said yes he did but you were working so many hours you weren't here to see it.\n\nThat is the most hateful hurtful thing I had ever heard and from that point on I cut my hours way back and stopped giving a s*** what my boss thought",
   "created_utc": 1691450614,
   "score": 99,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv82cls",
   "message": "Asking if my cousin would be “Okay around me” when I came out as gay. Sadly, that was my mother that asked that.",
   "created_utc": 1691448109,
   "score": 25,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv85j11",
   "message": "Ouch.\n\nThis one hurts.\n\n\n“You’re fat non-understanding loser who just follows”\n\nShe started an onlyfans after our breakup.\n\nStill fat, still happy",
   "created_utc": 1691449427,
   "score": 17,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8626u",
   "message": "\"If you are too crippled to stand in line, then you should have just stayed home.\"\n\nOn Black Friday, at the service desk, when I tried to get help when others were in line.  Not ideal, but I was in lots of pain.",
   "created_utc": 1691449647,
   "score": 20,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8duuh",
   "message": "“[my name] doesn’t care about anything. He has no feelings”",
   "created_utc": 1691452930,
   "score": 183,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv814re",
   "message": "Once, someone told me that my momma was so fat, her belt size was equator.\n\nThat one really stuck with me.\n\nMainly because it was so accurate.",
   "created_utc": 1691447607,
   "score": 15,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv83ma9",
   "message": "My mom said she regretted the day she conceived me.",
   "created_utc": 1691448633,
   "score": 16,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv80xjb",
   "message": "I saw an ugly character and jokingly said \"haha, he looks just like me\", the guy answered me, \"like a dumb face? yes, but he is not as fat as you\"",
   "created_utc": 1691447524,
   "score": 21,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv85dvj",
   "message": "My grandfather said when I was 10 years old, in 2-3 years if I died to cancer in that time he won’t care.",
   "created_utc": 1691449367,
   "score": 157,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv85rzo",
   "message": "Nobody gives a “duck” about your birthday. Said to me by my old boss when I asked for time off for said birthday to see my family for the first time in 3 years.",
   "created_utc": 1691449529,
   "score": 21,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv89v8b",
   "message": "I’ve commented this before but someone once said to me/about my wife that “it sucks her dad died [last week of a sudden massive heart attack] but that doesn’t give her an excuse for her behavior.”\nThe problem was, the statement was totally untrue. There was zero “behavior.” The person was literally just being a cold hearted bitch because they took a disliking to my wife, who was only ever perfectly kind to the cold hearted bitch. I excused a lot of shitty behavior toward myself and others from that POS but this was the last straw. To not even be able to fake a decent human interaction toward someone the very week their father dies a horrific, untimely death really speaks to the kind of garbage heap of a human I was dealing with.",
   "created_utc": 1691451235,
   "score": 128,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8d53t",
   "message": "After a last call hook up, I had a guy meet me back at my place for a little casual romp. The next morning he rolled over and said...\"I can't believe I F\\*cked you.\" At the time it was a real blow but I recently saw him again and actually... \"What the hell was I thinking.\" He's short, at least 20 lbs. over weight and has back acne and a receding hair line. I feel much better now.",
   "created_utc": 1691452622,
   "score": 98,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8dzvz",
   "message": "“Well you’re just a little whore and probably wanted it” - my older (60’s) foster parents after my sister and I told our case worker their older (30’s-40’s) son had been sexually abusing both of us for 1 1/2 years. I was 11, sis was 13. I had just had my 1st period days before we decided to tell, my big sister was terrified he’d go all the way with me, as I was small (still am, 36y and 4’10”, 100lbs) and she was scared he’d get me pregnant since I now had periods. He was a big, burly and harry man, that I remember used to make me vomit in my mouth when he held my body near his. His name was John Deyo Sr. He’s since died a couple years ago, but they only gave him 7yrs total, and I think he got out early.",
   "created_utc": 1691452989,
   "score": 50,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7tbv1",
   "message": "“Your a burden to me”",
   "created_utc": 1691444515,
   "score": 5,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7s5kn",
   "message": "I could get over how ugly you are if your dick wasn't so small.",
   "created_utc": 1691444062,
   "score": 20,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv837hh",
   "message": "If you had brains, you wouldn't know what to do with them.\n\nOne of my mom's favorites growing up.",
   "created_utc": 1691448463,
   "score": 139,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv84ryd",
   "message": "\"Worthless\" and \"pointless\"\nA friend of my ex called me the most horrible thing ever becuase my boyfriend (at the time) was two years younger than me.... You know where that gose",
   "created_utc": 1691449113,
   "score": 2,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv85yn7",
   "message": "My supposed friend commented about her sister's small house saying \"I'd never live in a house like that!\". I live in the exact same model in the same neighborhood.",
   "created_utc": 1691449606,
   "score": 59,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv89s5n",
   "message": "\"You're the only man I can ever see myself with, that I would have a family with. I love you.\"",
   "created_utc": 1691451199,
   "score": 2,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8ay47",
   "message": "“I don’t want to tell my parents about you because you don’t have an advanced degree and they’ll tell me you’re not good enough”",
   "created_utc": 1691451691,
   "score": 11,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8be46",
   "message": "After finding out I'm Jewish, they threw money on the ground to see if I was \"cheap enough to pick it up.\"",
   "created_utc": 1691451881,
   "score": 6,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8c9ip",
   "message": "My daughter has said unbelievably hurtful things to me. But I won't give her words the power by repeating them.",
   "created_utc": 1691452251,
   "score": 16,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7o23p",
   "message": "\"I disagree.\"",
   "created_utc": 1691442510,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7nzve",
   "message": "[deleted]",
   "created_utc": 1691442486,
   "score": 0,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7ogsl",
   "message": "Ive been told being a nazi in my school multiple times begins my back because i did a nazi joke nad then doing a heil Infront of my friends. Things turned dark fast and now some people still believe i like hitler",
   "created_utc": 1691442666,
   "score": 248,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7rym5",
   "message": "You're smart",
   "created_utc": 1691443988,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv7u4dv",
   "message": "A gf told me she didn’t like my tacos. Worked hard on those motherfuckers.",
   "created_utc": 1691444823,
   "score": 106,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv805zy",
   "message": "I got called a fa***t as a kid by an adult cause I was a boy who liked to have long hair. It’s a hurtful word but i didn’t know what it meant so it didn’t hurt my feelings i no longer have long hair but not because of trauma or anything I just realized it did not fit me.",
   "created_utc": 1691447214,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv83w5b",
   "message": "My ex started fucking Someone new a few days after the break up. That make me feel bad I confronted the ex and he told me \"I just fucked her and she loved it and you could never compare\". That hurt my ego so much.",
   "created_utc": 1691448747,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv852h8",
   "message": "Sister told me to die of cancer",
   "created_utc": 1691449234,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv85e4b",
   "message": "It’s not me it’s you",
   "created_utc": 1691449370,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv85qqp",
   "message": "‘No one else will ever love you’ (said by abusive ex boyfriend, sadly I believed it at the time being young and insecure)",
   "created_utc": 1691449515,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv86bs7",
   "message": "To disappear without leaving a trace",
   "created_utc": 1691449757,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv86ofp",
   "message": "my dad once was angry at me and said that he wished I were an abortion. I knew even back then that he didn't mean it, yet sometimes decades later, it still stings.",
   "created_utc": 1691449901,
   "score": 49,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv86vse",
   "message": "This is gonna hurt",
   "created_utc": 1691449987,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv86zza",
   "message": "\"You don't need to gain more than 15 lbs.\", my MIL 10 minutes after telling her I was pregnant.\n\nI get that some women don't, but what kind of comment is that?",
   "created_utc": 1691450037,
   "score": 17,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv87d0b",
   "message": "That I wasn't attractive enough",
   "created_utc": 1691450188,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv87lye",
   "message": "Your mom should have had an abortion when she had the chance",
   "created_utc": 1691450291,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv87mof",
   "message": "\"Even your dad doesn't want you\" my mom when we were in a fight and she was on the phone with my step mother",
   "created_utc": 1691450299,
   "score": 5,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv87oxc",
   "message": "\"I really like you, a lot, but you've got such a bad reputation that I can't be your friend anymore.\" \n\nShitty community. Shitty friend from that community.",
   "created_utc": 1691450325,
   "score": 47,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv88055",
   "message": "How can your family be in existence since the beginning of time and have nothing to show for it?\n\nI work in finance and don't have an inheritance.",
   "created_utc": 1691450454,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv885c8",
   "message": "When I was 11, my sister was in a car accident after my mother came back from the hospital. She looked at me and said why couldn’t have been you..?",
   "created_utc": 1691450513,
   "score": 50,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv88pk3",
   "message": "I want you around,but we don't need you",
   "created_utc": 1691450745,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv88vdy",
   "message": "My mom told me when I was 5 that I was not wanted. Now it took me 15 years to actually stop trying to please and finally live for myself",
   "created_utc": 1691450814,
   "score": 90,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv89bty",
   "message": "“This is why your girl broke up with you for your best friend”\n\nThis was in highschool, abt 7-8 years ago. I now have a great life, GF, and I’m also on great terms with my mother. My parents are amazing people despite our cultural differences and heritage and my mom is one of the nicest women I know, and honestly I don’t really remember those words that much anymore anyways. \n\nI also don’t talk to that “best friend” anymore.",
   "created_utc": 1691451004,
   "score": 20,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv89u9k",
   "message": "\"My biggest regret is losing control of you.\"\n\n-Married woman who got me a job as her bakery assistant and then sexually harassed me out of it.",
   "created_utc": 1691451224,
   "score": 36,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv89vc6",
   "message": "You're easily forgotten",
   "created_utc": 1691451236,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8a83a",
   "message": "\"You're a loser and you'll always be a loser. That's why you're on the waitlist for that grad program.  No one wants you.\"\n\nAnd then I woke up crying.  :)\n\nFunny enough, that person in real life had always tried to support me.",
   "created_utc": 1691451386,
   "score": 23,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8a8hk",
   "message": "My ex husband told me I didn't deserve food once. That's probably the one.",
   "created_utc": 1691451391,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8aoqa",
   "message": "I used to love your body now you're too fat to be loved by anyone",
   "created_utc": 1691451580,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8awpr",
   "message": "\"Don't play innocent, you know you want to kill all the gay people once the power vacuum is gone.\" \n\nI'm a \"Thou Shalt Not Kill\" Christian.",
   "created_utc": 1691451674,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8b13e",
   "message": "my bm told me once shed probably wouldn't still be associating with me if we hadn't had our son. idk if she cares the way I do but I considered us pretty good friends. Now she's just the mom of my child.",
   "created_utc": 1691451726,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8b5r7",
   "message": "You would be so more attractive if you just lost some weight or have bariatric surgery.",
   "created_utc": 1691451782,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8b7g4",
   "message": "\"I just want my son back\" from my mom after I was accused of doing something I didn't do",
   "created_utc": 1691451803,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8b8hn",
   "message": "\"Go seek psychological help, not family help. Psychological.\"",
   "created_utc": 1691451814,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8bbg2",
   "message": "The man who fathered me told me that I'm basically useless when I was seven or eight. I can still hear his exact words now at 29.\nA boy in 10th grade stood in front of me and made \"oink oink\" sounds. He's lost all of his hair at 20. Ha.",
   "created_utc": 1691451850,
   "score": 26,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8bf3c",
   "message": "My mom said my dad wanted her to abort me. I mean, he always treated me terribly, but to hear those words really crushed me.",
   "created_utc": 1691451893,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8bhf8",
   "message": "\"you are a disgusting human being\" 😒\n\nfrom my best friend since childhood\n\nI haven't spoken to him since",
   "created_utc": 1691451920,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8bhom",
   "message": "My ex who I ran myself ragged to please, told me I was useless, I never did anything right and called lazy multiple times a week (he never had to do any household chores and we both worked 40+ hr a week)",
   "created_utc": 1691451923,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8bhu5",
   "message": "You don’t matter.",
   "created_utc": 1691451925,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8bm1y",
   "message": "\"I think my sister is now either a-sexual or only interested in objects\"- the brother of my first, and only girlfriend",
   "created_utc": 1691451973,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8btv7",
   "message": "I want you back I want to work it out and do anything to be with you, I love you. Proceeded to turn me down less than a week later.",
   "created_utc": 1691452066,
   "score": 17,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8c48n",
   "message": "I'm sorry I just don't love you anymore..... can I pop round Friday for some weed for a mate \n\nHonest.",
   "created_utc": 1691452189,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8c4hm",
   "message": "My mom said, \"it's no wonder none of your friends like you,\" so I guess there's that.",
   "created_utc": 1691452192,
   "score": 119,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8c6au",
   "message": "………",
   "created_utc": 1691452213,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8c6vl",
   "message": "When I was about 6 or so years old, i accidentally knocked over a glass bottle and my mom screamed “I should’ve never had you”",
   "created_utc": 1691452220,
   "score": 4,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8c8jz",
   "message": "You are exactly like your Mother",
   "created_utc": 1691452240,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8c8w3",
   "message": "Someone will eventually love you even though you're ugly",
   "created_utc": 1691452243,
   "score": 5,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8caex",
   "message": "Second contender\n\nmy new MIL calling me “white trash” *on my wedding day* and then yelling at me for “selfishly” crying as a response",
   "created_utc": 1691452262,
   "score": 19,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8cc0a",
   "message": "\"please get out of my house.\"",
   "created_utc": 1691452280,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8ccbo",
   "message": "\"Why are you the way that you are?\"",
   "created_utc": 1691452284,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8ced6",
   "message": "\"Hey aconfused_lemon, I know you're upset I have feelings for this other guy, but that's making things hard on me so I want to go on a break\". They started hooking up that day after she called me controlling for not wanting to go on the break",
   "created_utc": 1691452308,
   "score": 15,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8ceds",
   "message": "Nothing..fuk them lol words dont hurt grown ups",
   "created_utc": 1691452308,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8cfyb",
   "message": "My ex said “our daughter is pathetic to have you as her mom” when I was having sever post-partum depression",
   "created_utc": 1691452326,
   "score": 12,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8ch04",
   "message": "Someone called me a child beater because this little 7 yr old girl kept trying to punch me in the face while I was sitting on a couch. I grabbed her arms and pinned them to her sides, got up off the couch, and marched her over to her mom for punishment.  The mom proceeded to scream at ME instead of her child. \n\nStupid people shouldn't have crotch goblins...",
   "created_utc": 1691452338,
   "score": 130,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8ci5l",
   "message": "“I could kill you right now \u0026amp; not even care” —Ex-fiancé",
   "created_utc": 1691452351,
   "score": 78,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8citx",
   "message": "Oh man third contender \n\nMy kindergartner principal Kelley Glasko (phonetic spelling) called me “a manipulative little bitch” for crying when I was being falsely accused of vandalism by the actual vandals",
   "created_utc": 1691452359,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8cjr4",
   "message": "My mom told me she regretted having me….",
   "created_utc": 1691452370,
   "score": 5,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8cldk",
   "message": "I have a Mrs Doubtfire tattoo on my arm, it’s a very pretty tattoo and done very well. I assume anyone that knows who Mrs Doubtfire is, knows who my tattoo is. \n\nSomeone recently asked if it was a self portrait. I am both humbled and flattered.\n\nI am a 32, for context.",
   "created_utc": 1691452389,
   "score": 25,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8cpp6",
   "message": "That I'm a useless pos",
   "created_utc": 1691452440,
   "score": 5,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8crc2",
   "message": "The back of your legs looks like craters on the moon. Then began my eating disorder.",
   "created_utc": 1691452459,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8ctbl",
   "message": "randomly out of no where introducing ourselves to a boy in high school freshmen\n\n“yeah [name] looks like a creep” - while smiling…\n\ni pretty much almost cried during that moment",
   "created_utc": 1691452482,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8cv9v",
   "message": "Your dad wouldn't be proud of you.",
   "created_utc": 1691452506,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8cva0",
   "message": "\nYour not as bright as your sister \n\n\n(Shes younger than me but is parents golden girl)",
   "created_utc": 1691452506,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8cw5v",
   "message": "\"yeah, i broke up with you because you said you didn't want sex\"\ni was really in love with this girl and she told me this a few months later when we made up. she's my friend now but it still hurts that she broke up with me with such ease.",
   "created_utc": 1691452516,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8cymu",
   "message": "\"You used to be so bright and sweet.\" It hurt but it was true, and I think I've regained a lot of my sweetness back, if not quite as bright (and I think she meant it like a bright personality, not smart). I wish she were here today to see it. Fuck cancer.",
   "created_utc": 1691452545,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8czer",
   "message": "‘You need to get over the deaths of your friends’",
   "created_utc": 1691452554,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8d1rj",
   "message": "My sister on my mom's side said she didn't love me and didn't consider me her sister.",
   "created_utc": 1691452582,
   "score": 6,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8d3qc",
   "message": "Nothing. \n\nI think ghosting is way more hurful than saying something. And I don't mean some random person from  a dating app just ghosting you after 1 date, I mean, when  you know someone for a while and they say they care about you, etc. and then just ghost you without explanation.",
   "created_utc": 1691452605,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8d8i1",
   "message": "Fourth contender \n\n“YOU RUIN EVERYTHING”\n\nThe wife of THAT uncle for refusing to be a silent victim",
   "created_utc": 1691452662,
   "score": 7,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8d9z2",
   "message": "My mother told me I was \"worth less than nothing\". Just because I was legit sick and puking. She didn't want her day off ruined. So she said that and forced me to go to school.",
   "created_utc": 1691452679,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8dpo3",
   "message": "“No matter how disappointed you are in yourself - god is much MUCH more disappointed”\n\nMy youth pastor when I tried to seek help for being sexually active at age 14. He walked out the door and never looked at me again",
   "created_utc": 1691452868,
   "score": 54,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8drsn",
   "message": "My aunt called me fat in front of a few people",
   "created_utc": 1691452894,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8dwwe",
   "message": "Thank you for the support people. It was very hurtful at the time and I did have to do a few years of therapy LOL but as I said it was a long time ago and I'm a good place. I have very loving foster parents from when I was 13 and I'm staying with them right now while dealing with some health issues. My mother was broken what can I say. It took a long time for me to realize it was not my fault. But I have grown past that and have children and grandchildren and foster parents that love me. I am honestly okay. And I have learned that other people's opinions of you are none of your business and you don't have to embrace them.",
   "created_utc": 1691452953,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8dx5l",
   "message": "\"I don't want to introduce you to my friends because I don't want them to think that I think you are attractive or with spending time with.\"\n\nEither that or \n\n\"Do your feelings ever get hurt?\"\n\nBoth said by different people, both with sincerity.",
   "created_utc": 1691452956,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8dze0",
   "message": "My husband called me selfish and lazy because I didn't want to crate one of our dogs that was laying in me which she rarely does. It was time for our other dog to come out. I was going to make the time up later in the day but instead he called me selfish and lazy.",
   "created_utc": 1691452983,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8e12t",
   "message": "My mom told me I was a mistake.",
   "created_utc": 1691453002,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8e262",
   "message": "“You should’ve tried harder” -my father after my third suicide attempt.\n\nGet rekt bitch, now you’re a part of NO ONES life.",
   "created_utc": 1691453015,
   "score": 155,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8e3xr",
   "message": "My dad told me I should kill myself.\n\nHe now pretends everything is fine but I'll remember that till I die.\n\nNeedless to say when he's finally dead I won't be there for the funeral.",
   "created_utc": 1691453036,
   "score": 166,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8e5c7",
   "message": "\"Your Dad did NOT moleste you. Corporal punishment is NOT his fetish.\"\nMy dad did molest me, corporal punishment is his fetish. My husband is an attorney and cross-examines my childhood traumas. He tries to alter my thoughts and memories.",
   "created_utc": 1691453053,
   "score": 96,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8e5gz",
   "message": "When my sister said she hoped I lost my job, and she knew I loved that job",
   "created_utc": 1691453054,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8e5jc",
   "message": "Had an old high school teacher day I’ll never succeed in life and will be a failure. Won’t provide details on subject or grade level, but… wtf",
   "created_utc": 1691453055,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8e93p",
   "message": "I don’t care that you broke your elbow",
   "created_utc": 1691453097,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8eajg",
   "message": "\"I would rather date a pig.\"",
   "created_utc": 1691453113,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8edpp",
   "message": "“You’re fat”\n\nSomeone said that to me when they were drunk ten years ago.\n\nI’ve lost 250 lbs since then.  Then I found out that a big part of that weight loss was type 2 diabetes…",
   "created_utc": 1691453150,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8eejb",
   "message": "That Im a cockroach. Everytime life brings me to a new low I just stay there. I will never be able to succeed  because im tok good with adapting to my miserable waste of life.",
   "created_utc": 1691453159,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8ef0s",
   "message": "For Context my father left before I was born. Never met him. During ages 10-12 I really wanted to meet him. \n\nTo which one time my mom finally responded   \n\"I don't understand why you want to meet someone who wanted to abort you but because of me deciding not to you are here.\"",
   "created_utc": 1691453164,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8ekdm",
   "message": "One of my parents told me that I was a burden. \nKeep in mind that this is after years of the whole family implying this to me. I had recently got out of the hospital for the third time due to health issues. \nAll of them denied they told me this before saying it wasn’t meant to be interpreted that way. \nIt’s been a year now and it still hurts whenever I remember this. \nThey aren’t wrong about it but I wish it was never said out loud. I’m still trying to become fully independent and it’s a struggle lol.",
   "created_utc": 1691453226,
   "score": 31,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8ekx0",
   "message": "My 6th grade teacher told me I was stupid. \n\nA little backstory, it was the late 80s and I’m dyslexic. It was a small school and I don’t think they knew what dyslexia was. It still fucked me up for a long time.",
   "created_utc": 1691453232,
   "score": 37,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8enyr",
   "message": "my old ex friends would call me a guilt tripper whenever i would express how sad they made me feel",
   "created_utc": 1691453268,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8eyv8",
   "message": "Had to spend a little time in a mental facility due to attempted suicide and suicidal tendencies. A few days after I got home, my dad said that I was wasting all of his money because the hospital costed him “too much money.” \n\nThat one probably takes the cake.",
   "created_utc": 1691453394,
   "score": 16,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8f10w",
   "message": "Anything along the lines of “I was just using you for your body, you didn’t matter to me it was just sex” is really really hurtful to me. And it seems like everyone says that",
   "created_utc": 1691453419,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8f2xz",
   "message": "That i was wasting my life by editing wikis and could only pull online relationships\n\nAt least I think she said that to me. She later denied it",
   "created_utc": 1691453441,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8f3p6",
   "message": "My dad telling me I only said I was suicidal because \"trans activists\" told me to. I was pouring my heart out to him about how my dysphoria had been affecting my daily life. He thought I was citing political points. \nMy parents have probably said worse. That's the worst I can think of atm.",
   "created_utc": 1691453450,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8f3tb",
   "message": "\"Your father tried to commit suicide because you are such a bad kid.\"\n\nWhen I was 14 I came home after school and no one was there. No one came home by dinner time, so I started on my homework. An hour or two later, my step-mother came home along with my step-brother. She told my dad had tried to kill himself and was rushed to the hospital. I'll never forget what she said, \"Your father tried to commit suicide because you are such a bad kid.\"",
   "created_utc": 1691453452,
   "score": 29,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8f642",
   "message": "In high school I struggled with self harm. There was one day I skipped a class because I had anxiety about going. I ended up telling my mom when I got home because I felt guilty, we laughed it off. Then as I was walking to my room she made the comment “Well liv, I guess you’re a cutter in more ways than one!” And thought it was a riot. That is something that will always stay with me. It was so painful to have all of my pain dismissed in such a flippant way. I still hold that hurt.",
   "created_utc": 1691453479,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8f6bi",
   "message": "“No offense, but I have less respect for you [than our other friends] because you aren’t going to college.” - my brother-in-law, who I considered a good friend, two weeks after I dropped out bc I realized I had no clue what I actually wanted and was looking to try something new with my life to figure it out. \n\nWell guess who’s going to be the only person who doesn’t get to know I graduated college and is going to be making MUCH more that you, Mr. Civil Engineer, thanks to that two year college break?",
   "created_utc": 1691453482,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8f6vn",
   "message": "Found out when I was 16, I couldn’t have kids. On the way home my mom said “well I guess I’ll never have grandkids since your brother doesn’t want them either”. One couldn’t One wouldn’t was her saying.",
   "created_utc": 1691453488,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8f9oc",
   "message": "\"Having you kids was the worst thing to ever happen to me. You're all so disappointing.\" \n\nWhat my dad said to me after I picked him up from a hospital appointment. I obviously didn't tell my siblings this, and haven't spoken to my dad in years.",
   "created_utc": 1691453520,
   "score": 1,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8hojh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8gujx",
   "message": "My baby was in the nicu.  My mom told me that it was my fault she was going to die because god was punishing me for marrying a sand n-word.  She's 2 now.",
   "created_utc": 1691454184,
   "score": 150,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8fdi3",
   "message": "I was ten and our dog was chained to the clothesline so he could run back and forth. Was out there with her, and I can't remember what had happened or what I did, but my mother told me that she hoped the chain would wrap around my neck and strangle me to death. One of a few similar things she did and said throughout my life. Maybe that's why I never shed a tear while I sat on her death-bed (cancer) and watched the nurse give her that final shot of morphine before she took her few last agonal breaths.",
   "created_utc": 1691453565,
   "score": 54,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8fed4",
   "message": "\"Your broken. I want a new one.\" My mother to my face when I was 14/15 years old.",
   "created_utc": 1691453574,
   "score": 41,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8fpp8",
   "message": "My mom told my grandma as I was walking past that I'm the reason she wants to kill herself. She knew I was walking past. My stepmom told me to \"stop being so dramatic\" when I told her at 16 that I genuinely wanted to kill myself. And my dad told me that I should be grateful because he put a roof over my head, food on my plate, and clothes on my back when he learned I'd spent a majority of my life[from 6 years old to about 20] struggling with suicidal ideation. Yayyyyy parents.",
   "created_utc": 1691453707,
   "score": 18,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8g96h",
   "message": "When my father looked at me and said he was glad i knew that i wasn't his, and he didn't have to be my Dsd anymore.\n\n\nMy mom was a slut plain and simple almost a habitual cheater. She had an affair with my Dad's sister's husband (my non bio Uncle on my Dads side). If you line the stars up on paper, i was my uncles kid\n\n\nWhen i was a little kid, he was decent to me. When my sister was born 7 years later, her shit didn't stink, and i had better not breathe wrong. When i told him, i  knew the family's little secret. He was glad to be rid of me\n\n\nHe died 6 years later from a heart issue. Out of curiosity,  i did a DNA test, and my sister did one too. Turns out i, in fact, was my fathers son and my sister, was his best friends kid",
   "created_utc": 1691453935,
   "score": 120,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8frns",
   "message": "My father told me that I would never live to the age of 50 because I was overweight. He went as far as to leave my brother and sister his estate in the will, but I was only left a small amount of money that I would only be eligible to collect after my 50th birthday. He was one of the most cruel people I have ever met in my life.",
   "created_utc": 1691453730,
   "score": 188,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8gq47",
   "message": "\"You won't ruin my new family\"\n\nMy mom to 13ish year old me\n\nJokes on her, she ruined it herself",
   "created_utc": 1691454132,
   "score": 48,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8fbxb",
   "message": "I don't trust you anymore to watch the grandkids. After 8 years. My gut says it's because i told the parents I don't want to do it as much. I was babysitting more than not \u0026amp; I loved it. And when mom came to pick them up, they didn't want to leave. So my punishment for wanting some of my life back was this. It's been 3 years. It's aged me \u0026amp; broken my heart. BUT REALLY WHAT I HEARD WAS I DONT LOVE YOU ANYMORE to hurt me this bad. Started right before the pandemic. I asked, do you think this is the right time to separate them from loving, happy, fun, generous, available, present grandparents when they lost school \u0026amp; socializing? Mom wears the pants in the family. How did she satisfy their questions of why they can't come here \u0026amp; why we are not invited anymore? I can only assume with bs. Hope she didn't teach the kids to do that to her one day. I wouldn't wish it on anyone.",
   "created_utc": 1691453547,
   "score": 5,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8fraq",
   "message": "Various things said after suicide attempts in the past:\n\n\"You should've died in that hospital bed.\"  \n\"You made your mom's heart go into AFib and made her use the last of her anxiety medication.  You're so fucking selfish.\"  \n\"Why would you do this to me?  Why would you disrespect me like this?  Do you just want me to look bad?\"",
   "created_utc": 1691453725,
   "score": 15,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8g6au",
   "message": "My daughter died at birth and I almost did too. My father told me that my stepmother was “really taking it hard and feels like she doesn’t have a purpose anymore/nothing to live for” because we had planned for her to babysit. She also asked me when I was hospitalized if she can have some of my daughters ashes for herself. Keep in mind we were never close and I never even lived there. I was still extremely sick post birth and never got to go to the funeral home for arrangements so my dad did. He told me a few years later when I got a potter to make her an urn “I hope you aren’t getting rid of the one I picked out because I spent a lot of money on it”\n\nMy sister also THINKS she had a miscarriage at some point very very early on when she was a teen and told me after I lost my daughter that she has been through worse.",
   "created_utc": 1691453900,
   "score": 37,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8hd0n",
   "message": "When my wife walked out on me after I caught her cheating and she said she didn't care that I knew and that she never loved me.\n\nTried to kill myself that night.",
   "created_utc": 1691454403,
   "score": 4,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8j1mk",
   "message": "“I wish I could’ve had a kid”.\n\nMy mother passed away years ago. I’m adopted and he said this while venting. I understand he couldn’t have kids himself, and therefore he said this. I know he didn’t mean to hurt me…\n\nBut it did…. And i feel like a miserable failure to my family’s name.",
   "created_utc": 1691455112,
   "score": 17,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8jnpz",
   "message": "\"Go ahead and hit me back, be just like your father!\" \\*love mom\\*\n\n\"i don't really think of you as my son but more like a friend\" \\*love dad\\*",
   "created_utc": 1691455376,
   "score": 8,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8gyz9",
   "message": "“I’m not your mother, I was just an incubator for you” - my biological mom \n\nWhen she told me that I changed her name in my contacts to “incubator” and I refer to her as that in conversation. FWIW she was a terrible incubator and tried to terminate me by drinking.",
   "created_utc": 1691454238,
   "score": 15,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8h13g",
   "message": "My “loving” wife of 37 years couple of months ago came up to me and said “used to consider you an alpha male, but I don’t anymore” and I was stumped now let me say I never really heard of the word alpha male until about three years ago and seeing a lot of these guys that called them selves alpha male. I am definitely not one of those idiots, i’m not one of those macho guys I’m just a guy. \nI was so upset when she said that to me, I just turned around and walked away. I didn’t know what to say in about two weeks later when I approached her about it, she swore up and down she never said it,, now this person that I thought I knew , I’m thinking has some serious psychological issues",
   "created_utc": 1691454262,
   "score": 20,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8j4z3",
   "message": "I was 18 when my sister (24) died suddenly of an aneurysm. For weeks after I was told SO many different iterations of \"It's all in God's plan/everything happens for a reason\" that that was the start of my break from my own faith and losing my religion. I cannot imagine saying something like that to someone who just lost a sibling. I have a visceral reaction to that phrase to this day, and it was 24 years ago next month.",
   "created_utc": 1691455152,
   "score": 34,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8lq58",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv9afo9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8gub1",
   "message": "When I was getting divorced, we had a 2 year old. Tarrant County required a social worker. Towards the end, everything had been going great with both of us, and they had me come up there for the final evaluation. The social worker told me that I should sign over all my rights to the mom and just focus on finishing college and my career, that it would be in the best interest for the mom and child. She said there was nothing negative about me, but that's just the way it goes.\nAs a 33yo man at the time, I cried so hard when I got back to my truck, and for awhile. That was the lowest I ever felt in my life. I thought about taking my own life at that time because it felt like I didn't matter to anyone. I didn't end up listening to her after I was able to compose myself and really think about the situation. I was an Eagle Scout, putting myself through college, had been working a stable career for the past 10 years when we got divorced. To be blind sided by someone that didn't know me at all, but had so much power with the court system, I was just shocked. It wasn't even a messy divorce, we both agreed to the divorce that it would be best for both of us, and it was still a nightmare to deal with. Absolutely hated being looked down upon by everyone at the family court system there, so glad I'll never deal with that again!!",
   "created_utc": 1691454181,
   "score": 15,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8h142",
   "message": "“You bring everyone else down around you. You are an emotional black hole.”\n\nThat hit so hard and honestly it made me think about it and felt like she was right. Sort of like constantly feeling sorry for myself and inadvertently fishing for people to feel sorry for me. I didn’t know this! But it was so succinctly said and so direct and fluid. This was in middle school too lol.",
   "created_utc": 1691454263,
   "score": 12,
   "submission_id": "15kx298"
  },
  {
   "comment_id": "jv8h7bd",
   "message": "My mother looked me in the eyes, told me she was ashamed to say that i came out of her and called me the biggest waste of breath she has ever seen and told me the entire family would be better off if i followed in my older brothers (one of them) foot steps and killed myself. I was a few months shy of turning 13. Want to know the grand sin that made my mother embarrassed to have birthed me? I had the sheer, unmitigated audacity to take an apple from the fruit basket because i hadn't eaten in 3 days and was starting to struggle to move around cause i was so light headed. Like eve before me i faltered and committed the greatest sin of eating the forbidden fruit.. literally lol. But oh well, i moved on and have a decent relationship with her now even though it's complicated because i'm her full time care taker and she hates that i'm in charge of when she takes her pain meds. Though i would like to say i've never even once been tempted to retaliate for my mistreatment as a kid by denying her her medication when she needs it or not taking care of her in other ways, i genuinely have moved on from the past and don't let it cloud my judgement now, and i've spoken with my fiance and told her if she thinks for even a second i'm letting our history interfere with my moms care to call me out on it immediately.",
   "created_utc": 1691454336,
   "score": 10,
   "submission_id": "15kx298"
  }
 ]
}