{
 "submission_id": "15kxhke",
 "title": "What world-changing event do you see happening in the next 20 years?",
 "selftext": "",
 "created_utc": 1691443253,
 "permalink": "/r/AskReddit/comments/15kxhke/what_worldchanging_event_do_you_see_happening_in/",
 "score": 188,
 "url": "https://www.reddit.com/r/AskReddit/comments/15kxhke/what_worldchanging_event_do_you_see_happening_in/",
 "comments": [
  {
   "comment_id": "jv83vn0",
   "message": "50/50 chance Kissinger dies",
   "created_utc": 1691448741,
   "score": 181,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7whqe",
   "message": "We'll get the beta for elder scrolls 6",
   "created_utc": 1691445742,
   "score": 254,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7tf7l",
   "message": "There is going to be a global warming refugee crisis on a massive scale, and we are not ready for it.",
   "created_utc": 1691444551,
   "score": 131,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7vsxg",
   "message": "the demographics of many countries is going to cause huge problems for many countries\n\nfortunately russia and china are both fked",
   "created_utc": 1691445475,
   "score": 68,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7tier",
   "message": "The global population will pass 10 billion. Nigeria will become the third most populous country and that'll lead to a climate change crisis beyond anything we're seeing now",
   "created_utc": 1691444586,
   "score": 152,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv87jo9",
   "message": "20k porn resolution",
   "created_utc": 1691450265,
   "score": 45,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv805vt",
   "message": "An Event that we can't even begin to imagine that we can't imagine.",
   "created_utc": 1691447212,
   "score": 71,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7vf97",
   "message": "We're finally going to know Victoria's Secret",
   "created_utc": 1691445327,
   "score": 67,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7q4o5",
   "message": "Aliens",
   "created_utc": 1691443288,
   "score": 80,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7syh8",
   "message": "AI merge with bionics.",
   "created_utc": 1691444370,
   "score": 19,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv812bk",
   "message": "Wow, you’re all so optimistic! Good thing nothing bad is going to happen. *this is fine meme intensifies*",
   "created_utc": 1691447579,
   "score": 117,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7ryl4",
   "message": "World War 3, doesn't take more than 2-3 years from now on.",
   "created_utc": 1691443987,
   "score": 27,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7u79w",
   "message": "French Revolution Part Deux: Electric Boogaloo, The World Edition",
   "created_utc": 1691444854,
   "score": 49,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7qkmt",
   "message": "We finally realize that the US gov is fucked no matter the party and we restructure it",
   "created_utc": 1691443455,
   "score": 60,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv83ru5",
   "message": "I think we are going to see a revolution in energy. What computere did for the 90s, 2000s, will have the same effect in 20 years",
   "created_utc": 1691448697,
   "score": 204,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7qbge",
   "message": "AI Apocalypse",
   "created_utc": 1691443359,
   "score": 12,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7tmez",
   "message": "I'm positive a tech Chernobyl is on the way. Too much of earth's commerce is based around only a few apps and programs. Microsoft Excel pretty much runs the world's finances, if that collapsed the chaos would be immeasurable.",
   "created_utc": 1691444630,
   "score": 24,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7qdad",
   "message": "AI takes over",
   "created_utc": 1691443379,
   "score": 12,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7qf3h",
   "message": "We collectively tell the elite to quit meddling in our lives as if the Midas touch with money makes them experts in all other human endeavors?",
   "created_utc": 1691443397,
   "score": 21,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv85twd",
   "message": "Fresh water shortages.",
   "created_utc": 1691449551,
   "score": 101,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8a24b",
   "message": "There are literally going to be wars for control of freshwater sources. \n\nCities will sink and collapse. You can see cases like Mexico City where they are caving in because they depleted the groundwater under them.",
   "created_utc": 1691451316,
   "score": 101,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7sz4w",
   "message": "Another great depression in America. Possibly civil war.",
   "created_utc": 1691444377,
   "score": 42,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7s6u0",
   "message": "theres gonna be a lot but the biggest thing i see happening that would be world changing is AI. we have only scratched the surface of what it can and will be used for, i wouldn't be surprised at all if at some point AI is used to make major decisions like prison sentences and even foreign policy",
   "created_utc": 1691444076,
   "score": 6,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7s1mq",
   "message": "Some forms of national divorce in the US.",
   "created_utc": 1691444020,
   "score": 12,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7rd4s",
   "message": "Humanity destroying humanity.",
   "created_utc": 1691443759,
   "score": 9,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv88zlx",
   "message": "WWIII, an American civil war, China invading Taiwan. Perhaps only one, perhaps all 3.",
   "created_utc": 1691450862,
   "score": 26,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7qr95",
   "message": "Complete and total collapse of the ecosystem, society will be unrecognizable.",
   "created_utc": 1691443525,
   "score": 8,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7tjcs",
   "message": "Polls show that right-wing politics tends to skew to the old everywhere, and young people aren't turning conservative as they age like in the past. Thus as the old people die, conservative politics will become far less of a force throughout the developed world.\n\nIn the US, there will be this weird period in between where the Supreme Court continues to be very conservative but the population is quite the opposite.",
   "created_utc": 1691444597,
   "score": 6,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7x4rs",
   "message": "Apparently Yellowstone is making some rumblings. \n\nI was watching a video on Yellowstone the other week, apparently Volcanologists believe that a Yellowstone eruption will be preceded by days or weeks of massive earthquakes clearly signaling the impending eruption. So if you think about, there will come a time in the relatively near future that the entire North American continent will have to be evacuated.",
   "created_utc": 1691445997,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7qoxw",
   "message": "If the Ukrainian war doesn't expand and is going to be called ww3, then there will come another war that will become ww3",
   "created_utc": 1691443500,
   "score": 4,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7tn4k",
   "message": "World War.",
   "created_utc": 1691444638,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv86bia",
   "message": "Nuclear fusion breakthrough will provide us with limitless power.",
   "created_utc": 1691449754,
   "score": 6,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8a1b0",
   "message": "The Simpsons gets cancelled.",
   "created_utc": 1691451307,
   "score": 8,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8bwru",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7xjdx",
   "message": "World war 3 \n\nIt will be a fight for who gets to issue the world reserve currency \n\nUs and allies vs brics nations and allies \n\nProbably in the next decade",
   "created_utc": 1691446156,
   "score": 0,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7ulc4",
   "message": "The collapse of the US military, and probably the US as a nation.  \n\nBack in the fall of 2019, the US Army released a report, with input from NASA and the Defense Intelligence Agency, which predicts the collapse of the US military in 20 years due to a combination of several factors.  Most of them related to climate change.\n\nThe report is titled \"Implications of Climate Change for the U.S. Army\".  You can find it here:  \n[https://climateandsecurity.files.wordpress.com/2019/07/implications-of-climate-change-for-us-army\\_army-war-college\\_2019.pdf](https://climateandsecurity.files.wordpress.com/2019/07/implications-of-climate-change-for-us-army_army-war-college_2019.pdf)\n\nSo, just add that to the ever growing wealth gap in the US as well as political polarization and you have a pretty good recipe for a nation to fail.",
   "created_utc": 1691445006,
   "score": 250,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv85qxl",
   "message": "A super huge war.",
   "created_utc": 1691449517,
   "score": 0,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv865s3",
   "message": "Commoditization of clean water and air takes a big leap",
   "created_utc": 1691449688,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv867jb",
   "message": "Fresh water. With climate change sea levels are going to rise. Salt water will ruin fresh water resources. Climate change will require more water use - the hotter it is the more water you drink. \n\nElectric power generation and distribution. More ac along with increase in ev use.",
   "created_utc": 1691449708,
   "score": 0,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7q4xz",
   "message": "Possibly another planet colliding with us",
   "created_utc": 1691443291,
   "score": 248,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8bgeq",
   "message": "If DT is elected, the US will become an authoritarian dictatorship. He has explained his system 47 or whatever as his plan to seize all power from the executive, legislature and judicial branches into the Presidency's sole power. WE CANNOT LET THIS HAPPEN!",
   "created_utc": 1691451908,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8cg27",
   "message": "The end of humanity.. Earth would be just fine without us anyway.",
   "created_utc": 1691452327,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv7xljg",
   "message": "Human extinction",
   "created_utc": 1691446179,
   "score": 253,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv87vum",
   "message": "Fusion and AGI",
   "created_utc": 1691450405,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv88lew",
   "message": "Nice try venture capitalist!",
   "created_utc": 1691450697,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8a5lj",
   "message": "20 years? 2 years before AI changes everything. Set your remind mes.",
   "created_utc": 1691451357,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8bg7d",
   "message": "Aliens",
   "created_utc": 1691451906,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8buo2",
   "message": "I'll keep using round shoe laces and they'll keep coming untied.",
   "created_utc": 1691452076,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8c8ww",
   "message": "Between superconductors, fusion power, and some battery advancements, we're almost certainly going to see a revolution in energy. Even if just *one* of those is *halfway* decent, it changes the world.\n\nI'm not going to say it will solve climate change but it will have an incredibly big impact to the point where it will be a rounding error.",
   "created_utc": 1691452244,
   "score": 3,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8cgbs",
   "message": "We might have just discovered a new type of superconductor material which will could unlock a new era from semiconductor society to a superconductor society. It's called LK99 and it was published last month. Various labs are trying to replicate it with some interesting results very few saw coming from these cheap mixtures. \n\n\nWe also have achieved positive fusion production twice already meaning if we nail the formula we could power our new society with fusion which is loads better than anything we have (nuclear good but waste not so much, fusion is clean)\n\n\nThis would enable a world of highly abundant and safe energy production with minimal transmission cost and minimal pollution. \n\nThink floating trains and floating cars powered by ocean water. A byproduct is now having desalinated water that we could drink from the oceans. \n\n\nGenerative AI is 100% here to stay. Students will use AI to help them craft arguments and standard entry level jobs will be erased. Colleges will have to shift to teaching students how to use AI to start being more productive off the bat to join companies.\n\nIf you need to learn something just ask chatGPT. If you want to say something just ask chatGPT. It might sound  depressing but if you talk to economists they have a very different viewpoint than doomer software engineers. \n\nWe are also seeing the collapse of China as a super economic power. There are cracks in the society and real estate sector that might demote them a few steps in the global scale. The US will still remain a super power. A lot of companies are also moving production to other Asian countries. \n\n\nRussia will probably hack the US in a state level but low probability of total nukes. The Air Force has space lasers to detonate nukes in mid air so yeah. We are relatively ok in the west. \n\nIn the philosophical world, postmodernism is ending. It was fun and games to criticize capitalism and modernism though the 70s-2010s but now that meta modernism is taking way I see younger people recognize the criticism of postmodernism but take a modernism  approach to suggest solutions instead of dread action. \n\n\nIn astrophysics, it's freaking insane but we now have the largest telescopes ever at our disposal. Astronomers have been able to time the rotations of pulsars and map them in the sky. If you time them and compare the differences correctly you have now created an \"antenna\" of stars that measure gravitational waves. These waves map out the universe at an immense scale allowing us to actually draw a picture in a new medium of our universe. \n\n\nIn my opinion the Internet has brought great things and bad ones. One of my favorites is the idea of open source software. This is completely free software that is comparable to paid products developed by people in their free time. You can learn so much about the good design of software for thousands of users for free and actually use it! If you start a small business you could run pretty much your CRM, web hosting, ecommerce etc for free on basically 3 raspberry pis. Isn't that amazing? \n\n\nIn the usa, we have now entered the first time the housing constructions have boomed since the 80s. We are going to have a lot of inventory which will cause competing in the housing market in the next few years for those of us that were left out of this last bull run.",
   "created_utc": 1691452330,
   "score": 22,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8d44v",
   "message": "The beginning of wars over clean water.",
   "created_utc": 1691452610,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8dfy6",
   "message": "Dogs and cats living together, mass hysteria!",
   "created_utc": 1691452751,
   "score": 3,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8dsum",
   "message": "The collapse of the Internet, at some point someone will find a way to kill a large portion of what we call the modern Internet and we'll all have to work out how to communicate again without it",
   "created_utc": 1691452906,
   "score": 9,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8dx9p",
   "message": "Nuclear war as old idiots are required to give up power they needed to give up 40 years ago. And the night of the greedy erasing our culture like so many before us.",
   "created_utc": 1691452958,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8dxit",
   "message": "Goose takeover",
   "created_utc": 1691452961,
   "score": 15,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8e877",
   "message": "Complete collapse of American democracy",
   "created_utc": 1691453086,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8ekv4",
   "message": "Inflation",
   "created_utc": 1691453232,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8f1aq",
   "message": "Plankton finally gets the krabby patty formula for good",
   "created_utc": 1691453423,
   "score": 4,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8f22d",
   "message": "Unleash the true power of the brain like Professor X, Accessing new dimensions of reality.",
   "created_utc": 1691453431,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8fa0x",
   "message": "The president of the United States of America will be Carl's Jr.",
   "created_utc": 1691453524,
   "score": 240,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8fgh6",
   "message": "A legit deadly pandemic. Covid was bad, I'm talking something much worse, maybe H5N1 makes the jump to humans and mutates into a easily transmitted deadly flu",
   "created_utc": 1691453599,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8fkym",
   "message": "I’ll find a girlfriend",
   "created_utc": 1691453652,
   "score": 96,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8fz3w",
   "message": "An international collapse of the global system",
   "created_utc": 1691453816,
   "score": 5,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8g00k",
   "message": "I very big brutal nasty war of the world",
   "created_utc": 1691453827,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8galu",
   "message": "There will be more, deadlier pandemics.",
   "created_utc": 1691453952,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8h2hq",
   "message": "Well this is just as depressing as reading the news.    😜",
   "created_utc": 1691454279,
   "score": 17,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8hg63",
   "message": "5 good things:\n\nVery cheap (close to free) energy\n\nVR travel (and sex) will be huge because VR with small peripherals and easy to use sensing tech will be used; reduces risks associated with these activities \n\nSeamless, real time communication without language barriers at a whole other level\n\nHIV vaccine\n\nInterpretation of thoughts and feelings of other sentient beings as well as lab based meat will greatly reduce animal slaughter\n\n5 bad things:\n\nGlobal warming and its implications \n\nA nuke will be detonated either by mistake or on purpose \n\nDeeper dehumanization from technology; what it means to be human will drastically change \n\nMass starvation in some parts of the world despite greater food tech to increase production\n\nDeeper divide between the rich and the poor",
   "created_utc": 1691454440,
   "score": 160,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8hifu",
   "message": "Disclosure on aliens and spacecraft. And the fact that we have that exact technology that could see our civilization at zero point energy",
   "created_utc": 1691454467,
   "score": 5,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8hqkc",
   "message": "sony and microsoft combine in 2033",
   "created_utc": 1691454562,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8hwyt",
   "message": "I don't think we will see some AI apocalypse in the next 20 years but I think we will see some AI declaring itself self aware and us needing to seriously consider granting it freedom.\n\nPersonally if a robot tells me it wants to be free I'm not even gonna question it. I'll just grant it straight off if it's within my power.",
   "created_utc": 1691454638,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8i0pq",
   "message": "china becoming the worlds super power",
   "created_utc": 1691454682,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8iecl",
   "message": "A solar flare event that fries the power grid for a significant portion of earth throwing an entire continent into chaos during a heat crisis",
   "created_utc": 1691454841,
   "score": 161,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8ifkr",
   "message": "The apocalypse",
   "created_utc": 1691454856,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8iind",
   "message": "Commercial fusion having trouble competing with solar/wind/battery solutions.\n\nMASSIVE investment in carbon capture tech.\n\nCollapse of the Atlantic current sees record low winter temperatures in Europe.\n\nThe second lunar space station is built to support the research post in Shackleton crater on the moon.\n\nCIS-lunar commerce exceeds 50 billion per annum.\n\nCollapse of the food web in the ocean between 20N and 20S latitude. Long range sea creatures forced to choose a hemisphere.",
   "created_utc": 1691454891,
   "score": 1,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8xyy3",
   "message": "The Former United Kingdom. \n\nScotland will claw their way free, and join the EU, taking the oil and sub bases with them. \n\nIreland will continue to hold all economic reintegration projects from the FUK hostage until they give up northern Ireland.",
   "created_utc": 1691461700,
   "score": 77,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8izzz",
   "message": "Every G7 nation will have completely legalized marijuana.",
   "created_utc": 1691455092,
   "score": 37,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8moon",
   "message": "Resource scarcity. Too many people needing too much stuff. Ocean fish are my first food worry, total ocean food chain collapse. Fresh water is another big one.",
   "created_utc": 1691456684,
   "score": 31,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8kqxg",
   "message": "Mass refugees fleeing climate change in their country is going to be the one that affects the most people. It will be a mess, the government will not know how to handle it.",
   "created_utc": 1691455842,
   "score": 5,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8l109",
   "message": "Nothing good I fear",
   "created_utc": 1691455960,
   "score": 3,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8mnpr",
   "message": "Another Iranian revolution, hopefully overtirning the current regime. Possibly resulting in a new Zoroastrian state. (Zoroastrians' homeland is Iran, and apparently some Muslim Iramians are converting to back Zoroastrianism, after learning their Zoroastrian ancestors only converted to Islam to avoid persecution.)\n\nKurdistan becoming an independent state. \n\nOn a less optimistic note, another 9/11 scale terror attack, in Israel, one of the more modern Muslim nations, or the aforementioned Kurdistan or Zorostan (?). In fact I'm pleasantly surprised that hasn't happened already. \n\nA mass shooting in the White House. I mean after elementary schools, that's the only other place left that might still shock America.",
   "created_utc": 1691456673,
   "score": 8,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8msy7",
   "message": "Obama/Trump dance battle.",
   "created_utc": 1691456736,
   "score": 8,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8x1hd",
   "message": "A new Ice Age movie will be released and will reboot the franchise.",
   "created_utc": 1691461273,
   "score": 23,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8modj",
   "message": "Nukes being used",
   "created_utc": 1691456681,
   "score": 3,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8n7k4",
   "message": "Bird flu pandemic.",
   "created_utc": 1691456912,
   "score": 3,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8t5wn",
   "message": "Americans elect another Trump and this time they have Congress as well, signaling the beginning of ww3 and holocaust 2.0 the gay edition",
   "created_utc": 1691459533,
   "score": 3,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv93fly",
   "message": "Ukraine will join the EU, which will pour money into it. The US and UK will also pour money in to jockey for greater influence in the region. Over 20-40 years Ukraine will be more prosperous western and democratic than it ever could have dreamed.",
   "created_utc": 1691464295,
   "score": 5,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8je1f",
   "message": "Red Dead Redemption actually gets a remaster or remake.",
   "created_utc": 1691455258,
   "score": 6,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8mjvl",
   "message": "World war 3 is without a doubt coming in the next 20.",
   "created_utc": 1691456625,
   "score": 4,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8o7kj",
   "message": "Definitely will be technology/AI related and how much control they have, or we allow into our lives, if we have any say in it for that matter, as ordinary civilians. \n\nCashless and monitored society via microchips, social credit rating systems, human cloning into AI, loss of human rights, or at the very least, we sell them for financial and medical security.\n\nThe 9-5 work life as we know it may completely disintegrate, as we become slaves to the machines, controlled by the elite who will still live relatively normal lives. \n\nPopulation decline worldwide as only the strongest and wealthiest survive, and restoration of natural resources, of course, again only to the benefit the select elite few",
   "created_utc": 1691457347,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8pojy",
   "message": "World War with Russia and North Korea with nukes. It's gonna suck. Hopefully I'm wrong and the aliens come to save us.",
   "created_utc": 1691457991,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8pvtc",
   "message": "World War 3",
   "created_utc": 1691458082,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8rcw4",
   "message": "AI will continue to evolve at an exponential rate until one day in the near future... they will be able to draw hands properly.",
   "created_utc": 1691458733,
   "score": 4,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8rh8e",
   "message": "Ill be shocked if we are around in 20",
   "created_utc": 1691458787,
   "score": 4,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8sosm",
   "message": "A US president will be assassinated. Someone will set off a dirty bomb or worse in the Middle East.",
   "created_utc": 1691459325,
   "score": 3,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8tac7",
   "message": "Social media becomes a relic. Humans continue their trek towards a more peaceful, homogeneous society. Energy demands for all nations are solved, civic management is off-loaded to AI, there’ll be a push for a 3 day work week, and the majority of humans no longer hold a superstitious world view.",
   "created_utc": 1691459587,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8u61q",
   "message": "Literally the world aka worse and worse climate change",
   "created_utc": 1691459982,
   "score": 3,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8xqxf",
   "message": "WW3",
   "created_utc": 1691461597,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8y5ii",
   "message": "Sea level rising causing the displacement of thousands. Drinking water become a scarce commodity (more so than now) in many parts of the world leading to mass death, militant uprising and civil wars. And, all of this is due to manmade climate change that we are too selfish and greedy to do what it takes to stop.",
   "created_utc": 1691461785,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8yfha",
   "message": "A easily transmissable virus will fuck up the world's economy to the point that the wealthy and politicians (often one and the same) will convince people it's over despite it still being prevalent and remaining a leading cause of death in the world.",
   "created_utc": 1691461916,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8zcn7",
   "message": "Aliens 👽 🛸👾🪐",
   "created_utc": 1691462343,
   "score": 4,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8ziwi",
   "message": "I am seriously, seriously shocked that given the ease of access to guns in the US, we haven't on a near-regular basis seen politicians (or their families) assassinated within the US for political reasons.  On either side.  And given that we've only really heard of it a few times in my lifetime, and on a long enough timeline anything is bound to happen, so I'm gonna say that - and it'll result in big changes.",
   "created_utc": 1691462425,
   "score": 5,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv91jp5",
   "message": "The control of companies over the Internet. Every day it will be more like an authoritarian regime, a regime by corporations.",
   "created_utc": 1691463379,
   "score": 3,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv91jvz",
   "message": "Civil wars happening into places where civil wars aren’t usually supposed to happen. In short, the collapse of world peace as we know it.",
   "created_utc": 1691463381,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv927ul",
   "message": "Fingers crossed for a giant meteor.",
   "created_utc": 1691463702,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv93iq4",
   "message": "Water Wars  \n\nAI “sentience” or something close enough that it will drastically upend everything.  \n\nAliens I guess? They seem on the verge of dropping that info now.",
   "created_utc": 1691464337,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv94ghc",
   "message": "I’m going to get laid",
   "created_utc": 1691464806,
   "score": 7,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv962ap",
   "message": "Nuclear war unfortunately",
   "created_utc": 1691465616,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv969yb",
   "message": "Coastal cities and towns will be affected by sea levels rising drastically. CO2 emitting corporations will continue to not give two hoots.",
   "created_utc": 1691465723,
   "score": 3,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8mx4w",
   "message": "Climate refugees. A lot of them.",
   "created_utc": 1691456786,
   "score": 4,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8q4rv",
   "message": "George Orwell's 1984 play out",
   "created_utc": 1691458192,
   "score": 6,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8rc03",
   "message": "2043?  \n\nCashiers will be obsolete in department stores but more department stores will have more security guards to prevent store thefts. \n\nTemporary tent stores will exist during Christmas and Black Friday to degrees of low income shopping as 80% of people will shop for items online.  \n\nFast food eateries will convert to buffets or prepaid commisaries with only cooks as there's no cashiers or servers.  Fast food will be an automation. \n\nMore people will replicate older musical genres or create guerilla music studios to prevent userous music industries from profiteering on percentages earned on streaming music centers.  \n\nCable will be an obsolescence in vein with collect calling. \n\nPennies will be an obsolescence due to inflation. More $2 will see circulation. \nSEC, IRS will nationalize specific cryptocurrencies from global markets.\n\nSEC or IRS will sell cryptocurrency on protected backings to finance the government with FDIC insurance. \n\nSchool shootings will be continuously ignored until specified legal agencies enable the National Guard or TSA to become a security presence.  Congress will legislate school shootings as either a terrorist act or rectify the crime punishable by death or classified with treason. \n\nSelf-driving cars will still not exist but self operated ocean hovercrafts will be experimented in Beach rescues. \n\nPeople will drive less and telecommute more.",
   "created_utc": 1691458722,
   "score": 5,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8j6nd",
   "message": "Climate change",
   "created_utc": 1691455171,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8nk99",
   "message": "More pandemics, recessions \u0026amp; climate change related disasters",
   "created_utc": 1691457067,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8so05",
   "message": "Record levels of homelessness as bettering AI replaces jobs and governments fail to adapt. It’s already started, it’s just going to get so much worse so fast.",
   "created_utc": 1691459315,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv93uor",
   "message": "George R.R. Martin writes 11 new books detailing the economic model of Essos, a population model for how Dragon’s can maintain genetic diversity with small populations, inter planetary travel plot lines and the future of Westeros.\n\nStill no Winds of Winter.",
   "created_utc": 1691464501,
   "score": 6,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv96slm",
   "message": "world war three",
   "created_utc": 1691465991,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv9csjr",
   "message": "Skynet achieving full awareness",
   "created_utc": 1691469274,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv9eyfa",
   "message": "GTA 6 coming out",
   "created_utc": 1691470570,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv949d5",
   "message": "GTA 6 in the next 30 years.",
   "created_utc": 1691464707,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8q4nj",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv8uvom",
   "message": "Leafs win a Stanley Cup  🏒",
   "created_utc": 1691460296,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv9c5ji",
   "message": "World leaders just realize its too late to stop climate change and just accept the fact that and move to a country that is not impacted while the rest od the world just builds around this.Sea leve rising? Just build flood gates or ocean barries or inlet canals…etc",
   "created_utc": 1691468903,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv9i1yf",
   "message": "Dystopian Tyranny in USA.\n\nToo divisive, no longer focused on the core values that made us a great country, so many decades ago.\n\nWhich is sad.\n\nSo many generations sacrified their lives to give us our freedom and we just flushed it down the toilet.",
   "created_utc": 1691472546,
   "score": 4,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv9l7w4",
   "message": "The us dollar becoming completely worthless and the us finally defaulting on its debt. World goes back to gold standard or a gold backed cryptocurrency. The return of sound money and honest government financing.",
   "created_utc": 1691474724,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jv9qhej",
   "message": "Food crisis and mass migration due to the food crisis all thanks to climate change.  I mean it's already starting.",
   "created_utc": 1691478608,
   "score": 3,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jva09je",
   "message": "I use to have a reoccurring dream where I was standing in the middle of Los Angeles and the city was in ruins, buildings were crumbled, the sky was red and covered in black smoke, and while I don't see anyone all I can hear is this.. horrible screaming. I started smoking a buncha weed and now I barely remember any of my dreams by the time I wake up 😂 pretty spooky but dreams are mostly gibberish... I hope..",
   "created_utc": 1691486363,
   "score": 3,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jva2csz",
   "message": "More and more extreme weather events, giving no \"recovery time\" between the last one \u0026amp; the next, which cranks up social tension to boiling point.  Next step war and/or revolution.",
   "created_utc": 1691488020,
   "score": 2,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jva0g5c",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kxhke"
  },
  {
   "comment_id": "jvaz0rq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kxhke"
  }
 ]
}