{
 "submission_id": "15kz4ht",
 "title": "No seriously, why aren’t us young people in the streets protesting the wages in America? Why not you?",
 "selftext": "",
 "created_utc": 1691446949,
 "permalink": "/r/AskReddit/comments/15kz4ht/no_seriously_why_arent_us_young_people_in_the/",
 "score": 82,
 "url": "https://www.reddit.com/r/AskReddit/comments/15kz4ht/no_seriously_why_arent_us_young_people_in_the/",
 "comments": [
  {
   "comment_id": "jv885ts",
   "message": "You first. I have bills to pay. \n\nThat’s basically the argument.",
   "created_utc": 1691450518,
   "score": 14,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv83mr2",
   "message": "From a millennial. Because I'm tired. I protested during the occupy protests and was arrested a few times doing that. I saw the movement fall apart and crumble because nobody could agree. I lost hope for any meaningful change. That experience changed me for the worse. It took a long time to recover. \n\nAnd now, I'm not as young. I have kids to take care of. They take all my emotional and physical energy that is not used at work. I couldn't go through more protests now and be a good parent.",
   "created_utc": 1691448639,
   "score": 167,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv7zvon",
   "message": "Because we can't properly organize ourselves in any effective manner.",
   "created_utc": 1691447097,
   "score": 29,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8bym9",
   "message": "The leadership for it simply isn't there. \n\nLook at the protest MLK Jr led to DC. That thing wasn't spontaneous. It took *months* of planning.\n\nThe leaders chartered busses and arranged other forms of transportation for people. They booked motels, hotels, and setup deals with residents to house \u0026amp; feed people. They made sure plenty of lawyers were on hand to handle the inevitable arrests. They arranged security. They made sure they had any and all legal basis covered. \n\nThey had people canvassing neighborhoods, speaking in town squares, at fairs, pool halls, dances, and anywhere else they could that people tended to gather in to spread the word of the protest. \n\nThere's no group coming forward to do all that; at least, not one that people are confident enough in to donate their time \u0026amp; money to. \n\nOn top of that, there's no *leader*. One is needed that is down to earth, well spoken, confident, and well respected by most everyone in their community. Someone who isn't afraid of confrontation, who can keep their head under pressure, and *who is willing to die for the cause*.",
   "created_utc": 1691452123,
   "score": 190,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv82m4u",
   "message": "\n\nI'd love to protest but I can't afford it. I'm working 3 jobs just to pay my rent and student loans. And if I miss a day of work, I'll get fired.",
   "created_utc": 1691448217,
   "score": 23,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv831fe",
   "message": "We're too exhausted after working all day. If we had the stamina to truly protest, our cities' cops would (at the very least) attack us. If we survive and need to go to the hospital for injuries, the bill will bankrupt us. No other American would take us seriously if we went bankrupt and became homeless. Why bother protesting at that point?\n\nSo... yeah.",
   "created_utc": 1691448393,
   "score": 111,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8gh1m",
   "message": "I'm on my phone scrolling reddit",
   "created_utc": 1691454027,
   "score": 101,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv7zm55",
   "message": "because it wouldnt accomplish shit and also i have to go to work",
   "created_utc": 1691446988,
   "score": 100,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8j8gn",
   "message": "It's too damn hot outside.",
   "created_utc": 1691455192,
   "score": 11,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8ll1j",
   "message": "Because I understood the system, worked very hard at the bottom for meager pay, had a solid plan that I followed through on, and I never believed the world owed me a free gameboy. From 14 years old I understood and believed that one serious misstep in the early years would destroy the chance I had early on to achieve my goals and I worked tirelessly at it.\n\nNow, the system works great for me and I've basically guaranteed my family's and my stability for a generation forward, which is more stability than anyone else in my family ever knew, so I feel pretty ok acting as an agent of the system.",
   "created_utc": 1691456202,
   "score": 16,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv85jri",
   "message": "because i get paid a decent wage and cannot miss work to protest. i feel for those who cannot relate; i’ve been there.",
   "created_utc": 1691449436,
   "score": 56,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8c9yp",
   "message": "I think it’s sort of happening already by more people refusing to take toxic, low-paying jobs, but employers are slow to catch on and keep insisting “no one wants to work.”",
   "created_utc": 1691452257,
   "score": 18,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv89mwv",
   "message": "Because I’m doing just fine, thanks.",
   "created_utc": 1691451136,
   "score": 66,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8e359",
   "message": "Presumably because the wages in the US are very high by international standards. \n\nhttps://en.wikipedia.org/wiki/List\\_of\\_countries\\_by\\_average\\_wage",
   "created_utc": 1691453026,
   "score": 105,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8ckgv",
   "message": "Who do you want to give you a raise and why do you think protesting in the street will get it for you?",
   "created_utc": 1691452378,
   "score": 92,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8jjlb",
   "message": "It's because it makes a lot more sense to realize that if your wage is low, your productivity is low... and that you'd be better off spending your time investing in yourself, like getting more educated, or learning new skills.\n\nRealize there are *tons* of people who make higher wages then you do... their employer pays them that higher wage because it thinks it's actually a good deal. The employer thinks the work they're doing is worth even more to the business.",
   "created_utc": 1691455325,
   "score": 26,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv863z6",
   "message": "In Canada our wages are lower, taxes are higher and we have less buying power with the money that we do wind up with",
   "created_utc": 1691449668,
   "score": 7,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8ah0u",
   "message": "If this is in the states, I don’t live there even",
   "created_utc": 1691451490,
   "score": 4,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8lb1b",
   "message": "Because that’s not how it works and I’m happy with what I make",
   "created_utc": 1691456080,
   "score": 31,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv836tg",
   "message": "Somehow i don't think anyone would give a shit about a scotsman who does not live in America protesting on the streets of Glasgow about American low wages. Thats why not.",
   "created_utc": 1691448455,
   "score": 26,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8hfd0",
   "message": "Because we like wages. Wages pay for things we need to live.",
   "created_utc": 1691454431,
   "score": 12,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv837ke",
   "message": "I'm not a young person anymore.",
   "created_utc": 1691448464,
   "score": 7,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8pryv",
   "message": "jobs that pay shit are in low margin businesses that cannot pay you more. A 15% raise to all staff at the average McDonald's restraunt bankrupts the place.",
   "created_utc": 1691458033,
   "score": 9,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8vf0i",
   "message": "Not American but personally I wonder why you all want to jump to protesting when most of you don’t bother to vote..?\n\nWhy would elected officials listen to anyone who doesn’t vote?",
   "created_utc": 1691460539,
   "score": 150,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv803o2",
   "message": "I have a decent job and wage. And potential to double that in the next 5 years with minimum to no effort.",
   "created_utc": 1691447187,
   "score": 15,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv82kd1",
   "message": "[removed]",
   "created_utc": 1691448197,
   "score": 17,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv88ryk",
   "message": "I would be throwing away a good career to protest, why would I?",
   "created_utc": 1691450774,
   "score": 24,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8jdvi",
   "message": "Because I have actual marketable skills and found a great paying desk job that doesn't require a degree",
   "created_utc": 1691455256,
   "score": 18,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8jyz5",
   "message": "I have better things to do with my life, and with the amount of money I am being paid.",
   "created_utc": 1691455511,
   "score": 14,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8mxl7",
   "message": "These people thought a half-assed two day blackout protest against Reddit, where they continued to use Reddit and buy awards, would be effective. They are not going to be able to effectively protest anything that matters to real people.",
   "created_utc": 1691456791,
   "score": 56,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8oplf",
   "message": "Because I currently make 108,000 and live very comfortable?",
   "created_utc": 1691457564,
   "score": 9,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8psv3",
   "message": "1. I have bills and need my job for those \n2. I’m tired and busy\n3. I think it’s an issue but not as big of an issue as other people do\n4. Most of the world is living in worse conditions, with significantly less and we all benefit from it. \n5. Realized people won’t change their lifestyles to help ppl in reason 4 because we are selfish and hypocrites.",
   "created_utc": 1691458044,
   "score": 4,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8teqc",
   "message": "I spent a lot of time and effort getting multiple degrees so I don't have poor wages.  I have fantastic wages, so I do not have a dog in the fight.",
   "created_utc": 1691459642,
   "score": 10,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8uotg",
   "message": "You still have bills to pay. While your out in the streets protesting your bills still have deadline and won’t wait for you. Plus there will always be someone willing to do your job for the same pay or less and employers know this. While your holding your finely made sign shouting for more pay the person to your left is saying that they will do the job for the same wage or less. Then next thing you know your out of a job and still have those bills to pay. \n\nAlso nobody cares. If the occupy movement a decade ago taught anything it’s that people don’t care. Getting everyone to agree and also getting those people to not take your job for less pay is impossible. It needs to change sure but it won’t in the next few decades.",
   "created_utc": 1691460210,
   "score": 3,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8v4f9",
   "message": "u/USDefaultism",
   "created_utc": 1691460405,
   "score": 2,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8vrvm",
   "message": "Because you're still housed and eating regularly. There's no war or existential threat. You'll boil away without taking action.",
   "created_utc": 1691460699,
   "score": 14,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8i5sr",
   "message": "If a job doesn’t pay well enough I don’t work it. They, as the business owner, have the right to pay me whatever they want. I, as the employee, have the right to not work for less than I’m worth. What exactly am I protesting?",
   "created_utc": 1691454741,
   "score": 21,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv81f5j",
   "message": "Because I am not American",
   "created_utc": 1691447725,
   "score": 3,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv833e6",
   "message": "Because I understand how a merritt based economy works.",
   "created_utc": 1691448416,
   "score": 26,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8981s",
   "message": "Instead of protesting wages, consider starting your own business. Take control of your own future.",
   "created_utc": 1691450960,
   "score": 13,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv7zpsj",
   "message": "Slacktivism.",
   "created_utc": 1691447030,
   "score": 8,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8me2b",
   "message": "Because I'm already getting paid pretty well ($200k+) and enjoying my job.",
   "created_utc": 1691456553,
   "score": 5,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8mqj6",
   "message": "Because everyone I know that isn’t a total fuck up has a good job and makes good money",
   "created_utc": 1691456706,
   "score": 9,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv7zqtm",
   "message": "[deleted]",
   "created_utc": 1691447042,
   "score": 3,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv822xj",
   "message": "Because I am in the 98th percentile for earners at my age of 29. Just bought my first house. Debt free except for mortgage. Contributing to my 401(k). Medical insurance through work. Work 30 hours a week, remote job only have to show up to the office once a week. Life is pretty good why would I throw it all away by acting up in the streets?",
   "created_utc": 1691447996,
   "score": 9,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8arbm",
   "message": "Because they would rather sit at home and twitter about it and reddit about it and want people to feel sorry for them instead of getting off their ass and finding a job.",
   "created_utc": 1691451611,
   "score": 10,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv7zvw4",
   "message": "What’s that going to do?",
   "created_utc": 1691447100,
   "score": 9,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv820gq",
   "message": "I have a good job that pays very well, I don't have any reason to.",
   "created_utc": 1691447968,
   "score": 9,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv85udj",
   "message": "It changes nothing. I participated in the BLM and Refugee protests in 2020 and 2016 respectively and nothing changed.",
   "created_utc": 1691449557,
   "score": 4,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8c1xc",
   "message": "Because young folks are too comfortable right now with what they have, and they are distracted, like most of Americans.",
   "created_utc": 1691452163,
   "score": 5,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8kvi4",
   "message": "We will see it when they wipe all of our accounts clean and introduce the CBDC with social credit system and 15 minute cities.",
   "created_utc": 1691455896,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8s0yx",
   "message": "Peaceful protests do very little to change policy. Violence is much more convincing.\n\nThe thing is, most people aren't willing to die for higher wages.",
   "created_utc": 1691459031,
   "score": 255,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8gm82",
   "message": "Protests don’t do shit except waste time. The only thing they care about is keeping the peace so business can continue unimpeded.\n\nEither general strike or a “burn it all down” scale riot - those are the two things they fear enough to respect. And no one can afford to skip work or go to jail.",
   "created_utc": 1691454086,
   "score": 5,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8ij22",
   "message": "because they're making sure nobody fights because \"work\" is the morning. can't plan and congregate after your 9-5 exhaustion. or your preparation for the next cycle. People are gonna have to be drove delerious. No you're not there yet; To a breaking point. A point past monetary value. But realistically it wont work. Conformity is the first issue",
   "created_utc": 1691454896,
   "score": 255,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8n25f",
   "message": "If you live in California, minimum wage is 15.50 an hour (and even higher in some cities). Not sure that warrants protesting?\n\nSo I suppose one issue is that it isn't really a nationwide issue it's a state by state issue?",
   "created_utc": 1691456846,
   "score": 10,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8010e",
   "message": "And most of you wont protest you will loot and burn your own community.",
   "created_utc": 1691447158,
   "score": 9,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv82xuq",
   "message": "[deleted]",
   "created_utc": 1691448353,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8ouvb",
   "message": "Why would I? I'm on pace to make six figures in a mcol area before 30.\n\nI've taken the path to the upper middle class lifestyle and am reasonably happy with my decisions.\n\n\"fuck you, I got mine\" in full swing, and I don't feel the least bit bad about it.",
   "created_utc": 1691457627,
   "score": 10,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8gnu2",
   "message": "Because businesses watch out for any talk of unionising so they can squash it with an iron boot.",
   "created_utc": 1691454105,
   "score": 253,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8isnl",
   "message": "I feel like I've been waiting for the revolution since I was 18. At this point peaceful protest is a waste of time, the world is burning.",
   "created_utc": 1691455008,
   "score": 2,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8k6w2",
   "message": "We have a militarized police force.",
   "created_utc": 1691455606,
   "score": 254,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8ruae",
   "message": "I mean, I'm doing ok. I have no reason to protest.",
   "created_utc": 1691458948,
   "score": 2,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8s1sv",
   "message": "Because I'd rather spend time to work on a skill that provides value than have big gubbament deal with my problems. America is a meritocracy in most fields. I have more resources FOR FREE than people have had in all of history. If you work at a shitty job while having no skills, nobody is to blame but the individual. Take responsibility. I understand there are exceptions but my point still stands.",
   "created_utc": 1691459041,
   "score": 7,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv837n4",
   "message": "It doesn't take much to find a multitude of instances where Police are the ones escalating the situation rather than the protestors. I'm not saying there aren't violent protestors, that always happens with things of this scale, but it seems like a lot of police are not allowing peaceful protest.",
   "created_utc": 1691448465,
   "score": 251,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8d4s2",
   "message": "Because our government has turned us into the human cattle that they've always desired. RIP, here comes the dystopian future we've been reading about for many years.",
   "created_utc": 1691452618,
   "score": 253,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv80wb0",
   "message": "We all feel so defeated already. Protesting doesn't do shit anymore. They will just shoot us with rubber bullets, gas us, mace us. We're all tired and just ready to give up. No will to live in this hell hole they call a country. None of us have funds to leave this dump.",
   "created_utc": 1691447509,
   "score": 247,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8bi6x",
   "message": "Wondering where we'd be without the civil rights movement",
   "created_utc": 1691451929,
   "score": 254,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8c5t7",
   "message": "We have two right-wing parties in this country that now actively oppose the social contract that made the U.S. in any way livable or good. They are bought and paid for and represent business, not us. What is protesting going to do?",
   "created_utc": 1691452208,
   "score": 249,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8eoc3",
   "message": "Because we’re too fucking broke to take time off work to protest and too tired after.",
   "created_utc": 1691453272,
   "score": 255,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8gjmm",
   "message": "The world is fucked and I don't care.",
   "created_utc": 1691454055,
   "score": 255,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8glrq",
   "message": "For some reason, magas are efficient at protesting and rallying; I think it may have something to do with old white Christians feeling threatened by societal changes and marginalized people standing up for themselves, and fear is a strong motivator. But I know your question is aimed toward young people, and the only thing I can come up with is the concept of “free will” combined with Adam Smith’s philosophy that people are self serving beings that work hard to enrich themselves that led to the concept of the free market and capitalism; i (66f) suspect that young people in America believe that they blame themselves for not being “rich and successful “, rather than seeing rising home prices, and stagnant wages as a societal/corporate greed/governmental result. That combined with the looming issue of climate apocalypse and the stark political divide here would demotivate anyone. Maga fear and fury is easy to harness; young people’s unease and ennui is much harder.",
   "created_utc": 1691454081,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8kjyp",
   "message": "What good will it do? Corporations have all the power, and they're enabled by the politicians that they ~~bribed~~ donated money to.",
   "created_utc": 1691455760,
   "score": 255,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8lxti",
   "message": "Name one current  or in the last ten years protest that actually did anything.  OWS failed, protests against Judge Cavanugh did jack didly, BLM is largely an afterthought, any number of Trump protest did / do nothing.",
   "created_utc": 1691456355,
   "score": 255,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8pe06",
   "message": "The minimum wage in my town is about to get raised to 17.50",
   "created_utc": 1691457861,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8q98i",
   "message": "we aren't france?",
   "created_utc": 1691458246,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8qx2d",
   "message": "Make yourself valuable.  Why not you?",
   "created_utc": 1691458541,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8sp4w",
   "message": "Federal minimum wage unchanged since 2009 at 7.25/ hour is galling given that it was $5.55/hour since I graduated in 1999.\n\nThe government doesn't regulate the economy when it's in the wallet of plutocrats and money-changers who  CONTROL the money. Federal Reserve is a corporation.  IMF is a corporation and a loan shark. \n\nIf wages bumped up to the necessary $36 per hour people legit need to live on, corporations and employers would have to dividend their costs to run a business to pay those wages. Thus, the $1 item becomes $6. \n\nProtests fell flat after the War on Terror of its 20 years and protests lack the impact they had since the Vietnam War and the hippie era which burnt out after Woodstock 1999. \n\nMost protests escalate into riots.\n\nIf you want to combat greed in corporate America; Rob a billionaire.",
   "created_utc": 1691459328,
   "score": 255,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv81nek",
   "message": "As long as the battle is Democrats vs Republicans, as Donny Trump has made it to be, you'll never succeed in protesting for more wages.\n\nThe powers at be want you to fight with each other, not them.",
   "created_utc": 1691447819,
   "score": 248,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv807zt",
   "message": "I’m just commenting to look at answers later",
   "created_utc": 1691447236,
   "score": 253,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv82qfb",
   "message": "[deleted]",
   "created_utc": 1691448267,
   "score": 254,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv83cle",
   "message": "We have several times",
   "created_utc": 1691448521,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv83yrq",
   "message": "It’s too much effort, rather than riot and possibly get in trouble people will hit em where it hurts in productivity and money. Quit quitting cuts their production and forces them to pay u for less work",
   "created_utc": 1691448776,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv89i09",
   "message": "Because we are depressed, dumb, and desperate.",
   "created_utc": 1691451077,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8a93u",
   "message": "Because I am not American?",
   "created_utc": 1691451398,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8e4ox",
   "message": "I live on the other side of the ocean. We have enough problems with our own gang of idiots who are currently steering the ship right into a massive ice berg.",
   "created_utc": 1691453045,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8lr5r",
   "message": "I tried that at my last job and was bullied and threatened. And then fired for a different reason. But im not risking my paycheck anymore. I juatdont have the power as one small insignificant person on a huge planet to make that change even though im all for it. I just do what i can in my community and my family. Thats all i can do. I genuinely hate lobbyists and politicians who lie about or who dont vouch for we the people. I think its primordially disgusting. I think that ceos and people in high positions should do better to advocate for and distribute resources needed, rather than blank checks to benefit their own images on social media.",
   "created_utc": 1691456276,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8m3qz",
   "message": "Because I'm old, tired and nearing retirement.   \nBut I will support and join in if someone can organize some shit.    \nI paid $4500 a year for tuition at a major public university and could cover that with a summer job that paid normal wages but had a butt load of overtime (fought forest fires in the summer).    \nThirty years ago I bought my first house (two story, 2500 sqft) for only 4x my salary.    \nThings are very fucked up and my kid doesn't stand a chance without my money backing him.  We've regressed very far.  \n\nAnd when you're on break from protesting, don't forget to VOTE!",
   "created_utc": 1691456427,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8nmq0",
   "message": "Because im English",
   "created_utc": 1691457096,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8o8z5",
   "message": "Can't change the world until we change ourselves. I think Biggie said that. You want better wages, learned a specialized skill. Be so good that companies have to pay you what you ask. Or start a business and learn to profit. Profits are better than wages. Spending your time fighting an up hill battle is a loose loose situation. Use your time to create and build.",
   "created_utc": 1691457364,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8ol20",
   "message": "To much disagreement amongst us \"peons\" to form real resistance, especially when it comes to race. The low-income and lesser educated folk need to band together regardless of differences of race and creed to have any impact.",
   "created_utc": 1691457511,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8om60",
   "message": "There’s no point anymore, the people in charge are too powerful",
   "created_utc": 1691457524,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8p2za",
   "message": "because they think tip = to insure promptness when it really should be ensure, so tep",
   "created_utc": 1691457726,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8phx2",
   "message": "Protests accomplish nothing. Everyone protested, rioted, and burned down major cities in response to George Floyd. And absolutely nothing changed.",
   "created_utc": 1691457910,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8qk2u",
   "message": "our police forces have a lot of dangerous tools and will use them tbh",
   "created_utc": 1691458380,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8rhnt",
   "message": "I'm not American.",
   "created_utc": 1691458792,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8rnj8",
   "message": "There's plenty of good jobs in the US that you can acquire with an AA degree.  Most of the ones with the drive to make it will do just fine.  Most of the ones with unfortunate backgrounds who don't have this ability are already up to their necks with stressors and don't have the time and organizational capabilities to do anything about it.",
   "created_utc": 1691458865,
   "score": 3,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8rqdg",
   "message": "Wait until you miss a couple of meals due to poverty.  It'll happen.",
   "created_utc": 1691458900,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8skj7",
   "message": "People are trying. There have been strikes happening throughout the last year in several industries. But with no unions, it's very difficult to organize these types of things. As an individual, what am I supposed to do? Not work and lose my car, a place to live, and starve? Without a larger organizer, most people are too scared. And reasonably so.",
   "created_utc": 1691459272,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8skj8",
   "message": "I'm well compensated.",
   "created_utc": 1691459272,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8ssr8",
   "message": "Because good protests have a legitimate solution.\n\nDo you have one?\n\nIf not, we're just feebly destroying our own cities because that's who is going to hijack any aimless protest.",
   "created_utc": 1691459373,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8szqm",
   "message": "Millennial here. Health problems, aging parents, taking care of my own family etc. I don't have the energy, time or money to make a difference. The people at the top are not afraid of us. Until they think they're going to die unless they make changes, it won't happen. They control everything. The police are more than willing to turn you into swiss cheese if they're instructed to do so. The average citizen cannot beat their local police department let alone the military. The best I can do is take care of me and mine plus not have kids.",
   "created_utc": 1691459457,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8t3mf",
   "message": "Because the police would probably kill them...",
   "created_utc": 1691459504,
   "score": 255,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8tq2g",
   "message": "Can't take time off from work, lol.",
   "created_utc": 1691459783,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8tw5d",
   "message": "Young people aren’t protesting because they are lazy.   And they know nobody listens to young people.",
   "created_utc": 1691459860,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8xcrv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv90gkt",
   "message": "I'm an employer.  How do you think street protests will lead me to pay higher wages?  Think about it.  Shouldn't you be able to answer that before you go to all that effort?\n\nI already pay at least 2Xmin wage bc that's what I have to do to keep good people.",
   "created_utc": 1691462865,
   "score": 26,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8v3yt",
   "message": "Protesting hasn’t worked in forever in america (if ever). It’s just a slight of hand. They make you think you win, but change 30 other things that end up making you lose. \n\nHere is your pay increase! Taxes go up. Inflation happens. Jobs cut hours. Jobs cut positions. Etc. \n\nIt’s the left and the right that do this. The right just has an upfront in your face attitude about it, while the left pats on the back with a knife trying to console you and blame the right.",
   "created_utc": 1691460399,
   "score": 7,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8woct",
   "message": "Protest to **Who**? \n\nBesides the minimum wage, the Feds have no control over wages.",
   "created_utc": 1691461107,
   "score": 14,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv98aql",
   "message": "A strike onky works if you were previously bringing in money. A bunch of people who already don't work taking to the streets to demand higher wages is just hippies hanging out.",
   "created_utc": 1691466781,
   "score": 8,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv92kux",
   "message": "As a 50 year old, I have been wondering this for the past 20 years. How much further does the electorate need to get fucked before we riot like Frenchmen? \n\ncomplacency kills.",
   "created_utc": 1691463876,
   "score": 4,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv90n2y",
   "message": "Because I'm on reddit, dumbass",
   "created_utc": 1691462951,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv919h5",
   "message": "I like that you are trying to think of ways to affect change. I often wonder why we are not running rampant in the streets for many things lately. Women’s rights, our education system etc. Climate change is scaring me, then I read about the heritage foundation. Felt like marching then.",
   "created_utc": 1691463241,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv93in1",
   "message": "Who do you protest against? The problem is upstream of what most people realize. Its caused by fiat currency and good luck getting the federal reserve to give up that scam",
   "created_utc": 1691464336,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv99q05",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv9027t",
   "message": "They're too busy complaining on their phones with Netflix on in the background",
   "created_utc": 1691462678,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv98683",
   "message": "Wages!? Most kids these days don’t know the words meaning! There too busy f***ing off to do anything truly productive.  Plus they have too much invested in their game of GTA to be bothered leaving their room.",
   "created_utc": 1691466714,
   "score": 2,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8wlgn",
   "message": "Because they’re stupid and lazy which coincidentally is also why they don’t fucking vote.",
   "created_utc": 1691461070,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv9k78e",
   "message": "Forcing higher minimum wages only drives inflation. Inflation makes everything more expensive. So you create a vicious cycle. The problem lies much deeper within the system. You can, however vote for change with your wallet by buying Bitcoin and shunning the system in every way possible.",
   "created_utc": 1691474006,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv91u1y",
   "message": "Honestly?\n\nI have a job I like that pays decent. I don’t have a reason to protest.",
   "created_utc": 1691463517,
   "score": 3,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv9puxo",
   "message": "People have jobs to do",
   "created_utc": 1691478139,
   "score": 2,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv9sjfi",
   "message": "Ayh man, don't wanna be that guy... But Increaseing wadges only increases the price of consumer products, which takes even more of your money (this is very simplified) and increases inflation",
   "created_utc": 1691480203,
   "score": 2,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv9y61d",
   "message": "Because America has some of the highest wages per capita on the planet.",
   "created_utc": 1691484713,
   "score": 2,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv9pwss",
   "message": "Cause I’m busy at work and am happy with my wages.",
   "created_utc": 1691478177,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv9rlku",
   "message": "The marijuana made us pacifists",
   "created_utc": 1691479466,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv9o5px",
   "message": "Been to Occupy protests, BLM protests, anti-Trump protests, and abortion ban protests. Been pepper sprayed and tear gassed by cops. Didn’t accomplish shit because too many people still don’t vote and most of the ones who do vote, vote for corrupt politicians that maintain the status quo or they vote for fascists. Things are gonna have to get a lot worse before people in this country wake up and we can get some real change. I thought Trump would be enough but apparently not. It’s bread and circuses all over again.",
   "created_utc": 1691476865,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv9s7pj",
   "message": "Because we had that protest already. It was successful and went world wide. \n\nIt was called Occupy Wall Street. The President worked with Homeland Security to have the protest sites (called encampments) bulldozed and protestors arrested and dared us to return under threat of being prosecuted as domestic terrorists.\n\nThe President who worked to shut down the #Occupy Encampments was President Obama.\n\nNow if we couldn't convince Obama to be on the side of workers, how would we ever do that under a pro-slavery nazi like Trump?\n\nPunishing #Occupy is one of the few, but one of the biggest mistakes Obama made during his Presidency. The only excuse he had is that he was fairly new in office. He wanted to appear strong but the result is that no one was ever punished for crashing the economy in 2008 except the people who were already hurt the most.\n\nWe spent the entire Trump Presidency just trying to fight for and losing basic rights. Like abortion, reading books, and trying to prevent Jim Crow from becoming the law of the land again. \n\nIncome Inequality is a long way down the list.\n\n#Occupy Wall Street was the right answer.",
   "created_utc": 1691479946,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv9swwi",
   "message": "Because it's not effective. No employer will react to protests by paying more. Why would protests result in anyone getting paid more?\n\nHigher wages will come when two things happen. (1) more people unionize or join unions and collectively bargain for more wages and (2) more people vote for progressive democrats who will pass more union-friendly laws and higher minimum wage. That's it. There's no need to protest and scream at skyscrapers downtown when you could just simply exercise the power we already have to demand the wages. \n\nWe haven't tried voting in a majority of progressives to congress, so maybe we should. We haven't tried significantly re-unionizing the country, so maybe we should. If we do that and it doesn't work then sure, go yell at skyscrapers. But it's pointless to skip to the \"complain\" step when most people haven't engaged in the \"use existing power\" step.",
   "created_utc": 1691480501,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv9yt83",
   "message": "Because Americans are lazy cowards who prefer to harass their customers for tips rather than actually doing something that requires integrity like standing up against your employers and demanding fair pay. Or - I dunno - joining unions and demanding action that way. You know…the things that those backwards Europeans have been doing for centuries…? But you carry on doing the same things and expecting different results; that looks like it’s going great for you 🤦‍♂️😂😂😂\n\nEasier to just punch downwards and beg for tips I guess.",
   "created_utc": 1691485223,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv9rbii",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv94fqz",
   "message": "Protest is a complete waste of your time. No amount of street tantrums is going to get your a better wage.",
   "created_utc": 1691464796,
   "score": 2,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv9552n",
   "message": "Who are you protesting against?  The corporations?  Why would the corporations care about you protesting?  It's not like there's some wage czar who decides how much money each person deserves that you can protest against so he raises it.  Wages are set by complicated market forces that no individual can control, and any individual who decides to pay extra is likely to be outcompeted by everyone else who doesn't do that.\n\nAnd don't even think about protesting against capitalism.  A hundred million dead people and hundreds of millions more nearly dead from starvation would like to have a word with you about that.\n\nNot that the issue is unfixable, but you have to fix the market itself which is messed up from number of proximate causes.  Low wages are a symptom, not a cause.  Protesting such a distant symptom just gives license to whoever is in charge to do whatever they want with the promise of helping you and no actual effective help.  Raising the minimum wage certainly isn't going to fix the issue.\n\nBetter things that you should be protesting, which in turn would help wages if addressed.\n\n1: Get money out of politics.  Out out out.  Stop the lobbying and the campaign donations and the career politicians.  Stop the insider trading of politicians buying and selling specific companies and corruptly helping them.  Stop the million dollar speeches after \"retiring\".  If politicians are less beholden to big business, they'll stop favoring them so much.\n\n2: Make things way easier for small businesses.  Fewer taxes, fewer regulations.  Do the opposite for big businesses, especially ones with monopolies or near-monopolies.  More competition means the market price for labor will go up since each employee will have more alternatives to go to.\n\nIf the emergent economic market price for wages goes up, then wages go up, and nobody will be able to stop them from doing so automatically.  And if the equilibrium doesn't go up, then wages won't go up, and nobody can force them to directly without some serious and horrible side-effects.  Don't protest the symptom, protest the cause.",
   "created_utc": 1691465147,
   "score": 2,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jva9gww",
   "message": "Street protests aren't worthless but the much more effective method right now is just to quit working jobs with shit wages. \n  \nActively be looking for the next job at all times. Have exit options and force your current employer to counter or lose you. \n  \nOnce companies realize they can't withstand such high turnover they'll start paying their veteran employees more than the new ones and give raises.  \n  \nAlso a big part of it is that companies need to be results orientated. Instead of caring about a person working all 40 hours a week they should instead think about if the person does their job and gets results.  \n  \nSome of the workers that are the biggest slackers are also the biggest results getters. They just cut out all the wasted time and busy work other employees do and cut straight to getting results. \n  \nWork from home needs to be expanded. It would cut alot of overhead costs for companies.",
   "created_utc": 1691493045,
   "score": 2,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8z2jl",
   "message": "You’re not protesting in the streets because there will almost always be enough people who will sell out to overcome the efforts of the people who are trying to improve their lives. It’s human nature. The only thing that ever overcomes this is a powerful, charismatic leader. And then, unfortunately, most of them get drunk on the power and sell out too.  \n  \n\nEvery generation thinks the enemy is older people being selfish, but it’s not. The enemy is just the selfish among us, no matter our generation, race, nationality, or interest. You’re not protesting in the streets because the people you’d be protesting are more or less yourselves. And until any group accepts that, they are powerless against the oppression that they are actively helping to sow.",
   "created_utc": 1691462211,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv8z6qb",
   "message": "The expression of collective power changes with each new iteration. Occupy was a protest but also an occupation and an embarrassment to cities who couldn't easily get rid of us. Bernie brought the struggle to the political front. The great resignation was an uncoordinated but none-the-less effective mass action. Similarly the remote work movement lost the ruling class 800 billion. Keep fighting for your rights using the leverage you have and refusing to sell out your fellow workers.",
   "created_utc": 1691462265,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv93ez4",
   "message": "Because it's more than wages. You should get paid what you're worth. And if the company you work for isn't doing that, leave and find one that does. If you are only ever offered crap pay, maybe examine why that is. I hate corporations as much as the next guy. A good example of this wage crap is what just happened at yellow trucking. This is going to have a ripple effect that isn't going to help the \"worker\". The point is, you should get paid what you're worth based on production and the value your position holds plus if an F up occurs what is the impact? I'm going to get destroyed for this, just trying to throw it out there that this is beyond wages. Everyone should be paid enough to live and if you can't find a company in your field that will pay what you deem \"fair\" then you need to get into something else, gain some skills or go into business on your own. Put your name on the building and on all the finances and I'm sure your eyes would open. Production, risk, value are what determines pay. They all need to be high to get paid high, all mid, you're paid mid , all low, paid low. What I've seen is value and risk have the biggest weight. If your value is making 1000 whatever's a day that plug into a bigger whatever and that goes into the final whatever then there's like no risk there and little value. The whatever you produced isn't seen or known about. Anyway, everyone deserves a wage that compensates for their production, risk the position requires and value of output.",
   "created_utc": 1691464286,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv94flz",
   "message": "Social causes, race, gender,  climate, etc. have drowned out  a fairer redistribution of wealth as a main point of protest \u0026amp; societal division \n\nIf you can figure out why you may be onto why society is getting worse, it's not better.",
   "created_utc": 1691464794,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv94hpj",
   "message": "I'm waiting for a servers union to crop up",
   "created_utc": 1691464824,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv95uxw",
   "message": "I’m not planning on being here long enough for it to be a problem",
   "created_utc": 1691465512,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv960q6",
   "message": "Wages go up .. So do the prices of everything else. This isn't a working cycle.\n\nI really wish we'd work on the solution of housing being so expensive then we wouldn't have to keep raising the wages.",
   "created_utc": 1691465593,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jva9ygl",
   "message": "Because our wages are high here and have been skyrocketing lately",
   "created_utc": 1691493349,
   "score": 0,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jvagmj2",
   "message": "Seriously, it's because y'all are bitching about a non-issue. You lazy fucks already make more than Gen X or Millennials did at the same age. \n\nWage inflation has already happened and was part of the inflation of 2021- present.\n\nIt's asinine to me that no talent ass clowns are making $15 an hour with no skills and even some junior associate corporate positions starting at $80,000+.\n\nStop your bitching and grow the fuck up. That's what. Your generation literally has the easiest life even compared to boomers and yet it's STILL not enough for you fucks.",
   "created_utc": 1691497084,
   "score": 1,
   "submission_id": "15kz4ht"
  },
  {
   "comment_id": "jv90gxu",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15kz4ht"
  }
 ]
}