{
 "submission_id": "15l1zz3",
 "title": "How would you feel if your guests had loud sexual intercourse while being hosted in your home?",
 "selftext": "",
 "created_utc": 1691453900,
 "permalink": "/r/AskReddit/comments/15l1zz3/how_would_you_feel_if_your_guests_had_loud_sexual/",
 "score": 24,
 "url": "https://www.reddit.com/r/AskReddit/comments/15l1zz3/how_would_you_feel_if_your_guests_had_loud_sexual/",
 "comments": [
  {
   "comment_id": "jv8gccs",
   "message": "It depends on who the guests are…\n\nI might want to get in on that shit.\n\nOr I might just listen from a distance.\n\nOr I might ask them to get the heck out of my house, and called them dirty scoundrels!\n\nIt all depends.",
   "created_utc": 1691453972,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8h05n",
   "message": "I will ASSUME — as a host — sex could happen. The polite thing is, if you must, NO ONE CAN KNOW. It must be silent, untraceable sex. Don’t ask, don’t tell sex.\r  \n\r  \nContext matters. I'd say it depends on these factors:\r  \n\r  \nLength of stay. One night? Probably not. A month? They should expect it.\r  \n\r  \nGuest room vs. Family Member's room. Guest room? Safe. Family Member's room? Not safe, especially a kid's room.\r  \n\r  \nReason for stay. Funeral? Don't do it. Weekend getaway? Go for it.\r  \n\r  \nCloseness with host. New friends/colleagues? Nope. Lifelong friends? Sure.\r  \n\r  \nLocation of bed. Living room fold out? Bad move. Far corner of the house? Smooth moves.",
   "created_utc": 1691454251,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8gcg0",
   "message": "I stayed at a friend's house last year, along with a few other friends.\n\nOne of these friends had loud intercourse with herself. That was the most awkward night ever.",
   "created_utc": 1691453973,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8gfq3",
   "message": "I'd let them know the hidden cameras have pretty decent microphones, so no need to project so loudly",
   "created_utc": 1691454011,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8h0fy",
   "message": "Any real homeowner would be anxious about whether or not the headboard was too close to the drywall. Hopefully it's just some scuffs, but filling and painting isn't too bad either. Hopefully you have some of the room's original paint in the garage, just hoping it hasn't gummed up or separated too much",
   "created_utc": 1691454255,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8h2ak",
   "message": "If it's loud, I'd ask them to keep it down!",
   "created_utc": 1691454276,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8g9z7",
   "message": "confused",
   "created_utc": 1691453944,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8ghdn",
   "message": "I'd just find it amusing, but if it was like bed time to sunrise, every night, I might ask them to keep it down so I could sleep.",
   "created_utc": 1691454030,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8gmuc",
   "message": "Not much you can do about it in the moment obviously, but i wouldn't be inviting them back.",
   "created_utc": 1691454094,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8gnkm",
   "message": "My dad and his wife have no issues having loud sex when they come visit me and it is VERY uncomfortable.",
   "created_utc": 1691454102,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8goq3",
   "message": "jealous",
   "created_utc": 1691454116,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8h271",
   "message": "Jealous",
   "created_utc": 1691454275,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8hiqb",
   "message": "Shortly after I got married. My wife and I got a new house. My best man came to visit.  He went out for the night but because I was newly married I decided to stay home.\n\nAround four am, my beautiful new wife got up to pee and heard a bunch of NSFW noises coming from our guest bedroom. \n\nWe assumed his fiance met up with him and came over. \n\nShe went back to bed and didn't really think about it until the next morning when she noticed a strange car in the driveway and my buddies fiance left her a VM saying she was sorry she could not come over that weekend.  \n\nMy wife ended up being a serious bro.   When he woke up and his ons left she sat him down in the living room and told him this was the one and only time she would cover for him \n\n\nSo in answer to your question.  I'm not a big fan of smashing at other folks houses and would prefer they didn't do it at our place.   \n\nPs.  She made my best friend take the sheets and duvet to the dry cleaner on his dime",
   "created_utc": 1691454471,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8hm5s",
   "message": "Just fucking, uncomfortable. Annoyed. Unless it's my best friend, then dc. But if it's not THAT friend, gtfu of the house lmao!",
   "created_utc": 1691454510,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8ht09",
   "message": "Embarrassed.",
   "created_utc": 1691454590,
   "score": 1,
   "submission_id": "15l1zz3"
  },
  {
   "comment_id": "jv8iisd",
   "message": "If they're staying in my house, they're friends or family. And I want them to enjoy their time here. Bang away, fam!",
   "created_utc": 1691454893,
   "score": 1,
   "submission_id": "15l1zz3"
  }
 ]
}