{
 "submission_id": "15l3c4n",
 "title": "What is the stupidest reason you sent yourself to the hospital?",
 "selftext": "",
 "created_utc": 1691457370,
 "permalink": "/r/AskReddit/comments/15l3c4n/what_is_the_stupidest_reason_you_sent_yourself_to/",
 "score": 11,
 "url": "https://www.reddit.com/r/AskReddit/comments/15l3c4n/what_is_the_stupidest_reason_you_sent_yourself_to/",
 "comments": [
  {
   "comment_id": "jv94523",
   "message": "Turned around on the stairs to call my cat fat and badly sprained my ankle. I thought I had broken it because there was an audible crunch and I felt something pushing up inside my foot (x-rays didn’t show a break).\n\nThe doctor told me “serves you right” when I told him what happened.",
   "created_utc": 1691464646,
   "score": 160,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8odxr",
   "message": "Did a flip off of a table to impress some girls.",
   "created_utc": 1691457426,
   "score": 184,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8of6v",
   "message": "I didn’t feel like finding the finger guard for my mandolin. Sliced the tip of my finger off. Got like 4-5 stitches. Never again will I use a mandolin.",
   "created_utc": 1691457440,
   "score": 129,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8updc",
   "message": "Fell into the only prickly pear cactus in a 100 mile radius",
   "created_utc": 1691460217,
   "score": 136,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8v1nz",
   "message": "When I was in college, I had my mom's home cooked meal that I accidentally left out over night. I tried to eat it anyway. 24 hours of it coming out of both ends and one ER visit later, I realized it, I learned a valuable lesson.",
   "created_utc": 1691460370,
   "score": 116,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv97h1g",
   "message": "Saw a cat in a meadow and went to pet it (it was a cat!! In a meadow!! 😻😻😻). Cat said “nu” and bit me. This all happened today! Pray no rabies 🙏",
   "created_utc": 1691466343,
   "score": 90,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv98huo",
   "message": "Giving myself food poisoning by undercooking chicken. \n\nWoke up in the middle of the night around 2am. Start going to the bathroom relieving myself from the bottom and emptying from the top. Kept puking till I’ll couldn’t even keep water down. Thought I was gonna go into shock \u0026amp; die. \n(Lived alone during this time in my own place.) \n\n7:00 AM \n\nCalled my Mom, no answer. Called my Uncle no answer. Called my Dad no answer. \n\nCalled Grandma. \nShe answers half asleep. \n“Hello? OP?” \n\n“Pls help I think I’m going to die D: “ \n\nPicks me up, get to ER\n\n“I can’t move pls, I need a wheelchair” \nThey wheel me in. Sit in the lobby 30 min. for health insurance purposes. They get me into a room.\n“Bag I need bag.” I empty more of myself out violently. My Dad gets there around that time. \n\nThe rest of the day was me getting hooked up to an iv, CAT scanned to see what the problem was, released and then taken home to sleep \u0026amp; hydrate for the next 2 days. \n\nLearned that it’s better to burn your food than undercook it. \n\nMan is it fun learning how to cook in your 20s.",
   "created_utc": 1691466886,
   "score": 102,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv96jf2",
   "message": "Threw a tennis ball in the air, attempted to catch it, and I ended up slipping on wet grass and broke my arm",
   "created_utc": 1691465858,
   "score": 88,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8qcg5",
   "message": "I was doing homework, while doing that I was swinging my feet, I accidently kicked the wall behind my desk and  stubbed my big toe.",
   "created_utc": 1691458286,
   "score": 42,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv92azz",
   "message": "My friend got over his seafood allergy and had a bowl of shrimp. I thought I’d do the same and eat some pistachios.",
   "created_utc": 1691463744,
   "score": 93,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8y73x",
   "message": "Goofing around in the pig barn at my cousins. Was told to stay out of the pig barn. Sliced open the back of my thigh on a sharp edge of sheet metal. 5 years old screaming my head off in the ER as they stitch up the 4 inch cut. Thankfully just skin and fat, no muscle or tendons involved. \n\nWas the beginning of summer, couldn't swim for  weeks, seemed like forever in my 5 year old mind. Totally sucked because I lived in the water as a child. And I live in the land of 10,000 lakes so we were often at one",
   "created_utc": 1691461807,
   "score": 51,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv93xzl",
   "message": "Dropped my phone on my face",
   "created_utc": 1691464547,
   "score": 39,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8y0nl",
   "message": "Day one: got my motorcycle license\n\nDay two: was speeding and took a turn way too fast; snapped collar bone like a twig among other scrapes. Lucky it didn't turn out worse. Got sent to ER.\n\nDay three to 183: spent time laying in bed while bone healed. \n\nDay 184: out there again with proper gear and obeying the speed limit. Still have close calls here and there.",
   "created_utc": 1691461722,
   "score": 57,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9879k",
   "message": "I drank a tall can of hard cider and then did a hot wings challenge. I got home, went to sleep and was woken up at 3am in literal tears with the feeling of a ruptured stomach. Went to the ER, got asked if it was a hazing and was given lidocaine to drink and a shot for nausea. The pain barely subsided but the walked me out anyway, on the way out I asked the nurse “so… that shot was supposed to make me less nauseous?” She said yes and then I threw up all over the bushes just outside the door. Felt a hell of a lot better and walked home.",
   "created_utc": 1691466730,
   "score": 53,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8oglr",
   "message": "Typo on Google Maps",
   "created_utc": 1691457458,
   "score": 44,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8vm3w",
   "message": "I got hit by a truck in the 7th grade because I didn't have my glasses. I didn't have my glasses because I'd lost them in a car accident the day prior. The hospital I was taken to recognize me from the car accident and called my mother",
   "created_utc": 1691460628,
   "score": 68,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8sx5s",
   "message": "Playing lawn darts with my nearsighted sister.",
   "created_utc": 1691459426,
   "score": 33,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv94na5",
   "message": "In training I was unable to have a bowel movement for around 4 days and I had to hobble to the base clinic because my abdomen hurt so much. Turned out to be appendicitis!",
   "created_utc": 1691464900,
   "score": 30,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8pzvi",
   "message": "Ill start; \n\nCoupled with preexisting mental health conditions, I stupidly abused Phenibut one week, and sent myself to the psych ward for derealization and psychotic symptoms. Dumbest shit ever, still trying to work through it months later. However, if im being honest i think i would have ended up there sooner or later for a multitude of reasons.\n\nAlso broke my jaw a while back from riding an e scooter while drunk(i thought they were for drunk people so they didn’t drive cars). Dumbass. Very ashamed if that one, and needless to say, i have since given up drinking.\n\nBut yea, share your stories! Anything more cringe than mine?? You are not alone.",
   "created_utc": 1691458132,
   "score": 35,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9df9u",
   "message": "Didn't use a condom. Nine months later my water broke.\n\nEdit: my kid was 110% planned but I couldn't resist.",
   "created_utc": 1691469647,
   "score": 43,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8oh6p",
   "message": "did a bicycle kick playing football in school. still don't remember the rest of that day",
   "created_utc": 1691457465,
   "score": 12,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8w6lk",
   "message": "Apparently when I was younger, I guess around 5 or 6, I dumped a container of detergent in my eyes. I dont remember it at all but my Mom brings it up everynow and then.\n\nApparantly my cat knocked it off the washer into my reach",
   "created_utc": 1691460883,
   "score": 14,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv91ov2",
   "message": "I mistook antifungal nail drops as eye drops, and thought for sure I had blinded myself in the left eye. I have serious dry eye syndrome, and can't open my eyes very well without tear drops in the morning. One morning I reached for the tears and mistakenly grabbed a bottle with drops for toenail fungus. The stinging was instant, so I knew I messed up.",
   "created_utc": 1691463448,
   "score": 13,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv95tz6",
   "message": "I got all bewildered after doing a $60.00 rock of Crack in 3 hits. And after I climbed up the brick wall of a 2 story apartment building. Then I coaxed down by my lover, where I wondered over to a bus stop. It pulled up, I got on. I told the Driver I needed to go to the police station, and I didn't have the dollar. He let out downtown Houston, I walked there; and up to their counter. I told them I did Crack, handed them my license where they looked at my record, and said they had catch me doing to take me in. I then got another bus to Ben Taub Hospital, in the Medical Center. I had a slightly Crackes Mind Ever Since. They put under psychological examination, 25 years ago.",
   "created_utc": 1691465499,
   "score": 11,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv978ib",
   "message": "I ran into the ouch part of a rocking chair when I was 4 years old, because my mom came home from grocery shopping and told me there were cookies. I got excited, tripped, and busted one of my eyebrows up good enough to need some stitches.",
   "created_utc": 1691466218,
   "score": 15,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9d1rr",
   "message": "I went on a long run during winter and had \"runner's trot.\" I was nowhere near civilization so had to relieve myself. I couldn't use any leaves to wipe as there were none around, so I had to continue running with the juice moving freely between the two cheeks. Eventually, that juice turned to blood as the friction was too much.\n\nI couldn't make it home and fortunately found someone who called an ambulance for me. I do not know how much blood I lost.\n\nWord of advice for any marathon trainers... always carry several sheets of toilet paper with you.",
   "created_utc": 1691469422,
   "score": 18,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8pswo",
   "message": "Striking a grappler",
   "created_utc": 1691458045,
   "score": 5,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv911h0",
   "message": "Stop. Drop. And roll on a fire ant hill isn't the same as being on fire. It just makes them more angry.",
   "created_utc": 1691463135,
   "score": 25,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv91ebc",
   "message": "Walked through a glasdoor I left open and my dad closed. \nOfc it was a sunday and no doctor was avaible expect at the hospital",
   "created_utc": 1691463307,
   "score": 16,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv92xyk",
   "message": "Constipation. Yepp.",
   "created_utc": 1691464054,
   "score": 9,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8z2k7",
   "message": "I got contact lenses for the first time. At the end of eight hours, I managed to dig one out but couldn’t retrieve the other one. Wasn’t used to sticking my finger in and around my eyeball and finally gave up. In ER they managed to find it wedged up underneath my eyelid and in the corner. Embarrassing and expensive.",
   "created_utc": 1691462211,
   "score": 11,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv93y8e",
   "message": "Was Throwing Pieces Of Concrete With My Brother, Got Hit In The Head. Bled A Lot, Needed 27 Staples.",
   "created_utc": 1691464551,
   "score": 4,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv97iry",
   "message": "In college, I ate something I was allergic to. In my defense, I forgot to check the ingredients. While I was studying in one hallway, my blood pressure rose and my body froze. I tried to calculate how I was gonna get to the next trash can with the fewest steps possible. The second I moved, I turned a corner and vomited nonstop. This scared a student that was passing by and instead of calling campus emergency services he called 911! My “friends” found out and one of the most tone-deaf responses was like “That’s why you got sent there? You know an ambulance ride is $200 right?”\n\nMy family and my roommate had a field day with this one hahaha!",
   "created_utc": 1691466369,
   "score": 8,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9a0js",
   "message": "I tossed a basketball up in the air and hit it with a baseball bat like it was a baseball and it ricocheted the bat back and hit me right in the head and gave me a gash. I was like 8 years old at the time and I was scared",
   "created_utc": 1691467706,
   "score": 4,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9b5e8",
   "message": "Walking.",
   "created_utc": 1691468336,
   "score": 4,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9b5np",
   "message": "I just kinda was too lazy to go to the liquor store. Didn't drink and almost had a seizure from withdrawal",
   "created_utc": 1691468340,
   "score": 11,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9fqog",
   "message": "Washed one foot in a ceramic sink. Tripped and ripped the sink of the wall. Fell in the ceramic debris and cut my back badly. Saw my spine. This took eight weeks to heal.",
   "created_utc": 1691471057,
   "score": 20,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv92y9o",
   "message": "I once got so stressed from work that I wound up in the hospital. The hospital I work at. The beginning of the pandemic seriously sucked even for non clinical staff (IT here.)",
   "created_utc": 1691464058,
   "score": 12,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv97o13",
   "message": "Tripped on my way to meeting friends to do a Pokemon Go raid. I knew it was serious but still made it. Only one in the group to get a shiny. Got a ride to the hospital - broke my hand in 2 places catching my fall. Stupid? Yes. Worth it? Also, yes. 🥳",
   "created_utc": 1691466447,
   "score": 10,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9ckj4",
   "message": "Gas. It felt like I was dying. It felt like insides were being ripped out, like I had 20 appendices busted, bursting, and killing me. I was going to die. Everything inside of me was retaliating, dying, cancerous, poisoned. Then, rocking back and forth with tears in my eyes a little, phhhtttt escapes my butthole and it was like the heavens opened upon me.  Angels singing as the gas was breezing.",
   "created_utc": 1691469144,
   "score": 7,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8vqki",
   "message": "NSFW- Jumped off a bunk bed at age 5 and smashed the side of my chin onto the sharp end of a toybox. Recieved 4 stitches.",
   "created_utc": 1691460683,
   "score": 6,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8wwfu",
   "message": "Not me. My teammate was riding his bike around a convention, while carrying a bag on his handlebars, the bag went into his wheel. He woke up in the ER. This guy has been racing bikes since he was 12 lol",
   "created_utc": 1691461210,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv95ytm",
   "message": "greened out \u0026amp; had a seizure 🤪🤪",
   "created_utc": 1691465567,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv96kwx",
   "message": "I accidentally OD’d on painkillers. That was the day I learned Advil was the same as Ibuprofen….not my brightest moment. Spent the night vomiting and shitting at the same time. It was not fun.",
   "created_utc": 1691465880,
   "score": 8,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv97wln",
   "message": "Copying the knife trick from aliens.",
   "created_utc": 1691466573,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv98k6i",
   "message": "Doing a dance move and breaking my pinky toe on a couch peg.\n\nEmbarrassing on multiple levels considering I never knew how to dance, I was way too close to furniture to pretend I did, and my trip to the ER consisted of a doctor laughing at me and just taping my toes together.",
   "created_utc": 1691466920,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv98zj8",
   "message": "I used a cotton swab",
   "created_utc": 1691467147,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv99g5y",
   "message": "Good 80s weed 💨💨💨",
   "created_utc": 1691467396,
   "score": 5,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv99nph",
   "message": "Drunk on St Patricks Day, I was showing someone at a party how to do an open palm strike on a punching bag. I explained how you could hurt your hand doing a normal punch, then did a punch, rolled my wrist and hurt myself. Figured I sprained my wrist, no point in going to the hospital over that on St Patricks Day. Continued my night, including making my friend hold my second drink because I couldn’t. Woke up the next morning to my wrist swollen up and unable to move it. Had to take the bus to the hospital since I drove a manual transmission car at the time. Turns out I fractured my scaphoid in my wrist. Had to write final exams with a cast on my wrist.",
   "created_utc": 1691467510,
   "score": 4,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9bjak",
   "message": "Lost a bet so I downed a bottle of painkillers to numb the feeling 😂",
   "created_utc": 1691468551,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9e26h",
   "message": "Wasn’t me, but years ago, I had a friend, a guy, and he liked to drink a lot! He was really wasted and he had a miniature cannon probably 10 inches long. He decided to shoot it on New Year’s Eve. It was totally functional. Well, he forgot to move his finger from in front of the barrel, and his blew his finger right into off. The whole darn thing!",
   "created_utc": 1691470027,
   "score": 7,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9e8sm",
   "message": "Trapped gas :( after an ultrasound the nurse came in and explained it to me, shortly after I stand up to get dressed and leave, nurse is helping me as I'm still in pain, and I let out the longest, most explosive sounding fart I've ever farted. Such instant relief and such innocent giggles from me and the nurse.",
   "created_utc": 1691470137,
   "score": 26,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9ewly",
   "message": "I drank too much too often.",
   "created_utc": 1691470539,
   "score": 8,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9eyze",
   "message": "I ate a quarter cup of salt trying to induce vomiting after a food binge. I was very stoned though, so it didn’t work. They had to watch me for hours so I wouldn’t burst my stomach drinking water. I left the hospital the next morning 5kg (10lbs or about 10%) heavier than I woke up the morning previous.",
   "created_utc": 1691470579,
   "score": 5,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9f5cg",
   "message": "I put my hand on a stove to see if it was hot. It was.",
   "created_utc": 1691470688,
   "score": 11,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9g9uo",
   "message": "When I was a kid I had one of those erasers that you can sit on top of a pencil, as it has a hole on the bottom. It was about 2 inches big and it was a Yogi Bear eraser. \n\nFor no other reason that I was, and remain, a moron, I decided I needed to know if I ripped Yogi's ear off and stuck it into mine, would it fit.\n\nAnd fit it did. And it got stuck.\n\nI had to go to the doctor and have them remove it.\n\nTook a whiiiiiiile. They were using this water gun thing to try to flood it out, while fishing around with tweezers. \n\nA little while and some bloody tweezers later, it was out. \n\nI still remember the little horrible moment in my basement when I did it and my brain went, \"uh oh. Eraser not come out.\" I was terrified.",
   "created_utc": 1691471394,
   "score": 10,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9gc1y",
   "message": "Accidentally ate my cats pills instead of mine. Don’t worry, the cat didn’t get mine",
   "created_utc": 1691471432,
   "score": 9,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9gfhz",
   "message": "Got a slit in my eye from a joshua tree while cleaning.",
   "created_utc": 1691471492,
   "score": 4,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9fb1c",
   "message": "What’s a hospital? Hospitail. I thought they were payed nurses.",
   "created_utc": 1691470788,
   "score": 0,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv8xrqg",
   "message": "A game of touch football. We had to move it like one yard and somehow I ruined my ankle and wore a cast for 2 months",
   "created_utc": 1691461608,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv92rec",
   "message": "Very bad hot knife burn. Have a scar 20 years later.",
   "created_utc": 1691463963,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv958sm",
   "message": "Swiped a bottle of unrefridgerated white wine at age 20 and tried to open it with a pocketknife at 1am.",
   "created_utc": 1691465200,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv95usg",
   "message": "Jumped on a metal box, ended up cutting my knee open. Still have the scar",
   "created_utc": 1691465509,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv98p0f",
   "message": "I have really bad medical anxiety that makes me prone to related panic attacks. I’ve been to the hospital at least 3 times where the doctors basically say that they can’t find anything wrong with me and I respond that it was probably just a bad panic attack.",
   "created_utc": 1691466991,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv99e8v",
   "message": "Phimosis",
   "created_utc": 1691467368,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9abec",
   "message": "Drop kicking a punching bag standing on the floor and breaking my leg",
   "created_utc": 1691467872,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9agio",
   "message": "SirGlenn, an inexperienced co worker, handed me my nail gun in the wrong direction, it shot a 16 penny nail halfway through my thumb. They  took me to the hospital,  where the Doctor, with a big grin on his face said, I bet you didn't do that with a hammer!. The Doctor had to cut a nickel sized piece of my thumb off, to get the nail unstuck from my thumb.",
   "created_utc": 1691467953,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9ajot",
   "message": "I step in a duvet on the side of a curb on Halloween night and I sprained my ankle so bad that I ripped two ligaments and had to get surgery to get it fixed the day after Christmas",
   "created_utc": 1691468002,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9am97",
   "message": "The only time in my 36 years on this Earth I've every had to go to an ER was during my freshman year of college. Our dorm room walls were made of solid brick. A girl I was dating at the time and I were laying on my bed and she began to tickle me. In the middle of me laughing like a jackass I threw my head back and smacked the back of it, hard as ever, against the wall. My vision went blurry and I saw stars for about 15 seconds. One ER visit later and I was determined to be right as rain.",
   "created_utc": 1691468041,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9amd4",
   "message": "Tripped over my own foot, fell on top of the other foot, broke said foot. Out to the ER I went!\n\nThere was also the time my sciatica was acting up and my lower back buckled, and my body pitched backwards into a doorknob. That was a fun bruise to explain when I saw my doctor the next day.\n\nEDIT: forgot about the time on of my friends hooked her backpack up to the tetherball pole so we could play before school when I was in 6th grade. She didn’t take her lunch out of the bag and she’d brought kebabs. Caught the thing and was impaled. My dad laughed the entire way to the hospital after they cut me down from the pole because the situation was so ridiculous.",
   "created_utc": 1691468042,
   "score": 4,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9au7m",
   "message": "I used to work in a hospital (admin).  Was running late and skipped breakfast, didn’t drink anything and had to go to rounds that day for a project we were doing.  It was hot, there were limited chairs and I passed out in the middle of it, hit my head on the floor and spent the rest of the morning in the ER",
   "created_utc": 1691468163,
   "score": 4,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9by1l",
   "message": "Rolled over in bed into the wall and gave myself a concussion that hemorrhaged. \n\nI know multiple people that have gotten a concussion involving being half asleep and rolling into a wall or off the bed, which makes me feel a little better. But the hemorrhage is um. Unique? It wasn’t bad enough to leave me debilitated. I got very lucky.",
   "created_utc": 1691468784,
   "score": 4,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9cjd0",
   "message": "It was my 8th birthday. I was showing off for my friends at my house before we left for the party.   I jumped from my top bunk to my bottom bunk, flew sideways and smashed my head against the windowsill.  I had to go get 28 stitches in my head and missed my entire birthday party at an ice skating rink.",
   "created_utc": 1691469125,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9cn2l",
   "message": "I had to go to work",
   "created_utc": 1691469185,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9cvme",
   "message": "Vomited and thought i saw blood so i panicked and called an ambulance. Wasnt blood but i still cant figure out why it was that color cause i didnt eat anything that color",
   "created_utc": 1691469324,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9ddqy",
   "message": "Jumped headfirst into a huge ceiling fan trying to wake up my then wife. Wound up driving myself to the ER for stitches.",
   "created_utc": 1691469622,
   "score": 5,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9dnez",
   "message": "I tried to save a dog.\n\nA girl was beating her dog on the street, just in front of my bedroom's window. I didn't manage to save the dog and even got badly bit... by the girl.",
   "created_utc": 1691469781,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9e8fh",
   "message": "Quit drinking cold turkey after a very long(like weeks long bender). Do not recommend.",
   "created_utc": 1691470131,
   "score": 5,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9enn9",
   "message": "Sliced my hand open with a box cutter",
   "created_utc": 1691470384,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9f275",
   "message": "Not hydrating enough working outside during the summer .. along came a kidney stone.",
   "created_utc": 1691470634,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9f3w6",
   "message": "Walked into the edge of a counter at a video rental store. Broke a rib.",
   "created_utc": 1691470663,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9feho",
   "message": "I was trying to get the Britta filter insert out of the kitchen faucet that my old roommate insisted on putting on but when you turned the water all the way up, it would pop off.\n\nSo I’m in the kitchen at around 11pm sticking an (OPEN!!) pair of kitchen shears up into the faucet head trying to get the plastic piece out so I can put the regular faucet head back on.\n\nMy other roommate and bff (and the gf of the Roomie who insisted on putting this fucker on the kitchen faucet): “that’s probably not the best idea.”\n\nMe: “it’s fine, I need to stick it in there to twist it out”\n\nBest friend/Roomie/other Roomies gf : “okay but if you stab yourself I’m not taking you to the ER.”\n\nMe: *violently stabs self through the hand* \n\nHer : “what was that?”\n\nMe: “nothing 😳”\n\nMe: *bleeds profusely*\n\nHer: “I meant it. I’m not taking you.”\n\nOther Roomie took me to the ER and sat with me until 4 a.m. to get stitches and a tetanus shot. To be fair, I had asked him several times not to put the Britta filter on the kitchen sink 😑 he wasn’t that upset tho as he got to (his words) “see them juice my hand” (it was so swollen by the time they looked at it they had to squeeze out all the serous fluid to even see inside the wound.)\n\n0/10 would not recommend.",
   "created_utc": 1691470847,
   "score": 6,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9fn3b",
   "message": "Broke my wiener mountain biking. \nErection cycle at night was traumatizing.",
   "created_utc": 1691470996,
   "score": 4,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9fop7",
   "message": "Well, one time because I thought I could take a handle of canadian whiskey and then just be gone. But drunk me ended up ass up on deaths door out in the open. That was stupid.\n\nThen there was the time I decided to run a knife through a weatern diamond backs venom gland then rubbed the venom and blood into a cut. Yup stupid as fuck! \n\nThe other time, I decided I would be able to run through the sonora desert piss drunk in pitch black. I broke the ankle and got my right bicep sliced open to the muscle with, I think, a barrel cactus barb cause the cactus was bloody the next day. \n\nI'm not sure which of these three were the stupidest. But yup theres the top three stupid ass reasons I ended up in the er. Pro tip. Dont do stupid shit because of other stupid people challenging you. Its painful.",
   "created_utc": 1691471023,
   "score": 4,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9fouz",
   "message": "Playing \"Stab The Table\" with a switch blade while drunk. Forgot to hold my thumb over the tip and my hand slid down the blade. 4 stitches to the inside of my pinkie.",
   "created_utc": 1691471026,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9fwk7",
   "message": "(It happened when I was 2 so it was more understandable). I was at the playground carrying a huge armful of toys, and I slipped and hit my head on a rock. My mom had to hold a diaper to my head to stop the bleeding until the ambulance got there, and I had to get stitches above my eye. Still have the scar to this day",
   "created_utc": 1691471158,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9g4og",
   "message": "I cut the end of my thumb off with a table saw :( I should have practiced basic safety practices. But I didn't. And it sucked. And my thumb is fine now lol",
   "created_utc": 1691471301,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9g4ot",
   "message": "Forgot to drink water, twice.",
   "created_utc": 1691471301,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9gs7m",
   "message": "Years ago I put a pouch of weed up my clacker and it went missing",
   "created_utc": 1691471720,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9gwbj",
   "message": "Probably more sad than stupid but I flinch hard when I hear blasts (I’m Syrian). In middle school a kid popped a juice box and I instinctively tried to get down, only to ram my head on my thermos.",
   "created_utc": 1691471793,
   "score": 12,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9gzac",
   "message": "Did some methamphetamine",
   "created_utc": 1691471848,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9hbxv",
   "message": "I worked out so hard I got temporsry lactic acidosis . Went to the ER and left after I slept 2 hours on the gurney then was sent home.\n\nSometimes pain = no gain...",
   "created_utc": 1691472073,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9hd0e",
   "message": "Overdosed on a pre-workout 🥤",
   "created_utc": 1691472091,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9herz",
   "message": "Ate an uncertainly identified mushroom then panicked.",
   "created_utc": 1691472122,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9hhc0",
   "message": "I fell on a rock. Ended up fracturing my tibia bone so that was fun.",
   "created_utc": 1691472168,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9hi68",
   "message": "I had a gumball machine stuck on my hand",
   "created_utc": 1691472185,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9hkiz",
   "message": "Shoe laces were untied while running cross country back in school, didn’t want to stop to tie them because my crush was waving at me. Ate shit and fractured my wrist. There was blood everywhere from a minor cut turned bleeder too.",
   "created_utc": 1691472227,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9hlqh",
   "message": "I slammed the car door on my right thumb without knowing my thumb was between the door and the car. I couldn't move my thumb for a month.",
   "created_utc": 1691472249,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9hnc3",
   "message": "3 y/o me: running while playing the recorder (badly)\nCord on ground: Not today\nFloor: hello\nRecorders mouthpiece: 🏃\nThe roof of my mouth: ight, Ima head out",
   "created_utc": 1691472278,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9hud4",
   "message": "I thought I had covid or something and turns out nothing was wrong with me. I forgot at the time I had recently started taking anxiety meds and dint consider they could be contributing to how I felt but I ended up racking up some expensive medical bills all for nothing.",
   "created_utc": 1691472406,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9hx7i",
   "message": "Put my elbow through a glass window I was replacing because I was too stubborn/lazy to go and get the power tool that could make the job easier (my logic was that the hand tools were working just fine, and the power tool risked damaging the frame.) Had to get 5 stitches and two days off work.",
   "created_utc": 1691472459,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9hxo4",
   "message": "13 years old. Cutting open spent fireworks to find unused powder so me and my friend could pour it into a coffee can and blow it up.\n\nDidn't get that far.  Sliced open the back of my thumb with an Xacto knife. Cut a vein and nerve pretty deep. Had to wait for my mom to come all the way up the mountain and then bring me to the next city over for a hospital.\n\nEnded up in a cast for a few months. Like the cut was so damaging that I had to keep my hand elevated above my heart to prevent it from bursting.",
   "created_utc": 1691472467,
   "score": 5,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9hyfz",
   "message": "I thought a ligament was a lump...waited 8 hours to be very embarrassed and laugh myself out of the exam room. Turns out something did pop up in my blood work so the trip was not a waste but I really did feel dumb and very guilty for the original reason for the visit.",
   "created_utc": 1691472482,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9i10j",
   "message": "Fell at a popular kid’s skating party as a kid. Had to leave early to go to the hospital and get stitches on my face. Got made fun of for a long time for this.",
   "created_utc": 1691472529,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9i2xa",
   "message": "I didn’t eat then got sick from not eating then didn’t eat much for days then felt even worse that was dumb I was like 7",
   "created_utc": 1691472564,
   "score": 4,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9i6ny",
   "message": "I wish I could cast with her at the hospital \nThat would be a dream come true\nAnd if You guys would stop fucking with me so much it would help",
   "created_utc": 1691472634,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9i845",
   "message": "Not me but my friend. For school he has to work in a restaurant for a couple of weeks and one day he smoked too much grass, fainted, hit his chin on a vacuum and was sent to the hospital to get his mouth wired shut",
   "created_utc": 1691472660,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9ihdw",
   "message": "Had a meal made with a bunch of beets. I’d never eaten so many beets.  I don’t know if I’d ever eaten a beef actually. Later that night I began vomiting and shitting out a deep red lava, I believed to be blood.  Went to the ER hysterical because I was convinced I was hemorrhaging internally.  Turns out eating beets turns everything red and I just had a bit of food poisoning.",
   "created_utc": 1691472831,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9ij4m",
   "message": "I slashed my finger open cutting an avocado",
   "created_utc": 1691472863,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9iwro",
   "message": "Swore I had part of a tampon stuck up there because it was kinda torn apart when it came out. I tried to get it, bf tried to get it, no luck. Went to the ER and they looked inside and saw nothing. There was no tampon. Costed a lot of money just to have some old guy look in there for 30 seconds.",
   "created_utc": 1691473111,
   "score": 9,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9ixnb",
   "message": "This one time, back in '97, I was born.",
   "created_utc": 1691473129,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9izgm",
   "message": "Bc my stomach hurt",
   "created_utc": 1691473164,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9j0i9",
   "message": "I made a meat loaf so heavy I went to the ER with chest pains. Everything was fine but, its kind of a joke now.",
   "created_utc": 1691473184,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9j1aa",
   "message": "My dogs were playing with a squeaky toy and for some reason it escalated to them getting aggressive. They’ve never got aggressive while playing with it before. I tried to break it up and I got bit really bad by one of them. They couldn’t stitch up the bad cut in between my fingers cause it wouldn’t have healed right. I just didn’t want them to get into a bad fight. Thankfully, both of their rabies shots were up to date.",
   "created_utc": 1691473200,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9j3rz",
   "message": "Not my story, but I was in the er waiting for an x ray, when a boy (middle school age) and his mom came into the er, I over heard that the boy had somehow superglued his finger and ripped off some skin, and the weirdest  part was that he didn’t tell him mom until three days later.",
   "created_utc": 1691473248,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9j5vk",
   "message": "To work",
   "created_utc": 1691473287,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9j5yd",
   "message": "I thought I had appendicitis but it turns out I was just constipated. I was kept at the hospital for observation overnight and even had a scan. I felt so stupid and I felt like the nurses were annoyed with me for wasting their time. I know they weren't but I just felt like they were",
   "created_utc": 1691473289,
   "score": 2,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9j5z8",
   "message": "My husband tripped over the baby gate and gashed open the meaty part of the outer forearm above his elbow. While he was at home alone with our 2 year old \u0026amp; 4 month old. During an ics storm. At night. That was fun. \n\nI had an allergic reaction to my chemotherapy meds \u0026amp; passed out.  Had to be stabbed with an epipen to come back. Blood pressure was 70 / unreadable. Pulse was unable to be found. O2 was 90. Never had another reaction to the other 5 treatments I had. Severe reactions like that are not common.",
   "created_utc": 1691473289,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9janc",
   "message": "I ate like 20 burritos, I forget what style but not large like maybe 6in flour tortilla. I woke up with the most painful stomach cramps. ER Dr. Thought my stomach was gonna rupture from the pressure in my stomach. I digested those bad boys and lived to eat like a starving dog another day.",
   "created_utc": 1691473380,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9jbrh",
   "message": "Cleaning my chef sisters bone knife. Let me just wipe this dry by running my hand and a tiny piece of paper towel along it!\n\nOh look at that! Sliced into my finger just like butter! Queue blood everywhere and stitches.",
   "created_utc": 1691473402,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9jf33",
   "message": "Fell asleep in the bath tub and woke up with half my body completely asleep,  could barley pull myself out of the water and had to crawl over to my stairs to prop myself up. I thought I was having a stroke.",
   "created_utc": 1691473464,
   "score": 4,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9jf75",
   "message": "Stapled my finger (on accident) in class, it almost hit the bone.",
   "created_utc": 1691473466,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9jgd5",
   "message": "Drank about a liter of booze a day for a good long while post breakup. Ended up in the hospital for almost a week, unable to eat anything, because I induced acute pancreatitis.",
   "created_utc": 1691473489,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9jiiw",
   "message": "When I was 7 I was running around squawking like a chicken when I tripped over a wheelbarrow, requiring stitches to close the corner of my mouth.",
   "created_utc": 1691473530,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9jk1m",
   "message": "Appendicitis. Shoulda just died like a man.",
   "created_utc": 1691473560,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9jppp",
   "message": "Small cut on my finger from a knife.  I panicked,  went to the hospital, and had a massively attractive doctor give me a bandaid.  I was sheepishly sitting on the gurney when he must have been overcome by intrigue because he lifted my pant-leg to get a better look at the sasquatch leg-hair that was peeking out. He smirked, and I skulked home.",
   "created_utc": 1691473672,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9jr79",
   "message": "Broke my dick when a girl was riding me",
   "created_utc": 1691473700,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9js4m",
   "message": "I swallowed a bunch of pills then backed out of committing suicide because I didn't want to traumatize anyone who would find my body.",
   "created_utc": 1691473717,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9jurw",
   "message": "Tried to climb up the slidy part of a playground slide. Slipped and bashed my face right into it.\n\nLost a milk tooth and chipped a part of the permanent tooth above it. Had to have that chipped bit fixed up like three times in the three decades since... and need to see my dentist a fourth time soon as I again lost part of the filling while eating nuts.",
   "created_utc": 1691473767,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9jv1c",
   "message": "Trying to open the seal on a jar of cocktail sauce. Grabbed my bros knife. He’s a professional chef. It slid down the glass right into the joint between my thumb and forefinger. Had to go to the hospital and miss the entertainment at my own bachelor party. 🤷🏻‍♂️",
   "created_utc": 1691473772,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9jzwx",
   "message": "I got food poisoning from leftover pizza. It had been in the fridge for a couple of days, and I ate it cold.",
   "created_utc": 1691473867,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9k1fl",
   "message": "I transported an EE who could have avoided the whole trip had they used the right PPE. It’s the last line of defense for a reason!",
   "created_utc": 1691473896,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9k2e9",
   "message": "I kicked my friend and my toes got fractured, really fun not being able to walk for like a month",
   "created_utc": 1691473914,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9k49n",
   "message": "Climbing a mausoleum when I was young and high. Fell and messed up my leg. 6 hours sat in A+E, and had crutches for a while. Now I'm in my 30s and my knee is like a 70yr olds. My own stupid fault.",
   "created_utc": 1691473949,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9k4ue",
   "message": "I was doing little jumpy kicks to the song Footloose and broke a bone in the middle of my foot- because I landed too hard on it.\n\nIn a Walmart. \n\nFootloose wasn't even playing\n\nI was singing it in my head.",
   "created_utc": 1691473960,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9k5sz",
   "message": "Tried to kick a ball inside my home, hit the door instead. Broke my pinky.",
   "created_utc": 1691473978,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9k81p",
   "message": "Tried to scare my kid by jumping out and yelling “RAAA!”.  \nShattered my lower left leg and ankle in 3 places. Derp.",
   "created_utc": 1691474022,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9k8ld",
   "message": "Ran straight into a wall and the corner cut my forehead so deep that it wouldn’t stop bleeding",
   "created_utc": 1691474033,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9k9yo",
   "message": "Oh boy, I got a good one. 11y old me hit myself in the nuts 100 times on a dare. My pre pubescent balls ballooned to the size of an orange and had to be looked at. No damage done other than the swelling,  besides the distinct embarrassment when a female doc walked in to do the check up.",
   "created_utc": 1691474060,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9kbxk",
   "message": "For our anniversary my husband made me a beautiful piece of art on some awesome live edge wood. He hung it above the doorway between our kitchen and laundry room. That doorway also has a baby gate to keep the pups out of the laundry room.\n\nOne day I was sweeping, and decided to try to step over the baby gate while holding the broom. Broom knocks the wood down onto my toe. Bone breaks right off and through the skin. \n\nEr visit, stitches, a walking boot, crutches, and a scooter later: Should’ve removed the baby gate instead of stepping over ☹️",
   "created_utc": 1691474098,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9kfyb",
   "message": "Cut my hand carving a pumpkin. On Halloween.",
   "created_utc": 1691474176,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9khtx",
   "message": "Cranking up a treadmill to it's highest setting and then jumping on it with both feet like I was freaking Mario stomping a goomba. \n\nFun fact? There is no really effective way to sew a laceration to the webbing between your ring and pinky finger LOL",
   "created_utc": 1691474212,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9klfa",
   "message": "Thought I was on the floor and stepped off the ladder. I still had one step. Busted my head open. Took 3 staples. My dad removed the staples 10 days later in his kitchen.",
   "created_utc": 1691474283,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9kmhm",
   "message": "Got so drunk I couldn’t stop vomiting. Burst blood vessels in my eyes and my face and thought I’d die from alcohol poisoning if I didn’t go to the er\n\n2 years sober now",
   "created_utc": 1691474305,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9kw1r",
   "message": "Not me, but my dad was walking our dog one night absolutely wasted, got tangled in her leash, tripped and fell onto his glass beer bottle. \n\nBled all over the dog and had to get seven stitches in his hand.",
   "created_utc": 1691474494,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9kws5",
   "message": "I was on my warm-up lap at a motocross track, fell over a berm and broke my arm. Wasn't there for more than 30 minutes. Luckily the track owner was cool and offered me a free ride day the next time I was able to come out. Was back out there 2 weeks later 😂",
   "created_utc": 1691474508,
   "score": 1,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9kxmd",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9lw23",
   "message": "Got stuck in the ankle by a porcupine quill. Found out I'm allergic to porcupines!!! Eyes swelled shut, kind of scary.\n\nThen, on crutches, couldn't wear contacts for a week so I couldn't really see, I tripped and fell down the stairs after class at college, hurt my arm/wrist. Sprain, had to wear a brace. \n\nThe worst week. And I have since had to list porcupines under my list of allergies.",
   "created_utc": 1691475196,
   "score": 21,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9lxt5",
   "message": "Winner: I hastily removed a cockring and burst a blood vessel, making my penis quite scary looking very fast.  I felt like I was going to faint for a second there.  When I finally got to be examined, it was rather curious how many 2nd opinions were needed between the doctor's colleagues, especially since the doctor ultimately just said, \"that'll heal on its own\".\n\nRunner Up: I ran outside quick to grab my RISK board game.  In my excitement, I jumped my last sunken step to the outside door and gashed my scalp wide open on the flashing of the overhang.  I came inside to my friends, game in hand, with blood pouring from my head.  They wondered htf I became a bloody mess in less than 15 seconds between the car and the front door.",
   "created_utc": 1691475231,
   "score": 8,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9tnug",
   "message": "Dislocated my jaw giving a BJ",
   "created_utc": 1691481104,
   "score": 5,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9lvfs",
   "message": "I got bit by a cat and it went so deep it sprained my wrist. Afterwards we adopted that guy and that little grouch really grew on us. He never bit me again.",
   "created_utc": 1691475183,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9lvgx",
   "message": "I skipped school, drank half a bottle of Jack, got into a fight, and passed out bloody on a college bench. Woke up in the ER",
   "created_utc": 1691475184,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9lwd1",
   "message": "I jumped on a screw. I didn’t check what was under me and I was barefooted. The doctor couldn’t pull it out so he had to unscrew it.",
   "created_utc": 1691475202,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9m2n4",
   "message": "Helping dad move the caravan into the garage, attached to his powerful Volvo, while turning   it in, it looked like it was going to hit the wall, so I  put my elbow against the wall and held the caravan backing handles to stop the collision and completely shattered my wrist. Dad heard the cracking and yelp from inside the car and braked hard - good job too, my whole arm would have been pulp.  \n\n\nBeing a Sunday and early morning, there was no anesthetist at the ER, as they worked in  rotation on Sundays between a few small town hospitals. I sat in ER with no painkillers on an empty stomach for 15 hours before being treated, as I needed a general anesthetic for the op.",
   "created_utc": 1691475326,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9m4kg",
   "message": "Caught a kitchen knife after I knocked it off the counter.",
   "created_utc": 1691475365,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9mrwv",
   "message": "I sneezed and... my neck popped. I ended in the hospital and the doctor was in shock, it was the first time that someone entered in the room with a case like me. So I ended with a shame cone for humans 🤦‍♀️",
   "created_utc": 1691475832,
   "score": 3,
   "submission_id": "15l3c4n"
  },
  {
   "comment_id": "jv9yxju",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15l3c4n"
  }
 ]
}