{
 "submission_id": "15l5t9e",
 "title": "When was the last time you vomited and why?",
 "selftext": "",
 "created_utc": 1691464116,
 "permalink": "/r/AskReddit/comments/15l5t9e/when_was_the_last_time_you_vomited_and_why/",
 "score": 41,
 "url": "https://www.reddit.com/r/AskReddit/comments/15l5t9e/when_was_the_last_time_you_vomited_and_why/",
 "comments": [
  {
   "comment_id": "jv99me6",
   "message": "Vomit free since 93",
   "created_utc": 1691467490,
   "score": 50,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv937pj",
   "message": "when i was smoking weed five minutes ago",
   "created_utc": 1691464186,
   "score": 37,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv942e8",
   "message": "Two weeks ago.  Was trying to push an 11mm kidney stone through a 3mm ureter.",
   "created_utc": 1691464608,
   "score": 27,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv99rrr",
   "message": "Vomiting is the body's way of getting",
   "created_utc": 1691467572,
   "score": 30,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9fqzh",
   "message": "Last night, pregnancy",
   "created_utc": 1691471062,
   "score": 18,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9a8nf",
   "message": "Last night. Smoked weed for the first time in a month and change and overdid it. Got the spins, puked, and ended up doing a forward somersault, rolling down the stairs of my deck. Hit my head and knocked myself out on the way down. Woke up at the foot of the steps thinking I was in bed for a solid minute. I guess I was still loopy. Covered in bruises today and feel like I got hit by a truck.",
   "created_utc": 1691467829,
   "score": 14,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9hq0j",
   "message": "When my blood was turning toxic from drinking/starvation and my body was trying to reject the poison I kept putting in\n\n6 months sober now, if you’re worried about your drinking habits, do something now because you don’t want to experience how bad it can get.",
   "created_utc": 1691472326,
   "score": 11,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv93mng",
   "message": "I drank too many margs at a baseball game a few weeks ago. Then I had to travel the next day for work and I prayed to God that He would just take me to His Kingdom. 😭",
   "created_utc": 1691464390,
   "score": 19,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9jzkm",
   "message": "3.5 weeks ago while I was giving birth, because I was giving birth.",
   "created_utc": 1691473860,
   "score": 9,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9a8dn",
   "message": "I don't remember when.\n\nBut it was because of a migraine.\n\nAnyhow, the following is purely anecdotal but might be worth a try. I used to throw up pretty much weekly due to my frequent migraines. One day I took a Tums just before throwing up to reduce the acidity of my stomach acid to damage my teeth less.\n\nAnd... didn't throw up. I have tried all the OTC anti-nauseants and even several \"fast-acting\" prescription ones and they are not NEARLY fast enough. I usually have about 30 seconds between urge and act.\n\nSince discovering this years ago, I have not vomited again. So if you're about to throw up, take a Tums and it might stop it. Or not. I don't know. But it's a Tums, there's not really a big cost to health or wallet.",
   "created_utc": 1691467825,
   "score": 7,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9hqpr",
   "message": "I’m 52. Puked only a few times in my life. (Consecutive sessions notwithstanding.)\n\n* grief-stricken, 8th grade\n\n* allergic reaction to codeine cough syrup\n\n* vodka-induced alcohol poisoning\n\n* food poisoning from a smoothie mix at Costco",
   "created_utc": 1691472339,
   "score": 8,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv93ah0",
   "message": "May last year. My body didn't like morphine. I ended up staying the night in the hospital because I kept throwing up.",
   "created_utc": 1691464224,
   "score": 6,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv96vpu",
   "message": "Last week, my blood pressure was pretty low and I vomited because of severe nausea and heat.",
   "created_utc": 1691466036,
   "score": 6,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9dyow",
   "message": "So strange this question popped up because I actually talked with my doctor recently about it. \n\nIt’s been about 13 years I’d say. Last time was in middle school. Never puked from drinking alcohol either.\n\nDoctor said it’s fine and that I’ve just been exceptionally lucky.",
   "created_utc": 1691469970,
   "score": 6,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9fel1",
   "message": "The day before Easter. I had actually been throwing up for a month straight, at least once a day. It was a combination of gall stones *AND* a pancreatic psuedo cyst that was making me sick. The cyst ruptured and leaked into me. It wasn’t good \n\nDon’t get pancreatic cancer, kids, even if you make it out alive shit still finds new ways to suck",
   "created_utc": 1691470849,
   "score": 7,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9hg3t",
   "message": "I vomited cleaning up my kids vomit. Weak.",
   "created_utc": 1691472146,
   "score": 6,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv93cyu",
   "message": "2 days ago I woke up and felt like shit. No idea why, I didn’t drink the night before and ate normally. Woke up and puked, it was pink. I didn’t eat anything close to that colour.",
   "created_utc": 1691464259,
   "score": 4,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv95e24",
   "message": "A few months ago I had a severe sinus infection that activated pretty bad acid reflux, the sensation in return gave me an anxiety attack and I think my body just wanted to get everything possible out of my system as a solution. I didnt even feel like I needed to, body just went for Plan Z and hoped it worked",
   "created_utc": 1691465274,
   "score": 4,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9gi73",
   "message": "Bad parsley. Got food poisoning. Threw up laying down in the shower until there was no liquid left in me. Had to go on a plane to Hawaii the next day. Got constipated on trip. Took laxatives. Nothing, took more laxatives. Then got on a red eye back to the west coast, tried to sleep, but woke up every 20 minutes furiously clenching my butthole, lest the floodgates opened. Do not recommend.",
   "created_utc": 1691471539,
   "score": 5,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9krha",
   "message": "2018 or so. Had Zinc poisoning from welding on galvanized metal. Thought I had plenty of ventilation and everything was as safe as possible. Worst 3 days of my life as far as being sick",
   "created_utc": 1691474404,
   "score": 4,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv94863",
   "message": "When I found out my body does not like me smoking weed while drunk, a few months ago.",
   "created_utc": 1691464690,
   "score": 4,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9d6rs",
   "message": "exactly a week ago due to my period\n\nvomited 3 times, and still had to go to my tuition like 3-4 hours later",
   "created_utc": 1691469505,
   "score": 5,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9g4i6",
   "message": "Work anxiety gets the best of me sometimes.",
   "created_utc": 1691471298,
   "score": 4,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9giks",
   "message": "I was at that perfect level of drunkenness where everything is funny and feels good. Saw there was just a little bit of tequila left. It seemed like such a small amount that I figured I should just finish off the bottle. Big mistake, painted my toilet bowl red with strawberry daiquiri.",
   "created_utc": 1691471546,
   "score": 5,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9hw1l",
   "message": "Christmas time. I suspect it was the room temp deli meat I had at a buffet. Since we were in Tokyo we bought every mfin flavor of KitKat. I threw up so many KitKats that night.",
   "created_utc": 1691472437,
   "score": 3,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv96j88",
   "message": "I over ate at a Chinese buffet a few months ago. Highly recommend to pace yourself and stop when you fell a bit full.",
   "created_utc": 1691465856,
   "score": 3,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv97inf",
   "message": "I woke up one morning last year, stumbled to the bathroom and puked. turns out whenever I get a bladder infection my body goes defcon 4 and makes me disproportionally suck. I get a fever so bad Im shivering uncontrolibly and after hours of testing the doctor is always \"yeah, so it turns out you where right and it is a bladder infection, take these antibiotics and drink water.\". God I hate doctors after 4 times of that.",
   "created_utc": 1691466367,
   "score": 3,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv97npk",
   "message": "When i was 27, Vodka and Red Bull",
   "created_utc": 1691466443,
   "score": 3,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv97y08",
   "message": "My child brought home norovirus from daycare. Not only did I get to vomit all day, but I also got to shit water all day.",
   "created_utc": 1691466592,
   "score": 3,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9buuh",
   "message": "The day before my first day of kindergarten. I had the stomach flu. I'm 36 now. I've certainly been ill and nauseous since then but haven't thrown up.",
   "created_utc": 1691468733,
   "score": 3,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9i20h",
   "message": "Walked in after the missus took a shit early morning.",
   "created_utc": 1691472547,
   "score": 3,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9o88k",
   "message": "I woke up had breakfast felt weird. Took some items to a vendor we used and started puking in the parking lot. I got home and it was coming out both ends. \n\nIt was Covid. I tested negative at first. I spent the next two weeks laying around miserable at home. Unpaid, Covid cash was gone. Nothing I could do but eat the lost wages. It set me back a couple months. My employers were kinda dicks about it. Not entirely, but they suck.",
   "created_utc": 1691476918,
   "score": 3,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9b1ye",
   "message": "Few months ago. Found a wannabe crotch goblin squatting in my womb and evicted the lil fucker before rights kicked in",
   "created_utc": 1691468282,
   "score": 6,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv95otb",
   "message": "out at dinner with friends and family. went to the bathroom and vomited and came back like nothing happened. wasnt sick before or after so idk what happened",
   "created_utc": 1691465426,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv989qc",
   "message": "I was dry heaving last week when I was Mountain biking. Part of the trail went past a hay field, while they were haying. Learned that day that I get hay fever.",
   "created_utc": 1691466767,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv98fy2",
   "message": "abt a week ago, high blood sugar 😛",
   "created_utc": 1691466858,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv98idg",
   "message": "brushing my tongue this morning",
   "created_utc": 1691466893,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv99d4s",
   "message": "A few hours ago because I was crying so hard and had some sinus drainage.",
   "created_utc": 1691467351,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9b28l",
   "message": "17 years ago, because I drank too much",
   "created_utc": 1691468287,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9e10q",
   "message": "in 2019 i ate some reese cups from my auntie's house. vomited the next morning as dad walked in my room to tell me to get ready for school",
   "created_utc": 1691470007,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9ecna",
   "message": "The last time I vomited was on January. I was getting induced for labor and they gave me hella meds that made me vomit, especially when I had to go through the c section. I also threw up most of last year because of the pregnancy.",
   "created_utc": 1691470200,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9en09",
   "message": "Watched my friend eat a chocolate cake by pouring water over it as the “sponge was too dry”. And then proceeded to make a paste of it and eat it. Legit looked like dung.",
   "created_utc": 1691470373,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9gpv3",
   "message": "When I got covid a couple months ago. I only vomited once on the first day though for some reason. I've had a lot of people say it wasn't covid and covid doesn't cause vomiting but I tested positive and it definitely made me vomit.",
   "created_utc": 1691471677,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9gx6h",
   "message": "Probably 2 years ago now. Not sure why, what feeling stomach sick and threw up. Later on, it moved to my lower intestine so I'm guessing food poisoning",
   "created_utc": 1691471809,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9h8gi",
   "message": "Couple weeks ago. I take fish oil capsules every morning and sometimes they make me feel queasy.",
   "created_utc": 1691472012,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9idzc",
   "message": "A year ago when I went into the hospital for standard 2-weeks of IV antibiotics, I vomited so hard I pissed myself. Had never happened before during my treatment, and the docs tested for everything viral and bacterial without finding a cause. I think it was stress from not being with my newborn baby for that long.",
   "created_utc": 1691472768,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9izvf",
   "message": "I think it was a couple weeks ago and I don't even know why. I randomly get sick or vomit on a regular basis (yes,I have seen a doctor).",
   "created_utc": 1691473172,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9j7bz",
   "message": "Dude like 2 min ago actually. Whole household is going through Covid again right now",
   "created_utc": 1691473315,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9ke7g",
   "message": "Goddamn, r/AskReddit is really scraping the bottom of the barrel these days, innit?",
   "created_utc": 1691474142,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9kei0",
   "message": "Few months ago...Norovirus ripped through the family",
   "created_utc": 1691474148,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9kels",
   "message": "2020. Sitting outside with my brother and his friend, hanging but social distancing at the same time. His friend says something that’s so hilarious I start laughing HARD. Like start coughing hard, suddenly I’m on all fours on the ground, having just done a partial vomit up of my dinner, I remember the taste of the burger I had had not even an hour before coming back up and just BURNING my throat. \n\nLuckily it was just dark outside that they didn’t see it really and I crawl back into my house under the excuse that I need to use the bathroom but really I’m hiding in my room in shame lol\n\nThe real Problem of this story is I cannot for the life of me remember what my brothers friend said to me that caused this.",
   "created_utc": 1691474150,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9l6ec",
   "message": "Eating beef bile stew in the third world.",
   "created_utc": 1691474695,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv95c0e",
   "message": "When I was on ozempic and quitting weed at the same time",
   "created_utc": 1691465245,
   "score": 2,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9et5t",
   "message": "Twenty-six? years ago. Binge drinking as a teen.",
   "created_utc": 1691470480,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9f6so",
   "message": "About a week ago from taking caffeine pills and drinking vodka on an empty stomach. Tbf I was taking between 800-1000mg a day, but have since severely cut down 😅",
   "created_utc": 1691470712,
   "score": 0,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9866a",
   "message": "Tired of being lied by the media? If you want to stop receiving biased news, follow me and participate in my polls. Together we will find out the unbiased in the biased news media.",
   "created_utc": 1691466713,
   "score": 242,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv93fal",
   "message": "Last Tuesday bc I had a stomach bug or something 🤢",
   "created_utc": 1691464291,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv969v6",
   "message": "Haven't thrown up since I had the flu a few years ago.",
   "created_utc": 1691465721,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv976sx",
   "message": "3 yrs ago b/c I drank coffee too fast and there was too many tannins.",
   "created_utc": 1691466194,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv98j7a",
   "message": "i didn’t eat",
   "created_utc": 1691466906,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv98m7p",
   "message": "when i didn’t eat it was about 5 months ago",
   "created_utc": 1691466950,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv995r2",
   "message": "About a month ago.\n\nI had the flu.",
   "created_utc": 1691467241,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9a60d",
   "message": "Last year, I had Covid. Wasn’t fun wouldn’t recommend",
   "created_utc": 1691467788,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9czr4",
   "message": "2 days before Thanksgiving, I got food poisoning",
   "created_utc": 1691469390,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9d1sm",
   "message": "New Years, and now everytime I look at the bottle of alcohol that's left over from that night, I get queasy.  Before that night though, the last time I threw up was when I was 11, and had the flu.",
   "created_utc": 1691469422,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9dhoy",
   "message": "Hit a vape pen of a 5meoDMT varient that was the chemical equivilant of licking a certain kind of toad.\n\nWell I drew to long on the vape and immediately projectile vomited, thank god I was in the woods.",
   "created_utc": 1691469689,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9dibv",
   "message": "4 weeks ago when I had gastroenteritis. Fucking harrowing.",
   "created_utc": 1691469698,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9dnrw",
   "message": "this last friday on a drive up n down a windy road - puked 3 times n my body was sore this past weekend😭",
   "created_utc": 1691469787,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9dobd",
   "message": "Year ago. Henny, weed and coke. Damn fun night though",
   "created_utc": 1691469796,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9eekx",
   "message": "A week or so ago.\n\nFlew home for a family funeral there was a big big gathering and bigger bar tab at the wake (deceased Uncle was a sporting international in the 80's -90's).After the funeral service the drinking and socialising started at 11.30am finished after midnight.Then went to aunty's with close family for more joyful drinking and final farewell .Foolishly I said yes to a white wine after 12 hours of steady beer drinking.My wine glass kept getting topped up.Home to bed about 3am .Woke up 5am made it to toilet vomited from a standing position at first then later got on my knees which was pointless because by then the walls ,floor,mats,mirror, shower screen were splattered.Also didn't notice how I damaged my arm .",
   "created_utc": 1691470232,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9efhc",
   "message": "there was a new chicken at chipotle so i decided i should try it since i usually don’t try new things, i even added rice to mine as a change. anyways when i woke up the next morning i just threw up it was really bad, my bed was a mess and i was throwing for a good minute. never eating from chipotle again",
   "created_utc": 1691470247,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9f2pg",
   "message": "Night I got the shingles vaccine",
   "created_utc": 1691470643,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9fw21",
   "message": "Bad fish from a restaurant next to where I work. All other food is good, except the fish.",
   "created_utc": 1691471150,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9g1z5",
   "message": "4 days ago.  Smoke inhalation from fires nearby, bad asthma, cough, barf.  \nFun.",
   "created_utc": 1691471253,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9g4vg",
   "message": "Three days ago. Who would’ve thought 5 shots of vodka an edible and a few hits from a pen would let me eat my dinner twice?",
   "created_utc": 1691471305,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9ggkg",
   "message": "About two weeks ago. Had a horrendous flu that made me incredibly dizzy and tired, but my glutton ass decided to down an entire teriyaki combination when I hadn't eaten anything for two days. I ended up puking it a few hours later. It came out completely intact. I could see the chicken, the beef, the peas, the carrots and all the rice grains. \n\n10/10 wouldn't recommend eating *that* much when sick, but would absolutely suggest you to NEVER hold vomit in.",
   "created_utc": 1691471511,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9goy2",
   "message": "6 months ago I had norovirus. One of the worst sicknesses I’ve had.",
   "created_utc": 1691471660,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9gson",
   "message": "I get really bad migraines that make me nauseous so whenever I had my last one. Probably within the last year.",
   "created_utc": 1691471728,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9h4p1",
   "message": "Last Wednesday when I had a stomach bug.",
   "created_utc": 1691471946,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9hab0",
   "message": "Three weeks ago, taking a multi vitamin on an empty stomach",
   "created_utc": 1691472044,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9hws6",
   "message": "A few hours ago. I have cyclical vomiting and didn’t get to my anti-nausea meds in time and puked in my friends dads car. I still feel so bad. I could have asked to pull over or rolled down the window but nope. I feel so bad and it was very mucusy so it looked worse then it was.",
   "created_utc": 1691472451,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9i1bc",
   "message": "Was violently sick with a flu/sinus infection for almost a month, where it periodically got better then worse and better again. After four days of almost no food, dozens of cough drops, and snot running down my throat into my stomach, I threw up whatever that all was. Awful. I actually prefer hangover vomit to this.",
   "created_utc": 1691472535,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9i4h6",
   "message": "I think it was mid may. Salmonella tainted flour…",
   "created_utc": 1691472593,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9i9py",
   "message": "Yesterday, actually. I ran out of my Seroquel so I had to miss it for a night, and I suppose I had withdrawal symptoms.",
   "created_utc": 1691472690,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9id2z",
   "message": "My first time cleaning fresh poop out of the litter box. Didn't realize you're suppose to let it sit there for a bit.",
   "created_utc": 1691472752,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9ir6a",
   "message": "Last month, few times. From overthinking and being overly concerned.\n\nEdit - and today",
   "created_utc": 1691473008,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9is33",
   "message": "I threw up in an Uber for the first time a few months ago. Very embarrassing. I walked the rest of the way to my AirBnB; I tipped the driver as much as the app would let me; and I paid the extra cleaning charge with no dispute.\n\nAlcohol... The damn bartender offered me free drinks once I decided it was time for me to stop buying drinks. It put me over the limit. This is usually the story.",
   "created_utc": 1691473025,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9itb0",
   "message": "Last year had the stomach bug",
   "created_utc": 1691473047,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9j4nn",
   "message": "2 weeks ago at Bali due to excessive alcohol consumption",
   "created_utc": 1691473264,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9j8ld",
   "message": " Last night. Woke up with menstrual cramps so bad for several hours… I got nauseas from the pain and vomited.",
   "created_utc": 1691473340,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9jc3g",
   "message": "January, went to KFC and got food poisoning",
   "created_utc": 1691473408,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9jdly",
   "message": "I got the flu A and it made me cough until I threw up.",
   "created_utc": 1691473436,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9jdm8",
   "message": "Around 5 years ago.",
   "created_utc": 1691473436,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9jivw",
   "message": "some unspecified stomach bug like a year or so ago",
   "created_utc": 1691473537,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9jtti",
   "message": "Idk something emotional ???  Gets me every time",
   "created_utc": 1691473749,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9k01d",
   "message": "I have, in the last bouts of vomiting, exclusively been blacked out. I would vomit incessantly, according to friends, and would wake up feeling relatively neutral, with very mild hangovers. My body would empty the tank 100% if I drank too much. I’m sure that if I wanted to vomit again I could just drink my protein shake with my whole tongue exposed.",
   "created_utc": 1691473869,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9k827",
   "message": "I puked a little in my mouth when I burped",
   "created_utc": 1691474022,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9k8pn",
   "message": "Last week smoking weed lls",
   "created_utc": 1691474035,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9kbal",
   "message": "Saturday to make a migraine stop",
   "created_utc": 1691474085,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9kezl",
   "message": "7 or 8 months ago, went out drinking and ate a bunch of greasy food afterwards, went to cough and projectile vomited instead, in hindsight it was a terrible idea but drunk me was really craving a burger at the time",
   "created_utc": 1691474158,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9kf0m",
   "message": "Tequila couple nights ago",
   "created_utc": 1691474158,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9kfco",
   "message": "Stomach bug. Slowly felt ickier throughout the day, was bm-ing like nobody's business but that didnt super concern me, right before i had to leave work i puked. I got hime and spent the next 20 hours puking, shitting, trying to hold down water, and sleeping in a cold dark room. It was eerily similar to alcohol poisoning but instead of a hangover that makes you wish for death i just kept shitting, so you know, better than alcohol poisoning.",
   "created_utc": 1691474165,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9kkje",
   "message": "Pain from passing a kidney stone.",
   "created_utc": 1691474266,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9klpm",
   "message": "Tonight when your Mom spread her legs.",
   "created_utc": 1691474289,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9kmxi",
   "message": "I remember vomiting maybe 4yrs ago. My whole family got sick and I was looking after them. Someone vomited in the sink and didn't wipe up so I caught the bug eventually. It just so happen to be at the end of everyone elses sickness so I had all of them looking after me from then on.",
   "created_utc": 1691474313,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9knul",
   "message": "I woke up hung over and chugged a bunch of milk, per my usual. I went to work, got my period, and got some pretty bad cramps. It was humid. All things that intensified my nausea. Several times I talked myself out of puking but finally I ended up going outside in the pouring rain to puke up chunky milk. Worst.  Throw up. Ever. Thankfully I live in the same building I work in so I went up, showered while puking some more, and changed my clothes. When I got back my boss didn't know I had even been gone.",
   "created_utc": 1691474332,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9ko1l",
   "message": "The first time I remember vomiting outside of being sick or a baby, was when I ate a 4 inch (10cm) spicy pepper of some kind as a kid without knowing just how spicy it would be. I liked spicy foods and enjoyed hot sauce a lot. I was like 11 or so, and ate an entire loaf of bread, drank a gallon and a half of milk, and proceeded to repaint my uncles bathroom a sickly greenish white. Ever since I've loved spicy foods even more and my tolerance for spice has risen significantly.\n\nEdit: ADHD brain turned \"last time\" into \"first time\" so enjoy. \n\nThe last time I vomited was a couple days ago because I have issues with my insides whenever I eat that cause extreme pain in the area around my liver and gallbladder that are so bad I sometimes vomit up whatever I just ate. It used to be so bad that I started losing weight because I threw up every meal no matter how small and could only keep certain thin liquids down. If I watered down a smoothie and then drank it, I was alright, but drinking the same volume of liquid as just a smoothie would cause the same pain and subsequent vomiting. Urine samples showed proteins in my urine, ultrasound showed no abnormalities with my gallbladder, and a slightly fatty liver but nothing that accounts for the extreme levels of pain I still experience. This pain is ongoing and has been happening for a little more than a year, but I very rarely vomit anymore luckily.",
   "created_utc": 1691474336,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9kqj8",
   "message": "Back in March. \n\nI was home alone during a blizzard with my wife 2,000 miles away, and I just had a bad panic attack because a giant tree branch fell and missed our roof by a few inches.",
   "created_utc": 1691474386,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9ksy2",
   "message": "3 hours ago. For some reason my stomach has like 20-30 ounces of mucus every morning that irritate my stomach. So I vomit every morning for about an hour to get it all out. Never see any bile.",
   "created_utc": 1691474433,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9kv7d",
   "message": "I ate this HORRIBLE vegan gluten free quiche. Kept things down most of the day. Cleared things out right before sundown.",
   "created_utc": 1691474477,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9kykb",
   "message": "My roommate made bomb ass food and I ate too much lol",
   "created_utc": 1691474542,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9kzkl",
   "message": "3mos ago, d/t migraine",
   "created_utc": 1691474561,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9l0rd",
   "message": "Last week at the dentist. Under nitrous oxide for procedure to remove three teeth. I accidentally gulped air through my throat instead of my nose, which made me lose the nitrous too fast and I threw up.",
   "created_utc": 1691474584,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9l3e6",
   "message": "Food poisoning, store bought ceviche.",
   "created_utc": 1691474638,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9lfaf",
   "message": "I *think* it was like 2011. Binge ate so much that my stomach just stopped moving anything. Rolled around in bed in terrible discomfort for about 5 hours before vomiting up an entire large order of completely undigested potato wedges. Then I rolled around in pain for 5 more hours.",
   "created_utc": 1691474866,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9lptp",
   "message": "A few months ago at Pride. Had waaaay too much to drink.",
   "created_utc": 1691475072,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9m0sw",
   "message": "6 days ago, due to fever",
   "created_utc": 1691475289,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9m7e7",
   "message": "Migraine. \n\nI could likely have resisted it but I just gave up and wanted to feel a bit less nauseous.",
   "created_utc": 1691475422,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9mcu2",
   "message": "About 2 years ago. I got food poisoning from shrimp and I haven’t eaten shrimp since. Which is unfortunate because I love shrimp.",
   "created_utc": 1691475531,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9mebq",
   "message": "A few months ago. Alcohol was involved.",
   "created_utc": 1691475561,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9mi74",
   "message": "A couple weeks ago. I tried to try shrooms for the first time and instantly barfed them up. Now I know lol",
   "created_utc": 1691475636,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9min6",
   "message": "I haven’t in close to 10 years, but I had a bad pizza, like I think it had expired or something",
   "created_utc": 1691475645,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9mjkw",
   "message": "Last year. Used to drink heavily until I started puking it up all the time. 0/10. Would not be an alky again. 1 year sober as of this week I think.",
   "created_utc": 1691475664,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9mjv8",
   "message": "March of 2010, had a stomach virus. Hoping to keep the vomit free streak going as long as possible.",
   "created_utc": 1691475670,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9nimg",
   "message": "The last time I can remember is because my shunt needed replacing (I have hydrocephalus).  Along with the rest of the symptoms, I vomit over and over and over (when my body is finished, I don't even have stomach bile left).  It's violent, and exhausting.",
   "created_utc": 1691476382,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9nlh6",
   "message": "This morning at 3-5 am. Coke binge",
   "created_utc": 1691476443,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9nljt",
   "message": "About 8 months ago, alcohol abuse",
   "created_utc": 1691476444,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9nqc5",
   "message": "Earlier in the year from too much alcohol on an empty stomach. Puked all over my friend's hand and car.\n\nFriend was super cool about it, though, and now we're partners, so I guess that worked out.",
   "created_utc": 1691476542,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9nrek",
   "message": "I got scammed for Taylor Swift tickets from someone who I thought was my friend and I cried so hard that I threw up from how upset I was",
   "created_utc": 1691476565,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9nvkg",
   "message": "hit myself in the belly",
   "created_utc": 1691476650,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9o38l",
   "message": "4 weeks ago.Continuous coughing and spitting mucus from a viral chest infection... Gets to the point you bring up anything you ate 30 mins beforehand.",
   "created_utc": 1691476811,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9o64i",
   "message": "I’ll you a story of when I vomited after a strange dream. I was walking down a dark sidewalk in a large kind of like, futuristic city with a man in a suit. He was well dressed and had a suave voice. He said to me. “You can come with me now. End your journey here. Or you can keep going. Either way you’ll find out what happens. I’ll ask you this question again in… about another 15 years.” I said to him. “Well… let’s it through to the end.” The man sighed and said. “I should have known. Alright. I’ll send you back. But… er… you’re not gonna feel so good.” I woke up and immediately started vomiting all over my bed. This happened when I was 15, I’m 28 now. So we’ll see if he comes back.",
   "created_utc": 1691476874,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9o6v0",
   "message": "About two weeks ago when I had a gallstone attack",
   "created_utc": 1691476890,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9o9fy",
   "message": "A couple weeks ago from migraine pain.   First time ever for that one. Woo?",
   "created_utc": 1691476942,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9oe1k",
   "message": "More than fifteen years ago I had a barley and venison stew. It took me about ten years to have barley stew again. I've had  venison since but not in stew.\n\nI have no reason to expect it was the stew. That's just how I am about throwing up",
   "created_utc": 1691477039,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9ojxo",
   "message": "4 months ago. The most stupid reason you could think of:\n\nhttps://www.hot-chip.eu/challenge\n\nSome people just take a bite...me? The whole thing into my mouth at once. I vomited, i had cramps, it felt like i was burning inside and the morning shit next day was the most painful shit i ever had. But i survived! 10/10. Would recommend it.",
   "created_utc": 1691477162,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9old7",
   "message": "Earlier this year, I accidentally took two doses of aspirin too close together.  I ended up puking into my bathtub while sitting on the toilet, shitting my brains out.",
   "created_utc": 1691477192,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9oofx",
   "message": "3 years ago. Got drunk because wife was DD. Fun night(for me.)",
   "created_utc": 1691477257,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9p5m2",
   "message": "when i had some food poisoning recently. woke all sweaty and in pain in the middle of the night, normal i dont vomit, this was forceful expulsion and i felt better instantly.",
   "created_utc": 1691477610,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9p8ov",
   "message": "It was a month a go, i drank too much and it was my second time drinking.",
   "created_utc": 1691477676,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9pdea",
   "message": "A couple weeks ago. Pregnancy. I just deal with nausea without puking most of the time. It sucks all around.",
   "created_utc": 1691477775,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9pg3f",
   "message": "Two months ago, too much beer",
   "created_utc": 1691477831,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9plno",
   "message": "End of 2017, got some kind of gut infection around Christmas. I think it was campylobacter. 8 days of cholera-like diarrhea: shitting water, zero appetite, and unrelenting intestinal cramps. Threw up a bit on the second and fourth nights, the latter after I tried eating greasy food before my gut was ready to accept it. I subsisted entirely on Gatorade for much of that week.\n\nBone broth quickly set me on the road to recovery once my appetite began to return. It was a miserable week, and it took a few more days for my energy to return. I remember being too weak to walk down the block. \n\nI’m emetophobic, so puke is literally my worst fear.",
   "created_utc": 1691477946,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9pnyl",
   "message": "Couple of years ago, good ol stomach flu. I don’t think anything except the stomach flu has ever made me puke, I have a pretty strong stomach.",
   "created_utc": 1691477995,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9pofk",
   "message": "I’m allergic to propylene glycol and they kept giving me colace at the hospital. 🙄",
   "created_utc": 1691478005,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9pqnv",
   "message": "Maybe like last week and just felt queasy from breakfast like I drank too much water afterwards so it was just sitting in my throat.",
   "created_utc": 1691478051,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9pz2y",
   "message": "Last week. Ate a whole carolina reaper on a dare, drank a ton of milk, got so bloated that I had to throw up twice.",
   "created_utc": 1691478226,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9q1sn",
   "message": "Last week while I was in Greece. I vomited so violently it came back out of the toilet and covered me. Not the best holiday I've ever had.",
   "created_utc": 1691478283,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9q8f6",
   "message": "Two months ago.  Had the flu, and there was some violent coughing.  But no blood this time, so I'll take that for a win!",
   "created_utc": 1691478420,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9qbvl",
   "message": "A couple months ago while I had a cold. One of the long-term side effects of Covid, at least for me, was that now I vomit when I have coughing fits.",
   "created_utc": 1691478490,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9qcu3",
   "message": "Couple of months ago. Migraine. Lost count of how many times I got sick and that was with migraine meds trying to Steve things off. \n\nAny time I puke from migraines I bruise my ribs and strain my neck muscles, it’s so forceful. \n\n0/10 would not recommend",
   "created_utc": 1691478511,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9qf4l",
   "message": "Tried out that new sushi place. \n\nDidn't order there ever again.",
   "created_utc": 1691478560,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9qqyf",
   "message": "About 2 years ago I think... Thought it was covid, ended up just being a bad case of fever.",
   "created_utc": 1691478810,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9qugk",
   "message": "Maybe a few years ago too much alcohol.",
   "created_utc": 1691478884,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9quoo",
   "message": "2-3 days ago, I got a little something stuck in my throat and after coughing for like 10 minutes I started heaving",
   "created_utc": 1691478888,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9qv2q",
   "message": "A few months ago, got food poisoning. Went to a restaurant for dinner, and woke up next morning spending 3 days frequently at the toilet.",
   "created_utc": 1691478897,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9qvkv",
   "message": "Sometimes I vomit when I am trying to fall asleep, if I make the mistake of eating too close to the time I go to bed.",
   "created_utc": 1691478908,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9r1p0",
   "message": "vegas. drank too much. uber had to pull over.",
   "created_utc": 1691479042,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9r1w5",
   "message": "Two years ago when my appendix was perforated",
   "created_utc": 1691479046,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9r2nx",
   "message": "When I had a kilo of pure Peruvian",
   "created_utc": 1691479063,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9r4uz",
   "message": "I'm not a big drinker, like, at all. I drink Camelot mead and Mikes Hard, and even then maybe a few times a year.\n\n\nI made a copy cat recipe of a mixed cocktail, it was really good. Basically spiked strawberry lemonade.\n\n\nMy husband made me a second glass, and was pretty generous with the alcohol...and he brought me a straw. How thoughtful...and he brought me another glass once I had downed that one.\n\n\nI'm not sure how much alcohol I sucked down in rapid fire succession, but it absolutely fucked me up. I was trashed. Laughing at the absolute dumbest shit, peed myself a little, couldn't walk straight to save my own life.\n\n\nThe fun times were over pretty quick, and Mr Brought Me a Straw got to hold my hair back while I puked up strawberry puree, Cointreau, and Deep Eddy Lemon Vodka all night.\n\n\nThis was about a year ago, and I still can't stomach the thought of drinking any alcohol.",
   "created_utc": 1691479110,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9r6l8",
   "message": "This time last year, was in Cambodia and bored of the treated water so drank 4 coffees in the space of half an hour then threw them all back up again 😅 haven't drank coffee since, sticking to tea instead",
   "created_utc": 1691479146,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9r7sh",
   "message": "Like two weeks ago. Pregnancy be like that.",
   "created_utc": 1691479171,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9r92d",
   "message": "Last time I vomited was about 5-6 years ago. I have an iron stomach but sadly, the breadbowl I had (bought it at work) that day forced me to literally projectile vomit twice on my bed in the middle of the night.",
   "created_utc": 1691479198,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9rf0z",
   "message": "About 2 weeks ago from a new medication.",
   "created_utc": 1691479325,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9rj13",
   "message": "Two days ago. I have covid (again) and coughed until i yarged",
   "created_utc": 1691479412,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9rjlu",
   "message": "Had a stomach virus. Threw up three times in the span of 24 hours and was in \"can't trust a fart\" mode. Carried the bucket to the bathroom with me because I've had a both ends moment in there before and it was not pleasant!",
   "created_utc": 1691479424,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9rrey",
   "message": "a little over a week ago. period pain/nausea. it feels like i get food poisoning every month.",
   "created_utc": 1691479592,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9rs7e",
   "message": "Last time I binged (\u0026amp; so made myself sick). The joy of disordered eating.",
   "created_utc": 1691479610,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9rtnn",
   "message": "Can't remember. I'll do anything to not throw up.",
   "created_utc": 1691479642,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9rv8p",
   "message": "About a month ago cause I was hungover",
   "created_utc": 1691479677,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9sbxs",
   "message": "A few hours ago. Asshole puppy chased me around with a half-eaten almost-duckling. I'm a biologist with a freezer full of dead shit but rotten eggs and dead ducklings are my kryptonite.",
   "created_utc": 1691480039,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9scmb",
   "message": "few weeks ago out back behind the dumpster at work. super stressful night, it was hot in the back, and i just went outside and bam.",
   "created_utc": 1691480053,
   "score": 1,
   "submission_id": "15l5t9e"
  },
  {
   "comment_id": "jv9xxqn",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15l5t9e"
  }
 ]
}