{
 "submission_id": "15l658c",
 "title": "What's should a person do with their life if they have no natural talents or inclinations towards anything?",
 "selftext": "",
 "created_utc": 1691465043,
 "permalink": "/r/AskReddit/comments/15l658c/whats_should_a_person_do_with_their_life_if_they/",
 "score": 101,
 "url": "https://www.reddit.com/r/AskReddit/comments/15l658c/whats_should_a_person_do_with_their_life_if_they/",
 "comments": [
  {
   "comment_id": "jv9537r",
   "message": "Keep living your life, keep working, don't think so much",
   "created_utc": 1691465120,
   "score": 117,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv957kj",
   "message": "Learn something. Pick a thing, any thing.",
   "created_utc": 1691465182,
   "score": 69,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv959yx",
   "message": "Be a delivery driver. UPS will more than likely pass their new contract and drivers will be making $49/hour.",
   "created_utc": 1691465216,
   "score": 32,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv95ryx",
   "message": " \\[no natural talents or inclinations towards anything\\]  \u0026lt;-- this is a false statement - and its a statement about yourself, which when you type it or say it, you begin to believe, and which makes you weaker. DO NOT say things that make you weaker. Start with an interest, which you DO have - and pursue it - that will give you skills - some of which you already have - do not lie to yourself about being talentless - that is a path of self destruction - and NOBODY can help you unless you also help yourself",
   "created_utc": 1691465470,
   "score": 31,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv950ao",
   "message": "Get into politics",
   "created_utc": 1691465079,
   "score": 23,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv957w9",
   "message": "Go to Community College and/or Career Counseling. You find *something*",
   "created_utc": 1691465187,
   "score": 8,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv96zik",
   "message": "Learn. Learn something anything. We are creative creatures it is in our very nature to be inquisitive and curious. So you may zero talent but you maybe gifted at learning. Find a hobby you love and learn everything about it.",
   "created_utc": 1691466089,
   "score": 28,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9cwzp",
   "message": "Trades. And be responsible to your family.",
   "created_utc": 1691469345,
   "score": 6,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv955vy",
   "message": "Get into a trade. Plumbing and air conditioners will always need fixing.",
   "created_utc": 1691465159,
   "score": 16,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9555c",
   "message": "I’d recommend them to stop lying to themselves",
   "created_utc": 1691465148,
   "score": 6,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv96w5o",
   "message": "It's never too late to explore, experiment and embrace life's whimsical journey of finding unexpected passions, because even amid supposed talents and inclinations lies the exhilarating possibility of unlocking undiscovered potentials.",
   "created_utc": 1691466042,
   "score": 5,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv99t22",
   "message": "Not everybody is meant to serve a great purpose or be extraordinary.  I would just find happiness in everyday life.  Find a job you don't mind doing, that pays the bills and find a hobby you enjoy.",
   "created_utc": 1691467591,
   "score": 9,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9ck5f",
   "message": "Try stuff = Challenge yourself",
   "created_utc": 1691469137,
   "score": 4,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9dclq",
   "message": "Natural talents are mostly a lie. Sure, you could be genetically predisposed to be good at something but 98% of the skill to get good at anything for the majority of people will come purely from experience and time. If you want to learn a new talent then go for it!",
   "created_utc": 1691469603,
   "score": 3,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9fd5h",
   "message": "Better start enjoying the art of trying new things. \n\nThere is SO much out there.",
   "created_utc": 1691470824,
   "score": 8,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9fiti",
   "message": "Talent is a bullshit word. If you want to get good at something, practice.",
   "created_utc": 1691470922,
   "score": 27,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9fo95",
   "message": "Everyone has a natural talent. It just has to be revealed.",
   "created_utc": 1691471015,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9hoh0",
   "message": "No one has natural talents or inclinations. People simply develop their skills through experience. If you don’t know what you wanna do just pick something marketable. Go to trade school or something and get a stable job. Then figure out your passions later.",
   "created_utc": 1691472299,
   "score": 5,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9hqeb",
   "message": "Be of service.",
   "created_utc": 1691472333,
   "score": 4,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9i5z4",
   "message": "There is no such thing as no natural talents.\n\nFor me, I had try many many different jobs, found out what I can learn and master, and what I can't.\n\nPart of the process of life.",
   "created_utc": 1691472621,
   "score": 2,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv94zk6",
   "message": "Work on their character. Worth more than any talent",
   "created_utc": 1691465069,
   "score": 6,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv95dr9",
   "message": "Teach.",
   "created_utc": 1691465270,
   "score": 255,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9f99v",
   "message": "High end escort…. Warning ugliness may vary lol",
   "created_utc": 1691470756,
   "score": 255,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv97y7f",
   "message": "Sometimes, to find our true passions and talents, we've got to venture outside our comfort zone and explore various hobbies in a fun, open-minded way - you never know what might light that inspirational spark within you!",
   "created_utc": 1691466595,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9639u",
   "message": "AOC was able to get into Congress. Maybe it’ll work for you too.",
   "created_utc": 1691465629,
   "score": 251,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9ceoz",
   "message": "Try skydiving sans parachute",
   "created_utc": 1691469050,
   "score": 255,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv95h40",
   "message": "Work as an office drone.",
   "created_utc": 1691465318,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv95qow",
   "message": "Don't underestimate the power of curiosity and exploration – sometimes, discovering unexpected interests or talents can aplify life in ways you never thought possible! 💫",
   "created_utc": 1691465451,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv98y3y",
   "message": "Run for president. All you have to do is put a D or R next to your name and 60 million people will vote for you.",
   "created_utc": 1691467126,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv999dm",
   "message": "There is some testing you can get that will tell you what you are good at.  It could be helpful.",
   "created_utc": 1691467295,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv99d8d",
   "message": "[deleted]",
   "created_utc": 1691467353,
   "score": 0,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv99xyn",
   "message": "Join one of the trades.",
   "created_utc": 1691467666,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9a51f",
   "message": "There s video of how to everywhere , pick something u like and learn it",
   "created_utc": 1691467773,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9bg0a",
   "message": "You don't need natural talent! If you feel like painting or making music or anything creative just start doing it! \n\nThe tough part of creativity is getting started. Its normal to think there is no point trying since you're not good, but remember you're not trying to make art in order to become famous. You're making art to enjoy the experience of doing it!",
   "created_utc": 1691468500,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9d9pn",
   "message": "Sit's on your couch and watch's TV.",
   "created_utc": 1691469555,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9db5z",
   "message": "Reddit mod.",
   "created_utc": 1691469580,
   "score": 2,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9dl27",
   "message": "Postal carrier.  You'll get lots of exercise which is good for mind and body.",
   "created_utc": 1691469742,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9dods",
   "message": "Learn a profitable skill (Trades or Medical like X-ray tech), a creative hobby (pottery or an instrument) and develop skill in a sport (team sport like curling, cycling or soccer).",
   "created_utc": 1691469797,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9drzt",
   "message": "Help others, look for happiness and work on you until you find the thing you want.",
   "created_utc": 1691469856,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9e195",
   "message": "Not sure I believe that anyone could have no natural talent in any field but I would resort to whatever made said person smile.",
   "created_utc": 1691470011,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9e7yu",
   "message": "YouTube influencer",
   "created_utc": 1691470124,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9ebbw",
   "message": "Make money. If you're not being pulled by any compelling force in any particular direction, just make reasonable life choices with an eye on maximizing financial gain. If/when you do find a calling or a hobby or whatever, you'll have more freedom to pivot to it if you spent your lost years building wealth.",
   "created_utc": 1691470179,
   "score": 4,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9f18q",
   "message": "Do the work most people refuse to do.\n\nThis could be something like being a trash collector, a firefighter, plumber, etc. \n\nThey will generally always pay enough to have what you need and there are always jobs in those lines of work.",
   "created_utc": 1691470617,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9f1nq",
   "message": "Run for president.",
   "created_utc": 1691470624,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9fb9u",
   "message": "For hobbies-Natural talents take years and decades to develop. What are you interested in? Try not to think about what you would like to do, but what you enjoy doing, when nobody is looking. \n\nFor work- if you make your passion your day job, it won't be your passion anymore. Some people are able to combine the two, I never have. Find a career to fund your passion",
   "created_utc": 1691470792,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9ff6a",
   "message": "Volunteer to pick up garbage at the bottom of the ocean.",
   "created_utc": 1691470859,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9fkv4",
   "message": "Keep a good attitude. I'm not talented or super smart. But because I've kept a good attitude; along with being honest and trying to stay humble; I've been able to go from homeless to having my own apartment, license-less to owning my own car, from 600 credit to 700+, from entry level retail to salaried aministrator. Friends, opportunities, all those things come only when I've got a good attitude",
   "created_utc": 1691470958,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9g32l",
   "message": "Learn about money and investing, then go get any job and invest most of your money. In 10-20 years, you'll have enough money to live comfortably for the rest of your life.",
   "created_utc": 1691471273,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9g692",
   "message": "Get a government job. It's decent pay, easy work and pretty damn stable.",
   "created_utc": 1691471329,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9gd4u",
   "message": "Construction. Doesn’t take much talent, and there’s lots of money to be made if you were to be come experienced enough to run a business. Pick a trade, pick a union, and become a journeyman. Takes 4 years and you get paid for all of it excluding voluntary trainings. Even if you never start a business you should live pretty well, particularly if you live in a warm climate where construction happens Year round.",
   "created_utc": 1691471451,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9gq4p",
   "message": "Deliver mail or be a plumber.",
   "created_utc": 1691471681,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9hcgs",
   "message": "Learn to type.",
   "created_utc": 1691472082,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9hm5y",
   "message": "Be President of the United States",
   "created_utc": 1691472256,
   "score": 3,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9i0z5",
   "message": "Construction seems to work for me",
   "created_utc": 1691472528,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9i8s9",
   "message": "Read.",
   "created_utc": 1691472672,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9j0j9",
   "message": "Try out several types of hobbies. Try one every couple of months. Not all cost a lot of money. Depending on where you live, there could be free things to do. \n\nPublic libraries sometimes have free classes, events, and hobby groups. I randomly encountered a Firefly (tv show) fan group at one and they were nice. I let my now-retired former coworker know about them and it’s her main social circle now and she does all their events. \n\nAlso see what free events your city might have going on. One time my city put on an educational event on owls and who knew — a great time was had. (In before someone asks if it was a hoot. But yes it was.)\n\nThere are meetup sites that’ll give you ideas. Outdoor stuff. Theater groups. Comedy groups. Birdwatching (which I’m told is much more fun than one would think). Dance groups. Tricia teams. Star Wars fan chapters. Etc.\n\nSo try things and see what sticks. I like doing things alone but don’t mind exploring interests with others. See what suits you in that regard. You might find that you haven’t been able to find that you like because you’ve only ever tried with others or alone.\n\nAnother idea is to take time to think about someone you really admire/think is cool/think is enjoying life. Do some of those same activities if you’re able, or adapt them to make them accessible. \n\nI don’t have any huge plans for myself in the immediate, but have decided to just enjoy life in part by exploring what I find fun and interesting.\n\nYou can have fun even though you’re not good at something.",
   "created_utc": 1691473185,
   "score": 0,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9j24j",
   "message": "I personally do think some people are just born with talent. But for those who aren’t, there’s the art of discipline. Waking up for work not looking forward to going into work comes with ANY job. It just ebbs and flows like anything else in life. You go into work though…because discipline is simply the difference between what I want now and what I want most (Yohann Hari). \n\nAfter working in kitchens my whole life I knew I needed to be in a career where I was making a difference in the world which is why I chose my healthcare profession. \n\nIf you too like helping people maybe start out as a CNA at a hospital. Then hospitals normally have programs to advance your career and will either pay for most of your schooling or the classes you have to take to become certified. Right now the hospital I work at pays people hourly to go to school to become an OR tech. \nThey (OR Techs) make baseline over 100k a year setting up the OR for surgeries and assisting the surgeons. 3 12hr shifts a week. It’s a pretty sweet gig if you aren’t squeamish.",
   "created_utc": 1691473217,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9jf2k",
   "message": "Pick something and do it.\n\nNO ONE naturally has talents that are useful to employers without hard work and intentional development and thoughtful decision. That concept is a huge myth and is just something other people on the outside think when they see someone successful. They may have liked something, but it was hard work, the discipline to make a choice and stick with it, and years of study that actually made that person useful and employable.\n\nNow for those who don't think they like anything enough to choose, or don't feel \"called\" to any specific field or job, they usually wind up in a torporous state of self recrimination. What they need to realize is that a job is not a marriage. \n\nThere is no \"one\" thing they were meant to do. This mistaken belief can lead people to believe that if they pick badly they will be forever miserable. What they actually are doing is making themselves miserable. They just need to pick something.\n\nIn fact, it can be a blessing to NOT feel strongly pulled to a specific job. A person can unencumber themselves from the baggage of hoping to do the absolute perfect job they love, only to spend years studying it, racking up tons of debt, and then finding themselves under- or unemployed because they followed a \"passion\" instead of making a pragmatic decision to pick something that is highly employable and lucrative.\n\n\"Passions\" are for personal time, not a career, for two reasons. First, I've made the case this often leads people astray. Secondly, the surest way to turn something they love into something they hate is to have to do it for someone else, their way, for too little money, for too many hours per week. \n\nResearch jobs, training pipelines, employment data, earning potential. Then pick one you can tolerate. Then put one foot continuously in front of the other in that direction.",
   "created_utc": 1691473464,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9jg1l",
   "message": "Get a hobby like golfing or travel. Or just try a bunch of different things and you’ll eventually find something that works.",
   "created_utc": 1691473482,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9jm50",
   "message": "Pick a thing that you don't hate, work hard to excel at it.\nBest case - you'll end up loving it\n\nWorst case - you can still make money off it",
   "created_utc": 1691473601,
   "score": 2,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9k1dh",
   "message": "I found a well paying job that didn't require qualifications, shot myself in the foot, and did it again 2 more times.\n\nThrough that, I bought myself a place and live fairly comfortably.",
   "created_utc": 1691473895,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9k5fq",
   "message": "You have to eat them raw ? Mm",
   "created_utc": 1691473971,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9kdv9",
   "message": "Remember that no one has natural talents and everyone that seemingly does thinks they fuckin suck. So don’t beat yourself up when you don’t shred guitar because the guy who can has practiced that particular thing for 8 hours a day for 6 months.",
   "created_utc": 1691474135,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9kfmd",
   "message": "Can't help you I'm 33 and still haven't figured it out.",
   "created_utc": 1691474170,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9kj9v",
   "message": "Do stuff , there is nothing after so might as well do anything",
   "created_utc": 1691474240,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9kl7o",
   "message": "Enjoy yourself. Enjoy who you are. \n\nWe all feel this at some point but the truth is that I fear you may actually be sane. You’re falling victim to the depression of self realization. This world is built for those who submit to it. You aren’t satisfied with embracing a life of compromise. \n\nDon’t compare yourself to others or punish yourself for what you haven’t done. Stop trying to control how others see you and find out who you are. If you’re on reddit then I’m sure you have found some interests. \n\nYour natural abilities don’t lie in the areas that you seem to have a “natural” skill. They don’t depend on the recognition of others. Natural ability is a shadow cast by the natural curiosity. Every prodigy is the result of obsession and single minded drive. \n\nI’ve felt how you’ve felt and even asked this exact question. Then I realized that all your anxiety and fear is an illusion. You can set it down at any moment. Meditate. Just breathe. When your mind wanders don’t get upset. When you realize your mind has wandered, smile, forgive yourself and breathe. Just focus on the feeling of the breath entering and exiting your lungs. \n\nForget ability and inclination. Embrace curiosity. Slake that curiosity endlessly. \n\nI bet you’re a dope person. You’re probably intelligent too. Having a mindless job isn’t a bad thing. It frees up your mental resources for your passions. Just try to explore. Try art, music, astronomy, writing, whatever your mind craves.",
   "created_utc": 1691474279,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9kolm",
   "message": "\"just be better \"",
   "created_utc": 1691474348,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9l1yy",
   "message": "Try to find things you like. You don't need talent to paint etc, you just need to enjoy the activity.",
   "created_utc": 1691474609,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9l9tj",
   "message": "The person who has no natural talents or inclinations towards anything should do the same thing as the person who has ENDLESS talents and is driven towards EVERYTHING....\n\n\nServe others.\n\n\nThere's no higher calling.\nThere's nothing more satisfying.\nThere is nothing that will fulfill you more or leave you on your deathbed happier or more content with all you've done.\n\nTo do for those, that which they cannot do themselves. To serve, what the Bible refers to as \"the least of these\". This requires no talent, and no inclination other than love.",
   "created_utc": 1691474762,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9l9w5",
   "message": "It doesn't matter if you're talented or not, if you enjoy doing something, then do it.  Look at what interests you and if you decide you'd like to try it, go for it.  One of three things can happen; you pick up a new hobby, you get really good at you're new hobby, or you decide it isn't for you.  No matter what you decide to do, you should whole-heartedly enjoy it.\n\nAnd if that doesn't work, just jack off or something, I don't know.",
   "created_utc": 1691474763,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9lcsl",
   "message": "Become a railroader. You get paid to stare out windows and to sleep. Kids and some adults will idolize you.",
   "created_utc": 1691474819,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9lpmb",
   "message": "Keep trying new things until you find out where your talents lie. Keep going until the end.",
   "created_utc": 1691475068,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9n62v",
   "message": "Go enjoy it you have 2 legs so travel and hike while you still can, your eyes are still functioning so get out and watch some movies, go to the theater or an opera, he'll your ears are still working so visit some concerts, and try talk to as many people from as many different walks of life as possible.\n\nIt might seem like the talented have an advantage when they start out their life. But that changes as you get older, if you don't live your life and experience anything then you just waste it away.\n\nBeen working with a lot of older people and there's a big difference between the people who lived their lives and the people who just worked and meandered through it. If you can try to give everything a go at least once with in reason.",
   "created_utc": 1691476125,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9wbq0",
   "message": "A political career.",
   "created_utc": 1691483225,
   "score": 2,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva2eaj",
   "message": "Run for political office.",
   "created_utc": 1691488051,
   "score": 2,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9npfb",
   "message": "Get over this mindset. Plenty of people aren’t ‘natural talents’ in whatever they end up profitably doing for their career. Arguably the lack of a ‘natural talent’ will make you work harder at something and be more adaptable, both of which are effectively career superpowers. \n\nAs for inclination look what do you want from life? If you’re able to live off a little bit of earnings/welfare and would prefer to just drift about smelling the roses and reading books at the library just *do that* I don’t really see any shame in a life that’s just lived to enjoy your time on this earth. The issue arises if you want other things more than free time and limited responsibilities. If so try and figure out how much you actually need for that level of lifestyle, then pursue jobs in that income bracket. Like if you need a job that brings in say $70,000 per year (AUD figures) and kinda don’t care what you do maybe do a course in Excel or get a forklift licence or something like that, once you have a little experience in admin or warehousing you’ll be earning around that amount. You’ll be approaching employers with an actual skill and once you’ve got a job you can decide if you like it and if not what it is you don’t like. Let’s say you did the Excel course but find (as I did) you’re not really someone who likes an office environment. Fine, you go get a certificate in something a bit more physical or outdoorsy (maybe do a rope access course) see if you like that. Once you have a hireable skill you will learn other skills on the job. You’ll find something you enjoy at least a tiny bit more than the other stuff. Good, then you have an inclination. \n\nJust don’t sit around doing nothing. People who want the smelling roses/reading books kind of life aren’t ‘doing nothing’ they have hobbies and interests that they want time for. That’s an inclination. At the very least have that.",
   "created_utc": 1691476524,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9nplm",
   "message": "try new things",
   "created_utc": 1691476527,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9ogvx",
   "message": "This is me man.  There is no such thing as a dream job for me.  I did 3 semesters after high school.  That didnt work out.  One morning mu dad said \"today i want tou to write me a report on how you tried to find a job\".  I applied at 2 different places.  UPS called me the same day and got me an interview.  I did the interview and got a job.  My dad asked for the report and i just said \"im working at UPS.  I start in a couple days.\"\n\nSo i worked a UPS for 9 months loading trucks.  It sucked.  9/11 happened so i made a grown up decision and joined the Coast Guard.\n\nDid just under 22years in the CG and my terminal leave started in June which goes until the end of September.  I have done jack shit since i left.  I get on glassdor, indeed, zip recruiter, linkedin and nothing i see sounds fun or interesting.  I feel like that 20 year old sleeping until noon when my dad woke me up and told me to get a job.  Im curious to know when my wife says it.\n\nIm seriously debating on becoming a short order cook at waffle house.  I love the food.  I enjoy cooking.  I can shoot the shit if need be.\n\nYou just need to suck it up and get something done.  Any job is going to suck.  Forna lot of people work is their identity.  I always hated talking my job in the CG.  It was nothing more than a paycheck plus benifits.\n\nWish you the best.",
   "created_utc": 1691477098,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9p368",
   "message": "Work hard to become good at something",
   "created_utc": 1691477559,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9peld",
   "message": "Try to find something that you like doing so at\nLeast you don’t hate the job. I would recommend forcing yourself\nTo try something new once a month to broaden your horizons and maybe you will come across an unknown talent you really didn’t know you had",
   "created_utc": 1691477800,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9qktm",
   "message": "Do a puzzle",
   "created_utc": 1691478681,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9sd3s",
   "message": "Keep trying new things until you stumble onto something you love. You have talents and things you are drawn to, you just haven't discovered them yet. \n\nLife is a journey...",
   "created_utc": 1691480064,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9shdy",
   "message": "Learn and try new things. You will soon find that you do have some talents and preferences.",
   "created_utc": 1691480158,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9sqso",
   "message": "Float through life like a jellyfish",
   "created_utc": 1691480367,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9succ",
   "message": "Try everything and anything until one of them does.",
   "created_utc": 1691480445,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9svqr",
   "message": "I.T. it's so varied if you don't like what you're doing, it's easy to try something different.",
   "created_utc": 1691480476,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9sxtg",
   "message": "Find a nonprofit that helps people in your community in some way and volunteer a couple hours each week. Service to others is meaningful and sometimes provides purpose, as well as a sense of belonging with those around you.",
   "created_utc": 1691480522,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9u3a8",
   "message": "Pick something to do that is useful and might help someone or something flourish somewhat.",
   "created_utc": 1691481453,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9v2hk",
   "message": "You'd be surprised at how helpful it is to take up a new hobby. Sometimes,  you learn a new talent or skill, and sometimes you're inspired to start a new career, and sometimes you even get a brand new business idea. Honestly, the worst-case scenario is that you just find a new hobby.\n\nAs someone who doesn't consider myself to be particularly good at anything, I  get it. I ended up discovering that I am just more creatively minded who went through life being told I wasn't smart or gifted.",
   "created_utc": 1691482219,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9vmk3",
   "message": "You realise you are using Reddit right? Hang out here, watch YouTube and stay in bed.",
   "created_utc": 1691482665,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9w415",
   "message": "Pick up a trade! The world needs plumbers, carpenters and mechanics.",
   "created_utc": 1691483051,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9w476",
   "message": "Software development manager",
   "created_utc": 1691483055,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9wd4o",
   "message": "I always said this: If you don't have an objective, a prupose or inclination in this case, let the search of an objective be the objective itself.\n\nWhen you succeed you will be able to help other people who were In the same situation. \n\nNatural talent helps, but also does practice, learning from good teachers and experience.\n\nCheers!",
   "created_utc": 1691483256,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9wlp3",
   "message": "Natural talent is a load of bullshit for the most part. There's a small percentage of humans who try something for the first time and are automatically great at it. \n\nSo many people are born average and continually work on their hobbies or trade and became amazing at it.",
   "created_utc": 1691483450,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9wqj3",
   "message": "Therapy",
   "created_utc": 1691483562,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9wrqm",
   "message": "Retail",
   "created_utc": 1691483589,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9xt36",
   "message": "Live the life of an NPC. Or a doorstop idk I’m in the same boat as you partner",
   "created_utc": 1691484428,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9xupb",
   "message": "Develop skills. Few people are born with natural abilities. Decide if you have an aptitude for and interest in learning to work with your hands, with numbers, people, tech, food, etc. Figure out a realistic and affordable path to train for that field and give it a try. Never say never.",
   "created_utc": 1691484466,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9yt36",
   "message": "Just keep swimming, just keep swimming!",
   "created_utc": 1691485219,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jv9znh4",
   "message": "Most people, if they have a talent for something, it's just the blue touchpaper that gets lit on their rocket. It's just the start. What I mean is, like, when my daughter was 3 \u0026amp; making finger-paintings, I could see that unlike what most children that age make, where figures tend to be all head because the brain at that age prioritises facial recognition \u0026amp; expression interpretation, with a tiny body like an afterthought, she was drawing recognisably human, proportional, shapes. We identified that she had a talent for art, so we encouraged her to practise. She drew every day for 15 years. Now her drawings are real art - her realism is almost photorealistic, her cartoons she can draw in a wide range of styles. She's a heck of a good artist now - but when people praise her talent she says \"Talent is almost nothing: I practised this every day for the past 15 years! It's **hard work** that brought me from baby finger paintings to this.\"\n\nSo, here's an idea - either you haven't got any talents or you haven't discovered them. Try stuff out. Decide on a thing you're going to do, and have a good old go at it. Your initial efforts will suck, but ask yourself \"Am I enjoying this? Is the process of doing this fun? Do I want to be good at this, or does it suck \u0026amp; I don't care for it?\" Give yourself a few weeks of concerted effort to get basically competent. If the answer is yes, this is fun, stick with it. If you began to learn guitar today, in 20 years, if you keep up regular practice, you'll be at least a very competent guitarist. Maybe no Yngwie Malmsteen or Steve Vai, but you'll be the kind of person people ask to play a tune at parties. Same with anything. Not everyone has to be Leonardo Da Vinci, but you can definitely be of the same standard as Kevin Eastman drawing Leonardo the ninja turtle. Pick something, or take suggestions from friends.",
   "created_utc": 1691485880,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva0axr",
   "message": "You don't have to be productive, or produce, or be talented at anything. You're fine the way you are. This doesn't mean there is no insentive to grow, learn, and have fun. I'd recommend, just looking to find contentment, enjoy what you can enjoy.",
   "created_utc": 1691486394,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva0n3l",
   "message": "Sounds like what you need is therapy my dude",
   "created_utc": 1691486661,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva175w",
   "message": "Find something you find fun, I was in a bit of a rut like this, overweight and feeling sorry for myself. I started a football(soccer) 5-a-side weight loss league on a whim, and it's some of the most fun I've had. Helped me shift some weight and get some confidence back.",
   "created_utc": 1691487104,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva23ch",
   "message": "die",
   "created_utc": 1691487813,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva2a1v",
   "message": "Pick some skill and keep grinding it till you find the inspiration to do it.",
   "created_utc": 1691487961,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva2yj0",
   "message": "Post on reddit",
   "created_utc": 1691488482,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva30i0",
   "message": "courses, hobbies, just observing your environment and breathing 😌 \n\nrare people has those 'natural talents', they've learned to do the thing X.",
   "created_utc": 1691488525,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva3vwj",
   "message": "Gym",
   "created_utc": 1691489184,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva46up",
   "message": "Join the army / military there you’ll pick up some good skills and find your talents out",
   "created_utc": 1691489408,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva4b60",
   "message": "Become a politician....",
   "created_utc": 1691489499,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva4d4t",
   "message": "Learn how to operate heavy machinery. They are paid pretty well.",
   "created_utc": 1691489540,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva9xlj",
   "message": "Nobody has no inclinations towards anything. You just haven't tried that thing yet.\n\nAnd natural talent is mostly a myth. A talented beginner is worse than someone who started as a talentless one, but got some practice in. \n\nI saw you talking about being bad at learning, but like everything else, that's a skill you can learn. Just find your own way of doing it, and focus on learning something you enjoy first. You'll get the hang of it, just push yourself a little harder than you normally do.",
   "created_utc": 1691493333,
   "score": 0,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva6um6",
   "message": "Become a politician",
   "created_utc": 1691491319,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva6wzw",
   "message": "Government.",
   "created_utc": 1691491364,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva7bzw",
   "message": "Talents are bull. It's a word that people use when they don't understand the hard work that goes into learning something.\n\n\"Talent\" is pushing through the discomfort of learning something you're bad at, at continuing again and again when you fail again and again. It's accepting where you are in your own progress, and deciding to become better at it. It's having the balls to jump into the unknown. It's daring to suck at something.\n\n\"Talent\" not some gift that comes naturally. It's a conscious decision you make over and over.\n\nJust start somewhere. Dare to try, dare to do it. Accept the discomfort and learn to do better. At some point after a lot of hard work, someone will come to you and say \"wow, you're just so talented\" and you'll be annoyed at the assumption that it came naturally.\n\nDo the work. It doesn't matter what the work is. Enmerge yourself in something, anything. Accept the discomfort, the not knowing, the slow progress, the feeling like a failure, and push through. Learn more, become better. Inclination and talent will come after the work.",
   "created_utc": 1691491654,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva9qze",
   "message": "Politics! You're the perfect candidate for any side",
   "created_utc": 1691493218,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jva9xnp",
   "message": "Work hard until they fund a niche. Then work that niche.",
   "created_utc": 1691493334,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvaa55q",
   "message": "Read [this](https://selfdefinition.org/psychology/articles/six-harsh-truths-that-will-make-you-a-better-person.htm) and act on it.",
   "created_utc": 1691493463,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvab2gz",
   "message": "Sales",
   "created_utc": 1691494008,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvac3u8",
   "message": "Keep trying to find what you like. You don't have to make full time job out of it, it can just be a hobby.\n\nYou can go work in something that makes you decent money, and you don't have to love it, just tolerate it for 40-50 hours a week, and do what you really like in your own time.\n\nI know guys who work in high tech as programmers, and on weekends they fix and modify their jeeps to go off roading next week, break their jeeps during off roading, limp home, fix them over next weekend, go off roading, rinse and repeat.\n\nNone of them is a professional mechanic or driver, but it's their passion and hobby, so they are willing to put money, time and effort into it.\n\nSo you can be like those guys. Find an okay job that pays well, and do what your really like in your spare time.",
   "created_utc": 1691494614,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvackaw",
   "message": "Work in the recruitment industry",
   "created_utc": 1691494877,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvacpc8",
   "message": "Study something that makes money. You’ll still be unhappy but you’ll have money.",
   "created_utc": 1691494957,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvadhg3",
   "message": "Pick a marketable skill you can learn and learn it. It's better to go to a job you're just \"okay\" with that pays well than to sit around wondering what to do with your life and then wake up one morning at 40, still living paycheck to paycheck and wondering what happened to your youth.  You'll no longer be a young guy searching but an older guy who never found anything.",
   "created_utc": 1691495400,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvadl97",
   "message": "You’ll find it.   Keep looking.  Try things that make you uncomfortable.  (Safe things).",
   "created_utc": 1691495458,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvae0ob",
   "message": "Pick something you can do well that will make you self sufficient.",
   "created_utc": 1691495692,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvaej4r",
   "message": "You don't need to be some celebrity to have a good life. Find something you are passionate about and enjoy that.",
   "created_utc": 1691495975,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvaemmq",
   "message": "Ask yourself the question, \"What would I do if I knew I couldn't fail?\"  Then figure out how to do that.",
   "created_utc": 1691496027,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvafdyc",
   "message": "Welcome to Reddit modding!",
   "created_utc": 1691496433,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvafjvw",
   "message": "A job you hate.",
   "created_utc": 1691496520,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvafpda",
   "message": "Become a lawyer",
   "created_utc": 1691496599,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvagsph",
   "message": "Do whatever is the most profitable",
   "created_utc": 1691497172,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvahpru",
   "message": "Enjoy what other people have made. Not everyone needs to be a creative. Don't worry that you can't play a musical instrument, just enjoy the music a pro made.",
   "created_utc": 1691497640,
   "score": 1,
   "submission_id": "15l658c"
  },
  {
   "comment_id": "jvai3f6",
   "message": "Find a good therapist. It’s life changing",
   "created_utc": 1691497826,
   "score": 1,
   "submission_id": "15l658c"
  }
 ]
}