{
 "submission_id": "15lcqj7",
 "title": "What is the point to life?",
 "selftext": "",
 "created_utc": 1691485801,
 "permalink": "/r/AskReddit/comments/15lcqj7/what_is_the_point_to_life/",
 "score": 15,
 "url": "https://www.reddit.com/r/AskReddit/comments/15lcqj7/what_is_the_point_to_life/",
 "comments": [
  {
   "comment_id": "jv9zmbc",
   "message": "Reality: no point    \nHumans: acheive pleasure no matter how much pain you endure",
   "created_utc": 1691485854,
   "score": 10,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jv9ztem",
   "message": "There isn't one. There is no point or purpose other than what you invent so invent a good one.",
   "created_utc": 1691486008,
   "score": 6,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva02g2",
   "message": "The point to life is life. People just want it to be more complicated than that.",
   "created_utc": 1691486209,
   "score": 6,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jv9zls7",
   "message": "Cause I really don’t see any. Every day is the same old shit, why even wake up",
   "created_utc": 1691485842,
   "score": 8,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva0yyn",
   "message": "To be.",
   "created_utc": 1691486924,
   "score": 3,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva2ppk",
   "message": "To reproduce. That's the only real point to life. The point to my life is making bread right now. Find a point you like and stick with it until it changes.",
   "created_utc": 1691488294,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jv9zw6q",
   "message": "I don't think their is a point to life and thats why we have to find a meaning in it. Everything you know will eventually be forgotten in the grand scheme of things but I still think my point in life is to just enjoy it. I have passions and goals but if you spend so much time chasing a point other than that I just lose sight of the beautiful view and things you get to experience as a human.",
   "created_utc": 1691486069,
   "score": 2,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jv9zy0o",
   "message": "You make your own point to life you cant hear the other people's point to give it a meaning. Just live and who knows maybe you will find or not!?",
   "created_utc": 1691486111,
   "score": 2,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva1pqj",
   "message": "money.\nand finding something that will make you happy.\nlike more mone-",
   "created_utc": 1691487513,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva20nl",
   "message": "To crush your enemies, see them driven before you, and hear the lamentation of their women…",
   "created_utc": 1691487754,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva2jzs",
   "message": "To live it , dont worry you will not get another chance , or get religions if you can they will tell you you have another way and how to live your life .",
   "created_utc": 1691488175,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva2yi5",
   "message": "The point of life is to set your own goals, and make them happen, or not.  And in the process, try not to wreck it for anyone else.",
   "created_utc": 1691488482,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva358r",
   "message": "The meaning of life is the absence of one.",
   "created_utc": 1691488625,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva37ct",
   "message": "To live it out like its a free trial",
   "created_utc": 1691488668,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva395p",
   "message": "Suffer",
   "created_utc": 1691488706,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva3hrl",
   "message": "to experience, procreate, mess up and learn, people just make it complicated",
   "created_utc": 1691488890,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva3hxy",
   "message": "Life arises due to the random interactions of particles. There doesn't have to be purpose. And I'm glad there's not. I don't want life to have some forced meaning that I have to follow. This way, I get to choose my own meaning. I get to decide what I want to live for.",
   "created_utc": 1691488894,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva3rfn",
   "message": "I phrase it like that:\n\nFor each individual it’s the goal of life to find out their goal in life. \n\nThere is not 1 answer that fits all and everyone I presume. And these goals might change frequently. \n\nIf you are unhappy with where you are in life only 2 options: change your life or change your expectations.(aka accept your life)",
   "created_utc": 1691489094,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva3uta",
   "message": "to die",
   "created_utc": 1691489162,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva41cn",
   "message": "As a 42 yr old man I learned to enjoy all of life and Do whatever makes me happy You die once but You get to live everyday so go live life",
   "created_utc": 1691489295,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva4amv",
   "message": "To make one up, read Man’s Search for Meaning",
   "created_utc": 1691489488,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva4kn5",
   "message": "To have fun. I think only disappointment and existential angst comes from believing life has any meaning. It doesn't. It's just this weird thing that happened to all of us we had no control over. Just go with it and hit as many waterparks as you can before you're worm food. It's a better alternative than agonizing over the answer to a question the universe is never gonna give you. We can spend our lives plucking weeds, but we're still going to go back to 'em, have fun and make good memories. Make your own meaning, because it's the only meaning we ever get.",
   "created_utc": 1691489692,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva4qiu",
   "message": "There is no point to life",
   "created_utc": 1691489807,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva4rvz",
   "message": "Honestly, there is no point. It's just a bag of illusory sensory experiences edited and beautified by memory. But I do like some parts of it. The power I hold over an audience when I talk. The achievement I feel when I run 2 miles. The light heartedness of female company. The sense of unceasing movement when I work towards a goal. There are parts I hate. My depressive tendencies. The undirected, inexpressible rage evoked by traffic. Not having achieved anything significant while your father retires. The fact that nearly everyone you know is pushing a personal agenda.\n\nMixed bag I guess.",
   "created_utc": 1691489835,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva5351",
   "message": "Suffering, there is more pain in life, then pleasure. Pleasure is the cookie we eat, theorgasm that lasts a few seconds. But the pain of Arthritis, for example goes on daily. It is a terrible philosophy but true.",
   "created_utc": 1691490062,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva5gq0",
   "message": "To reddit or not to reddit",
   "created_utc": 1691490332,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva5lkl",
   "message": "depression? fk I dont know",
   "created_utc": 1691490431,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva5ffl",
   "message": "Thank you",
   "created_utc": 1691490309,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva07mr",
   "message": "For me the only time i feel a point to life is when im making other people happy… like my goal in life is to find my forever dude and pour my heart soul and energy into him because just existing for myself is pointless \n\nAlthough im getting older and not trying to dpend the rest of my life looking for someone to spend tge rest of my life with",
   "created_utc": 1691486323,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva0fdj",
   "message": "i have 2 answers: \n\n1: whatever you want yours to be\n\n2: the meaning to every other specie's life: to make more of itself. (disgusting, i know.)",
   "created_utc": 1691486490,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva0hug",
   "message": "you need a transcending reason, it used to be religion and still is for billions, but redditors are too cool for that so you need to find something else, searing for physical goals doesn't work",
   "created_utc": 1691486544,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva0n8n",
   "message": "Kids",
   "created_utc": 1691486664,
   "score": 0,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva1aqn",
   "message": "To crush your enemies, see them driven before you, and to hear the lamentations of their women.",
   "created_utc": 1691487182,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva1mn1",
   "message": "Eat shit die",
   "created_utc": 1691487442,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva0862",
   "message": "IN MY OPINION The point to life is using your God given free will to make the right decisions and accept Jesus as lord and savior in order to conquer death and have everlasting perfect life on the new earth with all your believing family and friends in which there’s no pain, no sadness and no bad stuff. \nIf you don’t believe in God then life is ultimately meaningless and nothing you say, do or think matters even a little bit. Eventually you’ll die and the entirety of existence will completely forget about you. Not only will you be dead but so will your legacy. You could do anything and eventually the world will burn up in the sun and NONE of it mattered anyways. Nothing has meaning and nothing matters.",
   "created_utc": 1691486334,
   "score": 0,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva3wq5",
   "message": "The point is where the sharp bit is.",
   "created_utc": 1691489201,
   "score": 1,
   "submission_id": "15lcqj7"
  },
  {
   "comment_id": "jva5tlo",
   "message": "There probably isn't one. \n\nJust enjoy yourself. It's later than you think.",
   "created_utc": 1691490593,
   "score": 1,
   "submission_id": "15lcqj7"
  }
 ]
}