{
 "submission_id": "15lfece",
 "title": "Why did you get fired?",
 "selftext": "",
 "created_utc": 1691493846,
 "permalink": "/r/AskReddit/comments/15lfece/why_did_you_get_fired/",
 "score": 178,
 "url": "https://www.reddit.com/r/AskReddit/comments/15lfece/why_did_you_get_fired/",
 "comments": [
  {
   "comment_id": "jvabcsd",
   "message": "His wife thought he was having an affair with the office manager.\n\nHe asked me if I thought it was possible that he was having an affair with the office manager. \n\nI said, “It’s possible, but I don’t think you are. I could see why your wife might think so too.”\n\nI was 21 and naïve as hell. Never should have said anything.",
   "created_utc": 1691494178,
   "score": 15,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvacwe4",
   "message": "Came down with bronchitis on a Sunday. The doctor provided a doctor's note and told me to return the following Monday. They terminated me Friday.\n\nEdit: I didn't want to share too much of my business, but people are saying I'm spreading misinformation when that's not true. \n\nI did not qualify for FMLA. \n\nI was sick on a Sunday, informed them Sunday. Called Monday with a doctors note with orders stating I was to return no earlier than the following Monday. My manager told me, \"ok, feel better.\" Friday came around, and I received an email stating I was terminated effective immediately due to absences. This was my first absence. I asked if I qualified for FMLA, no. I asked if I could resign instead because I loved what I did and who I worked with, no. \n\nYou CAN be fired as an at-will employee at any time for anything. I didn't mention the illegal outcomes, as I assumed that was implied with common sense. \n\nAnyways, thanks for the input, y'all.",
   "created_utc": 1691495071,
   "score": 11,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvabmza",
   "message": "I got fired once for putting in my 2 week notice. \n\nThe only other time I've gotten fired was working for a trade company, during the first week. I was a supervisor, and there was a second supervisor on site. I got a call that my wife had been rushed to the hospital, which was literally less than a mile away. I asked the other supervisor if I could go to attend to her, and he said \"sure, no problem, I've got things here. Go.\" I returned to the job site later to find the boss there, and he let me go on the spot for leaving the team \"without a supervisor\". He knew what had happened, and still fired me. I won't lie, that one kind of pissed me off.",
   "created_utc": 1691494343,
   "score": 87,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvad4h5",
   "message": "I was jobless for 3 years. Did lots of online work during that time. Finally got a job. Forgot I got a job. Got a letter from my employer informing me that I got fired after a week",
   "created_utc": 1691495199,
   "score": 31,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvab9qg",
   "message": "I gave my boss the middle finger.",
   "created_utc": 1691494128,
   "score": 79,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvacgad",
   "message": "They blamed me for poorly teaching me the job.",
   "created_utc": 1691494813,
   "score": 26,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvadawv",
   "message": "I stopped going to that job because I no longer felt safe, nor comfortable at that job. This was about 10 years ago.\n\nEdit: I had to clarify some things.",
   "created_utc": 1691495299,
   "score": 30,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvae7p5",
   "message": "I talked my way into a job at a software company when they put a hiring notice in a local paper. I had no idea what the software did. I still don't. They hired me as a trainer and no one ever explained what the product was. I did a few weeks where I was trained on the software but literally none of it ever made sense to me. It was like they were speaking gibberish. One day I showed up, a lady I had never seen before gave me a check, and walked me out to the parking lot. No one even ever said \"you're fired\" or anything. It's one of the strangest things that ever happened to me.",
   "created_utc": 1691495800,
   "score": 12,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvadolq",
   "message": "I was an entitled little shit with a summer job between my junior and senior years in college.\n\nI thought I was getting a “data entry” job.  It was indeed data entry to an extent, but most of the work was actually taking items off the shelves in a warehouse and taking pictures of them.  (These pictures would be scanned and then entered into a system with a description.)\n\nI thought this was below somebody with my “obvious” skills as an engineering student (who had failed to secure a summer internship in his field).  I told my boss that the work was really a two person job — the other person could do the warehouse stuff — and she agreed and said she’d look into finding another intern to help.\n\nI took that to mean I could slack off posting on Warcraft 3 forums all day until they hired the other guy.\n\nOne day I came home to a voice mail telling me to not bother coming back.\n\nI 100% deserved it. I hate my younger self sometimes…",
   "created_utc": 1691495510,
   "score": 128,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvad9on",
   "message": "For getting lunch. I was 18, working at a mall kiosk with a \"manager\" title even though I managed nothing for something like $8/hour. \n\nHours painted on the door, 0 support or other employees to relieve for a break. The owner showed up while I had locked up to go get a bite to eat.  Fired on the spot.",
   "created_utc": 1691495280,
   "score": 240,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvadnt4",
   "message": "A business I went to long ago was hiring and I got the job. Right after I signed all the paperwork, the department manager comes in and asks who I am. I tell him I was just hired as a temp. Manger says he never authorized any hiring and fired both me and my boss on the spot. I did not work for this company at all and they fired me. :(",
   "created_utc": 1691495498,
   "score": 36,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaevqh",
   "message": "I got fired for submitting my time sheets on Monday at 8am when I got into work.  By policy, they were to be in by noon on Saturday, but my Fridays ended in the field so I just did then on Monday mornings.  My bosses didn't even look at them until noon on Tuesday so it had 0 impact on them.  I drove home from being fired feeling relieved because of how unhappy I was at that job.",
   "created_utc": 1691496167,
   "score": 221,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvadjey",
   "message": "Because my job is moving to Lisbon and I am not.",
   "created_utc": 1691495430,
   "score": 91,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaecn4",
   "message": "I went to the Emergency room instead of work. Came back with an ER note and they said “We won’t be needing that. Can you come with us?” I was 18 and it was my first full time job.",
   "created_utc": 1691495876,
   "score": 189,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvadq4k",
   "message": "Got fired 30 years ago for drinking too much tea while shrink wrapping Garners pickled onions. Even though I was getting the job done it was because it made other people complain that I had an easy job and I told them they were being ridiculous. Still the best pickled onions though.",
   "created_utc": 1691495533,
   "score": 236,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaei09",
   "message": "My panic attacks lol.\nI was 18 and worked at a busy af hospo job and got so overwhelmed I thought I was gonna throw up every shift. It meant I’d be kinda slow and more likely to fuck up and then I’d get yelled at and it’s make it worse.\nI never told anyone I was struggling they just thought I was a dumbass. \nThey fired me in a real mean illegal way and it messed with my confidence for ages. \nAlas figured out those sorta jobs weren’t for me. Crazy respect for people who can just be chill when customers yell and swear at you all the time",
   "created_utc": 1691495958,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaf1d6",
   "message": "Told my boss I was doing too much work for not enough pay that's why nobody stays",
   "created_utc": 1691496252,
   "score": 96,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvafwrx",
   "message": "Worked in a DIY store, 10 minutes before my shift ended I moved a pallet cage of paint cans (slowly) to the warehouse and when I got in there one of the sides came off along with half of the paint cans which spilt all over, anyway there was about 2 minutes of my shift left, so I moved the pallet over the paint, covering it a bit and went home. It was all caught on CCTV",
   "created_utc": 1691496709,
   "score": 37,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvac3yo",
   "message": "Because I am habitual of speaking truth without any fear..",
   "created_utc": 1691494616,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaboe1",
   "message": "For not taking overtime.   \n\n\nDude, my time is more worth then your minimum wage money.",
   "created_utc": 1691494366,
   "score": 246,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaau6e",
   "message": "For being single.",
   "created_utc": 1691493874,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvab92d",
   "message": "I only got fired at",
   "created_utc": 1691494117,
   "score": 0,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaclpb",
   "message": "I had too much gasoline on me",
   "created_utc": 1691494899,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaezqt",
   "message": "We formed a union and then the pandemic hit and they laid off all the unionized workers 🫨",
   "created_utc": 1691496227,
   "score": 50,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvae50i",
   "message": "Fear of heights",
   "created_utc": 1691495758,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvae6nw",
   "message": "I signed in 5 minutes early so I could go to the loo, couldn't have that apparently because other employees would see that I signed in early and want to do the same lol",
   "created_utc": 1691495785,
   "score": 67,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaehm0",
   "message": "TLDR: boss set me up to fail \n\nI was hired by someone who knew I had no previous experience, but thought I had a great capacity to learn and liked my character. He and another senior manager took their time to teach me my role and answer any questions I had, and told me to always come find them if I felt unsure about something. \n\nThen they both left the company rather abruptly, and my new boss was the total opposite of them. He let me know right off the bat that had it been up to him, he would have hired someone with more experience. Despite that, he doubled my workload. When I tried coming to him with problems, he told me it wasn’t his responsibility to answer questions and to ask my coworker instead. My coworker tried to help, but had his own massive workload to deal with. I lost my sense of direction and my work suffered for it. He fired me about a month after he took over.",
   "created_utc": 1691495952,
   "score": 151,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaekh1",
   "message": "Well I was kinda half ready to quit anyway. But one of my co-workers became \"friends\" with the boss. She was always crawling up her ass and she drove me insane. The boss was a stupid bitch too. One day on the day I was supposed to work by myself, little buttkisser came in and tried to boss me around. I basically lost it at her and she went out and cried. I actually felt kind of bad, (even if I didn't have to because she just got her just desserts looking back at it). I tried to call my boss to get her number to call her and I got ripped to shreds and she came and took the key off me... If I had had my way again I would have hung up on her face and closed the shop and went home. The stupid bitch tried to even be friendly and happy to see me when  I ran into her randomly after it all happened 😂🤣 make me wanna puke.",
   "created_utc": 1691495996,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaf25y",
   "message": "Alcoholism that came about during the pandemic lockdown. I didn’t get myself help in time. I am now taking care of elderly people and making almost half of what I was in the corporate world.",
   "created_utc": 1691496264,
   "score": 122,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaf7nf",
   "message": "Because my job \"was eliminated\". This was code for \"getting rid if you and hiring someone to replace you at half the salary.\" Their scheme was less than a stellar success because: The person they hired was an idiot and could not do it, the customers got severely pissed, they gave me $15K severance if I promised not to sue them, I took their money and still sued them for age discrimination, and won.",
   "created_utc": 1691496343,
   "score": 29,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvafdni",
   "message": "I was on a leave of absence, for mental health reasons. During this time my foot began to swell for no damn reason. I began hearing voices and forgot I had a job at all to contact",
   "created_utc": 1691496428,
   "score": 250,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvafn96",
   "message": "Difficulty remembering names.\n\nA real handicap when you're a teacher and you blank on your students' names.\n\nAnd when you're teaching English in a foreign country, they assume it's because you're a racist piece of shit.",
   "created_utc": 1691496568,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvafs08",
   "message": "the only job that’s ever fired me was because i made a post on my facebook about a rude as fuck customer and it got back to my manager",
   "created_utc": 1691496638,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvafsss",
   "message": "I didn’t get fired, how dare you suggest that I did",
   "created_utc": 1691496650,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvag0wu",
   "message": "Because I didn’t fit the team",
   "created_utc": 1691496769,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvag27v",
   "message": "Kamikaze situation where I stood up to my bullying manager in a group email using some of his own petty tactics against him.\n\nA number of more senior people than him gave me off the record kudos but the manager made a stink and demanded I be fired or he'd quit. He quit two days later and I was put on a PIP with unmeasurable completion benchmarks.\n\nThey fired me 30 days later and I didn't even care. The company was trash, they routinely abused salaried employees with impossible workloads, and with the insane hours I had to work while there I was essentially making minimum wage.\n\nI started a contract tech job about 8 weeks later at 25% higher pay, a hard 40 hr p/w cap and an additional 10 days of PTO so it was totally worth it.",
   "created_utc": 1691496789,
   "score": 14,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvag4u5",
   "message": "I was a young and inexperienced bartender, and I overserved someone. They were so drunk, an ambulance had to come and take her. I thought my life was over. But one of my co-workers was an EMT at the time, and she said don't worry about it, they have no interest in coming after you. I actually asked the manager to fire me because I was so negligent. She reluctantly did, we parted on good terms.",
   "created_utc": 1691496827,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagcxd",
   "message": "I went to lunch with a manager in a different department, and he did some errands too. I kept telling him that I only had an hour. My manager contacted me via our walkie talkies and had me call in so he could fire me.\n\nIt was ok. I was moving out of state the next week anyway, and had already tendered my resignation.",
   "created_utc": 1691496945,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagd33",
   "message": "I got into an argument with the general manager, and made her look dumb in front of the district manager (her boss).\n\nThe pizza store I worked for got a new general manager. She only got the job because her best friend was the wife to the district manager. GM never did anything useful. If she was helping the cooks made the orders, and it got busy, she would get frustrated, then run to hide in the office because \"I'm too stressed\".\n\nShe had a rule that the delivery drivers were required to wear an apron when removing items from the oven. I never followed this rule, as most of the time, the oven would be so backed up, the 3 seconds it would take to put on an apron, would cause the food to get smashed or pushed off the ledge.\n\nOn the day in question, as usual, the oven was backed up, so I just went straight into boxing everything with no apron. GM sees me, gets mad, yells at me that she's go it, and for me to go to the back and get an apron. So I do as told. I'm in the back with an apron, doing something else, because she didn't tell me to come back 🤷‍♀️ A few minutes later, she comes storming to the back to find me, screeches at me for not helping her, and questions why I wasn't wearing an apron.\n\nI repeat to her, as mentioned above, and also what I've told her multiple times, the little time it takes to use an apron, is a little time too long. She gets mad, and asks why I didn't come help her. I replied that she  told me to get an apron, but she said she could handle the oven, so I found something else to do.\n\nRealizing I was right, she was at a loss for words, got flustered, and retreated to hide in the office. The DM saw the whole thing. GM fired me 2 days later. I asked for a reason, she said \"we don't need you anymore\".",
   "created_utc": 1691496948,
   "score": 34,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvageho",
   "message": "Got fired for threatening to cut the brakes on my manager’s car.  He had no idea if I was serious or not.",
   "created_utc": 1691496967,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagg5z",
   "message": "I couldn’t help myself from taking the piss out of the creative director for dressing like a pirate. Which to be fair, he fucking did.",
   "created_utc": 1691496992,
   "score": 147,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagjn5",
   "message": "Record store. I refused to sell blank cassettes as an add on sale in the age of burnable CDs.",
   "created_utc": 1691497041,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagmm6",
   "message": "I got fired because I was goofing off. The manager said I'm a distraction to the company.",
   "created_utc": 1691497085,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagmuh",
   "message": "Reading during my lunch break 🙄",
   "created_utc": 1691497088,
   "score": 230,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagnz5",
   "message": "I have ADHD and the nationwide shortage of ADHD meds caused me to not be able to take it every day. Job accused me of being high. After that I left, should have stayed on until they fired me officially.",
   "created_utc": 1691497105,
   "score": 128,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagpdb",
   "message": "I accidentally played marriage counselor instead of being a coworker, oops!",
   "created_utc": 1691497125,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagqp5",
   "message": "I didn’t go to a meeting. Still technically employed since they never gave me any formal papers or notice or even told me. They just didn’t schedule me again",
   "created_utc": 1691497144,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagv1f",
   "message": "Well...",
   "created_utc": 1691497205,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagx2f",
   "message": "I refused to repeatedly lift 70lb boxes onto moving pallets all day for $8/hr. That's half my weight.  I started on the assembly line. I was moved to the boxes after other box guys quit.\n\nEdit: Idk if I quit or was fire. I just didn't come back to work. On the 2nd day, my boss called and asked me what's up. I told her that I didn't plan on coming back. She said ok, she'll handle that.",
   "created_utc": 1691497234,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvah00d",
   "message": "Many times - as I got older if you fucked with me pay the price,cause your getting fired with me. Yeah I chased a dude down with a steel\nPipe in front of the new owners cause I had enough and me quitting wasn’t enough. I blew it up so big they fired a few people. Don’t fuck with someone with FU money",
   "created_utc": 1691497275,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvah6m4",
   "message": "For not giving a customer enough sauce with her order. Apparently she called up, complained and claimed I refused to give her any. Pretty sure they were looking for an excuse because I was pushing back against the insane working conditions",
   "created_utc": 1691497368,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvah6pq",
   "message": "I wasn’t able to fold clothes nicely",
   "created_utc": 1691497370,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvah6ps",
   "message": "No call, no show. It was really more me quitting because the job was stressing me out and kept adding responsibility while barely keeping ahead of minimum wage, but they probably look at it as firing me.",
   "created_utc": 1691497370,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvah7ls",
   "message": "Snarfing in the boy's room",
   "created_utc": 1691497382,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvahltx",
   "message": "Worked for a husband and wife team when I was in college at a small real estate company. Wife fired me because the husband was starting to get handsy and very “friendly” with me.",
   "created_utc": 1691497585,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvahplw",
   "message": "For being too good at a job. Did bar security, and this particular bar saw it a bad thing that I caught fakes, refused to let minors in, and was willing to physically put myself into danger to protect staff and customers. They were looking for more of a seat filler so they can say they have the legal obligations to run a night club…",
   "created_utc": 1691497638,
   "score": 70,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvahskk",
   "message": "To this day I don’t really know.",
   "created_utc": 1691497678,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvahsl6",
   "message": "I did the night audit at a hotel. 3rd shift, and no one else was there all night.  One evening I had my then girlfriend (this was the year 2000) stop by, and we had sex in the managers office. The next day, I get called in, and she pulls up video of me getting a blowjob in her chair! As I was sitting there, right next to her, and she was sitting in the same chair.  I was a young, couldn't care less punk kid back then. The manager said \"you know we have to let you go, right?\", right after telling me they had installed cameras all over a week prior. I swear she liked the video a little too much, she didn't look mad at all. And as she let it play,  her eyes didn't leave the screen. AWKWARD!!!! She kept letting it play as she was talking to me about the situation. \n I was a young, 23 year old guy, she was a middle aged unmarried lady. I asked for a copy of the tape before leaving.",
   "created_utc": 1691497678,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvahz18",
   "message": "The store had three people working their asses off in receiving. Two-thirds of inventory was regularly returned. They had one person in returns, me, and it all had to go to about twenty different places. Asked for a coworker working same hours as me but only had a small space and one computer. Only after I got let go, two days after Christmas, did I find out one of the last guys also got fired and the person who replaced me also was fired.",
   "created_utc": 1691497767,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvahzk4",
   "message": "i got fired from a fast food job because our idiot boss printed up the schedule with everyones pay rates on it and we saw that the new ass kissing hire was making 30% more than the rest of the peons, more than even shift managers.  so i made sure the night shift knew they were getting screwed over.",
   "created_utc": 1691497774,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvai38w",
   "message": "The managers dog sitter/my new coworker didn’t like me. When I applied I put in my college school schedule \u0026amp; it obviously got approved. When coworker went to put in their school schedule two months later (one week before school started) it got denied because mine was approved for the same hours. Coworker told me I needed to change my school schedule \u0026amp; I said no. She ended up starting rumors which I decided to ignore \u0026amp; she told the manager to fire me. So the manager did. When I asked what the reasoning was that I was fired the manager couldn’t give me any reason whatsoever.",
   "created_utc": 1691497824,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvai3nr",
   "message": "Charged a reactor wrong, 1.5 million $ mistake\n💔💔💔😔😔😔",
   "created_utc": 1691497830,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvai4nu",
   "message": "I refused to come in 15-20 mins early unpaid for my shift. I was always 5-10 min early but they decided they wanted me there earlier. I carried on as normal as I’m not coming in if I’m not being paid. Turned up for a 12pm shift at 11:49, no one would look at me when I arrived then was thrown in a meeting and fired for being “late”. Was out the door before it even hit 12.\n\nIt was the only time I’ve ever been fired.",
   "created_utc": 1691497844,
   "score": 170,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaiber",
   "message": "Almost 30. I’ve only had 3 jobs and never been fired. Honestly I think it’s crazy that people get fired as often as they do. \n\nI’ve seen three people get fired. One dealing drugs in the drive thru, one missed two weeks of shifts with call ins, and one missed 14 out of 20 days in a month. His best excuse was that his brother parked behind him",
   "created_utc": 1691497934,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaibkj",
   "message": "In college I had a temp job doing quality assurance. I figured out their internal site had profile pages that freely allowed the execution of Javascript in the form fields. I thought it would be funny to make my profile look crazy, changed colors, added some animation. This way when you went to the list of employee profiles you might get a chuckle and it would bring attention to the fact that it allowed executing code. Something I already brought to their sttention previously. \n\nAnyways I got fired for \"breach of security\"  lol",
   "created_utc": 1691497936,
   "score": 53,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaifkl",
   "message": "It was 1973 , working at Mickey -Ds. Redneck manager says \"go get a haircut, then you can come back\". I didn't go back. Ponytails rule.",
   "created_utc": 1691497990,
   "score": 220,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaifsk",
   "message": "Covid-19 forced company wide layoffs.... was kinda a blessing in disguise. Was miserable at that job even if I was making 80k/yr... now I make 1/3 of that and Im way happier",
   "created_utc": 1691497994,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaigae",
   "message": "I went to a temp. agency because my friend was going. I figured I'd tag along and fill out an application. I got a job at the local landfill and worked an entire day. I got fired the next morning because I was only 17. They looked over the paperwork the agency had sent over and they couldn't do it. \n\nWorst part is that my ride had already left.",
   "created_utc": 1691498000,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaijm5",
   "message": "Manager (typical over-educated mediocre Boston fauxminist) got weary of me making her look bad to the real boss (sorry, but she just made it SO easy) and made up stories about how I was slacking off.  Real boss stupidly trusted her, so out I went.\n\nFast-forward a few months, and she gets busted having my replacement (who she hand-picked) do work for her personal business on the clock.  I smiled a lot the day I found out.",
   "created_utc": 1691498046,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaiksk",
   "message": "Made a dirty joke to someone I knew who also worked there, someone over heard me from the corridor and thought I was sexually harassing them. Was sent away a few days later even though the friend said it was a joke and she found it funny.\n\nIt was a awful job anyhow and neither of us work there anymore and we still laugh about it to this day so not all bad.",
   "created_utc": 1691498061,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvak3kp",
   "message": "For reporting elder abuse",
   "created_utc": 1691498815,
   "score": 101,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaj4jh",
   "message": "For doing my job too quickly and sitting down the rest of the time. Gas station cashier 3rd shift. \nMe: “Why should I stand when I’m the only person in the store?”\nManager: “It’s more professional to stand than sit”\nMe: “then why do you sit in your office?”",
   "created_utc": 1691498338,
   "score": 25,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvauy8x",
   "message": "I was denied a raise by HR after consistently working 60-70 hours weeks, and my VP (who had supported and requested the raise for me) told me to stop putting in the extra time, work my 40, and spend that extra time applying to new jobs. Within a month, a meeting was called to \"mutually part ways\" because my work wasn't getting done.\n\nI was gratified to learn that they had to hire two people to do my job after I left.\n\nEdit: Sucks to see how much this resonates with people who have been in a similar situation. I left this job back in 2015, thankfully. The VP is no longer there either, and good for him.",
   "created_utc": 1691503655,
   "score": 125,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jval2fr",
   "message": "I asked the CNA I was working with to stay with a confused patient, while I went and put a new IV in another patient.\nThe CNA left the patient alone.\nShe fell out of bed and got a big bloody skin tear on her arm.\nAfter I took care of that, I went and found the CNA and told her the patient was injured because of her insubordination.\nThe CNA cussed at me, and left the unit.\nI did not see her again that shift.\nShe and another CNA decided on their own to trade assignments.\n\nI wrote the CNA up.\nThe CNA went to mgmt and lied about me. She said I called her by a racial slur and yelled at her.\nI did neither.\nMgmt fired me rather than deal with a false claim of racism.\nI collected unemployment.\n\nThe CNA did something similar with another nurse a couple of weeks later, and was fired.\nMy mgr asked if I could be rehired. HR said no.\n\nWhen my mgr quit to start her own nursing agency a year later, she hired me.",
   "created_utc": 1691499278,
   "score": 78,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaybxo",
   "message": "Stealing narcotics. I was a nurse. 6 years clean now. Lost my nursing license though. It was a difficult lesson to learn but it may have saved my life.",
   "created_utc": 1691505012,
   "score": 20,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvamdsu",
   "message": "My Parole Officer wanted to make sure I actually had a job, so he went to my employer listed on my file to surprise visit me on the job. I did home wiring so I worked at different job sites and rarely in the office. He called me to say he was going to charge me with a violation for lying to him about my whereabouts (this could've landed me back in prison for my remaining 10.5 years sentence). The owner of the company had to speak with him and vouche for me. My Parole Office didn't charge me, but the owner sure did fire me that day. Finding a job with a felony isn't an easy thing, and it wasn't long before my PO threatened to charge me with a violation if I didn't find a job soon 🤦🏻",
   "created_utc": 1691499895,
   "score": 37,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvapwzd",
   "message": "Was on the edge of a serious burnout and had a sick leave for two weeks. The day I returned, I got fired. This all after I had pretty much given my all for 1,5 years working 10-14 hours every single day, working from home and not having a private life at all. That’s how I learned that you should never give too much at a job. It’s just a job and they won’t thank you for anything at the end of the day…",
   "created_utc": 1691501519,
   "score": 75,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvauput",
   "message": "*They* sent *me* home because I sneezed and I was forced to get tested for Covid. Then when I tested negative, I was terminated for “Abusing pandemic policies to stay home”",
   "created_utc": 1691503558,
   "score": 10,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvayuww",
   "message": "22 years ago.\n\nI technically got fired for sexual harassment.\n\nHowever, the reality was the big boss liked me and wanted to train and promote. The boss below him didn't like me. When he was away for a couple of weeks, I got called into the office and told I was fired for sexual harassment with a certain member of staff. \n\nMy direct boss was shocked, I was shocked. This other person worked in our department, I'd been around them for a couple of hours on my first day as they showed me the computer, not really spoke since other than a hello on the way in. My direct boss apologized to me after the meeting, said she had no idea it was coming and had no idea what they were on about. There was only me and her in the office. The other two members of staff, including this guy, had their own office. We didn't have a need to go into each other's.\n\nIt eventually came out he had been told to go along with it. Bg boss was furious when he got back, but things had been done already. That person didn't progress any further in the company.\n\nI was a 16yo girl at the time and the guy they strong armed into it was a 28ish year old man. It was awkward on so many levels. \n\nNo big loss though, not for me. The person that arranged it all came off much worse.",
   "created_utc": 1691505224,
   "score": 141,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaym3g",
   "message": "I was a brand new Engineer out of college. Like green. I got a job offer at an aircraft factory (Cessna, a Textron Company) as a Quality Engineer.  I had been an intern for 3 years and they helped put me through school.  I worked in a _Projects_ group designing new floor layouts and how these business jets flowed through the process. I had always received good performance reviews and that is why my internship turned into a scholarship and into a job offer.\n\nWhen I started full-time, I was assigned to a facility across town that did sheet metal stuff. I remember walking into the office on my first day, introducing myself to my new manager. She immediately turned away, refused to shake my hand and ignored me.\n\nThe next 6 months were the same. She legit would not speak to me, would not give me projects, would not schedule one-on-ones to give any direction, and if I was on an email chain and she was looped in, she would take me off.  I would walk over to her and she would hunch her back and try to cover whatever she was working on so I couldn't see, as if it was some big secret.  Finally  I got involved in some continuous improvement projects, I was asked by our director to run with a few special projects and I started (in my opinion) really finding a groove. \n\nFinally she pulled me into a conference room, yelled at me for 2 hours (yes 2 fucking hours) about how I was not doing the things she wanted me to do. She gave me a self-help book and told me I needed to read it and tell her what was wrong with myself and she terminated me without HR or anybody else knowing.\n\nTo this day, I never knew what her problem was or why she hated me from the moment I introduced myself. I have a wonderful and successful career and currently manage quality for 4 factories in a Swedish conglomerate - and if I ever see her again I will tell her how I have modeled my management style after promising myself I would never be like her. My employees always know:\n\n* What is expected of them\n* How they know if they are succeeding\n* Where they can go for help if they are not",
   "created_utc": 1691505125,
   "score": 122,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvb08pu",
   "message": "This isn't why I got fired, but this is why I didn't get a job...\n\nI was 16 and looking to work at a Dairy Queen as my first job.  My mom drove me to the interview and I was super nervous.  She looked me in the eye and said \"Just be honest, and be yourself, and you'll do fine.\"\n\nI walked into that interview and when he asked me \"How long do you think you'll work here?\" I responded \"Until something better comes along\"....",
   "created_utc": 1691505769,
   "score": 165,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvak7sv",
   "message": "Long ago, I was a bill collector who didn't have the heart to prey on poor and unsophisticated people who had no money for food and rent, let alone paying for their vaccuum cleaners and encyclopedias they got sucked into buying on years-long installment plans. \n\nI lasted a coupla weeks.\n\nThe pay was good though. But not as good as the feeling of sleeping well at nights.",
   "created_utc": 1691498872,
   "score": 124,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvalj20",
   "message": "I'm an electrician and I was given my final warning for having an untidy van. It wasn't great but I was told to tidy it over the weekend which I did and then still got my final warning and dismissal the following week.\nWhat really rubbed me up was that my boss was the biggest culprit for having an untidy van and I had likely learned this trait as an apprentice from him.\n\nHonestly though looking back I was probably sacked for other reasons and have since been aware that rarely are you fired for the reason that your boss want you fired for. When they want you out they'll find a reason so best to self reflect on your other failings than be pissed off for being fired over something trivial",
   "created_utc": 1691499495,
   "score": 146,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaj142",
   "message": "My boomer manager kept insulting me, blaming me for things my coworker did and kept getting an attitude with me any time I didn't bend over backwards to accommodate her ego.\n\nSo one day she asked me why my coworker did a certain thing. I told her I had no idea. She pressed me. I said \"How am I supposed to know? Explain it to me. Tell me how **I** am supposed to know what **he** did.\" She said \"I don't know\", so I walked away to keep doing my job. Next thing I heard was \"You know what? Just go! Get the FUCK out!\"\n\nI got un-fired by her boss a few hours later, and transferred to a better location, but being able to cold shoulder her after months of asking her nicely not to belittle me was quite satisfying.",
   "created_utc": 1691498291,
   "score": 160,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvayuml",
   "message": "My only time getting fired, I was 13-14, working at a go kart track. I had been there about a month when I was left alone for a solid week to take care of the track as the other 2 track attendants sat around smoking, drinking, and chatting with the boss. I ran it flawlessly and had no issues. My first day off after working like 12 days straight I got called in, I showed up within 5 minutes aaaand they fired me saying that all I did was sit around and make the other guys run the track. They literally accused me of doing what the other guys were doing. I slammed that place so hard to everyone I knew and they went out of business within the next 2 years.",
   "created_utc": 1691505220,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvawxih",
   "message": "I didn't do something that I was forbidden from doing after I was told to do it anyway 🙃 They took me to court over unemployment and I won.",
   "created_utc": 1691504455,
   "score": 19,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvav0ur",
   "message": "they lowered my pay so I started sleeping at work and do only half the task they wanted me to do. Took them 3 years to fire me.",
   "created_utc": 1691503684,
   "score": 12,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaj659",
   "message": "Some shareholder wanted to a return on their investment and I, along with \\~10,000, were deemed as an appropriate way to \"cut costs.\"",
   "created_utc": 1691498360,
   "score": 223,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaymzz",
   "message": "I was fired from Panera as soon as I walked in the door for my first day of work. I showed up 10 minutes early and walked in 5 minutes before my shift started. The manager met me at the door and said I was being \"unprofessional\" and threatened to call the cops when I pushed for an explanation. \n\nTurns out the employees did lots of drugs while working and were probably high out of their minds.",
   "created_utc": 1691505135,
   "score": 33,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaiwn0",
   "message": "Got fired for not only calling the health inspector but posting pics of many food safety violations on FB while tagging the restaurant in the post while on the clock in the restaurant.",
   "created_utc": 1691498227,
   "score": 90,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaykpy",
   "message": "The 55 yr old male dishwasher was flashing me his dick pics on the clock when I (27F then) would walk by. I kept my mouth shut then found out he was harassing the other female employee around my age, too. We took it to the small-business restaurant’s owner after a manager for wind of it and forced us to. We told them to only say something to the dishwasher if they wanted to terminate him, otherwise just leave it alone because it’s too small of an establishment and he was knowingly violent (threw baking pans at the other female employee’s head when she rejected his advances). They didn’t listen - asked him about it. So of course he gets pissed and causes a whole scene when I walk in for my next shift in front of customers. Cussing at me, all that. They fire him. Two weeks later, I hear from the manager that had us report to the owner that owner and GM think the girl and I are liars. That day a customer came in and cussed me out over banana pudding. I threw the shit at her and told her to get the fuck out in front of a long line of customers then turned to our GM and told him if he didn’t want problems like what I’d just done in his establishment he needs to believe females when we tell them our coworkers are sexually harassing us. Whole restaurant was dead silent and everyone was staring at him. He told me to leave lmfao. Worth it. Still my coolest quitting-a-job story to date. \nAnother time I got fired from a coffee shop for leaving the work group chat after I put in my two weeks notice. Whatever, lol.",
   "created_utc": 1691505109,
   "score": 26,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaqpcu",
   "message": "I got fired all the time when I was working for my family company. I still had to show up the next day…. For those who don’t know, either working for family is either super easy, or super tough. Usually, the later.",
   "created_utc": 1691501871,
   "score": 200,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvayg1z",
   "message": "Having sex with a co-worker after getting demoted for having sex with a subordinate",
   "created_utc": 1691505058,
   "score": 171,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaygvv",
   "message": "At the beginning of the pandemic, I told my manager that if anyone in the building gets COVID, I will be quitting on the spot. I live with two immunocompromised people and since I had direct or indirect exposure with most people in the building, I didn’t want to risk it. \n\nAt the end of the day, I was told my “services would not be required any longer.” Got escorted out and everything. \n\nThey had a COVID outbreak a week later. My family and I tested negative all throughout the pandemic, and I had a new WFH job lined up (with benefits!) within a few months.",
   "created_utc": 1691505067,
   "score": 20,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaj2tb",
   "message": "For getting stoned after work",
   "created_utc": 1691498314,
   "score": 9,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvayv3y",
   "message": "I built a snow scorpion sculpture (I used ketchup for the red glowing eyes and everything) on a particularly miserable day at a ski resort. The guests enjoyed my sculpture very much, management weren’t so happy.",
   "created_utc": 1691505226,
   "score": 72,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvau9gu",
   "message": "Worked at a car dealership in college between semesters.  Sold a ford raptor for like 80k and the commission was like $200.  After that I would go to my desk and just study for school.  Didn’t try to sell anything after that.  Knew I would be fired, took them 2 months to realize I had done absolutely nothing since the last time I sold the raptor.  $200 for selling a 80k truck, lol.",
   "created_utc": 1691503370,
   "score": 39,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvay2m6",
   "message": "Leaning on the cart return corral thing while talking to another employee who was on his way into work\n\nPretty sure they just wanted to fire me",
   "created_utc": 1691504911,
   "score": 8,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvavt6k",
   "message": "For reporting harassment.  Fun times.",
   "created_utc": 1691504007,
   "score": 8,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvayldk",
   "message": "I was in a really really bad place when I took a job I knew I had almost no qualifications for. Maintenance repair guy at an apt complex. I have no fucking idea how to fix anything lol. Lasted a few months before they caught on. Tried my best to learn and watch YouTube videos but I was taking wasaaaay to long to do shit.",
   "created_utc": 1691505117,
   "score": 48,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaym75",
   "message": "I worked at a frozen yogurt place when I was 17 and got fired for making \"too\" much yogurt.",
   "created_utc": 1691505126,
   "score": 6,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvayq9a",
   "message": "I worked at a large grocery store chain. \n\nOne day, pushing carts inside from the parking lot, I found a can of hair root concealer in a spray can. I sprayed it on the pavement, and it made it darker where I sprayed! Wow!\n\nSo, showing a few coworkers my discovery, I sprayed \"hi :)\" on the building on one side. It was small, barely noticeable, but it was there.\n\nSo, after this incident, thinking the spray would wash off easily next time it rained (cause it was hair product- why wouldn't it wash out?), I went on vacation with my family a few states away. \n\nAbout a day into our trip I find out that 2 more coworkers found the same spray can that I had used, and they sprayed ALL OVER the side of the building where I had sprayed my \"hi :)\" and management found out. They had a camera pointed RIGHT FUCKING AT THE WALL. And guess what? It didn't wash off. At all.\n\nSo, being a union job, I got \"suspended pending investigation\" instead of fired. Corporate is still trying to figure out what to do with us 3. This incident was months ago at this point. I'm pursuing another job, cause I'm tired of waiting on stuck-up pricks to make a simple decision over an honest mistake. All 3 of us told the truth, gave our statements, and we all sincerely apologized to management and corporate. The oldest dude out of the 3 of us is 20. We're dumb, we make mistakes. We owned up to it. Now just fire us or let us come back. Don't wait 3 fucking months to tell us \"well, we're gonna think about it some more\"\n\nAnyway, yeah. That company sucks.",
   "created_utc": 1691505171,
   "score": 7,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvb7fr4",
   "message": "You know the person that’s always stealing other peoples stuff out of the shared refrigerator/kitchen space at work? Someone close to me got fired because they decided to do something about it which would leave it up to the thief’s choice in the end. They brought in a ziploc bag full of dog treats (think beef jerky looking ones). They left them out in the open on the table with their name on the bag. Came back later, bag was empty. Jackass didn’t even think to throw the bag out after they ate the dog treats. 😂MONTHS LATER, when my hero was supposed to be up for a big raise\u0026amp; bonus, they got called into HR. HR said they had heard that they willingly fed another human animal food. Word had gotten around from within because others were in on the whole plan, cause thief was stealing their food too. Thief was also stealing merchandise \u0026amp; personal belongings. \n\nHR-you willingly fed another coworker animal food. \n\nHero-ALLEGEDLY. ✌️\n\nThey didn’t fire the thief either. He stopped showing up for work.\n\nETA: to anyone that it really bothered that this was not about how I got fired, well shit my bad. It did happen to someone close to me and I felt it needed to be told. If it wasn’t clear, the person close to me DID in fact get fired for this exact instance I stated.",
   "created_utc": 1691508498,
   "score": 168,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvb44vc",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvauk37",
   "message": "my manager kept losing my class schedule\n\nworked at a subway. i had class two days a week. several times he put me on those days anyway. i gave him multiple copies every time. owner took me off the schedule for \"calling out too much\"\n\nwhen i showed the owner proof he said it was too late and they already hired someone else\n\nthis was 12 years ago. im still mad",
   "created_utc": 1691503493,
   "score": 121,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvavmm2",
   "message": "I gave my employee meal to my mother. That's literally it. I didn't like eating the food there so I had my mom bring me lunch and I just gave my employee meal to her. Apparently that was considered theft so I was fired. :/",
   "created_utc": 1691503933,
   "score": 6,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvayg0l",
   "message": "Type 1 diabetic here. Got really sick for 2 days due to my condition and was in the hospitals intensive care unit for those days, and when I got back to work and couldn’t clock in, I learned Amazon terminated me",
   "created_utc": 1691505057,
   "score": 20,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvbuglx",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvb9sa3",
   "message": "I was 19 and working as a janitor at a large self storage facility, where most days were filled with sweeping and mopping endless hallways of flickering fluorescent light. And when someone went delinquent on their bill (after a 3 month grace period), I would be instructed to empty their unit and dump everything in the trash outside. Once or twice it was a person who died, but otherwise it was a pretty common to see a room full of absolute junk that someone got tired of paying for. Banged-up furniture, garbage bags of ratty clothing, stacks of old magazines, it was usually pretty hoarder-friendly stuff, and not that I'd want any of it but the policy was I had to throw it into the dumpster outside no matter what it was.\n\nOne day I get notified to empty out a unit, so I grab the bin, cut the lock, fling open the gate. The room is full of huge cardboard boxes stacked to the ceiling. I open one up out of curiosity, and it's full of brand new, unopened Gundam models. The entire room is full of them, dozens of boxes with dozens of models in each, and I'm talking the $50-$100 ones I saw for sale at my local comics shop every week. The manager would check up on me once or twice a day, and that morning he walked up and I showed him all of the brand new merchandise and said there has to be a better system than trashing all of this. He said rules are rules, something about insurance I didn't understand, and told me to throw them all away.\n\nSo I went and I backed up one of the complementary U-Haul style box trucks, picked a few models out for myself, and loaded it up the truck with the rest of it. On my lunch break I drove over to the Children's Resource Center that I'd volunteered at during high school, it's a place where any child (but usually poorer ones) would go after school for arts and crafts and activities to keep them busy until their parents got home. The people at the drop-off dock were so grateful, before I even left they were handing them out to some extremely excited kids. Drove back to the self storage place with enough time to eat a sandwich and smoke a cigarette before clocking back in. \n\nBut that's not why I got fired. I got fired because the manager came to check on me that afternoon, and after awhile of looking around, found me sitting cross legged on the floor of the janitor closet with model parts spread all around me, happily assembling a sweet translucent Zaku model. I was so entranced I didn't even hear him come in, I just hear this long, drawn out, exasperated sigh. I look up and he just says \"keys\" and that was that. I spent the rest of the week assembling Zakus and Valkyries and lying to my parents about getting replaced with a Roomba.",
   "created_utc": 1691509363,
   "score": 39,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvayy7g",
   "message": "Their official reason \"I'm not happy doing my job\"\nThe actual reason: I wasn't happy doing other people's job on top of my own and they didn't like that I spoke up.",
   "created_utc": 1691505261,
   "score": 211,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvcthmz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvb7337",
   "message": "CSX fired me for supporting Bernie in 2016. I had a Bernie bumper sticker and would go to the HQ building a lot. The CEO at the time even spoke out against Bernie in a company town hall meeting after he saw my car. \n\nSuddenly I found myself laid off 2 months after I received an “exceeding expectations” annual review and I was credited with saving them $1m YOY on chassis rentals.",
   "created_utc": 1691508368,
   "score": 36,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvatub1",
   "message": "I work full time as a graphic designer, and my first full time job was doing social media content for a start-up company in my hometown. On a Friday about 8 months into my job, my boss emailed us all to say that we'll be starting in \"the new office\" on Monday. I was never told that we were moving, but it seemed like everyone else was. I also didn't have a full driver's license yet, and the town the new office was in was an hour commute away, so I would have to take public transit every day. Luckily I got some advice from my parents, and I told my boss that I couldn't feasibly commute to the office, but I still wanted to work for the company, so my boss terminated my position, and I got put on unemployment.",
   "created_utc": 1691503196,
   "score": 147,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaz291",
   "message": "I was going on vacation to Japan. Gave 3 months notice.\n\nBoss fired me because my coworkers wouldn't cover my shift at a pizza place. I'm not cancelling my vacation that's been planned for a while just because people don't want me to not work for a week.",
   "created_utc": 1691505306,
   "score": 88,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvd4giq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvakbaa",
   "message": "I missed a lot of work because my wife got brain cancer. They called me in for a meeting and said \"Sorry, we are downsizing and letting a lot of people go\". They didn't fire anyone else, including a co-worker who was caught fabricating reports.",
   "created_utc": 1691498918,
   "score": 163,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaydrw",
   "message": "I gave the fry guy and alcoholic beverage from the bar in a kids cup. He used to hook me up with coconut shrimp and fiesta rolls. They fired both of us lol. I wonder how Jamaar is doing nowadays.",
   "created_utc": 1691505033,
   "score": 212,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvajwny",
   "message": "I was a kid and just started at a local pizza place.  I was let go couple weeks later because a pizza chef from Chicago had moved into the area and needed a job so it was a business decision that I totally understood.  Week later, went to go get my last check and asked how he was doing, the girl up front was like \"pizza chef from Chicago?  The only new hire was the managers new gf\".",
   "created_utc": 1691498721,
   "score": 135,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvbfha2",
   "message": "Because I was reported for saying during a meeting that “the current project is “like a bunch of monkeys fucking a football.””",
   "created_utc": 1691511458,
   "score": 110,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvak3fh",
   "message": "I was in my late 20s and had just gotten out of the Army and wanted to finish school. I worked for a pet store as a groomer part-time while I was working on finishing up the semester.\n\nI put in time off for my finals week about 3 months back and it was approved by both him and the assistant manager. Everyone in the entire store knew I was going to be focusing on school for that week.\n\nJackass calls me in the middle of one of my finals and left me a voicemail saying I needed to come in cause they were 1 person short. I didn't even know until 45min later when I walked out of class. He had called me 4 times and on the 4th voicemail he left me a threatening voicemail.\n\nSo I called him back and we argued about my \"professionalism.\" So I went into the store to have a conversation with him which led to him threatening to fight me. I told him if he wanted to fight then he can take off his name tag and meet me in the parking lot off company property.\n\nSuddenly he became really fucking docile and just told me I was fired. So I sent in the voicemails to corporate and found out a few weeks later he was \"transferred\" to a different store.",
   "created_utc": 1691498813,
   "score": 104,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvavmix",
   "message": "This was 30 years ago.  I was furious with my boss for asking me to work a private event for a group of his friends.  The theme meant that most people were drinking Corona.  I worked a six hour shift at an open bar and he tipped me $20 at the end of the night.\n\nI slipped 4 Coronas into my backpack before I left for the night.  The assistant manager heard the clinking of the bottles, asked me about it, and when I told him I was taking some Coronas home for myself he fired me.\n\nJustified for sure.  The only grudge I hold is against the big boss who fucked me on the tip.",
   "created_utc": 1691503932,
   "score": 65,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvawr94",
   "message": "They were pissed I was going back to school to get a better job than the shitty ass bar they wanted me to live and die at.\n\nAlso my manager at that bar fucking spanked me like a child once.",
   "created_utc": 1691504386,
   "score": 81,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvarnuw",
   "message": "Got fired on day 89 of a 90 temp contract.\n\nThe contract stated if you were still employed as a temp on day 90 they had to hire you in full time.\n\nThey had a point system for discipline. If you were late it was half a point. Accumulate 3 points and it is instant termination.\n\nAt my firing meeting they said I had accumulated 30 points. I explained, for what seemed like the millionth time, that the punch clock for temps is 15 minutes faster than the clock for hired in employees and that all their temps are getting paid an extra 15 minutes every single day because they clock in and go sit in the cafeteria. I literally would walk in every day with my boss at the same time...and he was the one that fired me for accumulating 60 work days worth of tardy points.\n\nAnd when I asked why I wasn't fired at 3 points...why was I allowed to accumulate 30 they said they liked the production numbers I was putting up. And they even encouraged me to reapply as a temp and they could have me back on the floor as early as the next day.",
   "created_utc": 1691502286,
   "score": 98,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvakx0n",
   "message": "Because I descalated the manager, when she was yelling at a 16 year old girl, in front of customers. Manager didn't much like that I was stopping her from being a bully, so she fired me. This was years ago.\n\nThe biggest twist is she had recruited a few of the staff the back her up in pretending I was bad at my job, and possibly created fake write ups (she refused to show them to me when I demanded to see them, because news to me! I definitely didn't sign anything). \n\nSo after I was fired, 2 days later several of the staff (including some who had been on manager's side) came to my actual house to ask me for help. Turns out, once I was gone, there was no one to hold manager accountable, and she'd turned on everyone. Screaming and writing people up when they couldn't be in literally 2 parts of the store at the same time, refused to do unsafe tasks etc.\n\nI told them that they helped her get rid of me, now they could deal with her.",
   "created_utc": 1691499205,
   "score": 64,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvc687h",
   "message": "I got a drywall job with no experience. They offered me meth and I said no. Got fired for \"not having enough pep in my step\"\n\nNO THANK YOU PLEASE KEEP YOUR PEP",
   "created_utc": 1691521206,
   "score": 88,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvani1g",
   "message": "Was working at a startup, killing myself to fulfill all my performance metrics (which I did). I told my boss that I wasn’t willing to sacrifice my work/life balance forever; he said I wasn’t dedicated enough and fired me on the spot. His exact words were “we need people who are 200% dedicated, not just 100%.”",
   "created_utc": 1691500435,
   "score": 67,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvatwly",
   "message": "I was working Tech Support for a software company.  We'd made a big sale to a major university and I had been designated the lead contact point for them.\n\nFirst question they asked was \"how do we enable the firewall on your product.\"\n\n....we don't have a firewall on our product.\n\nI talked around it a bit but eventually they asked point blank, where is the firewall.\n\n\"There isn't.\"\n\nWithin an hour I was in a conference room with the sales rep and the head of sales and my boss, the head of Tech Support.  Lots of screaming went on from Sales and then lots of meetings with bosses for the rest of the day.\n\nThroughout all of this none of them could deny the basic fact of what I stated; our product didn't have a firewall nor were there any plans to add one in future versions.\n\nNext morning I came in and was greeted at the door by my boss, lead to a conference room and informed that I was being let go for \"performance reasons.\"\n\nLater that day the Sales Rep messaged me on LinkedIn telling me to enjoy waking up tomorrow morning and being a jobless bum.",
   "created_utc": 1691503223,
   "score": 100,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvb7y0j",
   "message": "A couple fliers were put up about a mandatory all staff meeting. The meeting was on Sunday my day off. The meeting was about other departments and had no relevance to my job. \n\nI didn’t go and I was fired Monday. \n\nThe owner though he was the wolf of Wall Street the way he would organise seminars about how to sell a pen. \n\nWe were a movie theatre.",
   "created_utc": 1691508683,
   "score": 53,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvb70jc",
   "message": "I got fired because in the middle of an ISO audit, as the company’s recently hired ISO internal auditor, I refused to commit fraud by backdating some signatures.\n\nFuck em",
   "created_utc": 1691508342,
   "score": 42,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvb2tik",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15lfece"
  }
 ]
}