{
 "submission_id": "15lfece",
 "title": "Why did you get fired?",
 "selftext": "",
 "created_utc": 1691493846,
 "permalink": "/r/AskReddit/comments/15lfece/why_did_you_get_fired/",
 "score": 163,
 "url": "https://www.reddit.com/r/AskReddit/comments/15lfece/why_did_you_get_fired/",
 "comments": [
  {
   "comment_id": "jvabcsd",
   "message": "His wife thought he was having an affair with the office manager.\n\nHe asked me if I thought it was possible that he was having an affair with the office manager. \n\nI said, “It’s possible, but I don’t think you are. I could see why your wife might think so too.”\n\nI was 21 and naïve as hell. Never should have said anything.",
   "created_utc": 1691494178,
   "score": 24,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvacwe4",
   "message": "Came down with bronchitis. Doctor provided doctor's note and told me to return Monday, they terminated me Friday.",
   "created_utc": 1691495071,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvabmza",
   "message": "I got fired once for putting in my 2 week notice. \n\nThe only other time I've gotten fired was working for a trade company, during the first week. I was a supervisor, and there was a second supervisor on site. I got a call that my wife had been rushed to the hospital, which was literally less than a mile away. I asked the other supervisor if I could go to attend to her, and he said \"sure, no problem, I've got things here. Go.\" I returned to the job site later to find the boss there, and he let me go on the spot for leaving the team \"without a supervisor\". He knew what had happened, and still fired me. I won't lie, that one kind of pissed me off.",
   "created_utc": 1691494343,
   "score": 13,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvad4h5",
   "message": "I was jobless for 3 years. Did lots of online work during that time. Finally got a job. Forgot I got a job. Got a letter from my employer informing me that I got fired after a week",
   "created_utc": 1691495199,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvab9qg",
   "message": "I gave my boss the middle finger.",
   "created_utc": 1691494128,
   "score": 7,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvacgad",
   "message": "They blamed me for poorly teaching me the job.",
   "created_utc": 1691494813,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvadawv",
   "message": "I stopped coming to work because I no longer felt safe, nor comfortable at that job. This was about 10 years ago.",
   "created_utc": 1691495299,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvae7p5",
   "message": "I talked my way into a job at a software company when they put a hiring notice in a local paper. I had no idea what the software did. I still don't. They hired me as a trainer and no one ever explained what the product was. I did a few weeks where I was trained on the software but literally none of it ever made sense to me. It was like they were speaking gibberish. One day I showed up, a lady I had never seen before gave me a check, and walked me out to the parking lot. No one even ever said \"you're fired\" or anything. It's one of the strangest things that ever happened to me.",
   "created_utc": 1691495800,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvadolq",
   "message": "I was an entitled little shit with a summer job between my junior and senior years in college.\n\nI thought I was getting a “data entry” job.  It was indeed data entry to an extent, but most of the work was actually taking items off the shelves in a warehouse and taking pictures of them.  (These pictures would be scanned and then entered into a system with a description.)\n\nI thought this was below somebody with my “obvious” skills as an engineering student (who had failed to secure a summer internship in his field).  I told my boss that the work was really a two person job — the other person could do the warehouse stuff — and she agreed and said she’d look into finding another intern to help.\n\nI took that to mean I could slack off posting on Warcraft 3 forums all day until they hired the other guy.\n\nOne day I came home to a voice mail telling me to not bother coming back.\n\nI 100% deserved it. I hate my younger self sometimes…",
   "created_utc": 1691495510,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvad9on",
   "message": "For getting lunch. I was 18, working at a mall kiosk with a \"manager\" title even though I managed nothing for something like $8/hour. \n\nHours painted on the door, 0 support or other employees to relueve for a break. The owner showed up while I had locked up to go get a bite to eat.  Fired on the spot.",
   "created_utc": 1691495280,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvadnt4",
   "message": "A business I went to long ago was hiring and I got the job. Right after I signed all the paperwork, the department manager comes in and asks who I am. I tell him I was just hired as a temp. Manger says he never authorized any hiring and fired both me and my boss on the spot. I did not work for this company at all and they fired me. :(",
   "created_utc": 1691495498,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaevqh",
   "message": "I got fired for submitting my time sheets on Monday at 8am when I got into work.  By policy, they were to be in by noon on Saturday, but my Fridays ended in the field so I just did then on Monday mornings.  My bosses didn't even look at them until noon on Tuesday so it had 0 impact on them.  I drove home from being fired feeling relieved because of how unhappy I was at that job.",
   "created_utc": 1691496167,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvadjey",
   "message": "Because my job is moving to Lisbon and I am not.",
   "created_utc": 1691495430,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaecn4",
   "message": "I went to the Emergency room instead of work. Came back with an ER note and they said “We won’t be needing that. Can you come with us?” I was 18 and it was my first full time job.",
   "created_utc": 1691495876,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvadq4k",
   "message": "Got fired 30 years ago for drinking too much tea while shrink wrapping Garners pickled onions. Even though it was getting the job done because it made other people complain that I had an easy job and I told them they were being ridiculous. Still the best pickled onions though.",
   "created_utc": 1691495533,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaei09",
   "message": "My panic attacks lol.\nI was 18 and worked at a busy af hospo job and got so overwhelmed I thought I was gonna throw up every shift. It meant I’d be kinda slow and more likely to fuck up and then I’d get yelled at and it’s make it worse.\nI never told anyone I was struggling they just thought I was a dumbass. \nThey fired me in a real mean illegal way and it messed with my confidence for ages. \nAlas figured out those sorta jobs weren’t for me. Crazy respect for people who can just be chill when customers yell and swear at you all the time",
   "created_utc": 1691495958,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaf1d6",
   "message": "Told my boss I was doing too much work for not enough pay that's why nobody stays",
   "created_utc": 1691496252,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvafwrx",
   "message": "Worked in a DIY store, 10 minutes before my shift ended I moved a pallet cage of paint cans (slowly) to the warehouse and when I got in there one of the sides came off along with half of the paint cans which spilt all over, anyway there was about 2 minutes of my shift left, so I moved the pallet over the paint, covering it a bit and went home. It was all caught on CCTV",
   "created_utc": 1691496709,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvac3yo",
   "message": "Because I am habitual of speaking truth without any fear..",
   "created_utc": 1691494616,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaboe1",
   "message": "For not taking overtime.   \n\n\nDude, my time is more worth then your minimum wage money.",
   "created_utc": 1691494366,
   "score": 2,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaau6e",
   "message": "For being single.",
   "created_utc": 1691493874,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvab92d",
   "message": "I only got fired at",
   "created_utc": 1691494117,
   "score": 0,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaclpb",
   "message": "I had too much gasoline on me",
   "created_utc": 1691494899,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaezqt",
   "message": "We formed a union and then the pandemic hit and they laid off all the unionized workers 🫨",
   "created_utc": 1691496227,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvae50i",
   "message": "Fear of heights",
   "created_utc": 1691495758,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvae6nw",
   "message": "I signed in 5 minutes early so I could go to the loo, couldn't have that apparently because other employees would see that I signed in early and want to do the same lol",
   "created_utc": 1691495785,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaehm0",
   "message": "TLDR: boss set me up to fail \n\nI was hired by someone who knew I had no previous experience, but thought I had a great capacity to learn and liked my character. He and another senior manager took their time to teach me my role and answer any questions I had, and told me to always come find them if I felt unsure about something. \n\nThen they both left the company rather abruptly, and my new boss was the total opposite of them. He let me know right off the bat that had it been up to him, he would have hired someone with more experience. When I tried coming to him with problems, he told me it wasn’t his responsibility to answer questions and to ask my coworker instead. I lost my sense of direction and my work suffered for it. He fired me about a month after he took over.",
   "created_utc": 1691495952,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaekh1",
   "message": "Well I was kinda half ready to quit anyway. But one of my co-workers became \"friends\" with the boss. She was always crawling up her ass and she drove me insane. The boss was a stupid bitch too. One day on the day I was supposed to work by myself, little buttkisser came in and tried to boss me around. I basically lost it at her and she went out and cried. I actually felt kind of bad, (even if I didn't have to because she just got her just desserts looking back at it). I tried to call my boss to get her number to call her and I got ripped to shreds and she came and took the key off me... If I had had my way again I would have hung up on her face and closed the shop and went home. The stupid bitch tried to even be friendly and happy to see me when  I ran into her randomly after it all happened 😂🤣 make me wanna puke.",
   "created_utc": 1691495996,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaf25y",
   "message": "Alcoholism that came about during the pandemic lockdown. I didn’t get myself help in time. I am now taking care of elderly people and making almost half of what I was in the corporate world.",
   "created_utc": 1691496264,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaf7nf",
   "message": "Because my job \"was eliminated\". This was code for \"getting rid if you and hiring someone to replace you at half the salary.\" Their scheme was less than a stellar success because: The person they hired was an idiot and could not do it, the customers got severely pissed, they gave me $15K severance if I promised not to sue them, I took their money and still sued them for age discrimination, and won.",
   "created_utc": 1691496343,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvafdni",
   "message": "I was on a leave of absence, for mental health reasons. During this time my foot began to swell for no damn reason. I began hearing voices and forgot I had a job at all to contact",
   "created_utc": 1691496428,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvafn96",
   "message": "Difficulty remembering names.\n\nA real handicap when you're a teacher and you blank on your students' names.\n\nAnd when you're teaching English in a foreign country, they assume it's because you're a racist piece of shit.",
   "created_utc": 1691496568,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvafs08",
   "message": "the only job that’s ever fired me was because i made a post on my facebook about a rude as fuck customer and it got back to my manager",
   "created_utc": 1691496638,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvafsss",
   "message": "I didn’t get fired, how dare you suggest that I did",
   "created_utc": 1691496650,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvag0wu",
   "message": "Because I didn’t fit the team",
   "created_utc": 1691496769,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvag27v",
   "message": "Kamikaze situation where I stood up to my bullying manager in a group email using some of his own petty tactics against him.\n\nA number of more senior people than him gave me off the record kudos but the manager made a stink and demanded I be fired or he'd quit. He quit two days later and I was put on a PIP with unmeasurable completion benchmarks.\n\nThey fired me 30 days later and I didn't even care. The company was trash, they routinely abused salaried employees with impossible workloads, and with the insane hours I had to work while there I was essentially making minimum wage.\n\nI started a contract tech job about 8 weeks later at 25% higher pay, a hard 40 hr p/w cap and an additional 10 days of PTO so it was totally worth it.",
   "created_utc": 1691496789,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvag4u5",
   "message": "I was a young and inexperienced bartender, and I overserved someone. They were so drunk, an ambulance had to come and take her. I thought my life was over. But one of my co-workers was an EMT at the time, and she said don't worry about it, they have no interest in coming after you. I actually asked the manager to fire me because I was so negligent. She reluctantly did, we parted on good terms.",
   "created_utc": 1691496827,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagcxd",
   "message": "I went to lunch with a manager in a different department, and he did some errands too. I kept telling him that I only had an hour. My manager contacted me via our walkie talkies and had me call in so he could fire me.\n\nIt was ok. I was moving out of state the next week anyway, and had already tendered my resignation.",
   "created_utc": 1691496945,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagd33",
   "message": "I got into an argument with the general manager, and made her look dumb in front of the district manager (her boss).\n\nThe pizza store I worked for got a new general manager. She only got the job because her best friend was the wife to the district manager. GM never did anything useful. If she was helping the cooks made the orders, and it got busy, she would get frustrated, then run to hide in the office because \"I'm too stressed\".\n\nShe had a rule that the delivery drivers were required to wear an apron when removing items from the oven. I never followed this rule, as most of the time, the oven would be so backed up, the 3 seconds it would take to put on an apron, would cause the food to get smashed or pushed off the ledge.\n\nOn the day in question, as usual, the oven was backed up, so I just went straight into boxing everything with no apron. GM sees me, gets mad, yells at me that she's go it, and for me to go to the back and get an apron. So I do as told. I'm in the back with an apron, doing something else, because she didn't tell me to come back 🤷‍♀️ A few minutes later, she comes storming to the back to find me, screeches at me for not helping her, and questions why I wasn't wearing an apron.\n\nI repeat to her, as mentioned above, and also what I've told her multiple times, the little time it takes to use an apron, is a little time too long. She gets mad, and asks why I didn't come help her. I replied that she  told me to get an apron, but she said she could handle the oven, so I found something else to do.\n\nRealizing I was right, she was at a loss for words, got flustered, and retreated to hide in the office. The DM saw the whole thing. GM fired me 2 days later. I asked for a reason, she said \"we don't need you anymore\".",
   "created_utc": 1691496948,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvageho",
   "message": "Got fired for threatening to cut the brakes on my manager’s car.  He had no idea if I was serious or not.",
   "created_utc": 1691496967,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagg5z",
   "message": "I couldn’t help myself from taking the piss out of the creative director for dressing like a pirate. Which to be fair, he fucking did.",
   "created_utc": 1691496992,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagjn5",
   "message": "Record store. I refused to sell blank cassettes as an add on sale in the age of burnable CDs.",
   "created_utc": 1691497041,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagmm6",
   "message": "I got fired because I was goofing off. The manager said I'm a distraction to the company.",
   "created_utc": 1691497085,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagmuh",
   "message": "Reading during my lunch break 🙄",
   "created_utc": 1691497088,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagnz5",
   "message": "I have ADHD and the nationwide shortage of ADHD meds caused me to not be able to take it every day. Job accused me of being high. After that I left, should have stayed on until they fired me officially.",
   "created_utc": 1691497105,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagpdb",
   "message": "I accidentally played marriage counselor instead of being a coworker, oops!",
   "created_utc": 1691497125,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagqp5",
   "message": "I didn’t go to a meeting. Still technically employed since they never gave me any formal papers or notice or even told me. They just didn’t schedule me again",
   "created_utc": 1691497144,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagv1f",
   "message": "Well...",
   "created_utc": 1691497205,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvagx2f",
   "message": "I refused to repeatedly lift 70lb boxes onto moving pallets all day for $8/hr. That's half my weight.  I started on the assembly line. I was moved to the boxes after other box guys quit.\n\nEdit: Idk if I quit or was fire. I just didn't come back to work. On the 2nd day, my boss called and asked me what's up. I told her that I didn't plan on coming back. She said ok, she'll handle that.",
   "created_utc": 1691497234,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvah00d",
   "message": "Many times - as I got older if you fucked with me pay the price,cause your getting fired with me. Yeah I chased a dude down with a steel\nPipe in front of the new owners cause I had enough and me quitting wasn’t enough. I blew it up so big they fired a few people. Don’t fuck with someone with FU money",
   "created_utc": 1691497275,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvah6m4",
   "message": "For not giving a customer enough sauce with her order. Apparently she called up, complained and claimed I refused to give her any. Pretty sure they were looking for an excuse because I was pushing back against the insane working conditions",
   "created_utc": 1691497368,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvah6pq",
   "message": "I wasn’t able to fold clothes nicely",
   "created_utc": 1691497370,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvah6ps",
   "message": "No call, no show. It was really more me quitting because the job was stressing me out and kept adding responsibility while barely keeping ahead of minimum wage, but they probably look at it as firing me.",
   "created_utc": 1691497370,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvah7ls",
   "message": "Snarfing in the boy's room",
   "created_utc": 1691497382,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvahltx",
   "message": "Worked for a husband and wife team when I was in college at a small real estate company. Wife fired me because the husband was starting to get handsy and very “friendly” with me.",
   "created_utc": 1691497585,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvahplw",
   "message": "For being too good at a job. Did bar security, and this particular bar saw it a bad thing that I caught fakes, refused to let minors in, and was willing to physically put myself into danger to protect staff and customers. They were looking for more of a seat filler so they can say they have the legal obligations to run a night club…",
   "created_utc": 1691497638,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvahskk",
   "message": "To this day I don’t really know.",
   "created_utc": 1691497678,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvahsl6",
   "message": "I did the night audit at a hotel. 3rd shift, and no one else was there all night.  One evening I had my then girlfriend (this was the year 2000) stop by, and we had sex in the managers office. The next day, I get called in, and she pulls up video of me getting a blowjob in her chair! As I was sitting there, right next to her, and she was sitting in the same chair.  I was a young, couldn't care less punk kid back then. The manager said \"you know we have to let you go, right?\", right after telling me they had installed cameras all over a week prior. I swear she liked the video a little too much, she didn't look mad at all. And as she let it play,  her eyes didn't leave the screen. AWKWARD!!!! She kept letting it play as she was talking to me about the situation. \n I was a young, 23 year old guy, she was a middle aged unmarried lady. I asked for a copy of the tape before leaving.",
   "created_utc": 1691497678,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvahz18",
   "message": "The store had three people working their asses off in receiving. Two-thirds of inventory was regularly returned. They had one person in returns, me, and it all had to go to about twenty different places. Asked for a coworker working same hours as me but only had a small space and one computer. Only after I got let go, two days after Christmas, did I find out one of the last guys also got fired and the person who replaced me also was fired.",
   "created_utc": 1691497767,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvahzk4",
   "message": "i got fired from a fast food job because our idiot boss printed up the schedule with everyones pay rates on it and we saw that the new ass kissing hire was making 30% more than the rest of the peons, more than even shift managers.  so i made sure the night shift knew they were getting screwed over.",
   "created_utc": 1691497774,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvai38w",
   "message": "The managers dog sitter/my new coworker didn’t like me. When I applied I put in my college school schedule \u0026amp; it obviously got approved. When coworker went to put in their school schedule two months later (one week before school started) it got denied because mine was approved for the same hours. Coworker told me I needed to change my school schedule \u0026amp; I said no. She ended up starting rumors which I decided to ignore \u0026amp; she told the manager to fire me. So the manager did. When I asked what the reasoning was that I was fired the manager couldn’t give me any reason whatsoever.",
   "created_utc": 1691497824,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvai3nr",
   "message": "Charged a reactor wrong, 1.5 million $ mistake\n💔💔💔😔😔😔",
   "created_utc": 1691497830,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvai4nu",
   "message": "I refused to come in 15-20 mins early unpaid for my shift. I was always 5-10 min early but they decided they wanted me there earlier. I carried on as normal as I’m not coming in if I’m not being paid. Turned up for a 12pm shift at 11:49, no one would look at me when I arrived then was thrown in a meeting and fired for being “late”. Was out the door before it even hit 12.\n\nIt was the only time I’ve ever been fired.",
   "created_utc": 1691497844,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaiber",
   "message": "Almost 30. I’ve only had 3 jobs and never been fired. Honestly I think it’s crazy that people get fired as often as they do. \n\nI’ve seen three people get fired. One dealing drugs in the drive thru, one missed two weeks of shifts with call ins, and one missed 14 out of 20 days in a month. His best excuse was that his brother parked behind him",
   "created_utc": 1691497934,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaibkj",
   "message": "In college I had a temp job doing quality assurance. I figured out their internal site had profile pages that freely allowed the execution of Javascript in the form fields. I thought it would be funny to make my profile look crazy, changed colors, added some animation. This way when you went to the list of employee profiles you might get a chuckle and it would bring attention to the fact that it allowed executing code. Something I already brought to their sttention previously. \n\nAnyways I got fired for \"breach of security\"  lol",
   "created_utc": 1691497936,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaifkl",
   "message": "It was 1973 , working at Mickey -Ds. Redneck manager says \"go get a haircut, then you can come back\". I didn't go back. Ponytails rule.",
   "created_utc": 1691497990,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaifsk",
   "message": "Covid-19 forced company wide layoffs.... was kinda a blessing in disguise. Was miserable at that job even if I was making 80k/yr... now I make 1/3 of that and Im way happier",
   "created_utc": 1691497994,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaigae",
   "message": "I went to a temp. agency because my friend was going. I figured I'd tag along and fill out an application. I got a job at the local landfill and worked an entire day. I got fired the next morning because I was only 17. They looked over the paperwork the agency had sent over and they couldn't do it. \n\nWorst part is that my ride had already left.",
   "created_utc": 1691498000,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaijm5",
   "message": "Manager (typical over-educated mediocre Boston fauxminist) got weary of me making her look bad to the real boss (sorry, but she just made it SO easy) and made up stories about how I was slacking off.  Real boss stupidly trusted her, so out I went.\n\nFast-forward a few months, and she gets busted having my replacement (who she hand-picked) do work for her personal business on the clock.  I smiled a lot the day I found out.",
   "created_utc": 1691498046,
   "score": 1,
   "submission_id": "15lfece"
  },
  {
   "comment_id": "jvaiksk",
   "message": "Made a dirty joke to someone I knew who also worked there, someone over heard me from the corridor and thought I was sexually harassing them. Was sent away a few days later even though the friend said it was a joke and she found it funny.\n\nIt was a awful job anyhow and neither of us work there anymore and we still laugh about it to this day so not all bad.",
   "created_utc": 1691498061,
   "score": 1,
   "submission_id": "15lfece"
  }
 ]
}