{
 "submission_id": "15ljo1z",
 "title": "What is the worst mistake of your life?",
 "selftext": "",
 "created_utc": 1691504630,
 "permalink": "/r/AskReddit/comments/15ljo1z/what_is_the_worst_mistake_of_your_life/",
 "score": 55,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ljo1z/what_is_the_worst_mistake_of_your_life/",
 "comments": [
  {
   "comment_id": "jvbdrdp",
   "message": "Trusting a supervisor and believing that people at my job will “do the right thing”.",
   "created_utc": 1691510818,
   "score": 53,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvb0kkz",
   "message": "I have many, but the worst could be isolating myself from the real world to the point I started to experience symptoms of psychosis.",
   "created_utc": 1691505898,
   "score": 140,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvaxiy3",
   "message": "switched from beer to vodka.\n\nspent the next 12 years drunk\n\n3 years sober",
   "created_utc": 1691504694,
   "score": 95,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbgm1u",
   "message": "Working my ass off getting 3 useless degrees. I fell into the trap of believing that high grades and multiple degrees = good, stable, high paying jobs. Lmao. Looking back I can’t believe I was so naive",
   "created_utc": 1691511876,
   "score": 29,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbdqvv",
   "message": "Getting married. Or \"marrying the wrong person\" would be more accurate, I guess. \n\n\u0026amp;#x200B;\n\nWe got married in 2001 and just divorced in April, but I left her (for the last time) in 2015 after getting solid proof that she had been cheating. She now has 4 kids by 4 different guys. Three of them born while we were together and just 1 is mine... Tip of this depressing iceberg, unfortunately.",
   "created_utc": 1691510813,
   "score": 216,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbanab",
   "message": "Not paying off my mortgage 17 years ago when I had the money. Instead I used it to renovate my house to add two bedrooms and a den. At the time I thought it was more important for each of my four kids to have their own room (they were sharing two each before then) and a bigger family room. I’m kicking myself because had I used the money to pay off the mortgage instead, I’d have had an extra $3000 a month in my pocket. I could have saved up that money and extended my house a few years later.",
   "created_utc": 1691509681,
   "score": 205,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbgkim",
   "message": "Being mean to my wife and son when I was younger.  \nWe got married at 18 and I was just immature and was always taking my job home and just getting upset over really nothing ….     \nWe’re still married after 32 years and over past several years I have came to realize how lucky I have them in my life.and will do anything for them. \n😎😎",
   "created_utc": 1691511860,
   "score": 187,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvb58y9",
   "message": "Trying to help people that didn’t deserve it",
   "created_utc": 1691507685,
   "score": 186,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvb6zbr",
   "message": "Putting absolutely everything I had into to getting a degree and subsequently a job in a field I could honestly not care less about. Now I'm rotting in a job that I can't stand because I will never make this much money ever again.",
   "created_utc": 1691508329,
   "score": 115,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbe10q",
   "message": "Letting a shitty controlling girlfriend convince me to quit my band. I don't think we would have made it big or anything, but they were my best friends and she treated me like garbage. I was trapped in emotional abuse and manipulation from age 18 to 20. The ultimatum between her and the band could have saved me all that misery if I had just made a wiser choice.",
   "created_utc": 1691510917,
   "score": 134,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvb233u",
   "message": "Not saying three words when they would have made all the difference.\n\nEdit: posted below in spot to another comment asking for more info.\n\nI grew up with a girl. She was my best friend throughout all of school and the only one to stand up for me against bullies.\n\nWe were…close and I eventually developed some very strong feelings for her. But having zero self confidence, I kept my mouth shut, thinking that I’d been friendzoned.\n\nAs we moved through school, we were split up and put into different classes. We tried to keep up but eventually drifted apart (this was pre-social media and mobile phones) and eventually our lives took different paths.\n\nWe bumped into each other now and then but she was always involved with someone at the time so we kept things pleasant and went our ways. We both got on with our lives, moved on and soon settled down, starting families of our own.\n\nFast forwards a decade or two and we end up applying for the same job so now we work closely together. It was like 25yrs hadn’t happened and we went straight back to being best friends. She confessed to having unresolved feelings for me too and that she never made a move because she also thought she’d been friendzoned.\n\nHad either of us said something, the course of our lives could have been very different. For now, we’ve talked it through and agreed on boundaries, lines that can never be crossed. Still fucking hurts though.",
   "created_utc": 1691506479,
   "score": 47,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbc71x",
   "message": "Choosing the wrong major in university and now i'm stuck in my career",
   "created_utc": 1691510244,
   "score": 83,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbbg6j",
   "message": "Not being a better person. I was a stupid teenager, did stupid teenager things. If I could go back, I would have not done stupid teenager things.",
   "created_utc": 1691509973,
   "score": 212,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbmxl4",
   "message": "My Mom died. I got over 80k in life insurance money. After paying for her funeral and paying off debt, I bought a new car and looked at some houses but never got offers accepted. I wasted the rest of the money mostly on weed and alcohol just trying to feel better. Now I'm broke. But I'm 28 days clean and trying to pull myself out of my funk and live better. I am 2 months into a new job and plan on seeking help when I get health insurance again. I'm also considering finding a new job with higher pay.",
   "created_utc": 1691514210,
   "score": 194,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbf73i",
   "message": "Not applying myself in high school courses. I had a number of college level dual-credit courses which I intentionally slacked in, resulting in poor grades. \n\nNow I am in my 4th year of university and am still working my grades back up, as well as wishing I had paid more attention. I could have graduated by now had I not made that blunder.",
   "created_utc": 1691511351,
   "score": 229,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbfjj6",
   "message": "Falling for that one girl.",
   "created_utc": 1691511482,
   "score": 153,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvaxtkr",
   "message": "Not learning how to ride a bicycle when I was a kid. \n\nNow I am too scared of even trying.",
   "created_utc": 1691504811,
   "score": 81,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbjst3",
   "message": "Not knowing that my wife and I are both carriers for a rare terminal genetic disease called krabbe disease. Both of my daughters are fine, but my son has the disease and started developing symptoms at 18 months old. Now our entire lives are completely flipped upside down.\n\nWe want to spread awareness that we didn’t have. His page is called Prayers for Arthur, Hope for a Cure. He's such a sweet boy. We just want to keep him as comfortable as possible. Thank you for all of the nice and encouraging comments.",
   "created_utc": 1691513053,
   "score": 212,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbkajb",
   "message": "Cheating. Never again.",
   "created_utc": 1691513236,
   "score": 156,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvb0r2x",
   "message": "Being content with being alone and not trying to meet new people, Now im all alone :(",
   "created_utc": 1691505968,
   "score": 111,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbakel",
   "message": "Marrying my ex husband.",
   "created_utc": 1691509652,
   "score": 53,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbfx75",
   "message": "I once had to cancel a reservation at a Michelin star  bistro..\n\nWorst missed steak of my life.",
   "created_utc": 1691511624,
   "score": 151,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbiksy",
   "message": "Not working on acquiring a second language earlier. I practice daily now, but wish I'd started sooner. No time like the present, though!",
   "created_utc": 1691512600,
   "score": 179,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbfjcx",
   "message": "Introduced my girlfriend of 3 years to a new friend that I met at college.\n\nWithin a few weeks, she was cheating on me with him.  \n\nI'm sure we would have broken up eventually, but it just hurts even more knowing that I introduced her to the guy she would cheat on me with.",
   "created_utc": 1691511480,
   "score": 186,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbnxuj",
   "message": "Years of untreated mental illness",
   "created_utc": 1691514580,
   "score": 225,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbitly",
   "message": "Lying... \n\nAlthough I'm working on it I still can't get over it no matter the scale",
   "created_utc": 1691512689,
   "score": 108,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbn1xd",
   "message": "Letting my mother have complete control of my finances when I got my first job. She stole everything from me.",
   "created_utc": 1691514254,
   "score": 135,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbl284",
   "message": "Oh, Honey where do I begin?",
   "created_utc": 1691513520,
   "score": 90,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbcvy0",
   "message": "Trusting the man I married.",
   "created_utc": 1691510496,
   "score": 53,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbadgh",
   "message": "Installing the Reddit App.",
   "created_utc": 1691509581,
   "score": 251,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbmbcu",
   "message": "Smoking pot every day for 20 years",
   "created_utc": 1691513979,
   "score": 103,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvb75od",
   "message": "Marriage",
   "created_utc": 1691508394,
   "score": 50,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbletl",
   "message": "Not trusting my gut instincts and allowing emotions to change my mind about agreeing to get married. \n\nTwice. I didn't fucking learn and I'm paying for it now.",
   "created_utc": 1691513649,
   "score": 47,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbj3f1",
   "message": "Failing out of college. I eventually graduated from a lesser school, but I think it affects me to this day.",
   "created_utc": 1691512791,
   "score": 43,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbod9b",
   "message": "Smoking my first cigarette. No doubt.",
   "created_utc": 1691514738,
   "score": 134,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbs1fe",
   "message": "Cheating on my girlfriend, we were able to sort shit out, but it took very long to build the trust basis again and even tho everything turned out good, it's still by far the biggest mistake I ever made !!",
   "created_utc": 1691516074,
   "score": 25,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvb3l7j",
   "message": "Not having my parents arrested for abuse.",
   "created_utc": 1691507059,
   "score": 107,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbdenq",
   "message": "Loved someone too much.",
   "created_utc": 1691510690,
   "score": 38,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbfvex",
   "message": "Taking that first prescribed dose of benzodiazepines",
   "created_utc": 1691511606,
   "score": 43,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbh71i",
   "message": "Not switching majors when I still had time and motivation to study. From the third semester on I knew I would gain zero benefit from this degree, and wanted that to change.\n\nMy parents, having zero clue about higher education whatsoever, flat out told me that I will finish my studies or they will not help in any way from that point on, financial or otherwise. They just needed someone with a degree in the family, someone \"to be proud of\".\n\nI got the degree with a 4.4 GPA, hated every second of it and Covid pretty much put the final nail in the coffin. My social life crumbled to nothing, and now I can't even get an interview for a fucking data entry job.\n\nThe funniest thing is, you get 6 \"free\" years of uni/college in my country, and I would have had plenty of time to change majors and complete it without paying a dime.",
   "created_utc": 1691512091,
   "score": 48,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbiag6",
   "message": "Smoking.",
   "created_utc": 1691512494,
   "score": 35,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvb2b5i",
   "message": "Not being able to share my true self and speak out, now I’m the weird quiet person",
   "created_utc": 1691506565,
   "score": 55,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbntg0",
   "message": "Not cancel subscription on time",
   "created_utc": 1691514535,
   "score": 50,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbinzx",
   "message": "Getting my gf pregnant. \n\nMan am I fucked when that kid comes.",
   "created_utc": 1691512632,
   "score": 75,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbfjax",
   "message": "be born",
   "created_utc": 1691511479,
   "score": 47,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbdbs4",
   "message": "Might not be *the* worst, but I took too long to become a better person. It was hard, but not hard enough to warrant taking as long as it did.",
   "created_utc": 1691510660,
   "score": 31,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvazrpw",
   "message": "not saving up my birthday money while growing up",
   "created_utc": 1691505583,
   "score": 21,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvboncx",
   "message": "Not putting money away for savings early enough. start early!!! Make it automatic!!",
   "created_utc": 1691514842,
   "score": 219,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbrvk3",
   "message": "Timeshare",
   "created_utc": 1691516014,
   "score": 43,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbjcg4",
   "message": "Staying in unhappy relationships for too long.",
   "created_utc": 1691512885,
   "score": 49,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbnn4z",
   "message": "ruining my relationship with my best friend by constantly trauma dumping. she was also the first and only person I've ever been in love with.",
   "created_utc": 1691514470,
   "score": 56,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbwiss",
   "message": "Getting addicted to Reddit porn",
   "created_utc": 1691517694,
   "score": 19,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbn175",
   "message": "Not listening to my gut.\nIt was correct the whole time.",
   "created_utc": 1691514246,
   "score": 31,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbgz4n",
   "message": "Not realizing what I want to do in life earlier. Now I just constantly hear about kids years younger than me achieving stuff that's so far ahead of my current level. I'm pretty young and I'll catch up sooner or later, but it's still an irritating thought that I could be so much more if I started few years ago.",
   "created_utc": 1691512011,
   "score": 29,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbkw16",
   "message": "To not invest earlier",
   "created_utc": 1691513458,
   "score": 25,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbizwd",
   "message": "Letting others define my value as a person and let most of them decide my life for me.",
   "created_utc": 1691512755,
   "score": 15,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbkqut",
   "message": "Going to the University I did. \n\nI knew I was signing up for an advanced program but I never imagined the level of burnout I would experience and how soul crushing it is to know transferring out wasn’t even an option due to credits not counting for other programs. I was stuck in a catch-22 and hated every bit of the second half of my degree.\n\nI do enjoy the work I do and feel had I gone to a more typical college for the same degree I’d have been much better off mentally\n\n2.5 years out and my sleep/anxiety/stress levels are still not fully recovered.",
   "created_utc": 1691513405,
   "score": 14,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbnzj3",
   "message": "Going to college when I didn't know what I wanted to do. Went because it was \"what we were supposed to do.\" I went to a magnet high school, so we were never educated about professional certificates or given the tools to start our own business. We were just shuffled into college, because we were a \"gifted\" school. I even distinctly remember one of our teachers pointing to some of the construction workers out the window and telling us \"That's what happens when you don't go to college.\" Now I have my degree, way to much fucking debt and im not even working in the field I got my degree in. Thanks brainwashing!",
   "created_utc": 1691514597,
   "score": 48,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbrr2t",
   "message": "I thought if I was positive and receptive I would be able to climb and earn like my boss did.\n\nWasted 7 years making 8 bucks an hour under a boss who made 108/hr (one hundred eight, no typo) at a grocery store. plus Sunday pay.\n\nHe and I found out together that the union let corporate pull the ladder up behind them a decade before.",
   "created_utc": 1691515970,
   "score": 31,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbsnks",
   "message": "I quit a very good job in 2018.  I left due to a situation that would’ve only been temporary (didn’t know that at the time), and that will be a lifelong regret.  Who knows, things could’ve also gotten worse, but with the benefit of hindsight I could’ve dealt with things vastly different.",
   "created_utc": 1691516295,
   "score": 20,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbzoi3",
   "message": "Not buying a house when I was 8. I’ll never recover from this",
   "created_utc": 1691518851,
   "score": 146,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvc09ig",
   "message": "Forgetting to throw out defrosted calamari 😓\n\nFood poisoning so bad my appendix erupted",
   "created_utc": 1691519060,
   "score": 50,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvb8ucj",
   "message": "Wasting so much time on someone who is clearly an NPC.",
   "created_utc": 1691509016,
   "score": 28,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbfytt",
   "message": "[deleted]",
   "created_utc": 1691511640,
   "score": 12,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbh0qi",
   "message": "Not talking with my crush",
   "created_utc": 1691512027,
   "score": 12,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbh9jo",
   "message": "Not learning how to play any musical instrument.",
   "created_utc": 1691512117,
   "score": 17,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbm5bn",
   "message": "Choosing drugs over everything. I wasted the past 10 years. I just started putting the pieces back together now, at 40 years old. I'm barely hanging on in every degree. I'm so thankful for my humble soul,  I'm sacred to think about myself without it.",
   "created_utc": 1691513917,
   "score": 27,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbf37t",
   "message": "downloading discord 😭",
   "created_utc": 1691511310,
   "score": 12,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbk8bc",
   "message": "So many to count",
   "created_utc": 1691513212,
   "score": 6,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbmx68",
   "message": "Letting alcoholism get the better of me to the point where it cost me a stable, well-paying job. But the silver lining is that it led to me getting the professional help I needed to get sober, and also to get real counseling and therapy for my problems, and I’m in a much better place now with my health.",
   "created_utc": 1691514205,
   "score": 22,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbnyd3",
   "message": "Moving to Canandaigua NY, if I were to list the reasons why, the list would be longer than I have to type",
   "created_utc": 1691514585,
   "score": 8,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbt8ch",
   "message": "Endured a bad relationship beyond my ability to cope and tolerate.",
   "created_utc": 1691516500,
   "score": 12,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbtdld",
   "message": "Selling my 99 ford explorer sport.  \n\nI know that sounds mild.  But a lot of the bad things that happened to me were either not a mistake of my own, or were important moments in my life for learning purposes.  \n\nI don't regret being in a terrible relationship for a number of years.  I learned so much from that and it put me in a place to meet someone wonderful years later.  \n\nI really miss that truck.",
   "created_utc": 1691516554,
   "score": 19,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbtiut",
   "message": "Not trying to figure out how to make money for being myself.",
   "created_utc": 1691516607,
   "score": 22,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbuniz",
   "message": "Ending things instead of saying what I was feeling.",
   "created_utc": 1691517012,
   "score": 18,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbzqqn",
   "message": "Cheers to 3 years sober! Here's to a new chapter filled with clear thinking and adventurous mocktails!",
   "created_utc": 1691518873,
   "score": 9,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvc1drg",
   "message": "Waiting a decade to get back on ADHD medication. \n\nMy life was in shambles for so long with finances, my career, etc. I got back on ADHD meds almost year ago and my life has completely changed. I’m more motivated, determined, and focused than I’ve been for a decade of my life now at 26 years old. I try not to think about it, but it saddens me to wonder where I would be now if I just got back on meds way back when. But I don’t believe in shoulda, coulda, woulda’s, you have to look to the future. And that’s exactly what I’m doing with the utmost optimism and hope.",
   "created_utc": 1691519465,
   "score": 20,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbch53",
   "message": "Dating a serial abuser and compulsive liar, who is now trying to ruin my career and spread lies about me.",
   "created_utc": 1691510346,
   "score": 27,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbd0dw",
   "message": "Not playing \"the game\" at work. Else I could have retired by now.",
   "created_utc": 1691510542,
   "score": 28,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbmc2d",
   "message": "Finding an old pack of cigarettes a month after I quit and thinking \"I won't get re-addicted, why not one last smoke? For old times sake.\"\n\nThen finishing the pack.\n\nThen thinking \"ok, one last pack, then that's it.\"\n\nAaaaand im right back where I started.",
   "created_utc": 1691513987,
   "score": 29,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbtha8",
   "message": "I made the worst mistake of my life every time I decided to stay with my (at the time, but now ex) boyfriend. I even agreed to marry him. It was a shit show of a relationship. I could talk all day about it and every time I retell it, the worse it sounds. Some days I wonder how I survived it. \n\n\nConversely, the best choice of my life was getting out of that.",
   "created_utc": 1691516591,
   "score": 11,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbl453",
   "message": "Everything",
   "created_utc": 1691513540,
   "score": 7,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbmuva",
   "message": "Wasting my time in school/college",
   "created_utc": 1691514181,
   "score": 6,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbn5am",
   "message": "I wouldn't say it was a mistake, but I wish I would have went to art school when I was younger.\nI'm thankfully natural at art and drawing, but would have loved to make 'art school' friends and connections.\nBut my father instilled in me, the fear of debt.",
   "created_utc": 1691514289,
   "score": 8,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvboa93",
   "message": "Not trying or saying that I had time. In my 20s friends we’re getting careers and families and doing things. I coasted without much accomplishment or life milestones and now I feel worlds apart from friends and people my age.\n\nDon’t be afraid to try and fail. Even a 1/2 effort is better than nothing. Just do",
   "created_utc": 1691514707,
   "score": 5,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbqk0w",
   "message": "Starting smoking nicotine",
   "created_utc": 1691515538,
   "score": 5,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbrw83",
   "message": "The drugs and the first wife at 20. No idea what i was looking for when I was that young. Divorced two years later, finally grew out  of the drugs, and thanks being smart enough to get counseling, my head is halfway on straight.",
   "created_utc": 1691516021,
   "score": 5,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbuukw",
   "message": "Not recognizing I wasn't ready for college after high school. I wasted 4 years of off and on classes that I usually just stopped going to before I joined the Marines. It was certainly good and bad times but enlisting was one of the best choices I've made. (Not a recruiter, I swear!) They don't treat you well, but the amount of personal growth was priceless.",
   "created_utc": 1691517083,
   "score": 22,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvc3mrv",
   "message": "Letting fear and anxiety hold me back when I was young.",
   "created_utc": 1691520271,
   "score": 5,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbk8ns",
   "message": "Starting dating a close friend after assuring her I was over my ex. Things went terrible and pretty sure I screwed her up emotionally for a while. We haven’t talked in 9 years.",
   "created_utc": 1691513216,
   "score": 9,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvboaoy",
   "message": "Not driving as soon as I could. The fear always weighed me down, but I'm getting there little by little, but I still gotta pull my head out of my ass.",
   "created_utc": 1691514712,
   "score": 11,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbp5uz",
   "message": "Ignoring the ‘you have a message’ beep on my flip phone, thinking it was my boss asking about the copier, only to wake up at 2am to 26 messages from my father and sister saying my mom had a massive stroke and asking where I was. Turns out it was cancer related. She passed three months later.",
   "created_utc": 1691515029,
   "score": 17,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbryii",
   "message": "God idk probably not buying enough sriracha before they stopped making it again.",
   "created_utc": 1691516044,
   "score": 10,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbl02n",
   "message": "Making a reddit account.",
   "created_utc": 1691513498,
   "score": 4,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbl3pl",
   "message": "Grand notion of what love is. Yeah…I am a jackass.",
   "created_utc": 1691513535,
   "score": 5,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbmdmk",
   "message": "Going to college.",
   "created_utc": 1691514003,
   "score": 4,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbohdp",
   "message": "Staring smoking, because it looks cool. All this money I have to spend now on nicotine patches, because I can't quit. I hope I move out of here soon so I get access to products with a smaller amount of nicotine in them which would make it easier to quit. However just the thought of it makes me want to take it.",
   "created_utc": 1691514780,
   "score": 4,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbrfjv",
   "message": "Spent too much time and money on studying courses that didn’t matter to me.",
   "created_utc": 1691515853,
   "score": 3,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbsdvr",
   "message": "Getting a degree just because everyone around me did it",
   "created_utc": 1691516198,
   "score": 11,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbte8i",
   "message": "Going to college. Spent a lot of money to be stressed and depressed.",
   "created_utc": 1691516560,
   "score": 6,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbv74k",
   "message": "Thinking that the friends I made in high school understood what loyalty was.\n\nThey did not.",
   "created_utc": 1691517210,
   "score": 6,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbwe85",
   "message": "Lust. Such a battle for Christians, and literally everyone else, its changes the way you observe people, and your thoughts. Wish my past self never got into it :(",
   "created_utc": 1691517647,
   "score": 4,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbqgqj",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvc19pc",
   "message": "Caring too much what people think.\n\nA lot of this is due to good Ole anxiety but I missed out on a lot of experiences and friendships just because I was afraid to let people know too much about me.",
   "created_utc": 1691519424,
   "score": 84,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvc3rnh",
   "message": "2 years on World of Warcraft",
   "created_utc": 1691520319,
   "score": 12,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbxwqr",
   "message": "Having toxic friends, always made fun of me and were really manipulative and narcissistic. Glad I stopped being friends with these ppl .",
   "created_utc": 1691518204,
   "score": 21,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvcdk3q",
   "message": "Doing a line of cocaine in 2017. By 2020 I was a full fledged addict. I have 14 months clean today.",
   "created_utc": 1691523870,
   "score": 34,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbu8h2",
   "message": "Failing to repay my now late mother-in-law the money she fronted us the money to buy new tires when we had so little. We eventually were very comfortable in our lives. I was so embarrassed. My then-husband presumed I had paid her back. I had not. He found out years later that I had failed to repay the debt. He was so angry and had every right to be. He wrote his mother a check though she didn't want it. She was wrong.  She was owed and shouldn't have pretended it didn't matter.\n\nI never apologized to her though I did to my husband. There was no excuse. I kept thinking at some point I would humbly admit to her my error in judgment. It bothered me, but I didn't. She died in an auto accident a few years later.\n\nI have forgiven myself for being that person. I know my ex never got over it despite my apologizing to him. He couldn't. My mother-in-law was a stellar human. I don't know why I kept putting off what should have been given. It makes no sense. \n\nThere have been many times I apologized to the ether knowing she is gone. She died knowing what a terrible person I could be. She never mentioned it to me. She never treated me in any way other than with love and kindness. I let myself down. I let everyone down. \n\nI have made plenty of mistakes in my life. I made efforts to make amends when I did. I asked for forgiveness and admitted my failures many times over my long life.  But for whatever reason, I failed her yet I adored her.",
   "created_utc": 1691516864,
   "score": 7,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbunkq",
   "message": "I left a gate open and a puppy died.\n\nI'll never forgive myself.",
   "created_utc": 1691517013,
   "score": 37,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvbzhxd",
   "message": "Not taking my mental health more seriously.",
   "created_utc": 1691518786,
   "score": 9,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvc2ghd",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ljo1z"
  },
  {
   "comment_id": "jvcce7u",
   "message": "Killing myself. \n\nI had attempted MULTIPLE times and landed in the ICU several of those times. \n\nI succeeded once. (I was revived.)\n\nAfter I was revived, I got into a treatment program that actually worked. (I'd been in and out of mental treatment for 15+ years) I entered recovery 10 years and 2 days ago. My life is amazing now. I was pissed as hell when I was un-un-alived, but it would have been such a huge mistake. \n\nI love being alive. I am thriving. I am happy. \n\nI still have severe depression, but I am now equipped with the tools and skills to conquer it. I have depression, but I do not suffer from it. \n\nLife is worth living, folks. It /does/ get better if you let it.",
   "created_utc": 1691523448,
   "score": 34,
   "submission_id": "15ljo1z"
  }
 ]
}