{
 "submission_id": "15lk8k3",
 "title": "Do you own a gun? Why or Why not?",
 "selftext": "",
 "created_utc": 1691505930,
 "permalink": "/r/AskReddit/comments/15lk8k3/do_you_own_a_gun_why_or_why_not/",
 "score": 134,
 "url": "https://www.reddit.com/r/AskReddit/comments/15lk8k3/do_you_own_a_gun_why_or_why_not/",
 "comments": [
  {
   "comment_id": "jvb0vtq",
   "message": "My dad gifted me a pistol. I use it for target shooting a couple times a year, other than that it stays locked up in a safe. Really it's for sentimental value more than a home defense thing",
   "created_utc": 1691506018,
   "score": 176,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb1g7h",
   "message": "Nice try ATF.",
   "created_utc": 1691506235,
   "score": 220,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb802o",
   "message": "No, it's hard to get one where I live and I'm depressed so buying a gun doesn't seem the most intelligent thing to do.",
   "created_utc": 1691508703,
   "score": 217,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb17l8",
   "message": "Yes. I’m poor so I go hunting. All my guns were family guns. Also have a bow",
   "created_utc": 1691506144,
   "score": 111,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbaxqy",
   "message": "I owned one when I was younger but then got a medical marijuana card and now I’m not allowed to own a gun anymore because everyone knows that weed makes ya violent and wanna shoot people",
   "created_utc": 1691509788,
   "score": 109,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb55ou",
   "message": "I don't, first because I can't afford one at the moment to legally obtain one.\n\nSecondly. I don't need it. I sleep naked. Any home invader will have to deal with my fat sweaty balls in their face",
   "created_utc": 1691507652,
   "score": 52,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbf3up",
   "message": "(I’m swiss 🇨🇭) I bought a sub machine gun three weeks before it got banned just to fuck the government. Later I found out that „banned“ guns just need a higher tier license and I could easily still get another one today. \nWell, I got four guns now.",
   "created_utc": 1691511317,
   "score": 51,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbfudv",
   "message": "I own a musket for home defense, since that's what the founding fathers intended. Four ruffians break into my house. \"What the devil?\" As I grab my powdered wig and Kentucky rifle. Blow a golf ball sized hole through the first man, he's dead on the spot. Draw my pistol on the second man, miss him entirely because it's smoothbore and nails the neighbors dog. I have to resort to the cannon mounted at the top of the stairs loaded with grape shot, \"Tally ho lads\" the grape shot shreds two men in the blast, the sound and extra shrapnel set off car alarms. Fix bayonet and charge the last terrified rapscallion. He Bleeds out waiting on the police to arrive since triangular bayonet wounds are impossible to stitch up. Just as the founding fathers intended.",
   "created_utc": 1691511595,
   "score": 45,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbf7oh",
   "message": "I don't,  mostly because I don't trust myself with a gun. I'm afraid I'd hurt someone or hurt myself by accident",
   "created_utc": 1691511357,
   "score": 111,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbf94u",
   "message": "Yes. I was injured in a mass shooting event but luckily it was just from a bullet fragment and I survived.\n\nI never want to be in a scenario again where I am a unwilling victim with no ability to fight back.",
   "created_utc": 1691511372,
   "score": 123,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb2hfk",
   "message": "Somewhere in a storage unit I haven’t seen, I have a .22 Ruger Pistol that my great uncle gave to me. So in super loose terms, I do own a gun, but functionally no. I don’t have a gun here because I just don’t really feel unsafe here, I am mentally ill, and I don’t think I would be able to point it at someone and kill them even if I were in a robbery situation",
   "created_utc": 1691506632,
   "score": 152,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb2hl6",
   "message": "Friend of mine was totally anti-firearms. Never argued about it or even talked about it much, k. I’m a moderate in a very liberal city.\n\nHer aunt got raped and stabbed repeatedly a few years ago, the guy got 10 years, served 3 (our state we doesn’t have money to keep people in prison).\n\nShortly after the release said friend and a lot of her relatives got their concealed carry licenses (I did not in any way suggest this). From “I would never have a firearm in my home” to asking for recommendations on which pistol to carry and range recommendations.",
   "created_utc": 1691506633,
   "score": 253,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbmbkj",
   "message": "No. I believe in gun ownership, but I'm a clutz, my wife is a clutz and we have offspring. We would be more of a danger to ourselves than any potential threats.",
   "created_utc": 1691513982,
   "score": 25,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbbbl6",
   "message": "Yes.  I live right on the border of extreme-have and extreme-have-not.  \n\nWhen rich kids want a thrill they rob my subdivision.  When poor kids want to rob a place cops don’t care about, they rob my subdivision.\n\nAnd when there’s civil unrest, my subdivision is halfway between the cops and the protesters much of the time.\n\nI’m just statistically likely to have to defend my house at some point.",
   "created_utc": 1691509926,
   "score": 211,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbpbc5",
   "message": "To all the folks saying they don't feel mentally stable enough, good on you for making the smart choice for your safety and others.",
   "created_utc": 1691515085,
   "score": 95,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb4zr7",
   "message": "one?   hahah, sure government, i just own one.",
   "created_utc": 1691507589,
   "score": 23,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbpdus",
   "message": "I do, where I live if I call 911 it's an hour or more away.",
   "created_utc": 1691515111,
   "score": 40,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbovy7",
   "message": "Yes I was a single mom for a really long time and lived alone and a man came really early in the morning and started kicking my door in I locked my girls in the bathroom and grabbed my Glock and had it pointed at the door in case I’m he came in luckily his weak ass w couldn’t kick my door in",
   "created_utc": 1691514928,
   "score": 70,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb5vif",
   "message": "Yes. Some inherited, some because I used to take public transit and I am a woman who likes to go camping alone, etc. Fun for recreation at the range as well.",
   "created_utc": 1691507923,
   "score": 190,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbepz8",
   "message": " No alphabet organization man, I do not own any guns.",
   "created_utc": 1691511173,
   "score": 17,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb1jg5",
   "message": "I want to. My country is dangerous and crime is increasing from joblessness. For now pepper spray is what I have",
   "created_utc": 1691506271,
   "score": 88,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbfea3",
   "message": "Nice try ATF…but they already know.",
   "created_utc": 1691511426,
   "score": 107,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbtx4q",
   "message": "nah i’m bri’ish innit bruv",
   "created_utc": 1691516750,
   "score": 29,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbokct",
   "message": "Numerous, I like well made mechanical things and they're just plain fun.",
   "created_utc": 1691514811,
   "score": 39,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb9wu6",
   "message": "Yes, because I am a girl",
   "created_utc": 1691509410,
   "score": 161,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbfzeg",
   "message": "I want to, but it's very difficult to get a gun here, lots and lots of process and takes more than a year. Instead I've bought a lot of cool knifes.",
   "created_utc": 1691511646,
   "score": 22,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb0r0g",
   "message": "If I did I would probably be dead",
   "created_utc": 1691505967,
   "score": 44,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbgjjo",
   "message": "No, I have mental health issues and don’t trust myself with a firearm. I do know how to use one though.",
   "created_utc": 1691511851,
   "score": 56,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb4or7",
   "message": "Yeah, i just think they're neat",
   "created_utc": 1691507475,
   "score": 145,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbpt4a",
   "message": "I own several because I enjoy shooting as a sport.",
   "created_utc": 1691515266,
   "score": 19,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbb94f",
   "message": "Yes, I live in the crime-ridden city of Philly, which doubles down every two years on its failed approach to solving said crime. Can’t trust the city to do its job anymore, so I am strapped.",
   "created_utc": 1691509902,
   "score": 40,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb6j3t",
   "message": "yes Because fucked up people exist",
   "created_utc": 1691508161,
   "score": 155,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbqhuy",
   "message": "Yes, survived a home invasion years ago. There are no kids in my house and I sleep so much better knowing it's right there.",
   "created_utc": 1691515516,
   "score": 16,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvc7b9f",
   "message": "Nope... Lost them all in a canoeing accident",
   "created_utc": 1691521601,
   "score": 8,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb4n2h",
   "message": "Yes but also no? There's guns in my house because my husband owns them. It took me a long time to get used to it and I have continually rejected the password to the gun safe. I tend towards depression and self-loathing, and don't want access to making a permanent mistake.",
   "created_utc": 1691507457,
   "score": 31,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb157f",
   "message": "No because I have bipolar and as much as I love guns shouldn't have one going to the shooting range is enough for me.",
   "created_utc": 1691506119,
   "score": 24,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbkn0i",
   "message": "Yes. I live around a lot of crazy gun nuts and wanted something for the home. Plus they go bang and that’s fun.",
   "created_utc": 1691513366,
   "score": 24,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb4qy1",
   "message": "Yes. I'm a young woman who tends to live life by myself. If I want to travel I'm not risking getting got. If I and my partner rides our motorcycles, cars can get aggressive and road rage is common. I'm going to keep us protected. Knowing I have one makes me feel better itself.",
   "created_utc": 1691507497,
   "score": 36,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvca6ze",
   "message": "Every gun I own has a different story as to why I own it.   Most are pretty lame stories though like, \"it was on sale.\"",
   "created_utc": 1691522649,
   "score": 7,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb3hqs",
   "message": "Nope i feel safe without one(countryside austria)",
   "created_utc": 1691507023,
   "score": 57,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvboqge",
   "message": "When seconds count, the police are just minutes away.",
   "created_utc": 1691514872,
   "score": 26,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbfkqf",
   "message": "Nope. Never had a reason to have one.",
   "created_utc": 1691511494,
   "score": 57,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb1ds4",
   "message": "No, I dont see the point in owning one, my country is quite secure on that. I never really liked guns.\n\nI own three swords though (one is an ancestral family sword though).",
   "created_utc": 1691506209,
   "score": 33,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbfrzq",
   "message": "No. I don't know how to use one and probably shouldn't be trusted with one.",
   "created_utc": 1691511570,
   "score": 28,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbttoq",
   "message": "I don't own a gun because of a time I had a home intruder.  That sounds counter-intuitive but the circumstances were a little complicated.  My mom was sick in bed with chemo when a gigantic man ran in through the front door screaming and yelling in a rage.  I didn't have a gun available to me easily at the time, so I grabbed a Japanese short sword I was given for completing a kendo program as a teen.  I reached the hallway at the same time he reached the door to her room.  He was near a foot taller than me, and I am 6', and clearly weighed 300+ pounds.  \n\n\nI was intimidated to run up to such a huge man and start hacking with a blade, not something I ever imagined myself doing.  My adrenaline was peaking and I was about to charge, but I stopped first and shouted, GET THE FUCK OUT OF MY HOUSE, in the meanest voice I have ever used.  The man turned and looked at me with eyes a toddler gives you when you shout at them for being naughty.  I immediately realized that I was dealing with a mentally disabled person, and that he meant no harm.  He was a severely autistic man who lived with the family that had just moved in across the street.  I was about 25, and had just moved back home a few days before to help take care of my Mom, and had never seen him before.  He was scared by me shouting at him, and ran home crying across the street.  \n\n\nI called the Sheriff.  They tried to blow it off and say he didn't know any better, I made it clear I didn't want him charged I wanted his family to know how dangerous this was.  I told the Deputy that I know for fact the houses on both sides are gun owners who would have shot him in that circumstance.  I then told him about my encounter and how I was ready to use lethal force.  This was in a state with castle doctrine so lethal force would have been 100% legally justified in that situation.  The Deputy went white when he realized this was nearly a fatality.  He went back to talk to the man's family.  \n\n\nThis was the last time I ever saw him, the family moved not long after.   I didn't feel too bad about my part in the situation, I responded the best I could in the moment.  I also realized that I am a person who is hyper defensive of my family.  Looking back I am 100% confident I would have fired instead of yelling if I had a gun in my hand, and a man who was no true threat would have died.  I don't want to kill someone unless there is no other choice, but with a gun in my hand I might not always see all the possible outcomes of a situation.  Maybe a day will come when I regret this choice, but so far it has not.  I do enjoy target shooting with other people's guns though.",
   "created_utc": 1691516716,
   "score": 12,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvb6sly",
   "message": "I....uhhh....[have one or two](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Fxef5iocl8dma1.jpg) \n\n\u0026amp;nbsp;\n\nI just think they're neat ☺️",
   "created_utc": 1691508259,
   "score": 79,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbf4gz",
   "message": "Shotgun.  I like skeet shooting",
   "created_utc": 1691511324,
   "score": 6,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbfrku",
   "message": "No, I suffer from depression and worry I would turn it on myself, which is the most popular form of gun death",
   "created_utc": 1691511566,
   "score": 17,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbwq7g",
   "message": "Yes, I’m a single woman living alone. Also, I like to hunt.",
   "created_utc": 1691517769,
   "score": 20,
   "submission_id": "15lk8k3"
  },
  {
   "comment_id": "jvbrzey",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15lk8k3"
  }
 ]
}