{
 "submission_id": "15lkgaa",
 "title": "What’s your worst roommate story?",
 "selftext": "",
 "created_utc": 1691506434,
 "permalink": "/r/AskReddit/comments/15lkgaa/whats_your_worst_roommate_story/",
 "score": 70,
 "url": "https://www.reddit.com/r/AskReddit/comments/15lkgaa/whats_your_worst_roommate_story/",
 "comments": [
  {
   "comment_id": "jvbdns3",
   "message": "In the course of a month or two, had the money to buy a: \n\n- 50-60 inch flatscreen TV\n- Xbox One\n- Ridiculously overpriced bong\n- Tabletop weed vaporizer\n- Fancy handheld vape mod whatever the fuck\n- Constant supply of weed, vape juice, and hard liquor\n\nBut when I go to the rental office to pay my half of the rent, I'm the one that gets threatened with eviction because he hasn't given them a dime in three months. Also, most of the utilities were in my name, except for gas, which got shut off every couple months because he couldn't be bothered to pay it, then had the audacity to complain to me how he was going to get sick because he had to take a cold shower.\n\nHaven't spoken to him since before Covid. Last time I heard he was living in a shittier apartment, with terrible neighbors, sleeping in a makeshift hammock while cooking his one meal a day on a hotplate.\n\nFuck him.",
   "created_utc": 1691510782,
   "score": 58,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvb8q3l",
   "message": "Not really a \"bad\" story but it was so awkward. I had a girlfriend a few years ago who lived with two (female) flatmates. The walls were fairly thin apparently... but I didn't know that. So the first night I stayed with my girlfriend, obviously, we fucked. And we were not quiet. I mean not screaming either but not really doing any efforts to be quiet because we didn't know the walls were paper thin.\n\nHer roommate, the next day during breakfast when we were all eating together, told us bluntly that she could hear pretty much everything and that it got her so horny, she masturbated to the sound of me and my girlfriend fucking. Yeah she was kind of a blabbermouth who didn't really care about blurting things out.\n\nThat was awkward.",
   "created_utc": 1691508973,
   "score": 117,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvb90rb",
   "message": "Called me and demanded we switch rooms while I was out of the country spreading my moms ashes. Told me to fuck off and hung up on me when I suggested maybe we could discuss it when I got back in a couple of days.",
   "created_utc": 1691509082,
   "score": 41,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbai12",
   "message": "One of my friends bought a house and wanted a roommate to help with payments. He put an ad on Craigslist and found some guy same age same interests that seemed okay. After he moved in though he was obviously a little off. He'd make random farm animal noises like there's a group over hanging out while everyone is talking dude just lets out a loud \"MOOOO!\" Apparently he'd also do it when it was just my friend, his gf, and the roommate there.   \n\nThen one day the GF's parents came to town and it my friend's first time meeting them so he wanted to impress them. He cooked a fancy meal and it was great weather so they were eating on the back patio. In the middle of them eating the roommate came out of his room, locked the glass patio door, took off his clothes, and started jerking off while staring at them. The back yard was fenced in so they were basically trapped back there and had no keys to get back inside the house since all the doors were locked. They had to call the cops which the roommate had finished by then and let the cops in who let my friend back in and arrested roommate.\n\nE: Why are all my replies from bots? wtf",
   "created_utc": 1691509628,
   "score": 72,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvb4rxx",
   "message": "Masturbated with a banana (up the bum) and left it in the kitchen counter.",
   "created_utc": 1691507508,
   "score": 27,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvb6ra8",
   "message": "She stole my prescription medication, kept trying to wake me up at 3AM to comfort her during a breakup (I started work at 6AM amd she knew that), didn't pay the last two months rent and left half her crap in the place when I kicked her out.",
   "created_utc": 1691508245,
   "score": 24,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvb99zq",
   "message": "My friend had a roommate who was a hoarder. The roommate would collect all sorts of things, including old newspapers, magazines, clothes, and even food. The apartment quickly became overrun with clutter, and it was impossible to move around without tripping over something. The roommate also had a habit of leaving food out on the counter, which would attract bugs and rodents.\r  \n\r  \nMy friend tried to talk to the roommate about the mess, but the roommate refused to clean it up. Eventually, my friend had to move out of the apartment because it was too unsanitary to live in.",
   "created_utc": 1691509177,
   "score": 25,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvb737n",
   "message": "Ok, so he was my buddy back in the day so I don't hate him. But he had drug issues that would often manifest as erratic disturbing behaviour. Worst instance he tried make roast beef in the microwave by putting a raw roast in the microwave, hitting 99:99 on high and going out for a bike ride.  Comes back, beef's destroyed, microwave's destroyed, we're like WTF man.....",
   "created_utc": 1691508369,
   "score": 16,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbagb1",
   "message": "It’s not exactly a roommate story but I had a girlfriend who spent most nights at my house [whose father entered my home late one night while we were away](https://www.reddit.com/r/AskReddit/comments/xl1pzc/whats_one_type_youll_never_date_again/ipisp1u/).",
   "created_utc": 1691509610,
   "score": 14,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvba3mf",
   "message": "Lived with a good buddy and a girl we met online.  We kept the heat really low to save money in the winter.  \n\nShe was a very arts and crafts kind of person.  She spent a lot of time in her room doing something with her hair dryer.  Figured it was something to do with her art. Turns out she was running her hair dryer for hours as a space heater.",
   "created_utc": 1691509479,
   "score": 28,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvb5y1o",
   "message": "Asked me to cover his part of the phone bill for now ($40) and he would pay me back later. Then started pulling shit like, “Well I gave you a ride to class, so that’s like $5 so we’ll call it $35. And I bought beer for the party, so your half would’ve been $10, so we’ll call it $25. And you had some of the Oreos I bought so….”\n\nLast time I ever fell for that.",
   "created_utc": 1691507950,
   "score": 36,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvb9rbk",
   "message": "I had a roommate who was really overweight and it caused a bit of an eating disorder. \n\nWe were both 19 year old guys in college and he was probably around 300 lbs while I was a little thin, around 145 lbs. On it's own that wouldn't have been a big deal, but his habits were pretty bad. He would eat nothing all day and then reward himself by buying a large pizza, wings, and 2 liter soda, laying in bed with the pizza box balanced on his stomach, and eat the whole thing. Then he'd drop all the box, bones, etc. on the floor and fall asleep. He used his sheets as a napkin and there was a orange grease stain on the sides of his bed. \n\nI could simply not eat around him. And with college being already crazy, I just missed a lot of meals. I knew I was losing weight, but then a girlfriend noticed it was getting bad and said something to me. I had got down to 120 lbs. before I moved out of there after 4 months.",
   "created_utc": 1691509354,
   "score": 27,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbbt6y",
   "message": "When i was 10, i shared a room with 2 of my brothers, one was 12 and the other 14.  \n\nthe slept on bunk beds, younger on top.  We had a collection of Gi joe figures, one of my favourites was a snake eyes with all his kit.  It was part of a shared box, and my oldest brother wanted it but i took snake with me every where, i made the mistake of leaving him down one night and my middle brother claimed him, we had a tussle and my dad sent us to bed, i could see my brother on his bed and he said did i still want snake, and he rolled over and he had snake embedded in his ass up to his hips, head first, it was disgusting but funny at the same time  he threw snake onto the end of my bed.  A little latter my other brother came up and seen snake, and snatched him up, and said he was claiming him, and i said no, you cant have him, and he licked him a lot to say he was claiming him, thinking i wouldn't touch snake if he did.  I nearly pissed myself laughing.  We didn't tell him to this day.\n\nOn another occasion, i noticed my oldest brother was seemingly having what sounded like seizures and convulsions in his  sleep and i told my parents, they were very concerned and they asked him about it, and he said he didn't remember it and he was fine, it didn't happen for a few nights and started again, and i banged on the wall and my parents came rushing in, i described it and they swept him up and into the car, brought him to hospital thinking he might be epileptic.\n\nSure enough an hour later they came back and he went to bed, i thought it was a bit quick to make the hospital, and he was raging, my dad was laughing and my mother mortified.  He had to stop them half way and say he was actually having a wank and he thought no one could hear him.  I didn't even know what that meant until then.",
   "created_utc": 1691510102,
   "score": 24,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbdq16",
   "message": "I lived with a former roommate that never washed his towel in the time we lived together, nor did he clean his room. He'd only ever eat bowls of cereal, work for 10+hrs a day \u0026amp; smoke weed He also never helped with chores \u0026amp; always would leave his bowl in the sink for days to \"soak\". His teeth \u0026amp; clothing were immaculate which was always such a conundrum.",
   "created_utc": 1691510805,
   "score": 10,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbetx8",
   "message": "Have quite a few but 2 stories stand out. \n\nMy first roomate in college dorms had aspergers. He had a fascination with the communal toilet he would flush toys socks everything he could down it till it clogged. He would eat sardines in bed and not cleanup or seal the empty can. He would giggle himself to sleep till 3-4am.\n\nSecond roomate at our house was filthy and would leave beer cans in the yard. One day they came in and asked \"What are your thoughts on raising chickens?\". I said our landlord would be pissed and that they are filthy and smelly. They replied \"Well I have 2 hens and 8 chicks in the basement.\"",
   "created_utc": 1691511214,
   "score": 9,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbiker",
   "message": "Roommate was also best friend. We moved to a different country together to work.\nAt first it was real good. Living with your best friend? Gaming all day after work? WORKING AT THE SAME PLACE? fuck yes.\nWe started having the same kind of problems I always see. First it was the cleaning, then the buying/sharing groceries, just small things.\n\nSee this person was also a hobby DJ, and to say he was at best really bad, is an understatement. I could go for deep trance, house, all of that jazz but this, this was just 6 different songs from 6 different people in various bpm and style. It was shit. I developed an uncanny trait of being able to shut off my hearing completely and focus on other things such as breathing, and living.\n\nWe were at the 6 month mark when my friend decided to start smoking a shit ton of weed. I like it myself dont get me wrong but theres liking it and acting like a child when you're not high 18 hours a day. His mental health by this point started drastically go down the rabbit hole, and we would fall out quite often.\n\nIt all pretty much came to a head when we were out drinking and had a huge falling out, resulting in me bitch slapping him to the next realm due to him throwing some shade against my family. I later on went to my other friends place and crashed for the night.\n\nWe talked things through the next day but we could never seem to get the groove back so I decided to look for a different apartment while crashing at my buddies place. We met at work as normal and he was quite alright but due to me not living with him at the time I didnt actually see what was going on.\n\nOne day I came to work and he was nowhere to be seen. 2 hours went by and he came in as normal, trying to act the shit but I knew he was off the rails. Sat down, put his headphones on and proceded to not work at all.\nAnother hour went bh and I asked him through Skype (yeah) if and when he was planning on starting to work.\n\nHe then retaliated by throwing a stapler at my forehead and ran out of the establishment. I never saw him again, and only heard from him once when he tried to break things up between my girlfriend and I.\n\nI have so many stories about this dude its incredible. Like that one time he decided to shower with his dishes because saving water. He also hid plates in the top compartment of our SHARED toilet.\n\n10/10 would recommend",
   "created_utc": 1691512595,
   "score": 8,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbnnu7",
   "message": "\"I'm gonna make rice\"\n\n\"ONLY GOD CAN MAKE RICE! You are just going to cook it!\"",
   "created_utc": 1691514478,
   "score": 5,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvb27zx",
   "message": "they left stuff out for so long that mold started growing",
   "created_utc": 1691506531,
   "score": 4,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbbyav",
   "message": "My freshman year of college I had a roommate that constantly brought random guys back to our dorm long after I had gone to bed. The first time she did this, I woke up when she and her partner broke her bed 3 feet away from me. No, that didn't stop them from finishing.",
   "created_utc": 1691510155,
   "score": 6,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbo6fc",
   "message": "My room mate fell asleep smoking \u0026amp; set her room on fire. Other stole money,  jewelry \u0026amp; other things.",
   "created_utc": 1691514668,
   "score": 5,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvboi2s",
   "message": "Had a roommate who didn't wash their clothes the entire time we lived together. I offered at least 3 times a month to do it for them and they kept saying they would. Smelled like literal mold by their hamper",
   "created_utc": 1691514787,
   "score": 5,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbv5py",
   "message": "Oooh boy.\n\n2012.\nHad 2 guy roommates, I’m a girl. I was a stripper back then and I was never home (i was home to only shower and sleep from 9am to about 3pm) so I kept all my stuff in my roommates room. To keep rent EXTRA low for everyone, we went into 2 bed/2ba apartment. Me and roommate A were super great friends and therefore shared a room and bathroom. He worked day shift so when I was coming home, he was leaving to work. When I leaving for my shift, he was coming home. It was the PERFECT PLAN. We kept our bills so damn low, it was amazing.\n\nAnyway.\n\nHere comes roommate B. He was a friend of a friend of roommate A and needed a place to live to finish his last semester of uni (which we lived down the street from). We met roommate B and we’re okay with the situation and he didn’t say much about ours. \n\nWell, after like 1 month, roommate A says that roommate B has been hanging out by our room when he’s getting up for work, acting kinda weird. I never noticed it but I did notice things missing from my side of our room. Small stuff, like a brush, makeup. I always chalked it up to just losing it at work since I dumped out my bag at the end of the night. B is still super aloof with us.\n\n2 months go by and roommate B starts to be more social with us. We start all hanging out. Then A had to work a Night Shift and I decided I didn’t feel like going in for a shift, so B and I have a movie night or something. I fell asleep on the couch. Wellll this fucker decided it’s a great time to put his hands in my clothes. I woke up and I left the apartment. I told A and he came home and chewed him out for it and we decided I wouldn’t be alone with him.\n\nWell, it just fueled the fire. He started leaving me messages that he was in love with me, that I was his soulmate. I stopped completely going home at this point. I would stay out ALL night and day. I would go home to shower and that was about it. I stayed anywhere else but there. He even would steal my purse to put in his room so I could talk to him (ask him where my stuff was).\n\nThe worst time was when i stayed out working at a club until 5am and decided to go sleep on the beach afterwards. I was about to get there when he starts texting me that he’s going to kill himself if I don’t come home (“to where you belong” he says). I called A and asked what he was doing and A says B is literally playing LoL. I continue on to the beach. He keeps texting. Saying the same things. \n\nJust as I park, A calls and says B has locked himself in his bathroom with a knife.\n\nI was pissed because this was obviously so manipulative of him, but if anything DID happen, I’d feel so bad so I drove back home.\n\nWhen I got there, I let him know I was home, and I was able to get the knife from him and just straight up asked what was SO important that he would unalive himself over \n\nHe brings me down to the parking lot, pops open his trunk, and has a damn bouquet. Gets on one knee and starts on a poem he wrote.\n\nI literally could not. I don’t even remember what I said to him because He hated me after that night\n\ntl;dr\n1 of 2 roommate was in love with me, he SA’ed me when I was asleep, still thought I’d love him after that, was manipulative and professed his love to me and now hates my guts",
   "created_utc": 1691517195,
   "score": 5,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbhygj",
   "message": "My wifes aunt moved in herself, her boyfriend and 2 dogs into our one bedroom apartment. Thats when I found out she was always high on some drugs or another. For a week they would makes messes and not clean up after themselves or the dog. They also would randomly start having sex on my couch while I was in the bedroom. I came out to get a snack and they were going to pound town at 4 in the afternoon! \n\nThe final straw was the cops were called twice for them fighting. Twice in a week. Oh and my wife's aunt also tried seducing me twice by blatantly playing with herself in front of me while her BF was at work. When I confronted her about it, she accused me of SA in front of my wife. We kicked her and her BF out that night. She tried stealing my wife's diploma and my contact lenses for some reason before she left. \n\nHer aunt was legit crazy. I told her before she left that I hoped she got run over by a dump truck. Years later, she ended up getting hit by a semi while walking on the freeway. Whether she was high or crazy when it happened, we'll never know. I wasn't all that sad when I heard the news.",
   "created_utc": 1691512371,
   "score": 5,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbk68h",
   "message": "when I left home I lived in a bedsit with a shared kitchen . i came home one evening from the pub and one of the residents was in the kitchen drinking with some friends who I hadn't met .she was making a spaghetti bolognese . I said to her the food really smells nice Where's mine ha ha .she said I'm sorry but there isn't enough to go around .\nnext day I looked in fridge and MY SHELF was mysteriously missing two cans of lager a box of button mushrooms a jar of red pesto and a whole block of cheese . happy days 😂",
   "created_utc": 1691513192,
   "score": 4,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvblhrs",
   "message": "She pooped with the door open. She left broken glass on the floor. She spilled cooking oil on the kitchen floor in the middle of the night and left it there. I slipped and fell in the morning. We kicked her out.",
   "created_utc": 1691513679,
   "score": 5,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbpg9a",
   "message": "I'm pretty sure my roommates can tell their worst roommate story and it would be about me.",
   "created_utc": 1691515136,
   "score": 4,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbgqqt",
   "message": "Found random craigslist room mates who blew the house up with a party and bailed on us 2 weeks before Christmas. They met another neighbor who was a meth head and started doing it too and it just went down hill from there. they completely ghosted too, so no way to take them to civil court for lost rent or anything like that",
   "created_utc": 1691511924,
   "score": 3,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbjnuw",
   "message": "Not roommate, but upstairs neighbor. My first apartment many years ago was on the first floor. A few people lived in an upstairs apartment. The guys would dribble a basketball on their floor, which was my kitchen ceiling. Kinda annoying, but one night, I come home late from a party to find broken glass all over the kitchen floor. I mean, ALL OVER. I switch the light on, and it's a bare bulb up there. Their dribbling had loosened the ceiling fixture and sent the glass cover crashing to the floor.",
   "created_utc": 1691513001,
   "score": 3,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbsbu1",
   "message": "Got kicked out from moms and moved in with a girl who I thought I could trust until one night after some drinks I wake up and she's on top and I pushed her off somehow. (She's twice my size) we weren't dating and we had maybe had protected sex twice at this point of our relationship. Fast forward a year and she's giving birth to a baby girl whom she very much should not have had in the first place as the courts don't believe a woman can rape a man. Here I am now two years after the birth of that child.  Jobless... Still paying a rapist child support... Help... There is still an open investigation with the police and I pray she is eventually found guilty of a sex crime as I now have PTSD and it has ruined my last relationship... And fucked me up mentally to the point where I'm about to live at the courthouse in a cardboard box as I cannot hold a job and watch the fruit of my hard labor go to a rapist. \n\nThe times ahead lead into the dark unknown, but God is my light and will guide me through the tough these times.",
   "created_utc": 1691516178,
   "score": 3,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbvasv",
   "message": "College dorm roommate. He came home really drunk and wolfed down a thing of fries, with ketchup. Promptly barfs that up in the middle of the floor. Blacks out in his bunk. Me, slightly less drunk, wants no part of that mess so I just go to bed. \n\nWakes up, and totally forgets the whole ordeal. Gets pissed at *me* for puking and not cleaning it up.",
   "created_utc": 1691517248,
   "score": 3,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbx88j",
   "message": "My other roommate's friend who became our newest roommate seemed really charismatic at first, but in the end turned out to be:\n\n- stealing from several roommates, including my phone\n- dealing drugs from our house and trafficking cocaine to Belgium\n- used the many girls who came over to fuck and then do his chores",
   "created_utc": 1691517954,
   "score": 3,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc3g1o",
   "message": "My sister thought she was loosing her mind in college. Her alarm clock would randomly just not go off, sometimes she'd come back and find minor things moved or missing. Her desk lamp would be pointing at the wall....\n\nOne day my sister went to class but realized she forgot something in her room. Came into the room to see her roommate wearing her clothes and belongings and doing a bizarre dance. The lamp was pointed at the wall like a theater spotlight. The roommate had some pretty major issues and moved out shortly afterwords.",
   "created_utc": 1691520206,
   "score": 3,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc9nb3",
   "message": "I was 14 and sent to live with my crazy aunt while my parents tried to kill one another to \"save the marriage\".  Aunt didn't want me there so she put me up in the loft in some shithole in Madison Wisconsin.  Chain smoked cigarettes for 3 days so I lived in a smoke haze up there.  3rd night some kids saw me looking out the loft window and started shooting bottle rockets at my window.  Finally fell asleep to her shitfaced down below.  Woke up to the house on fire from the bottle rockets and they all ran out with me up in the loft.   Aunty is the best roomie",
   "created_utc": 1691522453,
   "score": 3,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbijhj",
   "message": "I always helped this roommate out whenever I could because she didn’t have a car. When I would go grocery shopping I’d ask if she wanted to come to get her groceries. When I would get food I’d ask if she’d want some. We’d watch shows together using my Netflix account. Then she started to abuse the offer by asking if I’d go get her fast food super late at night (wouldn’t offer any to me). Then all of the sudden she started recording me and one other roommate right when we got home. Then she’d crank the thermostat to 85°. We had a set of rules in our contract about the thermostat. I took the thermostat off the wall and she contacted the landlord so I had to put it back and she’d crank it back up. The thermostat became a huge problem. We tried getting her moved out but the landlord said we didn’t have enough evident. Then one day I went to get some ice out of the freezer and she comes running up behind me, pushes me to get her vodka out of the freezer then proceeds to slam the freezer door on my head. Luckily I had another roommate who was home and heard the entire thing. It was what we needed to get her kicked out. She was gone 2 days later and I filed a report with the police. Idk if she all of the sudden had some kind of mental breakdown or what. She’s recently tried reaching out on every social media platform and I’ve blocked her on everyone.",
   "created_utc": 1691512586,
   "score": 2,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbkc8k",
   "message": "Had four roommates for 4 years of college \n\nRoommate 1: stalked a girl on campus, police came and whole scene happened with a restraining order\n\nRoommate 2: was a weirdo who used to spit water from his mouth in the dorm common area \n\nRoommate 3: also stalked girls and masturbated in the apartment common room, also didn’t shower or wash his hands after masturbating -.- \n\nFourth roommate was normal and nice",
   "created_utc": 1691513253,
   "score": 2,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbtumh",
   "message": "My roommate didn’t allow bananas in the house",
   "created_utc": 1691516725,
   "score": 2,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbv9mj",
   "message": "Omg 🤦‍♀️ my college roommate was the worst. She was gross, intrusive, and creepy AF. Here are just a few things that happened: 1. I brought a girl back to our dorm one night, turned over and saw her open eyes creepy staring at us. 2. Woke up one morning to her staring at me while I slept. 3. She wiped her ass and threw the paper in the trash can, not the toilet. 4. She left her period blood underwear soaking in our bathroom sink (that 4 of us shared). 5. She literally ate whole sticks of butter as a snack. 6. She was creepily obsessed with David Bowie talking about wanting to fuck him 7. She had her hands in her pants..all..the..time.\n\nAll this and much more happened in one semester. She flunked out and I moved out.",
   "created_utc": 1691517236,
   "score": 2,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbxn4n",
   "message": "Shared apartment. 4 girls, 4 bedrooms, 2 baths. Each bath was shared by just the 2 girls on that half of the apt. \n\nRoommate on my side hosted a sorority/fraternity mixer one night. It was a one time thing so I didn’t mind. Towards the end, one of her girlfriends vomited over everything in our shared bathroom. Everything. What did my roommate do? She immediately took off for Chicago for the weekend and left me to clean it up. I was pretty ticked off and decided to stay at a relative’s for the weekend. I shut the door to the stinky bathroom and left. 2 days later I returned to find her ranting to other girls in our apt about how horrible I was for not cleaning it up and letting it fester for days. Or that I didn’t at least hang up the vomit rug to be aired out. She didn’t get much sympathy.",
   "created_utc": 1691518106,
   "score": 2,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvby9rs",
   "message": "My roommate in college didn’t work. We shared a room freshmen year. Matter fact I was the only person who did work, and the only black person in my entire dorm hall he was white and from rural jersey. I would come home from my shift and be tired so I would ask to cut the light off so I could sleep. \n\nThis upset him after a few weeks so one day when I was sleeping I hear banging on my door and he opens it to his friends, a big group of white men scream “Je** is a Ni**er!” Loudly multiple times. To his credit he looke back at me mortified but he then turned towards them and left with them. Looking back I think he was just afraid he would get in trouble, not really how it made me feel. \n\nNext day my RA moved me to another building for the night. My own room. I was allowed to keep it after a few days and when I went back my roommate had moved all my stuff and the trash in the room to the top of my bed. Lots happened between there but basically I ended up being the outsider and he ended up having a great time at that school. I dropped out. (This was 2006/7).",
   "created_utc": 1691518337,
   "score": 2,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc1p1q",
   "message": "My roommate's boyfriend moved in with us for a bit. This was her high school boyfriend who had gotten out of jail recently.  After several months he ended up stealing her truck to run off with some girl he met on Yahoo Chat.  He left the state which violated his parole.\n\nA few days later I'm home taking a nap and am woken up by someone banging on the rear door's window.  I go out to see him walking away and grabbed the phone to call the police.  I hear a loud crash as he throws a brick through the window. I take the phone and run into her room (the closest) and brace the door while talking to 911 (who needed his case number but I couldn't get it since he was in the living room tearing the place apart).  \n\nEventually I hear him kind of saying to himself in a high voice \"oh my God oh my God. Do I have my keys? Yes.\"  Then he leaves.\n\nI walk out to see that when he reached through the broken window he sliced an artery in his arm and he was spurting blood EVERYWHERE.  The kitchen, living room and bathroom are covered in it. We still found blood drops behind the couch and on CD cases when we moved out awhile later.  \n\nI swept up glass and blood while waiting for the cops.  He'd been looking for his medications so he and the girl could overdose on them.  They ended up finding them both at a motel, either on drugs or having attempted to O.D.   He went back to jail.",
   "created_utc": 1691519577,
   "score": 2,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbb8w5",
   "message": "Woke up at 12 am to my roommate talking about bugs crawling up the walls in their sleep...",
   "created_utc": 1691509899,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbwek3",
   "message": "one of my roommates would constantly take dumps in my cat's litter box.  massive dumps.",
   "created_utc": 1691517651,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbx0zr",
   "message": "Rich white kids (roommate and friends) playing gangster drama with a target pistol .22 from the PNW.\n\nMe and my other roommate were raised in NE ghettos  and lived in the PNW for a reason….  we had to teach them / showed them how not impressed we were with the Malibus Most Wanted cosplay.\n\nHe moved out and we just split his rent and have peace and quiet, lmao.",
   "created_utc": 1691517880,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbd6to",
   "message": "[removed]",
   "created_utc": 1691510608,
   "score": 254,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbcl3k",
   "message": "TL:DR: after being begged to move in together, with lots of ups and downs , I come home from the hospital in the middle of the night and am met with a temp restraining order to move out in 15 minutes. \nWe were friends before and she begged me to move in while her husband was fishing (we live in Alaska) and I knew she didn’t really like being alone so I said yes. \nWithin a week, she gave me Covid and the week after that, her  favorite uncle was brutally unalived by her cousin, his son. And we both relapsed. I think it took me a little less than a month to seek MAT and a subs doc. \nWhen I did that, her attitude flipped and I started sleeping in my own bed again. \nSo then there’s the other girls, the ones who were keeping her hello… and even they were sympathetic towards me, because all she did was tell them the most awful things about me, and they weren’t blind, so they knew she was lying. \nBut I had truly loved this girl. I was very sad. \nWhen her husband was finally done with his season and came home, she had said that she would be clean by then. But of course she had an excuse every day or night why she just couldn’t stop. 🙄\nFlash to the night I was released from the hospital after being on a 24hr watch (I crashed my longboard) and it’s about 3am. I’m making a snack and the husband walked out the front door and comes back in a little while later with a couple of “friends”. \nTwo cops ask for  my name and proceeded to read me a legal document. \nI’m smug and don’t quite understand yet what I’m being told. I assume it’s an eviction notice and laugh out loud. \nSo the cop says, actually it’s a temporary restraining order and I’ll have 15 minutes to pack up what I can and get out. \nIn my panic and concussed state, I called probably the last number I had gotten and that definitely turned out to be the best thing to ever happen to me, since I’ve never been happier, healthier, or more in love.",
   "created_utc": 1691510386,
   "score": 0,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbmjjg",
   "message": "Had a college roommate decide to sell psilocybin mushrooms out of our dorm without my knowledge. He was 18 and I was 21. The campus police caught him and they raided our dorm and took all my beer and I watched them pour it down the sink. Wasn't a dry campus and I was of age. Roomate got expelled but I lost like $200 worth of good craft beer",
   "created_utc": 1691514064,
   "score": 0,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvb2qey",
   "message": "Fucker got high and ate all my pop tarts. Later on when he was on acid I convinced him that he killed his mother until he had a complete anxiety break down.",
   "created_utc": 1691506727,
   "score": 239,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbmlhd",
   "message": "During the course of three months, my roommate would get violent when drunk, but I was used to my lover putting stitches on my face. Anyway, he attacked me one night and punched in face a few times that cause two black eyes, and I asked him if he was through, so he sat back down. Then after being hit by a car with my wrist and elbow, broken in a compound sling, was had knocked me down in the pantry where I could get up, and began beating me with the aluminum metal pipe of a mop handle, about 30 or more times as I looked at him and told that he would kill me with that kind of pipe so he threw it down, all bent up and puffed his way into the living room. I just got and went to lay down. His exfiancee' called the police that would have put him in jail from our 3rd Strike Law. So when the officers showed up, I said we were just rough housing a little with a smile; as blood was oozing down onto my forehead and face. He did other thing too involved to explain. He was best friend, and completely drunk, so I said no problem.",
   "created_utc": 1691514084,
   "score": 253,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbhe1x",
   "message": "-",
   "created_utc": 1691512163,
   "score": 253,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbfrri",
   "message": "I walked into the living room where he was and it smelled God awful. I asked if the dog had shit somewhere, and he said \"oh, if you're smelling something, it's probably my feet heheh\"\n\nThat interaction still haunts me.",
   "created_utc": 1691511568,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbgyi0",
   "message": "my roommate left molding drinks in MY cups and then would get mad at me if i didn’t wash my dishes right away….",
   "created_utc": 1691512004,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbhoj8",
   "message": "I had one girl who totally tries to take over my apartment",
   "created_utc": 1691512269,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbj5eq",
   "message": "Threatened to kill and rape me after flipping out on me for clogging the toilet, he assumed I knew and did it on purpose for whatever reason. Came up to my room with a gun and banged on my door as he issued these threats. Also threw my food out a few times and when we first introduced ourselves to each other he asked my star sign and immediately told me he didn’t like me because I’m an Aries.",
   "created_utc": 1691512812,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbjad7",
   "message": "Left me with a $1k electric bill (and obviously the rent/lease) after she moved out one day while I was gone without even saying anything.",
   "created_utc": 1691512864,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbjmgk",
   "message": "Roommate in college was rushing.\n\nOne morning I wake up and find a long trail of diarrhea from his room to the bathroom.\n\nAlcohol poisoning is a bitch.",
   "created_utc": 1691512987,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbjw1z",
   "message": "She took a bath with her new boyfriend and left a ring of hair around the tub.\n\nThey shaved each other.",
   "created_utc": 1691513087,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbjxcu",
   "message": "My freshman year roommate peed all over our bathroom floor and didn’t clean it up. He was sober and just wasn’t wearing his glasses when it happened.",
   "created_utc": 1691513101,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbkaf5",
   "message": "She used to steal my boxers (I'm a gay guy and was not flattered by it)",
   "created_utc": 1691513235,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbliw8",
   "message": "I had a housemate who moved in in October of last year. He was recently divorced and constantly rude and drunk, left the kitchen a mess, screamed at me when I asked him to clean it up (I'm in my mid 20s, this guy was like 40) and got mad at me when I complained to the landlord. One night the police show up because a friend of his called for a wellness check and it turns out he had a warrant. So they take him away and the property owners agree to kick him out. He died like 2 months later.",
   "created_utc": 1691513691,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbm0d4",
   "message": "They cooked spaghetti but didn't feel like cleaning the (still half full) pot afterwards. It sat there being a bio-hazard for over a week while it rotted.",
   "created_utc": 1691513867,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvboski",
   "message": "This isn’t mine but it’s from a friend I knew form college I’ve lost contact with \n\nSo my friend was with one of the students who was older than your average college students because he had some developmental and social shortcomings, for lack of a nicer way to say it\n\nHe wasn’t fully mentally handicapped, just slow on the uptick I think. Once he got going he was as smart as anyone \n\nBut he was extremely socially awkward, he didn’t seem to understand social cues or facial cues. But the real kicker my friend told me was one time he got up early to go to the gym, he heard his roommate jerking it\n\nMake matters worse, about a week later he got back to his room one time and there was semen on the floor, give you one guess",
   "created_utc": 1691514893,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbp67r",
   "message": "Awful girl stole my sisters dog, drove the dog to her parents house in a different state and tried to use the dog as leverage to get her security deposit back because she was studying abroad and didn’t get anyone to fill her room (said she would, didn’t, then said she would pay her rent while she was away.. then stole the dog out of nowhere.)\n\nReached out to the parents who were also horrible people and kept the dog. \n\nCouple months later the awful roommate sends a message to us about how she got mugged and beat up and how “guess she got her karma”",
   "created_utc": 1691515033,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbq6iy",
   "message": "Some of these stories are making mine not seem so bad but the worst was of course a girl I found through Craigslist. When I toured the house it seemed old but nice enough, signed a lease, moved in. In between me signing and physically moving she adopted a dog without telling me, I'm allergic. I then came to realize that she doesn't clean, at all. She would just keep buying more groceries but never throw out the old milk cartons, egg crates, petrified fruit, molded leftovers, etc. then had the audacity to ask me to replace her stuff when I'd throw it out because the fridge was full and STUNK. I politely let her know I'd be happy to replace the 2 rotting eggs I threw out if she can let me know where she was purchasing such rotten food. She did not respond. (At this point she was avoiding me and only communicating via text/email). She never did dishes, never took out the trash, so then didn't know when the bin was full and needed to be rolled to the street, so that always fell to me, then if I didn't immediately roll it back in she'd text me saying the city sent us a warning that it can't be left out. Idgaf you do it ya lazy crone. Her dog shed and she never swept or vacuumed so I would sweep the hair, open her room and dump it in. Her dog peed in my room once when I guess I didn't click the door all the way closed, came home to find she had moved my space heater from the side of the room to the center to cover the pee instead of cleaning it. I hated her with a passion and was so glad when I found a place to move.",
   "created_utc": 1691515401,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbrixy",
   "message": "Our tripsitter roommate waited until we were peaking to start cutting in the living room and threatening to jump off the building. Horrible fucking person. \n\nWhen I started moving out, she again threatened to kill herself and blame it on me for “abandoning her”. After I left, she reported me for sexual assault, even though I was over 200 miles away from her when the alleged incident occurred. \n\nAnd yes, she had BPD. She bragged about it.",
   "created_utc": 1691515887,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbt3l3",
   "message": "One (male), my roommate thought it was weird and disgusting to freeze frozen steaks for more than a few weeks. So he threw them all away without telling me. I often restock and consolidate so it kind of looks like it's just sitting in there which I get but we could of talked about it. I asked him to at least pay some back but he insisted I should PAY HIM because he cleaned the freezer.\n\nDifferent roommate same apartment(male) on the first week I moved in, not only he doesnt clean anything at all and the amount of dishes that were left in the sink, he started using my dishes because he ran out. He made fried chicken from scratch, took out breading, made batter, egg shells, butter milk, whole thing was a mess and he left it there for weeks. I kept telling him to clean it but kept playing dumb saying, \"that's mine?\" YES THAT'S YOURS!! WHO ELSE MADE FRIED CHICKEN!?!?\n\n3rd roommate at a different apartment (female). Loves aesthetics and wants to completely have the apartment done in a bohemian theme (I had to google it). This apartment was only planned to be temporary for me but didnt care what she does and was willing to respect it until she asked me to pay half for the furniture. A single chair she wanted was around $400, imagine what other things she wants in just the living room. It took a while for her to finally understand I dont want to spend money on furniture for an apartment im only staying for a few years.",
   "created_utc": 1691516453,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbt4vt",
   "message": "They used the heater in the shared hallway to defrost pig kidneys",
   "created_utc": 1691516466,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbus5b",
   "message": "She was batshit crazy, extremely manipulative, conniving, sociopathic. Blamed everything on us, even when she signed a lease for her friend without fully reading it…when she found out her friend wasn’t going to be placed in our apartment she freaked out on us like it was our fault. She played every song that had the phrase “fuck you” in it full volume all night, lunged at our roommate, and so much more. We found out where she got it from when her parents came to move her out…being 45 and getting into a 19 year olds face to call them stupid and threaten them is not a good look let me tell you. Idk if they were all narcissists or just delusional but it was strange",
   "created_utc": 1691517059,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbuwkd",
   "message": "He almost shot his friend, with a .45, in his bedroom. \n\nRoommate bought a keg of his favorite beer and through a birthday party for himself inviting a small group of friends. Every had fun, got drunk, we were downstairs and suddenly heard a loud noise come from upstairs, I went to check and the door was open with a bunch of commotion going on, roommate promptly shut it saying don’t come in! Later on I found a hole in the pantry shelves below his room, that bullet went through the floor and a bunch of boards before it stopped, never found the bullet though. \n\nThat house attracted some characters. One guy who screamed at his girlfriend so violently loud you could hear it outside. A girl who stunk and rarely showers, another girl who didn’t pay rent or take care of her teeth. And a meth addict that stole from me. Just a parade of assholes, some were ok though but there was always one.",
   "created_utc": 1691517103,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbvai7",
   "message": "Second semester my freshman year in college. I was told I was getting a new roommate since my original never showed. He was 24 and just got out of prison but somehow got into college(?). Anyways, he was alright, a bit strange but fine for the most part. When I came back from spring break I opened the door to our dorm and was greeted by a giant haze of smoke - I mean it settled on the ground like a thick fog in the morning, but the roommate was nowhere to be seen. I knew we had room checks the next day so I made a mad scramble to get rid of what I could because we’d both get in trouble. During my clean up I came across more pot, porn dvds, heroin, needles, melted spoons, and my broken ps2 memory card and guitar hero guitar. I immediately reported him and got him kicked out that night.",
   "created_utc": 1691517245,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbwni5",
   "message": "She was young, beautiful, talented and needle happy, she died from an overdose.\n\nN. S",
   "created_utc": 1691517741,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbwv6b",
   "message": "My sophomore year I got stuck with a random roommate. She was an okay person I’m sure, but I literally never talked to her.\n\nShe was always on the phone with her boyfriend. Like, literally 24/7. I woke up really early one morning while she was chatting with him, and I’m not sure if that was because she called him literally the moment she gained consciousness, or because they both were sleeping with the call still going on. Never used headphones either.\n\nShe went to bed at 8pm every night. That’s fine. But we never had a discussion about it, she would just turn off the lights at 8pm every single night. Some nights I would have late classes and I would bring something home to eat and I would just eat it in the bathroom so I didn’t have to eat like a gremlin in the dark.\n\nAlso her boyfriend was super dumb. I went to college in Maryland, he was stationed in California (army I think). He had to go to Florida for something and suggested that he stop by to visit since it was on the way (it’s very much not). He referred to women as females. He said homosexuality is “a mental disease” (meanwhile I had a Pride flag hanging up on my wall). They got into an argument about what gluten is, with him insisting it’s an additive that people are allergic to, which is used to cut bread products and after googling and getting the most basic definition of gluten, complained that it was too confusing. There’s a bunch of other stuff I’ve probably forgotten. And keep in mind, again, no headphones, so I just had to listen to these whole conversations.\n\nThe best part about her was she was almost never there on the weekends. But having to live with that during the week sucked. I at least hope she’s out there with a less trashy man. She deserves better than that.",
   "created_utc": 1691517821,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbxxdf",
   "message": "I had a roommate with Dissociative identity disorder.  Talked to himself in different voices. Dude was scary as hell and I could not wait to get away from him.",
   "created_utc": 1691518211,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbycbe",
   "message": "Most inconsiderate: I had a foreign roommate who was in the US to learn English to work at his future father-in-law's company. He had zero interest in learning English and never left the apartment. He never cleaned up after himself at all. Never did dishes, vacuumed, or took out the trash. He couldn't even be bothered to put his food back in the fridge or cupboard. I went away for a long weekend and he sat in the apartment playing FIFA for 4 days. He used all his dishes, then used all mine because he couldn't be bothered to clean his. When all my dishes were used up he just started ordering himself pizza. I came home to the living room littered with pizza boxes and ketchup was spilled everywhere. My pitcher was full of eggshells sitting on the couch. The garbage was overflowing and spilling onto the kitchen floor. The sink was full of dishes with rotting food on them. There were flies everywhere.   \n\n\nMost inconvenient: I had a roommate for a brief while who just absolutely wrecked the bathroom every time he went in there. It stunk to high heaven. I bought some air freshener in hopes that he would use it. He didn't get the hint, so I finally told him, \"Hey, feel free to use this whenever you need. It's gotten really stinky in here.\" He told me that he was really sorry, but he had no sense of smell and didn't know that he'd been stinking it up.   \n\n\nMost Terrifying: I had a roommate with really horrendous night terrors. Made it really hard to get sleep. I remember one night being woken up at 2 am one night because he was screaming, \"Not the eyeballs! Not the fucking eyeballs!!!\" The next morning he had absolutely no recollection of it.",
   "created_utc": 1691518364,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbyig9",
   "message": "They used my rent money to buy drugs. Kept pressuring me to sign onto the lease even though they weren’t paying rent. I moved out, got my own place and my food budget dropped because my food wasn’t being eaten and I wasn’t having to eat out as often. \n\nMy rent more than doubled, but my cost of living saved me money. \n\nYeah, drugs and any kind of relationship are usually bad news.",
   "created_utc": 1691518426,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvbzyzp",
   "message": "I was living in a two bedroom house with two separate tenancy agreements. The second room had been empty for about 7 months after the previous housemate got evicted for assaulting me (another story). I had placed an ad on Spareroom.co.uk advertising the room to help my landlord find a new housemate.\n\nOne youngish man who replied came to view the house and asked to move in that day. I told him to ask the landlord and gave him his number. Oddly enough the landlord said he could move in right away, despite not actually having met him. He seemed like an OK guy, he was originally from out of town, single and was starting a new job at a debt collecting agency, which was odd because he himself had a lot of debt and was being placed on a payment plan as part of his employment.\n\nI was in charge of paying council tax so I told him how much it was a month and he agreed to pay me in cash. For the first month things were fine, although I did notice he was bringing a female \"friend\" of his around a lot and once he locked himself out of his room and ended up kicking the door frame to get it open again.\n\nAfter about 6 weeks he suddenly just disappeared and wouldn't respond to any messages I sent to him asking where he was and if he was OK. I asked my landlord if he had heard from him and he said he'd been told he was away dealing with a family emergency, which was odd because he had told me didn't get on well with his family. After 3 weeks I neither of us had heard anything from him and both became suspicious he had done a runner. Eventually after almost 2 months we were resigned to the fact he wasn't coming back.\n\nI went into the room to see what state the room was in and it was disgusting - dirty clothes, used takeaway containers and rubbish everywhere and I found one bag with used condoms in it. Oh and he hadn't paid his council tax either!\n\nNeedless to say that was by far the worst roommate I had ever had!",
   "created_utc": 1691518956,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc0vts",
   "message": "I lived on a floor my sophomore year of college with a bunch of friends I made from freshman year (like 12 of us). We would hang out a lot in between classes and after and go around campus, there were always events or something to do so we always stayed busy. Sophomore year was the year where we moved to a Co-ed floor (girls and guys), freshman year it was an all guys floor. I had one friend in particular that would knock on my door everyday, come into my dorm and we would just shoot the shit and show eachother memes before lunch. Well I started seeing a girl on our floor who this friend obviously had a crush on but she didn't reciprocate to him. When this girl and I started seeing eachother, my friend was visibly jealous and upset in general. I pulled him aside one day and told him that I don't want this to become a problem and he gave me bs like \"oh i would never do anything to screw with your relationship\". \n\nOne day he knocks on my door while I have this girl in my room and I tell him that I'm busy and to come back later. He asks why and I just give him a look and say \"cmon man\" and then he tries to push into my door to come in and I shove it back and go \"what are you doing?\". He goes, \"what? Who's in there?\" and keeps shoving until I can get the door closed and lock it. My other friends were saying he was trying to listen through the wall and would stand outside my dorm when he knew I was with her in my dorm.\n\nFast forward to a year later and I got dumped and was crushed. I didn't tell him about it but apparently he heard through another friend and texts me about a week after my breakup and tells me that he heard about my breakup and decides to tell me that he confessed his feelings to her and how he thought they should be together. Then he says how he didn't mean it and was sorry. I didn't really know how to register this in my mind at the time and just told him to piss off for a while. Overall a really goofy college experience.\n\nTLDR: My dorm neighbor friend went after my ex a week after the breakup.",
   "created_utc": 1691519285,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc1t3k",
   "message": "Was is the one who literally asked for my key back (??!?!) two weeks after I moved in, while my deposit and rent were fully paid up? She gave no reason - just said she needed my key back. She also called me to berate me for taking a paper grocery bag out of the trash so I could reuse it because, and I quote, “it’s rude to take other people’s things, even from the trash” (I assume she looked through the trash to take inventory? we did not have separate trash cans in the kitchen). Ok, fine. Here’s your trash back, don’t yell at the garbage collectors tomorrow. She was quite strange. \n\nOr was it the one who I shared a room with and who - smelled so foul - and after being unable to figure out why (she showered regularly, the rest of us could not figure it out), i realized I never ever saw her do any laundry or even wash her sheets?\n\nOr was it the one who ate onions like apples? (Not kidding, just ate yellow and white onions one bite at a time nightly, she also STANK). \n\nOr was it the one who 1) stole our other roommates endo painkillers, 2) assaulted my bf at the time, 3) cheated in multiple classes we shared with her older bf’s old assignments (all of us were the same major), and 4) verbally abusive bully to evvvveryone, professors, peers, her parents, her bf.",
   "created_utc": 1691519617,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc3p7z",
   "message": "He locked himself in his room(thank God) until everyone was gone. I have no idea how he was making rent, at the time, work from home wasn't a thing. This was the type of setup where everyone was renting a room in a communal unit, each unit had 4 rooms. So nobody was responsible for other people's bills, unless there was a private agreement. However there was a common lease to rent there. \n\nHe framed that lease in his bedroom and in the communal living room. When everyone was gone, he'd go hunting for lease violations and report everything to building management. It could be as petty as having alcohol in the unit(Utah, I know), having guests past 10pm, watching tv at a volume which he could hear from his bedroom past 10pm in a 400sqft unit that had 4 bedrooms... you get the idea. Management hated him because he was a well known problem for all the residents and they lived in the building themselves, yet they couldn't evict him for simply reporting violations",
   "created_utc": 1691520295,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc3wqh",
   "message": "Not as bad as some but\n\nFirst time moving out of the house to go to college (I’d never even been to sleep-away camp) and my roommate was nice until she turned out to actually be a douche. Spent all her money on drugs. I overheard her say once “My dad sent me money to buy food but I got some E instead.” She and her friends did acid or ecstasy (coupled with alcohol/weed) nearly every night for weeks and no that’s not an exaggeration. \nShortly before winter break she had some sort of nervous breakdown and dropped out. I came back from my mom’s after a weekend and the entire room was trashed and all her things were gone.\nAlso it’s worth mentioning that we were on the 19th floor of a Manhattan high rise and her dad broke the safety bar off the window so it could open all the way. Boy am I glad she didn’t throw herself out that window.",
   "created_utc": 1691520370,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc43to",
   "message": "It was a cat.\n\nApparently, the cat was very attached to his person, who was my human roommate. When she got a boyfriend and started spending nights away from the apartment, he became bereft. He barely ever acknowledge me before, even when she had gone away on non-boyfriend related overnight trips. But with the BF in the picture (he never stayed over at our place, she always went over to his), the cat suddenly needed me morning, noon, and night.\n\nWhen it was clear I would be unable to stay up all night with him while he cried and moaned about his loss, he began a reign of terror against me that led me to call him The Evil Genius.\n\nNow, this terrorizing wasn't just the standard rattling the doorknobs all night or being sure to puke where I would step on it. He would observe me all day, every day, and figure out what I paid the most attention to. He saw the things I cared the most about and began to systematically destroy them.\n\nHe destroyed so much of my jewelry, but never the cheap stuff, only the most expensive things. And I woke up one night to him smashing on my computer keyboard, which almost aborted a data run (I was in grad school, and it was my dissertation work). I could go on and on.\n\nStill, I felt a bit melancholy when he eventually went into a steep decline. He was a worthy foe, even if he was an abusive little shit. Rest in peace, fuckhead.",
   "created_utc": 1691520442,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc4igu",
   "message": "There were three of us who moved in together in the mid 90's. We were all buddies, but you never know someone until you live with them. It was a non smoking house, but the one smoker smoked everywhere in the house, which gave the other roommate, who had bad asthma, fits. Mind you the guy with asthma, also was 300lbs, left incredible messes in the toilet, and was never taught what a toilet brush was for, which pissed off everyone. In the end, we all lost our damage deposit because the smoker's bedroom was totally saturated in smoke. I can't believe we somehow lived together for a year. Now I'm not perfect, but I don't smoke, and don't take titanic sized Chinese leftovers shits that stain the entire toilet bowl as if it wasn't even flushed. We eventually convinced the smoker that he had to smoke outside as the fat bowl stainer was slowly dying. The problem was he replaced smoking with chewing tobacco and would leave mugs of spit around the house. It's hard for me to believe I put up with that for a year, but being very low on money and needing to finish my apprenticeship caused me to just deal with it. Not sure what happened to those two. I'd laugh if they were still living together.",
   "created_utc": 1691520588,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc4loy",
   "message": "Got a bottle of Johnny Walker Blue for my birthday from a friend. I went out of town. Roommate proceeds to drink half the bottle and then fill it up with water like I wouldn't notice. And then had the audacity to lie about it and continues to til this day. I do believe he doesn't remember though. He got laid off after getting a dui. Proceeded to drink himself stupid for eight months and was eventually taking our rent money to pay his car bill. Didn't realize til we had an eviction notice. Forced him to get his parents to pay for our three months of rent he didn't pay but I still have an eviction on my record. I have a copy of the notice that says I was not evicted so wherever I go I have to show that to future landlords or when I buy a house so we don't get denied.",
   "created_utc": 1691520620,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc4m2a",
   "message": "Actually I'm always the worst roommate...",
   "created_utc": 1691520624,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc4ng0",
   "message": "I had to work abroad for three months. I came home to discover the bathroom light bulb had blown just after I left. Roomie felt she couldn't change it herself so called an electrician. Electrician laughed at her and told her she could save a fortune and do it herself. She still hadn't done it by the time I got back.\nNeedless to say I fixed it in about 5 minutes. It would have been sooner but I couldn't stop chuckling at the thought of her shitting in the dark for months.",
   "created_utc": 1691520638,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc5qjs",
   "message": "He stopped going to school so the Army stopped giving him money. He refused to get a job and the week rent is due, he tells us he is moving out and not paying rent. He also stuck us with the electric bill he hadn't been paying. When we all moved in together, he already had an account, so we just used his. We would give him cash every month to pay the bill. Come to find out, he was just pocketing the cash and only partially paying the bill so they at least wouldn't shut off the power. He had still owed on his account when we all agreed to just use his account. So we had to pay almost $300 to get it out of the negative. This was back in 2010 when we were all like 20 year olds with part time jobs making minimum wage so coming up with an extra $800 in a few days was...challenging. I'm usually a pretty forgiving person, but that was just so shitty, I just can bring myself to forgive him. Because he screwed all of us. It was just such a scumbag move.",
   "created_utc": 1691521028,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc79qe",
   "message": "Girlfriend and I just bought milk and orange juice and had it on the fridge drink shelf. To discover the next day our roommate had a leaking piss bottle leaning on our shit because our roommates doctor said it needed to be cool. Never asked us or did anything to prevent that shit leaking cause didn't see an issue with it. Couldn't even ask him to pay for the stuff we had to throw away because it wouldn't come from his money but his niece's inheritance that he's actively mooching off of. He has 0 consequences for financial fuck ups of any kind. \n\nThis story or the story how we took a nap and he locked our cat in  90 degree fahrenheit porch for 4 hours the one time we accidentally fell asleep watching YouTube even though we asked him more than several times to check for the cats before shutting the porch door. I almost punched him because my cat nearly had a heat stroke and was begging for water when we found him. Thankfully he was fine after plenty of water and a day rest. We luckily had his yearly within the week and he was fine there as well. But as someone who's normally quiet even angry I couldn't help but scream as hard as I could at this dude. I won't go on longer but man do I have enough stories to write a hefty book... I can't wait for this waste of DNA to move and be out of our lives forever\n\nEdit: didn't finish the cat story just was angry thinking about it lol",
   "created_utc": 1691521585,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc7zai",
   "message": "First year of uni I met someone in my flat who seemed nice at the time. We decided alongside others to move into a house the next year. I at the time had some mental health issues which one of them took offence to and decided they didn't want me to live in the house. I took the bullet and said fine I'll live on my own and wanted to stay friends with them. A few weeks later we had a meeting in which they all wanted me out of the friendship group about saying \"awful things\" about others in this group. The truth of the matter was the first person i met from this group said all of these awful things in fact they vented it all to me and blamed me for some reason (my guess was my mental health issues) \n\nI spent 6 months feeling incredibly guilty and depressed (idk why) for something I didn't really do. I also found it hard for the rest of my uni course to make other friends so I spent most of it indoors and in a single bedroom apartment.",
   "created_utc": 1691521846,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc8c6z",
   "message": "A guy lived in the basement of the house I rented a room in. He had a bunch of super sketchy friends, but it wasn't a big deal until the place was raided by a SWAT team because one of the friends had shot and killed two people in a robbery.",
   "created_utc": 1691521979,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc90hy",
   "message": "How he jerked off in the closet",
   "created_utc": 1691522223,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvc9v04",
   "message": "I lived in my car one Minnesota winter after making some stupid decisions, so then I started looking for a roommate son Craigslist, and found a guy who needed a roommate. I'm telling you right now, after that experience, I would have lived in my car for the rest of my life. That was the longest year of my life. Now the nice thing was we worked at opposite shifts and the reason that he needed me to move in with him was because he had a spending habit and he wasn't spending his money on rent. Within the first week of me living there he brought a brand new Harley Davidson home that he's been 35,000 on now mind you he owed the people he was renting from several months worth of rent and then proceeded to park the motorcycle in their garage. He would do little things that would drive me nuts, first of all he would take the garbage bag out of the garbage walk it across the carpeted floor in the living room dripping it all the way there and then would leave it next to the door as if it was going to take itself out and then he would leave for work. The second thing he would really enjoy doing was letting his cat vomit all over the house, and then he would just step over it instead of cleaning up. After I finally moved out after a year, he started calling me and threatening my life because he thought that I stole his Adult DVD collection. It only took one police report to stop that insanity.\n\n\nThe second worst experience was when I moved to California. This was in 2008 during the recession. I couldn't find a job in my home state, had a friend who lived in california, and thought what the heck I might as well try something different! So I booked a one-way ticket and flew out there with about $1,000 in my pocket and moved into a four bedroom house with eight guys bunk bed style. I tell people today that it was a cross between a frat house and a halfway house. I've never lived somewhere so messy that you could drop something on the floor and think to yourself I could leave that there and it wouldn't make a difference. There was a fly infestation so bad in the kitchen that the light fixture was completely black, the garbage would pile all the way up to the ceiling some days, nobody wanted to do the dishes and then they wanted to have a meeting of roommates to decide who was going to do the dishes and when my vote was you do your dishes when you dirty your dishes I'm not your mother. One of the guys rented the house from his parents but he always referred to them as the landlords so I would always correct him to remind him that it was his parents we were renting from because everything else that those guys did drove me nuts so every once in awhile I was just super snarky. Luckily, the room that I shared with my friend was probably the cleanest room in the house. It took me a month to find a job, and then I would have to commute over four different buses, and if I missed one, I was walking home. I also want to make $15 an hour in my hometown to make about $8 an hour in california. Rent was still $400 a month for each of us eight guys. That lasts until I ran out of the $1,000. Then I got a plane ticket home and never looked back. Oh, also, it should be noted in that month. I did a little bit of dating. One woman even faked a pregnancy on me.",
   "created_utc": 1691522529,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvcbsul",
   "message": "I had a roommate who would leave kitchen knives on the floor near my bed under a pile of her clothes.. I never slept in my room if she was there bc I was afraid she’d hurt me",
   "created_utc": 1691523234,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvcbzti",
   "message": "I had a good friend who needed a roommate, and I was being told I had to leave my house. At first, it was ok, but after a few months, I started dating a guy. We kindly ask for privacy the few nights we'd be there, and she'd say ok, but we would come home during the date and \"locate\" us and barge in. When that wasn't working to her plan, she would call my controlling mom and say she couldn't get a hold of me and I wasn't home, just so my mom would constantly call my cell. After that, the guy and I broke up. On top of that,  she was stealing items from me to pawn, not paying rent, and had her dog hump every piece of furniture we had. Last roommate ever.",
   "created_utc": 1691523303,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvcc7c9",
   "message": "I had a neo-nazi roommate that routinely got so drunk he couldn't stand. Ended up trashing the house when I was on vacation and moved out soon after.  I never saw him again.",
   "created_utc": 1691523380,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvccvs8",
   "message": "To start, I’m alive, out and well and this is not a « my roommate classifies for murderer » but if my health decides differently… It would have been.\n\nI had a roommate that was older than me (mid-fifties) and seemed really great at first. A few months in, I understood quickly that she was very needy, but more importantly, very selfish in her living choices. \n\nI’m allergic to cats. Not deathly allergic, I can actually pet them if I wash my hands after, and be somewhere inside with cats for a few hours but it can get uncomfortable really quickly if it’s a bad day, and I, obviously can’t live with them. \n\nWell, I was about to move out, looking for a place to live but not found for now. My roommate told me how much she missed having a cat and will get one directly after I’m gone. Sure, nice ! \n\nShe went to get a kitten from some guy on Facebook behind my BACK, me still being there for DAYS. She was like « he’s going to stay in my room don’t worry » etc. But I mean, I’m only human, of course I want to see the little guy and also, being kept inside a bedroom for days ? Doesn’t sound great for him.\n\nAnyway, that’s not BAD BAD but it’s the principle. It’s not like cooking something someone is allergic too, its a living being, not fair to keep him in a 9SQ room for me. And I am one too, not fair to add another living being where I live that could get my nose and my throat very uncomfortable.\n\nYou’ll be glad to learn that after three days, she was done with the kitten. « Too tiring » and « too energetic ». I can’t have cats but even I know that ? She sold it to someone for more money 6 days after having him. \n\nI was crying in my room because already attached (played with the little guy in the mornings for 2 hours before work cause she put him out of the bedroom eventually) when they came to take him (at least sounded like a nice family) and when she closed the door, she sighed in relief. In that very moment, I knew we weren’t the same people, in our views, as to how she respect living beings such as animals or humans and that I couldn’t wait to get my own place. \n\nThere was also a lot of emotional bullying and instability, selfishness, but that’s cherry on top, cause all I need to know is all in how someone treats animals.",
   "created_utc": 1691523626,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvcdfmw",
   "message": "I suppose I have two. But here's my first. I had moved in with a buddy of mine that was fairly close but it was his first apartment since we were in college. He did not have a lot of practical skills for things like cooking, cleaning etc. Some basic examples would be asking me how not to burn his water while boiling it and filling the dishwasher with actual dish soap and foaming up the whole kitchen. \n\nLong story short, my girlfriend at the time had stayed over one night. The next morning, she woke up not feeling well so I offered to run to her place a few minutes away to walk her dogs so she could get some more rest. I left to go do that and while I'm walking the dogs, get a call from my landlord that black water is draining into the apartment directly below mine. He was wondering if I may know what's going on. I said I wasn't home but I would call and see what's up and take care of (he and I had decent repoire since the previous tenants had fked up the plumbing installing a small washing machine by splicing the pipe to the shower and cutting thru the wall. The drain pipe for the washer was just a real tall PVC pipe aimed upward with some paper towels stuffed down it... Long story short, I fixed it for him and earned a ton of points with landlord)\n\nSo I call my roommate and no answer. Just after that, my GF called me saying my roommate has shit in the toilet, clogged it, and just flushed it til everything was all over the floor and left. He said he was going to get a plunger and be right back. \n\nI rush back home to find that the landlord had come to the apartment and my sick GF was left cleaning literal shit water off the floor since we had been informed that our neighbor below was a recent kidney transplant recipient so we had to evac him until everything could be properly cleaned and sanitized. \n\n4 hours later, my roommate returns. No plunger... He had ran every other errand he needed to do. I was livid. I asked him wtf he was thinking and he said he thought adding more water to the bowl would push everything down. Then when it flooded, he thought the plunger would solve the issue and help cleanup... We stopped speaking and moved the fuck out of there.",
   "created_utc": 1691523825,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvcfoyw",
   "message": "My highschool best friend. \nThat mf would come up missing when it was time to pay rent almost every time and I'd have to hunt him down and threaten to kick his ass if we got evicted. \nThen he would always try to throw patrys when I was trying to sleep for work early the next morning. \nThe final straw is when he tried to move in this unemployed skank without my knowledge or even talking to me and I was like nah y'all mfs got to go.",
   "created_utc": 1691524629,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvcg4rl",
   "message": "I had a few \"the worst\":\n\nThe one who would get blackout drunk, stand outside of my bedroom door and laugh maniacally.Then piss his bed.\n\nThe one who set the kitchen on fire by falling asleep while cooking. I put it out, and started yelling at him to get up and deal with it. He just laid there and said, if the fire is out, then what do you want me to do about it?\n\nThen the \"friend\" roommate who.was stealing from me and other people in my circle. I called the police to kick him out and they wouldn't. He refused to move out. So I waited for him to leave the house, then I threw all of his belongings into the street and changed the locks",
   "created_utc": 1691524783,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvcg6sj",
   "message": "I have a \"good\" bad story of a roommate situation that actually gave me PTSD and rendered the house condemned.\n\n\nAbout 10 years ago I made enough money that I wanted to move out for the first time in my life. At the time my sister, her bf, and her friend (let's call this friend \"Mary\" wanted to share the 3 bedroom house and split the rent. I was like, cool, this will save a lot of money. Little did I know that this cost savings would actually cost me my sanity for 6 months.The moment they moved in everything went to hell. \n\n**First, the dog**\n\nFirst it was my sister's dog \"Opie\". Opie was this  jellybean shaped Chihuahua Pitbull mix chimera that was functioning with a single braincell (bless Opie's heart). She would  eat literally anything and everything within reach. Opie loved eating fucking ink pens and needed her stomach pumped three times over the duration of the lease. Despite thinking of Opie as possibly the dumbest dog on the planet, I took care of her and made sure she was loved and cared for the best I could. I turned into Opie's full time caretaker because my sister and her bf were never around. \n\n\n**Dog shit in the living room**\n\nSo I mentioned that I became Opie's caretaker while working full time and having my own life. I don't always have time to check on the dog because a). Working full time and b). Not my fucking responsibility. My sister and her bf worked but would also go out with their friends and forget about letting their dog out or FEEDING it so naturally Opie took to shitting in the living room. Not the dog's fault. My dumbfuck sister and her dimwit bf are never around and didn't bother to train it to go outside. So now there was actual piles of dog shit around the living room. Initially I cleaned those up for my own sanity but it gets worse.\n\n**Mary finds a stray dog from hell**\n\n\nMy sister and Mary are the worst types of hoarders. They hoard animals. Mary already has her stinky sugar gliders in her bedroom and without asking anyone decided to adopt this stray dog she named Diablo. Diablo, like Opie took to shitting in the living room. Diablo also liked to bark at all hours of the night, especially in the morning when I had work at 8am. \n\n\n**The thing that broke me**\n\nEventually I got tired of cleaning up dog shit. I told them these pets were their responsibility and that I'm staying in my room until this lease is up. So now our living room became unliveable because they would actually sit around watching TV with piles of shit around them!!! I was either out of the house or stayed in my bedroom when I had to be there. The house was starting to smell like a moldy barn and the floor was rotting away. The sugar gliders got free and that whole thing ended with busted out windows and a huge hole in the hallway wall. At this point I broke the lease because it looked and smelled like a crack den minus the actual crack. It was a fucking trap house for mentally unwell animal hoarders. Months later the house was actually condemned. \n\n\nI never want roommates again.",
   "created_utc": 1691524803,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvci8c2",
   "message": "My dorm, consisting of 6 rooms, had a kinda haunted room for international students. The one guy from Africa never exchanged a single word with any of the roommates, but was on Skype chatting with someone 24/7. He also didn't use the fridge, putting his perishable groceries into the drawer instead. Oh, the smell... After him we had a weed enthusiast who disappeared one day, leaving the weed stench but also all his belonings behind and again after him there was this Asian girl who microwaved lettuce. All of them not really bad, but strange as f. No hate here, there are enough weirdos in every country.",
   "created_utc": 1691525534,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvcjegc",
   "message": "My previous roommate. \n\nBackground: I’m a closest cross dresser and attracted to guys. But I’m not out open due to family reasons. My ex roommate learned about this and told his gay friends and they blackmailed me and leaked it anyway",
   "created_utc": 1691525954,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvcktrq",
   "message": "She didn't change her bedsheets for a ENTIRE YEAR.Her bed was covered with period blood and grease.Bed was smelling so bad it made whole room smell.💀💀💀💀💀💀💀💀💀💀💀💀💀💀",
   "created_utc": 1691526460,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvcl5gv",
   "message": "Caught a guy who I rented an airbnb out to ballsdeep in a mini pony 🙈🙈🙈🙈",
   "created_utc": 1691526576,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvcl6qb",
   "message": "Besides constantly filling our kitchen with trash and refusing to clean up after herself, she was constantly locking my poor cat in and out of places. He was lost for about a week once, which might not seem terrible, but he'd been in indoor cat most of his life and there were coyotes in the area in addition to a high-traffic road not far from the apartment. And every time I brought her attention to it, she would refuse to acknowledge it. It was such a simple, straightforward thing to do - look out for the cat before you shut the front door! - and she would flat-out refuse every time because she couldn't accept that she'd messed it up in the past. Turned out that was part of a pattern of her refusing to accept responsibility for anything she'd done wrong, including the trash in the kitchen. We were friends for like 4 years before moving in together and I never spoke to her again after moving out. I could put up with her being a slob, but not with her endangering my animals.",
   "created_utc": 1691526588,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvclv4z",
   "message": "Got a room in a place that was supposed to be around 8 people mostly internationals studying, doing internships etc. Turns out the landlord lived there too. He was there all. the. time. Didn't have the money to look for another place and lose my deposit. He spend his days sitting at the computer shirtless smoking Newports. His \"\"\"job\"\" was subletting rooms to desperate foreigners. During the day he would have Law and Order on. Sometimes he would get up at 4am and have a robot voice read Al Jazeera articles. His computer was in the communal area in the middle of the loft (rooms were on the sides). He'd constantly bring shit he found on the streets home. He constantly lied (said he has a daughter, no kids, is 55/54/53/5whatever), when people moved out before the agreed period, since it was horrible to live there, he didn't give them their deposit back. There was a pregnant cat that gave birth to around 7 kittens. That would basically live in his disgusting hoarder room. I didn't see a cat toilet anywhere. Once I was standing in front of his room. The smell was beyond disgusting. I assume the cats just pissed and shat all over that room. He would do dishes in the middle of the night being loud as fuck. He didn't put on his shoes properly so constantly heard him dragging his shoes across the floor. When my brother visited he joked about how I like to exaggerate. Two days later he said \"I know it's wrong but I want him dead.\".\nFuck you John you disgusting parasite. Roommates were amazing people tho. One of them got robbed in front of our house. She told him she doesn't feel safe and that she wants to move out and have her deposit back and that she would help find a new tenant. He called her a bitch and told her to try and sue her and that he has 0 pennies in his name.",
   "created_utc": 1691526833,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvclve4",
   "message": "So, we will date back to my childhood. In secondary I was pretty good mates with a guy called Elis. We became friends pretty much the first day of high school, at first we were our own little duo but eventually we had a good group of friends hence our friendship got stronger. He was a good friend of mine, we hung out with eachother the most. After two years of our friendship, Elis came out as homosexual. He told me he doesn’t have any sexual loving towards to me and hopes I don’t see him any differently, to be honest it was a large shock to me, but I promised him I didn’t mind and agreed to not see him any differently. People would always make jokes about me and him being in a relationship and ‘shipping’, but honestly I didn’t care. He was a nice and loyal friend and that was that. \n\nAfter being friends for I’d say a good 11 years, me, Elis, and my girlfriend at the time Summer, all decided to move in together in a 2 bedroom flat, me and Summer sharing whilst Elis had his own master bedroom. It was great for about a year, we would have Friday nights where we would all watch a film and order a takeaway we could all agree on and would always make plans during the week. My life was happy, I was living peacefully in my new humble home with my best friend and the woman I love more than anything, this was up until approximately a year and a half of living together.\n\nElis started visiting gay night clubs. I didn’t see it as a big deal as he was gay, of course, until he started bringing men home.\nWhenever me and Summer had sexual activity, we would always do it without Elis being home, understandably, but Elis did it much worse, and it is alot worse than us just being able to hear him.\n\nElis had a single bed, he had a decent sized room but he had lots of furniture taking up the room so he switched to a singular bed. Summer and I had a double, of course. I took Summer out for a Valentine’s date, Elis staying home as he was single. Me and Summer stayed out not very late, we came back earlier than planned as I spent a bit too much money on her. We opened the flat door and sat down on the sofa, it was a Friday night so we thought we would finish it off with the usual routine, takeaway and a film. I entered Elis’ room and he wasn’t in there strangely, and he certainly wasn’t anywhere else in the flat and he wouldn’t have gone out knowing it was Friday night. We rang his phone, having heard it come from our room we opened the door. Him and a well, older, man were doing the deed. I gasped in shock and shut my eyes and instantly turned around. Elis was just about as shocked as I was, and the elderly man gasped and covered his weiner with his hands but it was a bit too late for that now. Summer asked me what and was trying to move me out the way to see for herself, but I put my arm around her and walked her back to the sofa, but I think she could already tell by my face. I was honestly disgusted, my childhood best friend was receiving anal from an about 50 year old man in my bed and I witnessed it with my own eyes. Just what the fuck. Me and summer ordered takeaway without him, we ordered a kebab and I ordered a donner meat kebab with garlic mayo, but the garlic mayo really put me off as of what I saw squirting from the man’s weiner. Whilst watching the film, me and Summer barely said a word to eachother, and halfway through the film I saw the man leave our flat in his collared t-shirt, tie and black sweatpants holding a briefcase. Worst part, he had a ring on his finger. Elis didn’t open the door goodbye or anything, the man just walked out without saying a word. Elis sat in his room after he left.\n\n\nAfter the film had finished, me and Summer headed straight to bed. We took the duvet off the bed, and saw what we’d call a massive patch of where liquid had settled. We did rock, paper, scissors to dibs who had to sniff it and see what it was, Summer losing. She got on her knees and I held her hair back  as she sniffed it, she immediately stood back up and told me it was urine. This sick freak I had been friends with for over a decade had either pissed on a 50 year old man in my bed or let him piss on him.",
   "created_utc": 1691526835,
   "score": 1,
   "submission_id": "15lkgaa"
  },
  {
   "comment_id": "jvcm0k4",
   "message": "My ex roommates when they moved out started stealing from me and my mom and we saw the kick my dog on the security cameraa",
   "created_utc": 1691526887,
   "score": 1,
   "submission_id": "15lkgaa"
  }
 ]
}