{
 "submission_id": "15loysb",
 "title": "Why did you stop drinking alcohol?",
 "selftext": "",
 "created_utc": 1691516608,
 "permalink": "/r/AskReddit/comments/15loysb/why_did_you_stop_drinking_alcohol/",
 "score": 124,
 "url": "https://www.reddit.com/r/AskReddit/comments/15loysb/why_did_you_stop_drinking_alcohol/",
 "comments": [
  {
   "comment_id": "jvbvzxs",
   "message": "Saves a lot of money and feels much healthier/happier",
   "created_utc": 1691517504,
   "score": 181,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbv52v",
   "message": "Because of the morning after. When you feel like a hollow and anxiety ridden puddle of a human. \n\nI was a fun drunk. Not a fighter, not an angry person, not sloppy, etc. So, making the transition out of alcohol use was a hard one for my friends and family to understand. It seems people need a big messy explosion to justify sobriety, but my explosion was an *implosion*. A deep self-hatred that no one felt but my hungover zombie brain.",
   "created_utc": 1691517189,
   "score": 220,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbuycg",
   "message": "I was tired of being hungover",
   "created_utc": 1691517121,
   "score": 62,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbx7xu",
   "message": "My weed and amphetamine addiction was enough already",
   "created_utc": 1691517951,
   "score": 59,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbu1l5",
   "message": "I’m sad when I drink",
   "created_utc": 1691516796,
   "score": 31,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbwauu",
   "message": "Was packing the pounds on me.",
   "created_utc": 1691517613,
   "score": 31,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc53b8",
   "message": "I took lsd, it changed my life and alcohol doesnt make sense anymore",
   "created_utc": 1691520794,
   "score": 32,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbzeyk",
   "message": "got pregnant! feel better than ever even w morning sickness and other pregnancy symptoms",
   "created_utc": 1691518756,
   "score": 22,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc2h0h",
   "message": "Leads me onto 3 day cocaine benders.",
   "created_utc": 1691519856,
   "score": 26,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8myq",
   "message": "When I realized I was a complete, full blown and hopeless alcoholic. I needed it to sleep and to function. Every single night. Multiple bottles of wine at minimum, and would panic if I didn't have enough. Ruined every relationship I've ever had. Woke up viciously hungover every day and would start drinking in the morning before work. When I stopped I had to be in hospital because of the seizures and hallucinations from withdrawal. \n\nEven after all of that, my crazy mind told me I could figure out a way to drink like a normal person.\n\nThat's\\^ how powerful alcohol is to certain people. I realize most stories aren't like this but just wanted to share mine haha.",
   "created_utc": 1691522087,
   "score": 22,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc3bqe",
   "message": "Felt like I was drinking too much so I got an early jump on dry January. Went through some mild withdrawal. Wasn't going to let some fucking drink control me so I stopped.",
   "created_utc": 1691520164,
   "score": 19,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8ub9",
   "message": "It’s poison, it does not serve my goals or priorities.",
   "created_utc": 1691522161,
   "score": 17,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbtt40",
   "message": "no alcohol left in fridge",
   "created_utc": 1691516710,
   "score": 47,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc18bu",
   "message": "Because I drank too much.",
   "created_utc": 1691519410,
   "score": 16,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbtyw6",
   "message": "21 wine coolers for my 21st birthday.\n\nAfter that \"colorful\" experience, I didn't drink again until my 28th birthday...",
   "created_utc": 1691516769,
   "score": 14,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc242r",
   "message": "I turn into a demon",
   "created_utc": 1691519727,
   "score": 12,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9g2q",
   "message": "It just wasn't as fun without crack",
   "created_utc": 1691522381,
   "score": 12,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc36py",
   "message": "I didn't stop drinking entirely, but I have recently stopped buying it to keep at home.  I was finding it too easy to open up the liquor cabinet for a nightcap each night.  \n\nI still will drink when I go out sometimes, but I don't go out that often and when I do go out the price keeps me from getting more than a couple of drinks anyway.",
   "created_utc": 1691520114,
   "score": 11,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc76ut",
   "message": "I was too hungover to play with my son.",
   "created_utc": 1691521556,
   "score": 12,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc2ly3",
   "message": "It became a seizure trigger.",
   "created_utc": 1691519906,
   "score": 10,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbu25y",
   "message": "Had to go to work",
   "created_utc": 1691516801,
   "score": 9,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc2flo",
   "message": "I just felt increasingly out of control of the amount I drank. Found it harder and harder to get through each day without taking a drink. Got sick of feeling shitty in the morning.",
   "created_utc": 1691519842,
   "score": 8,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc1kjj",
   "message": "I never liked the taste.\n\nFor many years, I gave into the peer pressure. Only I'd have rum and cokes with one part rum to 12 parts coke or something.\n\nEventually, I just started asking for a Coke.",
   "created_utc": 1691519532,
   "score": 8,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9v1k",
   "message": "Because I was escaping small moments of discomfort with a 3-5 beer a day habit, and drinking more than that on weekends. Essentially a highly functioning alcoholic, with a good job and a great relationship, but if I kept doing the things that I was doing, I was going to melt my life to the ground. Alcohol was keeping me from fully engaging in the relationships that were important to me. And so I decided to fundamentally change the relationship that I had with alcohol. \n\nThat breakup really sucked, but we won’t be seeing each other that way any more.",
   "created_utc": 1691522530,
   "score": 8,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbxc7i",
   "message": "I’d drink 3 triple shots of Patron and not feel it 5 minutes later. At $17 a shot BEFORE tip it was just too expensive.",
   "created_utc": 1691517996,
   "score": 7,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc2tuk",
   "message": "I saw what it did to too many people who died. Much rather weed. Less angry people lol.",
   "created_utc": 1691519987,
   "score": 7,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc3zsd",
   "message": "Takes too much to get me to a point where it’s worth it",
   "created_utc": 1691520401,
   "score": 5,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc5scf",
   "message": "I feel like my hangovers have gotten worse over time. To the point where even a relatively small amount of alcohol (like 2 glasses of wine) will give me a bad side effect. The pros and cons ratio leans heavily towards the cons. It's not worth it. Weed is the way to go.",
   "created_utc": 1691521047,
   "score": 4,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbynbc",
   "message": "Had to drive. Now about to open a pack again",
   "created_utc": 1691518475,
   "score": 9,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc45nm",
   "message": "It was a crutch to get through the day without thinking about my traumatic childhood.",
   "created_utc": 1691520460,
   "score": 3,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc4wjg",
   "message": "Headaches and feeling like crap next day , no thanks",
   "created_utc": 1691520728,
   "score": 4,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc5q3v",
   "message": "Used it as a coping mechanism one too many times and it's one of the worst things you can get addicted to. Saw the patterns, ended the patterns early. Now I drink moderately on the rare occasion, if I'm with people and genuinely having fun instead of...y'know, self medicating alone on my balcony at 3 a.m. to Russian post-punk.",
   "created_utc": 1691521024,
   "score": 3,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc6dmo",
   "message": "The 12 to 48 hours of recovery... When you're reevaluating life decisions throwing up and or both having diarrhea at the same time. \n\nAlso it brings out the worst in people, not to mention I can't count how many people I've seen piss on themselves or shit themselves from drinking too much.\n\nIf alcohol was illegal today it would never become legal, it's the most destructive drug to yourself and society.",
   "created_utc": 1691521260,
   "score": 4,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc6m5j",
   "message": "I got too good at it.",
   "created_utc": 1691521346,
   "score": 4,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc757w",
   "message": "Im not a true alcoholic, I have issues with alcohol sometimes, and there was a period of time in my life where I was truly abusing alcohol (buying liquor every few days and hiding bottles (only lasted like a few months)). \n\nAfter taking a long break I introduced it back into my life in a healthy way, having a few beers after working out or drinking with friends, drinking only in the evenings etc. I was able to keep that up for a while but I slip sometimes and find myself breaking rules and drinking too much. Im not a wild drunk or anything, it just isnt healthy and Im already overweight and need more exercise. \n\nI had taken another sabbatical recently when the habit got a little out of control, which for me is when i go above 15 to 20 drinks a week and drinking everyday. I stopped to make sure I don't get into the depressive cycle that alcohol provides. I find myself wondering if I should just kick it completely sometimes, but it just doesn't seem socially practical in any way.\n\nSo yeah, i stopped for my health and mood recently, and when it was a serious problem for me I stopped because you put your life in danger when you drink for the entire day, being impaired the whole day is not safe for a persons body and mind.",
   "created_utc": 1691521540,
   "score": 3,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7m7v",
   "message": "I started binge drinking at 19; I was 25 when I  knew it had the upper hand on me.  When I woke up on the floor and remembered I put Goldschlager in my cat’s water dish on purpose (he didn’t drink it - he sniffed it and gave me a look like “What the fuck is this!?”), I knew I had to stop, if only for a while.\n\nI went cold turkey and didn’t drink for 15 months.  Afterwards, I very slowly got back into drinking.  I don’t drink at concerts anymore after pregaming very hard, then spraining my hand and getting multiple mysterious bruises at a gig last year… and drinks are $20+ these days 😅\n\nNow I’m 43 and split a bottle of wine with my wife once or twice a week.",
   "created_utc": 1691521712,
   "score": 3,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8ncn",
   "message": "Got diagnosed with type 2 diabetes last October.   Quit drinking and the diabetes went away.",
   "created_utc": 1691522091,
   "score": 4,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvchk99",
   "message": "Broke my foot, broke my collarbone, made a fool of myself and could not live with the regret. It also went hand in hand with cocaine abuse. It made me suicidal and I realised alcohol was going to be my death one way or another if I did not quit.",
   "created_utc": 1691525292,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbx7e6",
   "message": "Found meth",
   "created_utc": 1691517945,
   "score": 6,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc0ges",
   "message": "i stopped drinking beer because it makes you fat and gives you man boobs.",
   "created_utc": 1691519130,
   "score": 5,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbwsya",
   "message": "Medical reasons",
   "created_utc": 1691517798,
   "score": 3,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc39h5",
   "message": "I ran out. Need to get more",
   "created_utc": 1691520142,
   "score": 3,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc4fd2",
   "message": "I had to go to sleep so I could get up this morning and go to work.",
   "created_utc": 1691520557,
   "score": 3,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc6d6t",
   "message": "Started drinking at 14, stopped at 48. Enough’s enough.",
   "created_utc": 1691521256,
   "score": 3,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8fz8",
   "message": "It made me fat and sad. Now I'm skinny and sad lol. Not really though, I like not drinking a whole lot more than drinking every day and I'm generally happy.",
   "created_utc": 1691522018,
   "score": 3,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8led",
   "message": "I grew up and got tired of paying to get sick.",
   "created_utc": 1691522072,
   "score": 3,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvca5hn",
   "message": "I ended up in the hospital with severe pancreatitis.\n\nOn christmas day. \n\nTwo weeks of excruciating pain. Unable eat. Tubes in all sorts of places. And my god the looks some of those doctors gave me I will not forget. \n\nI was told if it ever happens again I'm probably getting a big hole put in my stomach that they can feed me through.\n\nSo. I had to stop. That was like a year and a half ago.",
   "created_utc": 1691522634,
   "score": 3,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvca5v8",
   "message": "It has too many calories and was leading to binge eating for me",
   "created_utc": 1691522638,
   "score": 3,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvcbbe0",
   "message": "Being an addict means the only way to get rid of one drug is to get rid of them all.",
   "created_utc": 1691523058,
   "score": 3,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvcg6bh",
   "message": "I felt really off lately, I can confirm it was alcohol as it improved significantly after I stopped.",
   "created_utc": 1691524798,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8ika",
   "message": "Because I never started.  I honestly don't know why anyone willingly acquires a taste for alcohol, the cost involved, or the repercussions of drinking too much/too often.\n\nDrinking alcohol is almost all downsides.",
   "created_utc": 1691522043,
   "score": 4,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbud26",
   "message": "After hearing all these reports about it being carcinogenic and that they only recommend one drink a week, it’s not nearly as appealing to me.",
   "created_utc": 1691516908,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbx1gd",
   "message": "tasted like shit",
   "created_utc": 1691517884,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc4h0c",
   "message": "On a couple of meds that don’t mix with alcohol.",
   "created_utc": 1691520574,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc4lcp",
   "message": "Didn’t feel like it anymore, wasn’t fun partying or drinking for me",
   "created_utc": 1691520617,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc521i",
   "message": "Started micro-dosing and stopped liking the taste of alcohol and the feeling of being buzzed",
   "created_utc": 1691520782,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc5ak2",
   "message": "I ran out.",
   "created_utc": 1691520868,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc5dom",
   "message": "To maintain brain health.\n\nBesides, I'm a nice mellow drinker, but another person who I used to drink with was a bit of an asshole, and that just killed the vibe.",
   "created_utc": 1691520898,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc5koo",
   "message": "I didn't.",
   "created_utc": 1691520969,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc5qtu",
   "message": "Well my doctor told me to last week. Apparently acid reflux and wine don’t mix well.",
   "created_utc": 1691521031,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc684j",
   "message": "I would say stupid things, then text things to people I later regretted, and then at some point I started flaking on plans when I was too drunk to remember or bother to warn them. That was definitely not the person I wanted to be. The worst was when I actually lost a job over it. After that I went to counseling and stopped drinking altogether, and it has definitely improved my health and relationships with other people.",
   "created_utc": 1691521205,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc6l0y",
   "message": "Because it made me sad ...",
   "created_utc": 1691521335,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc6z3f",
   "message": "Because of a little think I like to call ...marijuana.",
   "created_utc": 1691521478,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7606",
   "message": "Never did much for me, and I prefer the stimulating effects of coffee.",
   "created_utc": 1691521548,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7j5o",
   "message": "Cirrohosis at 30",
   "created_utc": 1691521681,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7nez",
   "message": "I called it 'a distraction' from doing what I wanted to do.\n\nI would have the motivation then have a few drinks then bam. done for the night, wasting the potential to do things. it changed my taste buds so I couldnt have coke without rum, etc. i would have 3-5 shots a night of jerrys or jaeger and red bull... then my heart started complaining as well.\n\nnow I am having to try to get off of high fructose corn syrup which is what I think I jumped my habit to. I think there's a medical term for that; when you substitute a habit for another one.\n\nnow that I dont drink I sleep regularly and my heart has stopped complaining. I'm drinking more naturally flavored sparkling water now too\n\ni never drank because i was sad or wanted to forget and never got blackout drunk or anything but I was drinking for over 20 years",
   "created_utc": 1691521724,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7vyu",
   "message": "I developed some weird intolerance to it in my late 20s. \n\nAny amount of alcohol basically makes me sick now. 🤷🏻‍♀️",
   "created_utc": 1691521812,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8og6",
   "message": "Just not my thing and it give me gut issues for days afterwards. Oh and it's expensive!",
   "created_utc": 1691522102,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8ox3",
   "message": "I didn't completely give it up. But I always feel depleted the day after, even if it's just one drink. I stopped getting drunk over 40 years ago. It's not good to start the New Year throwing up all day long.",
   "created_utc": 1691522107,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8zr0",
   "message": "I like being alive and not behind bars",
   "created_utc": 1691522215,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9vo1",
   "message": "didn't know when to stop",
   "created_utc": 1691522536,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvcab3i",
   "message": "I tried for 10 solid years different tricks and ways of drinking to not over drink. I would do good for a few months and something would happen in my life and I would spiral for 3 or 4 days. Last one was 6 years ago and I blacked out, ended up walking across a highway and ended up at a motel. The next morning I had abrasions all over my body. Not sure what happened but I stopped. There is not a bottom… I’ve been to the bottom several times.",
   "created_utc": 1691522689,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvcaul6",
   "message": "I have Emetophobia.",
   "created_utc": 1691522887,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvccc9m",
   "message": "It’s poison",
   "created_utc": 1691523429,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvccqmq",
   "message": "Never had a problem with alcohol. I stopped because I got tired of hanging out with friends that need it for a good time. My life is good I don’t need it to cope with life.",
   "created_utc": 1691523574,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvcdlnz",
   "message": "I violated my standards quicker than I could lower them.\n\nBlackout drinking led to multiple sexual assaults while unconscious. Violent, painful, scary assaults.\n\nJail. Fucking sucked.\n\nHomeless. Slept outdoors. Hungry and sick.\n\nLiterally nothing, *nothing* good came from drinking. I saw this bearded lady who was mute (from a stroke booty bumping meth) suck dick for left over onion rings behind a dumpster in Las Vegas. I knew that was my future, sex work was the one thing I never did nor wanted to do and it was nearly forced on me via trafficking attempts.\n\nTook 2 years and 5 rehab stays, but I got sober 7-1-2008 and live a dream life today. Home owner. Business owner. Wife. Mother. Currently in Europe visiting in laws, and couldn't be more grateful for the gifts that came with sobriety.",
   "created_utc": 1691523885,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvchfvp",
   "message": "Chronic migraines:( it's always a trigger",
   "created_utc": 1691525248,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvcii6a",
   "message": "I decided being high on drugs was more fun",
   "created_utc": 1691525633,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvcjt82",
   "message": "I’m allergic",
   "created_utc": 1691526099,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvcjvky",
   "message": "One drink and the phenomenon of craving kicked in. No telling where a simple “stop for a few beers” would end. A couple drinks at an afternoon event would almost always mean drinking the rest of the day and night.  Trouble sometimes followed, other substances entered the picture, relationships were unsustainable.",
   "created_utc": 1691526122,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvcjx8b",
   "message": "Because a 1.75l of bottom shelf whiskey every 1.5 days for years absolutely wrecked my liver and I ended up in the ER and then spent 8 days detoxing. Without that medically assisted detox I absolutely would have died. I had a problem. August 29 will be one year without a drop.",
   "created_utc": 1691526138,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvckdj3",
   "message": "I had breast cancer and alcohol DRASTICALLY increases your chance of recurrance",
   "created_utc": 1691526297,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvckh07",
   "message": "Shits wacky yo. Aint nobody trying get their license suspended for 25 years. Wake up the next day feeling like utter shit you have to stay in bed for. Fuck all dhat noise mayne. Drink some lemonade and goto the park",
   "created_utc": 1691526332,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc3gil",
   "message": "I was enjoying it far too much, and got some early blood test results. Had a great time in my teens, 20s, 30s but it caught up with me. Don't miss it.",
   "created_utc": 1691520211,
   "score": 4,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc08ff",
   "message": "Degenerate alcoholic brother and his chaotic life",
   "created_utc": 1691519049,
   "score": 2,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvcauql",
   "message": "Epilepsy",
   "created_utc": 1691522888,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc1yl6",
   "message": "There’s no good reason to drink it",
   "created_utc": 1691519673,
   "score": 0,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc1tsl",
   "message": "I am the 21st comment haha",
   "created_utc": 1691519624,
   "score": 0,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvbtqjj",
   "message": "Ran out. Liquor store doesn't open til 10. The joke is that I have an alcohol problem. Never drank in my life btw. Say no to cocaine and sex.",
   "created_utc": 1691516684,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc1wjf",
   "message": "Weed is better for for your health, it is better for the people around you, and you don't feel like a complete loser smoking a joint at home.\n\nDrinking at home doesn't feel right to me, drunk isn't really a state that is fun to be in if your alone.\n\nScience say's weed is better in virtually every way, and I also personally enjoy the high from it more.",
   "created_utc": 1691519652,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc3a63",
   "message": "Time for bed 🤣",
   "created_utc": 1691520149,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc3hhl",
   "message": "Heartburn",
   "created_utc": 1691520221,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc408z",
   "message": "When?",
   "created_utc": 1691520406,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc488s",
   "message": "I stopped buying it.....",
   "created_utc": 1691520487,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc4a32",
   "message": "I can't recover like I used to and my next day sucks",
   "created_utc": 1691520504,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc4b8s",
   "message": "It works to elevate you, just enough to bring you down.",
   "created_utc": 1691520516,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc4mj3",
   "message": "Honestly, I took a dry February this year - I usually periodically do a dry month - and just felt so drastically better at the end of the month I decided to just keep it going.  I'm sleeping better, I lost a little weight, and I wake up feeling good.",
   "created_utc": 1691520628,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc4mv7",
   "message": "My spouse can't drink it without experiencing inflammation and while I like a good cider every now and again, it's kinda lost the appeal when I can't share it with her.",
   "created_utc": 1691520632,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc4oeo",
   "message": "I couldn’t afford it",
   "created_utc": 1691520647,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc4sgu",
   "message": "Trying for a baby. And then pregnancy and breastfeeding. And then just being the responsible adult and available to drive, etc.\n\nI think my last drink was in 2016, the one before that 2013, and the one before that 2007.",
   "created_utc": 1691520688,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc5f6i",
   "message": "IBS",
   "created_utc": 1691520914,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc5gpd",
   "message": "They got sick on “first”. period.",
   "created_utc": 1691520929,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc67bf",
   "message": "Because it made me more depressed and miserable. I tried to numb myself for a while but it always left me feeling more empty than I was before. Grew up around alcoholism and swore I’d never go down the same path. So I made the conscious decision never to drink.",
   "created_utc": 1691521197,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc6bm9",
   "message": "Because being myself felt better",
   "created_utc": 1691521240,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc6v7q",
   "message": "Hangovers and getting a cold for a week every time I mowed",
   "created_utc": 1691521439,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc6ybr",
   "message": "I was really annoying and it didn’t take much to upset me. I got incredibly selfish and you would only have fun with me if we were equally drunk. But for me, at the time I thought I was being a fun person lol.\n\nThen I found myself having beers alone talking to the bartenders which I guess is fine but I was 21 and everyone around me were old fat dudes. People were pointing out I may be becoming an alcoholic.\n\nIt just took one final night of getting way too drunk and not remember how I got to my friends house with tons of cigarette butts all over my clothes stinking up my friends apartment.\n\nI’ll stick to herb if anything.",
   "created_utc": 1691521471,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc6yxn",
   "message": "Too many DUIs.\n\nFrom my early to mid 20's I had already got 3, decided that alcohol only destroyed my life and made my problems worse. Drinking started out fun but then became a serious problem later down the road. \n\nThat was 20 years ago, took me 5 years to get my license back. 20 years sober this coming October.",
   "created_utc": 1691521477,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc6yzj",
   "message": "Once when I was living alone I got BLACKOUT wasted. Had an orgy with my friends after the club and when they dropped me off at my house after I blacked out immediately upon opening my door.\n\nI woke up the next morning on the floor in front of my door with my door still open, keys in the door knob, throw up stuck to my face, \u0026amp; I shit and pissed on myself. I was a mess. I choose to drink VERY occasionally now and definitely not as much. I hate the feeling of being trashed + I’m a stoner anyways and it’s not my vibe",
   "created_utc": 1691521477,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc709r",
   "message": "Because I don’t even started)",
   "created_utc": 1691521490,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc78jz",
   "message": "I realised I didn't actually like it .",
   "created_utc": 1691521573,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7cdg",
   "message": "It’s disgusting and I get no enjoyment out of it. I hate drinking culture and one drink is enough to make me produce enough vomit in one hour that 5 people produce in a whole day",
   "created_utc": 1691521612,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7ecv",
   "message": "Ran out. Need to get more.",
   "created_utc": 1691521633,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7jf9",
   "message": "I've seen it completely rot people to their core and beyond. I've seen the coolest people stumble, fall and never return from the poison. I seen it ruin people beyond repair and I wish nothing to do with it. I don't get upset when I am around people enjoying alcohol and don't mind if others imbibe. Addiction is a real pain in the ass. So for me, no thank you.",
   "created_utc": 1691521684,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7liw",
   "message": "Just didn’t have any more fun drinking than sober and the dehydration really made it just not worth all that",
   "created_utc": 1691521705,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7mjq",
   "message": "It wasn’t my “thing” anymore. I drank socially for a few years and then one day just didn’t want to do it anymore. I didn’t like wasting so much time between drinking, being social, going out to be social to drink, and spending the rest of the next day feeling crummy about myself. Don’t get me wrong, I still socialize when I have the time, but I just don’t drink anymore. My friend group mostly outgrew it as well. Now we just get together and drink lemonade or water with our meals or go for hikes, bike rides, or visit museums or aquariums.",
   "created_utc": 1691521716,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7o4a",
   "message": "Didn't had a place where it was allowed but I'm OK with the fact",
   "created_utc": 1691521732,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7oxy",
   "message": "Motorcycle accident, lost taste for it 🤷🏾‍♂️",
   "created_utc": 1691521741,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7pxw",
   "message": "Saw the pain it caused my mother dealing with two drunk older sisters. Sleepless nights, jail, police, crying, fighting, even went missing for a night. Fuck alcohol honestly.",
   "created_utc": 1691521751,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7s3r",
   "message": "When I ran out of it, I never went to buy more. Will be a year sober aug 20. Best choice I’ve made in my adult life.",
   "created_utc": 1691521773,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7sfx",
   "message": "It caused me to gain weight; it had control over me to where I'd finish a beer and immediately crave another one; it is really, really bad for our health in many ways.\n\nI wasn't expecting to feel so free of it after I quit, but  I do. It has no power over me anymore.",
   "created_utc": 1691521776,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7skg",
   "message": "Funny enough I decided to stop drinking today and this question came up on my feed. Just finished up a 3 day bender for the 3rd weekend in a row. Body feels like absolute crap, brain is quite foggy, anxiety levels are at their peak. Time to hunker down and quit this nonsense.",
   "created_utc": 1691521777,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc7z99",
   "message": "Terrible hangovers, even if I only had 2 or 3 drinks.  It has to be the exact right vodka or the exact right beer for me to not get hungover.  It's not worth it.",
   "created_utc": 1691521845,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc81c3",
   "message": "It no longer made me feel good. Or I realized it never made me feel good.",
   "created_utc": 1691521867,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc849r",
   "message": "Because I ran out, and I don’t drive if I’m drinking, so I didn’t go get more.  Went to bed instead.",
   "created_utc": 1691521897,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc84m7",
   "message": "Right now, cause my throat hurts and shouldn't drink beer and ain't really in a situation where heavier stuff would make sense.",
   "created_utc": 1691521901,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc88kr",
   "message": "Had to go to bed, too early to start drinking today",
   "created_utc": 1691521942,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8exw",
   "message": "I turned 40 this year. \n\nWe took the weekend off for my birthday and over the course of the weekend I drank 4 bottles of wine. \n\nMy body blew up like a balloon. Face, feet, hands, legs. It took me weeks to get it off. My body just couldn't handle it. Now even if I have just one beer or a single cocktail my feet swell. I've gone to the Dr and had my liver kidneys heart an lungs all checked out, and except for a existing lung thing that's totally unrelated, all is well. So I just avoid alcohol now.",
   "created_utc": 1691522007,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8foy",
   "message": "nobody likes a quitter",
   "created_utc": 1691522015,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8hb5",
   "message": "To be a better dad. The kids started to associate me with beer, and that opened my eyes that I had a problem.\n\nI'm such a better dad when I don't drink. Way more present in their lives, and tons more patience and enthusiasm when I'm not hungover and tired.",
   "created_utc": 1691522031,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8hq1",
   "message": "It was time to go to bed. I may start again after dinner tonight",
   "created_utc": 1691522035,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8i1p",
   "message": "Adult Onset Allergies. Not to alcohol itself but something in a lot of them.  I wasn't much of drinker anymore at that point anyways so I just gave it up.",
   "created_utc": 1691522038,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8pm4",
   "message": "No longer wanted to deal with the side effects.",
   "created_utc": 1691522114,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8qim",
   "message": "It caused me more problems than was worth.",
   "created_utc": 1691522123,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc8u39",
   "message": "All my favorite memories were had when sober.  All my worst memories were not",
   "created_utc": 1691522159,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc951h",
   "message": "Because I had to go to work this morning.",
   "created_utc": 1691522270,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc95xm",
   "message": "Because I realized that my thoughts around drinking were getting increasingly unhealthy. \nLike yearning for a glass of wine at 2 in the afternoon. Not feeling satisfied after having a couple of drinks. \nI also didn't feel buzzed that fast anymore and needed more alcohol to feel the same effect as before.\nThen those new alcohol guidelines came out, and I realized I drank waaaay too much, not getting myself any healthier.\nThen lastly, I had some blood work done, and my liver enzymes were a tad high. \n\nAll these things made me seize drinking. I didn't tell myself I'd stop forever, nor that I was not allowed a drink at all, I just wanted to ease off and see how far it would get me.  \nIt felt a bit weird at first, but getting easier as time progressed. \nI'll have the occasional glass of wine or a beer, maybe once every couple of months, when there's a special occasion, but that's about it. \nI've lost weight and I feel way better",
   "created_utc": 1691522279,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc98g5",
   "message": "To give up other things that I couldn’t do while being impaired.",
   "created_utc": 1691522305,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc99fm",
   "message": "I took my first sip, saw how disgusting it tasted, and never started drinking.",
   "created_utc": 1691522315,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc99ql",
   "message": "Because I was trying to lose weight. After losing weight I had a baby, now it's too expensive...",
   "created_utc": 1691522318,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9ak6",
   "message": "Because it’s addicting and it will kill you.",
   "created_utc": 1691522326,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9bfw",
   "message": "Did it for a challenge and realized after a few months, i don’t need it or miss it, do still drink on rare occasions 1-2 drinks maximum per outing. Realized my health is my personal responsibility and a priority.",
   "created_utc": 1691522335,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9ia2",
   "message": "I’m still working on it",
   "created_utc": 1691522403,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9j89",
   "message": "Needed some respite to clear my mind and reset my habits around it.  Never intended on it being more than a short break, but here I am sober as a clam 11 years later.",
   "created_utc": 1691522412,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9ot5",
   "message": "My last GF is pretty much why. Being around when she was drinking, which was any time she wasn't at work, was a crapshoot as to whether you got fun-loving M or tantrum-throwing angry M. It was bad enough that it changed my own behavior and pushed me back into bad, self-isolationist habits that I fought hard to overcome. I blame myself for that somewhat, since I should have recognized what was happening and stood up for myself, but it didn't happen in a vacuum. Now, I just don't want to be anywhere near drinking. Brings back some pretty shitty memories.",
   "created_utc": 1691522469,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9sdy",
   "message": "I didn't stop!",
   "created_utc": 1691522503,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9t8h",
   "message": "I’m hoping Starfield will help",
   "created_utc": 1691522512,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9uvf",
   "message": "The hangover. I drank a lot in my 20s, I'm in my 30s now.\n\nI'd rather have a single drink or a couple beers of a nicer quality and barely get buzzed than slam 18 Natty's, chug some fireball, get obnoxious and then feel like sand-stuffed roadkill for 12 hours.\n\nI so like cheap beer, but not getting drunk on it. 2-3 Yeunglings with spicy food is great but I almost never want to be drunk",
   "created_utc": 1691522528,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9uyr",
   "message": "I ran out",
   "created_utc": 1691522529,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9xq5",
   "message": "I got fat, and it was becoming a problem. You have to drink about to gain 20 lbs in a 2 month period. Already down 10 just from cutting alcohol and dieting better. Pretty much sedimentary lifestyle rn tho. Waiting for school to start",
   "created_utc": 1691522557,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvc9xt5",
   "message": "Because I'm trying to conceive",
   "created_utc": 1691522558,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvca2v1",
   "message": "Cause I'm a little bitch and get that asian glow. \nHonestly,  I'm so happy I'm allergic to alcohol. There's literally no gain for me to drink it. It just feels like my throat is closing up, and my body gets cold and shivers.",
   "created_utc": 1691522608,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvca40m",
   "message": "Cause i got outta control everytime i did drink + i dont have noone left to drink with",
   "created_utc": 1691522620,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvca4ah",
   "message": "Why would I willingly relinquish what little control I have on my life as is?",
   "created_utc": 1691522622,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvca719",
   "message": "My son, whom had just finished his first year in college (2007) - came home for summer. With a week left before he was supposed to return to start his 2nd year, he had a sever car accident that left him comatose and then in a minimally conscious state for the next year. He went to therapy in Houston, and is still to this day severly disabled and living/working through a TBI on a daily basis.\n\nHe was drunk and fell asleep at the wheel, and before his accident I was a pretty heavy drinker. THIS made me quit! \n\nNow, I am not only his father but also his care provider. He lives with me and goes to a caregiver during the week (M-F 8-5) while I work and 8:30-5 gig - and the rest of the time he is with me.\n\nI have not drank since.",
   "created_utc": 1691522650,
   "score": 1,
   "submission_id": "15loysb"
  },
  {
   "comment_id": "jvcj1x1",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15loysb"
  }
 ]
}