{
 "submission_id": "15m06hm",
 "title": "What would you do if you saw someone you knew starring in porn?",
 "selftext": "",
 "created_utc": 1691542537,
 "permalink": "/r/AskReddit/comments/15m06hm/what_would_you_do_if_you_saw_someone_you_knew/",
 "score": 119,
 "url": "https://www.reddit.com/r/AskReddit/comments/15m06hm/what_would_you_do_if_you_saw_someone_you_knew/",
 "comments": [
  {
   "comment_id": "jvdwb0w",
   "message": "Watch it, regret it, pretend I didn't, and finally act weird every time I see them.",
   "created_utc": 1691545734,
   "score": 146,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdrssp",
   "message": "*sips coffee* \"so, how's the work?\"",
   "created_utc": 1691543751,
   "score": 173,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdvmn0",
   "message": "Family member: keep secret and never think about it again.\n\nFriend: subscribe and never think about it again.",
   "created_utc": 1691545437,
   "score": 19,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdp7ec",
   "message": "Finish",
   "created_utc": 1691542616,
   "score": 133,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdpm44",
   "message": "It depends on whether or not it’s a family member or really close friend vs. an acquaintance. In the first instance, I would turn it off and never tell them I saw it. If it’s just an acquaintance, I would probably watch. At least some. Might tell them later, if it’s memorable.",
   "created_utc": 1691542792,
   "score": 72,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvds9d7",
   "message": "Ask a lot of fucking questions.",
   "created_utc": 1691543951,
   "score": 228,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdwx5q",
   "message": "The pandemic lead to a uprising amount of people i know creating an onlyfans page... Let's be honest... Would you pay $5 to see an attractive girl (or guy) you know naked? In my opinion, it was $25 well spent.",
   "created_utc": 1691545995,
   "score": 4,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdw8hq",
   "message": "I grew up with Lena Paul.  She probably doesn't care if anyone who knew her as a kid knows at this point.",
   "created_utc": 1691545704,
   "score": 90,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdy89j",
   "message": "I saw my ex in one and it was... weird af. Mostly was a mixture of arousal and jealousy lol",
   "created_utc": 1691546563,
   "score": 83,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdvve0",
   "message": "Keep minding my own business.  I highly recommend it.",
   "created_utc": 1691545545,
   "score": 39,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdv2ye",
   "message": "If that person is male, I’m not even going to watch it. If that person is female, watch it and then just live my life minding my own business.",
   "created_utc": 1691545199,
   "score": 129,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdp6ii",
   "message": "*unzips*",
   "created_utc": 1691542606,
   "score": 137,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdv2ud",
   "message": "Rub one out in their honor.",
   "created_utc": 1691545197,
   "score": 83,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdtb9v",
   "message": "That all depends on whether I'd imagined what her Cecily Bumtrinket looked like before or not. If yes, I'm absomatically flappin to that shibz.",
   "created_utc": 1691544413,
   "score": 157,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve8owp",
   "message": "I can answer this question from the other side - I (male) have done porn, and here's how some people who have found out have reacted to it.\n\nI had a group of friends find out, talk about it behind my back, and then decide to exclude me from the group. This didn't sit right with one guy, who let me know what was going on.\n\nAt my former job, one coworker found out and quietly let me know. He said he was cool with it. Another guy found out, but this guy was in a position of authority, and he used it to block me from any sort of advancement. Apparently he was a hardcore Christian and finding out made him hate me. A different coworker, probably someone I don't know, reported me to HR and I was eventually fired.\n\nSome women I was seeing casually found out. One kept it secret but tried to drop hints that she knew that I never picked up on. Another sent me screenshots every time she found me in her own personal porn viewings, and said she got a kick out of knowing she was fucking a porn actor.\n\nOne woman that I was seeing seriously got so mad that she emailed my mother with screenshots. My mother, of course, wasn't thrilled, but said - I don't like it, but what's done is done, just don't do it again.",
   "created_utc": 1691551398,
   "score": 23,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve4ze3",
   "message": "Not porn but I ran into one of my sister's high school friends at a strip club once when I was in college (they were in college then too).  She was the stripper...  Made for a fairly interesting evening with the guys.  \"Holy shit you're... wait I won't use your name.\"  \"Yeah, please call me \u0026lt;insert stripper name here\u0026gt;.  I'll come chat when my set is done.\"  \n\nHad a lot of fun that night just hanging out.  That was about 20 years ago.  She has a solid career, married, has kids, etc.  So for her the \"I'm just paying my way through college\" was totally legit.\n\nWhat made it even funnier was that my sister called me before I called her the next day.  \"I hear you ran into \u0026lt;insert real name here\u0026gt; at the strip club last night.\"  \"I saw her, I did not run into her.\"",
   "created_utc": 1691549606,
   "score": 36,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve4lok",
   "message": "Learn to stop rifling through the shoeboxes in my parents closet",
   "created_utc": 1691549430,
   "score": 15,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdtqvo",
   "message": "Crank it to the max",
   "created_utc": 1691544608,
   "score": 48,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve6vr7",
   "message": "“ Hey dude, I saw you on TV! “  \n” Where? “  \n” PornHub “",
   "created_utc": 1691550517,
   "score": 12,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdrxvg",
   "message": "If you mean see them in passing IRL, then I'd act the same. It's just a job, I just now know what they look like naked.\n\nIf you mean seeing them in the actual porn scene itself, well, I've always been a fan of the arts.",
   "created_utc": 1691543812,
   "score": 48,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve4ba7",
   "message": "I have seen several people I know in various types of porn. For the ones on OF, I've subscribed to a lot of them, mostly anonymously, and never said a word about it. For one friend,  she told me about it, I asked if it was cool if I subscribed, and all she asked was that I never get weird about it. We frequently discussed it in a very straightforward manner, just talking about how it was doing, and she would ask me to critique her content and offer suggestions. \n\nI also had a classmate that did some gay porn, and word got around, so everyone was showing it to each other, but not many people had anything bad to say. Personally, someone at a party showed me a clip, I shrugged it off, and I said \"Hey, good for him, man. None of us have ever gotten to work in porn.\" I was glad everyone was cool about it for the most part. \n\nAt the end of the day, as long as no one is being harmed, it's not a big deal.",
   "created_utc": 1691549296,
   "score": 53,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve8pxh",
   "message": "I actually know multiple ppl who did porn. For me it's a bit more arrousing to watch them as you know them.",
   "created_utc": 1691551412,
   "score": 9,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvduzqp",
   "message": "Nothing. Let them just do their thing without giving them any grief.",
   "created_utc": 1691545159,
   "score": 18,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve2uxx",
   "message": "Continue masturbating",
   "created_utc": 1691548623,
   "score": 24,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdp5w3",
   "message": "be surprised, laugh it off, and move on",
   "created_utc": 1691542598,
   "score": 12,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdy38u",
   "message": "Laugh at them for getting stuck in the sink or washing machine. Idiots.",
   "created_utc": 1691546503,
   "score": 6,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jveeosr",
   "message": "Disgusting. I'd turn it off as soon as I orgasm",
   "created_utc": 1691554524,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve2tw7",
   "message": "Obviously I would spontaneously combust. Kidding. No, why would I do anything or care? That's none of my business. They make thousands of porn movies every day, someone I know is bound to be in one of them.",
   "created_utc": 1691548609,
   "score": 11,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdzjme",
   "message": "Mind my business. Who am I to judge how people pay their bills?",
   "created_utc": 1691547136,
   "score": 31,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdv7rx",
   "message": "Serious answer: I'd ask them about it just to be sure that it wasn't uploaded without their consent.",
   "created_utc": 1691545258,
   "score": 46,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdw5jw",
   "message": "Tell them check out mine next",
   "created_utc": 1691545668,
   "score": 21,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdu6if",
   "message": "Ask them out.\n\nIf be seen them naked.  Ice is broken at that point.",
   "created_utc": 1691544802,
   "score": 17,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdx5k1",
   "message": "I am friends with a porn actress.  We had a convo about it and she shares when new scenes come out.  She enjoys it, I enjoy it so who cares?",
   "created_utc": 1691546096,
   "score": 3,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdx5lt",
   "message": "“Hey, wanna film a new porno with me?”",
   "created_utc": 1691546097,
   "score": 3,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve1mwl",
   "message": "someone who was dating a guy in my friend group was in a porno. my best friend and I saw about a minute of it (she was fucking some old dude) and we never spoke of it to her. it’s not like she didn’t know it existed and we figured everyone either already knew and didn’t talk about it, or they didn’t know and we didn’t need to tell them lol.",
   "created_utc": 1691548073,
   "score": 4,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve8pi8",
   "message": "I've actually seen a few people I know.   I think it's pretty cool.  I feel like I know someone famous.  What they're doing ain't hurting my feelings at all.  Enjoy life!",
   "created_utc": 1691551407,
   "score": 4,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve8umu",
   "message": "Exactly what I did when I found out about my oldest sister (RIP). Nothing. It didn't really change anything.",
   "created_utc": 1691551479,
   "score": 4,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jveaae4",
   "message": "Sooo fun fact… I went to high school with someone who is now in porn. I haven’t heard from him in a great while. I have watched countless hours of porn to see if I could find him. I asked but he didn’t want to say.",
   "created_utc": 1691552202,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jveatu5",
   "message": "I have a few friends in the industry. They're cool as heck! I love them!\nGotta support your friends and tell them \"great job giving/taking that big ol D!\"",
   "created_utc": 1691552478,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jveb5jc",
   "message": "Jack off to it",
   "created_utc": 1691552646,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvee7mt",
   "message": "If it was a friend, show them some support with my wallet.\n\nIf it was a family member, show them some support with my wallet.",
   "created_utc": 1691554264,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvefdqp",
   "message": "Bust.",
   "created_utc": 1691554906,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvduqd0",
   "message": "If the question is asking\n\n“What would I do if I were to find out one of my friends was pursuing a career in porn?”\n\nMy answer would be absolutely nothing. I don’t change how I am with my friends depending on what career they’re in. If they brought it up to me to talk about I’d be more than happy to go into it with them.\n\nHowever If they never said anything. I wouldn’t either. Just seems like an unnecessary thing to bring up.",
   "created_utc": 1691545044,
   "score": 9,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdxuq3",
   "message": "Oh my god I did, my cousin. *Problem* is it took me a very long time to realize it. At first I was like, *man she looks familiar* (keep in mind, I hadn't seen her in about 10 years). And I start to kinda, NGL, I start to kinda start diggin her vibe. Then she opens up her mouth, and okay dick goes it in. And then out of it. Then in it again. Then probably 3 or 4 more reps, but then, out of her mouth comes the words... Shit I can't remember what she said but it wasn't what she said, it was how she said it. It was my cousin. I recognized her voice. And NGL, *maybe* at some point I imagined what that voice might sound like if she said dirty, porn script style non-sense, imaged it on accident. But because of that, I was programmed to recognize it. So yeah, I was like, \"my god, female_cousin_my_age\". But I couldn't be sure because dick went back in that mouth, then out. Then in again. Then about 5 more times. Then she said something else and I was sure it was her but I figured I should wait for another round just to be absolutely sure I shouldn't cut this shor.",
   "created_utc": 1691546399,
   "score": 14,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdqlco",
   "message": "Ask for a picture?",
   "created_utc": 1691543218,
   "score": 3,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdwr5f",
   "message": "I've had this happen with a coworker. \n\nObese woman with a very big butt, like she had the T-Rex pose type of booty. \n\nWas looking up porn, saw a video *listing* of her taking a BBC, had no desire to watch it, and thankfully said site no longer exists, well it might but I can't remember the name, it was one of the popular ones. \n\nI pretended it never happened.",
   "created_utc": 1691545924,
   "score": 3,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdzju2",
   "message": "What's weird is a girl I used to date back in the day, did porn a few years after we broke up. After a friend of mine showing me her video and asking if that was (insert name), I now have confirmation that I am NOT packing the heat I thought I was ;)",
   "created_utc": 1691547138,
   "score": 3,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve7bel",
   "message": "Congratulate them on their new career and wish them all the success in the world.",
   "created_utc": 1691550727,
   "score": 3,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve8zik",
   "message": "If it was Steve, I’d stop watching. I don’t need to see his balls.\n\nIf it was Lindsey, I’d bookmark it.",
   "created_utc": 1691551547,
   "score": 3,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jveax2o",
   "message": "At the end of the day I just want them safe. As long as they're happy doing what they're doing I'm ok with it. But if they don't feel safe or are unhappy then it's an issue.",
   "created_utc": 1691552524,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvecwv1",
   "message": "Tell them that:\n\n1. I know;\n2. I respect their decision and wish them well;\n3. I won't watch unless they want me to;\n4. I won't tell anyone;\n5. I'm always here to talk whenever they want.\n\nI don't think there's much else more I can do.",
   "created_utc": 1691553569,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvee7pl",
   "message": "If you see someone you know in porn, no you didn't.",
   "created_utc": 1691554265,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jveeibm",
   "message": "Call my husband over and watch it together 😂",
   "created_utc": 1691554426,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jveemfi",
   "message": "Heuughh",
   "created_utc": 1691554490,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvefdbq",
   "message": "If it’s someone I like, politely tell them that I found it and that they should probably change some things on their profile so nobody else who knows them can find it.\n\nIf it’s someone I don’t like, probably blackmail. \n\n*for legal reasons this is a joke, I’m not an asshole like that*",
   "created_utc": 1691554900,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvefiq4",
   "message": "Fap",
   "created_utc": 1691554983,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdp4nq",
   "message": "show my friends and say....hey, check it out...I know them.",
   "created_utc": 1691542583,
   "score": 7,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve2jqm",
   "message": "Mind my damn business 😅",
   "created_utc": 1691548482,
   "score": 2,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve2psc",
   "message": "Mind my own business",
   "created_utc": 1691548558,
   "score": 2,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve3y0e",
   "message": "I heard that a young lady that I met through one of my kids was in a bad financial spot and started a fansOnly account.  I let her know what I had heard in casual conversation, discretely.  She was cautious to confirm at first.  She was concerned about me having a lowered opinion of her, and at the same time that I might be a creeper.  I told that my interest was nothing like that, but that I wanted to see my kids friends, and my friends , succeed.  In my previous career I was a pro photographer, and my current career required me to be rather adept with computers regarding hardware, software, and user configurations.  I told her that if she needed any  assistance to just ask.  Hey initial reaction was \" Okaaaayyyy...so you just wanna see me while I'm naked working?\"  I told her that I'd really rather not see her naked, that would make things awkward, but if she had some technical issues with the website interface, the camera or lighting or whatever, I'd be happy to help with pre-production, then GTFO.\n\nShe was like \" well, yeah sometimes my audience complains about not being able to see and glare and stuff...\" , so that led to a conversation about camera angles, lighting, using a video monitor, etc.  We ended up have a couple such conversations over the next couple weeks.  She asked me to come up to her studio (used to be the spare room at her house) to help her fix a lighting issue she was having.  I initially agreed, but deferred because, well, people talk.  I knew I wouldn't be up to anything, and was quite confident that she wouldn't be, either,  but , as a rule, people can be jerks if you give them the opportunity.    \n\n\nShe suggested my kid (her friend) come over , too.  She asked my kid, I verified that it was OK with my wife, and we went over and figured it out.-  I've been up there to help a couple times since then, and occasionally get calls from her to discuss opinions of new equipment.  Over time as business has picked up for her, we've upgraded her video, lighting, computer, audio and control systems. She's been doing it as her main source of income for over a year and a half, now.  She's moved to a better house, and is in her 2nd semester of school.  She's a good friend of the family, and I couldn't be happier for her.  I know what her screen name is, but have never seen her 'dressed for work', as it were.",
   "created_utc": 1691549125,
   "score": 2,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jve6vv1",
   "message": "Hit the sack then go to bed",
   "created_utc": 1691550518,
   "score": 2,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvebeop",
   "message": "Happened with 3 different people...one was a weird kid who went to a porn convention to try to connect with people and become a male porn star...he found out its way more lucrative to do gay porn. The 2nd was a teacher at my high school then years later I ended up in the same emt class as me...and the 3rd was one of my clients older sisters who started doing only fans and now does porn",
   "created_utc": 1691552779,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvefvre",
   "message": "I'd ask her if she needed help acting out a scene",
   "created_utc": 1691555190,
   "score": 1,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdtgze",
   "message": "Ask do they wanna make content together 😂",
   "created_utc": 1691544483,
   "score": 7,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdrabt",
   "message": "Depends who it is",
   "created_utc": 1691543524,
   "score": 6,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvdvib7",
   "message": "\"Hey Stacy, Saw ya on TV. That's the exact thing i was gonna do to you!\"",
   "created_utc": 1691545385,
   "score": 4,
   "submission_id": "15m06hm"
  },
  {
   "comment_id": "jvedr9g",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15m06hm"
  }
 ]
}