{
 "submission_id": "15m0dck",
 "title": "People who ever did hardcore drugs, why did you start?",
 "selftext": "",
 "created_utc": 1691543016,
 "permalink": "/r/AskReddit/comments/15m0dck/people_who_ever_did_hardcore_drugs_why_did_you/",
 "score": 207,
 "url": "https://www.reddit.com/r/AskReddit/comments/15m0dck/people_who_ever_did_hardcore_drugs_why_did_you/",
 "comments": [
  {
   "comment_id": "jvdvmxx",
   "message": "Saw a friend shoot up some h and they looked so sublimely blissful. I didn't know what they were feeling, but i needed to feel *that*. They gave me some and the second it hit my veins, i knew a warmth and comfort i never thought possible. \n\nNext morning, i needed to feel it again, so i pawned my vinyls and dvds.\n\nAnd we were off to the races from there.",
   "created_utc": 1691545441,
   "score": 223,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdrhc4",
   "message": "Started meth to stay awake for work, doing construction. Worked pretty well...until it didn't. And then I didn't. Work that is. But I kept up with the meth. Then one day in the early 2000's, after having hidden from my own car in a bush behind the mall for 6 hours, I decided to give it up.\n\nSo far, so good.",
   "created_utc": 1691543609,
   "score": 38,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdqhtv",
   "message": "Wanted to try everything life had to offer. Tried them all once except coke… I’ll never turn down a bump but haven’t bought any in years",
   "created_utc": 1691543176,
   "score": 72,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdtcri",
   "message": "Hanging around with older kids who were doing it. Seemed cool. Was cool until it wasn’t.",
   "created_utc": 1691544431,
   "score": 37,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdrjps",
   "message": "Meth for eight months. That was six years ago,  but constantly being paranoid, not eating, seeing the carpet move, seeing shadow people, and always being horny all just sucks.",
   "created_utc": 1691543639,
   "score": 53,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdwstt",
   "message": "It made awesome experiences more awesome, but then I started doing it to make boring experiences more awesome and it went downhill.",
   "created_utc": 1691545944,
   "score": 22,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve0u0d",
   "message": "When I was 19 my girlfriend at the time casually busted out meth and a pipe during a burn cruise. She was in really good shape and my immediate thought was \"she wouldn't do it if it was so bad\". Anyway I did it after that for about 3 years and burned every bridge in my life doing so. 0/10 experience. I never used intravenous so as of now there's no distinguishing marks or anything on me. Have all my original teeth. No ticks or spasms. Honestly nobody would know if I didn't tell them.",
   "created_utc": 1691547709,
   "score": 24,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdw4be",
   "message": "Drunk partying with the wrong kind of people and was offered coke . Absolutely loved it lol minus the horrible depression comedowns ! I always had bad social anxiety and coke made me feel like I could talk to anyone and become the President if i wanted too 🤣 This was over 20 years ago though.  Never would i mess with drugs now with all the fetanyl overdoses. We never worried about that or even knew what fetanyl was !",
   "created_utc": 1691545653,
   "score": 19,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdrz9h",
   "message": "#I bought one marijuana in highschool, now I'm getting tittyfuvked behind the Home Depot for down (heroin)",
   "created_utc": 1691543829,
   "score": 107,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdvkj1",
   "message": "I'm just browsing through this sub, but this is a good question. I tried my drug of choice because it was offered to me by someone I love. I kept doing it because my life was terrible in every sense, but the drugs made me feel like I was ok. \nI'm 4, almost 5 years sober now. I still remember what it felt like.",
   "created_utc": 1691545411,
   "score": 16,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdvav0",
   "message": "Warhammer figurines, the most expensive, soul-crushing addiction known to man",
   "created_utc": 1691545296,
   "score": 64,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdx3m8",
   "message": "Was told my whole life that drugs were horrible, but then I went to college and started to smoke weed. My life didn't fall apart and I liked it.\n\nThen some of my friends who were all smart and \"doing well\" in life overall started trying other substances, which at first I was very against, but became more curious when I saw these interesting people having these experiences that seemed compelling. Tried cocaine, MDMA, mushrooms, and benzos all in one weekend and had the time of my life up until that point. I had never felt so free, nor so close to my friends who were doing these substances with me.\n\nA few months later, texted someone I knew looking to get coke or benzos, but was offered heroin instead. Debated this for a bit, but up until this point I'd had zero negative experiences and said fuck it. Tried heroin, was completely underwhelmed, and once again no negative impact. So I kept trying it for the rest of that summer, never having any issues, and I came to believe I was smarter than it and that I had no risk of addiction.\n\nWell, that didn't last forever. I had about 3-4 stints of heroin usage, the first few lasting a few months at a time. The last one went on for almost 2 years before I finally quit and haven't went back and that was quite a few years ago now.\n\nTLDR: Started trying drugs as my friends got into them, had no negative effects, kept pushing my luck and thought I was smarter than addiction and that I was lied to about how drugs work, ended up really liking heroin.",
   "created_utc": 1691546072,
   "score": 13,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdvox0",
   "message": "Like cocaine, lsd, and shrooms?  because it seemed like fun, and it was.",
   "created_utc": 1691545465,
   "score": 27,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdqhfi",
   "message": "The promise by a close friend that they would instantly make me feel great. After a life of feeling anxious and uncomfortable i was willing to give that crap a try. \n\nIt worked for a bit then there came the consequences which made my original problems worse x10! Fun",
   "created_utc": 1691543172,
   "score": 9,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdwwmh",
   "message": "because I was rich but also a lunatic",
   "created_utc": 1691545988,
   "score": 9,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdrne9",
   "message": "Wanted to look “cool”in front of the “cool kids” and boredom.",
   "created_utc": 1691543685,
   "score": 8,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve0b3w",
   "message": "Started with snorting addys. Moved to coke then to crack by the time I was a senior in hs. Battled off and on, then catch a meth habit during covid. Everything got turned upside down. Got clean then started back up on some other shit. It’s a losing battle and I hate my brain because of it. \n\nDon’t do deugs people. Seriously it will ruin your life",
   "created_utc": 1691547477,
   "score": 6,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdxaym",
   "message": "Curiosity. Then I got bored and quit.",
   "created_utc": 1691546162,
   "score": 6,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve2ck4",
   "message": "I thought it made me cool to self destruct and secretly hoped someone would come save me. \n\n\nI saved myself though and realized that I was being an idiot.",
   "created_utc": 1691548394,
   "score": 5,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdxw7r",
   "message": "Post traumatic stress, childhood abuse and trauma.",
   "created_utc": 1691546416,
   "score": 5,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve1i7u",
   "message": "I just smoked weed for almost 15 years(daily/habitually, yet didn’t consider it a problem) I also have a ridiculous problem in getting kidney stones throughout the years(I’ve had over 30 stones throughout the years. If anyone has every had one pain medication is a God send in these scenarios. However, It is not a god send when my body decided I needed more. Eventually I started doing pain pills more often. Then one fateful day I was offered heroin as a cheaper alternative, that one time was all it took and my life was changed forever…every aspect of my life has essentially crumbled. Told myself I was smart enough to not make it a problem. After all “I went to college for psychology and studied the ends and outs of addiction so nothing bad will happen to me. It’s been years now and I’m still fighting this nightmare daily…Still attempting to pick up the pieces…been to rehab 3 times, lived in 2 halfway houses. Stayed sober for about a year and a half, but 7-8 months ago I relapsed again and I’m living everyday back in my own personal hell. Sometimes it honestly feels I’ll never get my life back",
   "created_utc": 1691548013,
   "score": 5,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdv4ev",
   "message": "Took LSD once, spent several hours staring at my skull face in front of a mirror. 9/10 would recommend again sans mirrors.",
   "created_utc": 1691545216,
   "score": 14,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdv05h",
   "message": "Who needs coffee when you can hide in a bush behind the mall? Kudos for giving it up, stay strong!",
   "created_utc": 1691545165,
   "score": 9,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdqrw2",
   "message": "some crazy shit happened in my early teen years, old buddy of mine handed me a Vicodin, and it all went downhill from there lol",
   "created_utc": 1691543297,
   "score": 4,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdy6o1",
   "message": "To get laid. Which was almost a given, as we were rolling on ecstasy.",
   "created_utc": 1691546544,
   "score": 5,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdzkky",
   "message": "Started with just taking a Vicodin to get a little bit of motivation and calming at work. Or just the rainy evening, reading a book. It spiraled to snorting Roxicodone mixed with coke and got progressively worse over a few years. Sadly, I was super productive at my job at the time and eventually became head project manager of construction layout for new projects. I even bought into the company to own 10%. Eventually, I quit drugs, but my life took a huge dive even though I was 100 percent sober . About a year into sober life, a psychiatrist recommended adderall….which did help me in some ways, but within a couple years I was abusing that as well. Then I quit that stuff….was depressed for a very long time. Eventually learned about RC benzos that truly helped my anxiety….well way too much because I almost died several times over. Again, I dumped that habit and here I am. Sometimes, I wish I had gone to rehab at some point to learn better coping skills.  Im taking it day by day. My life is pretty good considering all the garbage I’ve put my mind through. To anyone in deep drug addiction, always know you have the power to change , you just have to take control and move on.\n\nEdit mainly started as a mood enhancer. Also made me more social and all of a sudden I seemed to be receiving much more attention from attractive women. Drugs helped in that regard, but they eventually cause much mental and physical pain. It definitely wasn’t worth it",
   "created_utc": 1691547148,
   "score": 3,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve4f0h",
   "message": "I used to party a lot. Addiction runs in my family, I have a lot of mental illnesses and I'm extremely impulsive to the point of danger, so when I was at a bar in NYC, a friend of mine offered me coke and it just spiraled down from there. Heroin ended up being my downfall. I'm 8 months off of everything except for weed and cigarettes now.",
   "created_utc": 1691549346,
   "score": 5,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve4k66",
   "message": "My little brother was killed and I started using because I couldn't cope.\n\nEdit: been sober several years now and still miss my brother every day.",
   "created_utc": 1691549411,
   "score": 4,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve72jk",
   "message": "It happened slowly enough not to notice until it was too late. Started in high school. \n\ncaffeine -\u0026gt; Alcohol -\u0026gt; Tobacco -\u0026gt; weed -\u0026gt; painkillers -\u0026gt; benzos -\u0026gt; prescription stimulants -\u0026gt; hallucinogenics -\u0026gt; MDMA -\u0026gt; cocaine\n\n3+ years sober now 😁",
   "created_utc": 1691550608,
   "score": 4,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdqhxm",
   "message": "A mixture of boredom, angst, and stupidity",
   "created_utc": 1691543177,
   "score": 8,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdtpb3",
   "message": "Depends on what you mean by hardcore, but I was bored, I was not in a good headspace, I had money to burn, and I was hanging with people who had it readily available and it was a fun ride while it lasted.",
   "created_utc": 1691544588,
   "score": 3,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdxkuo",
   "message": "Combination of curiosity and recklessness I guess. I was a bit of a thrill/novelty seeker when I was younger. I wanted to try everything in every category from experiences to travel to food to life philosophies to people to altered forms of consciousness. So in my 20s I dabbled in many drugs, some in an unhealthy manner. I actually smoked crack and meth only once  respectively and never again, mainly from morbid curiosity. Probably not a lot of people can say that lol. Honestly it wasn’t the best experience, don’t recommend.",
   "created_utc": 1691546279,
   "score": 3,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdz1u1",
   "message": "Hanging out with the crackhead neighbors, got a little tipsy one night while feeling down, made some bad decisions.  Just dabbled before it got too crazy, but the crazy happened real fast.",
   "created_utc": 1691546918,
   "score": 3,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve2uxc",
   "message": "Years prior, I had decided to kill myself at a certain age. That time was fast approaching. So, I just wanted to get fucked up until I took myself out. I did not care about the repercussions.",
   "created_utc": 1691548623,
   "score": 3,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve4fvn",
   "message": "I started with acid for fun and XOs for energy, and continued with XOs to stay awake for my graveyard shift (one job) and then for my following morning shift (second job) because I was supporting a lazy husband and all of his buddies hanging out in my house. I ended up on the meth train because XOs weren’t doing it for me anymore. I’d stay awake for days working both shifts back to back then going home and cleaning house/cutting grass/doing Suzy homemaker shit while he slept all day. Then I finally had an off day which was rare and he was gone doing God knows all day. I looked in the mirror and didn’t recognize myself and decided I couldn’t live like that anymore. I flushed my ice, shattered my paraphernalia, and told him to move out of my house and that I’d have him served with papers. Best decision I’ve ever made.",
   "created_utc": 1691549357,
   "score": 3,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvebqnb",
   "message": "I was a really shy kid and drinking and doing drugs help me to fit in with the cool kids and be more outgoing. Long story short, I am over nine years sober.  Drugs took me down to some very dark places, especially meth.",
   "created_utc": 1691552952,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdt2t7",
   "message": "I have older siblings who introduced me to alcohol and weed. My (soon-to-be ex) husband introduced me to harder drugs. I’ve been sober for two years (I mostly was a fan of weed, pills, wine, and the occasional line).",
   "created_utc": 1691544308,
   "score": 2,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdx88j",
   "message": "I was taking pain killers after having several dental surgeries. I got addicted and withdrawal’s are the worst thing I’ve ever felt. My body then became tolerant and needed something stronger.",
   "created_utc": 1691546129,
   "score": 2,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdxwzr",
   "message": "I started out of curiosity. I continued because opiates are remarkably good at alleviating emotional pain.",
   "created_utc": 1691546426,
   "score": 2,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdy4vv",
   "message": "Peer Pressure, but I'mmm fine now sept for the studddering.",
   "created_utc": 1691546523,
   "score": 2,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdy7te",
   "message": "I was a dumb, angry and depressed teenager",
   "created_utc": 1691546558,
   "score": 2,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdzgi7",
   "message": "It was the only way to feel good at the time",
   "created_utc": 1691547096,
   "score": 2,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve4517",
   "message": "I was in physical pain constantly due to injuries. Then started to realize they'd help me stay awake to study longer. Not sustainable.",
   "created_utc": 1691549216,
   "score": 2,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve8zo3",
   "message": "Psychotic depression, was 26.",
   "created_utc": 1691551550,
   "score": 2,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve9rot",
   "message": "I had always kinda romanticized drugs, especially heroin. When I was 18 I got out of a 3 year relationship and I started using oxy and Xanax to cope with that. Then I stopped doing that and moved in with some friends. I had a friend that I did a bunch of Xanax and occasionally shot heroin with, and I kept hanging out with her. One day she said “if you ever want to get high, let me know”. I said yes and she taught me to shoot up and it was downhill from there. At the time I convinced myself that it wouldn’t be that hard to quit. I was very wrong. I did quit but it was very hard.",
   "created_utc": 1691551941,
   "score": 2,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvea9m7",
   "message": "I dabbled with with weed from age 12 but when I hit 17 and took ecstasy it was like heaven, I could talk to girls I was dancing I couldn't get enough. That summer I just ploughed through MDMA and pills until I had a drug induced manic episode\n\nI sold and toomtook psychedelics, ketamine, hella lotta cociane, Valium, DMT, Speed the works. Just got lost in the lifestyle. Never made much selling drugs but I always had money. \n\nAfter taking psyches very frequently about 4 years ago in short spaces finally got diagnosed bipolar after my most severe manic episode\n\nI'm basically clean now the only drugs I miss are ket and shrooms/acid which I can't take due to the meds I'm on. \n\nI was pretty intelligent in school until I started smoking weed I wonder what my life would be like if I stayed away from drugs, would the bipolar have layed dormant? \n\nSigh, I will never know I'm 27 know unemployed with no job experience or skills, deeeply depressed and suicidal having about 1 pretty bad manic episode a year requirring hospitalization. \n\nYou hear stories like this and you always hear like a redemption arc but I just don't see it happening, think I took too much\n\nAnyway, drugs are bad kids M'Kay",
   "created_utc": 1691552190,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdv3i5",
   "message": "It started with alcohol it made me more social. Then pain pills after I tore my ACL they made me a confident mfer, then cocaine and meth they made me out work everyone, then the pain pills weren't working like they used to and I started using heroin and meth together. 1 month and some change later I'm sober working a program and glad to be alive after heroin overdose.",
   "created_utc": 1691545205,
   "score": 3,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdxn02",
   "message": "My dad gave me beer, weed, and cigarettes when I was young, and got me hooked on cocaine, pills, and PCP when I was a teenager. It wasn't until my late 20's when I got sober after getting myself a DUI did I realize the damage he did to me and my life. I love him to death and for what it's worth he tried to do right but damn did he fail on a lot of things. He still tries to get me to drink when I see him even though he knows I'm trying to stay sober.",
   "created_utc": 1691546305,
   "score": 3,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvduju5",
   "message": "Something that people who've never done drugs don't really seem to get, understandably, is that drugs are fun. Dangerous when used in excess, and some of them dangerous by nature, but by default and when used in moderation most of them are also fun.\n\nAnecdotally, I'm 32, I still do hard drugs now and again, I'm getting summa cum laude grades in college and I'm in the best shape of my life physically.",
   "created_utc": 1691544966,
   "score": 7,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdzyu6",
   "message": "I was around a lot of rockstart types as a teenager, so naturally there were a lot of drugs around me. Ignoring the non hard drugs which I did years earlier, I started with speed and coke every once in a while at parties, and eventually did just about everything that people know the name of. Never did heroin or any strong opiate though, I knew enough to stay the fuck away from that. I did it just because it was fun, and it made a party or hanging out with friends more amazing than it already was. \n\nWhen people around me started going downhill, the fun stopped so I stopped. I look back and realize how lucky I am to be able to say that, as for most of the people I knew it was much harder for them.",
   "created_utc": 1691547324,
   "score": 2,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve3upq",
   "message": "I used to like eating percs. I didn't realize they were essentially synthetic heroin when I started. Eventually, you graduate to the scag. Dopesick is an awful feeling, but the hardest part of quitting is the continued sleepless nights paired with the joyless days, but if you stick with it, things return to normal, eventually.",
   "created_utc": 1691549082,
   "score": 2,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdwf43",
   "message": "Curiosity. Thankfully it was fun but not worth ruining my life over. \nPeople who do them regularly and make it their life can suck it.",
   "created_utc": 1691545782,
   "score": 2,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve3o7n",
   "message": "Is coke hardcore? It's pretty fun until you realize it's not.",
   "created_utc": 1691548998,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdt63a",
   "message": "I wanted to look kewl",
   "created_utc": 1691544349,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdsjpo",
   "message": "I was looking for a way to ease the pain in my Cecily Bumtrinket after my ex SA'd me and my roommate's crack pipe was just *right there, daring me to smoke it*",
   "created_utc": 1691544076,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdv2j7",
   "message": "To deal with trauma and chronic pain",
   "created_utc": 1691545194,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdvyeh",
   "message": "depression and anxiety mainly, but they're also fun lol",
   "created_utc": 1691545583,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdzik0",
   "message": "because i have lived by a set of rules since i was a kid and one is to never write something off unless i have tried it. so i have tried almost every drug at least once in my life and cannot be told \"you don't know about it\" because i am likely to. it does become a double-edged rule sometimes but overall i have been happy with the results of my life laws list (3L).",
   "created_utc": 1691547122,
   "score": 0,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdx34i",
   "message": "They said they worked for ungrateful Indian-Hindu’s in America from India.",
   "created_utc": 1691546066,
   "score": 255,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdqhff",
   "message": "I wouldn’t say hardcore, not heroin or meth or shit like that. But because of the friendship group I was in.",
   "created_utc": 1691543172,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdt6g3",
   "message": "bc the high off weed wasn’t doing the trick",
   "created_utc": 1691544354,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvduhij",
   "message": "Wanted to try them and see how it was , never got addicted and had fun as a teen / early 20s . \n\nNot suggestion kids do drugs but I don’t regret trying them and seeing what the fuss was about.",
   "created_utc": 1691544938,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdxn7h",
   "message": "Boredom, curiosity, thrillseeking\n\nHaving tried them all funnily enough the 2 legal ones got me in the most trouble (alcohol and nicotine)",
   "created_utc": 1691546307,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdxqe6",
   "message": "I never did hardcore drugs before. I tried cocaine two or three times a looong time ago and I didn't really like it.",
   "created_utc": 1691546346,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdydsj",
   "message": "Because I heard they get you fucked up\n\nAnd…….. they do!",
   "created_utc": 1691546631,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdzl04",
   "message": "My dad got me into it",
   "created_utc": 1691547153,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvdzv0x",
   "message": "Wanted to know why my gf was spending all her money on them.",
   "created_utc": 1691547278,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve0ryb",
   "message": "https://youtu.be/0vBpcSEdcRc",
   "created_utc": 1691547684,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve0v9n",
   "message": "Girlfriend had a toothache. Got her some hydros and a couple extra for myself. 5 years later was a full-blown heroin addiction.",
   "created_utc": 1691547724,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve2f1v",
   "message": "Trauma and working in the hospitality industry as a young adult.",
   "created_utc": 1691548425,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve2kqy",
   "message": "Trying to self medicate undiagnosed mental illness i guess, drugs made me feel good when i otherwise didnt.",
   "created_utc": 1691548494,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve2ont",
   "message": "In my place of business, our bathrooms  now have codes due to drug addicts.\n\nWhy do druggies think they can use, shower and change in there? No idea, but we have 0 tolerance.",
   "created_utc": 1691548543,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve2xie",
   "message": "Was making a lot of money for no reason so I started dabbling with some sweet Peruvian booger sugar",
   "created_utc": 1691548655,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve3jyl",
   "message": "Had shoulder surgery in 2005. They put me on hydrocodone for 10 years afterward.",
   "created_utc": 1691548942,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve3lq1",
   "message": "Under the guise of fun but ultimately to escape depression and being miserable",
   "created_utc": 1691548965,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve3szg",
   "message": "I tried ketamine at the end of an MDMA experience and loved the shit out of it, so I moved on to research chemicals. \n\nAnd the rest is history.",
   "created_utc": 1691549059,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve3z6i",
   "message": "I’ve don’t just about everything except some of the newer designer drugs, heroin, meth, and fentanyl.\n\nStarted because may as well try most things at least once and have a good time. Just never became addicted and only did things here and there for a bit of fun. Cocaine is my favorite party drug and opiates are good whenever. Had a lot of fun with acid and nbombs. Been years since I’ve done anything other than shrooms and alcohol though. If I found a hook up for coke (everyone I knew who had it either moved or ended up in prison) I’d definitely grab a ball for a weekend a couple times a year.",
   "created_utc": 1691549140,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve4i5n",
   "message": "Waking up to go to work every day made me want to kill myself, would’ve done anything to escape the feeling of being indentured to a workplace",
   "created_utc": 1691549386,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve4if3",
   "message": "I kind of eased my way up. In hs i loved drinking bc I wasn't supposed to and soon after the first time i realized I loved the feeling it gave me. I was anti drug but almost all of my friends did something. I saw them doing drugs, having a blast and seemingly with no consequences and my curiosity led me to try Cocain and weed. Cobain was amazing and I liked weed too. As I watched friends do all types of drugs and slowly continued to try new things I fucking loved everything I tried and none of the horror stories I had been told all my life ever happened.  Years later I was still able to take opiates and benzos as well as coke, lsd, Molly, ketamine, shrooms, mescaline, and I could go on all night, on the weekends recreational and still be great at my job monday thru Friday. It seemed like everything my parents, teachers and the government said about drugs were flat out lies and lots of them really were. This made me think if they lie about this what else am I missing out on?? Doing a drug Friday night turned into doing everything I could get my hands on all weekend and honestly I think it made life better. 5 years in I was constantly on multiple substances and felt like it reakky made life better, hard times less hard...10 years later a Lyme disease misdiagnoses had me on a regular schedule of opiates and anxiety and otsd had me taking every benzoyl there is at some point regularly. I mean my doctor prescribed it, insurance paid foe it. How could it go wrong. This is where I got in trouble. I realized I could not function wo those drugs and would do anything to make sure I had them at all times. First time I didn't u was so sick I couldn't function which taught me to never let that happen again and it snowballed from there. I needed as much of everything I could get my hands on as I could get. Few years later if I didn't have my opiates, benzos and some lsd, coke and maybe some Molly or k on the side I was absolutely bedridden. Miserably sick and even if I low dosed myself enough to not be physically sick I was seriously psychologically addicted also. I managed to get my shit together some what and I'm a normal working functioning adult but I almost always am doing a small amount of something. I just love the escape. The worry free feeling it gives me. I was lucky I made it out ok. It wasn't easy. It snuck up on me and I hadn't a clue what I was turning into. I still love to get high recreational but I will never allow Myself to be dependent on a substance to surprise. It was miserable my whole life centered around getting my fix. Every minute of every day. I'm so glad I realized that and was able to check myself. It was the hardest shit I have ever done.",
   "created_utc": 1691549389,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve5frp",
   "message": "Define hard-core drugs.",
   "created_utc": 1691549822,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve5nuq",
   "message": "Define hardcore",
   "created_utc": 1691549931,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve67dy",
   "message": "Some friends I used to hang with always did meth. A few even injected it. I used to snort it on weekends for about a year when I was around 18-19. Thankfully I never became addicted and eventually stopped the meth and dumped those friends.",
   "created_utc": 1691550193,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve6d0r",
   "message": "Same reason most men get into hard drugs. I met up with a girl I knew from hs that did it. I've been clean for almost 2 years now and never going back",
   "created_utc": 1691550269,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve7c5j",
   "message": "I just broke up with my GF at the time (early 20's). I was heartbroken and messed up, so I started hanging out with some pretty fucked up people that I met randomly. One day my friend started a 2-week vacation and told me: \"I'm gonna try every drug I can during the next two weeks. Wanna join me?\". So I did. I tried almost everything except for crack, meth, heroin and opium. I ended up falling in love with MDMA. I took some every weekend for almost three years afterwards. Then I kinda just snapped out of it and stopped everything at once, even weed. I wanted to get my shit together. \n\nNowadays I just drink alcohol, with the occasional cocain once in a while.",
   "created_utc": 1691550737,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve7g1x",
   "message": "Seemed like a good idea at the time.",
   "created_utc": 1691550790,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve8dvz",
   "message": "everyone around me was doing it every party i went to and I wanted to see what all the hype was about, tried it once and understood immediately, was hooked lol. sober now on account of being pregnant",
   "created_utc": 1691551247,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve8t0p",
   "message": "What quantifies a \"hardcore\" drug? Addiction has never suited me, so I stay away from anything that forms a strong habit, no rocks, no horsey powder, no opioids and very minimal drinking, mostly because drinking just ain't for me. I stick to my smoke, MDMA, hallucinogens and the occasional bit of coke. Why do I do it? Because it's fun.",
   "created_utc": 1691551456,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve95pq",
   "message": "Had alcoholic parents. In my mind to this day at 21 years old,  I still view what an adult does is their free time as consume a substance of some sorts. But I thought I started just because I enjoy experiencing these altered states of consciousness and then they consumed me. \n\nFor a long time I didn't touch alcohol, and I never viewed myself as an addict because I never experienced withdrawals. Sounds cool, but in reality I just didn't become physically addicted to any one drug, but mentally these drugs were my life, doing a different mix of drugs everyday.\n\nFirst I was smoking weed everyday then I would so acid every weekend which evolved to dropping 3 tabs every weekend with a half g of mdma over the night. To doing coke on the weekend and sniffing \"oxy\" during the week. To then doing both of them multiple days throughout the weeks and when I ran out I would drop Molly before going into work, or even use some benzedrex just to scratch that itch, and then doing massive doses of dxm the next day to calm the benzedrex hangover.\n\nHowever I went to rehab and am 9 months clean from all drugs but weed and I drink 2-3 times a week, a little more than I'd like, but still a hell of a lot better than I was doing",
   "created_utc": 1691551632,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve980a",
   "message": "Someone shot up in my car once and passed tf out. I thought he died for a brief minute. I’ve always been curious but my brothers rule is “if it doesn’t grow in the ground, leave it alone.” Alcohol is plenty for me. Never fucked w anything hard, curious tho",
   "created_utc": 1691551665,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve9a87",
   "message": "A buddy of mine bought some cocaine and I wanted to try it to see how it was. I didn't make it a regular habit though. It's too expensive.",
   "created_utc": 1691551696,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve9elq",
   "message": "I thought he was a friend but he gave me some laced shit which caused an overdose.",
   "created_utc": 1691551758,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jve9h6x",
   "message": "Curiosity",
   "created_utc": 1691551794,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jveb0vp",
   "message": "I was curious and was wondering why everyone did it? lol I know that sounds stupid, but there is another reason behind it that I'm not gonna get into.\n\nSo, I tried meth one time and I got hooked. My curiosity was instantly sated. I'm clean now however for about two years? At most. Doing good now.",
   "created_utc": 1691552579,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jveb83x",
   "message": "I started drinking daily due to depression, went to rehab, met people, got out and started doing meth through them",
   "created_utc": 1691552683,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvebc5k",
   "message": "Despite growing up being told drugs are dangerous and bad, curiosity always got the best of me.",
   "created_utc": 1691552742,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvecwfe",
   "message": "The reason most people start. That reason is to hide/kill the pain..",
   "created_utc": 1691553562,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvedpn6",
   "message": "Because of trauma, psychological issues, coping, escapism, self-destruction. So much better to just be away from reality.\n\nAll that good stuff. Spent years screwing around in the \"justice system\". Thankfully I have an uncle who was able to invest in me and get me all of the help that I needed. He's the real MVP.",
   "created_utc": 1691553996,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvedx2t",
   "message": "Because drugs are awesome",
   "created_utc": 1691554107,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvee6g6",
   "message": "I tried shrooms a couple of times, but they had no effect. Totally disappointed.",
   "created_utc": 1691554246,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvee820",
   "message": "Why not ?",
   "created_utc": 1691554271,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jveef9f",
   "message": "I was a stupid kid.  And almost killed myself.",
   "created_utc": 1691554380,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvefeji",
   "message": "I assume to you mean to exclude hallucinogens.  They are quite healing and mind opening when used correctly.  History will show this to be true in 100 years or so.",
   "created_utc": 1691554918,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvefkb8",
   "message": "Your question seems to be making an assumption that people who do hardcore drugs got addicted. The huge majority of people who do drugs, any drug, just do it occasionally.\n\nYou might enjoy [this](https://www.nytimes.com/2021/04/10/nyregion/Carl-Hart-drugs.html)article about a Columbia prof who enjoys herion sometimes.",
   "created_utc": 1691555008,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvefmc7",
   "message": "To numb the pain",
   "created_utc": 1691555041,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jvefzpr",
   "message": "Tried pot and thought it wasn't as dangerous as school made it out to be. The guy who sold it started dealing bigger thing. Simple logic would say if they were lying about how bad weed was, everything else couldn't be that bad.\n\nI'll never forget my high school councilor when I got caught.\n\n\"Drugs are good. If they weren't, people wouldn't do them. They're so good, people throw their entire life away just to do them.\" \n\nThat one still lingers with me.",
   "created_utc": 1691555254,
   "score": 1,
   "submission_id": "15m0dck"
  },
  {
   "comment_id": "jveg5b4",
   "message": "There's a time and place for everything, and that would be college",
   "created_utc": 1691555345,
   "score": 1,
   "submission_id": "15m0dck"
  }
 ]
}