{
 "submission_id": "15m1wn2",
 "title": "What was the reason you ended your last job?",
 "selftext": "",
 "created_utc": 1691547124,
 "permalink": "/r/AskReddit/comments/15m1wn2/what_was_the_reason_you_ended_your_last_job/",
 "score": 141,
 "url": "https://www.reddit.com/r/AskReddit/comments/15m1wn2/what_was_the_reason_you_ended_your_last_job/",
 "comments": [
  {
   "comment_id": "jve0dn1",
   "message": "A micromanaging boss who always had to be right.",
   "created_utc": 1691547509,
   "score": 174,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve0hwi",
   "message": "I told a regular customer who always acts like an idiot exactly what I thought of him. Unfortunately it turns out he is an investor in that business. I was sick of that job anyway. Just got a higher paid one closer to my house. I actually saw him today. As soon as he saw me he scuttled off to drink somewhere else.",
   "created_utc": 1691547562,
   "score": 88,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve5h6d",
   "message": "I asked for a raise when I realized my job was about 5 positions in 1. When my boss tried to get my raise approved, she was denied. She told the big bosses that I would walk if this wasn't approved and they literally said \"oh well.\"\n\nI got my dream job the following week.",
   "created_utc": 1691549841,
   "score": 162,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve29om",
   "message": "Hostile work environment",
   "created_utc": 1691548358,
   "score": 50,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve0ced",
   "message": "Prolonged stay in hospital.",
   "created_utc": 1691547493,
   "score": 40,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve0jma",
   "message": "Absolute disrespect, and a much better paying job",
   "created_utc": 1691547582,
   "score": 38,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve4aos",
   "message": "I had a mental breakdown. Drank a fifth of vodka. Almost killed myself. Just never went back to work after that.",
   "created_utc": 1691549289,
   "score": 39,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve5gnl",
   "message": "The company didn’t offer bereavement days. I called off to go to my fathers funeral and my manager told me it was inconvenient for them to have to cover my shift because they were short staffed and that I needed to come to work. I told them I wasn’t missing my fathers funeral for their measly $11 an hour. They fired me the next day.",
   "created_utc": 1691549834,
   "score": 29,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8dce",
   "message": "Started a job as security for a gate at a nuclear power plant, enjoyed it, was working 40 hours a week. Showed up every day, didn't complain. Then they fire 3 people for no reason and make me start working 80 hours a week mandatory. I was making tons of money but was struggling to find time to buy groceries since I worked until late at night. Boss starts micromanaging every little thing while I'm working 16 hr days. Then they wanted me to start training people, said I'd get a 2 dollar an hour raise for doing it, that never happened. Then I had some car issues and I couldn't come in one day. I had to go to Autozone and buy a replacement part. I got the problem solved and was good to go the next day. I never missed a day in six months. My boss called every car shop in town (allegedly), and said that I was lying. I bring the part that I replaced in to show her. She says that's not enough proof and that no one in town said they sold me that part. She wrote me up and then said I might be fired or I might not, and I'll know at the end of the week. I said okay and she asked me if I was coming in tomorrow morning and I said sure. Next day I slept in and never showed up, apparently they're were trucks backed all the way up the road for 4 hours since I didn't show up to open the gate. Boss texts me saying I'll be criminally charged for not showing, I just ignored it so she called me everyday for about a week. I never answered. Found out later that she went on a power trip and fired the people I trained because I \"taught them wrong\" then replaced them with her relatives. This is the person guarding your energy infrastructure America!",
   "created_utc": 1691551239,
   "score": 28,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jveau30",
   "message": "I was teaching high school social studies. Had a difficult heart episode (had previous heart attack) and my friends at school who visited every day in the ICU, convinced me it was time to retire. That was 4 years ago. They were right. I love being retired.",
   "created_utc": 1691552482,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve3826",
   "message": "Was head chef at a busy pub / music venue.  Had been there 3 years, the previous year of which was under a new owner.  It was her first time owning a business and she was eager but not quite cut out for it.  She and I were good friends so it was a happy job even if I was having to pick up the pieces for her a lot.  \n\nShe decided to sell the place but hadn't found buyers yet.  But once she made the decision she went wild trying to cut costs everywhere to get out with as much money as she could have.  So she slashed my menu to pieces.  All the work I'd put in creating unique dishes that people loved was gone in a day, replaced with the most basic pub fare.  I thought she'd totally lost the plot and resigned when she told me she was certain about the changes.  \n\nShe sold the place a month later and when I got that news it suddenly made sense.  It was still a dick move but at least it had a flavor of logic to it and wasn't just complete disrespect for me with no rationale.  \n\nShe and I have talked and hung out since then so we're back to being friends.  And ultimately leaving that job made me realize just how much stress I was under there.  I took a nice easy job where I don't have to manage anything and I'm way happier for it.",
   "created_utc": 1691548790,
   "score": 20,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve3a02",
   "message": "I didn’t like making men happy . And as a stripper you kinda have to 😂",
   "created_utc": 1691548814,
   "score": 19,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jveal9q",
   "message": "Change in management. First day on the job, new manager said \"what is it that you do all day, because nothing ever seems to get done\"\n\nShould have taken the 6 weeks of holidays that I was owed that day but didn't.\n\nWithin a year of my finally leaving, I was replaced by 4 people",
   "created_utc": 1691552356,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve0gbk",
   "message": "Place shut down. Pretty good severance pay though",
   "created_utc": 1691547543,
   "score": 15,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve01ya",
   "message": "Laid off",
   "created_utc": 1691547363,
   "score": 14,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8qhu",
   "message": "The other esthetician constantly left the room, products, brushes, etc absolutely disgusting. All brushes and products should be sanitized and wiped down after every single client. She would also come in blasted off of whatever pills she decided to take that day. Police followed her once. Boss wouldn’t fire her bc she didn’t want to get audited again by the IRS since she committed tax fraud during Covid. Not losing my license over a trashcan of a spa and incompetence",
   "created_utc": 1691551420,
   "score": 14,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve43kw",
   "message": "Retired after 37 years",
   "created_utc": 1691549197,
   "score": 12,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jvea4nd",
   "message": "My last employer, of 32 years, had shrunk from 3,000 employees to \\~200.  I'd earned above average reviews for many years, then my boss gave me a below average one.  That was the writing on the wall for me.  Things were getting worse and worse, shitty attitudes all around.  I just got fed up, gave my two weeks notice.  I'd told them for years that they'd miss me when I was gone.  Well, I left, they started calling, asking me to come back.  Sorry!  I'm retired.",
   "created_utc": 1691552122,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jveavam",
   "message": "Was being scheduled literally 13 hours a week. Most days I’d come in at 930 and leave at 11. Brought up to my service manager multiple times “ hey you only gave me one shift this week. Can’t afford daycare with only one shift” he’d say he forgot and sometimes give me a pity shift. Went to the GM she did nothing. I was tired of doing them the favor of coming in to open (cause they didn’t want to) and then not being given any serving shifts in return",
   "created_utc": 1691552499,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve2ges",
   "message": "Really toxic workplace, but the last straw was when I had to miss a day and work over the weekend/night because my dad was having surgery… and my manager accused me of lying. He pulled in HR as a power play as well. He was absolutely delusional because he was new to the position and things were already a shitshow. I ended up having an anxiety attack because I just couldn’t believe what was happening, on top of my parents’ health issues, so I got short term disability pay for a few months and then quit after lol",
   "created_utc": 1691548442,
   "score": 9,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jveaubv",
   "message": "I took early retirement to get away from the micromanagement/ bullying that was endemic throughout the company from the top down. \nI now work part-time for a lot less money, but somewhere where I'm appreciated  and looked after.\nMy mental and physical health has improved beyond measure.",
   "created_utc": 1691552485,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jvdzyzq",
   "message": "Found a better job more inline with my experience and preferences.",
   "created_utc": 1691547326,
   "score": 9,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve49db",
   "message": "I quit for several reasons: micromanaging and condescending supervisor, the workload was too much with unrealistic deadlines and so much brain fatigue and stress trying to multi task and work fast, low pay for the type of job it was and the expensive city I live in, increasing work load with no additional pay, catty colleagues.",
   "created_utc": 1691549272,
   "score": 9,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jveapav",
   "message": "Blew my back and neck out. I was a Rural Letter Carrier ( country mailman).",
   "created_utc": 1691552413,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve40hc",
   "message": "They wanted me to send all my private information through Gmail. Just in a regular email. No security measures, no contract for pay, nothing. So I started doubting if they were real. Go out to the place where they were located. Owner yells at me and starts cussing me out. I said fuck this and walked out. They were super shocked.",
   "created_utc": 1691549157,
   "score": 13,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve09qs",
   "message": "[deleted]",
   "created_utc": 1691547460,
   "score": 6,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve3qb6",
   "message": "I left my last job as a Tech PM after 13 months because the owners (let's call them L \u0026amp; J) consistently treated their employees as fodder through manipulation, overworking, blatant disregard for mental health, and baseless threats. \n\nI had a development manager from Egypt (I'll call him Y) who had a mental crisis (which the team informed me Egyptians are not allowed to have or discuss in their country), and he was hospitalized (we refer to it as institutionalized here). He was a good person who should have never been pushed to that point (and I didn't know it was occurring until he was gone). \n\nL \u0026amp; J, knowing that Y tried to commit suicide because he felt like he'd let people down with his work -- a sentiment that L \u0026amp; J kept assaulting him and his team with -- continued to abuse the rest of the developers the same way and they all were adversely affected, like Y.\n\nI managed the dev team on the company projects, and we had an extremely tight bond. I reinforced daily that each dev mattered, especially after Y. So, when L \u0026amp; J would lie to the devs that I was going to quit because the devs' \"work was shit\" (and various other threatening tactics), I would receive sporadic, hesitant messages from the devs, questioning my loyalty to them. \n\nThere were so many Slacks and calls with devs in order to check on their mental health, support them, and refute bullshit attacks against the team and me. The devs were burnt out, depressed, and wholly alienated at the end of my time there. So was I, but I was very frank with the devs that this was not an environment they deserved. I don't support group-think, and I know that my statements were unprofessional as a manager, but the devs were more important.\n\nI lambasted L \u0026amp; J with a diatribe over how they don't follow their own company edicts surrounding integrity and \"building relationships that last\", and was blown off (\"Thank you for your well-written email\"). \n\nUltimately, I left because I had no influence over the Machiavellian owners' bullshit or protecting the developers. This was just one wretched reason among many, but it was the most damaging, and I couldn't be complicit in their abuse by staying. \n\nL \u0026amp; J told the team that I quit because of the developers (and my failing health...?). The dev team (save 3) quit after I left.  \n\nY was released a couple of months ago from his hospitalization.",
   "created_utc": 1691549025,
   "score": 6,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve5kyg",
   "message": "Boss reduced employee salaries 30%, all but his wife and kid, who also worked for the company. That was after taking his extended family on a 12 day vacation.",
   "created_utc": 1691549891,
   "score": 6,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve5lwy",
   "message": "Boss wanted to open a fine dining restaurant and paid me more money.",
   "created_utc": 1691549904,
   "score": 5,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve36o9",
   "message": "40 hour job turned into a mandatory OT 60 hours. Also, every other department got Veterans day off and paid for except for the one fucking veteran in the company. Just a shit company on so many levels.\n\nThough we had a Dept. head it seemed he wasn't really in charge. Random family members of the owner would come a give conflicting directions and priorities and would cause massive amounts of problems. Just simply a poor run company.",
   "created_utc": 1691548772,
   "score": 11,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve2oip",
   "message": "I got laid off by the recent tech bubble. I had an office on the 28th floor in an Amazon corporate building right next to the Spheres in Seattle. I'll miss that office.",
   "created_utc": 1691548541,
   "score": 15,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve3mk4",
   "message": "I’m worth more than what they would pay. Shrug.",
   "created_utc": 1691548976,
   "score": 6,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve3sa1",
   "message": "FTC rule changes collapsed revenue. 3 monthly meetings where finance presented 30% decline. My coworker, now wife, and I were the first ones to jump ship. The company shuttered 6 months later.",
   "created_utc": 1691549050,
   "score": 5,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jveacfc",
   "message": "I got seriously ill from surgical complications and 2 months into my medical leave, when I was still in the middle of very involved and costly treatment, the company yanked my health insurance out from under me. I had to quit so I could qualify for Medicaid because I HAVE to have health insurance. \n\nI am very sad about it because I loved the job and fought to keep it but yeah...they didn't give a single fuck.",
   "created_utc": 1691552230,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve49go",
   "message": "Felt there was too much I was accountable for that I had no control over...decided to give early retirement a test drive at the end of last year.",
   "created_utc": 1691549273,
   "score": 5,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve4x7f",
   "message": "Drama. Loved that job too. \n\nBut in the end. I was no longer welcomed in the friend group because a woman destroyed my reputation, butting into a situation that was none of her business. \n\nI wish I did things differently. But in the end, I learned a lot from that situation.",
   "created_utc": 1691549578,
   "score": 4,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve6xsm",
   "message": "I worked a second job as a dishwasher for a mom and pop shop. Unfortunately, business became slow during the fall and early winter. The week before the holiday, the owner emailed us saying that the business would close down at the end of January 2023. They weren’t make enough money that’s why we closed down. I was pretty sad because I gotten along with everyone including the owner and his wife. Everyone was very friendly. The owners would always tell me how much they appreciate and how much I’m a hard worker. I would get tips as well. Unlike my full time job where the chef nitpicks me over the smallest shit and gives everyone a slap on the wrist for calling out or showing up late.",
   "created_utc": 1691550544,
   "score": 4,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jveans7",
   "message": "I was unappreciated. My boss would only seem to critique us. Never any appreciation. He'd leave for a weekend vacation and come back complaining about something we didn't do. While we were spending the entire weekend doing something he asked to make sure was done, and still helped customers, and one of the days was on the higher end for sales. I also worked there for three years and never got a raise. He also asked me to take on more responsibility, but never told me specifically how to do that.",
   "created_utc": 1691552391,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jvedbgm",
   "message": "My janitorial job was easy enough before and even going into the pandemic, but once they had to fire another dude for refusing to get vaccinated, they gave me a good portion of his job on top of what I already was doing, and didn't seem to feel like replacing him. I was struggling to keep up. \n\nOn top of this, I requested off to visit friends for Christmas and they waited until the last minute to give me a yes or no, making my plane ticket cost a lot more than it needed to. That was kind of my last straw among a bunch of other things. \n\n\u0026amp;#x200B;\n\nI should add that I had to fight for the right to quarantine during the time when we didn't have a vaccination ready, and people in close contact with covid positive people like myself were being given an automatic recommendation to take a week or so of (I forget the exact number). Their stance was if I'm not personally testing positive, I would be fired for not showing up. no exceptions. I was just trying to be safe, for myself and others. \n\nI had to get the state involved to even get them to allow it. \n\nIn addition to that, my boss had a history of lying, framing people to make them look like they were doing worse than they were, I could name a bunch of others that quit for the same reason. I didn't want to quit, parts of my job was almost too easy, but she crossed the line a few too many times with me to stay.",
   "created_utc": 1691553785,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve70g5",
   "message": "HVAC installer here.  I quit my last job because our scheduler decided she didn't like me so when I'd message her to get the address of my next job, she wouldn't respond.  I had to call another office staffer to ask if she was In (she was) and asked to be transferred.  She picked up, and hung up immediately.  I called staffer again, asked to be transferred,  again, she hung up.  Again.\n\nThis was a Friday.  I went home, cleaned the work van of my tools, dropped the van off at the office, keys inside, went home and emailed the boss a letter explaining WHY I was quitting, where the van was, and that he could mail me my final cheque.\n\nHe called me Saturday morning asking what it would take to get me back.  I told him he'd have to fire the scheduler. (His wife), he said he could never do that.  I told him I already knew that and had a job lined up for Monday morning.  \n\nIn between getting home and returning the work van, I sent my resume out to five different HVAC companies.  In the three hours it took to clean out and return the van, I had five offers.",
   "created_utc": 1691550581,
   "score": 7,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve3ehb",
   "message": "My assistant manager stopped talking to me for 2 months. \n\nThere was a whole host of things wrong but that was the last straw.",
   "created_utc": 1691548873,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve3xj7",
   "message": "Location was too far",
   "created_utc": 1691549119,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve51rh",
   "message": "One of my \"superiors\" was bullying me and she had been promoted to an even higher position so I left.",
   "created_utc": 1691549636,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve6btu",
   "message": "Laid off during Covid, got a pretty good severance.  Oh, that and I asked to be laid off.  Anyway, now I’m retired.",
   "created_utc": 1691550253,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7a98",
   "message": "Multiple surgeries. Permanent disability now.",
   "created_utc": 1691550712,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7bfl",
   "message": "Chronic illness gave me no choice. I had become unable to do the detail work needed with any kind of reliable pace. I loved the job, I just couldn't do it fast enough anymore to be of any use.",
   "created_utc": 1691550728,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7bwq",
   "message": "Had to quit to take care of an aging parent with dementia",
   "created_utc": 1691550734,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7lec",
   "message": "Medical crisis with a family member.",
   "created_utc": 1691550861,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7o78",
   "message": "Had a Zoom meeting in which I was told that my department's work was eventually going to be outsourced to India.  They said \"it could be six months from now, it could be a year, it could be two years,\" and offered me a buy-out if I didn't want to wait, so I jumped.",
   "created_utc": 1691550899,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7tft",
   "message": "Injury forced me to quit. Happened outside of work. Never healed up enough to return.",
   "created_utc": 1691550969,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7vff",
   "message": "The site supervisor asked me to fraudulently sign training documents for an upcoming audit from corporate because nobody knew how to do their job.",
   "created_utc": 1691550996,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve84oj",
   "message": "I was burning myself out and losing my mind when they brought in a new system and what would have taken me 5mins to do on the old system now took me an hour. Department was understaffed and when I asked to get more help they refused. Needless to say, I left and they hired seven people to replace me.",
   "created_utc": 1691551123,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve894q",
   "message": "Use to never understand people when they said “new manager so I left”. Use to think they were overreacting.\n\nLast job I quit because new management. Now I understand what they were saying.",
   "created_utc": 1691551184,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8d9m",
   "message": "I actually really liked (most of) my last job, but I was literally doing the jobs of 3 people and the stress was killing me. It also didn't offer dependent benefits, so when I found a government job with benefits I leapt for it.",
   "created_utc": 1691551238,
   "score": 3,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jvebrpl",
   "message": "Elon Musk decided to lay off 7% of employees in 2019. I was one of them",
   "created_utc": 1691552967,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jved4fz",
   "message": "Work environment was nasty and mostly unkept. Could almost skate on the floor with all the oil...EVERYWHERE!!!",
   "created_utc": 1691553682,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve0776",
   "message": "I wasn’t happy",
   "created_utc": 1691547428,
   "score": 4,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jvdzt5c",
   "message": "My contract",
   "created_utc": 1691547254,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve24ot",
   "message": "Got a permanent position.",
   "created_utc": 1691548297,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve4bvp",
   "message": "Toxic environment,  overworked, underpaid,  poor management and useless HR.",
   "created_utc": 1691549304,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve4p1q",
   "message": "GM blamed me for something that wasn’t my fault, the stress of the situation had me crying in the stock room and I decided enough was enough.",
   "created_utc": 1691549472,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve5aax",
   "message": "I retired!  It was a great job though working for a non profit.",
   "created_utc": 1691549750,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve5ob5",
   "message": "Got my new higher paying job.",
   "created_utc": 1691549937,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve6dfg",
   "message": "Micromanagement and too much distrust....",
   "created_utc": 1691550274,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve6trp",
   "message": "84 hours a week was starting to wear thin on my family. Good money, but that’s not always what’s important.",
   "created_utc": 1691550491,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve6w8w",
   "message": "The ground just kept shifting under my feet. They wanted to keep me and find the perfect fit, but they just kept bouncing me around.  There came up an option of a severance or to be moved. I took the severance and ran. \n\nAbout 8 years of my life wasted there",
   "created_utc": 1691550523,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve6z2n",
   "message": "I had to stand for six hours with only a 15 minute break",
   "created_utc": 1691550562,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7411",
   "message": "got FIRED because my moms had covid and i needed to stay home and watch her, dumbest reason ever fr",
   "created_utc": 1691550627,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve78cq",
   "message": "I wanted to get out of the industry I was in. I wanted something better specifically a better work life balance.",
   "created_utc": 1691550686,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve78s1",
   "message": "No work life balance. Compulsory overtime, shit boss.",
   "created_utc": 1691550692,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7i5v",
   "message": "No hours.  They had me working like not even 4 hours a week🥹 they don't need me at that point🤚",
   "created_utc": 1691550818,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7l44",
   "message": "The head dental assistant had turned into a micromanaging nightmare, causing a LOT of toxic stress and anxiety. Couldn’t take it anymore, gave two weeks notice by surprise and caught the boss and her off guard. Been gone almost a year and I still shake my head why did I stay so long",
   "created_utc": 1691550857,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7x0u",
   "message": "Laid off after I missed a month of work thanks to long covid.",
   "created_utc": 1691551018,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve81t8",
   "message": "The store manager and I (assistant manager) weren't trained to set seasonal properly, nor put the money end of stuff in the computer the way we were supposed to. \n\nShe'd complain daily. I'd tell her to drag the district manager in and demand the training.  She'd insist she didn't want him in the  store (wtf?) And continue complaining about not knowing how to xyz.\n\nI finally walked out. Left my resignation letter on the desk and my keys in the safe. I couldn't take the negativity any more.\n\nShe's lost most of the original crew for that store AFAIK. And there were only 8 of us total.",
   "created_utc": 1691551083,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve83uu",
   "message": "Got in trouble for wearing white socks so I left and never came back",
   "created_utc": 1691551112,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve89mf",
   "message": "Dying industry, and I couldn't handle the low pay and constant stress of rearranging deck chairs on a sinking ship. Within a year, my position was ultimately eliminated.",
   "created_utc": 1691551190,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8g9a",
   "message": "There is no set schedule. Every week, the schedule would change at least 3 times. And you HAD to work the newest schedule. I had hours from 7 to 13 hours. Turn over shifts, no breaks (legal in that field), no benefits at all.  I could work mornings, afternoons, or nights. \n\nI couldn't have a life, and I was burnt out.",
   "created_utc": 1691551279,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8iic",
   "message": "Dude it was my first job ever as a dishwasher/prep cook and I was only making $10hr bi weekly. A friend referred me to another job that started at $15hr weekly, and I only realized later that where I first worked was pretty not great all around",
   "created_utc": 1691551311,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8iuf",
   "message": "I was cleaning the dishes and the entire sink fell apart and I got no help repairing it",
   "created_utc": 1691551315,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jveffzk",
   "message": "My idiotic manically depressed self decided to quit during an episode",
   "created_utc": 1691554940,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve46eq",
   "message": "It was a long game to fuck a girl who worked there. Once I succeeded I no longer needed that job.",
   "created_utc": 1691549234,
   "score": 5,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve6mf9",
   "message": "Believe it or not, my last job came to an end in the most unexpected way – due to a series of quirky coincidences involving a rogue Roomba and a runaway office chair race.\n\nIt all started innocently enough when I accidentally left the office door open while fetching my morning coffee. Unbeknownst to me, the office Roomba decided it was the perfect time to explore the outside world. But that's not all – my colleague had left their desk chair at an angle, creating an unintentional launchpad.\n\nAs the Roomba ventured into the hallway, it bumped into the chair, setting off a chain reaction that would've made Rube Goldberg proud. The chair shot forward, hitting another chair, which bumped into the water cooler, sending it wobbling precariously. Of course, the water cooler decided to topple at the precise moment the boss walked by, leading to an impromptu indoor waterfall.\n\nThe whole office erupted into a chorus of laughter as the boss stood there, dripping wet and speechless. It was like a scene out of a sitcom. Unfortunately, the boss's drenched suit and the unfortunate timing of the situation didn't exactly bode well for my future at the company. So, with a mixture of chuckles and apologies, my boss and I agreed that it was time for me to move on.\n\nAnd that, my friends, is how a rogue Roomba and a runaway office chair race led to my most unexpected and comical exit from a job. Who knew that everyday office items could team up to create such a memorable finale?",
   "created_utc": 1691550393,
   "score": 6,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve2xrd",
   "message": "The owners wouldn't listen to me and my co-workers and preferred to be cheap-asses. I found a better job under the radar and quit. Just because I felt petty, I logged into the place where we do paperwork and in the notes I pasted a youtube link of a video that started out innocent but then cut to a clip of a snake going into someone's ass. The owners saw it and they were mortified. They never figured out it was me.\n\n It's been 2 years since I last set foot at that job and I don't ever plan on going back.",
   "created_utc": 1691548658,
   "score": 2,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve78xg",
   "message": "Both my office mates were crying at their desks due to stress when I received a message from my boss that I was working too slow and was no longer allowed to wear headphones at my desk. \n\nThat was the last straw, I took a break, ran it by my partner, and submitted my 2 week notice. They told me I could just finish out the day. \n\nNow I run my very own Doggie Daycare and couldn't be happier and less stressed. Don't put up with it, people.",
   "created_utc": 1691550694,
   "score": 4,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve3qkt",
   "message": "I got laid…\n\nAwwwwww yeah!\n\n\n\n\n\n\n\n\n…off\n\n\nOh. Uh…",
   "created_utc": 1691549029,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve3rjy",
   "message": "I was nearly murdered by a psychopath monkey",
   "created_utc": 1691549041,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve78mf",
   "message": "The US dollar dropped below our Canadian Dollar. So I got downsized, and spent the next 10+ years looking for work.",
   "created_utc": 1691550690,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9tdz",
   "message": "Felt disposable, tired and stressed, hated the snobs in charge, was not earning enough, got sick, got an offer I'd be dumb to decline.",
   "created_utc": 1691551966,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve1amo",
   "message": "Forklift: It didn't pay well plus it was pretty dangerous since there are times you would have to raise up your forklift \u0026amp; you would have nothing but a cable attach to you.",
   "created_utc": 1691547915,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve2snf",
   "message": "Too much bullshit, not enough pay. I and a crew of 2 others were doing more work than the opposite shift, which had 7-10 people.",
   "created_utc": 1691548593,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve3urp",
   "message": "Shitty manager prevented me from getting a promotion I’d been working towards for three years.",
   "created_utc": 1691549082,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve5rpv",
   "message": "my industry is on strike so it shut down.",
   "created_utc": 1691549983,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve67v8",
   "message": "New contract, owner was a pos, walked as i wouldn't put money in his pocket",
   "created_utc": 1691550199,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve67yo",
   "message": "I quit because my boss was molested some of my fellow employees",
   "created_utc": 1691550201,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve6bin",
   "message": "I found a much better job",
   "created_utc": 1691550249,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve73g9",
   "message": "it wasn't my choice",
   "created_utc": 1691550619,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7e8y",
   "message": "Left for a much better job.",
   "created_utc": 1691550765,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7g2u",
   "message": "I was over it",
   "created_utc": 1691550790,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7h6j",
   "message": "I realized I don’t like research - also my assistantship ended - good timing!!",
   "created_utc": 1691550804,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7h9f",
   "message": "Jealousy",
   "created_utc": 1691550805,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve7r3l",
   "message": "I refused to work another day at the office.   More specifically, the Pentagon.  I’d rather stand in breadlines all day.",
   "created_utc": 1691550937,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve80c8",
   "message": "Got tired of rotting in a cubicle all day. Overstressed, mental health, working overtime and weekends just to stay afloat (was salary). \n\nCorporate world is not for me.",
   "created_utc": 1691551064,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8255",
   "message": "Covid no hrs",
   "created_utc": 1691551088,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8fpx",
   "message": "New owner, and relocated to different city due to remodeling. Lasted 1-2 hours into one shift at the new location. The unfamiliarity with the environment, and the new owner coming in like a roided out dick, inclined me to up and walk out. Total mental overload. Had no idea where I would work, but thankfully I managed to land a job. Pure spontaneous trust fall.",
   "created_utc": 1691551272,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8jcb",
   "message": "The Chinese government decided they no longer wanted Americans (or any foreigners) teaching their kids English.",
   "created_utc": 1691551321,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8n9a",
   "message": "They wouldn't let me work 4 days a week with benefits. I was working 5 days a week before.",
   "created_utc": 1691551374,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8w4d",
   "message": "I worked in an special ed preschool. We were short staffed and any time we mentioned the dangers we were facing, the principal dismissed it. She even had the nerve to tell us that “everyone’s suffering.” We had 24 children, 16 of them had special needs, and many of them were not potty trained yet, but we only had two adults. I was not being paid enough to deal with that so I left for a better paying job.",
   "created_utc": 1691551500,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8wpa",
   "message": "Worked at an animal shelter and felt that my skill and experience wasn't worth anything to them. I gave them my life for years and am so happy I've moved on.",
   "created_utc": 1691551508,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8wqs",
   "message": "Was overworked, long hours (12+ most days), and honestly wasn't trained that well when getting prepped.\n\nWhen I asked for help or maybe a slight change in path with the gig my boss goes:\n\n\"What a small, little man\" and fired me on the spot.\n\nHollywood sucks. My current job is a billion times better with way better people running things.",
   "created_utc": 1691551509,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve8ybp",
   "message": "Low pay, very little potential for upward mobility, a manager who loved to hear himself talk and thought he was God's gift to the warehouse, and brown nosing coworkers who seemed to agree with him in that respect and got preferential treatment.",
   "created_utc": 1691551530,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve90ae",
   "message": "Moved because the wife thought the landlord was picking on her. 250 units and she thought she was picking on her.",
   "created_utc": 1691551558,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve90id",
   "message": "I worked at walmart....do i need to say more?",
   "created_utc": 1691551561,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve90pm",
   "message": "Moved states, didn't have the time or patience to work full time, do schooling and take care of my dying mother.",
   "created_utc": 1691551564,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve91c2",
   "message": "Im a welder. Im currently laid off, company was in-between jobs hopefully getting called back soon because i liked it there, i liked my forman, and pretty much everyone i worked with.",
   "created_utc": 1691551573,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve91ku",
   "message": "The Ubers were eating up my entire paycheck",
   "created_utc": 1691551576,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve91ws",
   "message": "Worked for a small company that “restructured” and didn’t need me any more. Been searching for jobs and haven’t heard a damn thing, so that sucks.",
   "created_utc": 1691551580,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve921e",
   "message": "So it was a few weeks of contractor work at a steel factory.\n\nIt was alright but the next contract would have involved scraping the inside of blast furnaces, that were still so hot you needed to keep moving in order to avoid your shoes melting. And when i heard that i decided to not continue. \n\nMost of the shit i did was shoveling vaseline, which wasn’t that great but still acceptable.",
   "created_utc": 1691551582,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve95jh",
   "message": "Graduated and started working in my field.",
   "created_utc": 1691551630,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9627",
   "message": "The pandemic. Just as I was trying to find a better job…now I had to start over at some lil customer service job to test my social skills after being on lockdown for a couple years…ugh",
   "created_utc": 1691551637,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve96an",
   "message": "I couldn't talk about suicide for 9 hours a day anymore",
   "created_utc": 1691551641,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve96hz",
   "message": "A bully from school I was forced to work with got a majority of the staff against me.",
   "created_utc": 1691551644,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve97xb",
   "message": "One bad contract to the next.\n\nNot hard work but death by a thousand cuts.\n\nShow up to last contract… “oh by the way here’s the EXTRA DUTIES list.”\n\n“Oh by the way your in this presentation, learn all this, do this.”\n\nPlus a myriad of other stupid shit that seemed dumb for someone my age to be doing.\n\nAfter resigning they said I’m welcome back whenever. \n\nJust a useless decent paying job I hated",
   "created_utc": 1691551664,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve986c",
   "message": "I got an offer making a lot more money.",
   "created_utc": 1691551668,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve98j5",
   "message": "Nearly lost my nose to frostbite after working in -80°C (with windchill). When the day was done I got to go back to camp. They refused to evacuate the work camp in -60°C cold snap when we lost power and with it heat. We had to sleep in -30°C with a thin blanket and whatever clothes we had in the closet. I fell asleep prior to the power outage so I never had the opportunity to put on anything I was fecked. It was -63°C outside the camp the warmest it got was -49°C. No lights, nothing just cold and darkness looked like something out of the Walking Dead. Told the camp manager if it ever happened again I was going to take apart furniture and burn it for warmth",
   "created_utc": 1691551673,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve98v2",
   "message": "HR was incompetent and the pay was awful",
   "created_utc": 1691551677,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve998x",
   "message": "(TROC) My area manager tried to change my shift after I’d already been at work for 2 hours (and drove an hour to get there).\n\nI got there at 6am he called and said I needed to leave and come back to work 10-6. I told him I’m not doing that. Then he decides to cop an attitude and get sassy and say “well you can just go home and not come back” among other things, so I asked him who tf he thought he was talking to like that… needless to say HR and the district manager (who was a terrible person and has since been replaced) called me an hour later. I was glad to be out of there",
   "created_utc": 1691551683,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve99zh",
   "message": "AI drive cameras",
   "created_utc": 1691551693,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve99zy",
   "message": "Shitty retail paycheck",
   "created_utc": 1691551693,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9af1",
   "message": "The boss spend all his money on drugs and couldn’t pay his workers",
   "created_utc": 1691551699,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9bz9",
   "message": "Yellow Trucking went out of business. Yay.",
   "created_utc": 1691551721,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9dee",
   "message": "i had finally killed them all. every name on the list was crossed out so.. job done. after i started a garden and man, you have no idea how good vegetables and fruit is from your own garden \u0026lt;3",
   "created_utc": 1691551740,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9g7r",
   "message": "I was there for just over a year…still waiting to be trained. I sat in a room for 48 hours a week unable to work because “nobody wanted to train “.",
   "created_utc": 1691551780,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9hhc",
   "message": "Can’t stand having a boss/supervisor who is clueless about how to run an organization or department.",
   "created_utc": 1691551798,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9i7j",
   "message": "Internship ended lol",
   "created_utc": 1691551809,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9iyg",
   "message": "Let go without cause officially",
   "created_utc": 1691551819,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9jj0",
   "message": "I had a full mental breakdown before walking through the doors....I worked at Amazon",
   "created_utc": 1691551828,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9l90",
   "message": "Burnout.",
   "created_utc": 1691551851,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9lwz",
   "message": "Needed more money, boss told me I likely wasn’t gonna get it",
   "created_utc": 1691551861,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9mby",
   "message": "Everyone had an opinion, too many chiefs, orientation was all over the place, feed back was completely wrong because the person delivering the information trusted the wrong people, communication from upper management to my manager was literally non-existent …so you can hopefully imagine all the issues I had between getting time off, specifics affecting how the orientation was to proceed, total disregard for the value of each employee no matter what their role was. I was a truly enthusiastic employee and by the end I just felt crushed.",
   "created_utc": 1691551867,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9otd",
   "message": "Terminated after being scheduled to do jobs I wasn’t trained to do",
   "created_utc": 1691551901,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9q0b",
   "message": "Project migrated to another technology, so they had no need in me. But I saw that this coming, so I already had a place where I could move on.",
   "created_utc": 1691551917,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9qri",
   "message": "Complete chaos in the IT department. \n\nThe company had a super tight budget and everyone from bottom to top was stressed out because not enough personnel was hired to meet the goals of the C-Suite. Basically you get paid below market to do the work of 4 employees. And this wasn’t a startup, it was a company that has been in business for decades.\n\nEnded up finding a role that paid double for less work. Bottom line: if you are overworked and underpaid, look for a new job asap. It can potentially take a long time but it’s always worth it.",
   "created_utc": 1691551928,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9r8z",
   "message": "I was told I didn’t have a long term spot if I didn’t become a beekeeper.",
   "created_utc": 1691551935,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9s1m",
   "message": "They sell snake oil to little old ladies and I couldn’t do it any more. I thought about all those grandmothers being taken advantage of and I felt so dirty. I up and left in the middle of a shift.",
   "created_utc": 1691551946,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jve9s1x",
   "message": "25-30% travel for $35k. Too much responsibility for not enough money.\n\nI turned down a job several years back that was traveling 4 days a week, 50 weeks a year for $45k, both domestic and international. Not so much as \"turned it down\" but I actually laughter at the interviewer when she said that. I told her for that travel my minimum salary would be $85k. She sounded genuinely shocked.",
   "created_utc": 1691551946,
   "score": 1,
   "submission_id": "15m1wn2"
  },
  {
   "comment_id": "jveakpx",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15m1wn2"
  }
 ]
}