{
 "submission_id": "15m684w",
 "title": "When people are too pushy and demand an explanation for why I decline alcohol, what can I say which is not inflammatory, sets boundaries, and isn't likely to offend? I simply don't want to give a reason, but I do want to appear reasonable?",
 "selftext": "",
 "created_utc": 1691559798,
 "permalink": "/r/AskReddit/comments/15m684w/when_people_are_too_pushy_and_demand_an/",
 "score": 122,
 "url": "https://www.reddit.com/r/AskReddit/comments/15m684w/when_people_are_too_pushy_and_demand_an/",
 "comments": [
  {
   "comment_id": "jveolwn",
   "message": "Just say you don’t drink. And if someone’s pressuring you to, that’s a big red flag.",
   "created_utc": 1691560751,
   "score": 76,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvendg5",
   "message": "Just say no. Anyone socially pressuring someone to try to drink alcohol when they don’t want too is someone you probably shouldn’t hang around",
   "created_utc": 1691559902,
   "score": 60,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvenuri",
   "message": "“I never acquired a taste for it.”\n\nThen it’s not about alcoholism or being a teetotaler, you just don’t like the flavor.",
   "created_utc": 1691560229,
   "score": 26,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveng87",
   "message": "just tell them alcohol makes you too horny and say you're refusing for their sake",
   "created_utc": 1691559955,
   "score": 15,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvephgo",
   "message": "If you’re looking for a magic bullet turn of phrase, you’ll probably not find it. \n\nPeople that do drink (if they’re not being assholes) are at least curious about those that don’t so at the very least you might get some minor pushback. \n\nUsually if you get pushback, don’t add new information or let the conversation continue. Here’s an example if someone offers you a drink. \n\nExample:\n\nThem: can I get you a drink?\n(Or they could say “why aren’t you drinking”)\n\nYou: no thanks, not my thing, I never acquired the taste for it. \n\nThem: oh come on, try this. You’ll like it if I make it. \n\nYou: nah, not my thing and that’s it. \n\n\nIf you’re pressured beyond this simple exchange, you don’t belong around that person/those people anyways. You want to comfortably be able to reject alcohol without a problem and without pressure.",
   "created_utc": 1691561368,
   "score": 15,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveqzvn",
   "message": "Best thing I've found is to have a drink in my hand already. Even if it's just a glass of water, even better if its a lime/soda and looks like it could have booze in it. I find people don't ask if I want a drink since I already obviously have one. If they do, I just say I'm good with the drink I have.",
   "created_utc": 1691562451,
   "score": 11,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveu4zr",
   "message": "Just tell them you're allergic to alcohol. As an alcoholic, it's technically true for me (I break out in handcuffs lol). Nobody questions allergies.",
   "created_utc": 1691564783,
   "score": 8,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jversse",
   "message": "Just say no, you don’t have to explain yourself or your reasons. The more you try to explain yourself the more they’ll try to work their way around your boundaries.",
   "created_utc": 1691563035,
   "score": 6,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveokms",
   "message": "Interferes with my medication.",
   "created_utc": 1691560727,
   "score": 9,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvepnuk",
   "message": "If you don’t want to drink alcohol just saying no thanks should be enough. If people get mad or offended by that, maybe it’s time to find new friends.",
   "created_utc": 1691561494,
   "score": 5,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvendta",
   "message": "I just say I don't want to. If they press me, I just repeat that I don't want to. Bugger 'em.",
   "created_utc": 1691559909,
   "score": 9,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvep34q",
   "message": "I’ve found peer pressure is often a desire to just socialize with you. Don’t take it personally. Just say nah I’m good. Then continue socializing.",
   "created_utc": 1691561087,
   "score": 9,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvenco7",
   "message": "I have no intestines",
   "created_utc": 1691559887,
   "score": 5,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvepwkb",
   "message": "I don't drink. Simple. You don't need a reason not to drink.",
   "created_utc": 1691561669,
   "score": 4,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveqg96",
   "message": "Because i don't want to",
   "created_utc": 1691562060,
   "score": 5,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jver09e",
   "message": "I dont drink. End of story.",
   "created_utc": 1691562459,
   "score": 4,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveqo06",
   "message": "It doesn't agree with me.",
   "created_utc": 1691562213,
   "score": 3,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveretk",
   "message": "I'm sorry but I dont owe you an explanation?",
   "created_utc": 1691562752,
   "score": 3,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jverg19",
   "message": "Depending on the vibe…\n\nI’m just not a big drinker\n\nNo thanks\n\nNot my thing\n\nI’m good\n\nAt a free-floating party, most people will think you just don’t want another drink right now. At a dinner table, you might have to give a slight explanation (not my thing, thanks). I find that the more casual and matter of fact you are, the less follow up questions you will get.\n\nETA: if you are at a party where everyone is getting shitfaced, just walk around with a party cup of water or soda in your hand.",
   "created_utc": 1691562776,
   "score": 3,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveu3js",
   "message": "No is a full sentence.\n\nIf you get pushed further \"because I said no\" \n\nI get asked all the time by people I meet when out with friends, those are my go to answers.",
   "created_utc": 1691564753,
   "score": 3,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvend3s",
   "message": "Tell them you have hepatitis or diabetes.",
   "created_utc": 1691559896,
   "score": 7,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveolek",
   "message": "It's not my thing.",
   "created_utc": 1691560742,
   "score": 4,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveorhj",
   "message": "Edit 01 - Not to be Mr All Problems But No Solutions, but as an overthinker, I'm scared they will have a logical response to my retort, I want a 0% comeback, since I don't want to have to fend off their goodwill.",
   "created_utc": 1691560860,
   "score": 2,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvep4dp",
   "message": "Ni thanks I have being sober for x time, people always thanks you were alcoholic lol so they just stop asking",
   "created_utc": 1691561111,
   "score": 2,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvep6f8",
   "message": "\"I'm a recovering alcoholic so no thanks\"",
   "created_utc": 1691561152,
   "score": 2,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvepfia",
   "message": "Simply say it’s for personal reasons.  I think that is a neutral yet clear statement that implies you will not answer more questions.",
   "created_utc": 1691561330,
   "score": 2,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveq1iq",
   "message": "\"Men in my father's side of family have a bar record of alcoholism. I don't want to try my luck\"\nFor me, that's real. No one has tried to push against that story.",
   "created_utc": 1691561770,
   "score": 2,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jver4ps",
   "message": "I always want the results, the solution to the problem, I may feel certain emotions, but in the end, feeling a certain way does not resolve the issue any faster, and is likely to be to my detriment. What do we think, is this correct or incorrect, or requires discretion?",
   "created_utc": 1691562548,
   "score": 2,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jves6w4",
   "message": "“No, thanks, I’m sticking with (alternate beverage) today.”",
   "created_utc": 1691563325,
   "score": 2,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvesn4x",
   "message": "Fuck those people. You dont owe them an explanation. Just say you dont want to drink and. be done with it.",
   "created_utc": 1691563660,
   "score": 2,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveswbb",
   "message": "Just say you don’t want any. You don’t owe any further explanation than that.",
   "created_utc": 1691563850,
   "score": 2,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveun18",
   "message": "You can't expect those who partake to understand those that do not. Ask them why it is so important that you must tell them. Tell them the truth served with a smile.",
   "created_utc": 1691565165,
   "score": 2,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvev1au",
   "message": "Hi. :) ok so I watch a reels lawyer guy who gives great advice on handling stuff. He says that it's best not answer pushy behaviors like that. Instead he turns it around and state or ask things in a different way that causes them to look at themselves.\n\"Is this really an argument you want to have on whether I drink or not.\"\n\"Did it become okay to pressure people into drinking, is that what you do?\"\n\"I have a different view on drinking for myself than you.\"",
   "created_utc": 1691565466,
   "score": 2,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevk6v",
   "message": "Why is my drinking so important, I just dont.\nOr\nAre you pressing me to drink, why?\nOr\nJust smile \"I said I dont drink\" and walk away.",
   "created_utc": 1691565862,
   "score": 2,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveyrb6",
   "message": "I’m seeing so many reasonable and friendly ways to defuse the situation here. And that’s good, that’s correct conflict resolution. But personally, deep down inside, there are few things that get me going as much as someone who keeps pushing me to drink after I’ve clearly and repeatedly told them “no thanks.” I say this as a person who drinks sometimes, and occasionally heavily, but who also chooses time and place carefully. I remember once I responded (after literally the fourth or fifth “durr, are you sure you don’t want a beer?”) with something like “how many fucking times have I said no? Are you deaf?!” This was not a person I should have addressed in this tone. But honestly it did feel kind of good to speak my mind.",
   "created_utc": 1691568370,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvezmfl",
   "message": "Just straight up saying no is fine, but you can also say, \"I'm x years sober\" if they insist. Sure, they might judge you a bit, but they shouldn't push you to drink. Even if you weren't an alcoholic, it's still a pretty foolproof way of avoiding drinks.",
   "created_utc": 1691569059,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvezmvt",
   "message": "You're allergic to it.",
   "created_utc": 1691569069,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvepjm3",
   "message": "You could say you're genetically predisposed to having addictive tendencies and you don't want to risk developing a dependency on alcohol.",
   "created_utc": 1691561410,
   "score": 4,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvep5fc",
   "message": "I'm a sober alcoholic (AMA about rehab or sobriety if you want) and I will say NOBODY has ever grilled me to have a drink. I have been to at least 100 drinking parties since first getting sober. Granted I was 25 at the time and 31 now so people are more grown-up, if you are 21 I could see them being more pushy. But just know there will almost never be a nightmare scenario where you are being super peer pressured into drinking and if you are, who cares what they think? Those wouldn't be good friends. \n\nIf you do want an alibi, I recommend saying you're allergic. Say you've tried every type of alcohol and it makes you break out in an allergic reaction. If they google it the first link is Mayo Clinic talking about alcohol intolerance (okay techincally not an allergy but same symptoms).",
   "created_utc": 1691561132,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveplxy",
   "message": "This question violates r/AskReddit rules.",
   "created_utc": 1691561457,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveqzyo",
   "message": "Well, why do you decline alcohol? Seems like if you told the truth you'd be fine.",
   "created_utc": 1691562453,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveqlug",
   "message": "[deleted]",
   "created_utc": 1691562170,
   "score": 0,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvew7aq",
   "message": "Nah not tonight.\n\nThanks but no thanks.\n\nI'm allergic to it.\n\nGives me headaches.\n\nI have to drive.\n\nNo thanks.\n\nNah keep that one for yourself bud.\n\nNo thanks, still feeling it from last time/night.\n\nNah I'm leaving in a minute.\n\nCan't drink beer/spirits, I get aggressive.\n\nI'm pregnant.\n\nNo thanks you're not my type.\n\nGod, couldn't think of anything worse to do right now.",
   "created_utc": 1691566365,
   "score": 0,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jver6ya",
   "message": "Tell them you had to stop drinking because it caused you to engage in casual sex with strangers including unprotected sex and anal intercourse and eating out from behind and 69 and getting your tits sucked in a municipal park.",
   "created_utc": 1691562593,
   "score": 254,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveqt3t",
   "message": "I've heard people in this situation say \"I'm sober\" and that usually works",
   "created_utc": 1691562315,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jverncq",
   "message": "“I’m driving” “I don’t want a hangover” “alcoholism runs in my family and I don’t want to open that door” “I want to spend my money on other things” etc.",
   "created_utc": 1691562926,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jverwgq",
   "message": "If you feel like \"I'm not in the mood for any tonight\" won't cut it, \"I've gotta be up early tomorrow\" is always a good one.",
   "created_utc": 1691563109,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jves64i",
   "message": "\"I'm driving\" appears to be one of the simplest way of declining, or something like you're on meds, you get sick real quick, if all else fails, I don't think these alcoholics are the kind of people you should care about \"offending\" if they can't accept a simple \"no\", you made a choice to care about your body and I don't mean just the health sides of it (alcohol ruining your kidney and/or liver), but what typically happens when one gets drunk : accepting stupid dares, telling your innermost secrets due to lack of inhibition, someone might try to assault you and you won't even remember, drunken brawls, drunk driving (and I hate that most accidents caused by this the drunk drivers are usually the one still alive and the victims dead) etc, and these people are trying to encourage you to down a substance that can potentially lead to these things. I get made fun for being a debby downer, a square, loser, pussy, for refusing alcohol, but this substance affects not only you but also the people around you, so you have to stand your ground even if you lose some \"friends\" along the one",
   "created_utc": 1691563310,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvesl95",
   "message": "“Because it makes me pushy and obnoxiously intrusive”",
   "created_utc": 1691563622,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvet761",
   "message": "A fake call. Like \"hell no. My mom feel not alright now. I need to give a check",
   "created_utc": 1691564078,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvetjl8",
   "message": "“Kindly, Fuck off.”",
   "created_utc": 1691564337,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveua2p",
   "message": "Agree with everyone about setting boundaries and asserting them even if it means avoiding the entire social gathering.\n\nIf you find talking isn't as effective as you hoped try an \"out-of-the-box\" approach such as taking a beer, going to the restroom, emptying it out into the sink and filling it 3/4 with water. Bend the label so you know it's yours and walk around with it using it as an active/passive prop to deter anyone offering you a drink. \n\nWhen they offer, hold up the bottle (of water) and say, \n\n\"Thanks. I am all set.\"\n\nTake a swig if you have to really sell it. \n\nIf they're counting bottles simply rinse \u0026amp; repeat in the restroom using multiple bottles throughout the evening. Stack the emptys next to your chair.\n\nZero shame for wasting beer. They offered. It's yours and you can do with it what you want.",
   "created_utc": 1691564888,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveubci",
   "message": "I'm on Antabuse. I'm wearing a court ordered alcohol detection ankle monitor. Alcoholism runs in my family. My liver is already on its last legs. Some of those may sound inflammatory.",
   "created_utc": 1691564914,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveucqp",
   "message": "Ever since \"The Incident\", I can't.",
   "created_utc": 1691564944,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveudy1",
   "message": "I struggle with these idiots my whole life... However, as you mention you need it for work related stuff: I always say, I have to drive later today, no matter if I have to drive or not. Or, as others said before: \"I tried all kinds of drugs BJ's and never found anything I like the taste of. But I love a ginger beer or a [add any kind of non alcoholic cocktail]. Hope you feel better in the next events now.",
   "created_utc": 1691564971,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveullz",
   "message": "I don't feel like it. I don't enjoy it.",
   "created_utc": 1691565135,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveupyc",
   "message": "I'm pregnant",
   "created_utc": 1691565227,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveuqa8",
   "message": "For the longest time I told people I had an allergy and no one really questioned it too hard. Drinking culture is very common where I'm from, and so there was always a lot of people pushing it. When I trusted people more I shared my more intimate reasons and they often supported me if people wanted to pressure harder",
   "created_utc": 1691565234,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveuuwj",
   "message": "\"Because I don't f**king want to.\" Is my usual response, offense be damned",
   "created_utc": 1691565332,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveuznm",
   "message": "I'm a passive aggressive AH so I'd tell them I am an alcoholic. \n\nI gave up alcohol because of gout.",
   "created_utc": 1691565431,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvev3ks",
   "message": "If anyone is a jerk about it, tell them it kills brain cells.  Follow with, \"You must drink a lot.\"",
   "created_utc": 1691565514,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvev5ni",
   "message": "I smile and laughingly say, \"My mind is already a messy place, I'm afraid adding alcohol would make it a complete disaster.\"",
   "created_utc": 1691565558,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvev8fn",
   "message": "It gives he the most violent shits I’ve ever had",
   "created_utc": 1691565615,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevelq",
   "message": "I usually say health reasons. People get a lot less likely to enquire after that.",
   "created_utc": 1691565744,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevfld",
   "message": "Offer them some crack then ask why not?",
   "created_utc": 1691565766,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevgd0",
   "message": "Say you have an allergy.",
   "created_utc": 1691565782,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevkm8",
   "message": "\"I don't drink but you could enjoy one for me.\" Walk away smiling. 🤷🏻‍♀️ I don't like pushy people. I don't know many but I love the counter statements that I have seen suggested",
   "created_utc": 1691565872,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevm87",
   "message": "“Nope, I’m driving.”",
   "created_utc": 1691565907,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevmmz",
   "message": "It’s none of their business and they can buzz off (pun intended).",
   "created_utc": 1691565916,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevnse",
   "message": "Usually I just say it makes me feel sick, so I don't drink it – my body just doesn't handle it well.",
   "created_utc": 1691565940,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevofh",
   "message": "Tell them you're allergic because some people are not worth the waste of time of explaining.",
   "created_utc": 1691565953,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevq1k",
   "message": "People who demand a reason are in the wrong. You don't need to justify yourself. If you need to have something to say, just a simple \"it's not for me\" should be sufficient.",
   "created_utc": 1691565988,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevuxz",
   "message": "Allergies",
   "created_utc": 1691566094,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevwxd",
   "message": "Just say that you never really cared for alcohol and how it makes you feel.",
   "created_utc": 1691566138,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevys6",
   "message": "Kids not even legal drinking age always posting this. It's the same exact question over and over once a week on Reddit. Kids with their theoretical issues they haven't even encountered yet.\n\nJust say \"No\".\n\nLife isn't that difficult.\n\nHow can I tell it's always kids? Because \"being cool\" stops \"being cool\" when you're an adult.\n\niow...nobody cares irl whether or not you drink or do drugs.",
   "created_utc": 1691566179,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvevzq7",
   "message": "I don't drink either. If someone asks me if I want a drink, I politely decline. If they poke me about it I always give them a ridiculous (and yes, inflammatory) reason because it isn't their business. \n\n\"I don't want to get busted riding the neighbor's goat again.\" \\*ladylike smile\\* (I don't live near goats)",
   "created_utc": 1691566199,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvew0do",
   "message": "Tell them you’re a recovering alcoholic and if you have one drink you will immediately strip naked and sexually assault them",
   "created_utc": 1691566214,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvew2yr",
   "message": "“I quit” will immediately stop the peer pressuring.",
   "created_utc": 1691566270,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvew6ol",
   "message": "I like my kidneys",
   "created_utc": 1691566351,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvewxwy",
   "message": "Generally people volunteer reasons for unusual choices if they want to appear reasonable and end questions about the topic.",
   "created_utc": 1691566948,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvewyzy",
   "message": "I'm allergic to alcohol. Every time I drink, I break out in handcuffs.",
   "created_utc": 1691566971,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvex1c7",
   "message": "“Fuck off I don’t want any” if someone is pressuring you, that response appears reasonable to me.",
   "created_utc": 1691567022,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvex3o5",
   "message": "I always say \"I'm looking after my health\"",
   "created_utc": 1691567073,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvex4ci",
   "message": "I just like … more.",
   "created_utc": 1691567087,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvex7nw",
   "message": "I’ve been told by non-drinkers that just saying “I’m sober” works best. It’s a non-answer technically true for any actual reason but vague enough that people will stop pressuring you in case you’re a recovering alcoholic.",
   "created_utc": 1691567161,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvex9ey",
   "message": "\"I don't want to end up like my mother\"\n\nThey immediately feel guilty when I say that lmao",
   "created_utc": 1691567198,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvexbrf",
   "message": "Just say your allergies are acting up so you just took an allergy pill. Name anything generic like reactin, Claritin or Benadryl. I do it all the time when I’m not in the drinking mode and I don’t even have allergies. Lol. I usually say “I just took a Benadryl” followed by a sad face.",
   "created_utc": 1691567250,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvexf3g",
   "message": "You’ve probably already done this, but it’s good if you can take a non-alcoholic drink (even if water) instead.  \n\nIf other people are drinking something, whether alcoholic or not, they’ll feel more comfortable if you are too.",
   "created_utc": 1691567321,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvexfj4",
   "message": "\"I've tried it, and found it's just not for me\"",
   "created_utc": 1691567331,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvexlz8",
   "message": "\"i gotta drive after\", everyone understands",
   "created_utc": 1691567466,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvexm2a",
   "message": "I myself simply say \"Am gd, i don't drink\" and if they ask me to try it i tell them i have and wasn't a fan.\nBut then again if ur ever pressured too much to drink and that is normal socially, ppl drink and expect u to follow suit - so ye once pressured i'd say take your leave after a bit of time so ud lose a day of ur life feeling shit.",
   "created_utc": 1691567468,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvexnwm",
   "message": "Tell them you have liver problems due to previous drinking.\nThatll shut them the fuck up",
   "created_utc": 1691567508,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvexpy1",
   "message": "-‘I only drink with friends’\n-‘You’re with me right now’\n-‘Exactly…’",
   "created_utc": 1691567550,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvexzul",
   "message": "If they really want a reason after you've said \"I'm good\" or \"I don't drink,\" you can say something along the lines of \"I decided a while ago [that ...].\" I don't recommend oft hanging out with a person that would pressure you to drink, however.",
   "created_utc": 1691567771,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvey3rt",
   "message": "The funny thing is that you don't have to explain yourself. Will I visit your home? No. Will I fuck you? No. Will I drink? No.   \n\n\nNo is such a wonderful word. You are setting a boundary, whether it is a boss, friend, lover. It doesn't matter. No means no. You owe them nothing else.",
   "created_utc": 1691567856,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvey40b",
   "message": "No. \"but why?\" - because I said fckng NO.\n\nEnd of the story. Next time someone tries to push me to drink, I'll just leave. I'm done with this bs as well. Been there so often, even though I'm also already an adult. Why do so many people not accept a damn \"I don't like it\"!?",
   "created_utc": 1691567861,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvey9d3",
   "message": "I’ve had this happen several times as I’m the only one in my family and friends group that doesn’t drink, even causally. When pressed, like if someone is really being pushy, I will just say i am on a medication that I can’t mix with alcohol. Which is technically true so it’s not a lie but it is effective and a boundary I will not cross because I don’t have to risk my health and well being for the comfort and enjoyment of other people",
   "created_utc": 1691567978,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveyd3v",
   "message": "I usually say it messes with my stomach too much. Which is one of my reasons, and probably the one to get people to drop the topic the most often.",
   "created_utc": 1691568057,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveyk1d",
   "message": "I just say “I don’t drink. Personal preference. Thank you for respecting that. “.",
   "created_utc": 1691568212,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveykj6",
   "message": "Say you’re on an antibiotic",
   "created_utc": 1691568224,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveymvz",
   "message": "I don't associate with pushy people, I sense it once, \u0026amp; I'm  a 👻",
   "created_utc": 1691568275,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveyos5",
   "message": "You can say you are on MEDS \n\nUsually people back off when it comes to mixing alchok and drugs.\n\nIt's a white lie but it sure does help.",
   "created_utc": 1691568316,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveyq90",
   "message": "I wouldn't worry about it. My partner's never drunk and it doesn't cause problems. I'm the other way and like a drink (and regularly crumble around her family when they offer me a beer) but I've gone long periods without drinking and never had an issue with it socially. You'll find that the insistent people are boring and you'll want to chat to the interesting people who have a chat with you rather than push you to drink. \n\nIf it's any help, I find driving to be a really good way out of drinking. Take the car rather than public transport and you can't drink.",
   "created_utc": 1691568347,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveyx73",
   "message": "Tell them you don't like it. You have a right to protect your health.",
   "created_utc": 1691568497,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jveyz4s",
   "message": "In a situation like that, \"No, thank you\" is plenty to say. And, say no more. Power accrues to the person who says least. \n\nWhen you don't explain, it conveys certainty, and that you don't feel a need to justify your decisions.",
   "created_utc": 1691568540,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvez2dj",
   "message": "“I don’t drink”.",
   "created_utc": 1691568613,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvez469",
   "message": "My personal choice is to not ingest alcohol.",
   "created_utc": 1691568653,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvez81d",
   "message": "\"No, thanks.\" Repeat as necessary.\n\nYou don't owe anyone an explanation.",
   "created_utc": 1691568739,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvezbd5",
   "message": "None for me thank you, thank you for the offer but I don’t drink,  thank you but I’m gonna have to decline it doesn’t agree with my stomach, thank you but I don’t drink, no thank you I’m driving, no thank you I’ve been advised by my doctor not to drink on my current medication, no thank you I have a busy day tomorrow and it effects my performance\n\nI mean after that what else can u say after that other “no real I’m not being polite I really don’t want/can’t drink",
   "created_utc": 1691568812,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvezpn0",
   "message": "Whenever I ride my motorcycle I don't drink at all. I find it easiest to just never have this annoying conversation in the first place. When you go to a bar, club, wedding or any other event where drinking is expected order a club soda with a lime or a coke in a rocks glass or really any other drink that looks like alcohol and no one will ever ask. Bartenders know what you're doing and have always been helpful and never needed an explanation.",
   "created_utc": 1691569130,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvezxga",
   "message": "\"I never developed a taste for it\" works for me when people are smoking weed.",
   "created_utc": 1691569301,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvezxoj",
   "message": "Idk for me sometimes I take this (stolen) joking way of answering if they push.\n\n“I got so good at drinking I went pro, but I’ve retired because of how hard it was to keep up with the training every day”",
   "created_utc": 1691569306,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf00a6",
   "message": "The phrase that works for me is \"Thank you, but I don't drink alcohol.\" For some reason, if I just say \"I don't drink\" that seems to leave the door open to try to convince me. And by stating it's alcohol that I don't drink, if someone is silly enough to try \"But whyyyyyyy\" on me, I say, slowly enough for the hard of thinking to follow, \"Because it's alcohol.\"",
   "created_utc": 1691569363,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf01pf",
   "message": "\"Because I don't want to\". Try to keep in mind that you extremely rarely owe someone an explanation for a lifestyle choice.",
   "created_utc": 1691569395,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf03qq",
   "message": "A: Thank you (for the offer). I don't drink.\n\nB: Why?\n\nA: \\[Raise eyebrows in surprise\\] Personal preference.\n\nB: Any specific reason?\n\nA: \\[Mildly amused tone\\] It's a great conversation starter. \\[proceed to low-key poke fun of them being so obsessed with alcohol, if they persist\\]\n\nI drink. But would never probe someone to explain themselves. That is rude. Treat it as such.",
   "created_utc": 1691569439,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf06ln",
   "message": "“I’m driving”",
   "created_utc": 1691569502,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf08yo",
   "message": "Trying to lose a little weight. Alcohol is processed like sugar.",
   "created_utc": 1691569553,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf09re",
   "message": "Mine is \" i don't need a reason not to drink \" or \" my parents were alcoholics \"",
   "created_utc": 1691569571,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf0ax8",
   "message": "I would ask why they’re so interested in why I’m not drinking alcohol. Like why does it matter so much to them?",
   "created_utc": 1691569596,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf0chw",
   "message": "Aside from saying \"I never got into it\", you could say that you're doing a \"thing\": \"I'm doing a challenge\". They ask how long, say it's 30 days. If you run into them after a month, tell them you decided to extend it another 30 days, or you liked it so much, you're trying to see how long you can go. TBH, I hope that people become aware that having a person who is not drinking alcohol is not a negative judgement on those who are (that's where I think all the pushback comes from). Disclaimer: I, for one, do enjoy drinking alcohol, but I don't push people about it.",
   "created_utc": 1691569632,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf0dc8",
   "message": "I've always gone with \"alcoholism runs in my family and I'm not willing to gamble on it\" which is true, my grandfather has cirrhosis and two of his brothers died from liver and kidney problems from rampant alcoholism",
   "created_utc": 1691569651,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf0gm2",
   "message": "You don't have to give an explanation as to why you don't drink. People should really learn that you can have a good time without alcohol. I still find it strange to see how getting intoxicated is expected in any type of social gathering...\n\nHowever, if this doesn't work, just say you are allergic. Myself, I actually do get really ill after just two drinks. Not drunk, just very ill. If someone asks me to get a drink, and I tell them this, they almost always stop pushing immediately.\n\nIf they don't, then proceed to tell them all the gory details of what this would look like (mentioning projectile vomiting always gets them to back off, trust me 😉)",
   "created_utc": 1691569724,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf0h5z",
   "message": "I don't drink if you don't like that flick off",
   "created_utc": 1691569736,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf0kqz",
   "message": "I'm not a huge drinker, I will rarely drink actually, but if I am asked, if I want a drink, I'll usually just say 'yea, just a coke thanks'... If they ask why I'm not drinking alcohol, I just say 'ahh, i'm not really a fan of alcohol these days' or 'i don't really drink anymore'\n\nI try to keep it casual and honest, I don't particularly enjoy the taste of alcohol anymore and I'd rather have a coke instead (I spent a good portion of my 20s enjoying alcohol so I'm not missing out on anything amazing) lol.",
   "created_utc": 1691569813,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf0ncl",
   "message": "I stopped drinking over 8 yrs ago. Just stopped enjoying the feeling of working off the hangover especially when I got into fitness\n\nI just tell people I don't want to. They generally ask why and I say I just don't like the feeling and leave it at that. They never seem satisfied with the answer as they can't understand cos they do like it but I'm pretty blunt when I answer so my tone of voice is usually enough to stop them asking more",
   "created_utc": 1691569872,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf0pqm",
   "message": "\"No.\"\n\n\"Been sober for a while.\"\n\n\"Fuck off.\"",
   "created_utc": 1691569925,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf0um2",
   "message": "say “I haven’t drank since the accident…..” while sadly looking off into the distance. \nOr tell them you quit for your son or daughter. Doesn’t matter if you’re not a parent. Just lie",
   "created_utc": 1691570031,
   "score": 1,
   "submission_id": "15m684w"
  },
  {
   "comment_id": "jvf0uw0",
   "message": "I use two answers:\n\nI can't drink for medical reasons.\n\nI have 4 dead relatives - liver diseases.  They drank, I don\"t.",
   "created_utc": 1691570037,
   "score": 1,
   "submission_id": "15m684w"
  }
 ]
}