{
 "submission_id": "15me4oy",
 "title": "Why was that one guy fired from your work?",
 "selftext": "",
 "created_utc": 1691584667,
 "permalink": "/r/AskReddit/comments/15me4oy/why_was_that_one_guy_fired_from_your_work/",
 "score": 127,
 "url": "https://www.reddit.com/r/AskReddit/comments/15me4oy/why_was_that_one_guy_fired_from_your_work/",
 "comments": [
  {
   "comment_id": "jvfr28b",
   "message": "HVAC residential installer. Had a co worker take a nap in the customer's house... In the customer's bed. Was confused why he was fired.",
   "created_utc": 1691586463,
   "score": 92,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg0dxw",
   "message": "He shouted, cursed at and invited the cleaning guy to \"meet him\" outside to fight because he was denied access to the restroom until it was fully cleaned.\n\nThe cleaning guy is known for being extremely calm, polite and nice to everyone. For someone to have a problem with him means that they have to be a certain kind of entitled asshole.\n\nThis happened in view of at least 10 cowokers, me included. Everyone was confused, but our manager was proactive about it. He told the guy to meet him at the HR office, and was promptly fired.\n\nAfter the manager returned, he made a quick meeting. His words were: \"We're all grown adults here, well, some of us are. I just want to put it out there and say that I'll be considerably harsh to anyone that disrespects any coworker, specially when they're responsible for making sure that your ass cheeks sit on a clean toilet. Also, don't invite people to fight you if you're not willing to go through with it.\"\n\nAfter the meeting was over, some of us asked him what he meant with that last sentence and he told us that the guy got violent in the HR office and invited him to fight in the parking lot when he was told he was getting terminated.",
   "created_utc": 1691590426,
   "score": 99,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgcun4",
   "message": "He was caught stealing cash from work, and spending it on hookers.  Turns out he had terminal cancer and wanted to go out with a bang.",
   "created_utc": 1691595163,
   "score": 250,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfo2vv",
   "message": "Using govt funds to see his mistress",
   "created_utc": 1691585068,
   "score": 242,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfs915",
   "message": "He did heroin. People were suspecting that he was because started going in the bathroom every day. At first it was like 5 minutes, and then every day it would get a little longer until he was spending like 30 minutes a day every day. This place wasn't exactly picky about who the hired and he had just got out of jail for selling heroin, so it wasn't like an unfounded suspicion. One day he started falling asleep standing up. He started mumbling jibberish and kinda trying to talk to people and the supervisor saw him and he was wtf is he saying? Then they were just like you gotta go, call your dad to pick you up.",
   "created_utc": 1691587003,
   "score": 9,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfqzar",
   "message": "Shagging a temp, who worked part time but he signed her timesheet off as full time hours",
   "created_utc": 1691586426,
   "score": 171,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfxs3q",
   "message": "Called a black colleague his \"desert princess\". She did not approve, vocally. After a few incidents she got upset, in response the colleague doubled down:\n\n\"What are you gonna do princess? Punish me??\".\n\nHe crawled over the floor begging to be spanked.",
   "created_utc": 1691589367,
   "score": 65,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfpdl6",
   "message": "People were fired from my job only for gross acts----like\n\n1.  Taking a fire extinguisher, and spitzing it all over the office.\n2.  Breaking the glass part of a door owing to some minor frustration.\n\nI was in a civil service job; it's very difficult for people to get fired, unless they REALLY screw up.",
   "created_utc": 1691585688,
   "score": 16,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg5ao6",
   "message": "I had an employee/helper/apprentice that worked for me for 2 years.\n\nI did new construction plumbing. occasionally you'll have a call back to a home that has a problem after the new homeowner moves in.\n\nI had such a call.\n\nSo me and this guy goes to the home and knocks. A beautiful, 30 something, lady answers the door.\n\nasking her what her problem was she says, \"When I take a shower, the shower head makes a whistling noise.\"\n\nand my helper blurts out to her. \"Hell, if I saw you naked, I'd whistle too.\"\n\nShe (rightly so) complained to the development construction supervisor. he told me that the helper could not come back to work in that development.\n\nbeing that it was the only work I had. I had to fire him.",
   "created_utc": 1691592341,
   "score": 94,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfrc5n",
   "message": "He was really creepy toward other associates, myself included. I also witnessed him flirting with a woman trying to shop and thought it was weird. He followed me on Instagram and would comment heart eyes on pictures of my friend and I. I guess he went far with another associate who spoke up and all of us at work had to write down the creepy things he was doing and they compiled it all and fired him",
   "created_utc": 1691586588,
   "score": 155,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg6rjg",
   "message": "she\\*. one of our janitors survived a boat fire during vacation, second degree burns on her arms and legs. so she went on sick leave. next day she was fired for 'economic reasons', month or so after that the company filed for bankrupcy",
   "created_utc": 1691592900,
   "score": 10,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfvn6w",
   "message": "Worked at a publication. Hired a new guy who was super nice and everybody liked him. Within a week, found he was plagiarizing everything he wrote. Immediately gone - no questions asked.",
   "created_utc": 1691588476,
   "score": 12,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfp1ks",
   "message": "Had to fire someone just a few weeks ago. He was a new hire, and in three weeks he called out five times. I wrote him up for poor attendance, and just two days later he was a no-show, no-call when we had two deliveries going out (driver - HVAC equipment).\n\nLeft me no choice.",
   "created_utc": 1691585530,
   "score": 193,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfpswh",
   "message": "She watched Netflix at her desk and took naps.  With the volume up.\n\nHer desk was in the middle of the office, there was no hiding.  She also fucked up a lot.",
   "created_utc": 1691585889,
   "score": 119,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfrjkv",
   "message": "Harry the special needs guy,\nSomeone at work introduced him into porn (playboy mag in a truck) Harry was never the same, Harry kept wacking off infront of the women in the office and in the warehouse. The boss knew that Harry was corrupted by the Playboy and really tried to fix the situation as it was important for Harry to stay employed. I guess in the early 2000’s a boss could get away with this sort of thing.\n\nHarry’s life went really down hill after he got fired, really sad and it explains why the boss tried to fix the situation despite the intolerable things he was doing.",
   "created_utc": 1691586683,
   "score": 110,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg3on5",
   "message": "He was stealing things.  \n\nAnother just showed up whenever he felt like it.\n\"We need you here at 7am\" he shows up about 11am.  \n\nAnother walked off the job. \n\nOne was sleeping on the job.\n\nAnother got hired, then walked off mid shift, \"fuck this place!\" He was fired/quit.\n\nA woman was in the company car, driving around with the cellphone in her ear, shirt off, no belt buckle.  The regional director saw it.  She was asked to pull into management parking.  She stepped out of the car and was literally fired on the spot.  \n\nAnother for threatening co-workers.  One of the co-workers called the police.  She was called into the office, where she was told \"the threats are being investigated\" she then had a truly epic rant and threatened everyone.  She was fired.  Management was seconds away from calling the police.  She keyed the manager's car when leaving.",
   "created_utc": 1691591722,
   "score": 216,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfwpq1",
   "message": "she was fired for trying to start a rumble in the parking lot with the person who “stole” her promotion. right in front of an exit, so full view of the cameras.",
   "created_utc": 1691588927,
   "score": 112,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfu29q",
   "message": "He spent the entire time playing a game on his own handheld console instead of testing the game we were doing overtime to actually test. Got very angry at being let go.",
   "created_utc": 1691587799,
   "score": 76,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg533a",
   "message": "Ate another coworkers lunch. There was a box of chicken in the break room refrigerator. It was one of those combos with mashed potatoes and a biscuit.\n\nThere were cameras in the break room so when the employee reported his lunch missing they reviewed the footage.\n\nAfter confronting the lunch bandit, his excuse was \"it was abandoned chicken.\"",
   "created_utc": 1691592263,
   "score": 73,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfxiy4",
   "message": "He called someone (client) a crazy Mormon to a Mormon that worked in our office.  That person took great offense to it and filed an HR complaint that got him fired",
   "created_utc": 1691589264,
   "score": 139,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg1cpa",
   "message": "Stealing a car from the dealership where he worked as a salesperson. Yes, he showed up to work the next day with the car as if it was totally fine. GM did not press charges, but he sure as shit fired the fuck out of him.",
   "created_utc": 1691590807,
   "score": 251,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfsysb",
   "message": "Dude never looked up from his phone during my whole interview, seemed sus, now I know why. He got busted in a 'To Catch a Predator' sting. Didn't make the show though.",
   "created_utc": 1691587321,
   "score": 116,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfyojk",
   "message": "Jerking off and watching porn in his office. Kicker was he was a clinician for sexually reactive adolescent boys.",
   "created_utc": 1691589734,
   "score": 156,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg703u",
   "message": "Stealing the bosses Pop Tarts",
   "created_utc": 1691592988,
   "score": 88,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgb55k",
   "message": "At a grocery store\n- Guy told the store manager to kiss his ass.\n\nAt an internet install company\n- Guy was in training.  He was set to ride along with his trainer.  Guy would log his hours every day, but he never met with Trainer.  Company asked Trainer how he was doing and Trainer said he stopped showing up x amount of days ago.",
   "created_utc": 1691594541,
   "score": 128,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgiy6w",
   "message": "He left to kill his wife. We had to fire him because it was an unexcused absence, he did not inform his manager he was leaving.",
   "created_utc": 1691597378,
   "score": 120,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgkseg",
   "message": "Well, there \\*was\\* the new CFO who was shown the door at lunchtime on his first day.\n\nThen the stock email about “Do not use the corporate internet to visit inappropriate websites” was sent out. 🧐",
   "created_utc": 1691598045,
   "score": 206,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg6gyv",
   "message": "It was discovered that he had been lying about his PhD for 15 years…worked in education.",
   "created_utc": 1691592788,
   "score": 130,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvftuls",
   "message": "someone snitched on him smoking weed on his break",
   "created_utc": 1691587707,
   "score": 59,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg7yt9",
   "message": "He tried to choke a scrum master for asking why his work had no updates for about a week.",
   "created_utc": 1691593353,
   "score": 78,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfnxlw",
   "message": "He was a machine mechanic at the pickle factory I worked at. He got fired for putting his penis in the pickle slicer. \n\nThe pickle slicer got fired too.",
   "created_utc": 1691584997,
   "score": 165,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfwvv3",
   "message": "Flipped out and attacked the manager at the front desk, had to be escorted out by police. Few months later I saw in the paper that he'd been arrested for threatening a neighbor with a knife. Can't say I was shocked.",
   "created_utc": 1691588998,
   "score": 61,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg8ov2",
   "message": "I’ve known 2. First was uploading CP to the internet using company IT equipment. A girl from HR posted his P45 through a gap in the police car window as he was driven away. Everyone thought he was “off”, but we had no idea how off he was.\n\nSecond used company funds to bring the secretary he was having an affair with to a meeting/team building event in London. He’s just been promoted to Director, so he flushed his $250,000 pa job, his stock options and his marriage down the shifter in one go. Muppet.",
   "created_utc": 1691593628,
   "score": 143,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfx1vz",
   "message": "Dude brought an AR15 and was showing it off to people in the parking lot",
   "created_utc": 1691589067,
   "score": 90,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgb3da",
   "message": "Kept missing work because he slept in after staying up all night playing WoW.\n\nAlso we had another guy fired because he sexually harassed literally every female at our office. This was also like two months after he had just gotten married.",
   "created_utc": 1691594523,
   "score": 91,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfojd8",
   "message": "When we were still working from home fulltime one dude was fired because he would just come to our standups drunk (yes dead drunk at 10 in the morning)",
   "created_utc": 1691585290,
   "score": 48,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfspsp",
   "message": "He had tourette syndrome and some other mental health issues. Would slam shit all over the kitchen and generally be a disturbance. We called him Crash. What got him fired though was he had a habit of chewing on the end of broomsticks and one day a customer saw him do so and complained. It was something management generally looked the other way on but after that they were forced to let him go.",
   "created_utc": 1691587212,
   "score": 56,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg80r7",
   "message": "He was batshit crazy..\n\nOne day, the guy decided to take off all his clothes in the locker room, started running around naked and set a table on fire\n\nGuy was subdued, arrested and fired",
   "created_utc": 1691593374,
   "score": 57,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfwgq9",
   "message": "Tried to come to work without pants.",
   "created_utc": 1691588822,
   "score": 24,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfz18r",
   "message": "He claimed he was in the national search and rescue brigade which is entirely volunteer based.\n\nThey are sorta like our troops, they get perks and can't be fired if they get called out and so on.\n\nHe skipped work all the time claiming it was because he was called in.\n\nOne day someone from the office decided to check if he was and turned out he lied about the whole thing.\n\nI'm pretty sure he got blacklisted by the entire city which would explain why I haven't heard anything about him for years.",
   "created_utc": 1691589877,
   "score": 142,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg0c3e",
   "message": "During the first week our guy managed to:\n- make the whole team uncomfortable with his presence, our guy was a heavy drug user and a creep on top of that. And this happened in wfh. This takes skill.\n- late from 3rd day (even tho we are working from home) because he just got home from custody for breaking a window of a bus, and yes, police involved, also got charged with posession of drugs\n- at the very same day during training that i held our guy just stated that he didn't sleep for 3 days and needs some rest so he is going to sleep now. Literally couldn't react to this, he took it as an \"okay sure go ahead\" in 0,5 seconds.\n\nAnd after the whole stuff we obviously had to fire the guy, and then comes the final act: a wall of text to my manager about how he is (my manager) is a junkie and the whole group is, and we should fuck off, all of us.\nGuy is doing jailtime as far as i know right now.\nGood times.",
   "created_utc": 1691590406,
   "score": 45,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg627x",
   "message": "I work at a tech support company and a co worker had a bad day and some Karen called and gave him the business and he hit the mute button and said out loud why do I always get the assholes and he didn’t hit that mute button and Karen heard it all.",
   "created_utc": 1691592632,
   "score": 56,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg09uw",
   "message": "Stole from the company, sexually harassed nearly all the women in his office and racially and sexually discriminated against women and POC.  Inappropriate touching and the whole nine yards. He is a terrible human being.  That ahole had the nerve to contact me from his new company to sell a CRM system.  Like dude, I wouldn't put water on you if you were on fire.  It took way too long to fire him. He threw a huge tantrum and destroyed his laptop in the parking lot.",
   "created_utc": 1691590379,
   "score": 65,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg869g",
   "message": "He was keeping sick and injured birds under his desk that he found on his lunch breaks and using binoculars to watch people in other offices.",
   "created_utc": 1691593433,
   "score": 82,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg3bkn",
   "message": "Took a shit in a plastic bag and left it in the work truck overnight, also refused to take people to the bathroom if they needed to go while at a site. Shitty guy no pun intended",
   "created_utc": 1691591580,
   "score": 40,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgjym9",
   "message": "Kept leaving his classroom of moderate to severely handicapped kids to go score drugs.",
   "created_utc": 1691597747,
   "score": 49,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvh57mw",
   "message": "Guy had anger problems and one day went OFF, screaming about how someone stole something from his backpack in the break room. Manager asked what was missing? “My pot and grinder!!” Funniest part is after he was fired for bringing it to work (and clearly stoned - offered him a drug test but he didn’t see the point 😂), he left the building, only to find his pot and grinder on the sidewalk around the corner from the store where he had spaced it out after getting high on break 😂😂😂",
   "created_utc": 1691605422,
   "score": 207,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfnoaw",
   "message": "He was a slacker and a conman.",
   "created_utc": 1691584870,
   "score": 27,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg6xi3",
   "message": "Once worked at a big online retailer (Not amazon), we had 3 warehouses we shipped out of.  One was smaller and only held one specific brand of item.  The warehouse manager of that warehouse was fired and arrested at work. Turned out he was fulfilling orders,printing labels with correct addresses, which would be emailed to the client. Then he would the next day do redirects through the Fedex system and assign new tracking numbers so the old ones wouldnt show final delivery address, just that it was changed. Everything got redirected to his house.  He then was relisting the same items on ebay under a VERY similar company name to the one he actually worked for (not exact but changed the word World, to National).",
   "created_utc": 1691592961,
   "score": 62,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg96b5",
   "message": "Old job of mine but, he would text customers after making deliveries trying to sleep with them.",
   "created_utc": 1691593810,
   "score": 35,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgcqha",
   "message": "Got “robbed”. As in “call my boyfriend and pretend to rob me and take the cash”. Umm, we have cameras. Fired, jail, boyfriend had warrants, good luck. Also, that safe isn’t coming open because I have the code in my brain. Shoot me, well, there goes that code.",
   "created_utc": 1691595119,
   "score": 28,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgdtob",
   "message": "Salesman addicted to frequent flier points. He'd book flights with four segments each way, meaning extra nights in hotels and basically doing almost no work two days a week.  He was told repeatedly to book direct flights but just wouldn't. Two kids in college and the finally fired him.",
   "created_utc": 1691595513,
   "score": 60,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgh00q",
   "message": "Coming in high out of his mind on downers…was so disoriented that they put him in a cab and he had no idea what happened the next morning. \n\nGuy was going through a tough time at home so I felt bad but it was pretty jarring to see first thing on a Monday morning…",
   "created_utc": 1691596667,
   "score": 21,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgpe7i",
   "message": "I’m a nurse and at the time was working in the ICU. This was during one of the Covid waves, so staffing was tight and we had a few travel nurses working on the unit with us to help. One of the travelers made the conscious decision to bolus an entire bottle of Propofol, which is a sedative we use to keep patients asleep when they are on a ventilator. The drug is also very good at stopping your breathing and dropping your blood pressure very quickly if you give it quickly. Needless to say, the patient coded and we had to reverse the effects of the drug and resuscitate them. After finding out what caused the code, that traveler was shitcanned on the spot. No clue why she would willingly drain the entire bottle into the patient when we use programmable IV pumps and many other failsafes to prevent this sort of thing. But yeah, negligence or whatever nearly killed a patient that night.",
   "created_utc": 1691599701,
   "score": 98,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgc455",
   "message": "First guy I ever fired had pulled out his penis at work and waved it at a girl he liked. The girl didn’t mind but an old lady saw him and reported it. \n\nThis happened almost 35 years ago so the following isn’t doxxing. His last name was Hancock. Not kidding.",
   "created_utc": 1691594894,
   "score": 29,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfwjzq",
   "message": "sexually harassing the outsourced people",
   "created_utc": 1691588861,
   "score": 16,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfxj84",
   "message": "Was caught beating it in one of our conference rooms. Strangely enough the couple having an affair in the building did not get fired.",
   "created_utc": 1691589267,
   "score": 7,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfy6fy",
   "message": "Alcohol dependency. Showing up hours late and needing to sneak to vehicle to drink fireball shots",
   "created_utc": 1691589530,
   "score": 22,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgey5a",
   "message": "Sex in the warehouse sorting area with an inmate.",
   "created_utc": 1691595924,
   "score": 18,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg5cz2",
   "message": "Paid women at work to see him after work.",
   "created_utc": 1691592366,
   "score": 10,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvga9ro",
   "message": "He tried to steal wire for the copper",
   "created_utc": 1691594218,
   "score": 15,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgc8tw",
   "message": "Worked at a theater. He kept disappearing when things got busy. We thought maybe he was just going into the theaters to clean like we always do, but he’d be gone for long periods with nobody having seen him. \n\nWe eventually found him sleeping in a janitor’s closet.",
   "created_utc": 1691594940,
   "score": 47,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgco2h",
   "message": "Work at a payroll company, we had an employee who Switched like 20 direct deposits to her own account. It was all very traceable and she was caught like later that day",
   "created_utc": 1691595095,
   "score": 86,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgd8x5",
   "message": "Showing up 15 minutes late and still drunk to his first office meeting.",
   "created_utc": 1691595305,
   "score": 20,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgec36",
   "message": "We had a guy back like 20 years ago who made jokes about wanting to shoot people in the office.",
   "created_utc": 1691595700,
   "score": 17,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgeota",
   "message": "Pulled the GPS out of his work truck after 3 days of watching him go home before his route everyday.",
   "created_utc": 1691595830,
   "score": 21,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgfw4q",
   "message": "He was stalking someone who worked in a different department at the facility, whom he had met on grindr and deducted that he worked in the same place despite the person not having that information posted anywhere. He attempted to give him a sexually explicit letter that instead ended up in the hands of the floor manager.\n\nHe also outed the person he was stalking in the process.",
   "created_utc": 1691596265,
   "score": 52,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfnto0",
   "message": "They pretended to kidnap campers",
   "created_utc": 1691584944,
   "score": 17,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfyryw",
   "message": "Pissing in my face when I'm eating a turkey sandwich",
   "created_utc": 1691589773,
   "score": 12,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg1v0f",
   "message": "He got busted as a drug dealer, and made national news I think. Local for sure.",
   "created_utc": 1691591006,
   "score": 10,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg6g0q",
   "message": "He worked in IT and somehow was able to hack our company wife live stream and posted a video of his ex who also works at the company that he secretly took while she was naked.",
   "created_utc": 1691592778,
   "score": 7,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg93yz",
   "message": "He was always weird, but seemed harmless. Then one day he was passing a female coworker in the hall and he grabbed her by the shoulders and forcibly tried to kiss her.",
   "created_utc": 1691593785,
   "score": 27,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgc16k",
   "message": "Worked for a cable company (sales). There was a code idk why it was there if we couldn’t use it but whatever. So the code would let you add a home phone to their bill also while lowering it by $20. He would do that to anyone and just say he lowered their bill as a courtesy. Next month people would come back with their bill upset about an unknown phone on it. We’d send them to him. At one point he’d have a line of people to see just him because of what he did. Our manager caught on because she looked at sales. He had 25 home phones in a month (average was around 4). Launched an investigation and he was fired because of it",
   "created_utc": 1691594865,
   "score": 29,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgexuh",
   "message": "Taking his penis out in the break room to prove that he in fact would do such a thing",
   "created_utc": 1691595921,
   "score": 40,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgkocc",
   "message": "She apparently said something that she absolutely, positively *should not have said*.  To this day, nobody in the know has ever told me exactly what she said, but considering some of the things regularly said around the office I can only imagine it was hard-R level.",
   "created_utc": 1691598005,
   "score": 26,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgo675",
   "message": "Gave Indian scammers access to her computer and, therefore, to the company servers. I have no idea if there were any financial losses, but the CEO was pissed.\n\n\nWe had a security training workshop the week after that and the way people treat sensible information... My God...",
   "created_utc": 1691599259,
   "score": 39,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgrdkm",
   "message": "using chicken broth as urine for his drug test.",
   "created_utc": 1691600420,
   "score": 47,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgxb8z",
   "message": "Necro porn … and he was studying to be funeral director.",
   "created_utc": 1691602574,
   "score": 6,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvh2h08",
   "message": "I worked in a hotel and a guy was fired in the kitchen for drinking one of the most expensive wines the restaurant had.",
   "created_utc": 1691604430,
   "score": 22,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvft7bh",
   "message": "He was late every day because he decided to commute from Birmingham to Macclesfield by train and the crashed two cars in his first week.",
   "created_utc": 1691587425,
   "score": 8,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfz8ii",
   "message": "This guy can't really be called a Kevin, he was smart, but he let his beliefs and opinions run out of his mouth before his brain had time to think. Worked with him for years, pretty sure he was sleeping with a boss or something, but he was banned from entering certain areas if certain people were present because it would either lead to him getting beaten to a pulp, a lawsuit, or both. Somehow this guy was a manager mind you and wasn't well liked at all. He was finally fired on a very busy day, we had a lot going on, and two employees were taking a quick breather, he comes up to them and says something along the lines of \"Both of you slacking off again? I see how it is, Monkey see Monkey do.\" And these two employees happened to be black, this was also heard by a dozen plus other employees, and well no way to recover from that. Before he could start to back pedal on his words he was fired.",
   "created_utc": 1691589958,
   "score": 34,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg2tot",
   "message": "He was an hour late one day and then another day he didn’t show up for his shift and didn’t respond to any calls.",
   "created_utc": 1691591385,
   "score": 4,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgb4wm",
   "message": "One guy was spitting in the salad bar, when he filled it.",
   "created_utc": 1691594538,
   "score": 6,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgbwd2",
   "message": "New manager at the bike shop made it a rule we had to eat lunch in the break room instead of at the counter. Makes sense to me, but it was kind of a vibe down not being able to eat around the guys. One guy (old, retired man who worked part time for fun) could not get over the rule change and said the new manager was a tyrant. He just got scheduled less and less until he never got scheduled",
   "created_utc": 1691594816,
   "score": 5,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgd0jf",
   "message": "Drinking on the job.... driving a delivery truck.",
   "created_utc": 1691595221,
   "score": 10,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgioeb",
   "message": "P00ping in another mechanics tool bag! Thought it was funny until the tool bag owner accidentally grabbed poop instead of a wrench!",
   "created_utc": 1691597278,
   "score": 5,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgk92a",
   "message": "Woman and she was a supervisor. She was punched by an employee and started to fight back but another supervisor stopped her. That's not what she was fired for though. They looked at the days footage and found out that she was the one who had been stealing.",
   "created_utc": 1691597851,
   "score": 11,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgwl3y",
   "message": "Two guys were welding and both wanted to play their music on the radio over the shop. One got upset and shoved the other from behind. The other turned around and punched him in the face. All while welding equipment was live. Both got fired almost immediately\n\nLater found out that one of the guys was going around bragging about how he banged me and how “dirty of a girl I was”. (Def not true he was a total loser) Really appreciate that my fellow coworkers looked out and stood up for me /BIG S",
   "created_utc": 1691602315,
   "score": 36,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvhduoo",
   "message": "Kiddie porn on his home computer… Sheriff and “swat team” arrested him at work. Told him the charges in front of everyone. His dad also worked for the company. It was awesome.",
   "created_utc": 1691608554,
   "score": 24,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfvd2s",
   "message": "We were working as servers in a restaurant. Once she came in drunk, she wasn't even able to walk straight anymore... Whenever she was sober, she just showed us videos of her cats and didn't react when the bell rang (cue to take a dish from the kitchen to the guest's table). Didn't make it past her trial period",
   "created_utc": 1691588358,
   "score": 11,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgzl4m",
   "message": "Jose, maintenance guy,  he was caught refilling the big plastic water cooler jugs you see in offices with a garden hose early in the morning. Everyone figure the owner was just trying to save money and it went on for years.\n\nOne day the accountant Tony complained to the owner about the garden hose water which was a problem as the owner had no idea and then asked but then who are we paying money to each month for this water?\n\nJose had started his own water company and the accountant who knew about this was still paying a company for said water.\n\nThe owner I think suffered from an aneurysm upon hearing this and the accountant was fired the next day. \n\nJose got a promotion and a pay rise but he couldn’t continue his business any more. The owner reasoned that Jose had delivered the water and effectively had saved him thousands over the years. \n\nThe name of the water company was the same name as the owners business with just “s” and  “water” at the end. He was clearly selling the companies water to them, it was genius.",
   "created_utc": 1691603389,
   "score": 7,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg863z",
   "message": "1. She had meth or some other drug in her locker/lunchbox in employee fridge.\n\n2. (Different employee) employee A threatened to quit if employee B wasn't fired because she wouldn't stop abusing medications. Employee B found prozac or something in a pile of donated clothes. She took it. She could become real nasty when high and the supers would just send her home (yes, she had crashed when driving still no repercussions). This was less than 3 years ago. I still hurt for her, she has since passed away. But she did 'everything right' career, hubby, house. But she suffered from early menopause at about 27 I think. Infertility destroyed her. She was there for all 3 of my miscarriages. She knew how deeply my struggles with fertility affected me. But ignored how hers affected her. She needed help, but refused it.",
   "created_utc": 1691593432,
   "score": 12,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgc5vn",
   "message": "It was a one man job in shifts, dealing with comparably big amounts of money. Was a really chill guy honestly. Boss started watching back the security footage after some minor thing got damaged (didn't got destroyed, only some scratches).\n\nThe GF of said guy was with him on ALL shifts. Nobody knew her at the time, she was just a random woman for all of us. He got fired after the boss saw, that his GF took all of the tips from everyone else multiple times (tip jar).",
   "created_utc": 1691594911,
   "score": 20,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgg11z",
   "message": "He had a whole other full time job",
   "created_utc": 1691596316,
   "score": 3,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgiec9",
   "message": "Was a massive misogynist, final straw was leaving a present in the toilet customers use.",
   "created_utc": 1691597177,
   "score": 3,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgiszw",
   "message": "Insurance based company I worked for had no solid process for salvage items. Basically, items were left in a cupboard that magically never filled up. \n\nGuy was stealing old damaged phones, tablets, laptops, camera etc and selling them as damaged on Ebay (with the insurance reason included). Someone asked for their damaged laptop back. It wasn't in the cupboard.",
   "created_utc": 1691597325,
   "score": 25,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgjewb",
   "message": "throwing dodgeballs at kids while yelling and calling them racial slurs",
   "created_utc": 1691597549,
   "score": 3,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgkex8",
   "message": "Guess he was just trying to balance the budget...and his love life!",
   "created_utc": 1691597911,
   "score": 3,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgkyyx",
   "message": "Our company's found owned the building and rented some space at street-level to outside businesses. A C-suite executive decided it would be a good idea to have an affair with the owner of one of those businesses in his office after hours. They were caught on cameras that he had insisted on installing.",
   "created_utc": 1691598112,
   "score": 12,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgl25d",
   "message": "This was years ago at a place I was bartending at. He showed up to work on pcp… got into a fist fight with 2 customers… it took 6 guys to hold him until the cops showed up.",
   "created_utc": 1691598143,
   "score": 6,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgpqq8",
   "message": "Guy was pissed off about how he was being treated. Said very loudly that I'm sick of being treated like a n****r as our black co worker was walking by.\n\n\nDude's defence was that he wasn't referring to him and that the black dude should understand that",
   "created_utc": 1691599825,
   "score": 17,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgs572",
   "message": "He got arrested for domestic violence and child endangerment, but told everyone he got a DUI. We live in a small town so the owner looks at the sheriffs arrest logs all the time and he saw this guy on there and fired him right away. This dude shows up a week later, all strung out looking, trying to clock in but the machine wouldn’t work for him. We were like dude you were fired, and he said “What!! What for!?” We just told him to go to the office and he didn’t see him again for a few weeks when he happened to be walking down the street looking like shit.",
   "created_utc": 1691600704,
   "score": 10,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgtaob",
   "message": "Chris, Chris jumped in front of a train and killed himself outside of work. Some weird employment law made it that we had to then fire him. Not the worse thing to happen to Chris.",
   "created_utc": 1691601126,
   "score": 3,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgtyjk",
   "message": "Worked in telecom back when 1-900 sex numbers were a thing. Coworker would hang out in the wiring closet and use his linemans' test set to get his jollies. Customers got the bills and started calling the office to complain (DUH!). Bosses compared dates with service records, dude was history.",
   "created_utc": 1691601367,
   "score": 15,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgumg0",
   "message": "I work corrections. One of our officers was in the hospital watching a prison, and for whatever reason thought it would be funny to unholster his weapon and point it at the prisoner.",
   "created_utc": 1691601610,
   "score": 3,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvh8cic",
   "message": "Asking the same question on reddit too often",
   "created_utc": 1691606559,
   "score": 3,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvh8zoi",
   "message": "In a sales org, we had someone dialing a number that played \"never gonna give you up.\" they repeated it dozens of times a day. Same number, same call duration. Repeatedly. Then they'd point to their call volume as evidence as to them working hard, and wonder why they weren't getting business.",
   "created_utc": 1691606793,
   "score": 13,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvha8xn",
   "message": "accidentally crashed a 2,000-ton freight train. Today, he's a dock worker at some harbor up north.",
   "created_utc": 1691607244,
   "score": 3,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvhbss6",
   "message": "Provided fake doctor’s notes to HR.",
   "created_utc": 1691607802,
   "score": 3,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvhbtyq",
   "message": "This happened at my sisters work while she was a waitress. Her coworker (waiter) got fired and arrested for getting busted with CP on his phone. 🤢",
   "created_utc": 1691607814,
   "score": 5,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvhe217",
   "message": "For stealing out of the children’s hospital charity box.",
   "created_utc": 1691608627,
   "score": 3,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvhe9gb",
   "message": "He took the company car home without authorization.  -- that wasn't enough to get fired, it was late and he lived 10 minutes away in Brooklyn. \n\nHe used company car to pickup his brother in Queens.  -- That wasn't enough to get fired.  \n\nHe hit a pedestrian while picking up his brother in Queens with the company car that he took without authorization -- that might do it... \n\nHe fled the scene of the accident after hitting a pedestrian while picking up his brother with the company car that he took without authorization.  --- He got fired soo fast.",
   "created_utc": 1691608702,
   "score": 102,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvhinob",
   "message": "Department store I worked at about 20 years ago. I was 20 at the time, working their shoe department, and I worked with this other person the same age, maybe a year younger. She was apparently ringing in gift cards under my number, but no currency exchanged. I rarely closed, and back then, we just took our tills up to the cash room and someone there would do the counts early the next morning. Never knew it was happening until the LP officer came down and asked her to come to the office. She screwed up by doing this on days I wasn’t at work, and I’d been watched for several weeks without any clue. On days I worked, the transactions were done when I was on break. So glad they did their due diligence.",
   "created_utc": 1691610290,
   "score": 61,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvfnsrw",
   "message": "ukrainian chick lasted 3 days, drunk barely able to walk",
   "created_utc": 1691584931,
   "score": 7,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg3avs",
   "message": "For wearing a christmas jumper",
   "created_utc": 1691591573,
   "score": 2,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvg9kaa",
   "message": "Left NY.",
   "created_utc": 1691593954,
   "score": 2,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvga19g",
   "message": "Sexual harrassment.",
   "created_utc": 1691594130,
   "score": 2,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvh320d",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgjm8b",
   "message": "Found out his partner on the ambulance was gay, proceeded to declare loudly in the break room \"I ain't gonna work with no faggot.\"\n\nBoss's door was open, heard him, walked out of his office and fired him on the spot in the middle of shift. It was brutal.",
   "created_utc": 1691597623,
   "score": 105,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgqocr",
   "message": "Worked at Chuck E Cheese. Had to dress in the costumes and stand on the side of the road waving at passersby by. July 4th weekend. 90 plus degrees outside. Dude had enough. Turned Chucky's head around backwards, turned away from the traffic and started waving his long pink tail at the cars.\n\nEdit- this was 4th of July weekend on Memorial Drive in Stone Mountain, Georgia. Before cell phones. Hundreds and hundreds of vehicles came by before the calls started pouring in.",
   "created_utc": 1691600165,
   "score": 68,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgmlnr",
   "message": "A new hire started acting like he was the boss of the women in his section. He was not hired as a manager and they were all far more qualified than him. He was shown the door as soon as our CEO found out what was going on.",
   "created_utc": 1691598699,
   "score": 26,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgo2bi",
   "message": "Stealing from the till using refunds onto their own debit card. Stupid af lmao. Found out later that she had done it at three other stores and was being charged. Only got house arrest for it.",
   "created_utc": 1691599221,
   "score": 16,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgqdos",
   "message": "One guy , sales, didn't sell anything for a year.  \nOne guy, developer, always talked about solutions and answers and actually had great theory but didn't actually check anything in for months his reason was he was above that and more suited for architecture work.  \nOne guy, Director, at a company outing was told he didn't have the balls to do something and responded by dropping trow to show off the twigs n berries to prove her wrong - in the middle of the cookout.",
   "created_utc": 1691600058,
   "score": 18,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvhajln",
   "message": "My brother does HVAC, had a lead-guy with a company vehicle who was an alchoholic.\n\nBoss man became aware of it and told him he cannot be drinking before or during work and to get his shit together, 1 more slip up and he’s gone.\n\nDude was apparently very apologetic and said it wouldn’t happen again…then the next week, another lead guy suspected and opened drunkard’s cooler and wouldn’t you know it, a 6 pack of Bud Light with 2 empty bottles at 10am.\n\nCalled their boss and he said “go ahead and tell him to find a ride home, I’ll mail him his last check”\n\nMy brother had to drive the company van back to their shop that day.\n\nFkn infuriating, if that dude caused a wreck because he was driving drunk with my brother in the van, he’d have a lot more than his job and the law to worry about",
   "created_utc": 1691607349,
   "score": 15,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgnpmu",
   "message": "he has a crazy baby momma that wouldn’t stop calling every possible phone she could in our workspace looking for him. we work in a big space,  not everybody knows everybody, if someone answered the phone who didn’t know him or wouldn’t help her she would scream and cuss at you until you hung up. she would call literally 30+ times a shift looking for him.\neventually he got fired because she showed up from 4 states away looking for him (apparently by bus?) with their toddler in tow and got through a badge access only door WITH THEIR KID. he got fired because everybody was afraid she was gonna shoot us up.",
   "created_utc": 1691599094,
   "score": 15,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgv6n0",
   "message": "No reason, my company sucks.  \n\nHe was one of the hardest working, smart, dedicated person in our office.  Some idiot CFO in another county decided to fire everyone in a certain position without thinking to  check if they were in the middle of a bunch of projects and were completely essential to the region they were in, now we're all scrambling to fill his spots on all the projects.  \n\nI always knew corporations didn't care but wow it's worse than I imagined.",
   "created_utc": 1691601810,
   "score": 25,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgi951",
   "message": "I still to this day don’t know why I was fired (not the right fit or some such blanket excuse) but I do know the guy they replaced me with was fired because he was found to be a sexual predator.",
   "created_utc": 1691597125,
   "score": 3,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvhdmcl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvhbrvm",
   "message": "Architectural residential drafter here, the guy was hired on because his dad was high up in our plumbing company we purchased at the time. The guy didn’t have a college degree but was willing to learn and worked in plumbing. \n\nWe thought he’d bring ideas and solutions to help our plumbers in the field install fixtures. When we asked him technical questions….he didn’t know the answer.\nThen it turned into him screwing up houses where buyers added on 3rd car garages, sunrooms, covered patios, etc. Costing us a few thousand. He took 0 accountability, and not only that blamed a different drafter, including myself, on big mess ups.\n\nThis guy had 0 office etiquette, and would annoy the hell out of everyone in the office, and because of this, he was BEHIND on work. He would do everything in his power to participate in all work activities to get out of doing work. He showed up late at least once a week, like 3 hours late. \n\nHe also would give unsolicited advice about losing weight and how he was healthier than most people there…he gained 30 lbs from when he started to being fired. \n\nWhen he was put on probation for a month, he refused to do any changes to prints and make others do it so he couldn’t in theory “mess up,” the company was basically paying him to give others work and be a burden at the same time. \n\nMy manager called me when I went out on an emergency family issue to tell me they fired him, and I was not surprised and I celebrated it. I announced to family with the biggest fucking smile on my face because they knew how much this guy irritated me.\n\n\nEdit: I forgot to mention, that he worked in plumbing….digging ditches for the plumbers.",
   "created_utc": 1691607794,
   "score": 15,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvh0kzk",
   "message": "A substitute teacher who always wore kilts (in the US) got fired for telling a middle schooler he’d date her if she was just a little older. I’m front of the whole class, mind you 🙄",
   "created_utc": 1691603743,
   "score": 18,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgm41s",
   "message": "I started working admits at a hospital, my coworker who was here for 2 years before me. She would take multiple muscle relaxers, drink a bunch of sugary drinks (diabetic and over weight) and pretty much put herself into a diabetic coma for a few hours. Passing in and out. It took me 4 months to get my supervisors to do anything about it. (They knew about this and witness it a year before I started) So finally I told them I was going to quit from the embarrassment and her not being dealt with and bam she was gone.",
   "created_utc": 1691598521,
   "score": 11,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgmp7g",
   "message": "He was caught watching porn. Was fired the third time it happened",
   "created_utc": 1691598734,
   "score": 13,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgqxgl",
   "message": "He worked on the packaging side of the plant where everyone wore this clip on the belt box cutters for easy access. He thought it would be funny if he came in wearing a full size machete",
   "created_utc": 1691600258,
   "score": 10,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgsl77",
   "message": "Looking at porn on his computer. The company at the time had closed door offices for everyone. I don't know exactly what went down, whether the idiot left his office door open, somebody came in unannounced, or what. But he got caught. \n\nI worked in IT at the time. I was asked by HR to get logs of his internet activity.",
   "created_utc": 1691600866,
   "score": 11,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgua4m",
   "message": "He admitted to killing any cats that walked into his yard...at a lunch table full of coworkers 🙄",
   "created_utc": 1691601484,
   "score": 9,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgv581",
   "message": "For slamming a bullet down on a woman's desk at work and stating 'this one's for you'. and this was twenty years ago before the world we live in today. Guy was a fucking idiot all the way around",
   "created_utc": 1691601796,
   "score": 6,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvh7c8n",
   "message": "This'll get buried but probably for the best. I will NEVER forget this happening.\n\nSo I think this was either 2002 or 2003, somewhere in there, working at a gamestop. There were two in the close vicinity, a strip mall store and an actual Mall store. Theory at the time was strip mall was for used/retro and mall was for the shiny new stuff (back when you could get NES/Genesis games at a gamestop)\n\nI worked at the strip mall store, but get asked if I want to be a 3rd key. If you don't know, think assistant assistant manager basically. I take the position thinking it's for the store I work at, but instead I get moved over to the Mall store... who already had a 3rd key. A store never had two 3rd keys so I was curious to say the least.\n\nI find out my first shift at the new position that I'm actually replacing the 3rd key who was being fired. Right now, in the office in the back. My eyes bug out a bit 'cause the dude was... unique, to say the least. Skinny as a rail, looooooooong black hair, brought a cube of Mt. Dew Code Red every shift and downed it all by the end of the shift (how was he skinny???). Kept his hair in a ponytail - this becomes important.\n\nI also find out the *why* he's being fired as the manager and guy-to-be-fired is taking... way too long in the back office for a simple firing. It was just after the holiday rush and during a super busy time an older lady wanted to buy Cabella's Big Game Hunter. Ex-3rd key says \"You don't want this, it's a terrible game\". The lady said her husband *specifically* asked for this *specific* game but the guy just trashed the game and literally would not sell it to her as many angry patrons were waiting behind her.\n\nNaturally he was fired. As I'm told this... they *still* haven't left the back office. It's dead as a doornail, an unstable guy is getting fired, *I'm* replacing him - I was a little worried when and how he was leaving the premises.\n\nFinally, dude comes out, eyes super red from crying, felt a bit bad for him despite breaking the one rule you have in retail: fucking sell things. He gets to the precipice where he's about to step from the store out into the mall proper itself, pulls his hair tie out while spinning to face the store - hair going everywhere - and yells at the top of his lungs:\n\nTHE LEGEND WILL NEVER DIE!!!!\n\nand... he just immediately bolts. Full pelt running for the mall exit. Never head from him again.\n\n(For reference, what he yelled is from the game series Soul Calibur)\n\nHope he's doin' better nowadays but honestly couldn't even remember his name. I remember how he left the store though, jesus christ!",
   "created_utc": 1691606195,
   "score": 24,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvhcple",
   "message": "I worked at a country club that doubled as a wedding reception/celebration location.  We had a lot of liquor on hand, and minus what was being used, it was all held in a room downstairs.  \n\nThis kid (he was a new hire and 18 years old) kept asking questions like when was the room downstairs restocked?  What was kept down there?  Etc.  I figured he just liked to drink (I’m from a small area with little to do)\n\nHe began to work and he was a great worker.  We were allowed smoke breaks so he’d go outside and smoke during every shift.  Turns out, he wasn’t going outside at all, but going downstairs and taking fifths of booze, packs of beer, and even some bottles of wine, one at a time.  It was discovered when our manager went to to monthly inventory and the missing product didn’t match the bar use records.  He got fired over like, $400 of alcohol 🤯 I wish he’d been smarter and not done that, but here we are.  😂",
   "created_utc": 1691608136,
   "score": 11,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvh6ugl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvhg6bs",
   "message": "I worked with a man who shared the same name as a world famous basketball player. He was named that name WELL after his namesake had risen to prominence, but importantly, was not named after him. On our third month of working together (cashier at Lowe’s hardware) he turned to me and said “I hate this job so much. My dad says I can’t quit, but he didn’t say anything about getting fired.”   What happened next will be seared into my mind until my last breath. He approached the first customer he made eye contact with. He said, simply “Hi! Is there anything I can help you find?” To which the customer replied “Just looking for your cement mix.” My friend answered “Oh, that is just down aisle 20. Can I help you pour it down your asshole?”\n\nThat was the day Michael was fired.",
   "created_utc": 1691609390,
   "score": 14,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvgqqoj",
   "message": "The sweetest, quietest, most conservative lady I've ever met turned out to be the biggest crook I've known. Her and a small group of people successfully defrauded hundreds/thousands of people of over $30 million through those bullshit CRA scam calls. She hid the money by buying multiple properties under other peoples' names and jewelry sales. Eventually she got caught and ended up on the news. I saw her walk into the office the next Monday (we worked together), and then walk right back out after talking to the boss. She never did any jail time even though she stole more money than most thieves do when they commit violent bank robberies.",
   "created_utc": 1691600189,
   "score": 10,
   "submission_id": "15me4oy"
  },
  {
   "comment_id": "jvguycz",
   "message": "He embezzled over 2 million dollars by creating fake business expenses. The company decided to not pursue charges to attempt to keep it on the down low. He then had the AUDACITY to ask for a reference months later lmaooooo",
   "created_utc": 1691601729,
   "score": 8,
   "submission_id": "15me4oy"
  }
 ]
}