{
 "submission_id": "15mfh5x",
 "title": "What’s the worst experience you’ve had with a roommate?",
 "selftext": "",
 "created_utc": 1691587988,
 "permalink": "/r/AskReddit/comments/15mfh5x/whats_the_worst_experience_youve_had_with_a/",
 "score": 109,
 "url": "https://www.reddit.com/r/AskReddit/comments/15mfh5x/whats_the_worst_experience_youve_had_with_a/",
 "comments": [
  {
   "comment_id": "jvg6cnp",
   "message": "Freshman year of college- she came back drunk night 5 and pissed on our carpet and some of my clothes. Then in the morning she denied all of it despite the room smelling like piss. She would have random guys over constantly and fuck them with me in the room (even though she had a bf). She ended up getting arrested twice during the first semester (she had painkillers that were not hers and she got a marijuana charge lmao). She was pure chaos and ended up in academic poor standing since she literally never went to class. The second semester her parents required her to come home every single weekend so it made things much nicer lol.",
   "created_utc": 1691592743,
   "score": 247,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg4e53",
   "message": "I called to ask if he had his half of the rent and he informed me that he was on I95, headed back to his hometown of Virginia.  Dude cleared his shit out of the apartment and dipped with no warning.",
   "created_utc": 1691591999,
   "score": 136,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg80o2",
   "message": "guy inherited $80K from grandparent. Start to buy 8 balls and bring various people back, including homeless people with obvious psychological issues. I moved out, and a few months later, i found out he was stabbed multiple times by one of these people...",
   "created_utc": 1691593373,
   "score": 45,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg07k5",
   "message": "Dude killed my pet rabbit because he was jealous of the time I spent with it.  Needless to say he stopped being my roommate that day.",
   "created_utc": 1691590355,
   "score": 108,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg7jbe",
   "message": "Shared a quad in college with a girl named Monica. She was fine in the beginning but then began doing things like hiding the toilet paper, trying to limit how much time we spent in the shared living room, allowed a homeless man to sleep on the sofa and hoarded cutlery. She decided she wanted to be a vampire and had her teeth filed into points.. at the end of the year we started referring to her as “Demonica “.",
   "created_utc": 1691593190,
   "score": 168,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg0009",
   "message": "I lived in a house with a guy who let his friend hide from the cops in our basement. The friend had shot and killed 2 people in a robbery.",
   "created_utc": 1691590268,
   "score": 136,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgevd8",
   "message": "I let my boss crash at my second apartment about 15 years ago. It was a shitty timeshare call-center where everyone did drugs and were pretty everyman types, so he and I were more friends than coworkers. Anyway he loses his apartment and asks to stay with me for a couple months while he gets back on his feet and I agree.\n\nHe's a great dude. Kind, smart, funny, confident, and a solid ~350 lb. I only mention the weight because it's relevant to the negative experience.\n\nSo around a month into staying with us, he decides to get clean from his crippling opioid addiction. He's decided to cold-turkey from a 20 a day 10mg hydrocodone habit, which (for the uninitiated) is pretty intense. I advised rehab, but he elected to lie on the couch in my living room for weeks (costing him his job), sweating his ass off and shaking under a blanket.\n\nThe reason why his size was relevant: he sweat a lot already, and had to take pains to mitigate his body odor on normal days (with varying degrees of success), but with the withdrawals and being mostly sedentary on that textile couch for weeks, the apartment started to smell like a hot ass-forest. It was a party-house with a revolving door, and people just kinda stopped coming during his tenure there. Even with my bedroom down the hall's door closed, the stench was pervasive.\n\nIt wasn't his fault, I liked the man, and he was trying to better himself and his life, so I put up with it. And he succeeded. Got himself a new place in the agreed time frame, stayed clean and everything was hunky-dory.\n\nAfter he moved out, my actual roommate and I carried the couch to the parking lot dumpster and it took several days to air out the smell. We even did a thermal fog with an oil-based cherry-scented counterfactant, and it still didn't help.\n\nKinda irrelevant, but just an addendum; we stayed in touch for a while back when I still had Facebook, and he got his life together. Got a good job as a realtor, lost a lot of weight, had a baby girl, found religion or whatever. Then after a few years of being off Facebook and radio silence, I get a call from my old roommate saying that he'd relapsed and died from a heroin overdose. Pretty fucked.\n\nRIP Don.",
   "created_utc": 1691595897,
   "score": 16,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvfz1rs",
   "message": "You know Sheldon Cooper from Big Bang Theory ? Exactly like that guy but no where near as smart, but condescending, insulting, with boundary issues. Was there for two months and had to get out, or would have ended up with assault charges.",
   "created_utc": 1691589883,
   "score": 11,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgaki2",
   "message": "I had one that would just straight up steal my stuff.\n\nOne that brought home 2 rats as pets, and we ended up with 29 rats in what felt like no time at all.",
   "created_utc": 1691594331,
   "score": 73,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgaebo",
   "message": "He was just really dirty. His clothes were everywhere, there were old cereal bowls just crusted and stuck, it was disgusting. But here’s the real kicker…\n\nMy other roommate and I had to “play mom” and tell him that if he didn’t pick his shit up, we’d throw it all away. He didn’t pick it up. So we went in there with a trash bag and started tossing everything in. When we lifted the mattress, one of those fake vagina sex toy things rolled out. Then, some fluid dripped out of it… \n\nWhatever the hell came out of that thing was so rotted that it made the entire apartment smell like something had died and the corpse was left for a few months. Clean roommate and myself had to open everything and leave for the rest of the day. The smell lingered for a few days after that.\n\nLast I heard of this dude, he was smoking a mixture of crack and heroin. Then stole some oil from the back of a truck. He’s been MIA since…",
   "created_utc": 1691594266,
   "score": 123,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvfwc5m",
   "message": "Lived in a house share for 7 years so have a few stories.\n\n2 that are tied for the worst.\n\nFirst was a guy who had skin issues, refused to get help, shed flakes everywhere, shower, sink, toilet. \nEnded up in the washing machine too when he did his washing, which ultimately ended up in everyone else's clothes when they did washing.\n\nI felt sorry for the dude, super intelligent, kind, happy and friendly. Just didn't look after himself.\n\nSecond was a guy who lied about his job, never went to whatever it was, and regularly got up during the early hours to randomly scream at the top of his lungs and bang all the walls, the floor and ceiling in his room to ensure it woke everyone up.\n\nHated the dude for this, and hated the fact he used my car as a bench when we went out to smoke. Would roll his eyes at me when I politely asked him to not sit on my car.",
   "created_utc": 1691588768,
   "score": 183,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg8usg",
   "message": "This crazy, entitled, hypocritical spoiled brat of a person I was assigned in a college apartment. Everything was fine until I offered to buy a wireless router for all three of us to share. She agreed to split the cost, but then when it came out to $20 each she threw a huge fit. She refused to pay, so I refused to give her the password. She got in my face and screamed at me, but I didn’t flinch (I’m a foot taller than her and I had just gotten out of the Army lol). Then she took all of her stuff out of the common areas. Whatever. \n\nOne day I needed to do dishes and her stuff had been in the dishwasher for days, so I finally just took it all out and put my stuff in instead. I came home to find all of my dishes in the sink again, covered in maple syrup. So petty and gross. \n\nAnother time, I accidentally threw a single can in her trash can instead of mine. She came out on the balcony screaming at me and threw it off the third floor, where it hit my car and dented it. \n\nThe final straw that caused me to move out early: we all smoked weed, including her and her boyfriend, but one day she called the cops on me for it. Thankfully I heard her on the phone with them, so I took anything incriminating and left before they got there. Most of it was my boyfriend’s anyway, but until then my place was cooler than his. I just left it all there until I was able to move.\n\nShe also got in huge screaming fights with her boyfriend and smashed his laptop and phone, so I guess I should’ve expected the worst from her.",
   "created_utc": 1691593690,
   "score": 1,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgh1ks",
   "message": "I was in a motorcycle accident and spent a month in the hospital. My roommate took my rent money and spent it on cocaine. I came home barely able to walk to find an eviction notice on the door. \n\nHe OD’d a couple years later. His 10yo son found him on their kitchen floor",
   "created_utc": 1691596683,
   "score": 18,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg5lnn",
   "message": "She never cleaned dishes and would leave them until they get REALLY moldy like multi color colonies that are 4 inches tall. Everybody used to do her dishes but then we stopped and kept putting them on her bed. To which she put the fucking dishes on the ground of her bed.\n\nShe was a proud alcoholic and would constantly cause issues around the house as well as lock other roommates out and barricade doors if someone made her upset. Baby shit.\n\nAND another different one the year after was some kid who was generally a nuisance but one night he got kicked out of a party and drove his car into a few other cars in the lot, a couple people, and drove right into an apartment complex busting the gas pipes so they had to literally move people out into hotels for a while. He turned himself in the next day.\nEdit: this was posted on Barstool which is I think a national social media page. I don’t wanna reveal location but don’t believe me u can find it. If you do, all these stories make a lot of sense based on location lol.\n\nAAAND another one was a guy who was kinda normal but one day he came home looking late for something and said “yo man I gotta go for a little while u can use my parking spot and can have girls over.” Either that night or the following day, I got a couple messages on Facebook asking if I was this guys roommate to which I said yes and they informed me he tried raping someone and threatened to kill because she didn’t put out and were asking if I knew where he went or what car he drove. Wild shit. I was trying to get out of my lease so damn bad after that. He was a menace to MANY girls who ended up posting all their messages and encounters to which they were all gross.",
   "created_utc": 1691592457,
   "score": 31,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgdrpd",
   "message": "She poisoned my food. She started out with \"harmless\" pranks like putting salt in my jello before it set. Then she put bleach in my pasta water like I wouldn't fucking smell bleach noodles. She would steal my underwear, wear them during that time of the month, and put them back in my underwear drawer unwashed. \n\nI spent YEARS fucked up. Being afraid of food and people. I already had a bad relationship with food because of my mom. This made it so I wouldn't eat at restaurants, or my friends' food they cooked to share, or eat anything that wasn't in a tightly sealed package.",
   "created_utc": 1691595493,
   "score": 166,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgdigt",
   "message": "My parents let a 21yo move in. He smells like shit, like sour shit. His room smells up the hallways, his food smells up the house and covers the kitchen in thick layers of oil which he smears around to “clean”, whatever he’s putting down the sinks turn them yellow, he pees on part of the toilet I didn’t think we’re possible to get to, not to mention all over the floor and in the shower without rinsing. He hits himself all day and night and shouts. I think he is mentally ill and he hardly speaks English (here to go to school, from china) and asks my parents for rides everywhere even though we are three blocks away from stores. Including talking them into taking him three hours north to visit his cousin even though there’s busses that make that route daily. He’s scared of the vacuum so our carpet is matted down in his room. He will stop what he’s doing to watch me go up the stairs. He’ll stands and walks inches behinds us while going up the stairs just to go back down again. He eats our food although it’s labeled and lies to our faces that he bought it while eating our food in front of us. He talks over me every single time I open my mouth. He lets my reactive dog out of my room and takes her on walks when no one is home and feeds her parts of everything he makes and yells at her when she begs for food or barks, “plays” with her by pretending to bop her on the head and grab her tail and paws. Tries to pick her up by her paws or hips. I can go on but I’m getting angry. \n\nAfter 8 months of asking him to get his shit together I’ve moved out. For my sanity and my dogs safety.",
   "created_utc": 1691595401,
   "score": 7,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg9ddi",
   "message": "To make a long story short.\n\nBest friend and his gf who I had been friends for years moved in with me. She wasn't the most mentally stable person but she tried. COVID happened, her bipolar started acting up and eventually stopped taking her meds. Cheated on my best friend and even made him driver her to the dudes place saying she was hanging out with a friend after work. She gets caught. Tries to end it ODing. We have to forcibly intern her in a state mental facility. Comes back semi stable for 3 ish months but my friend was devastated and losing it. They move out and break up within 1yr.\n\nThe manic period before interning her lasted about 3 months. In that time she stopped showering for up to a week at a time, kept yelling and berating everyone, started abusing adderall and started hitting on me and sending me suggestive pictures. It was fucking hell til she got kinda better and moved out. She was so dirty I ended up with a roach and ant infestation that took months to clear out.",
   "created_utc": 1691593883,
   "score": 165,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvghb7m",
   "message": "Him and all his friends raped a girl in our shared dorm when I went on a polo trip to Vermont. We weren’t room mates after….",
   "created_utc": 1691596780,
   "score": 136,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg2jr9",
   "message": "He shit on the carpet while making eye contact.\n\nStill a good boy though.\n\n(My dog)",
   "created_utc": 1691591276,
   "score": 142,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgnkbe",
   "message": "Dude kept falling asleep while smoking cigarettes.  I got mad every time and woke him up. He bought me a fire extinguisher at a yard sale one day. He thought it was best joke ever. He fell asleep on night on the couch. Cigarettes rolled off on to the carpet. Carpet caught fire, couch caught fire, his shirt catches fire. He never woke up. I woke up, having smelled it. Grabbed his gag gift and put it all out. His shirt and hair were GONE. He was okay. Never even went to the hospital, but he absolutely would have died of I hadn't been there and had that fire extinguisher beside my bed. I moved immediately.",
   "created_utc": 1691599042,
   "score": 237,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg850w",
   "message": "He got drunk with the neighbors then accused them of stealing his cellphone. Then he slashed their tires. I woke up to the neighbors banging on my door with guns but the little shit had already left. His cellphone was in between some couch cushions in my house btw.",
   "created_utc": 1691593420,
   "score": 94,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvghk6p",
   "message": "Fucking *Em* (not her real name)*.* The most aggressive \"zen\" hippy you ever met. She was all sunshine and flowers until you dared to, I dunno, asked her to do her goddamn dishes or pay rent on time. Then she would be screaming in your face. And it was never *her* fault, oh no; her energy was too *good,* it was *your* negative energy making her act this way, how dare you do this to her.\n\nWe were all relieved when she lost her job and announced she was moving back home...but apparently she didn't understand how a lease works until the landlord let her know she was still on the hook for rent if we couldn't find a replacement. So she started inviting creepy random guys into our home without letting the rest of us (all twenty-something girls), know what was going on or who they were (at the same time were actively searching for a replacement). She was apoplectic when we put a stop to *that* plan.\n\nYou were the fucking worst, Em.",
   "created_utc": 1691596871,
   "score": 143,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgmrr4",
   "message": "Dude told me my majesty palm tree was fine in the apartment common area after I asked him if it was cool. I was rinsing my dishes in the sink later that same night, and he barreled out of his room in full, unhinged temper tantrum mode, screaming I WANT ALL YOUR PLANTS OUT OF HERE TOMORROW YOU NASTY BITCH, started kicking/hitting my plants and threatening to throw them off the balcony. I was legit worried he’d try to throw me off the balcony next. This was a grown ass man in his thirties. Yeah I was outta there after that night. I live alone in peace with my plants now where they don’t get kicked",
   "created_utc": 1691598760,
   "score": 126,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgb61h",
   "message": "Two instances.  \n1) Had sex so vigorous on my couch that he broke it.\n2) When he moved out, I found piles of fireworks just laying under his bed.",
   "created_utc": 1691594550,
   "score": 123,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvfupqj",
   "message": "he smelled like shit all the time and i could never build up the courage to tell him",
   "created_utc": 1691588082,
   "score": 180,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgailh",
   "message": "Dude would jerk off in the shower and not rinse it down the drain",
   "created_utc": 1691594311,
   "score": 72,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgnqn9",
   "message": "First night in the new shared apartment I was renting, my landlord slept on the floor in my living room on a rug.  I thought that was weird but I was not in a position to argue, as I really needed a place to live.  Then, over the next couple of months, my landlord moved in and brought over 8 family members from Turkmenistan, including a newborn baby, and they all lived in 2 bedrooms (and by bedrooms I mean one was the living room!!). When I complained, they locked me out of the apartment.  I called the police who let me in and scolded the family.  It was a nightmare.  I finally got out of there and never looked back.",
   "created_utc": 1691599105,
   "score": 138,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg5r4x",
   "message": "Dude would jerk off at night... we had decided to bunk bed it so we'd save more room and I was on top bunk so you can work out how I found out about him choking the bishop. Bear in mind, I was on a year abroad placement scheme in Virginia coming from the UK where we typically have our own private rooms....",
   "created_utc": 1691592515,
   "score": 69,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgbnbj",
   "message": "She had loud sex with her boyfriend late at night (he wouldn’t even come over until 10 pm) and I had to be up for work at 4 am. They’d cook afterwards and make a lot of noise and a huge mess in the kitchen. Then when they finally went to bed, the dude snores so loud I could hear him through the shared wall. I tried ear plugs but they’d have sudden loud noises that would wake me up anyway. I don’t expect people to tiptoe around just because I’m in bed but I think asking people to use normal volume speaking voices is reasonable, yet I got yelled at for trying to break them up when I asked them to either be quieter or go to his place on work nights.",
   "created_utc": 1691594724,
   "score": 58,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg033v",
   "message": "Dude would jerk off in the bathroom and leave the door open",
   "created_utc": 1691590304,
   "score": 200,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvggoko",
   "message": "My best friend to this day.\n\nHe decided he wanted to invite some folks over and do shrooms for the first time. I wasn't a fan of a lot of people over but it was 4 ladies and I wasn't about to ruin a fun night for him. I was already with someone so I planned on just staying in my room and checking in on everyone from time to time.\n\nWell at some point I started hearing some wild ass sounds. I go into the living room and they had taken everything that was a circle and tossed it into a pile. Everything. I'm talking round fruits, pots and pans, lids to tubberware, all 100+ dvds I had, you name it. The amount of stuff that was broken sent me into one of those rages where you go from red to just gray. I went and stayed at my girlfriends place. The next day I get home and they were all fully naked asleep on the kitchen floor. \n\nHe still apologizes to this day and it cracks me up because it's always the same line. \"I still feel terrible but man to this day that was the best night of my life\"",
   "created_utc": 1691596550,
   "score": 163,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg7va9",
   "message": "I (f) let him stay with me because he was homeless. He would eat everything, not clean up after himself, and never paid for anything. He would always invade my personal space, try to kiss me, and even crawl into my bed. Finally I’d had enough and we went to puppy classes. He’s fairly well behaved now but still has no respect for my personal space.",
   "created_utc": 1691593316,
   "score": 164,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgdq4x",
   "message": "My roommate tried to commit suicide. \n\nIt has been 13 years and I am still traumatised by it. I check in on this person every once in a while to make sure they’re doing ok. I cant seem to stop worrying.",
   "created_utc": 1691595478,
   "score": 96,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg930g",
   "message": "He was a big dude, 450lbs big, I lived with him for a year during college. He would sometimes have 3-4 days off from classes and weekends etc, and wouldn't shower at all. He would sit on his computer and just stink up the whole apartment with his BO. Just absolutely awful.",
   "created_utc": 1691593776,
   "score": 64,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgn113",
   "message": "Me looking through the comments seeing if anyone is posting about the horrible stuff I did to places during my active alcoholism…..I want to make amends!!",
   "created_utc": 1691598852,
   "score": 110,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvglzgr",
   "message": "Take my clothes when I was at school or work, stain them, get bleach stains on them, leave them on the floor, leave cigarettes and lighters in the pockets.\n\nWhen I moved out, they were furious and said they hated where I was moving (too many traffic lights) and I needed to leave some clothes behind.\n\nIt was my mother and younger sisters.",
   "created_utc": 1691598476,
   "score": 74,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg7spx",
   "message": "One had 2 dogs that would shit in my room if I ever left the door open.  The other had two guinea pigs in the living room that threw hay and poop everywhere.\n\nBoth would cook and never do dishes, and never took out the trash.",
   "created_utc": 1691593288,
   "score": 32,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg4qgp",
   "message": "Dude jerked off with cooking oil",
   "created_utc": 1691592129,
   "score": 40,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgnxl7",
   "message": "In college I had two roommates in my dorm. One got so drunk one night, passed out and woke up and had to pee. Came over to my loft (raised bed that had a dresser under it and my desk). He pissed all over my dresser.",
   "created_utc": 1691599174,
   "score": 34,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgcdbb",
   "message": "Didn’t pay his share of bills- still owes me over a thousand bucks.\n\nFuck you, Adam (from 96-97)",
   "created_utc": 1691594985,
   "score": 67,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgmumj",
   "message": "He played Leage of Legends all night. If the game didn't go his way he would scream in frustration and beat his fists on his desk, no matter what time of the night it was. It was difficult to get a full night's sleep with him roaring and pounding every few hours. He would also eat at his desk and broke several of the dishes I had bought for the apartment during his little tantrums.\n\nIt gets worse though! Eventually he decided that he needed to be more alert during his marathon gaming sessions. Most people would invest in coffee or energy drinks, but no, he decided he needed to buy meth. He told us he was \"too smart to get addicted\", but at that point I decided I'd had enough and noped on out. I took what remained of my dishes with me.",
   "created_utc": 1691598788,
   "score": 63,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgo71z",
   "message": "I have a few but one really stands out. I was living with 7 guys in a 4 bedroom house in SF, 1 bathroom. Worst place I ever lived, covered in mold, rats everywhere, etc (was cheap and we were broke). Was actually super fun until \"Jason\" moved in. Jason must have been on the spectrum which I was sympathetic to, but it didn't make living with him any easier.\n\n* First night he came into the kitchen from a run wearing nothing but short shorts, grabbed my milk from the fridge, must have been 1/2 galloon in there, chugged the whole thing straight to the dome. Then put the milk back in the fridge and asked \"is there any more milk\"\n* Used other people's towels. When we told him \"this isn't an airbnb, we each have our own towel\" he stopped using a towel at all and just walked around buck naked dripping shower water\n* Ranted for hours, alternating between extreme delusions of grandeur (I am the greatest financier to ever live) and extreme self loathing (I am worth less than a cockroach)\n* Got kicked out of his coding bootcamp, presumably for behavioral reasons, so started walking around the house all day. When we would come home from work everything would be moved around, including in our rooms. Nothing ever went missing, it was just like he's been in our rooms and tried to make us not notice. To this day I shudder to think what he was doing in there\n\nIn the end we took the coward's way out. The rest of us just moved together to a new house and told him the lease was ending. He was only there for a month. He moved in on the first, and moved out on the last day of the month. He argued that - since he didn't *sleep* in the apartment the last day of the month he was owed rent back for that last day. We tried to explain that when you rent an apartment you pay the entire month, and when you leave you move out on the last day of the month. I was the master tenant at the time and wanted to just give him the $30 and be done with it, but another roommate insisted I shouldn't do that. He continued to email me for *months* calling me all kinds of horrible things.",
   "created_utc": 1691599268,
   "score": 44,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg834i",
   "message": "I was in a student apartment where one of my random roommates had his girlfriend living in his room with him for about 2 months. I did something to piss off the girlfriend, who tried to get me thrown out by lying to the Resident Assistant about some random thing. After I was confronted by the RA, they and the higher ups find out the girlfriend was living there illegally and both were evicted",
   "created_utc": 1691593400,
   "score": 50,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvghc5g",
   "message": "He tried to kill his girlfriend. Fortunately he got arrested that day and I never saw him again",
   "created_utc": 1691596789,
   "score": 29,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgct08",
   "message": "My roommate sophomore year of college smelled real bad of BO. I don’t know how. He’d shower every day, had air fresheners, did laundry frequently, and wore three different deodorants. I never said anything about it because I was sure he knew and was doing everything in his power to try to fix it.\n\nHe was a nice guy, I’m sure he thought it was strange that I’d leave our windows open in the winter claiming I was hot (plenty of times I actually was, but it had the added benefit of moving fresh air into the room).",
   "created_utc": 1691595146,
   "score": 29,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg8fik",
   "message": "One of my roommates worked for trugreen Lawn care and signed me up for service without my knowledge. We lived in a house and their was 4 of us.  Somehow he got the bright idea to steal some of my information and sign me up.  I owed hundreds of dollars to trugreen and they sent me to collections. \n\nI was pissed. I called trugreen and told them what happened after weeks of trying to get the problem solved and talking to multiple people they finnaly closed my account.  And fired my roommate.  \n\nWell then he lived there free loading for months.  I finally moved out of that place and never had a roommate again.",
   "created_utc": 1691593530,
   "score": 40,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg69oo",
   "message": "Never paid his rent always drank it",
   "created_utc": 1691592711,
   "score": 22,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgir9j",
   "message": "My cousin and her family.  They were DIRTY!  Couldn’t walk in your socks on the carpet because your feet would stick to the carpet cause of all the spilled soda and beer that she never cleaned up.  Her kids had lice so bad that one day I looked at the oldest girls hair and you could see the lice running around in her hair.  I lived with them for three months but moved out after I saw those lice.",
   "created_utc": 1691597307,
   "score": 26,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgluun",
   "message": "College roommate- we were in the same room (2 beds) for the first year.\nShe was extremely insecure and needed to have freshly washed and blow dried hair for every class.\nSo for her 8am class she was blow drying her hair in our room at 5am waking me up every week.\n\nI tried to have a talk with her saying hey it’s a loud blow dryer you’re waking me up and I’m tired all day because 5am is too early for me. Can you please blow dry your hair in the bathroom atleast?\n\n\"No!! The mirror isn’t big enough!!!\"\n\nWhat about using my blow dryer? It’s quieter \n\n\"No!! Mine is ionic and cuts down on frizz!!\"\n\nHow about doing your hair the night before so you don’t do it at 5AM?\n\n\"NO! My hair gets RUINED in my sleep!!!\"\n\nWell you know no one is going to notice your hair that much for an 8am class\n\n\"NO!! I notice my hair!!!\"\n\n\nHer solution was for me to wear earplugs in my sleep. I said no ear plugs will be able to drown out her loud blow dryer and besides they will just fall out in my sleep…\n\nAnyway she cried. She cried to everyone. I was evil. \n\nI tried to switch rooms saying it’s affecting my academic performance (it was). They refused saying we need to work together. The floor don talked to her and later told me she’s so insecure about her hair probably because she is not healthy (she was alluding to her weight/obesity)..\n\nAnyway let’s just say I was excited to move out at the end of the year",
   "created_utc": 1691598430,
   "score": 41,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg9xg2",
   "message": "Their drug dealer boyfriend basically moved in and we started having people turn up to buy from them",
   "created_utc": 1691594090,
   "score": 21,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgolil",
   "message": "Me and 3 of my friends were moving out of the college house we lived in for 3 years and another roommate who is one of my friends friends from high school and moved in the year before; we’ll call him B.  B was supposed to be driving up that morning to help us and said he’d arrive at about noon.  \n\nMy 3 friends and I start packing everything up at about 11.  I also have to add that this house is *fucking disgusting*.  Like college house for 3 years without more than a mediocre cleaning after a party kinda of disgusting.  It was horrific, but we power through it.  It’s also above our garage, so you have to go down a flight of stairs to get out and it’s summer.\n\nNoon comes around, then 1, then 2, then 3, still no word from B.  No texts.  No calls.  Zero communication.  We clean out all the little things, move a 5-piece wrap around couch down the stairs, move all the tables, chairs, plates, silverware, every bullshit knick-knacks that made it into that house those 3 years.\n\nWe get finished at about 7 and we’re fucking exhausted.  We were all talking together about how B wasn’t there, so we were obviously going to leave him something to do since we did everything else.  Well, it’s almost 8 now and B finally shows up, like “oh, you guys are finished”.\n\nSo, we basically say, “yeah, no shit, we’ve been here since this morning.  We left you the cabinets (minus plates and silverware, it was basically just cereal boxes and some bread) and the two fridges to clean out since we did everything else.  He said “cool” and we all leave B in the house.\n\nFast forward a couple weeks, we get a notification from our property owner with about $7,000 in fees to us.  We request pictures of exactly what the charges were for.  When we get the pictures, turns out B decided he was going to get the stuff from his room and just fuck off.  Doesn’t empty the cabinets or drawers or fridges.  \n\nThen, one of my roommates sees a picture of his room with 8 trashbags piled up in the middle of his floor.  Naturally, he’s like “wtf, those aren’t mine.  My room was completely empty.”  Which we all agreed was the case.  I see one of the trashbags is open in the photo, zoom into the bag, and what do you know!  There’s a box of granola bars that B special orders to the house.\n\nI have to assume $1,500 of charges and get my credit score tanked because the fucking asshole was too lazy to empty the fridges and cabinets and wanted to say “fuck you” to my roommate for leaving him work.",
   "created_utc": 1691599415,
   "score": 31,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgdka9",
   "message": "I was in college. Was sleeping and heard a banging on the door. I had just woken up and hadn't heard anything said, just heard the banging and figured my idiot roommate locked himself out or something. I dunno. I was woken up by banging. I got up and unlocked the door and opened it a bit before walking away without looking at all. I was groggy and young and had it in my head that it was just him. Suddenly there's a flashlight on me and I put my hands up. It was the cops. Apparently, my roommate was shooting bottle rockets at the neighbor's house with his friends and came back into the apartment to hide in his room while I was sleeping. Fuckin idiot. At some point later on after we weren't roommates anymore I found out he had been charged with a hit and run and sexual assault. Not sure the specifics and I doubt they were at the same time. He was that kind of guy. I spent most of my time out of the apartment when possible.",
   "created_utc": 1691595420,
   "score": 23,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgnkrf",
   "message": "a family of three came to my apartment and told me that the other roommate had invited them to stay at our small apartment for an undetermined period of time.  Roommate didn’t discuss this with me beforehand.  She was away on a month-long vacation.",
   "created_utc": 1691599046,
   "score": 21,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgb290",
   "message": "2006, college dorm. mf used my computer and email to send messages to a girl he crushed on and creeped out … but as me. Dude was completely insane and ended up getting expelled 3rd or 4th semester for similar shit.\nI actually think he did it again in 2011, even worse ruining my marriage. same sorta shit, someone posing as me online.",
   "created_utc": 1691594512,
   "score": 23,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgkz2l",
   "message": "We were roommates and he notified me his female friend bought a 2 family building and told me he's moving out and I could move with him and continue to be roommates if I wanted to. I agreed and we made the move. We lived and the first floor and she lived on the second floor. Well about a month or two of living at the new place me and the landlord (his friend) started hitting it off. Once he caught wind he was really upset.  Would pretty much ignore me or or act shitty towards me. He would slam cabinets and doors. Would park all fucked up in the driveway so nobody else could park. After I started spending nights upstairs he told me I should just move upstairs so he could be roommates with someone else. Which I declined to do because I didn't know what was going to come of my relationship with her and if it didn't work out I didn't want to be out of a place. I always paid my rent and my share or utilities etc so he essentially had the whole apartment to himself. Well fast forward 6 years, me and her bought a house and have a child together and are still going strong. So all his shitty behavior was worth it to endure.",
   "created_utc": 1691598113,
   "score": 33,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgl0qv",
   "message": "I roomed with a couple that hid their pregnancy from me until I signed the lease. \n\nThey knew they were expecting but also knew that nobody wanted to live with an infant. It was another 5 months of living there after it was born. \n\nThey were the worst fucking roommates beyond that, too. That was just their biggest offense.",
   "created_utc": 1691598129,
   "score": 34,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg97np",
   "message": "Which one? Worst - probably the guy who I knew for 3 years from my college program (we had several classes together, since the program was relatively small, so I spent 5-10 hours a week with him at minimum). \n\nMoved into the house he was renting, along with one of his coworkers (female) and a non-close friend of his (male)\n\nFirst week was fine.\n\nNext weeks were a huge problem.\n\nNot only was he a raging alcoholic (apparently high functioning, and my first experience with a high functioning alcoholic) but was also into HARDCORE drugs (heroin, coke, who knows...the basement party he threw was so extensive...there's just no way to tell.)  We all decided that we were leaving and scrambling to GTFO of that house. \n\nHe turned crazy when he found out, threatened us with violence (cornered me int he kitchen while his hands were on the knife drawer, took a swing at his co-worker while they were at work, he was reprimanded but not fired and corporate decided to just make sure they didn't work together) \n\nWhile we were searching his room (yes, illegal but desperate) for our leases...we found out he was stalking several girls. Took pics of everything (2002...so film cameras, not digital) and took it to the police with evidence of everything...they sort of shrugged and said \"Since it's not you, nothing we can do.\" \n\nI found a house with vegans and just cut it and ran in the middle of the night while he was out at a raging party. \n\nAll of this took place within a month and it was crazy, he was crazy and I hope he got help.",
   "created_utc": 1691593823,
   "score": 31,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvg8x59",
   "message": "A lot worse things could happen, but the guy left dirty pots and dishes in the sink for days until a whole ecosystem of fruit flies and whatever else would develop. I usually resorted to cleaning it up myself.",
   "created_utc": 1691593714,
   "score": 15,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgdiju",
   "message": "Guy got drunk and threatened to kill someone every weekend, I was the target my first night. Then got even more drunk and chatted your ear off for hours, even switching languages sometimes",
   "created_utc": 1691595402,
   "score": 8,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgnb2c",
   "message": "They turned off the heat in December in a very cold city.",
   "created_utc": 1691598951,
   "score": 8,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgns1v",
   "message": "This is a few years ago, Smoked weed 100% of his waking time. Despite the rest of the house working or studying or both, his waking moments were between about 3am and 10am. His waking activities consisted of playing music loudly or playing games loudly, while smoking weed. Despite never contributing to the costs or cleaning of the living room and the consoles, TVs and sofas in there,  demanded that nobody else use them when he was asleep. Never cleaned, only ordered food in. Repainted his room black (against the tenancy agreement) and the room was completely covered in trash, takeaway boxes and cans of soda  Ended up getting arrested for banging a 14 year old. When we cleared his room out every bit of storage, wardrobe, drawers, under the bed was filled to the brim with takeaway containers or empty cans. His wardrobe was so full of trash, he had nailed the door shut. The smell was fucking vile.",
   "created_utc": 1691599118,
   "score": 20,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgotmt",
   "message": "I had a long term friend from middle school and high school that ended up living all over our state and eventually got married  and settled down in a mobile home with an extremely abusive person. had a couple of kids and then he beat her so bad that he went to jail. while he was in jail she moved to her moms who is a meth addict and crazy. i had just got divorced so my house was empty so i let her and her kids move in. I knew she did not have a job and was unemployable but she got government assistance and the agreement was that she bought all household food and she asked me monthly for stuff I would like for groceries and bought it for me.\n\nshe ended up starting to date a really nice guy who I liked. he came around a lot. i was hardly home due to work but i would get home at 2 am and see his car there and smile because she deserved to be happy. until her ex got out of jail and found out she had a boyfriend that was helping take care of his kids. This guy was bad news. we dont know how but he found out where she was living. and that she was living with me. he sent pictures of her boyfriends car outside my house to her phone stating that if she didnt go back to him that he would hurt her boyfriend AND anybody that lived in the house. that included myself and my daughter who is in elementary school. \n\nThis prompted my roommate and her boyfriend to pack up all their belongings in 12 hours and move across the county to a state that she only disclosed to me since she trusts me and dropped her phone in a town many states away from me and where she lives now in case he could track it. since then I have had city police, sheriffs deputies, and CPS show up at my house looking for my roommate since the abusive ex only has my address to report to. ive explained the situation to authorities multiple times and each time they say they agree with my roommate and refuse to ask me where she moved to so its not recorded on their body cams just in case but they are required to come ask when a wellness check is requested. i probably still get visits every 4 months or so.",
   "created_utc": 1691599496,
   "score": 19,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgbwti",
   "message": "I've had a few. \n\nFirst one was a guy that was smoking meth in the garage. Came home one night and he and an actual prostitute were there going through the fridge and eating all the food. He later told me they'd eaten the turkey bacon raw. Gross. \n\nLiving with me and the meth head was an obese woman. She was so big she didn't fit on the toilet. I came in one time to see she'd shit all over the toilet seat and didn't bother to clean it up. When she left she dumped soda all over the carpet and claimed she couldn't pay the last 300 bucks in rent because her mother had died. A quick scan of social media showed a woman that looked very much like her addressing her as daughter. When i called and left voicemail on ALL mailboxes at her new job asking where I could send flowers for the funeral, she coughed up the last of the money. I may also have let it be known I'd happily tell her new office that she'd previously been arrested for drug possession, something she hadn't actually disclosed on her application. \n\nLast one was a doozy. She had schizophrenia and was having an active break during the last few months she lived in the house with me and my roommates. First, her seasonal job ended and her lie about having a job lined up became apparent when she slept for a month straight. Literally. No one saw her exit the room for a month. Not even to use the bathroom. When she finally emerged she began... sleep walking? Talking? We heard her grumbling about my gf at the time, who would often stay over and helped with some of the bills (schizo balked at being asked to chip in for the toilet paper and other food/drink items she was using but not buying). One of my large cooking knives went missing and we found it amongst her stuff in the garage. She had a crazy break one night when I'd had some friends over for a movie and some drinks. She was spying on us through her door and running back and forth from her room and the bathroom, then running to the kitchen to write cryptic messages. It ended with us being thoroughly freaked the fuck out and locking her out of the house while she screamed at us. Then she went around banging on people's windows. We finally unlocked the door and barricaded ourselves in our bedrooms until morning. \n\nI'm so glad I live alone now.",
   "created_utc": 1691594820,
   "score": 32,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvfza7o",
   "message": "There was once at a summercamp a guy who asked me if I wanted to share a room with him and I said yes. He asked me several times where I came from, he even asked wich school I went to. The last day we needed to clean our room and pack our things, then suddenly I saw that he had a bag in his hand from the same school where I've been my whole life! This guy just knew the whole time that we came from the same highschool/college and didn't tell anything. \n\nThe next year I saw him several times at school, but never talked to him anymore.",
   "created_utc": 1691589977,
   "score": 17,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgeviq",
   "message": "Had this roommate while I was married. \n\nDude would aggressively physically and verbally attack our youngest female roommate relentlessly, ate up tons of food, never paid for any of it, oh my God the messes he would make were epic. Of course he never cleaned any of it up. Destroyed furniture and carpets, even left a huge puke stain on the dining room wall once. Left his body scrap everywhere, hair, slobber and snot, nail clippings, anything he dropped or spilled. At least he would bathe on the regular and didn't stink. Constantly in our faces and demanding as fuck, he did not have a single clue what boundaries and personal space were. Walked around in the house naked, right in front of us any old time without a care in the world. Literally screamed in our faces whenever he wanted something, then would attack us or our other roommate out of sheer petulance when we said no. Would have daily fits where he crashed around the house, knocking things over and screaming his head off, usually more than once a day. Medication and stuff didn't do shit for his atrocious behavior. \n\nFinally I got a divorce, moved away and Dude's behavior improved dramatically when he was the only cat in the house. I kept him until he died at 14 years old.",
   "created_utc": 1691595898,
   "score": 41,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgmhv9",
   "message": "there's this group of men in their 30s who are still completely incapable of doing ANYTHING to clean up after themselves, and some have absolutely no effective way of handling the response \"no\".   \n\n\nWorst of the worst was a dude who would have literal melt downs when I told him how his constant apologies for ... not cleaning up a single fucking mess he ever made, ever... were no substitute for not changing his behavior. I couldnt even make it more than a couple words in until he raises his voice and gets really upset to defend his behavior with \"Wow, dude. Wow really?!\" ... 2 altercations later of this absolute 9 year old bullshit and I kicked him the fuck out. Best interaction I ever had with him was kicking him out",
   "created_utc": 1691598660,
   "score": 22,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvfv5h2",
   "message": "She stole some of my clothes and ate some of my food",
   "created_utc": 1691588268,
   "score": 8,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgkrrt",
   "message": "Repeatedly phoned me to threaten my life if I did a thing like\n\n\nClose the front door",
   "created_utc": 1691598039,
   "score": 8,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgotqi",
   "message": "My roommates made me do all the chores, refused to hang out with me unless I cooked for them, and then sent me long winding texts begging me to move out for being \"toxic\"",
   "created_utc": 1691599497,
   "score": 6,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgh1va",
   "message": "My roommate, currently, whom I've asked to leave, is just the worst. \n\nDoesn't clean up after himself to the point where he will unwrap something on the counter and leave the trash there above the trash can. Won't do his dishes. Won't wipe down the counters or the sinks. This is just mild shit. \n\nRepeatedly has eaten my food to the point where my boyfriend will instacart me the same food to calm me down and he has eaten that. He's never once offered to repay me and has never even apologized for doing it. \n\nHasn't cleaned his bathroom in months. He dips and there's a line of brown spit from the ground, up the side of the tub and into the tub in the exact trajectory of him spitting his dipspit into the tub from where he's sitting on the toilet taking a shit.\n\nHe has a dog that spends 75% of its life in a kennel because he won't take it with him when he leaves the house. Won't walk him. And overall doesn't feed or water him. I'll let him out but the dog is so ill mannered I can't do it for long.\n\nHe has taken my belongings and broken them and thrown them away and never said a word to me or straight up lost them and I'm pretty sure has also sold my stuff. He had my hedge trimmers for like weeks in his car. He wasn't even trimming my hedges so like??? Why? He takes my drills and other tools. \n\nI had an engagement ring from my dead fiance I kept in a particular spot in my garage because I didn't want it in the actual house. He \"cleaned\" the garage and when I went to look for it I couldn't find it. I finally asked him and he had hidden it in my spare bedroom closet all the way in the back of the house? \n\nRecently he had a girl over for the night so he took 1.5 days to clean out his bedroom in which he is still using my sheets and bed linens I let him borrow over a year ago when he moved in. I'm pretty sure that was the first time they had been washed. He did 5 loads of laundry and left the lint on the ground in front of the dryer. All 5 loads of lint. He had to walk by a trash can 7 feet away from the door to the laundry room/ garage in order to get back into the house. \n\nConstantly sponges off people and makes plans knowing he doesn't have any money and won't say it until they are about to pay or order so then it's awkward for everyone.\n\nOne time he went on a camping trip and I told him he could have a can of freeze dried food to take with him because my ex was a prepper and had 18 large cans of freeze dried food. When he came back from camping he told me the food had been good and instead of buying food from then on he just started eating the freeze dried food. He went through 12 cans before I found the rest and hid them.\n\nAll in all he's just truly a slob of a human being. I finally told him to gtfo. I'm a female and I just can't live like this. I don't need it spotless but I cannot live in literal filth. I would leave his trash on the trash can lid and he still wouldn't throw it away. \n\nI told him off about him eating my food and being disgusting and how I wasn't his mother and I was tired of cleaning up after him and he never even apologized the only thing he's said to me since was that he needed my email  for a rental application. He's in law enforcement which is mind blowing that he thinks this is reasonable. He still continues to leave his trash and dishes everywhere and has just taken it upon himself to not do anything around the house including things like putting the trash out, wiping down the counters when something spills. Coming home and taking care of his dog.\n\n I've confronted him before and he's specifically played the victim for everything. If he leaves something out it's, well you do too. If I point something out, I get shit back for something else. There's no owning up to it. Did I mention I also own this house?",
   "created_utc": 1691596686,
   "score": 18,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgbh7u",
   "message": "We had a true roommate floor plan where we each had our own full bathroom yet she *insisted* on shitting in the half bath downstairs between the kitchen and living room because she didn’t want her room to stink.",
   "created_utc": 1691594662,
   "score": 5,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvge2cp",
   "message": "Asked if I could switch dorms so his brother can be his mate, checked out the other room and it was so dirty you couldn't see the floor and it stunk like a generic boys locker room. Poor guy was stuck with 2 offensive linemen. \n\nTold the dude no thanks and they spent the semester threatening me and always waking me up in the middle of the night with keys or turning on the lights, playing music etc. At like 12-2am when I had 5am practices every morning. \n\nThey apparently talked about jumping me to their group of friends who happened to include a mutual friend on my friend and they let me know. I was able to switch dorms to another building and the RD made sure they couldn't move in together. They both lost their scholarships the next semester for bad grades.",
   "created_utc": 1691595601,
   "score": 5,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgeiko",
   "message": "My roommate in the barracks in the army was disgusting. He would sleep in his Physical Training (PT) uniform (the uniform we exercise in). Then, when he woke up, he would go to PT and exercise and sweat. After that, he would not shower, he would put on his daily uniform and leave his PT shorts on as underwear. At the end of the day he would get back down to his PTs for the evening and eventually going to bed. The only difference on non-workdays was that he wore his civilian clothes over his PTs as underwear. He also would not brush his teeth because he believed that if you brush your teeth you destroyed their protective coating (plaque) which is what forced you to continue brushing your teeth, the rest of your life.",
   "created_utc": 1691595765,
   "score": 5,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgookj",
   "message": "Does my ex husband count?",
   "created_utc": 1691599446,
   "score": 5,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvh8puo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvguen6",
   "message": "He allowed his homeless friend to move in without my permission and didn’t tell me. After several weeks it became clear that he wasn’t going anywhere. This man would be super loud on Xbox live playing video games until 4am. He would leave awful messes in the common area. I assumed that my roommate didn’t want to tell me he was gay, and I felt uncomfortable confronting the 6 foot 5 300 pound man in my apartment sleeping over every night. Eventually I said something to my roommate, and he said “what do you mean, he does pay rent!” Apparently he thought it was fine to let his friend move in and split their part of the rent 50/50 without even talking to me about it.\n\nThen I overheard them talking, and after finding out I was trying to get this guy kicked out, he said that he was going to take care of me by “putting something in the jug of sweet tea I had in the fridge”. I moved out the same day and filed a police report.",
   "created_utc": 1691601531,
   "score": 7,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvh3bfs",
   "message": " Guy got home before me, invited his friends over, they went into my room and took my 60 inch flatscreen my Xbox One X (new at the time) and all my controllers and games and had half my shit scattered across the living room floor when I walked in the door from work. They were eating pizza and the controllers were literally *shining*. Needless to say, I got everyone *THE FUCK* outta my house that day.",
   "created_utc": 1691604739,
   "score": 7,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvh7zah",
   "message": "Came home to our power being shut off because the roommate we gave the money too wasn't paying the bill. Thankfully her mom paid to have it turned back on for us. The roommate was spending it on drugs with her new bf.",
   "created_utc": 1691606427,
   "score": 8,
   "submission_id": "15mfh5x"
  },
  {
   "comment_id": "jvgoqa6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15mfh5x"
  }
 ]
}