{
 "submission_id": "15mgjjc",
 "title": "People who’re still against sex before marriage, why?",
 "selftext": "",
 "created_utc": 1691590450,
 "permalink": "/r/AskReddit/comments/15mgjjc/people_whore_still_against_sex_before_marriage_why/",
 "score": 95,
 "url": "https://www.reddit.com/r/AskReddit/comments/15mgjjc/people_whore_still_against_sex_before_marriage_why/",
 "comments": [
  {
   "comment_id": "jvggp4c",
   "message": "My cousin is very religious. He met a girl in January, proposed in February and married in June. No one in my family will admit it but I’m pretty sure they moved so fast because they’re horny lol",
   "created_utc": 1691596556,
   "score": 112,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvg6gt8",
   "message": "Because you'll hold up the ceremony. All the guests are waiting patiently.",
   "created_utc": 1691592786,
   "score": 52,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvg7btw",
   "message": "personally im not against it\nbut i know someone that is. and she said she personally wants to share that experience only with one person in her life and wants to be sure that theyll be together for ever, so she wants to be married befor.\nwhat was interesting to me was that she said she wouldnt mind if her then husband would have not waited. \nits just her preference.\ni dont share that opinion but i understand her point of view",
   "created_utc": 1691593111,
   "score": 125,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgca8l",
   "message": "[deleted]",
   "created_utc": 1691594954,
   "score": 220,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgj93e",
   "message": "I WAS against sex before marriage, but no longer am. My husband \u0026amp; I were pretty religious while dating, so we waited until marriage. I’m sad about the missed “opportunities” we had lol. It was extremely hard waiting the 5 years we dated and then having to turn off that part of your brain once you are married is weird. We’ve been married 7 years now and I still feel a sense of anxiety like I’m “sinning” when we’re intimate. It definitely messed my subconscious up.",
   "created_utc": 1691597489,
   "score": 175,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvg76py",
   "message": "My reasons were religious mainly. On top of it, I find sex to be very exposing and something to do when I feel safe and close. I never wanted a relationship built on sex or physical and that only. I wanted to build a relationship on trust and communication first and physical second and that boundary helped me do that.",
   "created_utc": 1691593057,
   "score": 96,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgc7hs",
   "message": "Redditors try to respect other viewpoints about relationships challenge (impossible)",
   "created_utc": 1691594927,
   "score": 168,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgws66",
   "message": "I'm religious, but I try not to be an asshole about it.\n\nNo sex for me doesn't mean no sex for thee.",
   "created_utc": 1691602385,
   "score": 61,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgpbe4",
   "message": "As a woman, setting boundaries helped me find quality men who were interested in me as a partner instead of just sex.\nPlus to me, the key to a successful marriage has more to do with communication and the ability to resolve conflict rather than sex. It's worth it to focus on building up those skills instead of a sexual relationship which is often built on infatuation.",
   "created_utc": 1691599673,
   "score": 124,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvh61kc",
   "message": "I know Reddit hates it when individuals have personal beliefs but I’ll give you an honest answer. \n\nBecause I’m religious and I literally believe that God said not to. If you’re not religious or your faith does not hold to that particular belief, all the power to you. I’m not going to be a dick about it if we don’t have the same beliefs.",
   "created_utc": 1691605724,
   "score": 147,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvg8muj",
   "message": "I’m just against marriage.",
   "created_utc": 1691593607,
   "score": 100,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvge3vm",
   "message": "I had a friend who was planning on waiting until her wedding night (fiancé was more religious than her) but then got it in her head that **the hottest thing in the world would be to convince her “true believer” fiancée to fuck her the night before the wedding…after waiting two years**.\n\nIt took some work, and alcohol, but she did it. Apparently it was amazing, despite the lack of experience, because the “forbidden” aspect got both of them all hot and bothered.\n\nThat and they were both really, really horny.\n\nEDIT: To be clear, they each had two glasses of champagne.",
   "created_utc": 1691595617,
   "score": 49,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgovjk",
   "message": "I waited, and am glad I did. Our relationship was based on respect, friendship, and communication. Things you will need throughout your relationship and life. I am an anxious person, and I never had to worry about STIs or unwanted pregnancy. \n\nAdmittedly, it did take us a while to get things down, but currently have an active and fulfilling sex life. Married for over 10 years and grateful every day for him. \n\nIt worked for us, but I’m not saying it works for everyone.",
   "created_utc": 1691599515,
   "score": 126,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgalpc",
   "message": "It trains you for the realities of marriage and prepares you for many more years of not having sex",
   "created_utc": 1691594344,
   "score": 12,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgfsi3",
   "message": "From my voluntarily abstinent-till-marriage friend she says it forces your relationship to be 100% based on anything but sexuality and if you can hold things together without sex then you're likely to last to the classic of 'till death'.\n\nBeing able to love someone unconditionally purely based on things like personality, morals, and shared values seems like a great thing. \n\nGranted I've personally only seen it result in divorce, domestic violence, adultery, and spontaneous shifts in sexual orientation but on paper the idea makes a lot of sense. Like making sure you're friends before you start seriously dating just taken to the next higher level.",
   "created_utc": 1691596228,
   "score": 159,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgbdrr",
   "message": "Even if you ignore the religious/moral arguments, waiting poses far fewer risks of STDs, unwanted pregnancies when you’re not ready for a kid, and even just avoiding regrets if you break up before getting married and wish you hadn’t slept with them.",
   "created_utc": 1691594627,
   "score": 128,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgd2px",
   "message": "Mainly because there are so many issues with hookup culture. You can have unplanned pregnancies, STDs/STIs, allegations of sexual assault (true or false), and mainly because it's a way for two people get closer. It's hard to do that when you barely know the person.",
   "created_utc": 1691595243,
   "score": 71,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgy8g7",
   "message": "I'm not so much wait until marriage, but completely in the wait until serious committed relationship camp. Sex is very intimate to me, and I'd like my partner to share that value. No shame to those that are into more casual relationships, it's just not my thing.",
   "created_utc": 1691602906,
   "score": 7,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgd65o",
   "message": "I grew up believing no sex til marriage largely due to the late 90s-early 2000's church youth \"True Love Waits\" push.  It was THE thing to do during those times.\n\nMy now-wife and I both were brought up the same way.  We got married in our late 20s.\n\nI'm over 40 now, and realize it was a mistake.\n\n1. It's actually created friction between us.  My wife was taught that sex is bad, stay away from it, etc etc and even after marriage to this day, she struggles to shake that mentality that was enforced for so long.  We were lucky to do it twice a week even early on in our marriage.  And even now, maybe 2-3 times a month.  To be fair, we have small kids and they do take up a lot of energy.  But overall, it has taken a huge toll on our marriage.\n2. In the Bible, the apostle Paul is the one that pushes for it.  He was single, never married.  Think about that.  It's like getting marriage advice from someone who never got married.  But for some reason, it's embraced by the church because it's in the Bible.  Think if any non-married celebrity gave marital advice and how well that would be rejected by the church community.\n3. Bottom line:  you are gambling on a huge important and vital part of your relationship, hoping you two will have intimacy.  When you're \"waiting\", you generally try to stay away from the temptation.  So if 0 is you're not in the mood 50 is you're kissing and 100 is you're inserting, you generally stay way from 70s/80s, if that gives you a visual.  By not doing that, you are removing something very natural and hoping that everything will be fine.\n4. Many of the same people that preached those movements in the late 90s and early 2000s have recently come out to say how much of a mistake it was to do so.  They are against it now.\n\nI will not be teaching my kids that at all.  I don't want them going through what we went through.",
   "created_utc": 1691595278,
   "score": 230,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgkcan",
   "message": "Throughout most of my life I was very adamant that I was not going to have sex before marriage. Not necessarily because of religious reasons, I was raised catholic but am not very strict about that. I simply think that sex should be done when there is love and commitment because it’s sharing your body with someone and that’s a big deal to me. It also comes with a lot of risks so I just wanted to be in a stable and loving environment before I did that. I dated guys through high school and college but never slept with them and I was in a few long term relationships. In hindsight, they were not great boyfriends and I’m so happy I wasn’t having sex because if I had done that with them it would have made everything so much more complicated and it would have made their impact on my life so much larger. However, 3 years ago I met my bf and decided not to wait for marriage. The love is there and it just felt right. I’ve not regretted it. Although, if he and I were to not work out, I think I would go back to not having sex until it felt right and stable. I couldn’t do casual stuff.",
   "created_utc": 1691597884,
   "score": 31,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvg763x",
   "message": "Hah! I know a couple of my friends who loved someone while in school and got married to them later, and didn't have sex with anyone including their partners until they got married. Their love wasn't based on sexual fling but rather emotional, understanding and personality. Happily married.",
   "created_utc": 1691593050,
   "score": 109,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgnswl",
   "message": "I find that the definition of \"sex\" is different for people that won't have sex until marriage. I was dating a Catholic girl, and by date three I went to undress her, and she said \"I'm a virgin, and I'll stay a virgin until marriage.\". My face must have looked as if someone I loved died. She then said \"So I'll just blow you, and then you can stick it in my butt and we can do anal until you finish.\".",
   "created_utc": 1691599126,
   "score": 28,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgebsj",
   "message": "Man named “marriage” 😳",
   "created_utc": 1691595697,
   "score": 52,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvglna7",
   "message": "My wife and I waited until marriage. Once she married her first husband we were banging on the reg.",
   "created_utc": 1691598354,
   "score": 47,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvghni8",
   "message": "Redditors don't get mad at people that want to save themselves for marriage challenge (impossible)",
   "created_utc": 1691596905,
   "score": 92,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgt22x",
   "message": "I think that, for some people, first-time sex can be a heavy experience on a variety of levels, and they’re just not wired to just screw and walk away.",
   "created_utc": 1691601037,
   "score": 22,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvga2vd",
   "message": "The amount of disrespectful jerks in this comment section is concerning, just let people believe in whatever they want to, if it's for religious reasons, then leave them be, if i wanted to read your top 10 reasons why religion is evil i would've asked, seriously tho, leave people alone, if you criticize christians for being too intrusive in people's lives, just so you know, you're doing the exact same thing.\n\nAs for the awnser, well, it's part of my religion, but not only that, sex has never been a priority to me, so it's pretty easy for me to just not have it, and i probably will never understand why people find it so important",
   "created_utc": 1691594146,
   "score": 207,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgeen7",
   "message": "You do it your way. I won’t stop anyone else but I can share my experience. Finding someone who knows you fully and has committed to you for life in spite of your shortcomings is quite intimate. Religion played a role for us but it was a decision we made independently before meeting and recommitted to almost immediately into dating. \n\nA mentor told me once if you don’t fall in love with the person for their brain, personality, and enjoy spending time with them you’ll be left very empty in life. 99% of marriage is that. hanging out and doing life. Some day you’ll both be old and wrinkly and you still will spend all your time with them. \n\nAt the end of the day, you can do what you please. Plenty of people from my religion have sex before marriage. A majority regret it and the shame stays with them a long time. I also have people who have saved themselves and feel dirty.",
   "created_utc": 1691595725,
   "score": 41,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvgik8j",
   "message": "My wife waited for personal and religious reasons which is fine. I did not. It is just a choice after all, however after years of marriage we have come to realize we got extremely lucky with sexual compatibility/personality. The question isn't whether sex is good or bad, because any good marriage will have each person learning how to please the other. The issue is if you fundamentally want different things in the bedroom. Which of course you don't know what you like if you have never tried things and that simply can't be solved by communication.",
   "created_utc": 1691597237,
   "score": 6,
   "submission_id": "15mgjjc"
  },
  {
   "comment_id": "jvhapu9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15mgjjc"
  }
 ]
}