{
 "submission_id": "15mia9l",
 "title": "What caused your last break up?",
 "selftext": "",
 "created_utc": 1691594436,
 "permalink": "/r/AskReddit/comments/15mia9l/what_caused_your_last_break_up/",
 "score": 132,
 "url": "https://www.reddit.com/r/AskReddit/comments/15mia9l/what_caused_your_last_break_up/",
 "comments": [
  {
   "comment_id": "jvglrok",
   "message": "Wife and I were attending couples therapy. The therapist said she was being literally abusive to me. My then-wife demanded a new therapist. \n\nSecond therapist said she was being abusive to me. My then-wife filed for divorce. \n\nWhile my life right after was hell, it's come back around and I'm doing better than ever.",
   "created_utc": 1691598399,
   "score": 118,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgc37k",
   "message": "Despite the fact we were both poor college students, she wanted someone \"rich\", like a doctor.  So, after she dumped me, last I heard, she was engaged to a pre-med student.",
   "created_utc": 1691594885,
   "score": 102,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgnei8",
   "message": "Started hiding her phone, looked at phone, kicked her out.",
   "created_utc": 1691598985,
   "score": 2,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgmzlc",
   "message": "She tried to stab me",
   "created_utc": 1691598837,
   "score": 214,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgsbqj",
   "message": "My drinking, lies about drinking, and shitty finances because of drinking. 107 days sober today.",
   "created_utc": 1691600770,
   "score": 147,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgpcuu",
   "message": "She cheated.\n\nWe had our home, our plannings and was preparing to marry in about three months when we separated.",
   "created_utc": 1691599688,
   "score": 124,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgclvn",
   "message": "He relapsed on heroin and sold all my shit.",
   "created_utc": 1691595072,
   "score": 126,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgq8a8",
   "message": "Cheating and alcoholism on her side, combined with me feeling defeated and not being able to communicate effectively with her. \n\n\nKinda hard to describe that last part unless you’ve experienced it; I felt stunlocked during every conversation. Verbally walking on eggshells, to a point where I literally couldn’t formulate a single word or sentence.",
   "created_utc": 1691600003,
   "score": 167,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvghamx",
   "message": "She accused me of not spending time with her, never buying her anything, never doing anything for her, and sleeping with her sister. The truth was I was working forty hours a week to feed her and clothe her while she refused to work, sat at home playing video games that I bought, and talked shit about her family, who were some of the nicest people ever. And the sister thing happened in her dreams, so definitely my fault. She’s a sociopath that refuses to go to therapy because she drinks tea and plays with tarot cards.",
   "created_utc": 1691596774,
   "score": 80,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgbjps",
   "message": "Her not having enough time for both grad school and a relationship. She did make the right choice though.",
   "created_utc": 1691594687,
   "score": 66,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgqktl",
   "message": "Both of us went on out of state vacations around the same time. I visited family, she cheated on me. We lived together so for about a month I was sleeping on the couch and got to hear the phone calls with the guy she cheated with",
   "created_utc": 1691600129,
   "score": 237,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgc15b",
   "message": "he told me that he drove 8 hrs to see his girl best friend because her boyfriend had cheated on her and he “wanted to make her feel better”. LOL",
   "created_utc": 1691594865,
   "score": 34,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgghrt",
   "message": "It took some time but we both realized that we weren't giving each other what we needed.",
   "created_utc": 1691596483,
   "score": 165,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgn8s5",
   "message": "I lost a dance battle with her ex.",
   "created_utc": 1691598929,
   "score": 135,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgq5b6",
   "message": "Realized I wasn't gay",
   "created_utc": 1691599972,
   "score": 218,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgl45f",
   "message": "He wants to get his life together. We still love each other and he thinks he needs to do this on his own but I want to be here for him, I promised him when we first started dating I’d be here for him as much as I can. It just hurts because he thinks I’m not strong enough to still love him and be apart from him when I am. It’s complicated.",
   "created_utc": 1691598163,
   "score": 183,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgmcv8",
   "message": "The tawdry little harlot cheated on me",
   "created_utc": 1691598610,
   "score": 196,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgoqha",
   "message": "(First year college relationship)\n\nI had a feeling she was cheating or talking to other dudes because she did the classic putting phone face down after texting, slightly tilting screen away from my peripheral, and giving those flirty smirks sometimes after texts. \n\nOne day when she was at work and I was hanging out in the car, I went through her phone and went through her Instagram DMs. My worries we’re true and she was flirting with a lot of guys. No sexting as far as I saw but it was just clear as day “damn girl you are HOT. Need a tattoo? Let me know \u0026lt;3” and she would reply “ohhh yesss pleaaaase -kiss emoji hearts-“\n\nClassic shitty situation because she was obviously flirting and doing stuff I don’t think anybody would appreciate, and I did the classic fuck up of going through someone’s phone because of my insecurities. All around it was lame.\n\nObviously young relationships are risky, but what I remember my friend telling me before things got serious with her was “damn dude she ain’t been single for a minute lol”. Completely ignored him because I knew this girl since 1st grade but damn. Shoulda listened to the homie.",
   "created_utc": 1691599465,
   "score": 91,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvghmn2",
   "message": "he never gave me a real answer. I was deployed. \"it's not you it's me\"\n\nI was moving across the country to be with him a month later. Now I live here and I'm happy. We talked about it after the fact. I still don't have closure. I thought we'd get back together but I realize now I don't want what he has to offer.",
   "created_utc": 1691596897,
   "score": 200,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgfle8",
   "message": "Modern Warfare (2007)",
   "created_utc": 1691596156,
   "score": 21,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgeped",
   "message": "She stole shit from me and hit me. We tried to make it work again after that because I'm a gullible dumbass, and then I noticed shit started disappearing again. Told her I didn't know if she was stealing my stuff again, but I think I'm just too paranoid to make this work. She got mad at me and hit me again and then she told me she's leaving me, and then I thanked her and told her to please never try and contact me again because my life only ever got worse for being with her. We've both happily and successfully cut contact. 😁",
   "created_utc": 1691595836,
   "score": 105,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgsub2",
   "message": "They couldn’t make me an actual part of their life.",
   "created_utc": 1691600959,
   "score": 108,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgqcwh",
   "message": "She wanted to fuck me but she didn't want to fuck me. She was Christian and wanted to save herself for marriage, but anytime we were together, things would progress (consentually) and then after she would have regrets. Eventually the temptation got bad enough that she just broke it off to prevent it.",
   "created_utc": 1691600050,
   "score": 108,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgn0ja",
   "message": "After a month of her telling me how much she liked me and how she saw a future with me she said she didn't know If she wanted to be with me. Worst birthday ever",
   "created_utc": 1691598847,
   "score": 123,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgm5or",
   "message": "Me",
   "created_utc": 1691598538,
   "score": 42,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgxl4z",
   "message": "I used his iPad while he was out of town (no, not looking, just went to text him) and found nudes of me sent to SEVERAL of our mutuals. Including his father.",
   "created_utc": 1691602674,
   "score": 240,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgptbd",
   "message": "The same thing that broke up so many the others.\n\nI thought I found a diamond in the rough, the sort of guy others overlook because of something petty (e.g. short, receding chin, lives with parents, unemployed, etc).  But no, *I* can see how amazing they are. They always seem smart, funny, into doing fun stuff - just what you want, right?\n\nThese guys find me intriguing, sexy, and fun - in the beginning. They like to say I make them feel energized and want to do new things. But it doesn't take long before they realize I'm not a manic pixie dream girl and just a regular person who is cute and social and interested in a lot of things, that I have some needs and an inner life.\n\nPretty soon, they don't want to do the fun stuff anymore. They just want to stay home and watch TV or do the same things over and over. When I suggest new things, they shoot down every suggestion. They stop asking me about my life or my interests or even my day. If I try to bring something up, they just kill the conversation or change the topic.  Then they start picking on me - my looks, my habits, really anything and everything. \n\nPretty soon, the *only* acceptable conversation topics are how was their day, what to eat for dinner.. We can only talk about their day, their thoughts on all the ways the world has wronged them, or why they are so amazing and no one sees it.  Or, of course, how I am doing XYZ wrong for myself, in my house, with my life, whatever\n\nThey clearly don't even like me anymore, and I eventually crawl out totally drained.",
   "created_utc": 1691599851,
   "score": 34,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgb8nr",
   "message": "Complacency",
   "created_utc": 1691594576,
   "score": 80,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgmfsk",
   "message": "we've grown toxic with each other",
   "created_utc": 1691598639,
   "score": 50,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgu24z",
   "message": "\nHis ex wife started stalking me, giving death threats. She contacted my ex-husband, whom I'm still good platonic  friends with, saying I was having an affair with a married man. She is married to someone else entirely. She told my (now ex) boyfriend that my ex-husband contacted her saying he and I were still together. The (now ex) boyfriend said he would coach me what to say so she would commit suicide and would do him a favor. She pretended to commit suicide....\n\nThis is after two months of dating. Yeah- no thanks crazy people.",
   "created_utc": 1691601403,
   "score": 84,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgki9c",
   "message": "my wife was a whore, /u/pizzabagels1994",
   "created_utc": 1691597944,
   "score": 158,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgqqps",
   "message": "She would start arguments with me and then try to convince me that I was starting it.",
   "created_utc": 1691600189,
   "score": 39,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgi7dd",
   "message": "She died",
   "created_utc": 1691597108,
   "score": 103,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgjj26",
   "message": "She was extremely hard to live with and not taking care of her health.",
   "created_utc": 1691597591,
   "score": 37,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgmfr4",
   "message": "Complete and total narcissism",
   "created_utc": 1691598639,
   "score": 32,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgyifd",
   "message": "I had sudden-onset full-body pain, was seeing several doctors to figure it out, and was on high doses of prednisone. He sat me down and said in a very contemptuous manner, “Your weight has become an issue.” I immediately lost about 200 lb.",
   "created_utc": 1691603005,
   "score": 82,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvggd57",
   "message": "i feel like i see this question 20 times a day",
   "created_utc": 1691596435,
   "score": 54,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgop05",
   "message": "Me being a piece of shit and refusing my crazy person pills and breaking up with her in a manic and abusive and dumbass thought process of \"I'll make her chase after me!!\"\n\nIt took like two years to get my shit together and get back with her, almost lost her to someone else which I would have fucking totally deserved ._.",
   "created_utc": 1691599450,
   "score": 81,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgn7ce",
   "message": "She simply said she didn't love me anymore.",
   "created_utc": 1691598915,
   "score": 27,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgr7t3",
   "message": "She found out I was bisexual before I was ready to tell her. She heard it from a mutual friend. Decided she couldn't trust me and it was too off-putting. I had dated men and women both.",
   "created_utc": 1691600361,
   "score": 35,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgr97u",
   "message": "My gf started making more money than me and I couldn’t keep up. She also fucking one our massive dicked mutual friends rn. My life is spiraling. Idk what to do.",
   "created_utc": 1691600375,
   "score": 20,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvguwu1",
   "message": "I didn't know we had broken up...\n\nWe had been together for 7 years.  She wanted to move to a city near the mountains.  So I lead the way by getting a temp job in one of the big tech cities by the mountains, get a temp place to live and start working towards the goal.  \n\nShe never came. I went back home for a better paying job opportunity. She blocked me on FB, and I later found out she found a replacement on Bumble.\n\nI have a hard time starting relationships now. I still have dreams about her and I wish it would stop, it's been a little over 3 years. Has been hard to process.",
   "created_utc": 1691601713,
   "score": 61,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgkqpj",
   "message": "Sometimes, people simply fall out of love. This can happen for a variety of reasons, such as changes in personal circumstances or simply growing apart.",
   "created_utc": 1691598028,
   "score": 58,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgqjni",
   "message": "I caught her cheating on me. Also in my bed!",
   "created_utc": 1691600117,
   "score": 15,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgl772",
   "message": "Him not being able to commit properly made me extra possesive and jealous so we fell apart",
   "created_utc": 1691598193,
   "score": 73,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgn1ep",
   "message": "She wanted too much, too fast and made some pretty significant life changing decisions without my knowledge.  We had always said that our situation was one that was probably not going to lead to permanance, but she took things much more seriously than I did.  \n\n\nI try to say we parted as friends, but yeah.  One akward situation lead to me leaving her apartment and then she was just...gone.  Hope she's doing well.",
   "created_utc": 1691598856,
   "score": 21,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvha092",
   "message": "I had just been diagnosed with Stage 4 metastatic cancer.  All the attention I had been giving her I didn't have the energy to maintain while getting Chemo and avoiding Covid.\n\nMy final straw.  She yelled at me on the phone while I was in intensive care with pulmonary embolisms.  Just that light bulb moment, and I was done.  \n\nThat was 3 years ago. All good now. I'm in remission, and thinking about dating again.",
   "created_utc": 1691607159,
   "score": 102,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgn9aj",
   "message": "They lost feelings for me",
   "created_utc": 1691598934,
   "score": 12,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgtkg3",
   "message": "Spent three years in the relationship and nothing was changing or progressing. He was spending all his time playing games and complaining about life. And I stood by him for the final year trying to help in what ways I could (we were also long distance) and he showed no desire to change so I finally said I had enough. I hadn’t felt real love towards him for a few months by then and what do you know… I met my now husband just a few weeks after breaking up.",
   "created_utc": 1691601225,
   "score": 28,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvguob3",
   "message": "I trusted her talking to the \"guy she told me not to worry about\".",
   "created_utc": 1691601628,
   "score": 22,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgstps",
   "message": "He was a child. (Not literally) It's a huge turn off having to act like someones mother.",
   "created_utc": 1691600952,
   "score": 50,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgndz4",
   "message": "Bad medication, a manic episode, and cheating. \n\nMy ex started a new medication that triggered a manic episode. We didn’t know he was bipolar at the time and he went on a downward spiral. There were two months of him emotionally abusing me, cheating on me, ruining his college career, losing his job, and destroying all his friendships. It finally ended when he tried to hit me with his car and then sped off into the night to god knows where. He broke up with me over text and I was halfway across the country within the week. Our relationship hadn’t been perfect before that (he sexually assaulted me for years) but I was stupid and wanted to work it out. It turned out to be for the best that things ended that day, I suppose.",
   "created_utc": 1691598980,
   "score": 17,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvguu2i",
   "message": "My hand just got really tired",
   "created_utc": 1691601685,
   "score": 17,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgwr34",
   "message": "It wasn’t gonna work. Could I have made it work? Probably. Should I have? Maybe. Did I? Nope. I left to save us both the heartache",
   "created_utc": 1691602374,
   "score": 16,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvge8o2",
   "message": "She didn't believe in sex before marriage. I wasn't ready to get married.\n\nIf she hadn't broken up with me because of that, I probably would have broken up with her because she was sooo boring.",
   "created_utc": 1691595665,
   "score": 22,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgqo78",
   "message": "We were together for 7 years \u0026amp; he claimed to be \"waiting for marriage\" and then slept with some girl at a party on new years eve 🥴\n\nbtw - I'm not Christian nor was I abstaining before I met him so it was entirely his boundary that I respected and he decided to break ❤️",
   "created_utc": 1691600163,
   "score": 36,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgw43n",
   "message": "He would be non responsive for literally days at a time (4 days without a single text). No heads up like “hey i’m gonna be really busy next week” or somthing like that. It became clear that I wasnt his priority. So I left",
   "created_utc": 1691602147,
   "score": 25,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvh3ie2",
   "message": "Friends and I knew her for years. No craziness. We moved in together. \n\nThe minute I made her an authorized user on ONE credit card, she maxed it and convinced the bank and or vendors to allow access to the others...a lot of damage can be done between billings.\n\nTotal damage: $55k\nResult: Bankruptcy and my 15 year 800 credit score destroyed.\n\nSuggested prevention for others: Don't add anybody. Set low thresholds for alerts.\n\nThat's the reason. \nAny questions?",
   "created_utc": 1691604810,
   "score": 27,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvh4cm9",
   "message": "Its me, im the problem its me",
   "created_utc": 1691605116,
   "score": 10,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvhdy21",
   "message": "She couldn’t keep the penises of other men out of her vagina.",
   "created_utc": 1691608588,
   "score": 19,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgnsfu",
   "message": "Cheating",
   "created_utc": 1691599122,
   "score": 8,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgpu96",
   "message": "Me, myself, and my mental health",
   "created_utc": 1691599861,
   "score": 14,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgttml",
   "message": "Apparently asking for more affection (holding hands, simple cuddling) was too much for him. \n\nIt was my birthday and he decided to go out with friends. I told him it was my birthday and was hoping we could just celebrate me and him (we NEVER had date nights. His friends were always involved). I guess I was asking for too much and broke up with me over text that same day. \n\nWent over his place the next day to pick up some of my things. He gave me a fist bump, told me to have a good life, and blocked me on all social media. Don’t know why, but I never once begged him back or said anything mean. \n\nHis BIL told him many times how he made a big mistake letting me go. I put up with a lot of shit other girls wouldn’t have, and realized that after we had broken up. \n\nDating is exhausting.",
   "created_utc": 1691601317,
   "score": 25,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgwq3w",
   "message": "Years of feeling un-appreciated and constantly getting stuff throw in my face. Busting my ass and feeling like it wasn't good enough, I did everything at home and i just cracked one day in 2018.",
   "created_utc": 1691602365,
   "score": 16,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvh2r17",
   "message": "GF went MIA for 28hrs after drinking and would not provide details on where, with who, etc. The excuse was the hangover didn’t allow them to text or call. Mind you, they were able to post on IG a alcohol bottle about 5 hrs into not contacting me.  \n\nNo apology either, I didn’t know if they were arrested or dead. I really did care about them, but I don’t have time for games.",
   "created_utc": 1691604531,
   "score": 12,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgql7r",
   "message": "He ate all my edibles in one go while I was in the shower. AFTER I told him to eat only ONE because I made them very strong, one for him and one for me. \n\nThen he turned around and told me he didn't remember me telling him that OR remember eating both edibles. FIFTEEN FUCKING MINUTES after I said those things! 15 minutes after eating them, he didn't remember it?\n\nBullshit. I will never ever be convinced he didn't remember that. He ate both of those edibles because he WANTED them both. \n\nIt was then that I realized he was out of control. He couldn't stay out of rehab, was constantly doing shit that would (if caught) get him thrown in jail (again), was probably shitfaced drunk and hiding it. Alcohol was something I would not tolerate from him because he has a severe problem with it, has drank himself into a literal near-death coma more than once and was lying to everyone about not drinking. In an out of rehab like a washed up actor but minus the fame and money. \n\nOf course after taking almost a full gram of THC that night, he got really stupid, clumsy and acted like a complete asshole once it kicked in. Thankfully he passed out about an hour and a half after he ate them both. \n\nI babysat him until it wore off, just to make sure he didn't stumble across the street to the liquor store and drink himself to death or do some other stupid thing and when I could finally shout him awake at 8 am I packed up his stuff and dropped him at his place. After totally unloaded on him and told him we were done. \n\nI'd google him to see if he's still alive or not but he's got a really common full name so I doubt I'd find anything. \n\nDude needs some heavy duty Dr. Phil tier grippy sock hospitalization but he will never get it and probably wouldn't get sober even if he did. \n\nI feel pity for him but I can't save him.",
   "created_utc": 1691600133,
   "score": 23,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgri93",
   "message": "My depression",
   "created_utc": 1691600468,
   "score": 8,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgzml3",
   "message": "He cheated! With his ex, whose name rhymes with mine. Ouch.",
   "created_utc": 1691603403,
   "score": 11,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvh1w50",
   "message": "i didn’t really love the guy. it was a whole 3 month manic episode i was living in. i shouldn’t have let it go longer than it should. totally my fault.",
   "created_utc": 1691604220,
   "score": 12,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvh83no",
   "message": "He got depressed doubled it and gave it to me",
   "created_utc": 1691606470,
   "score": 13,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgqddp",
   "message": "She was lazy and entitled.  Not a bad person, but she had that \"happy wife happy life\" burned into her head and I wasn't going to live life where the only happiness I was allowed to have came secondary to and as a by-product of what I was able to do for her.",
   "created_utc": 1691600054,
   "score": 5,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgvkeq",
   "message": "Bitch cheated on me 14 times with 9 guys over the span of 4 years..... so ya",
   "created_utc": 1691601949,
   "score": 11,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgzhli",
   "message": "I have intense episodes of paranoia that can cause me to deep dive into everything like a psycho stalker maniac. \n\nI thought I was over but right now I'm in a relationship and I'm really fighting it this time, fighting for my self to not do this and to change.\n\nThis happens because I decided to bond myself to these girls I date so recklessly to the point where I care far too much, but the cognitive dissonance is caused by not wanting to get played while I care too much. They don't usually realize how much I care about them.\n\nMy last relationship probably I did because everything I did to \"protect myself\" (My ego and emotions), and she started hating me. She eventually became indifferent. \n\nAnd then she started coming back after the break up, promise me sweet nothings and then I'd find out that when I was around she was banging a few other guys.\n\nAnd then I'd leave, and then she'd come back and I'd fall for it again.\n\nIt made me even more psycho up to the point I ended up in jail and paying fines.\n\nAnd then I moved on. I'd stop believing in love as the concept I thought it was. \n\nAnd now here I am, dating a girl and trying to break myself free from these everlasting thoughts. \n\nShe could be cheating, she could not be. I probably won't ever know until I do or she leaves. But I'm doing my best to be the best man, leader, and lover I can be right now.\n\nEdit: if it tells you anything about my mind state right now, I tried to proofread this comment and realized a lot of it was a bit jumbled.",
   "created_utc": 1691603355,
   "score": 7,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgpc1b",
   "message": "Me asking for help, around the house (basically in her words I’m being rude and disrespectful to her for asking such a thing and that I have no right to ask these things of her after all she does for me)",
   "created_utc": 1691599679,
   "score": 5,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgx6im",
   "message": "i was dating him 10th grade- 12th grade, two years total. he kept talking about how he wanted me to follow him if he joined the military or went to college (i do not go to college). he also frequently talked about marriage by 23, kids by 25. all of it made me very uncomfortable as i was 17 years old at the end of our relationship. i broke it off cuz i was the only girl he’d ever been with and he just expected way too much from our high school relationship. i also felt i was doing things his mom should do. \n\nwhat is with gen z and getting married as soon as we turn 18?",
   "created_utc": 1691602527,
   "score": 4,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgzlcr",
   "message": "Wife got pregnant with another man. Not having it.",
   "created_utc": 1691603391,
   "score": 7,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvh2qw2",
   "message": "I needed a partner, not a dependent.",
   "created_utc": 1691604530,
   "score": 18,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvh2s3f",
   "message": "He lost interest in me.\n\nShit happens ig",
   "created_utc": 1691604542,
   "score": 7,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvhceki",
   "message": "My girlfriend (28) met some guy (67) at music festival. I’m 33 btw. Shit happens",
   "created_utc": 1691608023,
   "score": 13,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgwe89",
   "message": "One of us came out as ace and together decided we shouldn’t create a situation wherein the other feels unloved or undesired. We tried to make it work for a while but it is what it is.",
   "created_utc": 1691602246,
   "score": 10,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgqqgb",
   "message": "Drinking too much all the time and being a bitch to my BF. We were apart for a year, saw each other occasionally. In that year I got sober and learned many things about myself...we are now back together and living together again.",
   "created_utc": 1691600186,
   "score": 8,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvgw20m",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvh145p",
   "message": "My brain tumor. I didn't even know what was wrong with me yet. I was so angry and frustrated and annoyed all the time- I was just not good enough for her and I had to let her go. Later I got diagnosed with cancer and found out a huge tumor was smashing my brain into the back of my skull. I'm so sorry I treated you poorly, Lauryn. I still love you.",
   "created_utc": 1691603937,
   "score": 13,
   "submission_id": "15mia9l"
  },
  {
   "comment_id": "jvikymo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15mia9l"
  }
 ]
}