{
 "submission_id": "15mpp72",
 "title": "What do you think about Ukraine now?",
 "selftext": "",
 "created_utc": 1691611053,
 "permalink": "/r/AskReddit/comments/15mpp72/what_do_you_think_about_ukraine_now/",
 "score": 53,
 "url": "https://www.reddit.com/r/AskReddit/comments/15mpp72/what_do_you_think_about_ukraine_now/",
 "comments": [
  {
   "comment_id": "jvhm61k",
   "message": "American support amongst citizens has decreased, but our government has not wavered in its support. \u0026gt;$75 billion dollars in assistance though is a significant sum and can’t fault many people for thinking at least some portion of that could have gone to necessary change at home.",
   "created_utc": 1691611631,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhl530",
   "message": "I hope they stay strong.",
   "created_utc": 1691611208,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhnpxw",
   "message": "Didn't think to much about ukraine before the orc invasion. But now I have nothing but respect for ukraine. Keep fighting like the warriors that you are.",
   "created_utc": 1691612292,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhl7xq",
   "message": "They're fighting to remain a country after being attacked by Russia. Nothing has changed.",
   "created_utc": 1691611239,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhla2j",
   "message": "Hello everyone, at the moment I am in Ukraine and have never left it since the beginning of the war. I am also a citizen of Ukraine and I am very interested in how the opinion about Ukraine has changed now in other countries. I heard that many people are not happy with the fact that the state spends so much money on our support and it would be better if this money were spent on their own state and this is just one example of those that I know.\r  \n\r  \nJust in case, I’ll clarify, I’m not complaining, all Ukrainians are immensely grateful to every country, volunteer, everyone who made their efforts to help, but we are all afraid that the West may turn away from us and after that we will definitely be doomed.\r  \n\r  \nYou can also ask me any questions that interest you, I will be happy to answer them.",
   "created_utc": 1691611263,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhls4i",
   "message": "I hope when the dust settles and they start to rebuild their country, they dont fall victim to infighting",
   "created_utc": 1691611471,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhnr9m",
   "message": "OPs comment history is so strange yhat it makes me think this is a bot or just straight up not real.",
   "created_utc": 1691612308,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhoja9",
   "message": "I’m hoping Ukraine wins",
   "created_utc": 1691612641,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhoyzd",
   "message": "I think Ukraine is a great country and very pretty. I have no problems with the leadership, citizens or fans. \n\nMy problem is the US dumping money in to it.",
   "created_utc": 1691612823,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhlg2k",
   "message": "I think Bidens launderette is doing really well.",
   "created_utc": 1691611331,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhnoxe",
   "message": "I think they’re still as corrupt as ever.",
   "created_utc": 1691612280,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhmut6",
   "message": "I hope they win and this doesn’t devolve into a weird proxy war where Russia is being supported by China simply to drain the US and the alliance.",
   "created_utc": 1691611923,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhooaq",
   "message": "Slawa Ukrani 🇺🇦",
   "created_utc": 1691612701,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhn5ua",
   "message": "I love the fact that they are blowing up Moscow.",
   "created_utc": 1691612054,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvho58l",
   "message": "My opinion of them hasn't changed since the war began. They were unjustly attacked by a power-hungry devil and I hope they kick his ass. I still support Ukraine 🇺🇦",
   "created_utc": 1691612474,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhndwp",
   "message": "You guys a doing great. Btw some ‘sigmas’ are making edits as to why we shouldn’t support the people of Ukraine. I’m fucking done",
   "created_utc": 1691612149,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhn7zu",
   "message": "For all that I've read, I can't seem to find a justifiable reason for Russia to have invaded in 2014 or 2022.  I hope the international community can use the right carrots and sticks to stop the war and lock in security measures to never let this happen again.",
   "created_utc": 1691612079,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhosl7",
   "message": "Even though they are trying to not be corrupt, there were a lot of corrupt individuals identified since the war began.",
   "created_utc": 1691612750,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvho68y",
   "message": "I hope Russia wins.",
   "created_utc": 1691612486,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhm777",
   "message": "The same. The flow and ebb of war. One can only wonder if Putin is going to send ALL his prisoners in to \"fight?\" I wonder how many of the involuntary ones he sent in give themselves up on arrival.",
   "created_utc": 1691611645,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhnsom",
   "message": "I think Ukraine is incredibly strong, I hope the mindless slaughter and destruction ends, russias war is pointless cuz all they’re doing is showing why they are weak. I really hope Ukraine pulls through, I’m sure they will.",
   "created_utc": 1691612326,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhpcua",
   "message": "They've got balls, and I hope they manage to get Russia to back off. Lots of countries are using this as a reason to attack Russia by proxy, to which I say: well d'uh, the world has wanted Putin dead and Russia neutered for a long time, and Russia has now given them that opportunity. Provoke NATO and they'll reduce Russia to slag with a smile on their faces.",
   "created_utc": 1691612973,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhpn9p",
   "message": "I think they're doing stunningly well at fucking up the lives of people who need to be fucked up right now. The strategy and success are both amazing.",
   "created_utc": 1691613086,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhpqap",
   "message": "I think that this war can only make losers. It's sad, but I understand why Ukraine can't surrender. It can't be allowed to be the first domino to fall.\n\nI have a great deal of admiration for those who have the courage to keep on fighting despite the odds. And by fighting I'm not only talking about soldiers, everyone contributing to the country's economy is important.",
   "created_utc": 1691613118,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhq2y3",
   "message": "The proxy war needs to end.  We are wasting far too much of our military’s supplies on this effort.  It needs to end. A real US President would broker a deal now.   Biden doesn’t because he is beholden to the backers of the Military-Industrial complex,  Blackrock and Vanguard who are making BILLIONS and BILLIONS of profit of this war while Ukrainians and Russians die to line their pockets.",
   "created_utc": 1691613254,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhq3x6",
   "message": "I salute Ukraine for fighting to remain free.\n\nUkraine is in a fight for survival against former master who want to re-integrate the country back into their fold.  \n\nYour country learned from past and improved its military's  capability so that instead of being steamrollered you gave the Russian bear a bloody nose that surprised Putin and the rest of the world.\n\nThe world is also impressed with your leader, Volodymyr Zelenskyy.  I believe he is largely responsible for convincing the west to give aid to your country which improved chance to survive exponentially.  The fact that Russians were so corrupted in training, maintenance, logistics etc., are icing on the cake.\n\nSo long as Putin remain in power, Ukraine will be forced to continue the fight and it will be difficult one to say the least.\n\nAs long as Ukraine remain in the fight, the west will continue to send aid to your battered country and once the fighting stop, to help rebuild and join NATO.",
   "created_utc": 1691613265,
   "score": 1,
   "submission_id": "15mpp72"
  }
 ]
}