{
 "submission_id": "15mpp72",
 "title": "What do you think about Ukraine now?",
 "selftext": "",
 "created_utc": 1691611053,
 "permalink": "/r/AskReddit/comments/15mpp72/what_do_you_think_about_ukraine_now/",
 "score": 72,
 "url": "https://www.reddit.com/r/AskReddit/comments/15mpp72/what_do_you_think_about_ukraine_now/",
 "comments": [
  {
   "comment_id": "jvhm61k",
   "message": "American support amongst citizens has decreased, but our government has not wavered in its support. \u0026gt;$75 billion dollars in assistance though is a significant sum and can’t fault many people for thinking at least some portion of that could have gone to necessary change at home.",
   "created_utc": 1691611631,
   "score": 51,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhl530",
   "message": "I hope they stay strong.",
   "created_utc": 1691611208,
   "score": 101,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhnpxw",
   "message": "Didn't think to much about ukraine before the orc invasion. But now I have nothing but respect for ukraine. Keep fighting like the warriors that you are.",
   "created_utc": 1691612292,
   "score": 7,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhl7xq",
   "message": "They're fighting to remain a country after being attacked by Russia. Nothing has changed.",
   "created_utc": 1691611239,
   "score": 35,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhla2j",
   "message": "Hello everyone, at the moment I am in Ukraine and have never left it since the beginning of the war. I am also a citizen of Ukraine and I am very interested in how the opinion about Ukraine has changed now in other countries. I heard that many people are not happy with the fact that the state spends so much money on our support and it would be better if this money were spent on their own state and this is just one example of those that I know.\r  \n\r  \nJust in case, I’ll clarify, I’m not complaining, all Ukrainians are immensely grateful to every country, volunteer, everyone who made their efforts to help, but we are all afraid that the West may turn away from us and after that we will definitely be doomed.\r  \n\r  \nYou can also ask me any questions that interest you, I will be happy to answer them.",
   "created_utc": 1691611263,
   "score": 15,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhls4i",
   "message": "I hope when the dust settles and they start to rebuild their country, they dont fall victim to infighting",
   "created_utc": 1691611471,
   "score": 17,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhnr9m",
   "message": "OPs comment history is so strange yhat it makes me think this is a bot or just straight up not real.",
   "created_utc": 1691612308,
   "score": 10,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhoja9",
   "message": "I’m hoping Ukraine wins",
   "created_utc": 1691612641,
   "score": 4,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhoyzd",
   "message": "I think Ukraine is a great country and very pretty. I have no problems with the leadership, citizens or fans. \n\nMy problem is the US dumping money in to it.",
   "created_utc": 1691612823,
   "score": 8,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhlg2k",
   "message": "I think Bidens launderette is doing really well.",
   "created_utc": 1691611331,
   "score": 11,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhnoxe",
   "message": "I think they’re still as corrupt as ever.",
   "created_utc": 1691612280,
   "score": 6,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhmut6",
   "message": "I hope they win and this doesn’t devolve into a weird proxy war where Russia is being supported by China simply to drain the US and the alliance.",
   "created_utc": 1691611923,
   "score": 4,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhooaq",
   "message": "Slawa Ukrani 🇺🇦",
   "created_utc": 1691612701,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhn5ua",
   "message": "I love the fact that they are blowing up Moscow.",
   "created_utc": 1691612054,
   "score": 3,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvho58l",
   "message": "My opinion of them hasn't changed since the war began. They were unjustly attacked by a power-hungry devil and I hope they kick his ass. I still support Ukraine 🇺🇦",
   "created_utc": 1691612474,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhndwp",
   "message": "You guys a doing great. Btw some ‘sigmas’ are making edits as to why we shouldn’t support the people of Ukraine. I’m fucking done",
   "created_utc": 1691612149,
   "score": 255,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhn7zu",
   "message": "For all that I've read, I can't seem to find a justifiable reason for Russia to have invaded in 2014 or 2022.  I hope the international community can use the right carrots and sticks to stop the war and lock in security measures to never let this happen again.",
   "created_utc": 1691612079,
   "score": 255,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhosl7",
   "message": "Even though they are trying to not be corrupt, there were a lot of corrupt individuals identified since the war began.",
   "created_utc": 1691612750,
   "score": 2,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvho68y",
   "message": "I hope Russia wins.",
   "created_utc": 1691612486,
   "score": 245,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhm777",
   "message": "The same. The flow and ebb of war. One can only wonder if Putin is going to send ALL his prisoners in to \"fight?\" I wonder how many of the involuntary ones he sent in give themselves up on arrival.",
   "created_utc": 1691611645,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhnsom",
   "message": "I think Ukraine is incredibly strong, I hope the mindless slaughter and destruction ends, russias war is pointless cuz all they’re doing is showing why they are weak. I really hope Ukraine pulls through, I’m sure they will.",
   "created_utc": 1691612326,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhpcua",
   "message": "They've got balls, and I hope they manage to get Russia to back off. Lots of countries are using this as a reason to attack Russia by proxy, to which I say: well d'uh, the world has wanted Putin dead and Russia neutered for a long time, and Russia has now given them that opportunity. Provoke NATO and they'll reduce Russia to slag with a smile on their faces.",
   "created_utc": 1691612973,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhpn9p",
   "message": "I think they're doing stunningly well at fucking up the lives of people who need to be fucked up right now. The strategy and success are both amazing.",
   "created_utc": 1691613086,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhpqap",
   "message": "I think that this war can only make losers. It's sad, but I understand why Ukraine can't surrender. It can't be allowed to be the first domino to fall.\n\nI have a great deal of admiration for those who have the courage to keep on fighting despite the odds. And by fighting I'm not only talking about soldiers, everyone contributing to the country's economy is important.",
   "created_utc": 1691613118,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhq2y3",
   "message": "The proxy war needs to end.  We are wasting far too much of our military’s supplies on this effort.  It needs to end. A real US President would broker a deal now.   Biden doesn’t because he is beholden to the backers of the Military-Industrial complex,  Blackrock and Vanguard who are making BILLIONS and BILLIONS of profit of this war while Ukrainians and Russians die to line their pockets.",
   "created_utc": 1691613254,
   "score": 254,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhq3x6",
   "message": "I salute Ukraine for fighting to remain free.\n\nUkraine is in a fight for survival against former master who want to re-integrate the country back into their fold.  \n\nYour country learned from past and improved its military's  capability so that instead of being steamrollered you gave the Russian bear a bloody nose that surprised Putin and the rest of the world.\n\nThe world is also impressed with your leader, Volodymyr Zelenskyy.  I believe he is largely responsible for convincing the west to give aid to your country which improved chance to survive exponentially.  The fact that Russians were so corrupted in training, maintenance, logistics etc., are icing on the cake.\n\nSo long as Putin remain in power, Ukraine will be forced to continue the fight and it will be difficult one to say the least.\n\nAs long as Ukraine remain in the fight, the west will continue to send aid to your battered country and once the fighting stop, to help rebuild and join NATO.",
   "created_utc": 1691613265,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhqn4i",
   "message": "I think it’s weird you started out using your account for porn and now you’re pretending to be from the Ukraine for internet points.",
   "created_utc": 1691613465,
   "score": 7,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhtubq",
   "message": "I don't think that any country who attacks it's neighbor should get anything but knocked on it's ass.  I'm for Ukraine, and I'm for it's citizens.    If Putin is so upset about the drone attacks in Russia, meybe he shouldn't have started this to begin with.   Seriously though, what did he expect?   I hope Ukraine comes out on top, and I hope that the citizens stop having to suffer, because of Putin's megalomaniacal intentions.",
   "created_utc": 1691614653,
   "score": 3,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhzda9",
   "message": "I feel they have this in the bag.\n\nIt's going to be gruelling, and a lot of men are going to die, but ultimately, Russia doesn't have the resources to win this war conclusively, the west *really* don't want Russia to win, which means this is Ukraine's war to win. I believe they can take all of their territory back. It's what they do after they achieve that is in question. I have literally no idea what the fallout of the Russians losing all of their gained ground would be, or how Russians would see Ukrainians armed with western arms at their border.\n\nEither way, some interesting shit is going to go down. It's pretty pointless to speculate as to what, as everything is so up in the air that quite literally anything could happen.",
   "created_utc": 1691616708,
   "score": 2,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhzeth",
   "message": "I feel like we are using them like a pawn.",
   "created_utc": 1691616725,
   "score": 2,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi0k0x",
   "message": "The war will likely grind on for years. Some of the footage in the subreddit r/CombatFootage is pretty gnarly. Such a waste of human life.",
   "created_utc": 1691617155,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi1m57",
   "message": "Ukraine has its flaws and I don’t agree with the fetishization of the president but that does NOT mean they deserve to be invaded. \n\nWhether or not we should send a shit ton of money is complicated since the government does fuck all for our own safety nets. Just know that any aid we send your way isn’t from the benevolence of our government (my last statement would be false if they were filled with good people) but because the weapons manufacturing corporations have a lot of control.",
   "created_utc": 1691617552,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi3kr8",
   "message": "sure would be nice to see some of the money we're sending them go towards helping our own struggling citizens here.",
   "created_utc": 1691618299,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi4x2v",
   "message": "I wish America would stop being the world police and take care of us first.",
   "created_utc": 1691618826,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhqh2r",
   "message": "I don't have an opinion.",
   "created_utc": 1691613402,
   "score": 4,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhqpbt",
   "message": "I wish there were fewer Russians there.",
   "created_utc": 1691613489,
   "score": 3,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhy1ws",
   "message": "Fuck Russia. That's what I think.",
   "created_utc": 1691616213,
   "score": 3,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhz17z",
   "message": "We are wasting our money sending it to them. The US taxes should go to the US citizens not to more military",
   "created_utc": 1691616582,
   "score": 3,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhr0t7",
   "message": "Still a backwater soviet state",
   "created_utc": 1691613609,
   "score": 2,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhv1u8",
   "message": "American people are generally short sighted about anything that happens across the pond. If Russia had walked into Ukraine and next messing with Poland etc, we’d be in a NATO war situation within a couple of years. Putin would see Lithuania, Estonia and Latvia next on his list. He’s been significantly weakened by this war. Which is a good thing.",
   "created_utc": 1691615100,
   "score": 2,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhwyjw",
   "message": "I support Ukraine and the people. They are incredibly strong and I hope they will win the war. \n\nI have always wanted to visit Kyiv one day. It looks like a beautiful country.",
   "created_utc": 1691615805,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhs3k3",
   "message": "Anything that makes Russia less dominant in Europe is a good thing.",
   "created_utc": 1691614011,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvht7tw",
   "message": "The media is regularly downplaying or neglecting to portray the scale of the devastation Ukraine is enduring. The sheer horror and depravity Russia is inflicting on their neighbors is bordering on attempted genocide. It seems like they want to erase Ukraine as a very concept. \n\nWhat makes people think they'll stop with Ukraine if we pull out and throw our hands up, saying \"it's not our problem.\" What kind of message will that convey to China and all the other aggressive authoritarian regimes around the world looking to expand their influence on a global scale?\n\nI hate being unnecessarily hawkish, but what's going on in real-time is bonechilling.",
   "created_utc": 1691614424,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhu1eq",
   "message": "I follow what is happening every day and have great respect. help from the west should be quicker, and tougher action should be taken against russian propaganda. unfortunately it's not that easy, but i'm convinced that ukraine will win this war.",
   "created_utc": 1691614725,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhvg0z",
   "message": "People have been treating eachother like trash on the coasts of the Black Sea for thousands of years, go outside or play your cat. \n\n\u0026amp;#x200B;\n\nIt's the samething over and over .",
   "created_utc": 1691615246,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhw6i8",
   "message": "Same as before. \n\nFeel bad for the people, them dying is a shit deal. Not really much different than Russian draftees dying is a shit deal. This is kind of a lose/lose scenario for everyone involved who isn't a political bigwig, and my concern for them is minimal. \n\nStill, it isn't the US government's responsibility to fix it. We ain't the world police, or at least, shouldn't be. Our tax dollars should be spent here. Individuals who feel called to donate to somewhat mitigate the awful situation are, of course, wonderful. Designing a big ol' cash funnel to the MIC is probably not that, though.",
   "created_utc": 1691615519,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhwudn",
   "message": "I support Ukraine and want them to win, but I'm still convinced it's going to end in a bright flash. I think Russia will lose, but they're going to go scorched earth on their way out.",
   "created_utc": 1691615763,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhzhhq",
   "message": "I could careless, the whole Ukraine thing was provoked by the United States and nato, the United States being the main aggressor, sure we can have the highest deficit in history, send billions worth to Ukraine, when Congress doesn’t approve the next aid package we do some fancy accounting. \n\nKeep in mind nato was designed to fight against the ussr without a ussr there is no need for nato. I don’t think what Russia is doing is right by any means, but the United States is to blame for stretching out the war for this long. \n\nTypical American hypocrisy, though who’s surprised though, the military industrial complex is going strong. \n\nBesides ww2 every single war that the American government has been a part of they are almost 70-80% of the time to blame for it. This country would be way better off return it back to isolationism. \n\nBut sure let’s keep giving aid left and right to countries while ignoring so many problems at home.",
   "created_utc": 1691616753,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhvs2k",
   "message": "I think the US should stop giving billions to a foreign country and help their own people",
   "created_utc": 1691615370,
   "score": 255,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhq9q3",
   "message": "i think y'all need to be given weapons that can reach Russian soil to diminish Russia's infrastructure, ability to wage war, etc. it has been pretty one-sided in that respect.",
   "created_utc": 1691613325,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhqhxw",
   "message": "I would love to visit one day, once that becomes possible again.  I really hope they rebuild the AN-225, that marvel of aviation.  The beast of the skies!  Fuck putin, I hope he gets the mussolini treatment.",
   "created_utc": 1691613411,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhqtz3",
   "message": "Still pulling for them. We (USA) have aided a LOT…some people say too much, but in reality, we’re helping innocents while sending a message to a maniac without getting in our own war (for now). That sounds shitty to say, but it makes sense.\n\nEDIT: I saw your comment, OP that you are Ukrainian and there. I wish you well.\n\nIdk how much you read about the US, but we all hate each other, so I guess the answer to your question is most people here forgot. Not everyone though.",
   "created_utc": 1691613538,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhrcof",
   "message": "I think they are brave and I hope all goes well",
   "created_utc": 1691613732,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhrkx5",
   "message": "I watch news and footage every day on YouTube or Reddit, and every day gives me hope that all those brave Ukrainian people inch closer to victory over those bastard, evil, invaders. Slava Ukraine",
   "created_utc": 1691613817,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhrtom",
   "message": "To be honest the rest of the world should stop Putin",
   "created_utc": 1691613908,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhryt3",
   "message": "My opinion has not changed since the early days of the Russian invasion.\n\nPutin decided to take the expansionist's road. Countless Ukrainians have been hurt or killed by this monstrous war. Were it not for NATO, Europe would be far less stable right now. African nations have lost much of their food security due to fighting.\n\nUkraine's defenses have fought beyond everyone's wildest dreams.\n\nComparing Russia's humiliation to the opening acts of WW2, I feel incredibly fortunate. We had an entire generation of American men traumatized and killed fighting against the similar designs of an immoral dictator.\n\nWere it not for the incredible resistance we've seen since February last year, we'd be faced with a huge likelihood of seeing that piece of history repeated.\n\nI hope the people of Ukraine continue to persevere, that they win against their invader, and that they can move on to the peace and prosperity they deserve.",
   "created_utc": 1691613962,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhsaoc",
   "message": "Certainly impressive.  \nThey both stood against the wave of Putin's slaves, and, managed to push back.  \n\n\nSo far, Ukraine is heavily inspirational, in all manners of speaking -   \nNation moral, army tactics, determination, leadership, how to gain support from the world and how to stand up to invaders.  \n\n\nNothing but respect, and Ukraine achieved something greater - Put Putin down.  \nHe won't stay long with is streak of failures, and Russia would be better off if he was gone.",
   "created_utc": 1691614086,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhslm0",
   "message": "I fully back Ukraine in its efforts to resist Russian aggression, I'm just not wild about all the money the US is spending in doing so. But, I think the US spends way too much on the military to begin with, and I'd rather our money go to Ukraine where it's useful, instead of some bloated military research project.",
   "created_utc": 1691614198,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhtlag",
   "message": "We should be giving them air support and assassinating that Murderer putin. Why are we even waiting?",
   "created_utc": 1691614562,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhug95",
   "message": "I'm a 30 something year old Canadian and I still strongly support the defense and sovereignty of Ukraine. Overall I am glad my country is supporting Ukraine but disappointed in the amount of military support has allotted to be sent over, but given how poorly our own military is funded I would say that it was bound to happen. Still though I continue writing to my government representatives, as do several friends and family members to let them know how we feel.\n\n On a less positive but still optimistic note I know that Ukraine like most previously soviet nations struggles with government and military corruption. My hope is that Ukraine ramps up its efforts to weed out corrupt officials that are hurting the war effort from within. It's unfortunate that during a battle for the continued freedom of the Ukrainian people that some traitors are using the war as an opportunity to line their own pockets. Every aid package and piece of military hardware counts and it needs to be made sure that it's all getting to the people who need it.\n\n I wish the best of luck to Ukraine and look forward to their induction into NATO to make sure this never happens again. Fuck every russian or allied goon that supports this imperialist war.",
   "created_utc": 1691614876,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhzw3l",
   "message": "cheer for them everyday. their struggle will be remembered for all time. the word \"heroic\" will always be connected to that country and its people.",
   "created_utc": 1691616908,
   "score": 0,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi0bto",
   "message": "A little worried about the suspension elections in the country, and the fact that the city of Kyiv has banned Russian music. I support the fight against Putin, but Ukrainians should also be war of the actions of their own government.",
   "created_utc": 1691617070,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi0rt6",
   "message": "They’re fucking badasses for fighting Russia. They need more support, more weapon systems, more training, more supplies.",
   "created_utc": 1691617236,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhw6b9",
   "message": "I don’t think the public support has decreased",
   "created_utc": 1691615517,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhwgbm",
   "message": "They don't deserve what has happened to their nation.  No one does.",
   "created_utc": 1691615619,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvhxw1w",
   "message": "Shche ne vmerla Ukrainy i slava, i volia!",
   "created_utc": 1691616152,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi0vqj",
   "message": "Really wished this never happened to them because now I gotta listen to them over here speaking fucking sputnik, probably talking about pierogi's and snow.",
   "created_utc": 1691617277,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi0vts",
   "message": "I hope they win",
   "created_utc": 1691617278,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi17p8",
   "message": "I’ve always had a lot of respect for Ukraine and Ukrainians. A lot of my family comes from that part of the world, a lot of friends, colleagues, and others in my life.  Ukraine will always have my support.",
   "created_utc": 1691617403,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi18oa",
   "message": "I’m surprised how many of UA refugees are literally just Russians with UA passports.",
   "created_utc": 1691617413,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi1ik9",
   "message": "I support you with all my heart and I hope my country (Poland) won't withdraw support any time soon.\nI am also ashamed of my fellow citizens, who are biased towards Ukrainians because of the history we share. We are a new, different generation, lets make our own history of love, kindness, tolerance and support. Stay strong.",
   "created_utc": 1691617515,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi22g0",
   "message": "I support Ukraine, and their people are braveful and strong.  \nI feel sorry when i think of people and things that had been lost in the war.",
   "created_utc": 1691617723,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi3soe",
   "message": "It is a great melting pot of cultures that has already had hundreds of years to ferment and still yet grows and has the most beautiful culture in Slavdom. I wish for nothing more than to stand by Ukraine in solidarity for it has been embracing freedom and the free spirit longer and under more hell than any other country.",
   "created_utc": 1691618385,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi4t4l",
   "message": "I don’t think anything as it is a Fake war. \n\nThe whole thing is just a money laundering scheme and zelensky was the chosen puppet",
   "created_utc": 1691618782,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi5ns8",
   "message": "\"Nobody is going to break us. We are Ukrainians!\" --Zelensky\n\n1. A beautiful country with rich soil for wheat and other crops.\n2. The population has been tried through the generations by one  tragedy after another. (The Mongols, Stalin, The Holomodor, Hitler, and now Putin.) They are patient, inmovative, resolute, and patriotic, l. I can't imagine how tough the past winter was when utility infrastructure was being bombed every night.\n3. The government is doing a good job in dealing with corruption, the best they can  with prompt investigations and arrests.\n4. A military led by a competent and innovative general staff.\n5. The rank and file military has demonstrated that they can be trained quickly and gain expertise on the varied NATO equipment provided to them.",
   "created_utc": 1691619120,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi65r3",
   "message": "I stand by them 100%.  But I just question what the endgame is -- how much of a slog it will be and what will be the end of it.",
   "created_utc": 1691619319,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi6cnc",
   "message": "I hope they win",
   "created_utc": 1691619395,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi6kf1",
   "message": "Слава Україні!",
   "created_utc": 1691619482,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi6l1z",
   "message": "Why? Has something happened?\n\nThe last I heard, they were sending Russians home in body bags.  I hate war, but Putin started this mess and it's time the mouse bit back.  \n\nI wish the US would support the Ukraine more.  I don't think Putin really wants to deal with being the bad guy in WWIII.",
   "created_utc": 1691619489,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi6vr9",
   "message": "I think they didn't plant enough sunflowers for the Russians",
   "created_utc": 1691619606,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi77ou",
   "message": "Still haven't located any Ukrainian takeout places",
   "created_utc": 1691619735,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi7r55",
   "message": "Proxy war by the military industrial complex to gain billions of dollars while the Russian and Ukrainian soldiers die for no reason\n\nI hate that we are sending billions of dollars without an end goal in mind and when US officials are asked what the end goal is there is no definite answer.",
   "created_utc": 1691619949,
   "score": 1,
   "submission_id": "15mpp72"
  },
  {
   "comment_id": "jvi92sg",
   "message": "I have very mixed opinion. This society didn't work well for me before and won't after",
   "created_utc": 1691620481,
   "score": 1,
   "submission_id": "15mpp72"
  }
 ]
}