{
 "submission_id": "15n3tst",
 "title": "What scares you the most about yourself ?",
 "selftext": "",
 "created_utc": 1691647428,
 "permalink": "/r/AskReddit/comments/15n3tst/what_scares_you_the_most_about_yourself/",
 "score": 37,
 "url": "https://www.reddit.com/r/AskReddit/comments/15n3tst/what_scares_you_the_most_about_yourself/",
 "comments": [
  {
   "comment_id": "jvjtzfc",
   "message": "How I come up with the most offensive and hurtful insults when I’m wronged to the point I don’t even prepare them in my mind.",
   "created_utc": 1691647639,
   "score": 37,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjukl4",
   "message": "That I hold everything until I explode",
   "created_utc": 1691648041,
   "score": 14,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvju183",
   "message": "I have suicidal ideations almost daily and sometimes the voices start to seem like they make sense. Thankfully, so far at least, I have been able to fight them and reach out for help for the sake of my four children, but I fear the day they really make sense and I give into them.",
   "created_utc": 1691647674,
   "score": 12,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvju9xr",
   "message": "How ready to go I am. No second thoughts sometimes. I just do things. I have no plans",
   "created_utc": 1691647840,
   "score": 9,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk0v6f",
   "message": "How content I am with doing absolutely nothing on my days off.  Note - I spend 8-12 hrs on my feet usually with no real breaks because I work in healthcare, so not being on my feet feels nice.  I get told how lazy I am when I decide to be a couch bum in my pajamas on my days off, but it also makes me feel like crap because I’m not doing something on my day off.",
   "created_utc": 1691652594,
   "score": 7,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjvd9f",
   "message": "I have a really mean nasty inner voice that I have to drown out with my nice rational voice. \n\nI get scared at times when I let the mean voice take over me. I wonder how nasty I can potentially be but then I remember being good or bad is a choice.",
   "created_utc": 1691648588,
   "score": 3,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjwj5i",
   "message": "I'll never apply myself to my fullest potential and I'm already over the hill.  I just want a decent job to get by in this life as I'm not out there to \"keep scores\".",
   "created_utc": 1691649415,
   "score": 4,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjtthd",
   "message": "No money",
   "created_utc": 1691647528,
   "score": 2,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjttva",
   "message": "My adhd causes burnout",
   "created_utc": 1691647535,
   "score": 2,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjtwvs",
   "message": "That my loved ones cherish me a lot, and I will die one day leaving them alone.",
   "created_utc": 1691647593,
   "score": 2,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjtxbc",
   "message": "There's a piece of me that's like biting down on tinfoil. I do what I gotta do to get by.",
   "created_utc": 1691647601,
   "score": 2,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk65a6",
   "message": "That I love being alone more than being with people. I have friends but I can literally go months without seeing them. Apparently loving isolation is a bad thing?",
   "created_utc": 1691656694,
   "score": 2,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjtpyk",
   "message": "I just nut nut no pullout",
   "created_utc": 1691647466,
   "score": 2,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjxa2k",
   "message": "If I die now then I've wasted the better half of my life on preparing for the rest of it for no reason.",
   "created_utc": 1691649945,
   "score": 2,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjugf9",
   "message": "Thats a lot to worry about have you talked to your loved ones about your fears",
   "created_utc": 1691647960,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk1tfi",
   "message": "That underneath my puritanical way of life and rigid morality is a part of me that has very low empathy and has the potential to hurt others. I strive to be good to people and I’m thankful that i was born with self control and a desire to live properly even if i need to over correct in order to do so. I am very afraid that if i had children one of them could be born with my bad parts but without a conscience and i refuse to discuss these things with a therapist or my family out of shame.",
   "created_utc": 1691653335,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk4xmp",
   "message": "My big mouth is gonna get me hurt someday.",
   "created_utc": 1691655740,
   "score": 0,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjtv2t",
   "message": "How forgetful I am, I joke around a lot about it with my friends but my memory really is so bad",
   "created_utc": 1691647558,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjv29t",
   "message": "That I don't really care about much. It's like a perpetual state of limbo. I only really care about paying my bills, so I work to pay them but that's about it. I don't believe I am depressed or anything. I just don't care enough about anything to do anything. It doesn't matter how dirty my house gets, I wont care enough to clean it. It's like I have no drive to do anything, and I'm almost ok with it. I know one day that I'm going to ask why didn't I do this or that. I've been a homebody for the better part of a decade now. Recently got back in touch with my parents and I've visited them a couple times in the last month or so. I didn't talk to or see my family at all for like 5-6 years, not even on christmas or thanksgiving. I just didn't care to go, and i suppose looking into the future that is what scares me, not knowing if this is who I am or if there is really something wrong with me, but not concerned enough to fix it.",
   "created_utc": 1691648377,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjvdo9",
   "message": "Sometimes I hear people say something and it seriously sounds like a foreign language for a second until my brain puts it together. I feel like it happens way more than it should. But idk maybe my friends and family are just a bunch of mumblers",
   "created_utc": 1691648595,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjw0hn",
   "message": "My thoughts",
   "created_utc": 1691649046,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjw4g0",
   "message": "I have no idea what I’m going to do with my life, I have no drive or inspiration to do anything. I’ve always been jealous of those kids who knew exactly what they wanted to be when they grow up and then achieved that goal. Edit. Thanks so much for the silver!",
   "created_utc": 1691649123,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjxrpo",
   "message": "I'm the kind of guy to be nice and speak my mind but people always see me as a aggressive person and I have some context if someone pushes me I will snap but it takes a lot but there was been moments were someone will never recover their ego so I need help with this can I get advice on how to be a better person with this",
   "created_utc": 1691650297,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjy2ed",
   "message": "It has been like 6 years since I met anybody I was really excited about, both women or just as friends. I'm afraid that as I get older I'll just be alone, even if I interact with people.",
   "created_utc": 1691650512,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjy4rc",
   "message": "The fact that, when I really sit down and think about it, I can’t really see the point to life... not in a suicidal way, it just seems like in the grand scheme of things everything I do is insignificant and unremarkable and will be forgotten.",
   "created_utc": 1691650559,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjyel7",
   "message": "My lack of empathy. I try to be empathetic towards people but I just can't feel genuine empathy it feels like, just fake.",
   "created_utc": 1691650761,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvjypxf",
   "message": "My anger. I don’t want to be angry, and it scares me when I am.",
   "created_utc": 1691650992,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk0367",
   "message": "That i know to myself that i can end my life if i really want to do it. If i let my inner thought win id be probably dead by now.",
   "created_utc": 1691652004,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk0n50",
   "message": "The fact that if I got really upset and had nothing to lose I would outright destroy someone’s phone for good or idk hurt someone physically even though it’s a family member.",
   "created_utc": 1691652419,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk23xf",
   "message": "I want to just completely sabatoge my life sometimes. I’m in grad school. I have a great guy. I have mental peace for the first time ever. And just sometimes ..",
   "created_utc": 1691653563,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk2xx0",
   "message": "The fact that my idea of proper response to relatively minor slights is VASTLY disproportionate. Someone cutting me off in traffic means, by base knee-jerk reaction, following them, burning their house down and beating them into a bloody pulp while making their partner watch. Its NOT healthy.",
   "created_utc": 1691654203,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk3jtq",
   "message": "How easy it is to jump to violent thoughts after being wronged. I wouldn’t do them obviously 😅",
   "created_utc": 1691654672,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk43or",
   "message": "My inability to notice when people are fucking with me, love bombing me, or manipulating me. \n\nIt's better. Much better. But I still don't trust my judgement just yet.",
   "created_utc": 1691655098,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk4acq",
   "message": "Mustard is what?",
   "created_utc": 1691655242,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk59he",
   "message": "I always try to be fair and considerate, but if I had power over others I'm afraid I would abuse it",
   "created_utc": 1691655998,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk59yo",
   "message": "My flaky mind. The speed at which I gain and lose interest in anything/anyone. Ruined lives before, but also became jack of a wide spectrum of things.",
   "created_utc": 1691656008,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk5nrq",
   "message": "Mind snapping.",
   "created_utc": 1691656314,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk68km",
   "message": "Acting on my suicide thoughts unconsciously.",
   "created_utc": 1691656768,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk6koi",
   "message": "Not technically myself (50M), but not finding someone else to be attracted to and grow old with.",
   "created_utc": 1691657036,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk6vrz",
   "message": "How easy I convince myself to keep sleeping until last minute",
   "created_utc": 1691657281,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk6y62",
   "message": "I absolutely lose any and all empathy for people once they've passed a certain point that I can't really identify. Not an exaggeration, once my mind has associated them with being past this mystery point I would do absolutely nothing to help this person in any situation unless it involved a direct gain for me. There are a few people out there who my mind has associated as being beyond this point, and I avoid them like the plague because I act really strange around them",
   "created_utc": 1691657335,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk783e",
   "message": "My ability to lie and get away with it without feeling guilty.",
   "created_utc": 1691657549,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk7iz9",
   "message": "My ability to neglect myself.",
   "created_utc": 1691657783,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk7phi",
   "message": "I'm self districting myself while maintaining a good job and friends without anyone knowing.",
   "created_utc": 1691657925,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk7q11",
   "message": "That when i snap, i snap there is no remorse just a wild animal that fights back with everything there is\n\nTo sum it up there is a monster in me",
   "created_utc": 1691657936,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk7tbb",
   "message": "My impulsivity",
   "created_utc": 1691658008,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk8bx3",
   "message": "I know that.",
   "created_utc": 1691658408,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk8f3q",
   "message": "I have a poor memory that is only getting poorer with my shitty sleep habits that I can't even change.\n\nIt's scary when you are on the road and have to wonder \"do I have to pee?\" and then realize you peed at the doctor's office...a good 15 minutes ago.",
   "created_utc": 1691658474,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk8hop",
   "message": "It would not bother me in the slightest to take the life of another person under the right circumstances. Me \u0026gt; you",
   "created_utc": 1691658531,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk8o4e",
   "message": "The only thing stopping me from having a complete mental breakdown is me remembering to take my meds",
   "created_utc": 1691658670,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk8o9j",
   "message": "My lack of anger.",
   "created_utc": 1691658672,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk9754",
   "message": "My roid rage.\nJk. Rage was there before. Im actually calmer  now",
   "created_utc": 1691659079,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk99o4",
   "message": "My mind and it's ability to overthink the hell out of everything",
   "created_utc": 1691659134,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk9ag8",
   "message": "How bad I can fuck up my life",
   "created_utc": 1691659150,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk9b53",
   "message": "Look in the mirror",
   "created_utc": 1691659164,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk9eg4",
   "message": "People pleaser",
   "created_utc": 1691659235,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvk9f7a",
   "message": "When I very, very occasionally get angry.",
   "created_utc": 1691659250,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkaey4",
   "message": "[deleted]",
   "created_utc": 1691660004,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkak6j",
   "message": "My anxiety. I’m scared of losing all the hard work I’ve done to get me this far. I over think every little thing I do most of the time. But it’s a cover up to suppress my bad mental issues I still face deep down in my soul. The fact that one intrusive thought can bring me on the brink of spiraling back to my old self is scary to me.",
   "created_utc": 1691660113,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkapso",
   "message": "My anger issues.\nI have a horrible temper that scares me.\nI have always been angry.\nI spent most of my life trying to keep it buried and for good long time I had succeeded. \nThen about 6 years ago my father got cancer and my anger came to the surface again.\nHe passed away 3 years ago and i am at peace with it but then about 4 months after that my cousin who was my best friend in the world since I was 3 died.\nIt  fucked me up pretty bad. \nI'm 49 years old and have been in more fist fights since I turned 40 than probably the rest of my younger years. \nI am going to get my ass kicked good one if these days but it won't be today. \nWhen it comes down to it I always try to reason with them first but they seem to think it's because I'm scared. It's not.\nMy temper takes over and I lose control of myself and inflict damage to these people that is way beyond a normal fight.\nThen I feel bad about it. \n\nI've been to anger management 3 times and all I've learned is how to choke someone with a smile on my face. \nI've never hit my wife of 30 years or beat my kids out of anger. \nI'm glad for that.\nCounseling doesn't help either. It's always some doche that just wants to medicate me and tell me some bullshit.",
   "created_utc": 1691660227,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkawog",
   "message": "I don’t know how much damage I can do to another person…",
   "created_utc": 1691660373,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkb7ps",
   "message": "My laziness.",
   "created_utc": 1691660599,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkc4m0",
   "message": "I'm very emotional, a crybaby, scared but at the same time losing faith with myself. suicidal thoughts or feeling tired to being alive pop up in my mind. However i tried my best to hide in front of everyone else. 24/7 tired yet my sleep is easily disturbed (sudden woke up in the middle of the night). Lately in a 'survival mode' where i have no energy to do literally anything. My ears be like cant hear whatever people are talking. Being anxious with people. Dont like asking help from other people so i always keep things for myself, since i always believe they will be tired with me one day. Probably have more things but only those for now.",
   "created_utc": 1691661273,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkccc2",
   "message": "At this moment? My anxious attachment style.",
   "created_utc": 1691661429,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkcdqo",
   "message": "The thoughts won't stop",
   "created_utc": 1691661458,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkck8a",
   "message": "That I get lazy at times",
   "created_utc": 1691661591,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkckxd",
   "message": "I enjoy the silence, being alone, ready to die.",
   "created_utc": 1691661606,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkcnwj",
   "message": " Honestly everything- but im finally at peace with it.",
   "created_utc": 1691661666,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkcou2",
   "message": "That I've ended up as the only person in the world my son truly has to rely on, how stressful that responsibility is on me, and even though I'm nothing particularly special, how horrifically destroyed he'll be if something happens to me. \n\nThe fear and stress of it paralyses me at night.",
   "created_utc": 1691661684,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkcril",
   "message": "I carry my pain around with me like a knapsack instead of letting things go.",
   "created_utc": 1691661740,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkcug9",
   "message": "The things I know about the people and still choose to keep quiet for their sake and mine as I don't like drama.",
   "created_utc": 1691661800,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkcygo",
   "message": "I might end up in the dark market and the dark web out of boredom because everyone around me is boring.",
   "created_utc": 1691661878,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkcz9k",
   "message": "What I'm capable of under certain situations of duress (be it self-defense or defending my loved ones), I would black out only to be mortified of the outcome when i come to. I'm not a violent person, but I know it stems from trauma.",
   "created_utc": 1691661893,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkdczy",
   "message": "Not related to the question but a big shoutout to the OP - replying to almost everyone here! We could have someone in this thread who have never spoken about these things and just knowing that someone did listen makes a huge difference:)",
   "created_utc": 1691662163,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkdihy",
   "message": "My mind is a never ending tunnel of analyzing myself and everything around me. \"Dad told me to tell him next time the sink is clogged\" \u0026gt; \"I struggle asking for help\" \u0026gt; \"I struggle asking for help because nobody helped me when I needed it most\" \u0026gt; \"I can't trust him because of all the abuse\"\u0026gt; \"I need to take more responsibility for myself and stop blaming it on others\" \u0026gt; \"but asking for help is never a bad thing\" \u0026gt; etc etc etc. It just keeps going and going and going and going and I don't know how to stop it.",
   "created_utc": 1691662272,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvke4rd",
   "message": "My anger hasn't exploded yet.",
   "created_utc": 1691662702,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvke5jm",
   "message": "My need to constantly have fun",
   "created_utc": 1691662717,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkemip",
   "message": "I’m honestly a sociopath and one of these days I’m gonna ruin the life of someone who wrongs me if they test me",
   "created_utc": 1691663030,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkexjk",
   "message": "That I know that if i were to be r*ped again.. (which isn’t that unlikely considering I’m still young and in college) I wouldn’t survive it..",
   "created_utc": 1691663236,
   "score": 1,
   "submission_id": "15n3tst"
  },
  {
   "comment_id": "jvkf1ei",
   "message": "The blood condition that will probably end up killing me.",
   "created_utc": 1691663308,
   "score": 1,
   "submission_id": "15n3tst"
  }
 ]
}