{
 "submission_id": "15p5nuq",
 "title": "What is it that you invested thousands of hours and now is pointless?",
 "selftext": "",
 "created_utc": 1691849563,
 "permalink": "/r/AskReddit/comments/15p5nuq/what_is_it_that_you_invested_thousands_of_hours/",
 "score": 1,
 "url": "https://www.reddit.com/r/AskReddit/comments/15p5nuq/what_is_it_that_you_invested_thousands_of_hours/",
 "comments": [
  {
   "comment_id": "jvw027a",
   "message": "I got a B.S. in biochemistry, then drove a forklift for 14 years. Now I'm an electrician.",
   "created_utc": 1691858017,
   "score": 20,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvoez0",
   "message": "I know all the tricks to make a website look as good in Internet Explorer 6 as in Chrome, Safari or Opera.",
   "created_utc": 1691853333,
   "score": 41,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwin7g",
   "message": "Not hours per se, but lots and lots of money.\n\nWhen I was a kid, CDs were king. This was also back when a typical cd was like $16 at Sam goody etc.\n\nI’d mow lawns in my neighborhood - 4 houses on a weekend, and get $10 each, which was good for about a dozen albums a month.\n\nMy parents also gave me lunch money for school - $2 a day - which I pocketed for another album a week.\n\nSo basically I sacrificed nutrition and my weekends for the entirety of my middle school / early high school years to build up a massive album collection that was the envy of all my musician friends.  It was glorious. \n\nI thought for sure this would be the crown jewel of my adulthood and that I would pass them on to my kids someday. \n\n….and then when the iPod / iTunes came out it was all pointless lol",
   "created_utc": 1691865025,
   "score": 70,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwc7qq",
   "message": "It took me 8 years to get my Chemical Engineering degree. I never worked a single day as a Chemical Engineer. I'm a Data Analyst now.",
   "created_utc": 1691862693,
   "score": 57,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvm7re",
   "message": "This is the life of a geneticist.\n\nThe field moves quickly with the technology and techniques, but they are all very complex and difficult to learn. More than once in my life, I have poured myself into a specialized skill to be the best in the building, only to have that skill be obsolete the next year.\n\nIt never feels that bad, though, because the replacements are almost always faster, easier, and get you better results or else they don't really take off.",
   "created_utc": 1691852448,
   "score": 109,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvw3z7j",
   "message": "Minecraft.  From 2011 to probably 2018-2019 it was like, my go-to depression game.  When my depression got bad, some days I'd play for 12 hours.  Built a whole huge city with districts, multiple tall buildings, rail system, a mob zoo, etc.  I kinda miss it sometimes.",
   "created_utc": 1691859582,
   "score": 155,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvvi8x",
   "message": "I spent half my Army career in various schools learning to repair nuclear missiles. Now I'm doing desktop support and teaching the new guys how to install printers remotely.",
   "created_utc": 1691856153,
   "score": 106,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwicsm",
   "message": "moderated a subreddit",
   "created_utc": 1691864920,
   "score": 211,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvxkaa",
   "message": "Sorting and organizing my mp3 collection",
   "created_utc": 1691856993,
   "score": 22,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwh498",
   "message": "I built a customer service team from the ground up to support a client's new product. Became the highest rated customer service group in the entire business. One day our phones went dead, called to test the line, was routed to a different customer service team. We'd been outsourced and they didn't have the heart to tell us in advance.",
   "created_utc": 1691864469,
   "score": 193,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvw8xaq",
   "message": "Indigenous knotting. \n\nI used to be able to make the most beautiful dresses, armors, and regalia using traditional knotting and beading techniques. \n\nBroke my arm about a decade ago, got fat, and got arthritis. Now my hands don't even work well enough to teach the next generation how to do it.",
   "created_utc": 1691861488,
   "score": 178,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvp7ot",
   "message": "WoW. I haven't talked to any of my old guildmates in years. I got server first kills and worked my ass off to be the top of my game, and it means next to nothing.  \n\nI look back on the time I spent fondly and wouldn't trade the experience for anything. But it really does nothing for me.",
   "created_utc": 1691853655,
   "score": 150,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvreqj",
   "message": "Asian parent piano lessons. Didn't make them happy, didn't make *myself* happy, never got any good at it, gained no useful skills whatsoever for the several hundred hours per year for multiple years spent practicing",
   "created_utc": 1691854537,
   "score": 223,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvqz7x",
   "message": "Reddit",
   "created_utc": 1691854366,
   "score": 76,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvp1wx",
   "message": "Runescape, but its been pointless since day 1",
   "created_utc": 1691853591,
   "score": 47,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvttof",
   "message": "I got an aviation degree because it used to be the only way you could qualify to become and air traffic controller. The age cut-off is 30 and I graduated when I was 29. Well, they decided to “restructure” the hiring process mere months after I graduated and cancelled all hiring panels for 2 years. I aged-out and now have a fucking useless degree that I still pay students loans on.\n\n\n\nEDIT: First, thank you for the huge response. This happened about 11 years ago. I am making a lot of money doing something I love in another industry so don’t worry about me. It was devastating at the time but I’m content in what I’m doing now. (Had to edit that again because of all the people who are negative about hearing “everything happens for a reason” and “living my best life”) I’m happy and successful and if you can’t live with that, go be negative somewhere else. \n\nTo answer the most common question on here:\n Why is 30 the cutoff age?:  This is a very high-stress job that requires you to have a sharp mind at all times. It’s like playing a mathematical puzzle that kills 300 people if you fuck up. They offer/encourage retirement with pension at 55, but you need 25 years of service to be eligible, hence the oldest you can be to start the job is 30 years old.",
   "created_utc": 1691855481,
   "score": 77,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvpvct",
   "message": "I took 2 years of French instead of Spanish in high school. I live in Texas.",
   "created_utc": 1691853923,
   "score": 12,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwa362",
   "message": "When I was 20 I got a job at an up and coming tech company. 6 months later they went IPO in a big way, and I was worth $2M on paper.\n\n6 months later the market crashed and the stock tanked. Before I was legally allowed to touch the shares",
   "created_utc": 1691861928,
   "score": 180,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvqt9t",
   "message": "I managed to accidentally wipe the drive that held all my work.  I'm a semi-professional game dev, there was 10 years worth of meshes, materials and code.\n\nIt's been 10 days, I've just been in a sort of state of shock, having tried and failed to recover the lost files.",
   "created_utc": 1691854300,
   "score": 7,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvn7fx",
   "message": "Being a decent, hard working employee for a large multinational corporation",
   "created_utc": 1691852848,
   "score": 183,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvnpzb",
   "message": "I have a bachelor's degree in Astronomy from one of the world's best universities.\n\n\nI now work as a software engineer.",
   "created_utc": 1691853053,
   "score": 27,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvi6oo",
   "message": "I spent over a decade learning how to draw, studying design techniques, etc. Tried to work as a professional designer and illustrator and it was terrible and made no money. Now I'm a software developer. Every once in a blue moon it's useful for making graphics, but really just pointless.",
   "created_utc": 1691850785,
   "score": 168,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwqpcy",
   "message": "I studied graphic design at a time when the industry was just adopting Illustrator and Photoshop. The schools, however, weren't. I learned so much about paste up and how to use a copy machine to get the very, very most out of it and calculating percentages for enlarging/reducing and inking with French curves and waxing a block of text to lead it by hand and .... oh god, so much pain in the ass hand drawn, hand cut elements that were immediately rendered useless as soon as I got my first job.\n\nSometimes I miss it. Then I remember pasting up whole paragraphs of text and remember that I don't, actually. I have really good crafting skills though.",
   "created_utc": 1691868172,
   "score": 130,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvx7fbp",
   "message": "At the end of the 90’s, I decided to digitize my entire DVD collection into MP4’s. I had more than a 1000 titles. I had a computer specially dedicated to this task, at the rate of one dvd every night i remembered to do it.\n\nI burned through 3 different disk drives. \n\nIt took me 4 years to finish. \n\nNow, everything is streaming in HD or 4K, on your phone. \n\nAnybody interested in a 720p interlaced copy of Octopussy? \n\nDidn’t think so.",
   "created_utc": 1691875023,
   "score": 136,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvgx0n",
   "message": "Every NBA 2K since 2K13",
   "created_utc": 1691850240,
   "score": 159,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvw60t",
   "message": "I worked in high tech for 40ish years.  Almost everything I learned became obsolete.  It’s a treadmill.",
   "created_utc": 1691856422,
   "score": 57,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvpc8e",
   "message": "Sanskrit lessons in school. Not once have I used that language since I gave my 10th exam.",
   "created_utc": 1691853704,
   "score": 197,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvw9xgg",
   "message": "My PhD. Its fucking worthless and im done with academia. Now i work in a corp mindlessly filling excel spreadsheets for twice the money i was paid and i ve never been happier in my entire life.\n\nEDIT: I ve got PhD in STEM, still its fucking worthless cuz nobody is hiring out here and i dont have some crucial skills to move abroad and get a decent job. Im sick of working overtime for free, deans' stupid policies, falsyfing results. I got a notification on LinkedIn that a financial corp is opening new branch in my city, i applied for \"Junior Data Analyst\", but honestly all i do is filling excel spreadsheets, making bar charts and reporting anything unusuall.",
   "created_utc": 1691861868,
   "score": 116,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvn05l",
   "message": "My marriage.",
   "created_utc": 1691852768,
   "score": 61,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvmpwz",
   "message": "Marriage. 32 years together. Knife in the back.",
   "created_utc": 1691852655,
   "score": 32,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvx61s4",
   "message": "I am a professional fingerboarder.\n\ne: some [footage](https://www.youtube.com/watch?v=oKZpk8ISwsM) lol",
   "created_utc": 1691874444,
   "score": 207,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvy8x0",
   "message": "I was a Jehovah's witness for 30 years, average of 15 hours a month knocking on doors, preaching Armageddon that never will come. Free for 23 years now!",
   "created_utc": 1691857268,
   "score": 89,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvlxer",
   "message": "Prepping\n\n(if nothing apocalyptic ever happens)",
   "created_utc": 1691852329,
   "score": 0,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwxfaz",
   "message": "In the 90s, my brother worked as fire watcher in Minnesota near the border. He lived in some remote location. Power but no phone.  They cached his supplies for several months. Then nothing. Half-starved, he finally came out of the woods to see what was what. \n\nHe'd been laid off. No one told him. No money in his account. Everybody was laid off and gone. Office dark.",
   "created_utc": 1691870913,
   "score": 135,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvx87by",
   "message": "I studied and trained to be a professional opera singer for 12 years, ended up not being the right path for me after a diagnosis of bipolar disorder this year. In my early thirties and never imagined I'd be in this position.",
   "created_utc": 1691875343,
   "score": 91,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvntlo",
   "message": "Beta -\u0026gt; VHS -\u0026gt; DVD -\u0026gt; digital -\u0026gt; 4k\n\nHow many times?",
   "created_utc": 1691853093,
   "score": 31,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvx52u7",
   "message": "I can't believe I've scrolled this far and not seen Facebook yet. People lived their lives on there until suddenly nobody did.",
   "created_utc": 1691874038,
   "score": 148,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwwwkl",
   "message": "A bachelor's degree in Interior design... But I graduated in 2008 and there weren't any jobs in my field because the recession had wiped them out. The industry has recovered, but by the time it had, I'd gone back to school for massage therapy, and the thought of leaving a low-stress career for a high-stress career just didn't seem like a great plan. I've now owned my massage business for 13 years and I have a great work/life balance, but paying student loans on something you'll never really use is ROUGH.",
   "created_utc": 1691870702,
   "score": 76,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvopyl",
   "message": "Art. I used to draw multiple hours almost every day. It didn't go anywhere unfortunately. And my skill level was... Not that high to put it mildly.",
   "created_utc": 1691853457,
   "score": 114,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwbohb",
   "message": "Self development books, psychology books, and biographies to find out what the fuck is wrong with me.\n\nOne 30second information video about ADHD changed my life. The clouds parted. \n\nI'm now on medication, and living the life I wanted to create for myself by taking a simple pill every morning. It took 37 years, but I'm now the person I felt was locked in there since I was a child. I'm so happy I could cry. Well almost. I still haven't cracked the code on that one, but I'm pretty damned happy. Not to mention a better husband, father and worker.\n\nEDIT: \nThe tik tok video in question just made me curious about ADHD. It basically said: \"Hello you're probably seeing this because the algorithm thinks you have ADHD, look at my channel for more.\"\n\nI scoffed, because I thought ADHD was something completely different, but I checked the channel out. There was this doctor (I think) listing signs and symptoms of ADHD. The videos made me curious enough to learn more about ADHD, so I took some online tests and read a little about it before contacting my doctor get a proper diagnosis.\n\nI can't find the video itself, I deleted tik tok a long time ago.\n\nEdit 2: If you suspect having ADHD, please get a medical professionals opinion. Do not self diagnose. \n\nTip: do a little research on your own beforehand, and make a list of the things you have problems with in life that you think can be traced to ADHD. It makes the doctor or psychologists job easier, and might speed up the process.\n\nIt could be things like; \nnot being able to hold a job, pay bills on time, stay in relationships, blowing money on new hobbies every month, not being able to study, lack of impulse control, and a lot more.\n\nThere is alot of different types of ADHD, it's a spectre. You can also have ADHD traits without having enough of them to get a diagnosis.",
   "created_utc": 1691862503,
   "score": 136,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvjxrj",
   "message": "Flintknapping. It always was pointless(but not, eh? Get it?) but so much fun",
   "created_utc": 1691851509,
   "score": 55,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwcmhq",
   "message": "Being a musician. No regrets really, but I definitely did not have the hustle or look to make any money at it. Also, really did hate the nasty folks that would just hate you for being good. It's lonely at the top, then someone who is a prodigy brings home the reality that if you don't have the resources or luck to really make make it it's just not worth the 50.00 a gig. I also was just depressed getting into being pro and realizing just how much talent is actually out there. Watched a girl who could sing better than anyone I've ever heard lose out on a life-changing gig because she was not the right look. The cards have to be right. Talent is not wasted, but it's really hard to make a living at it. Gotta be a gambler. Now I haven't played in years. Miss it.",
   "created_utc": 1691862841,
   "score": 194,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvq7ww",
   "message": "I've played over 4000 hours of The Sims 4.",
   "created_utc": 1691854063,
   "score": 133,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvmz4l",
   "message": "Drafting. Three years in high school plus summers in preparation for architecture school. That lasted one 10 week term before switching to history. It turns out I enjoyed the software side of CAD because I now work with digital humanities and online collections of materials.",
   "created_utc": 1691852756,
   "score": 187,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvpxw6",
   "message": "Drinking alcohol.",
   "created_utc": 1691853952,
   "score": 227,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvuzxu",
   "message": "Aikido. Got the 2nd dan and then realized it wouldn't help me achieve what was initial goal, i.e. be able to defend myself.",
   "created_utc": 1691855949,
   "score": 119,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvfois",
   "message": "I played around 12k hours of soccer, got pretty good at it but it didn’t worked out so now I’m an engineer that secretly can play soccer at professional level",
   "created_utc": 1691849706,
   "score": 59,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvudl0",
   "message": "These Websites  \n\n* [radio.garden](https://radio.garden/visit/novo-mesto/w1Wiki0r) : Listen to radio around the world\n\n* [Lp.deals](https://lp.deals/) : Products at their lowest price right now \n\n\n\n* [libgen](https://libgen.is/) - download almost any textbook as e-copy\n\n* [sci-hub](https://sci-hub.mksa.top/) - gives free access to download almost any paper.\n\n* [Terms of Service, Didn’t Read](https://tosdr.org/) summarizes terms of service and rates them for privacy.\n\n* [futureme.org](https://www.futureme.org/) you can use it to \"send emails to the future you\". been using it for almost 3 years. It helps put into perspective how much has changed over the course of a year.\n\n* [photopea](https://www.photopea.com/) Online image editor with Photoshop feature.\n\n* [12ft](https://12ft.io/) It bypasses all paywalls and removes all ads from any webpage I have found. Show me a 10ft paywall, I’ll show you a 12ft ladder. No install, just copy and paste your link\n\n* [oldgamesdownload](https://oldgamesdownload.com/) : This website has every single pc game from the 70's,80's,90's till the early 2000's.\n\n* [myAbandonware](https://www.myabandonware.com/) is a far better option than old games download\n\n* [flightradar24](https://www.flightradar24.com/52.52,13.39/4) : Wondering where that plane, jet, or helicopter is going? Check them out (NOTE :Dont buy anything on that site just use it for further info only)\n\n* [unsplash](https://unsplash.com/) : Tons of free-to-use images of damn near everything.",
   "created_utc": 1691855704,
   "score": 41,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwgro4",
   "message": "Animal Crossing New Horizons. Pointless? Technically. A pass time that brings me impeccable joy? Yes. I started playing in the throes of Covid quarantine and never put it down. I have like 2400 hours invested in the game.",
   "created_utc": 1691864343,
   "score": 58,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwqm5e",
   "message": "I worked for my dad for years for basically minimum wage. I was entitled to the profits of one of our stores. I worked my ass off to get expenses down and revenues up, and increased my involvement with the management of the other stores, and finally I was in good shape to earn, and then after all that he unilateraly \"renegotiated\" the deal so I'm still basically making minimum wage.",
   "created_utc": 1691868136,
   "score": 54,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvx9f7j",
   "message": "Starting a collegiate sports team. I spent my entire college career working to build a fully sponsored collegiate equestrian team while balancing a biochem major. \nI spent ages building a team, finding a host barn/trainer, dealing with insurance, constantly presenting to our athletic department, fundraising, running team meetings, planning travel events, etc. So much work went into preparing it. Let alone, practicing, and training for shows. We started at the bottom and, after 3 years, were consistently pinning 4th out of all schools in our zones. I earned my own horse, fully sponsored, as a retrain project. I was at the barn from 4am till my classes, then back in the evening. Then back home to study before I repeated everything. \n\nMy entire 4 year career was horseback riding/competing and studying. I never went out, I barely made friends. Any free time I had was for studying or working in the lab on research. My senior year of college I got bullied out of my own team because of a guy I started dating. He was from Peru and everyone spread rumors of him being a drug dealer- I hated how they handled things \u0026amp; they completely isolated \u0026amp; alienated me. \n\nWhat a waste of time. \n\n8 years later and the team is extremely successful. Almost all information of me \u0026amp; my work to start the team was essentially erased. The school makes a lot of money as a bunch of students choose the schools specifically for their riding program.",
   "created_utc": 1691875844,
   "score": 52,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvviioi",
   "message": "Overwatch \n\nI stuck with it for a long time with hopes of OW2 pure PVE gaming fueling me. Then OW2 dropped. Without its pve. And now they cancelled pve altogether. And the battlepass sucks butt so the pvp doesn’t even have anything left either.",
   "created_utc": 1691850922,
   "score": 55,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvw9msp",
   "message": "Trying to maintain a relationship with a narcissist parent . \n2 years contact free ❤️💪",
   "created_utc": 1691861757,
   "score": 139,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvyrnw",
   "message": "Working out without dieting properly",
   "created_utc": 1691857484,
   "score": 141,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvw9xam",
   "message": "You don’t realize how hard it was to invest 1k in bitcoin in 2010....you had to do a shady wire transfer to an exchange that went bankrupt...then you would of had to not left it on said exchange...put it in an offline wallet...then not have the hard drive blow out...then not let the hard drive go to a landfill erroneously",
   "created_utc": 1691861867,
   "score": 64,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwfwqd",
   "message": "7 years in a relationship with a man who promised he wanted to build a life together but never actually followed through. I finally got the message.",
   "created_utc": 1691864032,
   "score": 203,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvlb1i",
   "message": "Not literally 1 000s of hours, but - I was obsessed playing piano in high school. Not that it is bad inherently, just that I don't have any use for it afterwards. I didn't want to turn it into a career (the \"make a hobby a chore\" downfall), and I can't find time to do it during university. There just isn't enough return (whether it be social or economic) for me to practice it. I wish I could find purpose in playing again",
   "created_utc": 1691852068,
   "score": 127,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvvj3r8",
   "message": "Michelle",
   "created_utc": 1691851159,
   "score": 79,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvw1nwb",
   "message": "I spent a lot of time studying anatomy, biology, etc. Was sure I was going to med school and was a biology major. \n\nI just graduated with a theatre degree lol. Now I have two useless things! :)",
   "created_utc": 1691858657,
   "score": 127,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwberw",
   "message": "ANXIETY",
   "created_utc": 1691862404,
   "score": 220,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvwci7g",
   "message": "Pirating, ripping, organizing and updating my 198 gigabyte mp3 collection.",
   "created_utc": 1691862797,
   "score": 43,
   "submission_id": "15p5nuq"
  },
  {
   "comment_id": "jvy698l",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15p5nuq"
  }
 ]
}