{
 "submission_id": "15pfm0i",
 "title": "What’s the worst reason you hooked up with someone?",
 "selftext": "",
 "created_utc": 1691874360,
 "permalink": "/r/AskReddit/comments/15pfm0i/whats_the_worst_reason_you_hooked_up_with_someone/",
 "score": 13,
 "url": "https://www.reddit.com/r/AskReddit/comments/15pfm0i/whats_the_worst_reason_you_hooked_up_with_someone/",
 "comments": [
  {
   "comment_id": "jvyldfl",
   "message": "Late to the game, but had a friend in college who shared a resemblance to me. We'd go to parties and introduce ourselves as brother and sister the whole night, really play the part. Then we'd end each night making out furiously in front of everyone.",
   "created_utc": 1691898398,
   "score": 41,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxmy67",
   "message": "She told me her therapist told her to have sex with me. So I obliged. Who am I to argue with a professional?",
   "created_utc": 1691881659,
   "score": 165,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvy6eoe",
   "message": "My first long term gf cheated on me when she went off to college. We broke up. About two months later she got hit by a transportation bus and lost her leg. We had seen each other a couple times after her recovery and hooked up. Years later I meet another girl with the same first name through a different ex and she had lost her leg too. I was thinking what are the odds of someone else being able to say they slept with two girls with the same name with both missing a leg….   So. I did the deed",
   "created_utc": 1691890710,
   "score": 46,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvx912u",
   "message": "She was hitting on my friend and he wasn’t down, so he said “save me”. Reverse wingman lol.",
   "created_utc": 1691875681,
   "score": 148,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxlnh3",
   "message": "My best friend (I'm M she's F) hadn't had sex in a year and asked me. \n\nWe stopped being friends in any capacity after that.",
   "created_utc": 1691881083,
   "score": 169,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxh1wa",
   "message": "Was offered a box of donuts in exchange for my sex. She only ended up getting me a half dozen. Still feel some way about it.",
   "created_utc": 1691879056,
   "score": 220,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxe0i2",
   "message": "Almost dated in high school. Had a falling out in college and didn't talk for years until we both attended a mutual friend's wedding. We were the only single people there and neither wanted to go home empty handed. So we didn't...",
   "created_utc": 1691877745,
   "score": 66,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxlxc1",
   "message": "We both had the same name and thought it would be fun to call out our names in the heat of it...",
   "created_utc": 1691881205,
   "score": 66,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvx6ago",
   "message": "Boobs.\n\nI used to have a recurring pattern of bad decisions pivoting on nothing but boob.",
   "created_utc": 1691874543,
   "score": 177,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxnr72",
   "message": "He cheated on me with his roommate’s girlfriend. So obviously his roommate and I hooked up for some revenge. It was excellent and I regret nothing.",
   "created_utc": 1691882022,
   "score": 44,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxg29q",
   "message": "I was horny",
   "created_utc": 1691878627,
   "score": 74,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxj0i8",
   "message": "I felt unattractive after my ex cheated on me and I needed someone to tell me I wasn't.",
   "created_utc": 1691879920,
   "score": 7,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxlbc2",
   "message": "Simple democracy. My balls told me too and since they outvoted me 2 to 1, I really had no choice.",
   "created_utc": 1691880934,
   "score": 98,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxiybf",
   "message": "Noticed a girl picking up on numerous drunk guys at a party, taking them to a back room for a few minutes each, then coming back out, with the guys smiling. I was horny and wanted in on that action, but was too shy to act on it. Didn’t matter, she eventually set her sights on me and I went. While I was in the midst of it, she was bragging that I was the 14th guy that night. Didn’t matter to me at the time, but I felt disgusted afterward. \n\nI should mention this was pre-AIDS time… I did get an STD though, had to go to the free clinic for a shot the next week.",
   "created_utc": 1691879893,
   "score": 237,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxd13w",
   "message": "I just wanted to see her naked, the sex was a bonus.",
   "created_utc": 1691877326,
   "score": 227,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxd1p7",
   "message": "to get revenge on my ex cheating, she was her \"little\" in her sorority or some bullshit, she had a terrible personality but was very hot",
   "created_utc": 1691877333,
   "score": 230,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxglfz",
   "message": "I was emotionally compromised and wanted to use a person that I cared nothing about to make me feel better about a situation that I couldn’t fix",
   "created_utc": 1691878854,
   "score": 198,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxg5qg",
   "message": "Because I was temporarily homeless and it meant I could have a shower and a comfortable bed for the night.\n\nETA: I did not tell the men I was homeless. I had some pride, LOL. And I only did it a couple of times.",
   "created_utc": 1691878668,
   "score": 215,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxrffo",
   "message": "In exchange for discounts on office supplies and Outback Steakhouse gift certificates.",
   "created_utc": 1691883674,
   "score": 94,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxd465",
   "message": "Because she asked.\n\nI was visiting a friend in a different part of the state and she introduced me to one of her friends and she gave her my AOL username. This was back in the late 90s. 😉\nA few days after returning home I received a message from that person asking for a one night stand.",
   "created_utc": 1691877361,
   "score": 207,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxmbjw",
   "message": "She asked to use the bathroom and came out naked. I was 19 and didn’t want to be rude. \n( longer story involves my friend who lived in the apartment above mine, who picked up a girl who came with a friend)",
   "created_utc": 1691881381,
   "score": 66,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxnt6n",
   "message": "I went to her place to hook up one last time (she wasn't aware that was my intention) but left my watch behind, so had to go back again and get my watch and had to hook up again",
   "created_utc": 1691882048,
   "score": 66,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxdsqi",
   "message": "We were near one another when the party wound down.",
   "created_utc": 1691877651,
   "score": 79,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvx79nb",
   "message": "You guys need reasons?",
   "created_utc": 1691874956,
   "score": 217,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxmoyf",
   "message": "Loneliness from failed marriage",
   "created_utc": 1691881546,
   "score": 103,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxsu1q",
   "message": "We were bored.\nThis was in the mid 00's where smartphones were not a thing yet and people still used CD players and DVDs.\nWe both had no money or place to go and after doing nothing but talking with each other for 3 days we felt like we knew each other pretty well.\nI remember her complaining that \"there's nothing to do out here.\" So I jokingly said back \"Well we could always do each other.\" Expecting her to punch me in the arm like she did when I made a comment about her boobs growing when she was talking about needing to go bra shopping.\nHowever instead she just sighed and said \"We might as well.\" Before getting up and going inside her grandma's apartment. At first I was a little confused and thought she misheard me so I followed. However once I was inside and saw her taking off her shirt I knew she heard me perfectly well.",
   "created_utc": 1691884308,
   "score": 90,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvx758p",
   "message": "Drunk. In our group of friends, there are a couple of women. One time, I hooked up with one of them. We were both drunk after going out with just the 2 of us. We laughed the morning after and it was a bit awkward. We weren’t even attracted to each other.",
   "created_utc": 1691874904,
   "score": 30,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxi8x2",
   "message": "To save someone else's relationship.\n\nA guy in our friend group (that we only kept around out of pity) was a big fat dude, arrogant, and just not a great person actually met a nice woman that he didn't deserve. What did the dumbass do? Invite another girl out with all of us in an attempt to make her jealous (maybe?). Understandably his girlfriend was upset, and because she was such a a nice woman, I jumped on the hand grenade.",
   "created_utc": 1691879583,
   "score": 129,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxqzjg",
   "message": "Young man and horny as always. I'm in my 60's now and as the old saying goes, \"My junk took me places in my youth that I would not go now with an armed escort\"",
   "created_utc": 1691883476,
   "score": 143,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxlbo7",
   "message": "Ass, I wanted to see this chick's ass, and I got to fuck as a bonus",
   "created_utc": 1691880938,
   "score": 113,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvy3kid",
   "message": "Her brother was a coke dealer.   She had an unlimited supply and was very generous with it.",
   "created_utc": 1691889344,
   "score": 34,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvx7pvx",
   "message": "Oh oh oh. \n\nThey threatened to harm themselves.\nThen they shouted at me because I (obviously) wasn’t enthusiastic.\n\nI was young and thought it would be my fault.",
   "created_utc": 1691875145,
   "score": 1,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxos4r",
   "message": "My best friend had a stalker and asked me to help get her off his back. I thought I “owed him one” as we had a prior conflict over a woman, so I “intercepted” the stalker. Chick drugged my drink. Definitely stalker material. Don’t remember half of what happened. Was able to talk my way out of it in the morning. Ran like hell.",
   "created_utc": 1691882485,
   "score": 26,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxeu1s",
   "message": "Rent was due",
   "created_utc": 1691878098,
   "score": 148,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxitzu",
   "message": "In college if they bought dinner I was blowing them in the parking lot lol",
   "created_utc": 1691879840,
   "score": 24,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxj0cu",
   "message": "I honestly just really wanted attention. \nDef went though a hoe phase after a breakup with a guy that just stopped touching me.\nI think I just wanted to feel like someone actually wanted me.",
   "created_utc": 1691879918,
   "score": 155,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxi0b7",
   "message": "I was bored and he looked like a guy I was trying to get over 😂",
   "created_utc": 1691879478,
   "score": 175,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvy27sf",
   "message": "My name is Ken. Her (middle) name is Barbie. Didn’t work out and after we broke up she started going by her first name",
   "created_utc": 1691888691,
   "score": 91,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxnthe",
   "message": "Obligation. And a bit of tipsiness. Felt bad about saying no to her advances, especially in front of her friends as we were all leaving, so went with it. I’m sure the sex was horrible for her too, and then I half-lied about having to catch the last bus that night. \n\nObviously my idiotic/conceited attempt at making someone feel better made her feel worse when I made a quick run for it after",
   "created_utc": 1691882052,
   "score": 182,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvy0rsb",
   "message": "I had sex with a girl because I didn't want to admit to myself that I was gay I couldnt get hard so I just ate her out and fingered her for like 15 minutes made some stupid excuse, went home and cried💀",
   "created_utc": 1691887993,
   "score": 127,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvy1715",
   "message": "Hooked up with cougar on an airplane because she wanted to “thank me for my service” I was 21 flying back from A-school when American Airlines upgraded my seat to first class. They sat me next to this cougar that had to be in her mid 40 that happened to work for the VA. We talked for a while and she kept buying me shots when all of the sudden she looked around and said when I get up wait 2 min then come to the airplane bathroom when the stewardess pushes the tray to the rear. I did as instructed and was damn near torn apart by this women in the worst smelling place ever. The weird part was everyone knew and no one said anything to us lol. After the plane ride she gave me hug and her business card and told me if I ever needed VA help send her an email.",
   "created_utc": 1691888198,
   "score": 111,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxxzri",
   "message": "I was 19, at university.\n\nOne night, I went to a pub quiz and got wasted (we won the quiz and the prize was open bar for an hour).\n\nWent back to one of the girl’s rooms to watch TV. It was Monk (I’d never seen it before or since but I seem to remember quite enjoying it).\n\nWe started making out. She asked me ‘do you want to go all the way?’ In my drunken stupor, I thought she said ‘do you want me to go away?’\n\nSo I answered yes…",
   "created_utc": 1691886685,
   "score": 231,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxdlah",
   "message": "She hopped on top and told me to get over it.",
   "created_utc": 1691877564,
   "score": 143,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxsoup",
   "message": "I was bored and a virgin. \n\nI was sitting in an old ass car with my friend and two guys smoking weed. The three of them were having a conversation about something sexual. I was in the back focusing on the joint, when they all turned and looked at me asking my opinion. I hit the joint, shrugged my shoulders and said “I had no idea, I’m a virgin.”The car went silent. I passed the joint. The guy driving asked me if I’d like to lose my virginity. Again I shrugged and said “sure”. The two guys paper, rock, scissored it. Passenger won. Everyone got out but us. We drove to the local park, did the deed. Afterwords he told me I was going to be addicted to sex. I laughed, said “not if that’s what it’s about” buttoned my pants, climbed back up front, and silently waited for him to take me back to my friends house. Never seen him again.",
   "created_utc": 1691884244,
   "score": 40,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxejmm",
   "message": "Low self esteem\n\nEdit: Instead of finding people who loved me I found my validation through body count. I felt my success as a man depended on what kind of women I slept with and what quantity, how much money I made, and what I produced for society.\n\nInstead of loving myself I sought the love through others. I’ve had bad sex with extremely knockout gorgeous women, while the best and most intense and intimate was based far from looks.\n\nI’ve learned I could have had sex for about three times a day over my lifetime into my late 20’s if you did the math, but nothing put me to sleep like a good cuddle at night and a stroking of my hair, being held in someone’s arms with gentle kisses against my cheeks.\n\nI’ve thrown that away because I was brought up believing that this is the best way to perform my masculinity.\n\nI declared to let society and the status quo dictate what I should like, and only to proceed with its blessings. My validation was the lustful and covetous looks from strangers.\n\nI became addicted to new people and it made me become more lonely as these people became ghosts, leaving my life without closure. I am an insomniac, and the loneliness keeps me up at night.\n\nIt has caused me nothing but pain and suffering. Please hold the people you love at night, and be kind and forgiving to one another. \n\nLook for teachable moments, and try to heal the world around you. The people who hurt us most are sometimes the ones that need love the most\n\n    Edit2: For those of you with body issues, just be sure you are healthy. \n\nThe people you love will grow to fit your visage to pleasure. \n\nSome of my best relationships started off with no physical attraction to the person, and through time and comfort would I become lustful for them and I did not expect it. \n\nThe most beautiful thing I see is someone who loves themselves. Sexy is a state of being, not a skin you can slip into. \n\nAnd ugly only rots from the inside out.",
   "created_utc": 1691877974,
   "score": 79,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxeqbw",
   "message": "I needed a ride to a doctor's appointment and couldn't afford an Uber",
   "created_utc": 1691878053,
   "score": 117,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxtmdi",
   "message": "I grew up mormon. My whole childhood it was pressed on us- no sex before marriage, sex is sacred, sex is only for reproduction. Nah, I didn’t subscribe to that. What I did subscribe to, however unintentionally and unconsciously, is that women submit to men. The purpose of women is to exist for men. To make their lives better, to let them lead, to bear children in their name. This, plus all the modesty and purity culture and shame kind of internalized the idea- I exist for a man’s pleasure. But I didn’t care about sex before marriage or marriage even at all. I’m a feminist and have no interest in bending to a man’s will. What is left? Sex. By 19 I had left the church and was going off on hookups left and right. I never had a good reason why. I was never even attracted to them. I was never interested in sex itself. However, having sex with men made me feel, however unintentionally and unconsciously, that I had purpose. That I existed for something, that I had value of some kind. The emotional transaction was what I cared about. These men use and abuse me, I happily go on my way feeling like I fulfilled my purpose and that my existence had meaning. It took me years to realize what I was doing, and now I am haunted. I’ll never forgive the mormon church. \n\nAnd we wonder why I was in rehab at 21.",
   "created_utc": 1691884667,
   "score": 101,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvy0px1",
   "message": "I hooked up with a lesbian because my gf was hooking up with her gf behind my back and we were both mad about it. Haven’t seen her since but she was probably top 5 hottest girls I ever slept with. It wasn’t about that tho, just spite. I didn’t even really want to have sex that night.",
   "created_utc": 1691887969,
   "score": 220,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxnl98",
   "message": "She had a dragon tattoo on her pubis mons and I wanted to see if she \"shaved the dragon\".",
   "created_utc": 1691881947,
   "score": 208,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvy0avp",
   "message": "She was thicker than I usually go for but her ass was massive and I wanted to see what it looked like",
   "created_utc": 1691887772,
   "score": 84,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxe98k",
   "message": "She lead my penis into her vagina",
   "created_utc": 1691877850,
   "score": 253,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxj8bs",
   "message": "She couldn't find her keys.",
   "created_utc": 1691880015,
   "score": 56,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxk50f",
   "message": "she was ultra rich",
   "created_utc": 1691880416,
   "score": 53,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxc3h7",
   "message": "Bipolar mania",
   "created_utc": 1691876939,
   "score": 241,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvyizf8",
   "message": "I rejected her because I was not at all attracted to her. A few beers laater she comes back mad that I rejected this. Beer googles made me go \"Eh fuck it\"\n\nWe went back to her place which was near the bar, fucked her, it was crap sex. I got up and went back to the bar and got super drunk.",
   "created_utc": 1691897089,
   "score": 51,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxiwu8",
   "message": "Desperatey. The weird girl in the school liked me so I took that chance to lose my v-card.",
   "created_utc": 1691879875,
   "score": 100,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxhao8",
   "message": "She was Colombian (not that common in my country) and I thought \"man, I never had sex with a southern American girl before\".\n\nYeah I was not a good man back then.",
   "created_utc": 1691879165,
   "score": 179,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxk6ym",
   "message": "[deleted]",
   "created_utc": 1691880440,
   "score": 44,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvy3aqw",
   "message": "I was horny, sad, and he offered to fly me out and let me stay at his house. A free vacation away from the shit I had going on. \n\nAnother bad reason for a different interaction was that he showed interest in me. Which in turn wasted about a year of my life.",
   "created_utc": 1691889213,
   "score": 48,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxh1qi",
   "message": "[deleted]",
   "created_utc": 1691879054,
   "score": 166,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxf6ms",
   "message": "I hate her husband.",
   "created_utc": 1691878248,
   "score": 54,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxlflo",
   "message": "Trigger warning and kind of sad story… I only went along with it so I wouldn’t be raped. Twice :/ both by people I thought were friends",
   "created_utc": 1691880985,
   "score": 79,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxwaau",
   "message": "I was wasted, and the last guy at the bar. The bartender decided to keep them flowing for a little while after close. She's 6'4, and weighed in at probably 220, 230ish. She wanted a little more than just a tip. She said, we're friends right? Well, yes, we had been for years. I went to school with her younger, very good looking sister. She said okay then let's go. I said I'm good, I'll walk. I lived a few blocks away. \nThat's not what she meant. She said, \"This is the closest you're gonna get to Katie, so let's go\"... Fair enough, I obliged.",
   "created_utc": 1691885892,
   "score": 42,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxhfhv",
   "message": "Because I got high.",
   "created_utc": 1691879224,
   "score": 108,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxjwqg",
   "message": "She was drunk, I was drunk. We were in a bar and I had a car with a large backseat.",
   "created_utc": 1691880316,
   "score": 130,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvxetw0",
   "message": "Spite. A guy I was into all but rejected me so I fucked his coworker on his couch. \n\nStill feel yucky about it but what’s done is done.",
   "created_utc": 1691878096,
   "score": 8,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvy92z5",
   "message": "I thought it would lead to a relationship.",
   "created_utc": 1691892009,
   "score": 69,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvy6y5v",
   "message": "Banged my (very recent at the time) ex girlfriends little sister because she pissed her off about something. \n\nSlept with my ex like a week later too. They were both 10/10. \n\nI wonder how that thanksgiving was tho.",
   "created_utc": 1691890974,
   "score": 101,
   "submission_id": "15pfm0i"
  },
  {
   "comment_id": "jvz3nqd",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15pfm0i"
  }
 ]
}