{
 "submission_id": "15pghat",
 "title": "What would you tell your 18 year old self?",
 "selftext": "",
 "created_utc": 1691876521,
 "permalink": "/r/AskReddit/comments/15pghat/what_would_you_tell_your_18_year_old_self/",
 "score": 214,
 "url": "https://www.reddit.com/r/AskReddit/comments/15pghat/what_would_you_tell_your_18_year_old_self/",
 "comments": [
  {
   "comment_id": "jvxemzt",
   "message": "It won't grow anymore",
   "created_utc": 1691878013,
   "score": 8,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxmc6g",
   "message": "It wouldn't matter... I wouldn't listen at 18. I knew all of it then....",
   "created_utc": 1691881389,
   "score": 52,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxr1kp",
   "message": "Don't ever work at Cinnabon. Also, never stop pushing yourself to be a better person. But mostly never work at Cinnabon.",
   "created_utc": 1691883502,
   "score": 104,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxlkuq",
   "message": "“Irish Joe is going to offer you something called bitcoin as payment for an eighth. You want to say “no” because last time he paid you with gold coins and you’re tired of his leprechaun bull shit.  Just do it, and no matter how tempted you may be you MUST hold onto them until November 10th 2021. God speed.”",
   "created_utc": 1691881051,
   "score": 245,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvyap2o",
   "message": "Spend more time with ur brother, he won’t be here for long 😔",
   "created_utc": 1691892799,
   "score": 18,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxbkgq",
   "message": "Don't worry so much about what others think of you, just be yourself.",
   "created_utc": 1691876719,
   "score": 140,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxffyn",
   "message": "Don’t do meth you fucking idiot. \n\nBetter yet, every drug that you want to do, I’ll save you the “adventure”. You’ll love it and that’s the fucking problem.\n\nEdit : this has become my biggest comment ever, so I have to say, I would love to berate my slightly younger self, hell I’d throw hands with that guy. But. If I could change anything that happened, I wouldn’t. I’m a lot worse off health wise, but I have a much better appreciation for life and I’m a lot happier than I ever would’ve been at this age because of that. Im also glad I got my addictions out of the way early. No this does not mean to get addicted to cocaine and alcohol at 19 so you’ll be fine before you’re 30. Don’t do hard drugs, just don’t. Yes I count alcohol as a hard drug, sorry everyone. It’s poison with little to no benefit with a high chance for addiction. If you can have 1 drink on 1 day and not drink again, alright I mean I won’t judge that’s fine. But if you can’t? Better stop now. Just smoke weed instead. Unless it puts too much pressure on your bank account, I mean it’s the best option if you want to do a drug.",
   "created_utc": 1691878361,
   "score": 135,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxgfbh",
   "message": "Pack your bags, pack your girl's bags, change your numbers, move states",
   "created_utc": 1691878781,
   "score": 247,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxjq0w",
   "message": "When you order a whopper at Burger King, ask them to make the patty “[fresh] off [the] broiler”. You will get a [fresher,] warmer meal.",
   "created_utc": 1691880233,
   "score": 95,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxc1wk",
   "message": "Don't get arrested in Mexico.",
   "created_utc": 1691876920,
   "score": 73,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxkr48",
   "message": "It's 2006 so holy shit buy as much stock in apple/Google as possible and invest in bitcoin in 2009",
   "created_utc": 1691880685,
   "score": 169,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxq8eh",
   "message": "Brace yourself. Pay more attention to your physical and mental state. There's more to life than high grades, achievements, and escapism. Emotional intelligence is underrated, and if you want the right people in your life, you're gonna need it. Get studying.\n\nDon't be afraid to choose one or two things to do. You can find opportunities to revisit other hobbies and adjust your choices later. Fail and learn a few times before you change direction.\n\nPlease don't burn yourself alive just to appease your family. Do you really want them to run your life forever? Just because they say they want the best for you doesn't mean they actually know what's best. \n\nDo not share your plans unless you absolutely need to. Do not share your goals until you complete them.",
   "created_utc": 1691883139,
   "score": 8,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxoi4f",
   "message": "Don’t try to fix them. They’re broken and putting up with it won’t help them if they won’t help themselves. Live for yourself and you’ll find a good one eventually",
   "created_utc": 1691882360,
   "score": 177,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxc6y9",
   "message": "You're going to beat this cancer.",
   "created_utc": 1691876979,
   "score": 53,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxppyh",
   "message": "Start your pension now.\n\nTim is not your friend.\n\nBrush your teeth.\n\nLook after your back.",
   "created_utc": 1691882908,
   "score": 231,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxd880",
   "message": "The people at that church aren't waiting to give you answers when you grow up, they don't have them. And your friend, the really angry one? He's being abused, and needs help, but he doesn't know how to ask.",
   "created_utc": 1691877408,
   "score": 173,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxj620",
   "message": "Listen up bitch! Put down the bottle, pull up google on your clunky ass old computer, and find a therapist. Your dad just died, you need therapy, not binge drinking.\n\nAlso, break up with your boyfriend and go out with Steve instead, he's nicer. There's a hell of a lot to be said for genuine kindness, especially since you're also attracted to the guy.",
   "created_utc": 1691879988,
   "score": 160,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxvmxz",
   "message": "Get a therapist. Just tell them your story from the beginning.",
   "created_utc": 1691885588,
   "score": 138,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxyrzf",
   "message": "“Do not forget to do orientation” I’m 17 so this is more of a reminder",
   "created_utc": 1691887053,
   "score": 108,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvy4r7i",
   "message": "pot becomes legal when you're 37",
   "created_utc": 1691889912,
   "score": 113,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxpxib",
   "message": "Serious:\n1) Quit smoking now\n2) Be yourself, there is noone to impress other than yourself \n3) Exercise more\n4) Hone your talents while you have the time\n5) Don't get into that long term relationship\n6) Spend more time with family \n7) Tomorrow doesn't ever truly come i.e. the right time for anything \n8) See a therapist sooner rather than later\n9) Rethink your degree subject \n10) Find better friends \n\nFunsies:\nA) Buy stocks with that Xmas money\nB) Don't throw away your 90s memorabilia\nC) Get your eyebrow pierced\nD) Go to a better tattoo artist\n\nEDIT: small clarification point on number 5 - I am referring to a specific relationship with a specific person in my experience. Have relationships people, there are beautiful ones too!",
   "created_utc": 1691883003,
   "score": 188,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxnsxi",
   "message": "You are so damn hot and you don't know it .",
   "created_utc": 1691882044,
   "score": 22,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxc9fd",
   "message": "\"Leave. \nHe's not your friend. \nHe'll do things you don't wanna do and it will scar your soul for life.\"",
   "created_utc": 1691877007,
   "score": 232,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxtteu",
   "message": "1. The secret to happiness is to not care what others think of you. Be your own person. \n2. Even if you have to sit down with a legal pad and pen in a quiet place over the course of a weekend, decide what kind of person you want to be in your 40s or 50s in terms of accomplishments, priorities, you name it. You don't need a plan. You don't even need a precise idea. But you need to have a sense of direction and some concrete steps in that direction. Keep working on it until something really resonates with you. Because there are few things sadder than people who, in their forties, wake up and say, \"This isn't what I wanted to do with my life.\"\n3. Regarding #2. Don't worry about the money. Instead, if you figure out what you want to do, pursue it with absolutely everything you've got. Become really good at whatever it is, and the money will eventually follow. Do not let anyone--your family, your friends, your teachers, whoever--tell you that you can't do it. What the hell do they know? \n4. Regarding #3. Don't be shy. Ask for help. Ask for advice. Knock on doors. Cultivate mentors. Be relentlessly curious. Read everything you possibly can. Never coast, never turn down a good chance to learn. Never assume you know everything, because you never, ever will. And THAT'S OKAY. Life is a collaboration at all times. Everybody knows something, and nobody knows everything. \n5. Time is the stuff life is made of. Don't waste it. Sure, binge on Netflix or play a video game every once in a while. Just don't make a habit of it. Make lists of things you want to get done and be good at crossing things off. And never waste an opportunity to meet someone new or try something new. You never know what or who will become your lifelong passion or friendship. \n6. I read something that, looking back, makes total sense to me: You are the sum total of the five people with whom you spend the most time. Be careful whom you choose as your friends. \n7. Never spend time with someone who makes you feel bad about yourself. Walk away. And the surefire test of character is this: Watch how that person treats the waiter, the counter help at the dry cleaner, and anyone else in a similar position. Because in six months that's how that person will be treating you. \n8. With that in mind, treat everyone you encounter with kindness, consideration, and your attention above all. Be just as good at listening as you are at talking.  \n9. Have a belief system. I don't mean that in a religious sense. I mean that in terms of your values, what's important to you. \n10. Never be afraid to try something new. \n11. Do not be in a hurry to be in a relationship. If it happens naturally, great. Some people are really lucky to find their significant others early on in life. But don't force matters. Be your own person rather than expect someone else to complete you, for that is a terrible burden to impose on someone. Avoid one-night stands, too. I've known many a guy wind up writing child support checks because he had a weekend special with someone he really didn't like all that much. Believe it or not, there are more important things in life than an orgasm. \n12. Take care of your money. Learn all the financial tools available to you and how to leverage them correctly. Pay your bills on time. Know your credit score. Don't buy things you don't need. Oh, and buy Apple when it's $6 a share in 1997(?). \n13. Stay away from drugs. Exercise. And eat right. It's the only body you'll ever get. \n14. Courage is the foundation of all happiness. Be brave in thought, word, and deed.",
   "created_utc": 1691884756,
   "score": 137,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxrwur",
   "message": "“Leave that bum!! He doesn’t love you and will traumatize you”",
   "created_utc": 1691883893,
   "score": 81,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvy4mqk",
   "message": "Seek mental health therapy now. \n\nExercise more.\n\nSave money.\n\nStop drinking.\n\nLearn to love yourself.",
   "created_utc": 1691889852,
   "score": 80,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxp7nb",
   "message": "You are smart, and have a gift for talking to people. You can achieve great things, but please get evaluated for ADHD as soon as you possibly can, because that is the main thing holding you back. \nAlso, stop making yourself small for men. Your feelings actually do matter and if you value yourself you will meet people who will value you too.",
   "created_utc": 1691882679,
   "score": 223,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxbqbb",
   "message": "Cancel your FAFSA and university enrollment. Sign up for national guard, come home from basic training and stay with mom and dad, get a part time job, do community college.",
   "created_utc": 1691876787,
   "score": 115,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxhvhk",
   "message": "Don’t marry that guy",
   "created_utc": 1691879419,
   "score": 234,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxbeh5",
   "message": "apply to colleges and just pick one and go",
   "created_utc": 1691876651,
   "score": 174,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxnbhg",
   "message": "There’s stuff I want to tell my 18 year old self, but I fear it would have a domino effect that may impact things that happened later in life. But if it didn’t- I would tell myself to get over my loser of an ex boyfriend.",
   "created_utc": 1691881827,
   "score": 58,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxpd88",
   "message": "Stick to weed, alcohol will poison you. Also the next 3 girls are wife material don't strike out.",
   "created_utc": 1691882749,
   "score": 233,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxerwl",
   "message": "Save money. \n\nIt might be ‘boring’, or curtail some of the activities you want to do, but the relief you will feel later on in life from putting 5-10% of each paycheque aside will be more than worth it. \n\nTake it from someone who cringes at the amount of money they know was wasted (and would be very welcome to have now).",
   "created_utc": 1691878071,
   "score": 203,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxu2c3",
   "message": "When you need to choose between travelling and living overseas with your best friends at 23 OR stay in Sydney with your boyfriend because he's \"the one\", listen to your instincts and travel. He isn't the one. Travel travel travel and learn as much as you can about the world.",
   "created_utc": 1691884869,
   "score": 112,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxcpmd",
   "message": "Strap in, it's gonna get bumpy.",
   "created_utc": 1691877192,
   "score": 5,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvy4d4g",
   "message": "The bulimia will ruin your teeth and dentists will keep commenting  on your weird erosion. \n\nYou are super skinny anyway.... cocaine is great but don't use it as a crutch. Also don't give in to the evil misogyny that's gonna make you feel bad later.",
   "created_utc": 1691889723,
   "score": 43,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxbf94",
   "message": "Nothing. He's on the right path",
   "created_utc": 1691876660,
   "score": 46,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxpebm",
   "message": "Join the Air Force instead",
   "created_utc": 1691882763,
   "score": 87,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxigl5",
   "message": "Hit the gym now, you’re gonna start later anyways and you fall in love with it.",
   "created_utc": 1691879678,
   "score": 148,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxmp4r",
   "message": "Use your film school equipment and make YouTube videos. It's the only way you'll make it to the industry.\n\n\nBack then, I would have been light years ahead of the game with professional equipment at my fingertips",
   "created_utc": 1691881548,
   "score": 76,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxs6y6",
   "message": "Not everyone is your friend...",
   "created_utc": 1691884020,
   "score": 40,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxvtss",
   "message": "Do NOT go back to Colorado and don't go to culinary school.",
   "created_utc": 1691885679,
   "score": 39,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxx1bi",
   "message": "Don’t light yourself on fire to keep others warm…",
   "created_utc": 1691886235,
   "score": 38,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvy7bjo",
   "message": "Take care of your teeth and start working out",
   "created_utc": 1691891155,
   "score": 34,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvyfml2",
   "message": "That nagging feeling you have isn’t “Satan”. It’s your intuition. Don’t go on a Mormon mission and find your own path.",
   "created_utc": 1691895307,
   "score": 40,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxbq3z",
   "message": "Dear 18 years old me; \n\nUse your time more precious.",
   "created_utc": 1691876785,
   "score": 159,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxmogj",
   "message": "Buy the fucking bitcoins. Don’t listen to your friends!!!!!!",
   "created_utc": 1691881540,
   "score": 123,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxjd7q",
   "message": "I would tell him his plan to commit suicide at 18 was always a dumb idea. It takes a while but it’s going to get better. You eventually find your footing. You’ll eventually find a woman who loves you like no other and for the first time you’ll have a reason to live. You’ve grown as a man more and more each day and while you’re still not where you want to be, it’s not just your wife backing you, It’s her family too. There’s no way you can fail with the support you’ve found. For the first time you’ll feel wanted, like you belong. You’re gonna be ok. Everything’s going to be ok.",
   "created_utc": 1691880076,
   "score": 116,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxjphh",
   "message": "August 1st 2023 Billion dollar Mega million winner is 8-24-30-45-61     Mega ball 12",
   "created_utc": 1691880226,
   "score": 28,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxv0qc",
   "message": "It doesn't get better. You're gonna spend your 19th birthday alone, too. You still have no one. Stop thinking that being kind and putting in effort will get you kindness and effort in return, because it won't. Instead, be practical. Work more hours. Start working out sooner. Read more, write more, and keep doing well in school.  \n\nAnd for the record, don't believe anyone when they tell you that you mean anything to them; you don't. A year later, and that hasn't changed at all. You really are on your own, so make the most of it. Also, you're still alive.",
   "created_utc": 1691885304,
   "score": 33,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxyhil",
   "message": "She doesn't love you. They aren't your friends. They are her's. Don't buy the mike wazowski shirt, it did not cure your depression, only flavored it. Your max is 3 not 4. No I won't clarify. Yes it's important i don't clarify. Your favourite burrito meat is al pastor, you will try other meats but they won't taste good to you.",
   "created_utc": 1691886917,
   "score": 30,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxp7sb",
   "message": "Don’t get attached to anything or anybody, and it will save you a lot of pain. Let people in, and let them go. Hold on to the happy parts, let the bad ones go",
   "created_utc": 1691882680,
   "score": 154,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvzjqhh",
   "message": "Working as a cashier at Walmart is not an easy job. Don't do it. The npcs you meet daily will fry your brain",
   "created_utc": 1691923247,
   "score": 110,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxbg07",
   "message": "I am my 18 year old self\n\nBut I guess if it was right on birthday, that we are indeed plural",
   "created_utc": 1691876668,
   "score": 75,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxcb3r",
   "message": "to listen to you mom! haha",
   "created_utc": 1691877026,
   "score": 57,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvy369m",
   "message": "Ditch your mom now. You'll save so much time, work, money, and sanity. All that lays ahead is heartbreak and trauma.\n\n10 years' difference in the time I cut her off would probably make me an entirely different person and put me in a better position. \n\nBeyond that, probably buy cheap GameStop stock and wait",
   "created_utc": 1691889153,
   "score": 57,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxjm30",
   "message": "I would tell him to have an hour long conversation with me. I would never waste an opportunity to talk to my future self on one thing.",
   "created_utc": 1691880185,
   "score": 27,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxsi2c",
   "message": "You don’t have to earn the love of others, that’s not love.",
   "created_utc": 1691884159,
   "score": 27,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvyehmk",
   "message": "He's 31. You're 19. He doesn't like you because you're mature. He's preying on you.",
   "created_utc": 1691894719,
   "score": 27,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxrehy",
   "message": "Stop reading game of thrones, they series never finishes and there is a show",
   "created_utc": 1691883663,
   "score": 70,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxcsf4",
   "message": "That “bitcoin” thing that just came out, that you’ve been mining for fun? Yeah, hang onto that until *at least* 2017-2021.",
   "created_utc": 1691877225,
   "score": 102,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxu38w",
   "message": "You have adhd, *please* get medicated.",
   "created_utc": 1691884881,
   "score": 49,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxn743",
   "message": "Get to counseling and start the healing process because you're about to meet an amazing girl and you, her, and the children you have together, deserve the best version of you. You're going to regret not doing this work sooner because of the hurt it's going to cause the people you love most.",
   "created_utc": 1691881771,
   "score": 20,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxsf1y",
   "message": "It's okay to be alone",
   "created_utc": 1691884121,
   "score": 24,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxtd6n",
   "message": "go NC with parents and go find a counselor",
   "created_utc": 1691884550,
   "score": 24,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvy76yo",
   "message": "Take more pictures",
   "created_utc": 1691891095,
   "score": 23,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxts06",
   "message": "Leave home and never look back, they will hold you down for far too long",
   "created_utc": 1691884738,
   "score": 19,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxup9z",
   "message": "Stop picking fights with your boyfriend. He’s the love of your life and you’ll never even come close to doing better.",
   "created_utc": 1691885160,
   "score": 51,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxq3t8",
   "message": "Never sell your condo",
   "created_utc": 1691883082,
   "score": 37,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvxka6p",
   "message": "Your virginity isn't a gift. Don't wait till marriage.",
   "created_utc": 1691880480,
   "score": 132,
   "submission_id": "15pghat"
  },
  {
   "comment_id": "jvy6if9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15pghat"
  }
 ]
}