{
 "submission_id": "15pjuod",
 "title": "What is a struggle men have that women will never understand?",
 "selftext": "",
 "created_utc": 1691885085,
 "permalink": "/r/AskReddit/comments/15pjuod/what_is_a_struggle_men_have_that_women_will_never/",
 "score": 100,
 "url": "https://www.reddit.com/r/AskReddit/comments/15pjuod/what_is_a_struggle_men_have_that_women_will_never/",
 "comments": [
  {
   "comment_id": "jvz9x4i",
   "message": "I had a situation in that I overheard my fiance's mother once say to her in very different words that men have only two emotions. Rage and horny. Basically sounded to me like she thought all men with emotions were just con-men lying to get sex.",
   "created_utc": 1691915306,
   "score": 203,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvyvf8u",
   "message": "Trying to find the balance of being emotionally vulnerable and masculine in such a way that maintains attraction. This leaks into communication, sex, outward behavior, and damn near everything in a relationship.",
   "created_utc": 1691904483,
   "score": 5,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzbgun",
   "message": "I was the victim of domestic violence, and was laughed out of the police station when I attempted to report it.",
   "created_utc": 1691916561,
   "score": 133,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvxv6pl",
   "message": "Being expected to be able to step up in scary situations when you are scared shitless yourself and don't want to either.",
   "created_utc": 1691885380,
   "score": 30,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvylqf3",
   "message": "Being looked at as a pervert or weirdo for taking your kids to the park or store or anywhere. Any age too! Newborn all the way to teenager!",
   "created_utc": 1691898600,
   "score": 162,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvxwve8",
   "message": "Talking/interacting with a child and instantly getting seen as a pedo.   \n\n\nOnce headed out with my 3 year old niece to a playground . . . half an hour later the police were involved. Needed my sister to clear things up.",
   "created_utc": 1691886160,
   "score": 12,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvyizqr",
   "message": "If we don’t express our emotions in a way that matches expectations, usually through actions and body language, they generally aren’t received or taken seriously, even when communicated clearly. It typically doesn’t matter how we *say* we feel. \n\nThen if we go so far as to have an outburst like yelling or crying, the emotions are finally understood and taken seriously, but they change people’s opinions of us, and usually in a negative way.\n\nThere is no “I was just upset” excuse for us. We have to remain in control at all times because we’ll either be considered too scary or too weak, but in doing so, we’re constantly told that we don’t open up enough.",
   "created_utc": 1691897094,
   "score": 122,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvz2281",
   "message": "Trying to ask out women with little to no signals to go on. Having to approach and initiate every romantic interaction without coming on too strong and not seem like a creep.",
   "created_utc": 1691909216,
   "score": 242,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvz5b2g",
   "message": "Talking about your mental health. In recent years I've become more open about it but a lot of the men around me just won't open up about it. There are people I know who have ended their life because of mental health issues.\n\nI think it's a difficult conversation no matter your gender, but a lot of men are told to \"suck it up\" or told that \"men don't cry\" so they have to keep it all inside.",
   "created_utc": 1691911654,
   "score": 16,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvy6qqu",
   "message": "Being accused of kidnapping my kids while taking them to the playground. That was fun. \n\nWomen going out of their way to avoid me when walking on a street (crossing the street). I get it, but wow does it hurt. \n\nFeeling crushing anxiety and not being able to show it to basically anyone. My wife interprets it as me being unstable/unable to be the provider, even my therapist assumed I was just not wanting to face my demons and that I need to get over it. Gotta keep it in. \n\nBeing really sick and told it’s manflu. \n\nHaving me sense of self worth basically pinned to my ability to earn money \n\nVery specific, but illustrates the point: I once was at a conference and I saw two ladies walking ahead of me. One was carrying a purse by its handle and it was hanging down. The purse was unzipped and stuff was starting to fall out as she was walking. I ran up and interrupted and pointed out the purse was open and stuff was about to fall out. They both looked at me and asked why I would be looking at her purse and called me a creep and walked away.",
   "created_utc": 1691890873,
   "score": 239,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvxzvml",
   "message": "Trying piss with an erectionwhile sitting on the loo.",
   "created_utc": 1691887570,
   "score": 169,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvxzx6t",
   "message": "My wife and I are very affectionate with our young son. Tons of hugs and kisses. I know that there will be a point where he will no longer want that from me specifically but will be okay with her still showing that kind of love.",
   "created_utc": 1691887590,
   "score": 65,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw0ho5u",
   "message": "If you don't open up about your feelings you're a toxic man. If you do, you're either being rude or being a pussy. We're only supposed to have the CORRECT feelings, at the correct time, at everyone else's convenience.",
   "created_utc": 1691940720,
   "score": 240,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzbi7s",
   "message": "Not being believed when it comes to sexual harassment \n\nI was sexually harassed by a girl in my class a really long time ago and when I told it to the school they didn’t do anything \n\nBoth of my parents got involved and they still refused to do anything to the girl who was harassing me",
   "created_utc": 1691916590,
   "score": 90,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw0e6ie",
   "message": "You can shake it, you can thump it, you can beat it on the wall, but until you zip the zipper, the last drop will never fall.",
   "created_utc": 1691939315,
   "score": 108,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvxvkpj",
   "message": "Modern society can view us being totally useless but somehow in charge of everything \n\nOr getting your cock caught in a zipper a la Something About Mary style\n\nThe latter is probably the worst thing",
   "created_utc": 1691885559,
   "score": 17,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw08qph",
   "message": "my brother got physically abused by his ex and somehow a ton of people still assume he did something to deserve it?... Imagine if the reverse happened! Like a woman talks about how her ex boyfriend punched her because he is an abusive piece of shit and i would go \"yea but what did you do to deserve such a reaction?\". if i did that everyone would agree that i am the asshole but for some reason multiple people have said this to my brother and no one bats an eye.",
   "created_utc": 1691937072,
   "score": 94,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw0by80",
   "message": "The whole series or why do you like/why are you doing/wearing/eating/drinking/feeling x or why do you know about or how to do x, you’re a guy? Questions we get on a regular basis. \n\nWhy are you wearing pink? You’re a guy \n\nWhy are you drinking anything that’s not a beer? You’re a guy \n\nWhy are you in this pottery class? You’re a guy \n\nWhy did that movie make you tear up? You’re a guy \n\nHell my favorite was when I was asked that question because I asked for water on a hot day. Apparently drinking water isn’t a thing guys are supposed to do.\n \nEven got asked that when someone asked why I was wearing glasses. Apparently if you’re a guy you’re not allowed to see properly. \n\nJust about every guy gets questions like these on a regular basis that they probably don’t even notice any more. \n\nIt’s also not just other guys that ask this but men, women, family members, kids, servers, and I’ve had people at places that tried to make a point that everyone was loved and accepted ask stuff like that even if it wasn’t intentional.",
   "created_utc": 1691938409,
   "score": 45,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzfb1v",
   "message": "From reading all of these replies: guys, I’m so sorry so many other dudes are being put through the ringer at the moment. Big ol’ bro hug to you all.",
   "created_utc": 1691919688,
   "score": 8,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvz7q5f",
   "message": "Older single guy here. We're on our own. Nobody wants to touch us. No platonic affection. Nobody wants to help us. We need to figure it out for ourselves. Nobody will be there for you. You have to accept that. Crippling loneliness is a given. I know I will die alone. I just want to know, why the hell is it taking so long?",
   "created_utc": 1691913559,
   "score": 237,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvy7wwl",
   "message": "Trying to figure out if she’s into you, or just being nice.",
   "created_utc": 1691891445,
   "score": 111,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvymsdz",
   "message": "Expected to be the protector at all times. I mean I’ll do my best but damn, can we call the cops first.",
   "created_utc": 1691899186,
   "score": 188,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvymg8z",
   "message": "Middle age loneliness, particularly for married guys with kids.  If you're not a middle age bro douche, you probably have no friends.  None.  Maybe you're amiable with work colleagues, maybe you have a game night with some neighbors, but they're barely more than acquaintances.   Your last friend was 10, maybe 20 years ago in the before times.  Seems like It's almost a societal expectation at this point.",
   "created_utc": 1691898997,
   "score": 207,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvy8v3u",
   "message": "Nobody cares about you and sympathy simply doesn’t exist for people like you so your completely left to fend for yourself.",
   "created_utc": 1691891903,
   "score": 138,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzztcl",
   "message": "I can't say for sure that women will never understand anything we go through, but for the sake of the post, I'd say tip toeing through life in a way to not come off as creepy.\n\nWhen I use my phone in public, I hold it in a manner that the camera is obviously not pointed at anyone.\n\nI put effort into looking in directions void of people, to make it obvious I'm not hitting on/staring.\n\nI constantly think of ways that I have privileges and how to utilize them to ease the tensions of other individuals. I'm a big time de-escalator, so I'm really good at getting toxic men to chill out and act more reasonably when they're acting up, especially when I sense they're making some woman uncomfortable.\n\nI walk around somebody within the path visible to them, rather than behind them, so they don't feel anxious about some guy behind them.\n\nI overthink myself to death over trying to romantically approach anyone in life, because I don't want it to come off the wrong way. I got over growing up super shy, only to grow into this overthinking mess who has the gut to be proactive, but the social awareness to prevent myself from putting women into less comfortable scenarios.\n\nI have a terrible issue with crying, even when I'm at my worst and feel a constant urge to cry for weeks straight, I won't and can't. Sometimes I think I can't cry without permission. I am well aware that I don't need permission, but my body doesn't care.",
   "created_utc": 1691933032,
   "score": 31,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw0b3d2",
   "message": "The struggle of dating when you're average or below average looking. \n\nMost women's options are huge. A lot of women who are single, are single by choice. Realistically, If they wanted a meaningless relationship or just casual sex, that can get it within a week, sometimes even a day. \nA lot of men struggle with this. It can be very difficult to find a serious relationship. And by that I mean, literally just finding a woman who will date you, let alone it turning into something serious. For example I have Tinder, and haven't got a match in over two months. I ask friends of both sexes for their thoughts on my photos and profile, and they think it's fine. Ig it's just that there are better looking people out there and more of them. But this isn't a unique experience.\n\nNow don't get me wrong, it isn't all men that have this issue, but I'd say that a depressing amount do. And I'm not saying all women are successful in the dating world, but they have a lot more options.\n\n\n\nAnother problem men are faced with, still on the dating topic, is the fear of being falsy accused. It's a real fear because it happens every day, and it ruins innocent lives.\n\nGet lucky in a bar or nightclub, hook up with a girl and she regrets it the next day? She can just call rape or sexual assault and you'll be charged.\n\nTwo consenting adults that had a drink get frisky? Can be considered rape, because the woman was under the influence of alcohol.\n\nSame with other accusations such as domestic abuse / violence, and such. As a guy you're basically guilty until proven innocent, which is very hard to do.\n\nMost domestic abuse cases are obviously women (the victims), but you'd be surprised at how many men are physically abused too. The Johnny Depp case gave a glimpse into that. If you're a woman and you say you're being abused, friends, family, and the law will side with you. If you're a guy and you're being abused, you'll be laughed at, told to \"man up\" or just outright ignored.\n\nAnother anecdote I have, is when my ex was spreading very hateful and damaging comments about me to her entourage, which really stained my name. Calling me physically and mentally abusive, manipulative and all sorts. When I've never layed a finger on her, and had never yelled at her (I raised my voice when I found out she cheated, but imo that's acceptable). She spread those rumours to my girlfriend after that (now ex) who believed her over me. But my ex was the one who cheated, lied, and manipulated me, and I was still the one who had to prove my innocence and clear my name. \n\nBut I guess the TLDR of this would be: Men are deprived of sympathy, basic emotional care and are often very lonely. Also Guilty until proven innocent.",
   "created_utc": 1691938059,
   "score": 33,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvy17jv",
   "message": "Your balls being uncomfortable in jeans",
   "created_utc": 1691888205,
   "score": 87,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvxwo4f",
   "message": "That most people assume you’re some sort of predator of sorts.",
   "created_utc": 1691886068,
   "score": 27,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzhl3x",
   "message": "Being treated for prostate cancer. Only the male doctors and nurses seemed genuinely empathetic.",
   "created_utc": 1691921541,
   "score": 158,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzoarn",
   "message": "Rejection hurts. The more often it happens, the harder it gets to put yourself out there.",
   "created_utc": 1691926518,
   "score": 112,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzpm3r",
   "message": "The work place, I'm half in an office and half on the street public facing, jesus the shit the women in the office talk about and what they get away with never fails to amaze me, I would be canned if I came out with 50% of the shit they said and rightly so.",
   "created_utc": 1691927377,
   "score": 106,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvyun0a",
   "message": "it's not okay to be a stereotype who tells a woman to get in the kitchen and make me a sandwich, but it's acceptable if not downright encouraged for a woman to knock me for not being able to lift something heavy saying \"you're a man, you're supposed to be able to do this!\"",
   "created_utc": 1691903962,
   "score": 71,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvyf3kn",
   "message": "Public boners",
   "created_utc": 1691895032,
   "score": 216,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw0k29t",
   "message": "It's so hard to open up about being bullied, especially if the bully is a girl. My sister treats me like shit. I've tried to tell my parents, but they don't believe me. I've wanted to kms multiple times, but I don't because I think of how my parents would feel. I just have to deal with it now. Oh and ofc she can hit me but I can't hit her.",
   "created_utc": 1691941675,
   "score": 26,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw0ql1o",
   "message": "Invisibility. Unimportance. You're just a cog in the machine to produce and get things done. If I never came home and just worked and sent money home I think my gf might complain about me not being home but she's still take the money. If I wasn't making money she wouldn't want me around. If I die I think I'd get a moment of , aw it's sad he's dead... Is there any more meatballs in the fridge I'm a bit hungry?",
   "created_utc": 1691944203,
   "score": 26,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw07i6m",
   "message": "The absolute certainty that society doesn't give a flying fuck about you unless you can offer something. There's no net for men, you're on your own.",
   "created_utc": 1691936535,
   "score": 50,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzcqsh",
   "message": "Sometimes she just wants me to listen (which I do) and other times she wants me to fix it (which I also do). I get it right more than 50% of the time, The other times I get yelled at for not doing the right thing.\n\nShe'll go on a rant about me not providing the correct response. I just remove myself from the situation and wait for the cool down.",
   "created_utc": 1691917587,
   "score": 65,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzrwwx",
   "message": "Validation with the opposite sex.",
   "created_utc": 1691928785,
   "score": 20,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzphzx",
   "message": "All these are depressing answers so:\n\nSitting on your balls/having your balls stuck to your thigh on a hot day and having to do the long step or play around in your pocket to unstick them.",
   "created_utc": 1691927305,
   "score": 40,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzw424",
   "message": "The level of depresion men face while basically having no support system and forever being told to just be tough and push on..",
   "created_utc": 1691931153,
   "score": 69,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzpxtl",
   "message": "Just how fucking lonely it is. You are expected at all times to be a simultaneous combination of guardian, emotional caregiver, leader, and provider, on TOP of being relatively successful and 100% independent. \n\nAnd you have to ALWAYS be these things, 100% of the time. It's emotionally exhausting.\n\nI know that readers may see this and list any number of the various advantages our unfair society affords men, and I won't argue that they aren't there. But I will state that I feel, and probably many other men would agree with this, that society doesn't really care about the emotional, mental, or social health of men.\n\nChris Rock famously said that only women, children, and dogs are loved unconditionally; men are loved under the condition of what they can provide. I agree with that statement. It's incredibly dehumanizing and dispiriting to constantly be told what society expects from you and wants you to be, as if all you are is a paycheck to support a family or a fearless leader who exudes strength and never falters.",
   "created_utc": 1691927578,
   "score": 200,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvy4c1y",
   "message": "Shrinkage. When you get out of a cold pool and your wet bathing suit is clinging to your groin, looking like you are sporting a pencil eraser is never a good look. \n\nAnd as an overweight guy, if it was particularly cold water, the discomfort of turtling. That’s when it retracts far enough it feels like it is trying to turn inside out. The only fix is to grab yourself and adjust, which just brings that much more attention to your shrunken junk. \n\nOr the flip side of this, on a hot sweaty day, the pain of sitting down only to find your balls were hanging so low they flopped under the edge of your leg and you just sat on your own nuts.",
   "created_utc": 1691889709,
   "score": 131,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzas42",
   "message": "When a woman expresses her feelings and/or problems, everyone can't get enough. When a man does, he is either ignored or told \"man up dude\". And this is something that'll go on forever.",
   "created_utc": 1691916003,
   "score": 111,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzhhh9",
   "message": "Women have no idea what it's like to go your whole life with no one ever thinking to give you flowers.",
   "created_utc": 1691921462,
   "score": 77,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw02fx3",
   "message": "M43, I have my kids most of the time,  and sometimes when I have them I get the \" oh its the dad weekend quote\". So annoying",
   "created_utc": 1691934286,
   "score": 31,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw0bqc8",
   "message": "Always being looked at as a potential predator. I'm tall and wide too which makes it worse, I'm actually the most protective bastard around...",
   "created_utc": 1691938319,
   "score": 14,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw0npga",
   "message": "Women constantly trying to convince men to abandon Stoicism and then rejecting them at any sign of vulnerability.",
   "created_utc": 1691943086,
   "score": 15,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvxux81",
   "message": "They say there's someone out there for everyone. That's not true. There's guaranteed to be at least one man that nobody wants to fuck. Speaking from experience, there is not one woman alive my friends would not try to fuck.",
   "created_utc": 1691885260,
   "score": 19,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzd0da",
   "message": "Most of our struggles won’t be heard by women to be honest. We’re not all that keen on being open and sensitive most of the time",
   "created_utc": 1691917802,
   "score": 28,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzhx88",
   "message": "That moment when the lawnmower won't start and there is no beer in the fridge.",
   "created_utc": 1691921815,
   "score": 28,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzsvee",
   "message": "Trying to talk to others about mental health (both mine and other's).  As a child, my mother struggled with mental health but she was wise enough to get help and through that became determined to break the cycle in our family.  She gave me the tools to deal with these struggles myself (and for others).\nSo now, well into my 50's I'm an empathic, caring man, father, husband that can listen well (typically offering the advice of...you should get some professional help but I'm here for you).  \nThe problem is, any men in today's society judge my help as being \"soft\" or, \"nosey \" or being a \"wash woman\".  Personally, I don't give AF but it is a sad statement in our society.",
   "created_utc": 1691929348,
   "score": 32,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvxy73s",
   "message": "Trying to figure out if I should pay:\n\nI should pay on the date to be polite but I also should also  have us split because we're equal but there's a gender pay gap so I should pay because I'm a man but gender roles are meant to be cast aside? I...I....I AHHH",
   "created_utc": 1691886781,
   "score": 147,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvyqj4h",
   "message": "The ever lasting circle women put us in where they want us to communicate openly and honestly and then when we do, we have to justify what we said and spend a half hour explaining how what we said wasn't an attack on them but rather a logical statement. Gets annoying to the point I don't care to have an opinion anymore.",
   "created_utc": 1691901359,
   "score": 243,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvz0eqi",
   "message": "Trying not to enjoy sex, because if you do, you didn't last and are not a real man.",
   "created_utc": 1691907992,
   "score": 94,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvystxt",
   "message": "Getting our sack stuck to our inner thighs when we get hot and sweaty. A condition aka “bat wings.”",
   "created_utc": 1691902775,
   "score": 34,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvz4ccd",
   "message": "The threat of hidden Decepticons keeps my head on a constant swivel",
   "created_utc": 1691910912,
   "score": 37,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzugfp",
   "message": "Being born with no inherent value and later being blamed for everything wrong in the world.",
   "created_utc": 1691930256,
   "score": 35,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvyazf0",
   "message": "Honesty \u0026amp; feelings: Women ask for that in a relationship \u0026amp; yet when you do, they say that not true \u0026amp; you don’t feel that way. Or worse, look down upon you because you let to much feelings come out. Don’t be vulnerable around a woman, get into a men’s therapy group to let it out.",
   "created_utc": 1691892941,
   "score": 227,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw05yez",
   "message": "Trying to find something inside of a purse. It's like a magic bag.",
   "created_utc": 1691935854,
   "score": 12,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw08kii",
   "message": "When you take a piss then don’t properly shake off, and have a large wet spot on your shorts.",
   "created_utc": 1691937000,
   "score": 11,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw0j57q",
   "message": "Balls sticking to legs",
   "created_utc": 1691941308,
   "score": 10,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzev81",
   "message": "\"Why don't you just go out there and find a girlfriend?\"\n\ni have tried, and nothing, every single dating app i have used i have never gotten a match \n\n\"just go up to a woman and ask them out\"\n\nthat is sexual harassment\n\n\"you just have to try harder\"\n\ni am in physical pain from trying just to get one compliment",
   "created_utc": 1691919325,
   "score": 56,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvxuqpf",
   "message": "We have two very very good reasons to spread our legs when we sit.",
   "created_utc": 1691885178,
   "score": 132,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvxy7ww",
   "message": "Being shot down simply because you're a certain height",
   "created_utc": 1691886792,
   "score": 155,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzxgxk",
   "message": "POST-NUT CLARITY",
   "created_utc": 1691931861,
   "score": 10,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jvzbkrd",
   "message": "Taking my 2 boys out on my own for a boys day out. One has complex special needs, and the looks I get are just unreal.  The feeling is oh its his weekend to have the kids.  Plus no one offers to hold doors etc for the wheelchair.  Not that I expect it, but happens for wife all the time so I just wonder why the odd looks.  \nAh well, keep living my life and let them judge hey 😁",
   "created_utc": 1691916646,
   "score": 31,
   "submission_id": "15pjuod"
  },
  {
   "comment_id": "jw1py00",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15pjuod"
  }
 ]
}