{
 "submission_id": "15pjws8",
 "title": "If you met 13 year old you, What advice would you give him?",
 "selftext": "",
 "created_utc": 1691885233,
 "permalink": "/r/AskReddit/comments/15pjws8/if_you_met_13_year_old_you_what_advice_would_you/",
 "score": 120,
 "url": "https://www.reddit.com/r/AskReddit/comments/15pjws8/if_you_met_13_year_old_you_what_advice_would_you/",
 "comments": [
  {
   "comment_id": "jvxx5ue",
   "message": "It wouldn't matter, they wouldn't listen anyway.",
   "created_utc": 1691886293,
   "score": 248,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy0n7d",
   "message": "“When mom takes you to Burger King for those sweet ass Pokémon toys don’t trade your Mewtwo card for that Japanese Tauros. You only believe it’s rare because you’ve never seen one.”",
   "created_utc": 1691887933,
   "score": 101,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy2vz3",
   "message": "You’re going to fall in love with Emily.  For the love of everything that is holy, stay the fuck away from Emily.  \n  \nEDIT: holy shit you guys.  To answer a few people who've asked about regrets / doing things differently:  \nI’ve got a great life now, and obviously can never know how things would have turned out if I hadn’t met Emily. I just know I went through well over a decade of misery because of her, her family, and the insanity they inflicted on everyone around them. Again, who knows… maybe I’d be miserable now if I hadn’t gone through it all back then. But it would have been nice to get through my teens and 20’s without lifelong emotional scars and trauma.",
   "created_utc": 1691889014,
   "score": 147,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy0fi2",
   "message": " Never start smoking, it freaks you out everyday, but you can’t stop",
   "created_utc": 1691887833,
   "score": 12,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxznu9",
   "message": "You would be wise to not drink or do drugs. 13 year old me would surely ignore this advice and proceed to repeatedly fuck up. If I had ever taken anyone’s advice my life would have maybe turned out differently.",
   "created_utc": 1691887468,
   "score": 37,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy2hfa",
   "message": "nothing i can say will prepare you for life, but for the love of god, wear your retainer",
   "created_utc": 1691888818,
   "score": 94,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy2hqx",
   "message": "None of those awful people matter.  AT ALL.",
   "created_utc": 1691888822,
   "score": 91,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvzjwfu",
   "message": "don't drink that shot of tequila on lunch break at school, you have 0 tolerance and will throw up in math class",
   "created_utc": 1691923377,
   "score": 230,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy41vt",
   "message": "Ask her out, High School doesn't matter, don't give a fuck about what people think about you, and stay away from the beer",
   "created_utc": 1691889576,
   "score": 111,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy0p4u",
   "message": "Tell the truth and don't be bullied into lying to save someone else's ass.",
   "created_utc": 1691887959,
   "score": 100,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxzu8c",
   "message": "Buy apple.  Tell mom and dad to sell the house.  Buy apple.",
   "created_utc": 1691887551,
   "score": 104,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvydcg5",
   "message": "Honestly, I'd just give him a hug. He needed it. Poor little nerd.",
   "created_utc": 1691894131,
   "score": 198,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy40ex",
   "message": "Make a big fucking stink about your soon to be/possibly already is stepfather. Your gut is 1000% right about this guy. Trash his shit, spit in his face, harass that fucker until he is out of your life. No one will understand why but it will save everyone so much pain. No more of this self sacrificing attitude that if she's happy so are you.\n\nWhile we're at it, same thing with dad, his happiness in no way equates to your own, she's worse than a fern and it ends in disaster anyway. Not as bad as last time by any sense but still, why engage in a doomed endeavor. \n\nOverall, be the terror I know you can be. Be the frightful little demon of chaos that's locked up inside you. Nothing you do will result in a worse outcome than if you did nothing.",
   "created_utc": 1691889557,
   "score": 222,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxxqul",
   "message": "Stop! Turn back! This way only madness lies.",
   "created_utc": 1691886567,
   "score": 16,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy2l09",
   "message": "Be louder about that abusive mother f'er. You didn't deserve the trauma that SOB inflicted on you. People realized only a few years later you were telling the truth and your peers who tormented you alongside this f'ing teacher didn't know how to speak up and will eventually reach out to apologize.",
   "created_utc": 1691888865,
   "score": 77,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy3wnd",
   "message": "Get tested for ADHD and ask to be put on Vyvanse",
   "created_utc": 1691889506,
   "score": 243,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxzver",
   "message": "Buy Bitcoin, sell at 50k",
   "created_utc": 1691887567,
   "score": 203,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy8d5m",
   "message": "You will meet two beautiful women named Sara (without an H). Keep your privates out of their privates and your life is going to be a lot easier. \n\nAlso, set a reminder on your phone to buy a metric fuck ton of a thing called Bitcoin in early 2010. Buy as much as you can for a year and then sit on it for a decade. What's a phone reminder? Write a fucking note. \n\nFinally, you're going to get your wish and be traveling the country on your own at an early age. Don't be a dickhead like me and wait a decade to catch up with your folks. Especially, your mom. Make sure she has insurance in the late 00's. \n\nNow fuck off and stop leaving beat-off socks behind the speaker, you little weirdo. Your folks know.",
   "created_utc": 1691891662,
   "score": 188,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy4ygm",
   "message": "I'd say, \"you were right\" . Then a slow hug turning into a neck snapping twist. - there can only be one",
   "created_utc": 1691890008,
   "score": 126,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy237z",
   "message": "Work harder in school, save more, don’t buy new cars.",
   "created_utc": 1691888630,
   "score": 74,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy0cev",
   "message": "Trust your gut. Cousin B is always going to a B, she isn't going to change and no matter how \"nice\" she is to your face when mom's around, she tried to kill you when you were three. You'll remember this later.",
   "created_utc": 1691887791,
   "score": 170,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxzowp",
   "message": "The next time someone bullies you punch them in the face. I waited till I was 16 to do that, and it would have stopped a lot sooner if I had just done that.",
   "created_utc": 1691887482,
   "score": 187,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy2jqb",
   "message": "Tell your mom to not throw out the weed that she finds out in front of your house, the guy that lost will come back and will threaten you with death. this will trigger depression, panic syndrome and anxiety. your life will change forever after that.",
   "created_utc": 1691888848,
   "score": 185,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy5k32",
   "message": "The pretty blonde girl who is nice to you in a couple of years is not trying to trap you or bully you, she actually likes you.\n\nAt 18 you'll still think you're fat. When you realize this, think again. You're the skinniest you'll ever be. Be more confident.\n\nDo *not* date a girl called Stephanie in your early twenties. Yes, she looks great and she'll make you feel really good for a little while, but she ends up breaking you for so long that you'll still be broken in your late thirties.\n\nGet therapy. Yes, you'll feel embarrassed. Yes, you think you can do it on your own. You're wrong, it's not embarrassing, and you can't. Believe it or not, you'll actually like it.",
   "created_utc": 1691890299,
   "score": 141,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy4f8f",
   "message": "don’t sell your video games",
   "created_utc": 1691889752,
   "score": 90,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy63rl",
   "message": "You have autism, stop trying to deny that and start figuring out how your brain is wired.",
   "created_utc": 1691890564,
   "score": 85,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy2yt1",
   "message": "I would tell him to wait for Reddit. So he could then look at the advice I just gave to 18 year old me just a few hours ago. I’ll be waiting in anticipation for the advice I’d give 10 year old me on the next post😂",
   "created_utc": 1691889053,
   "score": 62,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy4nch",
   "message": "Move away from your parents and their church the day you turn 18. Full Stop 🛑",
   "created_utc": 1691889860,
   "score": 102,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxygvq",
   "message": "Take school more seriously; you're smart enough to get a free ride anywhere if you put in 50% effort.",
   "created_utc": 1691886909,
   "score": 249,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy61el",
   "message": "Stop being a pussy and ask out that girl you like. You will find out later that many of them liked you back.",
   "created_utc": 1691890532,
   "score": 25,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy1ska",
   "message": "To \"be quick to listen and slow to speak and slow to get angry.\"\n\n......then again I was very thick headed growing up. 😄",
   "created_utc": 1691888487,
   "score": 83,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxzpw2",
   "message": "Don't have sex with him, he's not worth it. And, when you're 16, stay away from 22 year olds.",
   "created_utc": 1691887495,
   "score": 81,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy2o4e",
   "message": "Literally everything you do you will one day look back on with either indifference or regret.",
   "created_utc": 1691888909,
   "score": 24,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy3qig",
   "message": "Stop being afraid of everyone, if they are being dicks to you, go ahead and call them out.",
   "created_utc": 1691889423,
   "score": 21,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy3tpn",
   "message": "\"Make your own decisions and don't let others make you feel bad about yourself. You are AWESOME.\"",
   "created_utc": 1691889467,
   "score": 25,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy6ush",
   "message": "I wanna say I’d tell her to get help but really I’d just give her a hug because she wouldn’t listen and she’s starting to develop symptoms of bipolar and she’s really really sad and doesn’t understand it. I’d give her the hug I often found myself wishing someone would give me. \n\nI was so alone as a kid. She needs a hug.",
   "created_utc": 1691890928,
   "score": 19,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy5zyq",
   "message": "Main a warlock instead of hunter. They’re more fun",
   "created_utc": 1691890514,
   "score": 19,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy3zvs",
   "message": "Don't give your  paychecks to your dad and don't believe anything he tells you.  Yes, I got paychecks at 13.",
   "created_utc": 1691889550,
   "score": 41,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy42w2",
   "message": "Renee Curtis is not your wife. Playground ceremonies do not count. And Little Benny Fifer is not ordained.",
   "created_utc": 1691889590,
   "score": 39,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy4y93",
   "message": "I am 13, but I think any advice my future self would give me there'd be a 50/50 chance I'd ignore it",
   "created_utc": 1691890005,
   "score": 67,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy8h89",
   "message": "It won't get better for a long time. But you will  be ok.",
   "created_utc": 1691891716,
   "score": 18,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy2fvo",
   "message": "Don't ignore the call.",
   "created_utc": 1691888798,
   "score": 17,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy33al",
   "message": "Watch your weight. Go off to college.",
   "created_utc": 1691889112,
   "score": 19,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy1i5v",
   "message": "In 2022 AI will be doing what you are learning now. Switch to machine learning",
   "created_utc": 1691888349,
   "score": 37,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy49lo",
   "message": "Don't talk to the priest alone lol",
   "created_utc": 1691889677,
   "score": 36,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy4y7x",
   "message": "Remember that kid Cameron from pre-k? Don’t let him back into your life, ever.",
   "created_utc": 1691890005,
   "score": 31,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxxgb8",
   "message": "Don't start drinking next year. Put it off a bit",
   "created_utc": 1691886428,
   "score": 75,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy2iby",
   "message": "Stick to your studies and get a good job.",
   "created_utc": 1691888830,
   "score": 15,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxz87x",
   "message": "Spend less time in the military and more time in college.",
   "created_utc": 1691887267,
   "score": 42,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy885l",
   "message": "You're autistic. That's why you have so much trouble socializing. Also, Mom is an evil bitch and horribly incompetent, and will try to control and ruin your life in the name of what she incompetently thinks is best.",
   "created_utc": 1691891595,
   "score": 52,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxxfey",
   "message": "Wow, that’d be 30 years for me. I’d say to invest in Microsoft and be up 330,000% by now",
   "created_utc": 1691886416,
   "score": 13,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxzxt0",
   "message": "Bitcoin...",
   "created_utc": 1691887598,
   "score": 13,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvyqo3v",
   "message": "I would hug my 13 year old self and just sit there holding her hand in silence. 13 was when I started with self harming.",
   "created_utc": 1691901442,
   "score": 13,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxxwj5",
   "message": "You see these roads leading away from the mall to the unknown. Start walking and never look back. Our family wouldn't care at all they're too busy BSing each other to care about lil old us. Don't stop for no one.",
   "created_utc": 1691886643,
   "score": 34,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy4qu0",
   "message": "Love yourself, sooner than later, and take it from me you are more wonderful than you will still likely ever give yourself credit for.\n\nYou are human just like everyone else and you deserve to be loved.  It starts with you, and you're the most important person who can give you that love.  Never lose that, and remember this when you start dating - don't you ever put your self worth in someone else.  Never allow anyone who isn't 100% there for you, and with you, the power to hold your primary source of love.  And even when you find that person, remember who you are and know yourself.  Know your feelings, and your needs, and don't let people bully you into keeping them quiet.\n\nAnd for what it's worth, never lose that love and light in your heart, if you can help it.  I know what you're going through, and you need to try your absolute hardest not to let the world harden you.  Being loving and sensitive is not a weakness, no matter how much people treat you that way.  You can rest assured they are jealous of your light, and are simply not your people.  Never doubt or forget that.",
   "created_utc": 1691889907,
   "score": 39,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy3j16",
   "message": "Don't trip and shatter your front teeth",
   "created_utc": 1691889325,
   "score": 12,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy3vy0",
   "message": "Doesn’t matter. He’d just be like “fuck off old man!”",
   "created_utc": 1691889497,
   "score": 12,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvyxzlg",
   "message": "I wouldn't say anything. My absolute fuck ups led to my beautiful wife and two kids.",
   "created_utc": 1691906245,
   "score": 12,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxyjv7",
   "message": "Lose some goddamn weight",
   "created_utc": 1691886947,
   "score": 24,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy5o96",
   "message": "You don't have to play football.  You don't have to ride bulls and broncs.  Concentrate on roping.  That first girl,  is the girl.  Careful with the drinking.",
   "created_utc": 1691890355,
   "score": 23,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy624o",
   "message": "Don’t waste your money on a fifteen year old celebration. Save it to move to Europe and study there! And don’t go to teacher’s college, you belong in Engineering 🩵",
   "created_utc": 1691890542,
   "score": 25,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy4ky9",
   "message": "Whatever you're thinking... don't.",
   "created_utc": 1691889828,
   "score": 10,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxytw2",
   "message": "This is your chance. Don’t just coast, do it right the first time and everything, *everything* will get better. And you won’t have to live in pain in twenty years.\n\nUnrelated, avoid P2P software at all costs. Seriously. It’ll mess you up for a hot minute. Not worth the hassle buddy.",
   "created_utc": 1691887077,
   "score": 21,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxzm5e",
   "message": "Be active, don’t do this to yourself.",
   "created_utc": 1691887447,
   "score": 18,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy3m6h",
   "message": "Cheese makes your stomach really upset, lay off the stuff.",
   "created_utc": 1691889367,
   "score": 19,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy3n2t",
   "message": "Don't be afraid when your dad yells. He will never physically hurt you.",
   "created_utc": 1691889379,
   "score": 23,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy5286",
   "message": "I'd tell him \"your Dad's disease is POEMS syndrome.\"",
   "created_utc": 1691890058,
   "score": 21,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy5z4l",
   "message": "Bang your best friends older sister when the chance comes up. Fuck that bro code shit.",
   "created_utc": 1691890503,
   "score": 18,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvzgz6z",
   "message": "13  year old me was a girl.",
   "created_utc": 1691921055,
   "score": 18,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy46z6",
   "message": "Stop being such a little prick.",
   "created_utc": 1691889643,
   "score": 8,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy4m5j",
   "message": "Don't take advice from adults.",
   "created_utc": 1691889844,
   "score": 8,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy5aw0",
   "message": "Discipline yourself fatty",
   "created_utc": 1691890175,
   "score": 9,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvyhtdx",
   "message": "I'd ask him when we became a boy.",
   "created_utc": 1691896465,
   "score": 33,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvyhvzz",
   "message": "I wouldn’t, because I’m a 42 year old female and not a him.",
   "created_utc": 1691896503,
   "score": 32,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy4qih",
   "message": "Take care of yourself, don’t hurt yourself, make good decisions. Don’t be afraid to say no and set boundaries. You don’t have to please everyone.",
   "created_utc": 1691889903,
   "score": 7,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy4t1n",
   "message": "Don't do IB.  Go to Pre-Law magent orgram.  Go to Law school.",
   "created_utc": 1691889937,
   "score": 7,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy5f88",
   "message": "Go to school you lazy self indulgent piece of shit",
   "created_utc": 1691890233,
   "score": 9,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy634b",
   "message": "Hey, my guy,\n\nTake it easy. Almost everything from here on out won’t have a clear blueprint. That’s okay. You don’t have to be everything and everywhere all at once. You can work on yourself and your issues and make peace with yourself sooner, if you try. It’s okay to think you can become who you want, because you’ll get so much farther than you think. Be curious about everything. Get some sleep. Go for more walks. Talk to your friends more. Take it all in, too, it’s not happening again.",
   "created_utc": 1691890555,
   "score": 8,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy9w8h",
   "message": "Hang in. It’ll be alright.",
   "created_utc": 1691892405,
   "score": 8,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvynlu3",
   "message": "I'd strangle him to death as a murder/suicide",
   "created_utc": 1691899644,
   "score": 7,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy9r33",
   "message": "You have ADHD and Bipolar, you need medication. Get it now before you become an adult that has to pay for insurance",
   "created_utc": 1691892336,
   "score": 14,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy4g04",
   "message": "When this new thing comes out in the early 2000’s called cryptocurrency buy as much bitcoin as you can put in on external hard drives and write down the code and email to yourself in your hotmail account. You still have that. They will be whole coins that are purchasable for Pennies and you can let a computer mine more. When bitcoin hits 50k per bitcoin sell them all. \n\nAs far as women go you will not get a girlfriend until college so like just don’t sweat it. You will find the one in college by chance at a friends house if that somehow doesn’t happen she will be associated with x,y,and z persons. Her name is xxxxxx xxxxxx. You will almost certainly known these associates at 18 so keep up with them at least tangentially. Get you grandma and mom to buy these five stocks as much as they can and hide it. Hold on to your toys people actually pay more for them later. Do not listen to your dad about the future he’s so wrong it would be comical if not for being so sad. Also he and you are going to butt heads a lot. He’s got issues  just let him think he won. \n\nHug your family more and good luck because shit gets real fucked up sooner than you think but hopefully the extra money will help with that.",
   "created_utc": 1691889762,
   "score": 8,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy50y6",
   "message": "Invest heavily in bitcoin when it comes out.  Sell it when it hits 55k and love out the rest of your days ignoring the world burning down around you.",
   "created_utc": 1691890041,
   "score": 6,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy5arn",
   "message": "convince your parents to not move away for the year you still haven't recovered from the shit that went down",
   "created_utc": 1691890174,
   "score": 7,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvy6zmw",
   "message": "It'll be ok you'll get through it",
   "created_utc": 1691890994,
   "score": 8,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvybmp3",
   "message": "Hey, moron, you know that girl you like? yeah go for her you fuckin idiot",
   "created_utc": 1691893262,
   "score": 7,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jvxxq67",
   "message": "1. Don't worry what anyone thinks of you (including mom and dad). Just be yourself and you'll find your people. \n2. Don't date just so you have a GF. Date because you want to date that girl and nobody else\n3. It gets better. I know you think it won't and there's no out but there always is even if it takes effort and time. There is always hope for a better tomorrow.",
   "created_utc": 1691886558,
   "score": 12,
   "submission_id": "15pjws8"
  },
  {
   "comment_id": "jw1wnk0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15pjws8"
  }
 ]
}