{
 "submission_id": "15pt1nv",
 "title": "What is the longest you've gone without eating and why?",
 "selftext": "",
 "created_utc": 1691913856,
 "permalink": "/r/AskReddit/comments/15pt1nv/what_is_the_longest_youve_gone_without_eating_and/",
 "score": 226,
 "url": "https://www.reddit.com/r/AskReddit/comments/15pt1nv/what_is_the_longest_youve_gone_without_eating_and/",
 "comments": [
  {
   "comment_id": "jvzjcr7",
   "message": "10 days just water when I had glandular fever and couldn’t swallow anything without excruciating pain. I’d have to dip the water on my tongue and almost let it be slowly absorbed to the back of the throat.  I was given crushed up soluble vitamins and even that I’d just sit in my tongue without swallowing and just let it dissolve.\nHonestly, the pain of swallowing was like eating glass mixed with barbed wire.\n\nIt’s strange cos hunger kicks in after 24 hours and is quite overpowering for the next 2-3 days - then once you get passed that it sort of disappears entirely and just comes and goes in short bursts.",
   "created_utc": 1691922948,
   "score": 188,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvz8kto",
   "message": "Because of a gastroenteritis, I was 7 days without being able to eat and keep anything down. \nOn another occasion, due to anxiety, depression I was without eating for 5 days.",
   "created_utc": 1691914231,
   "score": 150,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvze9rf",
   "message": "Four days. A hangover from three straight years of drinking everyday. I was in detox.",
   "created_utc": 1691918828,
   "score": 53,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvznfrj",
   "message": "3 days, heartbreak\n\n\n\n\nEdit: WOW. I never anticipated that my three brief words would lead to this massive response. Thank you Reddit for all the upvotes and the kind stranger for the award. I'm blown away. \n\nTo everyone who has experienced this kind of paralyzing heartbreak: you are obviously not alone and at least almost 5k strangers can totally relate to whatever it is you're going through or have gone through at some point. I does get easier some day, somehow, but you are never immune to experiencing it again. And thankfully so. Think of it this way, as clichéd as it may sound: if your heart breaks, at least you know you've really loved. That is never a bad thing. 💜💜",
   "created_utc": 1691925945,
   "score": 253,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzedr8",
   "message": "I cant tell the exact time but its a few days. When depression hits hard and you wont leave your bed at all.",
   "created_utc": 1691918919,
   "score": 172,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzhrvl",
   "message": "7 days.\n\nI was suffering with anorexia at the time. Fully recovered now. :)\n\nEdit: I really didn’t expect this to resonate with so many people. If you’re still struggling, I believe in you ❤️ if you’ve also recovered, I’m proud of you ❤️",
   "created_utc": 1691921692,
   "score": 211,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzinsu",
   "message": "4 days. Sub ran out of food on deployment after delays happened.",
   "created_utc": 1691922399,
   "score": 120,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzdf28",
   "message": "3 days. Homeless and smoking Crack. Didn't even like Crack. Smoked it to stay awake because I woke up on multiple occasions with different strangers trying to rape me.",
   "created_utc": 1691918135,
   "score": 147,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvz8hfu",
   "message": "2 days. Cocaine\n\nEdit: Why do none of my well thought out posts get any of this kinda love? Oh well, there's a lesson here I think.",
   "created_utc": 1691914155,
   "score": 94,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jw0fkmv",
   "message": "I ate one meal (about 200kcal) about 3x a week, in total for a month, because my bank was late giving me my student loan money. I lost like 15kg in that time. It was just before Christmas, so you bet as soon as I went home, I ate like 3 plates of food and almost immediately wanted to just fall asleep for hours lol",
   "created_utc": 1691939875,
   "score": 143,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzhrig",
   "message": "6 days. I was water fasting. Without electrolytes so bad idea. Also, never trust a fart when on a fast, learned that the hard way",
   "created_utc": 1691921684,
   "score": 251,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzbqhl",
   "message": "4 days. Depression. When I say ADHD has almost killed me on a number of occasions, this was one of them. Now I survive via spite and rage.",
   "created_utc": 1691916771,
   "score": 82,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzgfed",
   "message": "Almost 3 days. Covid.",
   "created_utc": 1691920608,
   "score": 48,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzgyzg",
   "message": "Around two weeks. Eating disorder, abusive parents, and depression after my brother died",
   "created_utc": 1691921050,
   "score": 40,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzb7t1",
   "message": "3 days, lack of money, and my family could eat while I didn’t. My family means more Thani do.",
   "created_utc": 1691916359,
   "score": 83,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzoyi2",
   "message": "A month, didn't know had malaria, almost died.",
   "created_utc": 1691926953,
   "score": 159,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzdv18",
   "message": "5 days. depression. but i'm fucking fat as fucking fuck, so it doesn't really matter.\n\nEdit: this was years ago, and i'm doing much better now (still fat though).",
   "created_utc": 1691918494,
   "score": 214,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzl2mg",
   "message": "I clicked on this thinking fasting 25 hours every Yom Kippur would be a big flex. Boy was I wrong...",
   "created_utc": 1691924268,
   "score": 216,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzd143",
   "message": "I had a GI bleed and needed a bunch of scans to find the source (one/day). Ended up not being able to eat for four days. Made the colonoscopy prep fairly easy because there was nothing in there but blood, so once that was out I could stop drinking the laxative. The liquid diet dinner I got that 4th day was basically heaven.",
   "created_utc": 1691917819,
   "score": 55,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzedr5",
   "message": "3 days. Depression and break up.",
   "created_utc": 1691918919,
   "score": 152,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvz89az",
   "message": "Two weeks. The first time was because I was so depressed after my moms suicide I had no appetite. Every time after that was because I have nothing to eat and no way of getting any.",
   "created_utc": 1691913976,
   "score": 204,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzfok7",
   "message": "A day and a half. Overworking myself to the point of not doing anything other than the things that needed done.\n\nI was skipping lunches in school for a few days, then said I was too sick for dinner on one night (I was actually feeling sick, but likely from stress and needed to eat). I was functioning off of water and Pepsi",
   "created_utc": 1691920001,
   "score": 77,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzzqj1",
   "message": "5 days. Military survival training.",
   "created_utc": 1691932993,
   "score": 37,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jw020cv",
   "message": "One day.   The poop chute examination",
   "created_utc": 1691934087,
   "score": 84,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzcy0l",
   "message": "21 days, water fast",
   "created_utc": 1691917749,
   "score": 226,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvza50h",
   "message": "2 days. Food poisoning",
   "created_utc": 1691915484,
   "score": 61,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzanm8",
   "message": "2 days depression",
   "created_utc": 1691915900,
   "score": 26,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzcf8r",
   "message": "Probably a day or two. Pregnancy stopped anything from staying down and the thought of food touching my lips brought the little that was there up",
   "created_utc": 1691917329,
   "score": 22,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzhxk1",
   "message": "Probably 8 days, eating disorder + working 3 jobs",
   "created_utc": 1691921821,
   "score": 22,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzm80j",
   "message": "5 days, intense anxiety. Lost 5kgs",
   "created_utc": 1691925104,
   "score": 23,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzh3g1",
   "message": "2 days. Was left home alone, and back then, I'd only eat when I was hungry, since that's what some movie I watched as a child taught, and it also made sense to me. \n\nHowever, I don't experience hunger, at all, so that system doesn't work. But I didn't know that back then, and just assumed that the \"3 meals a day\" thing was yet another random social norm everyone follows because they've always done it that way. \n\nNowadays I have a different system, and usually eat enough.",
   "created_utc": 1691921149,
   "score": 56,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jw0hc56",
   "message": "A week, and no water for 3 days while doing the most intense workouts of my life. High school wrestling can be pretty toxic.",
   "created_utc": 1691940585,
   "score": 18,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzdw81",
   "message": "74 hours.. Depression.. Tried to starve myself to death",
   "created_utc": 1691918520,
   "score": 84,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzhvk8",
   "message": "There was a period when I was extremely ill, and could not keep down food and water. I was having a manic bipolar episode and the intense anxiety that came with it caused me to throw up multiple times a day every day. For about two and a half months. I probably ate about 300 calories every 4 days at best and I would most likely throw it back up later. I was in and out of the hospital. I was literally starving to death while I laid ony couch. I looked like a skeleton. I was so weak that I could barely walk.",
   "created_utc": 1691921776,
   "score": 43,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzokkv",
   "message": "About 14 hours, I sometimes just forget to.\n\nBut if I don't eat every ~8 hours I get irritable, my stomach hurts, I feel like I'm going to throw up, and I get a pretty bad headache.",
   "created_utc": 1691926699,
   "score": 122,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzqlze",
   "message": "2 days. Fasting. To reflect on pain and hunger. My conclusion, nobody should be hungry.",
   "created_utc": 1691928000,
   "score": 14,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzekmn",
   "message": "Around three months. Back in 1989, so I'm a little hazy on its duration. I was on a semi-starvation liquid diet. I needed to drop a lot of weight, fast. It worked. I've gained and lost since then, but I've never been as heavy as I was prior to those weeks in '89.",
   "created_utc": 1691919079,
   "score": 101,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jw02hkg",
   "message": "Worst time was 7 days in the hospital from pancreatitis due to leftover stones in the bile duct after gall bladder surgery which only took four years to figure out and get fixed.",
   "created_utc": 1691934307,
   "score": 14,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jw2efe8",
   "message": "Few years of extreme poverty which createe absolutely no reserves for my body. Then went 5 days without food or, electricity. Towards the end was having spoons of castor sugar a couple times a day for energy out of desperation. At the end of day 5 I went into our local corner shop, probably looking worse for ware and very politely explained to the shop owner that I wasn't doing too well and if he had anything spare he was going to throw out.\n\nThis shop owner proceeded to give me an empty bag, and then walked around with me whilst he suggested certain food items high in energy. Loafs. Fruit cakes. Fruit. Sandwich fillings. Pastries. Biscuits etc. He allowed me to fill the bag, he then gave me some cash which he explained I should \"pay\" for it with to avoid embarrassing me. Despite being his own money, he then gave me the change.",
   "created_utc": 1691967560,
   "score": 18,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jw1jqd0",
   "message": "I think it was four days, I'm not sure.   \nMy wife died and l fell apart.",
   "created_utc": 1691955430,
   "score": 11,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzj2uw",
   "message": "12 days, severe depression and anxiety.\n\nWorst part was getting used to eating again. Everything just grew in my mouth, and a mouthfull would make me nauseous.\n\nAnd I mean nothing, no chips, no sodas or liquid nutrients..just water.",
   "created_utc": 1691922732,
   "score": 25,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzjpwn",
   "message": "3 months, liquids only. Eating disorder.",
   "created_utc": 1691923234,
   "score": 24,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzk2d6",
   "message": "Missed dinner one night, skipped breakfast because I was running late, forgot to bring money for lunch. \n\nAbout 30-32 hours, entirely on accident.",
   "created_utc": 1691923503,
   "score": 29,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jw0nfit",
   "message": "Three months, probably depression on losing my eyesight, After that I was probably anorexic for about a decade, just eating a potato a day.  Poverty was part of the issue then.",
   "created_utc": 1691942981,
   "score": 29,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jw0481o",
   "message": "3 solid weeks due to non-stop panic attacks. 3 fucking weeks. I lost around 30 pounds and was hooked up to fluids at the hospital since I couldn't drink. My panic disorder is so severe that I've been in the ER over 100 times for dehydration. Luckily, it's gotten better over the years as sweet, sweet crippling depression has taken over instead. 🤷‍♀️🤦‍♀️",
   "created_utc": 1691935093,
   "score": 31,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvziya5",
   "message": "A whole day.. felt like an eternity\n\nMum had invited friends around and I had slept in, way overtime. I'm extremely shy, so I try my best to avoid the small talk, even the quick \"hi guys\" gives me a rush of anxiety. \n\nAnyways to get to the kitchen and bathroom you'd have to go through the lounge.. they were all in the lounge.. for the whole fucking day.. \n\nSo yeah, rotted away in my room that day because I was quite literally too scared to greet people",
   "created_utc": 1691922630,
   "score": 65,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzpjsb",
   "message": "7 days, still had water to drink.\n\nIt was a survival course at school. Build a shelter as a team and if you want food go catch it. I did not catch anything. Did it 2 years in a row. 17 \u0026amp; 18yrs old.\n\nLost 2st first year and 1.5st 2nd year.",
   "created_utc": 1691927336,
   "score": 12,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jw2qbe3",
   "message": "20 days - heroin withdrawal\n\nMy last time in detox I refused all my withdrawal meds so I could actually feel the damage I had done to myself\n\nI had been before but wanted this to be the last time. At that point, was using 3.5 times more heroin per day than my prior detox/rehab trip. I really needed it to work or I was toast \n\nI spent most of the 20 days laying face down on the detox shower floor letting the puke flow from my mouth directly down the drain\n\nI was sent to the ER 3 times for IV fluids. Couldn't even swallow spit\n\nLeft detox at 140lbs. Left rehab at 190lbs\n\nClean 7 years now and haven't had one moment I've wanted to use again after that\n\nFor anyone curious, the first thing I ate was a pineapple chunk from those fruit cocktail cans lol",
   "created_utc": 1691972722,
   "score": 14,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvzhaga",
   "message": "4 days because of... stuff that makes you go weeeee",
   "created_utc": 1691921303,
   "score": 19,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jw151kq",
   "message": "Over three weeks, anorexia. Not only once but for years intermittently. I'm lucky to have survived. It's gruelling and ugly and can wreck you for life if it doesn't kill you.\n\nEDIT:  I'm recovered (have been for yrs) and actually really enjoy food nowadays! Luckily almost no lasting damage after 3 yrs of pretty frustrating physical healing.",
   "created_utc": 1691949738,
   "score": 18,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jw2avd4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15pt1nv"
  },
  {
   "comment_id": "jvznfxa",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15pt1nv"
  }
 ]
}