{
 "submission_id": "15pvu3j",
 "title": "What's the best response to \"I love you\" when you're not ready to say it back?",
 "selftext": "",
 "created_utc": 1691923988,
 "permalink": "/r/AskReddit/comments/15pvu3j/whats_the_best_response_to_i_love_you_when_youre/",
 "score": 173,
 "url": "https://www.reddit.com/r/AskReddit/comments/15pvu3j/whats_the_best_response_to_i_love_you_when_youre/",
 "comments": [
  {
   "comment_id": "jw0dht9",
   "message": "When Monica Lewinsky told president Bill Clinton she loved him, he replied “That means a lot to me.”",
   "created_utc": 1691939038,
   "score": 97,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw04doh",
   "message": "I said I love you before my partner was ready to say it back. He said, \"I appreciate you being honest and telling me how you feel. I'm not there yet, but I think I will be someday.\" We now live together and I think he says it more than I do lol.\n\nEDIT: I didn't expect this many people to like and comment on this! Thank you so much!",
   "created_utc": 1691935163,
   "score": 176,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw09vnp",
   "message": "I said it too soon. She responded with something resembling whale sounds. I drove home that night thinking I would never see her again.\n\n6 years later, sometimes when one of us says “I love you,” the other one will make whale sounds back.",
   "created_utc": 1691937551,
   "score": 180,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzsa4n",
   "message": "We appreciate your loyalty. Here's a $25 Starbucks gift card.",
   "created_utc": 1691929003,
   "score": 234,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzrzse",
   "message": "Your sentiment has been noted. I'll take it under consideration. Thank you.",
   "created_utc": 1691928833,
   "score": 60,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzo5y0",
   "message": "\"Cool...\" and then finger guns",
   "created_utc": 1691926431,
   "score": 218,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzl7tj",
   "message": "I love YouTube",
   "created_utc": 1691924374,
   "score": 227,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw02ydy",
   "message": "Shut up baby I know it!",
   "created_utc": 1691934522,
   "score": 188,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzohb6",
   "message": "Pocket sand!",
   "created_utc": 1691926639,
   "score": 120,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw04fup",
   "message": "I will say this, Do Not Ignore Their Saying It. You do not have to say it back but always acknowledge it. It can be as simple as kissing them, saying thank you, I love hearing that, I care about you too, etc. but straight up ignoring it is extremely harmful",
   "created_utc": 1691935189,
   "score": 105,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzunkq",
   "message": "You are very important to me too",
   "created_utc": 1691930366,
   "score": 14,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzl7c5",
   "message": "I know.",
   "created_utc": 1691924363,
   "score": 77,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw03z9z",
   "message": "TOO SOON! YOU HAVE AWAKENED ME TOO SOON, EXECUTUS!",
   "created_utc": 1691934987,
   "score": 135,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzunrh",
   "message": "Thank you for having the courage to say that to me and I am so flattered. Right now, I don’t feel ready to say it back. I like you very much but I’m just not ready to say I love you",
   "created_utc": 1691930369,
   "score": 170,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw091uy",
   "message": "Touch their nose and say “Boop”.",
   "created_utc": 1691937204,
   "score": 121,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzrgwc",
   "message": "If it comes at an awkward or inappropriate time, like a first date, and you’re not going to say it back, it probably doesn’t matter what you say next…and there’s too much situational variability to provide a singular “this is the best response” answer to the question.\n\nIf it comes at an appropriate time, but you’re just hung up on it, you have about half a second to decide if this person means enough to you to risk fucking things up by not saying it back or getting over your hang ups and reciprocating.",
   "created_utc": 1691928518,
   "score": 215,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw05ud3",
   "message": "I love…. Cake.",
   "created_utc": 1691935805,
   "score": 41,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzwoa2",
   "message": "My ex and I had a complicated relationship in the beginning.\n\nWe worked in a shop together. I’d been there for 3 years and he started as a newbie around Easter. Easter came and went, and one day as he was leaving he’d found some mini eggs behind some confectionary on the shelves. He was clocking out and I served him at the tills, and he presented the bag of mini eggs. They scanned through at full price, and I said “absolutely not.” It wasn’t Easter! So I manually marked them down to something stupid like 20p. He blurted out “I love you.” And I just sort of stared at him. We were only colleagues at the time, but we’d flirted a bit.\n\nHe didn’t realise what he’d said.\n\nWe continued to get closer, and soon enough he was saying “I love you” regularly. We weren’t officially together, but we’d been sleeping together and he wanted a relationship. I wasn’t ready to say it back, so instead of saying “I love you too” or sometimes if he just didn’t want to put the pressure on me to say it back, we’d say “mini eggs” since when I served him the mini eggs was the first time he said it.\n\nWhen we had our first fight, which was only a few weeks into sleeping together, still no official relationship, we didn’t speak for 10 days. He no longer worked at my shop at this time, and one night I finished a late shift at 11pm, got home to find an Amazon parcel for me. I was so confused… I panicked, wondering if someone had bought something on my account and opened it… only to find a MASSIVE jar of mini eggs inside. His way of saying sorry and wanting to get back in contact.\n\nSo yeah, that’s my silly story of the day.\n\nMy ex-boyfriend and I used to say Mini Eggs instead of “I love you” at the start… and close to the end too, when I think he was beginning to fall out of love with me.",
   "created_utc": 1691931450,
   "score": 30,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzku71",
   "message": "Crazy weather we’re having, huh?",
   "created_utc": 1691924091,
   "score": 135,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw0atk4",
   "message": "Thank you",
   "created_utc": 1691937945,
   "score": 24,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzqqmh",
   "message": "I think we're both reading the same book, you're just a chapter or two ahead of me. I'm catching up though.",
   "created_utc": 1691928080,
   "score": 180,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzv3sh",
   "message": "Stop drinking MOM",
   "created_utc": 1691930614,
   "score": 43,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw0dm67",
   "message": "By accident my supervisor said take care I love you when I called out. I felt I had to say it back or it would be awkward so i did. Then we saw each other, and thru eye contact were like it's OK we'll never speak of this again 😆 🤣 😂",
   "created_utc": 1691939087,
   "score": 48,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw0qjs2",
   "message": "\"It'll pass.\"",
   "created_utc": 1691944189,
   "score": 47,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzkspi",
   "message": "Say \"dude! That's awesome sauce!\" and go for a high five.",
   "created_utc": 1691924060,
   "score": 125,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzksir",
   "message": "Depends on the person",
   "created_utc": 1691924056,
   "score": 75,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzwaad",
   "message": "\"You know, I think we're out of milk. I'll go and buy some. Be right back!\"",
   "created_utc": 1691931245,
   "score": 65,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzxzht",
   "message": "\"Welcome to Costco!\"",
   "created_utc": 1691932120,
   "score": 32,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw1nocn",
   "message": "this is in the case that you’d wanna still be w them and continue:\n\n“i’m happy you were open with me about your feelings, and i really value that love. I don’t think I’m on the same page just yet, but i’m asking you to trust that we’re reading the same book, and i’ll arrive there in my own time”",
   "created_utc": 1691956939,
   "score": 15,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw00kf4",
   "message": "silently mouth \"I know\" then pretend to be frozen in carbonite.",
   "created_utc": 1691933401,
   "score": 15,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzsss1",
   "message": "“Are you sure? It’s only been (insert amount of time here long or short).”",
   "created_utc": 1691929307,
   "score": 12,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzvcb2",
   "message": "Go full tsundere: \"Wh-what??!! Is this some kind of trick? I'm not that gullible I-idiot...\"",
   "created_utc": 1691930746,
   "score": 84,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzvdnx",
   "message": "“I love me too”",
   "created_utc": 1691930766,
   "score": 32,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw0apg2",
   "message": "I'm hungry, let's get something to eat.",
   "created_utc": 1691937899,
   "score": 28,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzww9r",
   "message": "I love lamp",
   "created_utc": 1691931565,
   "score": 19,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzxgol",
   "message": "Stealing a line from Ponyo:\n\n\"I *will* love you!\"",
   "created_utc": 1691931857,
   "score": 20,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw0vq77",
   "message": "I'm guessing that pointing at something behind them and yelling: \"LOOK!\", then running away is not a good answer.",
   "created_utc": 1691946194,
   "score": 21,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzs7mn",
   "message": "I do like you a lot but I am not ready to say it back yet. I will when I am ready. Don't feel bad please.",
   "created_utc": 1691928961,
   "score": 34,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzrcp3",
   "message": "I'm uncomfortable",
   "created_utc": 1691928448,
   "score": 15,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw039hn",
   "message": "FALAFEL",
   "created_utc": 1691934663,
   "score": 24,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzrwjs",
   "message": "That's very sweet, and I'm flattered that you feel that way. I'd like to take things slow and not rush into using such strong words, but I'm enjoying the time we've spent together so far. You're a very (sweet / kind / interesting / caring etc) person.",
   "created_utc": 1691928779,
   "score": 77,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzrw3y",
   "message": "I am not there yet. I am glad you share your love with me. I enjoy sharing my attention with you. I am grateful for your love.",
   "created_utc": 1691928772,
   "score": 36,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw0x5u2",
   "message": "I love lamp",
   "created_utc": 1691946742,
   "score": 6,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzrnr7",
   "message": "“That’s nice.” /Otis Milburn/",
   "created_utc": 1691928633,
   "score": 12,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvztsvv",
   "message": "I know",
   "created_utc": 1691929887,
   "score": 7,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzuqek",
   "message": "I know.",
   "created_utc": 1691930410,
   "score": 6,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw0rfof",
   "message": "Depends how you feel about them. If it's someone I may eventually feel that strongly for:\n\n\u0026gt; I care about you too, and while in the future I may feel that strongly, it's just not something I'm comfortable saying at this point. I enjoy spending time with you, I care about you, and I want to keep this going, I'm just not ready to make that step right now.\n\nIf it's someone you don't see yourself being that strongly towards:\n\n\u0026gt; I appreciate your feeling for me, but I don't feel that strongly. And I don't think I will. Let's have a talk about where we see this going, and boundaries. I still enjoy your company, but I want to be sure we're on the same page, and you're not wanting something I can't provide.",
   "created_utc": 1691944533,
   "score": 6,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw0ruq3",
   "message": "“I really like you, but im not ready to say i love you right now.” Stop playing games and be upfront when it comes to communication",
   "created_utc": 1691944699,
   "score": 6,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw0xaje",
   "message": "one option is: I love you too. \n\nWords are sometimes powerful but meaningless and can trigger a lot of irrational fears and insecurities. I believe love is something you work with your pathner. The more you know them and appreciate the things they give you the more you will love them. Love is not the same as obsession, when you have that intense feeling some people call “love at first sight” , you are not in love as “a couple that love eachother”, you are in love as “I love chocolate icecream”.\n\nso even if you dont feel that intense love, you can still reply that you love them if you feel like they are right for you because eventually you will fall in love with them. And also you will avoid them being insecure.\n\nsome people are lucky enough they fall in love at first sight with the right person, but I think that most of those loves at first sight are just horniness and ideation that happen to be lucky enough to actually discover that person is also a very good person and a lovely and healthy pathner",
   "created_utc": 1691946792,
   "score": 5,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzuk3c",
   "message": "Be honest. Thank them. Tell them that it means a lot but that you are not yet ready to say it to them. Tell them when you say it, you want it to be honest and not full of internal questions you currently have.",
   "created_utc": 1691930313,
   "score": 11,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzw4mt",
   "message": "I know",
   "created_utc": 1691931161,
   "score": 13,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jvzsoag",
   "message": "You seent star wars right?",
   "created_utc": 1691929234,
   "score": 15,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw0xq0m",
   "message": "I remember seeing a comment made by a Redditor for this exact question asked a few years ago. The response was \"We're reading the same book, and you're a few chapters ahead\".",
   "created_utc": 1691946955,
   "score": 10,
   "submission_id": "15pvu3j"
  },
  {
   "comment_id": "jw2826d",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15pvu3j"
  }
 ]
}