{
 "submission_id": "15q0oos",
 "title": "Assuming you are older, where were you in life at the age of 26?",
 "selftext": "",
 "created_utc": 1691937786,
 "permalink": "/r/AskReddit/comments/15q0oos/assuming_you_are_older_where_were_you_in_life_at/",
 "score": 109,
 "url": "https://www.reddit.com/r/AskReddit/comments/15q0oos/assuming_you_are_older_where_were_you_in_life_at/",
 "comments": [
  {
   "comment_id": "jw0alai",
   "message": "Smoking a blunt at 4 in the morning inside my pt cruiser",
   "created_utc": 1691937850,
   "score": 163,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0vd4u",
   "message": "I’m currently 38.\n\nWhen I was 26 I was a medic in Afghanistan. I was a Sergeant attached to the infantry, running an aid station in a small combat outpost in Sperwan Ghar.\n\nWe had a company of infantrymen. maybe ~120 dudes divided between three platoons plus headquarters, plus me and three medics (each platoon had a medic as well).\n\nWe were in a pretty shit area. Each day a different platoon would go on patrol with their assigned medic. Since the area was so chaotic we would supplement them with an extra medic (me and my soldiers would rotate through that responsibility), while the rest of us prepared our little trauma aid station to receive casualties if they got injured or haul ass to their location in our medical Stryker. Air evac want always possible due to ground fire, so we had to be ready.\n\nAbout once or twice a week we would receive casualties from the local civilians/police/afghani army. Usually it was a kid or young adult who stepped on one of the hundreds of IEDs in the area meant for us. It was fucked and a lot of it still burned into my memory, though I’ve been able to work through most of that trauma.\n\nEvery month or two the local combatants would try and attack us and overrun the outpost. It sounds worse than it really was, we had 120 eager shooters and they never assaulted with more than like 15 or 20 dudes. They would get lit the fuck up pretty quick. The sheer volume of red tracer fire that you could see against the night sky made it look like fuckin dragons breath from a distance. \n\n26 was a rough year but at the same time it was a great year. When you’re in that kind of situation, the simplest joys are magnified 1000 fold. Something as simple as FINALLY getting hot chow at our DFAC and it being motherfucking tacos would cause feelings of intense joy - literally as if you took fuckin drugs, I felt high it was awesome.\n\nAnyways, thanks for coming to my Ted talk. I’m prepared to get flamed and downvoted by leftists, even though I’m a filthy communist.\n\nEdit: added my age",
   "created_utc": 1691946055,
   "score": 61,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0beo6",
   "message": "Studying clinical psych and reading case studies about child abuse while in quarantine. It really put into perspective whether or not I could cope with a career that is so heavy, especially because I myself have PTSD. I changed majors. Now I’m going to be a zookeeper :)",
   "created_utc": 1691938189,
   "score": 88,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw18qjf",
   "message": "I had just left my abusive husband with my ten month old son. I had no job, no money, and nowhere to live with only what my best friend and I could fit into our two small cars. My family was states away and weren’t able to support me financially.\nI’m now 32, my son is six and going into first grade. I’ve been with my now partner for three years. My friends and his friends are all now friends and we are thriving! The struggle is still real, but I’ve come so far. I’m filled with gratitude for my friends and my partner and my son. \n\nDo your best, your best is enough. Spread love and kindness wherever you go. Look for the beauty in everything. You can do this!",
   "created_utc": 1691951176,
   "score": 35,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0gasv",
   "message": "Smoking pot in my parents basement and working some dead end job. Now I vape pot in my basement but I manage a commercial department at a car dealership.",
   "created_utc": 1691940166,
   "score": 52,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0b6dr",
   "message": "a depressed alcoholic about to get sober for good. isolated with the pandemic and not in a good way at all. in and out of psych wards. just awful",
   "created_utc": 1691938093,
   "score": 35,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0awg5",
   "message": "Just got my first real full-time job in my field.",
   "created_utc": 1691937979,
   "score": 14,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0djfb",
   "message": "Just finished CPA, busy with training to get experience signed off... I left the year after to consult for a bank 🤷",
   "created_utc": 1691939055,
   "score": 13,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0arn1",
   "message": "Broken, beaten, abused, depressed and emotionally cut off from the world, They wernt good times for me back then.",
   "created_utc": 1691937923,
   "score": 22,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0q2g8",
   "message": "In law school, about to get married. \n\nBoth were terrible mistakes.",
   "created_utc": 1691944003,
   "score": 9,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0bo5k",
   "message": "At 26, I was juggling my first \"real\" job, fueling my passion for painting, and engrossed in terrible dance moves at late-night house parties - reminiscing now puts a big grin on my face!",
   "created_utc": 1691938295,
   "score": 7,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0ebiz",
   "message": "Ironically enough, at the age of 26, I was simultaneously basking in the glory of extended Sunday morning sleep-ins whilst secretly panicking about the impending circus experience known as 'adulting.",
   "created_utc": 1691939373,
   "score": 13,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0fvm0",
   "message": "Working on my career advancement. Not dating anyone. Working long hours to out perform the others. Getting promoted a year ahead. Getting assigned to tasks to demonstrate my ability to adapt. Never failed any task. Near flawless performance appraisals. Double digit pay raises each year. Drew self esteem from my achievements.",
   "created_utc": 1691939999,
   "score": 7,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1d1t3",
   "message": "2003... heartbroken after my girlfriend of 2 years broke up with me. Broke(ish) and had to move out of our apartment to a cheaper place. Working temp jobs because I'd been laid off 6 months earlier. But, also I was lucky. I found a great place with an awesome roommate who was in a band. He knew everyone and had tons of friends. We went out all the time, I met lots of people (and some good hookups) That helped get me out of my funk. Found a full time job, went back to grad school, graduated in 2007 with an MBA and went on to a second, third, and forth career.",
   "created_utc": 1691952839,
   "score": 7,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0etlj",
   "message": "At 26 I was a senior lab tech at a London hospital that's when I started doubting my career choice.",
   "created_utc": 1691939575,
   "score": 5,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0pazb",
   "message": "I was recovering from Cancer lol and working full time to the best of my abilities",
   "created_utc": 1691943709,
   "score": 6,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0i5l5",
   "message": "I was teaching English on the other side of the world. In hindsight it was among the years of my life",
   "created_utc": 1691940912,
   "score": 3,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw14dxh",
   "message": "2 years ago at 26 I was still living with my father, degree-less, having only worked odd entry-level customer service jobs. At the time, I had found my way into my local government's Finance department, but in an entry-level trained division unlike being an accountant. It was my first office job and a year before that I had begun growing fat for some reason. Guess hitting 25 was my personal prime drop-off.\n\nSo yeah, miserable in an office job, fatter than I've ever been and just living, going home and playing video games, wasting all my money on things. \n\nNow I'm still degree-less. Exactly 1 year and 2 weeks ago, I left that office job to move up to Houston where my mother lived so I can pursue a trade certification. Got 3 certs but honestly I won't be pursuing it anymore. Now earning ok money at a well paying business that runs a theme park-like convenience store. Trying to get rid of debt, already lost 50 pounds and back to good weight, but depressed at having wasted my teenage years and 20's. Trying to think of what degree to go back to college for next year. I'm thinking something in health but idk.",
   "created_utc": 1691949485,
   "score": 4,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1d4a5",
   "message": "I had $4 grand in the bank, I had just got married and bought my house, working a shitty manufacturing job. I was in kinda rough shape, honestly. Buying broken cars and flipping them just to pay the bills. I had begun teaching myself CNC programming and design (I had JUST built my first CNC machine). 8 years later I'm the maintenance foreman for an engineering department. My speciality is electrical controls. So 26 year old me actually figured out some pretty good shit.",
   "created_utc": 1691952866,
   "score": 4,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw2243r",
   "message": "Married, and my first daughter was a newborn. 1980.",
   "created_utc": 1691962528,
   "score": 4,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0izi0",
   "message": "Mainly drinking with my best friend, and just starting to fail at life.",
   "created_utc": 1691941245,
   "score": 3,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0u9wf",
   "message": "I’m only 27, but will be 28 in two months. At 26, I was finishing off my Masters and trying to recover from 2021 lockdown.",
   "created_utc": 1691945639,
   "score": 3,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0xc7s",
   "message": "I had just finished grad school, gotten my first job as an adjunct professor, and moved to a new city with my partner. Had basically no money, but it was an exciting time. It *seemed* like I had my shit together on paper, but I assure you I did not. That took maybe another 10 years.",
   "created_utc": 1691946810,
   "score": 3,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0zsc8",
   "message": "26 was the absolute best year of my life, I was single but happy to be, had a great social life and was the most confident I’d ever been, finally found my ‘style’ and knew what kind of people I wanted to invest my time and energy in after years of being insecure and unsure of everything. Had a job I hated though and not a lot of money, that was the one area I was still really stuck on at that age. Man I wish I could go back 4 years to being 26 again! My life is very different now.",
   "created_utc": 1691947744,
   "score": 3,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw13r0j",
   "message": "I was at the edge of killing myself because of pain related to Crohn's Disease, penniless for the same reason, overall in deep depression.\n\nNow I am 43 and life couldn't be better. Happily married with 2 kids, earning enough to save for occasional vacations, have my own car, etc etc.\n\nI am glad that I am not 26 anymore, if that makes sense 😊",
   "created_utc": 1691949238,
   "score": 3,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw2p8kv",
   "message": "Man i really feel bad for y’all, but being 26 and reading these comments makes me feel thankful for where I’m at.",
   "created_utc": 1691972249,
   "score": 3,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0d3uh",
   "message": "I'd finally gotten my first really good job... and then came Covid",
   "created_utc": 1691938882,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0j1or",
   "message": "Probably in an abusive relationship. My past was shit. I have blocked most of my life out. But I have gotten help and am learning how to live as normally as possible.",
   "created_utc": 1691941269,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0l23b",
   "message": "Owned a house and was just married and moving up career wise.",
   "created_utc": 1691942062,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0m8l5",
   "message": "Married, had first kid, aged 1, stay at home Mum, first time off work since I was 16, days spent often falling asleep to Teletubbies, as I soon learnt, nap whenever they do!",
   "created_utc": 1691942524,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0rji7",
   "message": "Dead end job after college, just started dating some chick- 30 years later, married to the chick, financially secure and fighting with Redditors because I’m a capitalist and conservative",
   "created_utc": 1691944575,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0tut8",
   "message": "Depends what time of day. Either getting ready for work, working or coming home from work. There may of been some sleep in there, don't quite remember.",
   "created_utc": 1691945481,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0u05n",
   "message": "Drinking and partying and camping with my friends as often as possible.  The good ol' days",
   "created_utc": 1691945537,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0u4q9",
   "message": "Married with two kids and working as a general manager for a national furniture company.",
   "created_utc": 1691945585,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0ug7i",
   "message": "i was a new mom",
   "created_utc": 1691945705,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0uxn1",
   "message": "Teaching and a year before meeting the love of my life.",
   "created_utc": 1691945890,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0v1yw",
   "message": "I was in my second year of teaching. Just trying to find my groove as a teacher and functioning adult.",
   "created_utc": 1691945937,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0v5up",
   "message": "Living with my mom, unemployed and depressed. I somehow managed to join a kickboxing school and it really helped turn my life around.",
   "created_utc": 1691945977,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0vut5",
   "message": "This is right before my life turned for the better honestly. That Saturn return did some shit. I think then I was licking my wounds after a catastrophic move across the country to date some guy (I know, shockingly that turned out poorly) and right before I got on the correct path careerwise and met my long-term partner",
   "created_utc": 1691946245,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0vvh4",
   "message": "At 26 I was drinking and doing drugs and partying with friends as much as possible. I was also in the first couple of years of a 13-year woodworking career.\n\nToday, I'm a 60-year-old programmer.",
   "created_utc": 1691946252,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0w0cy",
   "message": "Just started another shitty hourly minimum wage job, but luckily, this one eventually lead to me joining a company with great security, benefits, pension, and above average salary.",
   "created_utc": 1691946305,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0w164",
   "message": "I'd just finished an awesome course and managed to make some terrible career choices. Turned out okay in the end.",
   "created_utc": 1691946313,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0w5h7",
   "message": "38 now. I was working a dead end job, not being that happy with my life. Now I'm a nurse of 7 years, married to a great woman and have two wonderful kids. Man life can change alot it seems.",
   "created_utc": 1691946359,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0wyy7",
   "message": "Owned my own home, just got married and lost a bunch of grandparents in the past year, and was settling into a new job in what would turn out to be a 15 year career.  \n\nI had a little debt, a decent paying job with benefits and a good pension, and life was good.\n\nI partied like it was 1999.",
   "created_utc": 1691946669,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0ykjl",
   "message": "I had just met my future wife and had a great group of friends.  Probably the best single year of my life so far.",
   "created_utc": 1691947282,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0yyqg",
   "message": "I'll let you know when I reach 26",
   "created_utc": 1691947431,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0zb02",
   "message": "Just starting my first real job after college. Met my future wife in a bookstore at the mall. :)",
   "created_utc": 1691947560,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0zg4s",
   "message": "Starting to get my shits together in fact",
   "created_utc": 1691947615,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0zm8q",
   "message": "Unemployed and pregnant.... things got much better.",
   "created_utc": 1691947680,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0zv9b",
   "message": "Commenting on a post on r/askreddit",
   "created_utc": 1691947774,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1154p",
   "message": "4 years into career at a massive company, this would have been like 2009. Making like $75k a year at that point. Live in a townhouse.  I was super depressed and gaining weight rapidly. Don't know for sure, was probably 350-380 then? Coming to realization \"this is what adult life is like\" was hitting me like a ton of bricks. I worked, ate, watched tv, played video games, and internetted.",
   "created_utc": 1691948247,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw11rjl",
   "message": "Out of grad school, somehow bought and moved into a upper middle class house with a pool, making decent money, met and started dating a woman who I’d later marry and have a child with.\n\nIt wasn’t all wine and roses up to that point, and certainly not since. But I’ve been luckier than most.",
   "created_utc": 1691948481,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw11wbe",
   "message": "I still had a full head of hair.",
   "created_utc": 1691948530,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw122ov",
   "message": "Living my life, have decent job for my self, helps mom. And i ruined it by marriage..",
   "created_utc": 1691948597,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw14b24",
   "message": "Now that I'm this age, my life changed a lot since I hurt my back last year. \n\nHere's some advice: be careful lifting heavy things.",
   "created_utc": 1691949454,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw14rdq",
   "message": "19 years ago…….Recently gotten out of a potentially abusive relationship, in my first place without roommates and enjoying my $386/month rent. Im happy with my life now but I do miss that studio apt sometimes.",
   "created_utc": 1691949629,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw14uxy",
   "message": "Coming back from UK to France after a tough break up",
   "created_utc": 1691949667,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw153dy",
   "message": "I was 1.5 years into my 1st long term relationship. I was very immature, still had a lot to learn.",
   "created_utc": 1691949758,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw153wg",
   "message": "Trying to get 3600 hours experience in architecture to get licenced in Canada.",
   "created_utc": 1691949763,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw15brw",
   "message": "High on weed but also 2 years into my second healthcare job, working towards my first diploma in health and social care",
   "created_utc": 1691949848,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw15lbu",
   "message": "Managed a small coffee shop, attended a LOT of concerts and dated a girl way hotter than I had any right to🤣🤣",
   "created_utc": 1691949951,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw15ugd",
   "message": "Recently completed my military service obligation (ROTC scholarship), starting a new job, married two years, no kids, and first time homeowner.  Good times!",
   "created_utc": 1691950049,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw161yt",
   "message": "Working as a CNA in a small town critical access hospital, engaged/married (I got married 5 months after I turned 26) to who the person who I still believe is my soulmate, moving into my very first apartment after living with my parents for so long.\n\nI still had both of my natural eyes (I have an artificial eye now ☹️), no hole in the hard palate in the roof of my mouth, no tongue weakness. Life was good at 26. My wedding was beautiful, and I was getting ready to start my family.",
   "created_utc": 1691950130,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw16cgw",
   "message": "Realizing my degree was less than worthless and construction was an OK career path",
   "created_utc": 1691950243,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw16x1v",
   "message": "No job, about to meet my now husband of 10 years and father of my son, confused on what to do with my life after getting out of 26 years of abuse and wandering.",
   "created_utc": 1691950466,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw16yb9",
   "message": "In a job i hated, lol",
   "created_utc": 1691950480,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw175b0",
   "message": "Starting University for the 3rd time.",
   "created_utc": 1691950554,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw17fms",
   "message": "I had just been fired from my job about a week before my birthday.",
   "created_utc": 1691950666,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw17g6u",
   "message": "Commercial fishing for the summer, then going to Mexico and chilling in a beach village for winter. Hard working slacker.",
   "created_utc": 1691950672,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw17nxh",
   "message": "Just graduated college with my whole life ahead of me. Ready to move half way across the country to begin my career while mending my broken relationship with my family. I probably shouldn’t have tried that last one",
   "created_utc": 1691950757,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw17qyg",
   "message": "26 was perhaps the most important year of my life.\n\nI moved to another state, 500 miles from my home town, for a big promotion at work.  And about six months later, I met my wife.\n\nI'm now 45 and we're happily married and still live in the area.\n\nAlso got my first cell phone that year, and joined a gym for the first time.",
   "created_utc": 1691950790,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw18b9k",
   "message": "2001, I remember that was a pretty uneventful year, I was living with a girl and that didn't last very long. I dumped her, I don't remember why, and went on.",
   "created_utc": 1691951010,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw18nb9",
   "message": "Paying off several thousands in debt that I accumulated over the previous several years (which I was successful in paying off), was in my first and so far only relationship which had gotten not so great in the latter half of the year, and had one of the worst months of my life in November of that year. So a mix of good (paying off debt, healthy part of the relationship) and bad (horrible November, relationship becoming emotionally draining).",
   "created_utc": 1691951142,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw19742",
   "message": "Fun game. I'm here for it.\n\nOkay, so age 26, I was working my first full time job for an agency, doing warehouse work. The pay wasn't great, and it was agency work, so if you had a single sick day, you'd be sacked.\n\nI still lived at home with my parents, paying a modest rent and helping to look after my disabled mother.\n\nAs my job was 4pm to midnight, my sleeping pattern was thrown to shit and I'd regularly crash in bed at 4am, wake around 8am, go take my nephew into school, come back home and sleep for a few more hours, then get up. Get ready for work, pick my nephew up from school and then go straight to work.\n\nWeekends were sweet though. Sleep in until noon, xbox and eat until dark hours and then either go out socialising or xboxing until Monday.\n\nNot gonna lie it actually sucked",
   "created_utc": 1691951356,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1bgsd",
   "message": "Just got evicted from my house after my gf told me our 3 year old son wasn't mine. She even showed me the DNA test, that she got when he was born with his real father.  \nBecame homeless, quit working (I was self employed), drank a lot.  \n26 was rough...",
   "created_utc": 1691952232,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1blk0",
   "message": "Getting my PhD, slowly drinking myself to death",
   "created_utc": 1691952282,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1eabb",
   "message": "Attempting suicide at 6 am after returning from a party",
   "created_utc": 1691953319,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1extl",
   "message": "In 2020's lockdown, buying a house for myself, accepting the job that would speed up my career and having a really short relationship that got even shorter thanks to italy's lockdown and that almost sent me back in the previous years' depression.\nA lot of changes during that year, but I came out as a winner in all of them.",
   "created_utc": 1691953572,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1gqz8",
   "message": "Alive somewhere hopefully.",
   "created_utc": 1691954273,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1h8zn",
   "message": "Killing myself with work just to get by and fighting my mental health every second of everyday",
   "created_utc": 1691954465,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1hsxw",
   "message": "Unemployed, depressed, lost and no self love what so ever. I was married though and her love was the one thing that kept me from ending myself.",
   "created_utc": 1691954679,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1i3u5",
   "message": "Staring at the TV screen watching 9/11 unfold while getting ready for work.",
   "created_utc": 1691954796,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1ialj",
   "message": "Starting grad school for architecture and raft guiding in the summer. My life was a see-saw. \n\nMy school year was spent in a very intense professional program, having multiple late nights per week, no social life, and tons of deadlines.\n\nMy summer was spent being a dirtbag river rat living in a tent on a campground with 40 friends. Taking tourists rafting everyday and partying with friends every night.\n\nGood times but I was burning the candle at both ends.",
   "created_utc": 1691954870,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1ilyu",
   "message": "Wrestling around the world,\nLiving day by day, \nNo real job,\n\nHow times have changed",
   "created_utc": 1691954996,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw295z0",
   "message": "I think fucking my coworker while at work, on the clock.",
   "created_utc": 1691965362,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0azf5",
   "message": "Just finished college and had my first kid. Was in shitty two bedroom apartment trying to make it work.",
   "created_utc": 1691938013,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0f40x",
   "message": "Graduated with a two year tech degree, in a field I ultimately worked in less than a year (US manufacturing tanking during the 2008 recession). By 2010 I had found a job working in what I’ve always been naturally good at - software.  I had just bought my first new car ever, a very basic (but new) VW Golf diesel.",
   "created_utc": 1691939691,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0kgvh",
   "message": "I’m 26 now, and trying to figure out my own small business, working a contract for another job I’ve been at 7 years, and going to trade school to be in construction management. Mix in alcohol and drugs and that’s where I’m at. Let’s see where everyone else was. I also live with family (in an albeit very nice home away from everyone else in my own area) and don’t pay for almost anything. Do work for all my monthly fees to my family.",
   "created_utc": 1691941830,
   "score": 2,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1es8z",
   "message": "Iraq",
   "created_utc": 1691953513,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0awbe",
   "message": "I was possibly handing out fliers for one of our club nights , partying with celebs , or doing a concert putting on a show with an artist .",
   "created_utc": 1691937977,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0cw8c",
   "message": "Assuming you are older, at the age of 26, I was juggling a cheese-lover existential crisis, hoping not to trip into a galaxy-sized daydream while crammed between milestones and possibilities.",
   "created_utc": 1691938796,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0dkg5",
   "message": "Working as a Royal Navy nurse (QARNNS), bought my first house, owned a car.",
   "created_utc": 1691939067,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0iwap",
   "message": "Finished 6 years in the Navy on Subs, was in University working on a BS in Astrophysics",
   "created_utc": 1691941209,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0mmvz",
   "message": "I'm going to school at night to get out of the sawmill.",
   "created_utc": 1691942677,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0ouzj",
   "message": "Airport, how about you?",
   "created_utc": 1691943537,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0ov44",
   "message": "At this time of year when I was 26(well, going to be 26 in December), I had a not quite 4 yr old and a 3 week old, living in my in-laws house and basically being their housekeeper and cook while my husband finished up his degree. This was actually the only occasion that I didn't clean the house completely while they were on vacation. I figured that since they ledt me alone with 4 yr old and newborn while recovering from a c-section that they could clean their own damn house for once!",
   "created_utc": 1691943539,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0qf8h",
   "message": "Working, smoking weed, doing speed and coke with alot of alcohol. Alot of videogames",
   "created_utc": 1691944140,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0qggh",
   "message": "Married for about a year, 8 year old daughter and a 6 year old son. Different job at the same company and struggling like hell",
   "created_utc": 1691944153,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0qt8o",
   "message": "at age 26 I was self employed and had bought my first apartement a year before.\n\nYeah, times change ...",
   "created_utc": 1691944290,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0quxc",
   "message": "Freshly married, graduated college (BaS, not yet my Master’s) and working full-time.",
   "created_utc": 1691944307,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0r1nk",
   "message": "11 years ago we were at the best point in our lives we've ever been.. constantly kept at least $5k cash in the safe with more always coming in daily..\n\nThen Twitter sued my partner and he freaked out and shut down the software I was using and selling and teaching people how to use. Smfh he wasn't even in their jurisdiction he could have kept it running.",
   "created_utc": 1691944381,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0r26s",
   "message": "Playing counter strike tournaments",
   "created_utc": 1691944387,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0rizf",
   "message": "Homeless",
   "created_utc": 1691944570,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0s6gi",
   "message": "I think I had a couple of years experience in my current profession at the time.  Was married and living in an apartment in California.",
   "created_utc": 1691944825,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0s6hx",
   "message": "Just got married and bought our first home together and my wife was 21",
   "created_utc": 1691944826,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0sx8y",
   "message": "Kremmling then Buffalo Grove",
   "created_utc": 1691945120,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0t02b",
   "message": "Since I’m younger I’ll imagine what I’ll be I imagine I’ll own my own welding shop. I’ll stop crying about money and stop bullshitting myself out of opportunities.",
   "created_utc": 1691945151,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0t94k",
   "message": "Working as a kitchen manager living paycheck to paycheck with no work life balance.\n\nNow I have a kid, sell cars for a living, make $100000/year, and still have no work life balance.\n\nSome things never change…",
   "created_utc": 1691945250,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0tumq",
   "message": "College.",
   "created_utc": 1691945479,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0uwr9",
   "message": "I was a single mom with a 2yo in the middle of a nasty custody battle while juggling three jobs (1 FT, 2 PT) to just stay afloat as we were barely recovering from recession. I don't know how I survived but I have a 15yo well rounded sweet child now so I suppose it was worth it. 🥰",
   "created_utc": 1691945880,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0vfhe",
   "message": "Owned a home. Married.  Just had a baby.  Working full time.  Had a few pets.",
   "created_utc": 1691946080,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0x30p",
   "message": "Just standing around looking stoopid..",
   "created_utc": 1691946712,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0x7wa",
   "message": "Having kids.  Mid level career progression",
   "created_utc": 1691946764,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0xf16",
   "message": "A retail worker, facing the end of a relationship that would last another 3 years. Never going back to that!",
   "created_utc": 1691946839,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0xy9j",
   "message": "Finishing my MA, working a boring job and realizing I need to get a grip on myself since I was closer to 30 than 20.",
   "created_utc": 1691947044,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0y66v",
   "message": "During the pandemic, drinking and chilling away and preferred only vaccinated people",
   "created_utc": 1691947128,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0ywkh",
   "message": "Delivering pianos in the desert and living paycheck to paycheck",
   "created_utc": 1691947408,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0z9z9",
   "message": "I was in my second year of having my own classroom. I taught middle school. I had two sons and a one year old baby girl. Lived in a new two-story home with my X-husband.",
   "created_utc": 1691947550,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0zct2",
   "message": "Just married for a year with a baby boy...good times.",
   "created_utc": 1691947579,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw0zt4u",
   "message": "Pregnant, lost job, husband was commuting with a group of guys 75 miles each way to work, then the other guys got laid off. Wasn't feasible to do that on his own, started looking local. Living in a house that had to be wrapped in plastic in the winter so the water didn't freeze, it had just been remodeled...the outhouse was still in the side yard. Never been wired for a telephone, my weekly \"outing\" was to get laundry done. Whole area was poor so husbands shared what they got hunting or fishing. I learned how they made bread pudding out of leftover stale biscuits. It wasn't the hardest time I ever lived through but it was a touch scary",
   "created_utc": 1691947752,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1077j",
   "message": "Covid-19, just started a new job which I fell into (was lucky to work through this) and is my new career which I love, dad passed away unexpectedly from covid-19, me and housemate got thrown out our flat after a disagreement with another house mate (we both just lost parents and things were hard) and I’d just had a guy break things off with me. I’m shocked at how crazy a year 26 was for me reading that back.",
   "created_utc": 1691947897,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw10sd3",
   "message": "In the US Navy, serving overseas, blowing many of my straight friends. Loved the Navy 😊",
   "created_utc": 1691948117,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw11y41",
   "message": "Leaving a job running operations at a weekly newspaper and working a summer job on a movie set which let to a long career. Also had given up on finding a relationship-- but met my wife of 33 years a year after that!",
   "created_utc": 1691948549,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1267k",
   "message": "I’d been married for five years, owned a home and just had my first child.  Sounds so boomer but didn’t end up that way.",
   "created_utc": 1691948634,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw12wzh",
   "message": "I was 26/27 for at least 3 years good times",
   "created_utc": 1691948919,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw12zt3",
   "message": "I was happily married, worked as a lineman and generally things were pretty good.  two years later we had our first child - still good, four years away from being downsized.  Took the time to get a degree after that and now looking at retirement after 30 years in IT.   It’s been a ride",
   "created_utc": 1691948950,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw13whv",
   "message": "Shaking off the crazies and easing into a career.",
   "created_utc": 1691949298,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw154m2",
   "message": "Graduated law school and working in a prosecutor’s office/about to go back to school for a masters of law.",
   "created_utc": 1691949771,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw156h3",
   "message": "At 26 was managing 5 kitchens for large commercial catering firm, it however didnt tank the covid crash. Ended up in a psych facility with hardly any memories ptsd and recovering",
   "created_utc": 1691949791,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw166vy",
   "message": "Smoking.",
   "created_utc": 1691950183,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw16uio",
   "message": "Starting a dialup ISP with a friend. We were doing $8 million in sales when I sold my shares and moved abroad shortly thereafter.",
   "created_utc": 1691950439,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw16xpv",
   "message": "I was in the midst of my radio copywriting career and getting by living out the last years of my unbridled early adult years. I was on the cusp of tumultuous times and bigger life-changing things",
   "created_utc": 1691950474,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw17pwj",
   "message": "Younger",
   "created_utc": 1691950779,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw182rv",
   "message": "Probably dead",
   "created_utc": 1691950917,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw18m0k",
   "message": "With an 8 month old seeing life altering shit in my ex’s fb messages. Took another 7 years to leave.",
   "created_utc": 1691951128,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw18pfj",
   "message": "Not a father, contemplating suicide, drunk pretty much every day, working a job that made me feel like less than dirt.",
   "created_utc": 1691951165,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw18sd6",
   "message": "Working my ass off at a job that was, frankly, dead end. I had already figured out that I needed to find a job with a career path and was already starting to feel my way through matters.",
   "created_utc": 1691951196,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw18w4f",
   "message": "Lots and lots of sex.",
   "created_utc": 1691951237,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw18xlt",
   "message": "I had just gotten my first promotion at work after getting my CPA license. Finished paying off my student loans (tbf I only had $10K, unlike most people I knew who had well over $50K) and had started saving for my down payment. Married, cats, and for the first time in my life,  a really solid friend group. 26 was the first time in my life I felt I could succeed and be happy in life.",
   "created_utc": 1691951253,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw18ycx",
   "message": "Burned out from my first management job, quit and travelled Europe for 5 months.",
   "created_utc": 1691951262,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1959i",
   "message": "Way behind the curve.  Alone, financially pathetic and an alcoholic.",
   "created_utc": 1691951336,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw19875",
   "message": "I'm almost 101",
   "created_utc": 1691951368,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw19ms3",
   "message": "Married for 3 years. Bought my first house. Raising my 2 year daughter. Finishing my last year in college. Working as janitor at a k through 8 school. Coding game tools to make a game for c64.",
   "created_utc": 1691951525,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1a9ii",
   "message": "Married for 2 years, working retail, taking skateboarding photos for magazines, and just about to get into rock climbing. \n\nI'm 43, and wish I would have pursued a career at that time. I became an electrical apprentice at 35, and work for my provincial utility company now. Still married, and we have an 11yo daughter.\n\nHow old are you, and where are you at in your life?",
   "created_utc": 1691951770,
   "score": 1,
   "submission_id": "15q0oos"
  },
  {
   "comment_id": "jw1cwa3",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15q0oos"
  }
 ]
}