{
 "submission_id": "15q3ckm",
 "title": "What's the worst financial decision you've seen someone make?",
 "selftext": "",
 "created_utc": 1691944261,
 "permalink": "/r/AskReddit/comments/15q3ckm/whats_the_worst_financial_decision_youve_seen/",
 "score": 237,
 "url": "https://www.reddit.com/r/AskReddit/comments/15q3ckm/whats_the_worst_financial_decision_youve_seen/",
 "comments": [
  {
   "comment_id": "jw1iaj3",
   "message": "A guy in my fraternity got 30k for an undisclosed reason, I’m guessing a family death or something and he bet it all on the Yankees winning one game. They lost",
   "created_utc": 1691954870,
   "score": 112,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1e9dp",
   "message": "Put everything in his gf's name to hide assets as he owed the IRS, the gf sold his business, cashed out his accounts and ran.",
   "created_utc": 1691953309,
   "score": 159,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1uz1i",
   "message": "A friend of mine who is very bad with money and his girlfriend bought some sort of water filtration system from a door to door salesman. He has to pay something like $300/month for this filtration system. He was all stoked because it came with a free set of pots and pans.\n\nFast forward a year and his girlfriend has broken up with him, moved out of the house, and he's had to sell his home because he can't afford to live there. The water filtration system is now sitting in a storage unit where he still pays $300/month for it because he's on a 2 or 3 year contract (sorry the details are fuzzy).\n\nWe have great water quality in my area.",
   "created_utc": 1691959726,
   "score": 147,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1vnt7",
   "message": "A dude who owned a small convenience store in our town spent like $20,000 on fidget spinners. He was posting for like a year begging people to buy them as he would lose his business and his marriage was falling apart due to it.",
   "created_utc": 1691959987,
   "score": 205,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1emiw",
   "message": "My supervisor took out a loan against their 401k to pay their rent because \"their credit cards were maxed.\" Two weeks later, they bought a brand new 60k Lincoln with basically nothing down because \"her daughter just had a baby and I need a bigger car for that.\"",
   "created_utc": 1691953451,
   "score": 237,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw0y659",
   "message": "Apply for a 5k loan, didn’t accept quick enough so applied for another 5k loan, both got accepted and ended up gambling it all",
   "created_utc": 1691947128,
   "score": 122,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw18ebs",
   "message": "My brother's ex fell for a Craig's list scam. She found a motorcycle and the guy \"needed money up front to pay bills\" before she even saw it. We told her don't do it, it's a scam. She said she already sent $1000. Of course, he was never available to show her the bike and we found out from my brother after they broke up she actually continued sending him money in hopes of getting the motorcycle. I think she was out $3,000 by the end.",
   "created_utc": 1691951044,
   "score": 135,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1kotm",
   "message": "[deleted]",
   "created_utc": 1691955803,
   "score": 167,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1ll0h",
   "message": "A coworker I used to have worked every second of overtime he could for several years to save up for a house. When he applied for the house loan, he based his mortgage payment on all of the overtime he had been working. I tried to tell him that wasn't a good idea but he didn't want to hear it. He ended up divorced a few years later because his wife got tired of him always working.",
   "created_utc": 1691956146,
   "score": 253,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1jj2v",
   "message": "Ran up credit card debt requiring bankruptcy. Once they were able to build credit again (7 years later) they proceeded to run up a massive amount of debt again, but couldn’t go bankrupt again, so they used “debt consolidation.” \n\nThe debt didn’t come from sudden expenses. They just needed to buy things to feel better.",
   "created_utc": 1691955352,
   "score": 249,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1kokv",
   "message": "My (awful) aunt was the trustee for my grandparents' estate. When they passed, she decided to sell their house to a random realtor who put a leaflet on the door. TO the realtor, not WITH the realtor. It wasn't put on the market, and the aunt rejected a matching offer by me after I argued hard to actually list the house and have people bid on it. \n\nThe realtor slapped a new coat of paint on it and sold it a couple of months later for literally a million dollars more than she bought it for.",
   "created_utc": 1691955800,
   "score": 178,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw199qi",
   "message": "My former sister-in-law had a thriving medical practice. She got so stressed that she joined the Scientologist and started taking their classes. She opened up five-six credit cards without telling my brother, maxed the cards out with hundreds of thousands in cash withdrawals, and gave it to that cult.",
   "created_utc": 1691951385,
   "score": 93,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1mugk",
   "message": "My cousin spent 100% of her inheritance and took out a lien on her home to buy a 2nd home in the mountains... thing is it was being pushed over by a mountain...and they thought they could fix it... I went and seen it and every door jam was crooked and the doors wouldn't shut.. They took me down into the basement and they were trying to use I beams to \"stop the mountain from pushing on the home\". I was just like \"what the hell are you doing, that won't solve anything\" fast forward 6 months and they asked me for 50k to help and I declined. Fast forward a year and the home collapsed and now they owe over 300k+ for a home that doesn't exist and if they don't make the payments they lose their other house too because they used the original home as collateral and could not get insurance on the 2nd home..total money lost upwards of 700k",
   "created_utc": 1691956620,
   "score": 43,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw19apn",
   "message": "A guy I dated for a short time had been joining a MLM scheme selling insurances.\nI listened to his monologue and told him I had no money. He was furios and tried to sell insurance to our waiter at the restaurant. He failed again. I'm still laughing today, he was no good guy.",
   "created_utc": 1691951395,
   "score": 221,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1n7cy",
   "message": "Worked with a 50 year old guy who looked like the arse end of a Rhino and hated anyone not from England who sent £10k to his fiancé in Thailand he’d never met for a boob job, clothes and flight over ….. oddly enough her naked pics and promises of anal when she visited stopped once the money had been sent",
   "created_utc": 1691956757,
   "score": 53,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1amgq",
   "message": "I bought a hellcat when my old badass challenger was paid off",
   "created_utc": 1691951908,
   "score": 240,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1kvme",
   "message": "Knew someone who answered those scam emails thinking they would get rich. Last I heard, he lost around $50k. Emptied out savings account and maxed out credit cards. Left in debt and had to move back with ailing parents. \n\nNot a close to them at all but more like a friend of a friend of a friend's cousin. Motherfucker just **WOULD NOT** listen. Genuinely thought he was going to be a millionaire. They kept stringing him along until the bitter end and then...poof. Biggest concern his friends had was him trying to milk his ailing parents for their last nickel and dime. Fortunately, he wised up and knew he been had. The last I heard of him was he had an hourly job somewhere and trying to get out of debt.",
   "created_utc": 1691955875,
   "score": 36,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1lb9q",
   "message": "Cashed in their 401k to have a cocaine party.",
   "created_utc": 1691956041,
   "score": 228,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1nhbe",
   "message": "My friend bought a used Hellcat Challenger yesterday at 10.5% APR and $380/mo insurance. \n\nHe lives in my other friend’s spare room.",
   "created_utc": 1691956862,
   "score": 5,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1h1bn",
   "message": "My brother and his wife were in massive debt, didn’t work high paying jobs and could no longer afford their two bedroom apartment while trying to pay off the debt. They moved back home, into our parents basement. A week before they moved in, they built a computer, and a year after that, they consciously decided to get try to get pregnant (which they did) while still living in the basement and knowing they haven’t improved their financial state whatsoever.",
   "created_utc": 1691954384,
   "score": 224,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1lrej",
   "message": "*EXTRAVAGANT* weddings that end in divorce a year later",
   "created_utc": 1691956213,
   "score": 244,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1nmau",
   "message": "My maternal grandmother bought an 8-plex to avoid capital gains when she sold her large house.  The apartment complex was in the red and needed a lot of repairs. She hired my father to do them and be on-site manager. The place started making money. My mom (divorced from my dad) was mad that my grandma bought it in the first place, then hired my dad, then was proved wrong because it was making money. My grandma was in her 90s and my mom pressured her for years so my grandma finally sold it. That place is in a high market area and is now worth millions. My mom made a poor financial decision based on petty spite.",
   "created_utc": 1691956916,
   "score": 73,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1i7lt",
   "message": "[removed]",
   "created_utc": 1691954837,
   "score": 13,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1czvz",
   "message": "My coworker has 25k in anime figurines. He is in mega debt right now.",
   "created_utc": 1691952819,
   "score": 104,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw16zv9",
   "message": "They got married to someone heavily in-debt. The person kept their financial situation from them until after they were married.",
   "created_utc": 1691950496,
   "score": 170,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1mt94",
   "message": "They won thousands of dollars and bought a new entertainment system instead of getting current on their mortgage. Foreclosed on later that year. The thing was, the area had recently become the new **it** area for young families, and housing prices had skyrocketed. They easily could have just sold the house, paid cash for a larger house 20 minutes up the road, and still had tens of thousands leftover.",
   "created_utc": 1691956607,
   "score": 156,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1d90b",
   "message": "My dad had his own company and someone told him it made financial sense that instead of paying himself wages, he should take out a loan from his company. He built up debt for three years, while working full time, rather than paying himself. It had all sorts of bad tax effects. Like he was required to pay interest on this, which was then taxed as profit of the company, then he paid himself again paying income taxes. It took him about ten years to get out of that hole. \n\nThen he needed to sell his house because it was too expensive. But the buyer got cold feet on the last day before the sale. Rather than having the buyer pay 10% of the price to get out of the sale he gave him an extension without an end date. The buyer then took 2 years to think about whether he wanted the house. All the while my parents needed to keep paying the mortgage and couldn't sell the house to anyone else because of the contract they had with that guy. Brought them close to bankruptcy. I've personally paid a couple of hundred a month to let them pay for the mortgage during that time.",
   "created_utc": 1691952916,
   "score": 243,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw0rr7f",
   "message": "They took out a small title loan and lost a 15k car in the process.",
   "created_utc": 1691944660,
   "score": 201,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1t96w",
   "message": "Had a co worker with 5 kids who could all go to USC for free once he has worked there for 15 years (even if he quit). He quit at 14.5 years for a job that barely paid more than he made at USC. Cost all 5 kids a free education at a top school since he couldnt wait 6 more months.",
   "created_utc": 1691959064,
   "score": 255,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1febk",
   "message": "I knew someone who got a loan for their wedding, but decided to blow it all at a casino.  Now they have a loan for 20k to pay off and nothing to show for it.",
   "created_utc": 1691953748,
   "score": 93,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw11anr",
   "message": "21yo living in Dad's basement paycheck to paycheck went to a reptile exhibit and brought home two exotic frogs and a snake [because they didn't have enough money for a bearded dragon]",
   "created_utc": 1691948303,
   "score": 22,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw0r63c",
   "message": "Someone took a loan to order a pizza.",
   "created_utc": 1691944429,
   "score": 179,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1m5gc",
   "message": "My roommate buys doordash almost every day.  They’ll maybe cook for themselves once or twice a week but other than that they order food in 5-6 times a week.  I know how much they make and I have not a clue how they can afford that",
   "created_utc": 1691956352,
   "score": 219,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1jws8",
   "message": "When I was 19, I went to Miami with some friends on cinco de mayo. We got insanely drunk and went bar hopping across the city. The next morning I looked at my transactions and realized I had spent over a grand.",
   "created_utc": 1691955500,
   "score": 116,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1o8x5",
   "message": "Anyone enlisted in the military buying a charger or mustang at astronomical interest rates.  That shit is predatory and should be illegal in all 50 states.",
   "created_utc": 1691957157,
   "score": 137,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1j3k1",
   "message": "When someone is struggling financially, they inevitably believe the solution is to get an auto loan. On a related note- anyone who buys a car from Drivetime.",
   "created_utc": 1691955188,
   "score": 161,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1jc18",
   "message": "Getting remarried. He was convinced the first wife was the problem. She was, in part, but so was he. Zero self awareness. He’s getting sent to the cleaners yet again.",
   "created_utc": 1691955278,
   "score": 27,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1nm6h",
   "message": "I knew a guy who was terrible with money. Worked in a warehouse but spent all his money on drugs and things for his controlling girlfriend. \nThen one day he came to me to show me his brand new car. Probably around $40-50k.\n\nHe takes me for a ride and starts bragging about how he took his pay stub to like 10 of those cash advance places and get $10k worth of loans and, \"had been living like a king.\" It was as if he thought he found some sort of life hack. To this day I'm not sure if he just thought he wouldn't have to pay it back or what.\n\nA couple weeks later I learned he wasn't paying attention while driving and rear-ended a bus going way over the speed limit and totalled the car.\nTrainwreck of a guy.",
   "created_utc": 1691956915,
   "score": 48,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw18d6q",
   "message": "Timeshare",
   "created_utc": 1691951032,
   "score": 227,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw0s91x",
   "message": "Buying a TV on Black Friday instead of fixing their leaking roof",
   "created_utc": 1691944854,
   "score": 242,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1q4e3",
   "message": "Neighbors.  The bread earner died.  Her sister and her daughter were left with the place.  They could not afford the payments.  They would NOT sell.  They let it go to foreclosure even though it had about $120,000 equity in it.  New owners came in....did very little cosmetic work, just a little paint and fixed the fence.  They sold it and made a $200k profit in about  6 months..",
   "created_utc": 1691957867,
   "score": 166,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1uev0",
   "message": "Friend spent $50k+ on twitch donations because he went through a hard time and was looking for acceptance. Really messed his finances up for a long time. :(\n\nEdit: the money was all on credit cards.",
   "created_utc": 1691959512,
   "score": 152,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1g80e",
   "message": "So many MLMs... so many... and they never listen. It's like some kind of wall goes up. A coworker got fired, destroyed his marriage, while trying to \"make it\" as some MLM stooge. To give you an idea how bad it was, it was for long distance cards to hispanic countries in an era when cell phones were taking off and long distance as a concept was evaporating. He lost tens of thousands.",
   "created_utc": 1691954068,
   "score": 234,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1kefp",
   "message": "My dad sold his car to someone so he could buy more crack while on a bender.\n\nEdit: wording/grammar",
   "created_utc": 1691955693,
   "score": 41,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw0qv4q",
   "message": "Purchase NFT’s",
   "created_utc": 1691944310,
   "score": 119,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw12dz9",
   "message": "I met a girl who get pregnant 2 times before finishing highschool.",
   "created_utc": 1691948717,
   "score": 131,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1lout",
   "message": "I bought a yeti soft cooler",
   "created_utc": 1691956187,
   "score": 204,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw269kh",
   "message": "My sister's husband reached out to me on some investing advice \"to make some quick cash\" during the pandemic when they had access to some extra income ontop of a inheritance lump sum they came into. \n\n\nTold him over and over that investing should not be looked at as some kind a get rich quick scheme, and that any avenue that had that sort of potential had an greater chance of causing you to lose it all.  Instead look at it as a way to gradually build wealth over time.  Explicitly told him that the market is going to be volatile due to the pandemic and no one having any clue what that would mean for the markets.  Went over the basics and recommended a split of some Vanguard index funds VTSAX/VTIAX.  I also covered the concept of riding the ups and downs and that by consistently investing you will buy at highs and lows which will even out over the long run towards steady growth. Reminded him multiple times that you do not lose ANYTHING in the market until the second you sell and the difference between taxes associated with long vs short term capital gains. Most importantly I made sure to remind him that this is a gamble and that there is always risk involved and to NEVER invest something you cannot afford to lose. \n\n\nWhat does he do?  He dumps 35k (they're not wealthy at all) into the market and then pulls it out 4 months later the first time the market took a dive.  My sister then gets pissed at me for telling him to do all of this...",
   "created_utc": 1691964196,
   "score": 138,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1hn7i",
   "message": "Buying a pure-bred puppy while on a low-wage job with the end of your contract in sight. While also being a single-parent in a rented apartment. Yeah, within a year she was on food stemps.",
   "created_utc": 1691954617,
   "score": 102,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw0yi7f",
   "message": "A guy I worked with found out that check cashing places were offering $15,000 no question asked loans. The interest rates were fucking insane! I begged him not to do it but he impulsively went on a lunch break and got $15,000 in cash and deposited it in his bank account.\n\nThis was 6 years ago, he is still struggling because of it. He lost his wife and kid because he drank every penny of it in a summer. He got eviction notices and the stress was too much to the point where he had a psychotic break which lasted for months. He is pushing 40, lives alone, can't see his child, hasn't had sex in a few years and is forgotten by most of his friends because he was delusional and hallucinating for months.",
   "created_utc": 1691947256,
   "score": 87,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1il2t",
   "message": "Retirement age person emptied out their 401(k) to open a pet store",
   "created_utc": 1691954986,
   "score": 208,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1lbt6",
   "message": "There was that post yesterday on   r/justrolledintotheshop where somebody sold an 07 hyundai sonata for scrap and then the next day asked the scrap yard  to give him back the $1300 custom floor mats he left in the car. That guy has to be making bad financial decisions left and right",
   "created_utc": 1691956047,
   "score": 175,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1p8rq",
   "message": "Someone makes the decision to have a baby to keep a relationship (they had neither a house nor job) \nTo have a baby isn't cheap...",
   "created_utc": 1691957536,
   "score": 163,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw17xrs",
   "message": "Someone at my work bought a brand new audi RS3! around 70-80k euro's. he got 40k from his grandma because she gave it to him for 'if' she is about to die, a small fortune to buy a house maybe but no. what he did was put another 30k from his own money to buy the car. the guy has no house and has no money left.",
   "created_utc": 1691950862,
   "score": 227,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1kgkv",
   "message": "My ex-husband paid $2500 for an online porn domain.  Never made a dime from it.   Oh, he also paid some fly-by-night company $1500 to help us try to improve our credit.  Then there was the $7000 to pay off his truck.  He then traded it in for a different truck and payment a month later when the truck he now owned started having mechanical issues.  There are a ton of reasons he is my ex.",
   "created_utc": 1691955716,
   "score": 80,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw2ljnt",
   "message": "I'm a vettech and  in the last month I've seen three different owners sell their old dog because they couldn't afford the medical bills... And a week later come back with:\n\n- Four Himalayan kittens (they couldn't decide so took all of them!).  \n\n  \n- Two husky/German Shepherd puppies (it was a great deal! The young man has no job, a new apartment, a dog he can't neuter and Two cats who he constantly walks in to say they have fleas, ask for home remedies and leave again)\n  \n- Two puppies for themself, one for her sister and one for her best friend! They look like bullies with skin allergies in their future.\n  \nThey all looked at me like I should squeal in delight at kittens and puppies, instead of breaking my heart for their old pet.",
   "created_utc": 1691970621,
   "score": 111,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1wnvw",
   "message": "Many decisions around new tattoos or dogs when they can't pay rent regularly.   My Aunt says the 'rich get richer and the poor get another dog.'  I find this to be true for some of my family.",
   "created_utc": 1691960367,
   "score": 192,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1yncn",
   "message": "This older lady worked part-time in my kitchen. It was a fine dining, fast paced environment.  She would only work about 20 hrs per week doing busy work u.e. peeling vegetables, washing produce, etc. Tasks I knew she could handle and wouldn't get overwhelmed. \n\nUnfortunately her husband passed away and she requested a few months off. I totally understood and said take all the time you need. Let me know when you feel comfortable coming back to work, if at all. Take care Barbara.\n\n8 months later she contacted me for a job. I was more than willing to have her back in my kitchen.  I nonchalantly asked her how she was coping with her loss. She broke down in tears. She apparently got a $500000 insurance payout from her husband's death. Within those i months she attempted to open a restaurant and sink every dime into the establishment.  It went out of business in 6 months.\n\nShe was now broke as an elderly lady having to go back to work.",
   "created_utc": 1691961146,
   "score": 207,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw0uipb",
   "message": "cheated on 7 years of back taxes ( got like 20k in returns ) then they were surprised they got audited, last I heard they moved away to try and run from it lol",
   "created_utc": 1691945732,
   "score": 223,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1p4un",
   "message": "It's not as bad as some on here, but a girl I work with broke her phone and simply took out a second contract and was paying both simultaneously",
   "created_utc": 1691957494,
   "score": 218,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw0rhxf",
   "message": "Cocaine.",
   "created_utc": 1691944558,
   "score": 186,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1o4st",
   "message": "Me , walking away from custom home I built for wife and I ( on mountains side facing pacific full unfiltered fulls views of ocean 1 mi away) distressed from the betrayal . Lost my job, lived off savings in depression.",
   "created_utc": 1691957114,
   "score": 81,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw0vvpd",
   "message": "Join a cult",
   "created_utc": 1691946255,
   "score": 126,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1utvj",
   "message": "I’ve seen people turn down raises because they didn’t understand how taxes worked",
   "created_utc": 1691959672,
   "score": 215,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1lm1c",
   "message": "Seen someone sell their house and take out a much bigger mortgage to buy a pub that had failed 4 times in 3 years.\n\nIt failed and they couldn't sell. \n\nIt bankrupted then and they lost everything",
   "created_utc": 1691956157,
   "score": 121,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw15zdr",
   "message": "Military dude married a girl 3 months after starting to hook up. He thought she had a good job because she liked expensive things. Turns out it was daddies money and cut her off when she married the dude. Dude went from kinda struggling to 70k in debt overnight. His wife was and massive bitch and refused to change her spending habits.",
   "created_utc": 1691950103,
   "score": 250,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw0y2p7",
   "message": "When I didn't buy Apple Stock in the 80's",
   "created_utc": 1691947091,
   "score": 53,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw2371s",
   "message": "Got out of the US Air Force with 19 years time in service to avoid getting a covid shot.\n\nFor those unaware, 20 years of service gets you a lifetime pension and health care benefits.",
   "created_utc": 1691962962,
   "score": 193,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1r026",
   "message": "Sending a televangelist money for a \"blessing\" and then not having enough to rent a moving truck. So I had to be the \"blessing\"",
   "created_utc": 1691958204,
   "score": 67,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw0qv6n",
   "message": "I bought a bmw.",
   "created_utc": 1691944310,
   "score": 48,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1m6wf",
   "message": "Going broke keeping up child support payments to a cheating ex for a child that is likely not his. He saved enough for a DNA test. Bought a new iPhone instead.  Will continue payments gor 18 years for a child he has never met, for a woman who never loved him.",
   "created_utc": 1691956368,
   "score": 206,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1rzve",
   "message": "Them: bought some meth *just to see what it's like*",
   "created_utc": 1691958587,
   "score": 116,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1zm14",
   "message": "I used to be a car sales guy, and I watched as someone traded in their 6 month old $95,000 pickup truck for $70,000 just to buy the exact same $95,000 truck. Literally, it was the same truck. The only difference was that the new truck had a gun safe. I told the guy we could install a gun safe for $2,000 it would  of been the exact same gun safe in the exact same place. Guy added an adational $20,000 in debt for a gunsafe. But hey I got to make a $95,000 sale.",
   "created_utc": 1691961526,
   "score": 156,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1di4v",
   "message": "Join an MLM",
   "created_utc": 1691953013,
   "score": 164,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw1juud",
   "message": "I used to run heavy equipment in Virginia. I made $13.50 an hour. A guy on my crew was making $12.50 an hour. He purchased a 5 bedroom 3 bath 2500 sqft home for $425k He was the sole income for the household of 6 people. They talked him into an interest-only loan.  6 months later the housing market crashed he lost his job and lost the house. I tried to explain to him that an interest-only loan was a scam and he didn't make enough to afford that house and 4 kids with a wife that didn't work. I felt bad the next time I saw him and he was living in an RV on someone's property.",
   "created_utc": 1691955479,
   "score": 92,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw2364z",
   "message": "I won't name any names, but a good friend who literally had it all; the high-rise apartment and a house down the street with a pool, sauna, Casita, Hummer, corvettes, a successful business, and about $400,000 in Bitcoin: threw it all away over a murder-for-hire, because him and his (non-related to any of the above successes, but from something about 10 years earlier before I knew him) got greedy, and no longer wanted to split their financial gain with a third person, so yeah. Hired someone on the dark web to carry out the crime across state lines, but communicated EVERYTHING over text. All three men(my friend, his business partner, and guy they hired) have been caught and convicted. One received life in prison, and my friend and his 'business partner' are up for the death penalty. \n\nAlso, he was only 35 when he was originally arrested.",
   "created_utc": 1691962951,
   "score": 74,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw2987i",
   "message": "Guy I knew convinced his girlfriend to invest six figures worth of apple stock that she’d had for many many years into cryptocurrency right before it all crashed. No, they are not together anymore",
   "created_utc": 1691965386,
   "score": 62,
   "submission_id": "15q3ckm"
  },
  {
   "comment_id": "jw2ilct",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15q3ckm"
  }
 ]
}