{
 "submission_id": "15q6o6w",
 "title": "Why did you leave your religion?",
 "selftext": "",
 "created_utc": 1691952170,
 "permalink": "/r/AskReddit/comments/15q6o6w/why_did_you_leave_your_religion/",
 "score": 144,
 "url": "https://www.reddit.com/r/AskReddit/comments/15q6o6w/why_did_you_leave_your_religion/",
 "comments": [
  {
   "comment_id": "jw1u1ef",
   "message": "Abuse disguised as the word of God, felt and witnessed over and over. In church, at school, at home, on the playground.",
   "created_utc": 1691959367,
   "score": 225,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1lbgt",
   "message": "When I was younger, I was super skeptical of everything that I was being taught religion-wise. It just never sat well with me. I played along, but never believed. I felt neither guilt nor shame, I felt detached. Conicedentally when I was around 8 I moved, and as a result I had the opportunity to no longer attend church nor a private Catholic school (I moved with the less religious parent). It was so easy to drop it, I never missed it once.",
   "created_utc": 1691956043,
   "score": 42,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1bg60",
   "message": "Michael Stipe told me to.",
   "created_utc": 1691952225,
   "score": 69,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw28uo7",
   "message": "My parents raised us Catholic, I did my first communion and then started \"CCD\" classes once a week. I still don't know, or care, what that even stands for. In 8th grade I had been in CCD for a few years at that point. I started to become skeptical, because a lot of what they said just wasn't making sense to me, so I began asking questions. I would just ask \"why?\" several times a night, and it began to aggravate the fuck out of our group leader. One night I was about to ask another question, and the dude could tell that it was coming. He stopped me before I could even open my mouth, and he told me \"if you have so many questions, maybe you're not in the right place.\" I could not agree more! I got up and walked home. When I got home, my mom asked me why I was home so early, so I told her that I'm done with CCD, and church. She said \"ok, I don't think your sister wants to go anymore either.\" So I told my sister about it, and she was absolutely elated! My sister and I immediately became atheist. My parents were relieved that they didn't have to put up the charade anymore. My brother was disappointed in all of us, and is still the only religious one left in my immediate family, he calls me from prison once a week, I don't always answer.",
   "created_utc": 1691965236,
   "score": 84,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2dczn",
   "message": "The church stopped having donuts before mass. No donuts, no me.  Sorry Jesus.",
   "created_utc": 1691967113,
   "score": 8,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1sbzw",
   "message": "Corruption.  The last straw was finding out how they protected child molesters.  The last vestige of my catholicism is rooting for Notre Dame football.",
   "created_utc": 1691958716,
   "score": 39,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1fwsn",
   "message": "Because when I was asking hard questions the only answers I would get is “ it’s part of his plan”. I’m sorry but cancer in children should not be a part of anyone’s plan. Losing someone to a degenerative disease who has been nothing but loving and kind their whole life should not be a part of anyone’s plan. \n\nI would rather believe in nothing than believe in something that promotes pain in one of their most beloved creations.",
   "created_utc": 1691953946,
   "score": 100,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1bnho",
   "message": "Because, like the rest of them, it didn't stand up to honest questioning from someone who wasn't all that desperate for it to be real.",
   "created_utc": 1691952303,
   "score": 9,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1bpkj",
   "message": "Everyone kept telling me that I wasn’t a real Christian if I believe in evolution. Also in youth group, we watched God Is Not Dead and it made me realized how weak the arguments are for Christianity.",
   "created_utc": 1691952326,
   "score": 39,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1n03s",
   "message": "When Carl Sagan said, “Extraordinary claims require extraordinary evidence”, I concluded that the extraordinary evidence was lacking.",
   "created_utc": 1691956679,
   "score": 16,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw22cs0",
   "message": "born and raised hindu. saw my mom walk miles back and forth fasting as she did for years even in illness and utterly bad weather. only for the priests and gurus telling her one or the other thing was wrong with her practice. saw her pray a lot, go to a lot of places, offer food, water, money, clothes to countless priests and homeless (the homeless part i’m good with). she even left her home she built with her hard earned money cuz some priest told her the house was cursed.\n\ni utterly hate the bs religion propagates and leads to mass manipulation.\n\neven highly educated people get fooled cuz faith cannot and must not be questioned. They have ask the answers and the only problem is that your faith and belief and conviction are not strong enough!!",
   "created_utc": 1691962625,
   "score": 147,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1lkvf",
   "message": "Wasteful use of time, unproductive, negative vibes, trauma, encouragement of psychotic beliefs that don't make logical or rational sense.",
   "created_utc": 1691956144,
   "score": 170,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw21o20",
   "message": "Because our planet has geological scars that are more believable to me than recorded human literature.",
   "created_utc": 1691962350,
   "score": 38,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1ftc3",
   "message": "I should say “organized religion.” That picture of all the evangelical leaders with their hands on Trump praying, sexual abuse that goes unpunished, anyone telling anyone that they are going to hell, prosperity gospel grifters, manipulation through fear, and more.",
   "created_utc": 1691953909,
   "score": 82,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2egbq",
   "message": "A rule for this. A rule for that. A rule for everything. Rules, rules, rules. They are useful guidelines. But if we blindly follow them, is it really a good thing? Retain your ability to think for yourself, and weigh each decision carefully because you are the one who has to live with them.",
   "created_utc": 1691967572,
   "score": 76,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1xm96",
   "message": "Experimented with atheism, and when I told my classmates they bullied me, decided there that god is not real and just a way of manipulating ppl (in my opinion)",
   "created_utc": 1691960740,
   "score": 28,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw25y6e",
   "message": "Christianity is a corporation devoid of the teachings of Jesus.",
   "created_utc": 1691964067,
   "score": 119,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1bihr",
   "message": "It was a bunch of nonsense.",
   "created_utc": 1691952250,
   "score": 162,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1ewpl",
   "message": "I started going to church, I think, age 8 or 9, Baptist.\n-side note for later. My mom went for one month and quit going. Didn't tell me why until later\nThey had a rule that once you turn 13, you leave the youth program and go to the \"big church.\" (Adult praise and youth were in 2 separate buildings. We weren't allowed over there at all. Literally, no kids under 13 were allowed with the adults)\n Before I turned 13, our youth pastor was fired. Didn't find out til later he was accused of molesting a minor. So I quit going for a bit because my mom said so, you know, to make sure it was a safe place again. So I went back. Finally I turned 13, when to the \"big side\" and at first everyone was so nice, but being 13, I thought they were asking me questions because I thought they were just really interested to know me. Come to find out, that was false. \n\nThey used whatever info they could to judge you, gossip about you, shame you,  and bully you. When I heard the GROWN ASS adults saying how my mom was a sinner for divorcing my ex step dad. And how I was born out of wed-lock, I'd be the one burning in hell for her sins, etc. I, too, lasted barely a month. Told my mom, and she said that why she left the church and she never went back again.\n\nOver the years until about 23, I tried other churches and such but I just found it odd with how I can go to all these Christian churches, praise and preaching the same thing and people just act so differently about it. I've been denied entry because I wasn't \"respectable\" and women are supposed to be in dresses or skirts? Told where I could and couldn't sit. More \"godlier\" folks in the front!? Questioned how come I didn't sing along? Judged for being a mom of kids who I ne er .arrived their father. The list goes on. \n\nIt was just the most non-christain experiences ever that made me quit church. I don't openly admit it except now. But I still pray time to time. I still give my thanks in my prayers, but I won't pick up a Bible anymore. I do believe God exists.",
   "created_utc": 1691953561,
   "score": 73,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1g5ai",
   "message": "Yearly taxes.",
   "created_utc": 1691954039,
   "score": 24,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1l3yv",
   "message": "I still have faith but haven’t been to church since 2019",
   "created_utc": 1691955964,
   "score": 24,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2c07q",
   "message": "I was raised Christian and for a long time I became agnostic due to the hypocrisy of organized religion.  I've actually come back into my faith over the past few years because I've realized my issue isn't with God, it's with the people who claim to speak for him.",
   "created_utc": 1691966547,
   "score": 23,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2l302",
   "message": "Pedophile priests, anti-gay teachings, hypocrisy, sloth, greed, dishonesty. \n\nThe fact that because I'm gay I'm denied the sacraments anyway. \n\nAll the Pope's and their inaction towards the above bullshit.",
   "created_utc": 1691970420,
   "score": 20,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2cu8z",
   "message": "I realized I never believed, just was forced to participate.",
   "created_utc": 1691966898,
   "score": 18,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1hk8p",
   "message": "Mormon. Need I say more?",
   "created_utc": 1691954585,
   "score": 116,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1bxsz",
   "message": "[deleted]",
   "created_utc": 1691952414,
   "score": 17,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2871x",
   "message": "Honestly, it was just a cult. As a science dominant man i got tired of the faith answer.",
   "created_utc": 1691964975,
   "score": 34,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1m5g8",
   "message": "God didn't want to talk with me.",
   "created_utc": 1691956352,
   "score": 64,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1oha3",
   "message": "I really just started questioning the logic of it around 12th grade. It really made no sense to me, and a huge part of that is the focus a lot of churches had during my upbringing on Screaching (scare preaching) and the focus on the negative aspects of society or \"sins\" that aren't even written clearly in the Bible. Just a lot of questioning and the realization of hypocrisy. \n\nI will say I do realize now religion and spirituality are built on faith and the suspension of logic, which I now better understand, but I really just don't feel it. I will say I love CS Lewis as he has what I believe to be the most realistic depiction of Heaven and the relationship to God if there is one. On the flip side, though, I love what Jesus preached in the Bible and do try to incorporate a lot of what he said in my day to day life.",
   "created_utc": 1691957245,
   "score": 15,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1l5kd",
   "message": "Got a little political",
   "created_utc": 1691955980,
   "score": 28,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1wzmh",
   "message": "I'm going to! \n\nmy work contract did bind me to staying a christian (weird shit)- i switch employers atm and I'll leave soon.",
   "created_utc": 1691960493,
   "score": 26,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1blca",
   "message": "Realized it was nothing but lies.",
   "created_utc": 1691952280,
   "score": 49,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1znpj",
   "message": "I just lost the blind faith. I came to the conclusion that the question of whether or not God exists is impossible to answer.",
   "created_utc": 1691961545,
   "score": 9,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1xif1",
   "message": "Catholic here. Oh, because it’s bullshit",
   "created_utc": 1691960699,
   "score": 56,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw22z7a",
   "message": "Cause I ate a cheese burger for the first time and loved it!",
   "created_utc": 1691962874,
   "score": 10,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1jj2b",
   "message": "Science",
   "created_utc": 1691955352,
   "score": 39,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1fntq",
   "message": "I was taught the bible in Sunday School.",
   "created_utc": 1691953850,
   "score": 8,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2dyvi",
   "message": "I took mushrooms in Amsterdam for the first time and they made me accept that God isn't real.\n\nLive life so much happier now and appreciate everything with a clearer mind.",
   "created_utc": 1691967366,
   "score": 7,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2bywl",
   "message": "I have faith in a higher being, but organised religion is a money grab. Just look at the Pope’s house.",
   "created_utc": 1691966532,
   "score": 8,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2xx1l",
   "message": "My mothers husband treated Christianity similarly to how to evangelical Christian’s do. But his was worse. So much worse. \nMy mothers husband was an abusive drunk who I’m almost positive had some kind of manic psychosis disorder. He often found himself “fighting demons” out loud. He’d yell and scream in his drunken stupors. Beg and plead with “angels” and he’s walk around the house talk as if he had a personal relationship with god and would talk in a conversation type manner. \n\nThis isn’t even the bad part. He was a hypocritical Christian. He would claim sinning is bad. You’ll burn in hell for all of eternity. Yet, he cheated on my mother frequently, harmed his family, stole, threatened people, I’m almost positive he’s killed someone, or two before. \n\nWhere it gets two steps worse is that he acted like a “new age” cult leader. He would bring people into Christianity, but he’d tell them the book was wrong. And his interpretations were the correct way to see the Bible. And if they went to church, and not his back yard sermons then they would become brainwashed sinners who he would threaten to harm. \n\nI turned away from Christianity, and most religions in general because I was always told “pray and you’ll be answered” yet the Christian god let my mothers husband almost kill me on a weekly basis. Same with my siblings. And my mother. I prayed every night. For hours. \n“Save me. Strike him down. Let the neighbors finally call the cops.” But nothing happened. So my faith in sky daddy died the day he put a gun to my head, and I screamed loud enough for several blocks to hear. Praying for help. And no one came. \n\nMy hatred for religion is trauma based. I grew up in a Christian “drink the koolaid” cult. No, I won’t ever go back. But I won’t judge people for having their faith still.",
   "created_utc": 1691976144,
   "score": 8,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1ey95",
   "message": "I don't  believing in fantasies.",
   "created_utc": 1691953577,
   "score": 32,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2e6il",
   "message": "Too much guilt, no bagels",
   "created_utc": 1691967457,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw22qrt",
   "message": "God just sounded like a dad that hates you.",
   "created_utc": 1691962780,
   "score": 20,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2aa97",
   "message": "Crazy ass homophobic christians",
   "created_utc": 1691965828,
   "score": 18,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1c6rb",
   "message": "because I no longer believe in it. after all, it's your faith that's important, not your religion",
   "created_utc": 1691952509,
   "score": 11,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1xc1y",
   "message": "I didn’t leave it, but I do think it’s wrong how in Islam drawing pictures of things with faces is forbidden. And how the artist would be tortured in Hell by their creations according to the Hadith.\n\nI’ve struggled to keep friends over the course of my life for various reasons, and telling visual stories and just even drawing pictures of people I liked that I would imagine gave me great comfort. \n\nIt really did severe damage to me emotionally to struggle with the idea I was going to Hell for this for the longest time.",
   "created_utc": 1691960629,
   "score": 13,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1lj87",
   "message": "the humans",
   "created_utc": 1691956127,
   "score": 5,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw25dod",
   "message": "I found it more rewarding and motivating to believe that I was (at least mostly) responsible for many of the good things in my life rather than someone having planned it all out for me. I just kinda like to think that what I do matters I guess",
   "created_utc": 1691963836,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw29083",
   "message": "I want to be a Christian but I can’t understand certain things. I still believe in God but I can’t understand why he lets atrocities happen. People who believe in God need to realize that there is no way we can prove his existence. The concept of God is beyond what we can measure in this physical world.",
   "created_utc": 1691965297,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw3fth3",
   "message": "When kids in my Christian Sunday School class we're laughing about how all Jews are going to hell and this and that.  And the teacher did nothing to stop them and even kinda agreed by saying some dumb Bible things.  That was it for me.  One side of my family tree basically ends in the 40s thanks to the Holocaust.  I have a Jewish last name(my mom tried to raise me Christan).  And sitting there that day staring daggers into everyone I decided that was it for me.",
   "created_utc": 1691984793,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1rclj",
   "message": "Because they believed in thought crime, which imo is psychological torture",
   "created_utc": 1691958335,
   "score": 15,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2a7ng",
   "message": "When asking questions were answered with 'You have to have faith.' That is not an answer, that is a cop out.",
   "created_utc": 1691965798,
   "score": 10,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw24xzm",
   "message": "Because I have a brain. Religion is nothing more than an instrument of control. Baffles me how stupid most people are.",
   "created_utc": 1691963660,
   "score": 47,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1dddf",
   "message": "I left the LDS religion because anti gay no longer sits with my beliefs. I was the strongest believer in my family for a very long time. I also was a big believer In Joseph Smith and professed my testimony in him many times. He just wasn’t a good man or good husband and that is something I could not look past. I love my mom very last (she has passed now) and supported her but I don’t have to anymore.",
   "created_utc": 1691952962,
   "score": 17,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1twpt",
   "message": "the sure amount of hypocrisy + the number of \"respected\" ppl in the church being pedophiles or openly homophobic but closeted.",
   "created_utc": 1691959317,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1w2g6",
   "message": "In a corner under a spotlight.",
   "created_utc": 1691960143,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw22vgv",
   "message": "Because even at 6 years old I knew it was impossible to gather 2 of every species and put em on a big ol boat. Good parents respected my logic even though they kept their faith.",
   "created_utc": 1691962833,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw29wg0",
   "message": "On the one hand, it told me to love everyone just to turn around and tell me to hate people who weren't just like me\n\n\nIn the words of the late great George Carlin, \"I was Catholic once until i reached the age of reason.\"\n\nWhen i was in bible study as a kid. We were told we were supposed to love all gods' children. I got older, and then things started to change. Then came the racism and sexism. We were told to hate gay people. Because god hated gay people. We had a guy who sat on the corner in my neighborhood. We called him Gay Tony. He was fine with that name. And he was nothing like they described gay people in the bible. I didn't want to hate gay Tony. K didn't understand why god would hate Gay Tony. He was a good guy . It told me to hate anyone who was a parent outside of marriage. I had a friend named Dennis. His mom was married to his dad but left and gotten divorced because of the abuse he was doing. I loved his mom. I did t want to hate her. One day, i stopped, and i thought to myself, \"Wait a minute, i thought god loves all his children,\" and i realized that organized religion wasn't about teaching gods word. It was teaching a group of men's beliefs and passing them over as gods word. And i was done at with it at the age of 16",
   "created_utc": 1691965670,
   "score": 5,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw29zc7",
   "message": "I came out and they left me.",
   "created_utc": 1691965703,
   "score": 5,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2yv3y",
   "message": "my dad got kicked out for interracial marriage at some point between my realizations of \"if god cared what i thought about them they wouldn't've left me behind a flaming dumpster as a baby\" and \"holy shit what do you mean that's a cult?\"\n\n i wouldn't have been allowed back in anyway now that they knew i was mixed AND gay. at least the gay they could try to get rid of. what were they gonna do, cut out my mom's dna?",
   "created_utc": 1691976573,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw3e83c",
   "message": "It didn’t make any sense! That and the priests diddlin’ kids.",
   "created_utc": 1691983950,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw3e9m1",
   "message": "Because I learned too much.  This led to asking too many questions.  Science provided answers or at least an honest \"we don't know.  Yet.\". Religion provided lies, half truths and curses for asking the questions.  \n  \n When I first became an atheist, I believed that faith was synonymous with gullibility.  Years later I understand that faith is *deliberate gullibility*.   It is choosing to remain gullible and rejecting knowledge that could broaden your horizons and open your mind.",
   "created_utc": 1691983972,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1jzf9",
   "message": "Because R.E.M. told me to....",
   "created_utc": 1691955529,
   "score": 7,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1pccs",
   "message": "I hate being told by other whats right from wrong. I also dont want to be associated with something that doesnt accept everyone.",
   "created_utc": 1691957574,
   "score": 7,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw21o80",
   "message": "Too much hypocrisy.",
   "created_utc": 1691962351,
   "score": 7,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2aqo6",
   "message": "I grew up.  Like talking snakes?  Witches?  Dead people becoming alive again?  That's stupid.  Pass.",
   "created_utc": 1691966019,
   "score": 7,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1o1wy",
   "message": "**It’s a playground** for the worst people in humanity.  Just as pedos have infiltrated juvenile organizations and places of worship; grifters, racists, misogynists, thieves, liars, and perverts have infiltrated the church.",
   "created_utc": 1691957083,
   "score": 8,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1e5qf",
   "message": "I turned up every Sunday and had lots of time to think about everything the guy at the front was saying and how anyone knew any of this amazing stuff actually happened.",
   "created_utc": 1691953270,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1yjot",
   "message": "I did not agree with what they were saying",
   "created_utc": 1691961106,
   "score": 7,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw209n7",
   "message": "I got tired of the constant guilt trip and being told that I’m irrevocably flawed due to the sin of being born (Catholic)",
   "created_utc": 1691961785,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw253n4",
   "message": "Because the pastor said my belt buckle was a Holy Ghost reflector.",
   "created_utc": 1691963724,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw26z70",
   "message": "Because when my son was stillborn, I was told he’s in a “better place”, then several people told me they “saw him” in visions and that he was happy. The pastor used his funeral for an altar call. \n\nWhen my ex-husband was mentally and emotionally abusive I was told I needed to stay with him and be a witness to him.\n\nI was good enough to organize a MOPS group and plan social things for it, but not to hang out with outside of church. \n\nWhen I decided to leave him, the church told me I would ruin my children’s lives and my mom said I needed to really pray and make sure it’s what god wanted me to do. \n\nWhen I was a single mom to five kids, the church I grew up in treated me like a social pariah until they needed a volunteer for the coffee shop, then suddenly I needed to be brought into the fold. \n\nI’m done with the church. I attended faithfully from birth, then brought my children faithfully. Usually a minimum of three times a week and uncountable volunteer hours in the nursery, children’s ministry and women’s ministry. I woke up faithfully at 5 am every morning even with newborn twins (and three other kids I was homeschooling) to read my Bible and pray and still felt nothing. \n\nAll I ever got from church was guilt, shame and fear. I have never ever been happier and had more joy—true, felt down to my bones joy, not the fake joy they claim at church—than I have since leaving three years ago. I’m never going back.\n\nETA: I was raised Southern Baptist, attended Assemblies of God while married for 13 years, and then back to Southern Baptist for two years before leaving completely.",
   "created_utc": 1691964481,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2l7yg",
   "message": "God revealed himself in an instant to me as not existing. Who was I do disbelieve? I was 14 in synagogue holding the Torah when it happened. Seven decades ago. My beliefs remain fixed.",
   "created_utc": 1691970480,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2zhl2",
   "message": "A really traumatic thing happened to my family when I was around 14. I had been raised Christian my whole life. About a year after the traumatic event, my mom randomly came up to me and said she and my dad no longer consider themselves Christian, but it’s totally okay if I do. I told my mom that I, too, felt like like I had lost my religion. Same thing happened with my older sister. Basically, my whole family independently decided to abandon Christianity without ever discussing it with each other (my family doesn’t like to talk about feelings lol). \n\nIt all came down to the same basic question: why would an omnicient, omnipotent, loving God allow such horrible things to happen in the world he created? I REALLY resent the notion (which people say all the time) that nothing is an accident and God has a plan for everyone. I find it really offensive, actually.",
   "created_utc": 1691976862,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw31u6j",
   "message": "Too many priests and cardinals raping little kids with almost no reaction from anyone in the Catholic Church. Didn’t want my butthole diddled",
   "created_utc": 1691977943,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw37eth",
   "message": "Went into church the week after Cobain was found. Had found out cruelly from someone a good friend who moved away had eaten a 20 gauge the day prior, so I'm an absolute wrecked 14 year old and emotions are in chaos. I just knew that it was going to be a sermon about self termination, and the youth pastor was shredding every self termination victim as burning in hell, and he seemed to take malicious enjoyment in describing how all self termination victims are suffering eternally. I thought of my friend C, who suffered enough on this earth for many lifetimes, and realized all Christians are cruel bastards, and so was God. \n\nLater on, when I started asking tougher questions and getting nonanswers, I realized it's a bullshit 3 ring circus sideshow. Another method to control the population.",
   "created_utc": 1691980537,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw37z0p",
   "message": "I started reading more than the Bible",
   "created_utc": 1691980809,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw3bvc5",
   "message": "Because it wasn't my choice to join it in the first place.",
   "created_utc": 1691982741,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw3e88z",
   "message": "I told my minister I was being molested and he said I should resist this sin. I was ten.",
   "created_utc": 1691983952,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw3pt2s",
   "message": "Morality.",
   "created_utc": 1691990703,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw3v78a",
   "message": "Religion contradicts the theory of evolution. I decided that dinosaurs are much cooler.",
   "created_utc": 1691994451,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw43fjx",
   "message": "I started using my critical thinking skills.",
   "created_utc": 1692000788,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1qg1a",
   "message": "Raised Catholic. Need I say more?   \n\"That which can be asserted without evidence can be dismissed without evidence.\" -   \nC. Hitchens",
   "created_utc": 1691957990,
   "score": 7,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1znso",
   "message": "Too many hypocrites in the church. Plus I just couldn't buy what they were selling. Not interested/interesting.",
   "created_utc": 1691961546,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw21ihs",
   "message": "Religion is just a way of controlling people",
   "created_utc": 1691962287,
   "score": 10,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1zne6",
   "message": "Because priests don't know shit about real life, they have no children,wife,they are paid from taxes, their job is to basically repeat the same speech on different occasions, they ask for money for you to get to heaven, you get cleared from all your sins for money too. Religion rules the world and politics. Think about all the saint wars , all in the name of whatever that doesn't even exist. Yes, religion saved many lives but the ratio of pros and cons gave me a simple answer, it's time to leave and never look back...",
   "created_utc": 1691961541,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2a9bg",
   "message": "Started using my brain at about age 14 and realized it was all BS.",
   "created_utc": 1691965817,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2g412",
   "message": "Because Christianity proved to be true while the one I was practicing had no basis in truth, only presumption, tradition, and aristocratic traditionalism.",
   "created_utc": 1691968271,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1kuzp",
   "message": "Because I realize it's irrational. It's mythology. I reject the climate of fear it creates.",
   "created_utc": 1691955868,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw259q6",
   "message": "Because Christianity is a construct written by men for men. I am not lesser because I give birth.",
   "created_utc": 1691963792,
   "score": 5,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1lguf",
   "message": "Spent a few minutes objectively thinking about it and came to the conclusion that it was bollocks.\n\nThankfully, these mindviruses are slowly dying out.",
   "created_utc": 1691956101,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2emhj",
   "message": "It hates gay people.",
   "created_utc": 1691967643,
   "score": 5,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1p4g7",
   "message": "Religion is nonsense to me.\nI'm a good person without it.",
   "created_utc": 1691957490,
   "score": 9,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw21sdx",
   "message": "I asked too many questions and was invited to leave.\n\nA few months after that, I was standing outside late at night smoking, and I looked up at what was the first clear night sky in recent memory; one of those nights where you could really see the stars and constellations with the naked eye.  The enormity of the universe suddenly swept over me and I felt at peace.  After that moment, I could not imagine a reality where some omnipotent deity spends so much of its time worried about what I am doing with my genitalia.",
   "created_utc": 1691962398,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2c4k9",
   "message": "I turned 13 or so and the whole thing seemed stupid to me",
   "created_utc": 1691966598,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2d7g8",
   "message": "Serving on my church's council during the 2016 election.  I was going to an evangelical church at the time and was already kind of on the fence about it.  I didn't agree with their stances on abortion, evolution, gay marriage, and many other social issues, but naively thought it wasn't that big a deal.\n\nThen what I saw was a Godless, narcissist, greedy, wicked bastard get the emphatic and enthusiastic support of the congregation and realized that American Christians really don't care for the teachings of Christ.  I finished my time on the council quietly stopped going.\n\nOne set of close friends asked us why, and I gave them an honest answer.  I got the usual platitudes of, \"we all sin and fall short of the glory of God.\"  I said there was a difference between falling short of your goal and being fundamentally misaligned with it and that's where I am now.\n\nI'd like to start going again but these days when I look at American Christianity I don't see Christ.",
   "created_utc": 1691967050,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2l0rv",
   "message": "My daughter came out as trans. I couldn’t have a belief system that condemned her for merely existing. So I’m an atheist now.",
   "created_utc": 1691970393,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2yrgm",
   "message": "Because I have a brain and I use it. The Bible says that in order to be \"saved\" all you have to do is believe in Jesus and accept him as your Lord and Savior. But religion adds conditions and rules. \nDon't cut your hair, procreate excessively, women can't wear pants, be subservient etc. All BS. So either the Bible is wrong or religion is wrong.",
   "created_utc": 1691976527,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2z50m",
   "message": "Realized that the burden of proof goes unmet. That being said, I was never into the religion that was forced unto me.",
   "created_utc": 1691976700,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw3alit",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15q6o6w"
  }
 ]
}