{
 "submission_id": "15q6o6w",
 "title": "Why did you leave your religion?",
 "selftext": "",
 "created_utc": 1691952170,
 "permalink": "/r/AskReddit/comments/15q6o6w/why_did_you_leave_your_religion/",
 "score": 194,
 "url": "https://www.reddit.com/r/AskReddit/comments/15q6o6w/why_did_you_leave_your_religion/",
 "comments": [
  {
   "comment_id": "jw1bg60",
   "message": "Michael Stipe told me to.",
   "created_utc": 1691952225,
   "score": 100,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1bpkj",
   "message": "Everyone kept telling me that I wasn’t a real Christian if I believe in evolution. Also in youth group, we watched God Is Not Dead and it made me realized how weak the arguments are for Christianity.",
   "created_utc": 1691952326,
   "score": 200,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1fwsn",
   "message": "Because when I was asking hard questions the only answers I would get is “ it’s part of his plan”. I’m sorry but cancer in children should not be a part of anyone’s plan. Losing someone to a degenerative disease who has been nothing but loving and kind their whole life should not be a part of anyone’s plan. \n\nI would rather believe in nothing than believe in something that promotes pain in one of their most beloved creations.",
   "created_utc": 1691953946,
   "score": 122,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1sbzw",
   "message": "Corruption.  The last straw was finding out how they protected child molesters.  The last vestige of my catholicism is rooting for Notre Dame football.",
   "created_utc": 1691958716,
   "score": 43,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw28uo7",
   "message": "My parents raised us Catholic, I did my first communion and then started \"CCD\" classes once a week. I still don't know, or care, what that even stands for. In 8th grade I had been in CCD for a few years at that point. I started to become skeptical, because a lot of what they said just wasn't making sense to me, so I began asking questions. I would just ask \"why?\" several times a night, and it began to aggravate the fuck out of our group leader. One night I was about to ask another question, and the dude could tell that it was coming. He stopped me before I could even open my mouth, and he told me \"if you have so many questions, maybe you're not in the right place.\" I could not agree more! I got up and walked home. When I got home, my mom asked me why I was home so early, so I told her that I'm done with CCD, and church. She said \"ok, I don't think your sister wants to go anymore either.\" So I told my sister about it, and she was absolutely elated! My sister and I immediately became atheist. My parents were relieved that they didn't have to put up the charade anymore. My brother was disappointed in all of us, and is still the only religious one left in my immediate family, he calls me from prison once a week, I don't always answer.",
   "created_utc": 1691965236,
   "score": 70,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1lkvf",
   "message": "Wasteful use of time, unproductive, negative vibes, trauma, encouragement of psychotic beliefs that don't make logical or rational sense.",
   "created_utc": 1691956144,
   "score": 83,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1bnho",
   "message": "Because, like the rest of them, it didn't stand up to honest questioning from someone who wasn't all that desperate for it to be real.",
   "created_utc": 1691952303,
   "score": 109,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1n03s",
   "message": "When Carl Sagan said, “Extraordinary claims require extraordinary evidence”, I concluded that the extraordinary evidence was lacking.",
   "created_utc": 1691956679,
   "score": 102,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1bihr",
   "message": "It was a bunch of nonsense.",
   "created_utc": 1691952250,
   "score": 107,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1u1ef",
   "message": "Abuse disguised as the word of God, felt and witnessed over and over. In church, at school, at home, on the playground.",
   "created_utc": 1691959367,
   "score": 23,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1lbgt",
   "message": "When I was younger, I was super skeptical of everything that I was being taught religion-wise. It just never sat well with me. I played along, but never believed. I felt neither guilt nor shame, I felt detached. Conicedentally when I was around 8 I moved, and as a result I had the opportunity to no longer attend church nor a private Catholic school (I moved with the less religious parent). It was so easy to drop it, I never missed it once.",
   "created_utc": 1691956043,
   "score": 17,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1bxsz",
   "message": "[deleted]",
   "created_utc": 1691952414,
   "score": 17,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1ftc3",
   "message": "I should say “organized religion.” That picture of all the evangelical leaders with their hands on Trump praying, sexual abuse that goes unpunished, anyone telling anyone that they are going to hell, prosperity gospel grifters, manipulation through fear, and more.",
   "created_utc": 1691953909,
   "score": 33,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw22cs0",
   "message": "born and raised hindu. saw my mom walk miles back and forth fasting as she did for years even in illness and utterly bad weather. only for the priests and gurus telling her one or the other thing was wrong with her practice. saw her pray a lot, go to a lot of places, offer food, water, money, clothes to countless priests and homeless (the homeless part i’m good with). she even left her home she built with her hard earned money cuz some priest told her the house was cursed.\n\ni utterly hate the bs religion propagates and leads to mass manipulation.\n\neven highly educated people get fooled cuz faith cannot and must not be questioned. They have ask the answers and the only problem is that your faith and belief and conviction are not strong enough!!",
   "created_utc": 1691962625,
   "score": 17,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw25y6e",
   "message": "Christianity is a corporation devoid of the teachings of Jesus.",
   "created_utc": 1691964067,
   "score": 66,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1m5g8",
   "message": "God didn't want to talk with me.",
   "created_utc": 1691956352,
   "score": 31,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1xif1",
   "message": "Catholic here. Oh, because it’s bullshit",
   "created_utc": 1691960699,
   "score": 37,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2egbq",
   "message": "A rule for this. A rule for that. A rule for everything. Rules, rules, rules. They are useful guidelines. But if we blindly follow them, is it really a good thing? Retain your ability to think for yourself, and weigh each decision carefully because you are the one who has to live with them.",
   "created_utc": 1691967572,
   "score": 12,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw24xzm",
   "message": "Because I have a brain. Religion is nothing more than an instrument of control. Baffles me how stupid most people are.",
   "created_utc": 1691963660,
   "score": 34,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1ewpl",
   "message": "I started going to church, I think, age 8 or 9, Baptist.\n-side note for later. My mom went for one month and quit going. Didn't tell me why until later\nThey had a rule that once you turn 13, you leave the youth program and go to the \"big church.\" (Adult praise and youth were in 2 separate buildings. We weren't allowed over there at all. Literally, no kids under 13 were allowed with the adults)\n Before I turned 13, our youth pastor was fired. Didn't find out til later he was accused of molesting a minor. So I quit going for a bit because my mom said so, you know, to make sure it was a safe place again. So I went back. Finally I turned 13, when to the \"big side\" and at first everyone was so nice, but being 13, I thought they were asking me questions because I thought they were just really interested to know me. Come to find out, that was false. \n\nThey used whatever info they could to judge you, gossip about you, shame you,  and bully you. When I heard the GROWN ASS adults saying how my mom was a sinner for divorcing my ex step dad. And how I was born out of wed-lock, I'd be the one burning in hell for her sins, etc. I, too, lasted barely a month. Told my mom, and she said that why she left the church and she never went back again.\n\nOver the years until about 23, I tried other churches and such but I just found it odd with how I can go to all these Christian churches, praise and preaching the same thing and people just act so differently about it. I've been denied entry because I wasn't \"respectable\" and women are supposed to be in dresses or skirts? Told where I could and couldn't sit. More \"godlier\" folks in the front!? Questioned how come I didn't sing along? Judged for being a mom of kids who I ne er .arrived their father. The list goes on. \n\nIt was just the most non-christain experiences ever that made me quit church. I don't openly admit it except now. But I still pray time to time. I still give my thanks in my prayers, but I won't pick up a Bible anymore. I do believe God exists.",
   "created_utc": 1691953561,
   "score": 42,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1blca",
   "message": "Realized it was nothing but lies.",
   "created_utc": 1691952280,
   "score": 38,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1hk8p",
   "message": "Mormon. Need I say more?",
   "created_utc": 1691954585,
   "score": 55,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1l5kd",
   "message": "Got a little political",
   "created_utc": 1691955980,
   "score": 21,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1g5ai",
   "message": "Yearly taxes.",
   "created_utc": 1691954039,
   "score": 8,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1wzmh",
   "message": "I'm going to! \n\nmy work contract did bind me to staying a christian (weird shit)- i switch employers atm and I'll leave soon.",
   "created_utc": 1691960493,
   "score": 9,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1xm96",
   "message": "Experimented with atheism, and when I told my classmates they bullied me, decided there that god is not real and just a way of manipulating ppl (in my opinion)",
   "created_utc": 1691960740,
   "score": 10,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2871x",
   "message": "Honestly, it was just a cult. As a science dominant man i got tired of the faith answer.",
   "created_utc": 1691964975,
   "score": 8,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2dczn",
   "message": "The church stopped having donuts before mass. No donuts, no me.  Sorry Jesus.",
   "created_utc": 1691967113,
   "score": 8,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1ey95",
   "message": "I don't  believing in fantasies.",
   "created_utc": 1691953577,
   "score": 23,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1yjot",
   "message": "I did not agree with what they were saying",
   "created_utc": 1691961106,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw21o20",
   "message": "Because our planet has geological scars that are more believable to me than recorded human literature.",
   "created_utc": 1691962350,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw21o80",
   "message": "Too much hypocrisy.",
   "created_utc": 1691962351,
   "score": 7,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1jj2b",
   "message": "Science",
   "created_utc": 1691955352,
   "score": 29,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1fntq",
   "message": "I was taught the bible in Sunday School.",
   "created_utc": 1691953850,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1l3yv",
   "message": "I still have faith but haven’t been to church since 2019",
   "created_utc": 1691955964,
   "score": 7,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1pccs",
   "message": "I hate being told by other whats right from wrong. I also dont want to be associated with something that doesnt accept everyone.",
   "created_utc": 1691957574,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2aa97",
   "message": "Crazy ass homophobic christians",
   "created_utc": 1691965828,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2c07q",
   "message": "I was raised Christian and for a long time I became agnostic due to the hypocrisy of organized religion.  I've actually come back into my faith over the past few years because I've realized my issue isn't with God, it's with the people who claim to speak for him.",
   "created_utc": 1691966547,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2cu8z",
   "message": "I realized I never believed, just was forced to participate.",
   "created_utc": 1691966898,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1oha3",
   "message": "I really just started questioning the logic of it around 12th grade. It really made no sense to me, and a huge part of that is the focus a lot of churches had during my upbringing on Screaching (scare preaching) and the focus on the negative aspects of society or \"sins\" that aren't even written clearly in the Bible. Just a lot of questioning and the realization of hypocrisy. \n\nI will say I do realize now religion and spirituality are built on faith and the suspension of logic, which I now better understand, but I really just don't feel it. I will say I love CS Lewis as he has what I believe to be the most realistic depiction of Heaven and the relationship to God if there is one. On the flip side, though, I love what Jesus preached in the Bible and do try to incorporate a lot of what he said in my day to day life.",
   "created_utc": 1691957245,
   "score": 5,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2a7ng",
   "message": "When asking questions were answered with 'You have to have faith.' That is not an answer, that is a cop out.",
   "created_utc": 1691965798,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2aqo6",
   "message": "I grew up.  Like talking snakes?  Witches?  Dead people becoming alive again?  That's stupid.  Pass.",
   "created_utc": 1691966019,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2dyvi",
   "message": "I took mushrooms in Amsterdam for the first time and they made me accept that God isn't real.\n\nLive life so much happier now and appreciate everything with a clearer mind.",
   "created_utc": 1691967366,
   "score": 5,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1rclj",
   "message": "Because they believed in thought crime, which imo is psychological torture",
   "created_utc": 1691958335,
   "score": 9,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw22qrt",
   "message": "God just sounded like a dad that hates you.",
   "created_utc": 1691962780,
   "score": 10,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1zne6",
   "message": "Because priests don't know shit about real life, they have no children,wife,they are paid from taxes, their job is to basically repeat the same speech on different occasions, they ask for money for you to get to heaven, you get cleared from all your sins for money too. Religion rules the world and politics. Think about all the saint wars , all in the name of whatever that doesn't even exist. Yes, religion saved many lives but the ratio of pros and cons gave me a simple answer, it's time to leave and never look back...",
   "created_utc": 1691961541,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1znpj",
   "message": "I just lost the blind faith. I came to the conclusion that the question of whether or not God exists is impossible to answer.",
   "created_utc": 1691961545,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1znso",
   "message": "Too many hypocrites in the church. Plus I just couldn't buy what they were selling. Not interested/interesting.",
   "created_utc": 1691961546,
   "score": 5,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw209n7",
   "message": "I got tired of the constant guilt trip and being told that I’m irrevocably flawed due to the sin of being born (Catholic)",
   "created_utc": 1691961785,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw22z7a",
   "message": "Cause I ate a cheese burger for the first time and loved it!",
   "created_utc": 1691962874,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw25dod",
   "message": "I found it more rewarding and motivating to believe that I was (at least mostly) responsible for many of the good things in my life rather than someone having planned it all out for me. I just kinda like to think that what I do matters I guess",
   "created_utc": 1691963836,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw29zh4",
   "message": "well honestly I broke some rules, had sex with a great woman. I realised I didn't feel even mildly bad about it and I started wondering if it was real. How could I break one of the biggest commandments and feel good? Either it wasn't real or I was a sociopath and I'm reasonably sure Im not a sociopath... reasonably...",
   "created_utc": 1691965704,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2l302",
   "message": "Pedophile priests, anti-gay teachings, hypocrisy, sloth, greed, dishonesty. \n\nThe fact that because I'm gay I'm denied the sacraments anyway. \n\nAll the Pope's and their inaction towards the above bullshit.",
   "created_utc": 1691970420,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1c6rb",
   "message": "because I no longer believe in it. after all, it's your faith that's important, not your religion",
   "created_utc": 1691952509,
   "score": 7,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1dddf",
   "message": "I left the LDS religion because anti gay no longer sits with my beliefs. I was the strongest believer in my family for a very long time. I also was a big believer In Joseph Smith and professed my testimony in him many times. He just wasn’t a good man or good husband and that is something I could not look past. I love my mom very last (she has passed now) and supported her but I don’t have to anymore.",
   "created_utc": 1691952962,
   "score": 14,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1lguf",
   "message": "Spent a few minutes objectively thinking about it and came to the conclusion that it was bollocks.\n\nThankfully, these mindviruses are slowly dying out.",
   "created_utc": 1691956101,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1o1wy",
   "message": "**It’s a playground** for the worst people in humanity.  Just as pedos have infiltrated juvenile organizations and places of worship; grifters, racists, misogynists, thieves, liars, and perverts have infiltrated the church.",
   "created_utc": 1691957083,
   "score": 9,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1lj87",
   "message": "the humans",
   "created_utc": 1691956127,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1t44e",
   "message": "I developed the skill of critical thinking and figured out that it's all a load of horse puckey.",
   "created_utc": 1691959010,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1twpt",
   "message": "the sure amount of hypocrisy + the number of \"respected\" ppl in the church being pedophiles or openly homophobic but closeted.",
   "created_utc": 1691959317,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw21i58",
   "message": "Too much singing.",
   "created_utc": 1691962284,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw22vgv",
   "message": "Because even at 6 years old I knew it was impossible to gather 2 of every species and put em on a big ol boat. Good parents respected my logic even though they kept their faith.",
   "created_utc": 1691962833,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw29083",
   "message": "I want to be a Christian but I can’t understand certain things. I still believe in God but I can’t understand why he lets atrocities happen. People who believe in God need to realize that there is no way we can prove his existence. The concept of God is beyond what we can measure in this physical world.",
   "created_utc": 1691965297,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw29wg0",
   "message": "On the one hand, it told me to love everyone just to turn around and tell me to hate people who weren't just like me\n\n\nIn the words of the late great George Carlin, \"I was Catholic once until i reached the age of reason.\"\n\nWhen i was in bible study as a kid. We were told we were supposed to love all gods' children. I got older, and then things started to change. Then came the racism and sexism. We were told to hate gay people. Because god hated gay people. We had a guy who sat on the corner in my neighborhood. We called him Gay Tony. He was fine with that name. And he was nothing like they described gay people in the bible. I didn't want to hate gay Tony. K didn't understand why god would hate Gay Tony. He was a good guy . It told me to hate anyone who was a parent outside of marriage. I had a friend named Dennis. His mom was married to his dad but left and gotten divorced because of the abuse he was doing. I loved his mom. I did t want to hate her. One day, i stopped, and i thought to myself, \"Wait a minute, i thought god loves all his children,\" and i realized that organized religion wasn't about teaching gods word. It was teaching a group of men's beliefs and passing them over as gods word. And i was done at with it at the age of 16",
   "created_utc": 1691965670,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2a3u2",
   "message": "It felt like a chore.",
   "created_utc": 1691965754,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2a9bg",
   "message": "Started using my brain at about age 14 and realized it was all BS.",
   "created_utc": 1691965817,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2aozf",
   "message": "Same reason I stopped believing in Santa Claus. After a certain age it just stops making sense.",
   "created_utc": 1691965998,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2cb0b",
   "message": "Got bored",
   "created_utc": 1691966674,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2e6il",
   "message": "Too much guilt, no bagels",
   "created_utc": 1691967457,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2jscc",
   "message": "I had to stop to believing in Fairy Tales. All this Mystical \u0026amp; Magical BS Happened in the Past, yet for some Reason, it’s not happening now…I’m referring to the Bible. ”Your not supposed to have sex before marriage.” “You shouldn’t call no one A Fool.” “You shouldn’t work on the Day of Rest.” If this “God” exist…He/It would’ve showed themselves in flesh, point, blank, Period. I guess when Believers of the Bible die, is when the lie, will be believed.",
   "created_utc": 1691969851,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2jtr4",
   "message": "My parents dragged me to church every Sunday. I could never understand how adults believed those fairytales. I was embarrassed for them. Even worse they made me get up for the 7 AM service! I moved out when I was 18 and never went back. And now I sleep in on Sundays.",
   "created_utc": 1691969869,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1e5qf",
   "message": "I turned up every Sunday and had lots of time to think about everything the guy at the front was saying and how anyone knew any of this amazing stuff actually happened.",
   "created_utc": 1691953270,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1jzf9",
   "message": "Because R.E.M. told me to....",
   "created_utc": 1691955529,
   "score": 5,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1qg1a",
   "message": "Raised Catholic. Need I say more?   \n\"That which can be asserted without evidence can be dismissed without evidence.\" -   \nC. Hitchens",
   "created_utc": 1691957990,
   "score": 5,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw21ihs",
   "message": "Religion is just a way of controlling people",
   "created_utc": 1691962287,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1xc1y",
   "message": "I didn’t leave it, but I do think it’s wrong how in Islam drawing pictures of things with faces is forbidden. And how the artist would be tortured in Hell by their creations according to the Hadith.\n\nI’ve struggled to keep friends over the course of my life for various reasons, and telling visual stories and just even drawing pictures of people I liked that I would imagine gave me great comfort. \n\nIt really did severe damage to me emotionally to struggle with the idea I was going to Hell for this for the longest time.",
   "created_utc": 1691960629,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1mb8h",
   "message": "As I grow up, I feel like I can’t trust anyone. That includes anyone who wrote or has transcribed the Bible. We already know historically they’ve edited it for things like convincing people not to eat pork before refrigeration and stuff like that, so what else is a lie?",
   "created_utc": 1691956414,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1v0bv",
   "message": "The Christian Science religion killed my mother when I was a child. They told her to pray instead of going to a doctor. \n\nFUCK GOD!!!!!!",
   "created_utc": 1691959740,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw259q6",
   "message": "Because Christianity is a construct written by men for men. I am not lesser because I give birth.",
   "created_utc": 1691963792,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1bnpl",
   "message": "Pyroluria made me not go to church and then I just didn’t care about God for a while, then I didn’t believe in him but now I’m saved again :)",
   "created_utc": 1691952305,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw253n4",
   "message": "Because the pastor said my belt buckle was a Holy Ghost reflector.",
   "created_utc": 1691963724,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw29zc7",
   "message": "I came out and they left me.",
   "created_utc": 1691965703,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2l7yg",
   "message": "God revealed himself in an instant to me as not existing. Who was I do disbelieve? I was 14 in synagogue holding the Torah when it happened. Seven decades ago. My beliefs remain fixed.",
   "created_utc": 1691970480,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1kuzp",
   "message": "Because I realize it's irrational. It's mythology. I reject the climate of fear it creates.",
   "created_utc": 1691955868,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1oap6",
   "message": "Baptized as a Christian but not practicing and not fan of religion hate propaganda against everyone not part of their club.",
   "created_utc": 1691957176,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw219vz",
   "message": "Went to Catholic school my entire K-12 years. The high school was specifically college-prep and they really emphasized teaching us critical thinking skills. That didn't work out for them, lol I think something like 80% of my graduating class wound up non Catholic. \n\nAlso, I read the Bible cover to cover several times, this was when the Church was actively denying and hiding any accusations of sexual assault, and I decided pretty much everything said in Mass is hyperbolic bullshit that doesn't actually mean anything (like, washed in the blood of the Lamb??) And, I was over giving up my right to sleep in on Sunday mornings.\n\nThat said, I got all the Sacraments until that point including Confirmation then almost immediately afterward going agnostic haha",
   "created_utc": 1691962191,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw25lt9",
   "message": "I cannot reconcile a god who claims to be of \"Love\" while simultaneously threatening its \"children\" with eternal torture.   \n\n\nJesus is a terrible role model",
   "created_utc": 1691963927,
   "score": 3,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1gchb",
   "message": "Because God's a fucking asshole who delights in the suffering of his creation. \n\nAll-knowing fuck involved himself in something and made me the happiest I've ever been. All while knowing it would be fucking ripped away from me for no damn reason! Fuck him.\n\nI can't wait to be separated from him and everything he created.",
   "created_utc": 1691954116,
   "score": 6,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1p4g7",
   "message": "Religion is nonsense to me.\nI'm a good person without it.",
   "created_utc": 1691957490,
   "score": 4,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1qyln",
   "message": "Took lsd and started to question everything and at some point the big bang just seemed more realistic",
   "created_utc": 1691958189,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2fj95",
   "message": "22 year old male here. The reason i \"left\" the islam was that i didnt have a lot of freedom and felt super depressed. Since my birth, my parents expected me to be a muslim and follow the islam. Which paired with cultural differences because we live in the west meant i didnt have the childhood/teenage years i wanted and still want. I couldnt attend to social activities western kids, go to concerts, partying, have fun with non arab kids, never got into a relationship because of the religion. I dated one girl but eventually she turned down because of the religion. It's just that so much of my childhood and teenage years are gone, and didnt have the freedom i wanted. My wings really got clipped before i learned to fly.",
   "created_utc": 1691968025,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2g412",
   "message": "Because Christianity proved to be true while the one I was practicing had no basis in truth, only presumption, tradition, and aristocratic traditionalism.",
   "created_utc": 1691968271,
   "score": 2,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1m2st",
   "message": "Learned that god is real as Santa only real if you believe in him",
   "created_utc": 1691956325,
   "score": 1,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw27iyz",
   "message": "Because at around 7 or 8 years old, I started to realize it was all just a story. Then when I turned 9, my mom and dad got a divorce and the pastor at our Lutheran church told us we should find a different church. Problem solved. I never went to any type of church after that. It was 1979.",
   "created_utc": 1691964703,
   "score": 1,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1cls7",
   "message": "I left because I thought it was holding me back living life, but I’m very much back to it. I couldn’t survive without it!",
   "created_utc": 1691952668,
   "score": 0,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1iwdp",
   "message": "My mind didn't make sense of the world the same way that religion did so I decided to disagree with it.. Age 10",
   "created_utc": 1691955110,
   "score": 1,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1kte0",
   "message": "Because is irrational",
   "created_utc": 1691955851,
   "score": 1,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1r97h",
   "message": "Because I have Faith.  Religion is the problem in this world.",
   "created_utc": 1691958300,
   "score": 1,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1bkgb",
   "message": "Wasn’t the right fit for me. It had a lot of elements I believed in, but not enough of the big picture",
   "created_utc": 1691952270,
   "score": 1,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1mxn9",
   "message": "Came to terms with the reality that we are just biological automatons that sprang from an amazing and probably not unique mileau of chemistry and that every representation of God is just a projection of whatever some arrogant, narcissistic sociopath convinced other desperate folks that it should be in order to take advantage of them.",
   "created_utc": 1691956653,
   "score": 1,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw259w4",
   "message": "I was a non denominational Christian my entire childhood and young adult life. But I’ve always, even as a child, rejected the idea of the holy trinity. How Can Jesus be god, if he was created by god? Islam has answered all of my doubts to date regarding religion, and to a degree restored my faith.",
   "created_utc": 1691963794,
   "score": 1,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2fp25",
   "message": "Because it’s proven to be false. Because they steal from the poor to line their own pockets. Because they treat anyone who doesn’t fit their perfect mold like shit. Because far too many younger people have killed themselves believing god didn’t love them because their parents didn’t. Because religion tries to make everyone abide by its rules and the gods they have made in their own bigoted images.",
   "created_utc": 1691968093,
   "score": 1,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1h3pa",
   "message": "Got sucked in by late-2000s internet atheism culture. That, and the Nuns at our school were evil. Couldn't see God in them. When I realized that atheism leads to degeneracy and state worship, I began to turn back to Theism.",
   "created_utc": 1691954409,
   "score": 254,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1rvog",
   "message": "I created a new religion called The Way of the Roach and Cat, available in paperback and kindle on Amazon.",
   "created_utc": 1691958542,
   "score": 0,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1olb9",
   "message": "Jesus took a shit on my lawn and then flew away to Proxima Centauri b to start a wig farm.",
   "created_utc": 1691957287,
   "score": 0,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1hca1",
   "message": "\"My\" religion? No. The religion that exists in my part of the World, like the Darwin's theory of evolution but with beliefs.",
   "created_utc": 1691954500,
   "score": 0,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1lbvm",
   "message": "They locked the door",
   "created_utc": 1691956047,
   "score": 0,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2jn5o",
   "message": "Before I was muslim and then I became atheism because I felt like nothing higher than us existed and I was in the worst depression, then I decided to read the English quran and watch muslim reels. And now I'm Muslim and my depression is gone and I feel perfect alhamdulillah",
   "created_utc": 1691969789,
   "score": 0,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2knef",
   "message": "I was raised Catholic. My dad and his side was and still are devout Catholics. My dad put me though Catholic school where I was strangled by the vice principal for \"skipping class\" when i was in the bathroom because I thought I was going to puke. He broke the door down an drug me by my collar to my classroom. I told my parents and they didn't care at all. I was 7.\n\nI questioned the Catholic faith constantly and was told that I shouldn't be. That I need to obey. There are also so many rules about what you do will send you to hell that I didn't understand how people could believe this is a god of love. \n\nAfter my parents split I went to a youth group for a Methodist Church. Saw a different side of Christianity. After about 3 years I was all in to this. I wanted to become a pastor and all that and interned at the church. The pastor was very inappropriate with me and everyone thought it was funny... It wasn't. But after attending all the meetings and plannings for that I saw that the church was a business first and about god 3rd.\n\nI decided to not fallow through with the school I was going to and had a hard think about life. Went to another church where $ wasn't #1 eventually got on the board and omg it was another business. Church after church. Business first. God was just what got asses in seats.\n\nIt really started to bother me that I was all in with Jesus but the closer I got the more lies I saw in the big fallowers, the more things didn't make sense in the bible. I started to attend mortmon churches, really anything to find god and I couldn't. I kept getting further and further from him. I had this emptiness in my chest they everyone told me was the void of God so I kept looking, attended Bible studies, and nothing.\n\nThen I realized. God isn't here, he's never been here or he's not real. Later I met my now wife and that void went away. It wasn't god. I've never looked back.\n\nI really wish I the US we would stop treating Churches as non profits. They need to be audited. They are big scams. Not all of them but most are about how much money they can make in the game of \"god\". They prey are stupid people and it's fucking gross.\n\nI left my religion because it's a business. Anyone who thinks Christianity is not a business is completely blinded.",
   "created_utc": 1691970229,
   "score": 0,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw1m7o8",
   "message": "They probably left so they could either: suck on an endless amount of dicks or eat an endless amount of pussies, be homosexual while doing so, and their parents just didn't understand their needs.",
   "created_utc": 1691956376,
   "score": 242,
   "submission_id": "15q6o6w"
  },
  {
   "comment_id": "jw2tw5m",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15q6o6w"
  }
 ]
}