{
 "submission_id": "15q84xg",
 "title": "Men of Reddit: have you ever refused sex and if so, why?",
 "selftext": "",
 "created_utc": 1691955691,
 "permalink": "/r/AskReddit/comments/15q84xg/men_of_reddit_have_you_ever_refused_sex_and_if_so/",
 "score": 195,
 "url": "https://www.reddit.com/r/AskReddit/comments/15q84xg/men_of_reddit_have_you_ever_refused_sex_and_if_so/",
 "comments": [
  {
   "comment_id": "jw1mg9z",
   "message": "I'm probably one of the most horniest guy on here. But there are times when we all want to be left alone.",
   "created_utc": 1691956467,
   "score": 188,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1kpfd",
   "message": "She was really drunk and I was sober.",
   "created_utc": 1691955809,
   "score": 52,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1n70a",
   "message": "Yes, and it would've been my first time if I accepted. But she was high and I didn't even know her.",
   "created_utc": 1691956753,
   "score": 91,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1na1c",
   "message": "Yes. \nBecause she has feelings for me and i don't want to play with her feelings. Shes a good person.",
   "created_utc": 1691956786,
   "score": 122,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1kok8",
   "message": "Yes. I didn't want to sleep with them.",
   "created_utc": 1691955800,
   "score": 98,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1nlk9",
   "message": "Yes 1 because she was drunk and another no condoms when she wanted to do pull out. I'm not risking that",
   "created_utc": 1691956908,
   "score": 186,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1o9qz",
   "message": "Yes, because she didn't look like her pics and I wasn't attracted to her.",
   "created_utc": 1691957166,
   "score": 162,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1l93k",
   "message": "Actually I have, and it was recently. \n\nI’m not into the person that extended the offer , even though she’s cool. And I just can’t do the hook up thing.",
   "created_utc": 1691956017,
   "score": 12,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1uoji",
   "message": "Yes. Bunches of times.\n\n1. I am married. Lots of offers. Some pretty explicit ones, such as the new employee who invited me down to her parents' beach condo for a weekend to work on a proposal. Um, no. Divorce court is not my idea of fun.\n2. I was engaged. Weirdly, the minute women learned I was getting married, I got some outrageous proposals. Can women explain this phenomenon?\n3. I was dating someone.\n4. She was really drunk. My future wife, among them after we went to a concert. Trust me, I wanted to. But I wanted her to not be drunk the first time we made the beast with two backs.\n5. I was selective. Even when I was single, I didn't just bang anyone.",
   "created_utc": 1691959614,
   "score": 123,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1xqrl",
   "message": "I was invited over to a woman’s apartment after a second date and after some making out I went down on her until she came. She proceeded to tell me that she didn’t give head out of principle and didn’t really like sex. Just wanted me to cum as fast as possible to “get it over with… but I still want you to have fun”. My penis was flabbergasted and refused to participate.",
   "created_utc": 1691960789,
   "score": 71,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1konr",
   "message": "Yes loads of times. I was as shocked as everyone else to actually find out I had morals.",
   "created_utc": 1691955801,
   "score": 44,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1n6w0",
   "message": "Yes, one time, and i guess it made me the bad person, lol\nLost a friend.",
   "created_utc": 1691956752,
   "score": 31,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1oucl",
   "message": "I was young and he was my uncle",
   "created_utc": 1691957382,
   "score": 88,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1trr2",
   "message": "She was my mates girlfriend…and I still think I did the right thing.",
   "created_utc": 1691959263,
   "score": 22,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw21kul",
   "message": "She was passed out drunk and her best friend (girl) said she really wanted me, shoved me in a room with her and closed the door. I asked her if she was ok and she was conscious enough to smile and say come fuck me and then she went back to sleep. I rolled her on her side, asked her to say who I was, and then got her a bottle of water and told her girlfriend I wasn’t going to. \n\nMiss that girl, she was a sweetie but her girlfriend was an absolute asshole.",
   "created_utc": 1691962314,
   "score": 22,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1waoc",
   "message": "Uh yeah I don’t get this one.\n\nAre all men supposed to be crazy horny 24/7? I definitely have turned down sex multiple times",
   "created_utc": 1691960230,
   "score": 41,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1qx1h",
   "message": "She was my friend's ex and he made it clear he wasn't okay with it.\n\nOther occasions: I don't want to cheat on my wife.",
   "created_utc": 1691958173,
   "score": 67,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1xvnk",
   "message": "Seven years ago (20 y/o), I spent my entire summer with a big group of coworkers— all of us about the same age. Key word: About.\n\nAmong this group was a girl who I considered my friend but she was 17– and you already know where this is going. Some might say that it’s not a big deal because it was consented but I couldn’t do it in good conscience.\n\nThe tricky part, however, was that she had slowly started taking a liking to me and began to physically express it. We talked about life, fitness, work, etc. and it wasn’t long before our group’s first night of hilarity that she got comfortable with me. One playful physical interaction that set the bar— like that one dark joke that lets you know you can make fucked up 9-11 jokes with your new friends.\n\nFrom there, it was continuous engagements with me to hug me, grab me, sit on my lap, and eventually try kissing on me (for fun?). I remember specifically minding my own business and this girl locking me down and trying to kiss my face. Did this all turn something in me on? Yes. I won’t deny it. She was attractive and I will fully confess to wanting to cave so badly.\n\nThe closest I ever got to throwing in the towel was when she sat back on me [at a friends house] in the nightie that belonged to the girl who would be my girlfriend (now-ex). She claimed to not be wearing underwear and between the thoughts in my head and feeling that she wasn’t lying, I was just about ready to split her up the middle buuuut I didn’t.\n\nThings settled after that. I think she just realized it wasn’t going anywhere, kissed my cheek some few nights later and realized I liked the other girl instead. They were besties. Told me to be with her— and I did. Most toxic relationship of my life!\n\nThe end :(",
   "created_utc": 1691960842,
   "score": 63,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1vw52",
   "message": "Body odor.",
   "created_utc": 1691960076,
   "score": 16,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1ld9w",
   "message": "Yes, someone who is drunk and throws itself at you, barely standing needs to be brought home.\nIn relationships also because sometimes I am not in the mood just like my girlfriend would sometimes not be in the mood",
   "created_utc": 1691956062,
   "score": 94,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1n4s4",
   "message": "Because I’m not into one night stands and worry about disease.",
   "created_utc": 1691956729,
   "score": 76,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1qvgo",
   "message": "Yes, for a multitude of reasons, I’ve turned it down when not feeling well, I’ve been too tired, I’ve had a headache, I didn’t feel like it, I was busy.. well maybe not a multitude, but several.",
   "created_utc": 1691958155,
   "score": 27,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw224fv",
   "message": "My first girlfriend in high school wanted to have sex, and boy I sure did too, but something didn't feel right. She got pregnant less than 6 months after we broke up. \n\nTo quote, \"I wanted to 'accidentally' get pregnant with your kid.\"\n\nWe started dating when I was 15 and broke up when I was 16.",
   "created_utc": 1691962532,
   "score": 13,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1t3c7",
   "message": "Yes. Because I threw my back out. That a sure way to hurt yourself worse lol",
   "created_utc": 1691959002,
   "score": 11,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw201b5",
   "message": "Lol. Yes, my college gf of three years had moved to another city and I was to follow her in about six months.\n\nOne night this SMOKING HOT friend comes over, and we had hooked up once in the past before I was in a relationship, and she wanted it. Oh Lawd, I resisted.\n\nMeanwhile, my slut, whore gf was fucking a guy in the new city and getting herself pregnant.\n\n[I want a do-over!!!](https://vlipsy.com/vlip/napoleon-dynamite-uncle-rico-go-back-in-time-PvuRh1tk)",
   "created_utc": 1691961693,
   "score": 46,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1w8d5",
   "message": "I will for a few reasons.\n\n\u0026amp;#x200B;\n\n*  Way to drunk \n* excessive smell\n*  bumpies of unidentified origin \n* mentions a clueless boyfriend or husband",
   "created_utc": 1691960205,
   "score": 8,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw21ev9",
   "message": "Yes, for a variety of reasons:\n\n\\- The night I lost my virginity I was initially asked to form part of a threesome, to which I declined. I went home, later I learnt the other guy also left, was asked again (this time just as a couple) and agreed.\n\n\\- I matched on tinder and did some sexting but it never got to the point of actually meeting for having sex, then for circumstances we lost contact. Shortly after she contacted me again but I was in a monogamous relationship by the time. Years later she contacter me again but I was just starting a different monogamous relationship, it was a bit embarrassing.\n\n\\- Once a girl straigh-up opened asking to snort cocaine from my erect penis. Not even \"hy\", just... that.\n\n\\- I once was knowing someone and quickly realized they were in a very vulnerable position so I decided to keep it as just friends. In retrospect it was a very good call.\n\n\\- I knew someone, then kept talking and decided I wasn't that into her.\n\n\\-  Sometimes I go to gay bars and get understandably hit on by gay men. Flattered but no into it.\n\n\\- I don't know if this one counts but I was once assaulted by a prostitute. She just approached me, grabbed me by the arm with one hand and by my crotch with the other, and tried to seduce me. I know she wasn't doing it for pleasure but it was a very uncomfortable experience.",
   "created_utc": 1691962247,
   "score": 8,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw29s69",
   "message": "The most memorable one for me was when she opened her legs and it smelled terrible. I just put my pants back on and left. She texted “I can take a shower, come back!”. I just blocked her lol. Gotta do the self check people; the scratch and sniff technique hahaha! \n\nMaybe she did and was used to the scent, which is worse cuz that means it was an ongoing problem for a while.",
   "created_utc": 1691965620,
   "score": 9,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1lu73",
   "message": "I don't drink much so I'm usually the designated driver. This usually ends up with women wanting to take home the man that looks put together. Meanwhile they're lopsided and I feel like I'd catch a charge or two.",
   "created_utc": 1691956240,
   "score": 38,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1v5l9",
   "message": "How is this exceptional? In which world would you have sex with everyone you cross by that is proposing? How can you expect to be interesting for someone with standards, if you don't even have standards for yourself? Male here, and waiting for the downvotes..",
   "created_utc": 1691959796,
   "score": 35,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw205mi",
   "message": "Yes.  My wife and I had a guest staying the night, the kind that snoops and listens to hear if people in the house are having sex - then embarrasses them about it the next day.  \n\nMy wife randomly texts me nudes from the bedroom after everyone went to bed.  She didn't know (at that time) this person had those habits.  I was in the TV room making sure no one \"snooped\" until I could hear their distinctive snoring.  I got the texts from my wife, wanted to take advantage since she doesn't often send naughty pics, but didn't feel like it and declined because we had company (which never stopped us before).  My wife, like most social and attractive women, was not used to being rejected.  She genuinely wanted to make sure I was ok so I had to explain to her in detail why.  She was a little weird out too.",
   "created_utc": 1691961740,
   "score": 17,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1tecc",
   "message": "yes\n\nbecause after 40 years of marriage, sometime you do and sometimes you don't want sex.",
   "created_utc": 1691959120,
   "score": 8,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1x5ok",
   "message": "She had dingleberries. Funky doo doo.",
   "created_utc": 1691960559,
   "score": 8,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2ce1m",
   "message": "Yes.\n\nThere was a very promiscuous girl that I worked with in retail, and she had four kids (two from a fellow worker) and the others to different guys. All of her children were under the care system.\n\nOne night, she invited me over for a drink and made a move on me. She proceeded to take off her top, and I told her I wasn't interested. She was trying to get pregnant, as she said.",
   "created_utc": 1691966710,
   "score": 8,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1rogc",
   "message": "Yes…any number of times. Reason? Simple, I wasn’t into the person who wanted to have sex with me.",
   "created_utc": 1691958464,
   "score": 6,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1rxwi",
   "message": "Yes, I remember I had a headache so bad it felt like my head was going to explode. Sex was the last thing on my mind but my GF was horny. I tried but it just made my headache worse. Had to refuse her. She was pretty annoyed 😂\n\n\nAlso refused a GF when she had a cold. That was one of the hardest things I ever did.\n\nI also turned down an ex who kept taking advantage of me. She’d break up with me however she wanted then come crawling back. I’d take her back every time because the sex was great and I was desperate for affection at the time. A few months of therapy finally gave me the strength to shoot her down",
   "created_utc": 1691958566,
   "score": 7,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1uj7h",
   "message": "I was given some advice by a bartender friend whom I followed around when he changed bars.  He was fairly new to this particular bar and it was my first time in there myself.  He said “don’t plant your watermelons on a hill”, later that night the other bartender (female) whom had been flashing her tits anytime someone wanted to see them (I guess provided they were getting a drink?) came over and was spending a good deal of time talking to me, and being the guy that I was, I was hitting on her.  After a few minutes she had to step away to serve another customer, and my friend came back over and pointed at the female bartender and said “that’s a hill”.",
   "created_utc": 1691959559,
   "score": 8,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1kob0",
   "message": "Didn’t have protection and didn’t know her",
   "created_utc": 1691955797,
   "score": 175,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1q2vq",
   "message": "Trying to stay faithful",
   "created_utc": 1691957852,
   "score": 6,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw206v1",
   "message": "Cosplay like a little girl and call me “Papi” instant kernel panic and blue screen on the D drive",
   "created_utc": 1691961754,
   "score": 7,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1vy19",
   "message": "The wife and I had an argument. I didn't even want to be in the same room as her at the moment.",
   "created_utc": 1691960096,
   "score": 5,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1zp8k",
   "message": "Yes because I am Le tired",
   "created_utc": 1691961562,
   "score": 5,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw25res",
   "message": "All the time. Cause I’m not a caricature of a man like the media insists on portraying",
   "created_utc": 1691963990,
   "score": 6,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1w04w",
   "message": "A girl I had a crush on for a year or two (we hung out a lot even while I was dating other girls and she just kinda pushed off my advances) we drifted apart as friends for a while and I started working out and dressing better and she kinda let herself go and gained some weight. We ran into each other at a party and she was sloppy drunk and tried to jump me in the bathroom. I said no because I just felt kinda slighted after all that time. She proceeded to follow me up the stairs pulling my pants down and getting aggressive. Finally out of fear of hurting her from shoving her away I just let her do what she felt like doing, which was putting my flaccid dick on her tongue. I laughed watching her try to get me up and she finally just got mad and stormed off. \n\nTLDR it was kinda rapey and I wasn't having it.",
   "created_utc": 1691960118,
   "score": 12,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1q5mj",
   "message": "They were to drunk to consent.",
   "created_utc": 1691957881,
   "score": 11,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1t7dc",
   "message": "my then-girlfriend had started witholding sex because she was mad that I wouldn't completely cut my friend circle out of my life, so I decided to not even talk to her - in the same house as her - for the next 3 days. She eventually asked me to follow her into the shower and I told her no.\n\nWe broke up shortly after.",
   "created_utc": 1691959044,
   "score": 12,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1vct8",
   "message": "At a work party i offer to take one of the girls home because she was drunk and started vomiting everywhere. I was sober so i drove her home we sat in her driveway talking, she jumps on top of me starts kissing my neck i tell her to stop because she’s drunk and she’s says it’s okay my bf is not home ( I didn’t know she had a bf ) I push her off and tell to go inside.\n\nShe stops talking to me after that 🫡",
   "created_utc": 1691959871,
   "score": 8,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1nj2m",
   "message": "Lack of interest",
   "created_utc": 1691956882,
   "score": 4,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1s3nf",
   "message": "She was very attractive, I was very much interested, but there was one issue - she was in a serious relationship for 5 years. I said no, she tried to force herself on me. I ran away.\n\nThere's more to this story but I don't think it's relevant.\n\nOh, there was also the time an ex told me she had no feelings for me in a phone call, but that we could keep being in a relationship! I was hurt, told her \"no\", and she told everyone that I dumped her 🤷‍♂️",
   "created_utc": 1691958627,
   "score": 4,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1urux",
   "message": "Yes, because she was my first adult girlfriend where sex was a major part of the relationship.  We had gone months of having sex at least once and usually twice a day and it got to the point where I just wanted to go to bed early and sleep.",
   "created_utc": 1691959650,
   "score": 4,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1wrl8",
   "message": "Twice. First time it was with a girl who i had dated for a short while. I was about to leave for college when i realized she wanted smth more serious. I did not want to have sex with her, and then leave in the next week, so i said no. I still feel bad because i never explained why and i think she thought i was unattracted to her, which was very not true.\n\nSecond time it was also with a girl i was dating. I did not see the relationship going long term bc of differences, so i didnt want to be her first time. Felt like it would be wrong. So when she asked, i said no",
   "created_utc": 1691960407,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw29x8b",
   "message": "He was a nice bloke but I had a girlfriend and also straight",
   "created_utc": 1691965679,
   "score": 4,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2ahoh",
   "message": "Yes.\n\nShe was my ex from hs and I know how careless she was with sex back then.\n\nI was honestly scared of catching something and I'd already been in there so I knew what she brought to the table.",
   "created_utc": 1691965913,
   "score": 4,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2carg",
   "message": "I can’t stand it when my wife is hammered, it’s a no go for me and that’s happened quite a few times where I’ve put a stop to the advances.",
   "created_utc": 1691966671,
   "score": 4,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1zfgn",
   "message": "I had just eaten a shit ton of Double Stuf Oreos and felt like I was going to die.",
   "created_utc": 1691961454,
   "score": 8,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1m80u",
   "message": "Possibly, I once declined to let someone \"borrow my lips\" \n\nBut there are a few ways that could be interpreted and I wasn't sure which was accurate",
   "created_utc": 1691956379,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1vbwa",
   "message": "Was tired and not in the mood, i don't know why some comments have to explain themselves like it's a sin or something...",
   "created_utc": 1691959862,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1zjzu",
   "message": "Because I am married",
   "created_utc": 1691961503,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw20lp9",
   "message": "Couple of times while i was doing Ubereats i was invited in... one was straight up a crazy and the other was said she was a nurse but was so far out of it that i am not sure she was aware she was wearing cloths... Covid times made hermits out of a lot of people",
   "created_utc": 1691961919,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw20oga",
   "message": "Because I’m married",
   "created_utc": 1691961950,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw223c9",
   "message": "not saying that i refused sex directly, but i was alone with one of my flat mates's gf, and she was inviting me to have wine because \"she was bored\".\n\nNeedles to say i turned her down, i just could not see myself in the guy's position, being at work and your gf doing \"fun\" things with a different dude.",
   "created_utc": 1691962519,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2bpw9",
   "message": "Yes because she had a bigger dick than me",
   "created_utc": 1691966427,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2ema4",
   "message": "Yes, and the most recent time... I said no, then passed out shit faced drunk and woke up to two girls trying to put my flimsy, barely hard junk inside one of them.\nI asked what was happening and said I didn't want to do this. Rolled over and passed back out. Woke up, and they were both gone\n\nSoo ladies and gents, it doesn't matter your sex. Your private parts still react to stimulation even if you're not even aware of wtf is happening",
   "created_utc": 1691967641,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2f14p",
   "message": "Yes. A few times. One that stands out was an attempted rape.\n\nA friend called me over for some support after a breakup. Half a bottle of wine later and she's suddenly half-naked and jumping on me. After trying to get her off me without hurting her (she was pretty petite) for 10 minutes I tried to storm off. Only to find all the doors locked. I forced my way out through a window and never spoke to her again.",
   "created_utc": 1691967813,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2f5uh",
   "message": "Yes and dodged bullet. I was 14 a virgin. I had a girl over in my bedroom and we were heavy petting so she asked me to have sex? We didn't have condom she said that she couldn't get  pregnant because she wasn't ovulating. I turned her down she went down the street and had sex with a friend. Surprise he became a daddy!",
   "created_utc": 1691967868,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2fuwf",
   "message": "I don’t wanna set a double standard. I won’t sleep with a girl who has an outrageous body count, so I shouldn’t have one myself.",
   "created_utc": 1691968163,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2gcjo",
   "message": "Found out she was withholding sex as a way to punish me or to get what she wants. She didn't know she was dealing with sex camel. I can go months or years without it. There's no bigger turn off than a woman who treats sex like the carrot at the end of the stick.",
   "created_utc": 1691968369,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2mdx0",
   "message": "Yeah I was at a bar once in my early 20s and this chick was super aggressive. Like if it was a guy towards a girl it would be sexual harassment.",
   "created_utc": 1691970990,
   "score": 3,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1kht3",
   "message": "She was on her period and I'm just not into that",
   "created_utc": 1691955729,
   "score": 15,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1sdfi",
   "message": "As a (mostly) straight-ish man, I have had multiple men offer to give me a blowjob.  Friends, coworkers, and clients.  I'm an average guy, with an apparently *really* tasty dick.\n\nAnd I did turn them all down cause it would have been weird.  Not cause they were guys, but because of our preexisting relationships.",
   "created_utc": 1691958731,
   "score": 4,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1vnbs",
   "message": "Loads of times, always me doing the work, last time I said I’m not in the mood to burn 1500 calories hauling what feels like a corpse around.  Rather have a hot chocolate and read a book",
   "created_utc": 1691959982,
   "score": 6,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1wuni",
   "message": "Yup. Literally because I didn't feel like it. Sex isn't an obligation when it presents itself.",
   "created_utc": 1691960440,
   "score": 4,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw20p7h",
   "message": "Yes. I was 30, she was 65 ish. She was nasty too. She asked me if I wanted a blowjob and I'd pay her. Um no. I'm not sleeping with an elderly prostitute. Then she followed me home, gave me a sob story, and asked for a dollar. Then offered a blowjob again.\n\nAnd I've had two dudes hot on me. One guy offered ME money to fuck me. I'm not gay, so I turned it down. And tu second guy was a month back.",
   "created_utc": 1691961958,
   "score": 5,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1wujl",
   "message": "I was trippin balls in CO on my bday. A friend of mine threw me a big party at a bar. I was new in town, so other than a few friends I didn't know anyone. My friend and I ate some L together and her and I didn't tell anyone else. It was a popping Saturday night and to make me feel welcome my friends had a group of maybe 30 people. All of them were pretty awesome and welcoming. One was a little too welcoming. I was tripping really hard on some good L and this one girl kept making eyes at me. She wasn't my type. That's OK. Also, I was literally tripping balls. After I get done BRINGING THE MOTHERFUCKING HOUSE DOWN by performing \"Under the Sea\" from the Little Mermaid on karaoke, this girl started getting really aggressive. It was extremely uncomfortable and although kind of funny to my friends at first, even they got weirded out. She kept telling me not to be scared of her, which literally just terrified the ever-living shit out of me. After turning down her advances multiple times, a few friends said we were all heading out to a party and a group loaded her up and got her the hell away from me. 9/10 night overall though. Would have been a 10/10 if not for being sexually solicited by a terrifying woman made more terrifying by lsd. \n\nThat Under the Sea though? Never in my life have I seen a group of rednecks, homeboys, Latinos, and hippies all so united in happiness. If only for 3 minutes, it felt like the whole world was together, man. It was truly beautiful!",
   "created_utc": 1691960439,
   "score": 5,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1t9g9",
   "message": "Sure, either I was in a relationship or didn’t find them attractive.",
   "created_utc": 1691959067,
   "score": 2,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw1zui8",
   "message": "Sometimes we just want to be left alone, but yes.  Other than that, I’ve refused sex a number of times.  Mostly when I was in college.  Times when the girl was just WAY too drunk and clearly didn’t know what she was doing.  It didn’t feel right.  On several occasions I took them to their apartment or dorm, put them in bed and left.",
   "created_utc": 1691961619,
   "score": 2,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2137g",
   "message": "Not a man now, but before i discovered i was trans, it was always because I am asexual. And a surprising amount of people don't understand that the words 'I am asexual' means, \"I do not want to have sex with you or anybody else.\"",
   "created_utc": 1691962116,
   "score": 2,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw279g7",
   "message": "I've never been propositioned for sex, but I'm a sex-averse asexual, so always would turn it down.",
   "created_utc": 1691964596,
   "score": 2,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw27je5",
   "message": "I was married, she was tipsy, hot and trying to initiate but she was not my wife.",
   "created_utc": 1691964708,
   "score": 2,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2adob",
   "message": "Yes. It was with my ex-girlfriend, back in 2015 I guess. I remember she wanted to have sex but I really was too tired and needed to sleep. And hey, I would have sex any time with someone I like/love - as long as I have the energy to do it.",
   "created_utc": 1691965868,
   "score": 2,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2aeup",
   "message": "Yes many times. In order to have sex I must have feelings for the person.",
   "created_utc": 1691965881,
   "score": 2,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2bpfr",
   "message": "Numerous times.\n\nBut one example is when I was in college, I went through my Asshole Phase where I treated everyone like shit. There's an epic long story to go with that. But the short version is a girl came into my room, got undressed and hopped in bed with me. I humiliated her and kicked her out of my room. Just to be an asshole. Literally no other reason. She was actually hot and under other circumstances, I probably would've gone for it.\n\nAnother example was much later in life. A girl-spacebar-friend propositioned me. She was getting married in the next few weeks and I guess she wanted one last thrill. I was furious that she would ask for that (A) when we've always been just friends and (B) because I refused to be part of someone else's infidelity.\n\nThere are plenty more but maybe two should be enough.",
   "created_utc": 1691966422,
   "score": 2,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2bqym",
   "message": "Yes. He was an awesome guy but I'm not gay.",
   "created_utc": 1691966439,
   "score": 2,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2f0js",
   "message": "Yes. I had a very physical job with long hours and I literally was just too tired.",
   "created_utc": 1691967806,
   "score": 2,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2f2w7",
   "message": "I was tired and had a headache. Seriously.",
   "created_utc": 1691967834,
   "score": 2,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2f4dh",
   "message": "Because I simply wasn’t in the mood. We all have those days.",
   "created_utc": 1691967851,
   "score": 2,
   "submission_id": "15q84xg"
  },
  {
   "comment_id": "jw2ng9m",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15q84xg"
  }
 ]
}