{
 "submission_id": "15q8wwx",
 "title": "What’s your fetish and how did it develop?",
 "selftext": "",
 "created_utc": 1691957520,
 "permalink": "/r/AskReddit/comments/15q8wwx/whats_your_fetish_and_how_did_it_develop/",
 "score": 65,
 "url": "https://www.reddit.com/r/AskReddit/comments/15q8wwx/whats_your_fetish_and_how_did_it_develop/",
 "comments": [
  {
   "comment_id": "jw1pd1o",
   "message": "Women who smell good.\n\nIt developed from women who smell bad.",
   "created_utc": 1691957581,
   "score": 95,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1to9q",
   "message": "small boobs.\n\nbecause of my neighborlady.",
   "created_utc": 1691959226,
   "score": 59,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw20ci9",
   "message": "Reposting this question every single day and jerking off to the responses.",
   "created_utc": 1691961816,
   "score": 92,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1rs7p",
   "message": "Masochist. I learned it while I was getting mugged. A group of men were beating me. I was like; dang I wish that they would hit me harder. Took a while for me to realize that I was in danger.",
   "created_utc": 1691958504,
   "score": 122,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1wsn7",
   "message": "Had an ex pin my arms under her legs while playfighting and now I'm crazy about facesitting 😂",
   "created_utc": 1691960418,
   "score": 36,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1uw7p",
   "message": "Anal. I think seeing a lot of anal pov porn videos mightve developed it. Also my first time wasn’t vaginal sex. My GF at the time was religious and only wanted it back there. She actually believed that wasn’t real sex. Lol. I didn’t argue with her though. She was letting me put my penis somewhere. I guess that made an impression on me.",
   "created_utc": 1691959697,
   "score": 96,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1vr7m",
   "message": "Sex. \n\nIt developed because I had sex, and liked it.",
   "created_utc": 1691960024,
   "score": 93,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1uaf4",
   "message": "Thigh thigh socks and lace chokers.\n\nI have no fucking idea dude.",
   "created_utc": 1691959464,
   "score": 30,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1phk9",
   "message": "i have a hand fetish and i saw how extremely hot my ex boyfriend’s hands were and i was so turned on by it, i love hands and thinking about how it would be liked to choked with those hands, hands are freaking sexy\n\nedit: hands are sexy when it’s veiny can choke me and grab my and squeeze my boobs",
   "created_utc": 1691957628,
   "score": 56,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1syz3",
   "message": "Panties to the side because I was too horny to wait for her to undress, found it sexy. Face-sitting too, because I love making her feel good and I am a pervert.",
   "created_utc": 1691958957,
   "score": 76,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1ub3o",
   "message": "Spanking. I’m not sure why. One day, it just clicked.",
   "created_utc": 1691959471,
   "score": 20,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1vit3",
   "message": "Something about getting off in public secretly does it for me. I don’t know where the hell it came from but the idea of getting off or getting my partner off somewhere where people can see but have no idea what we are doing just hits the spot.",
   "created_utc": 1691959934,
   "score": 23,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw23xqf",
   "message": "I’m not sure if it’s a fetish but I really enjoy grinding with a guy. It developed just from fooling around with men and experiencing that, and realizing it’s nice. It’s my preferred activity.",
   "created_utc": 1691963254,
   "score": 18,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2jame",
   "message": "Cool Ranch Doritos",
   "created_utc": 1691969637,
   "score": 18,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw20iqz",
   "message": "Sensory deprivation and orgasm delay. For a long time, I've been the one to organise everything in my own life, gotten tired of it, so I've always dreamed of just giving up control and being toyed with.",
   "created_utc": 1691961886,
   "score": 12,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw28gdh",
   "message": "Nice try mom",
   "created_utc": 1691965078,
   "score": 10,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2cum8",
   "message": "Slightly chubby girls (not obese, just curvy). I just think they're super hot, I don't have any sort of psychological explanation. I couldn't tell you how my favorite color developed either.",
   "created_utc": 1691966903,
   "score": 18,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1xhdz",
   "message": "Breastfeeding because two of my favourite things are breasts and food",
   "created_utc": 1691960688,
   "score": 9,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2fsju",
   "message": "Cum fetish. Smeared, swallow.  Ex bf smeared his on my face, thinking he was going to humiliate me. I realized I really liked it",
   "created_utc": 1691968135,
   "score": 8,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw20ub5",
   "message": "feet, hands and ass and thick thighs!\n\nfeet cuz obviously there is some wiring criss-cross in my neurons making the sexual part interact with the feet part. I love smooth, soft and well groomed hands and feet. \n\nFor ass ig growing up I read somewhere that bigger asses and thicker thighs meant higher IQ in girls. So started being attracted to such girls more.\n\nEventually figured it really does turn me on if she has a bigger butt and thicker thighs. Also, had a girl as my best friend in school and we were really close. She had a boyfriend, so I never had such feelings. Now, I realize the emotional bond we shared was much deeper than we thought. I do get turned on by thicc girls. 😊",
   "created_utc": 1691962016,
   "score": 18,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw27q69",
   "message": "Cock worship\n\nWhen I lost my virginity my girlfriend said \"God, you're big\" as soon as I put it in. I didn't realize I was above average until that moment, and yeah... cock worshiping size queens.\n\nAlso, I like thick girls because my high school crush was this Amazonian stoner chick. Death by snu snu vibes",
   "created_utc": 1691964784,
   "score": 7,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2bpqm",
   "message": "Latex/rubber - I blame Batman Returns but who really knows…",
   "created_utc": 1691966425,
   "score": 7,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2jn85",
   "message": "Giving blowjobs/deepthroating and making eye contact. It drives me wild. Dunno how I developed it, but...here we are.",
   "created_utc": 1691969790,
   "score": 5,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1pgb4",
   "message": "My girlfriend. It developed because I got a girlfriend.",
   "created_utc": 1691957615,
   "score": 21,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1q5py",
   "message": "I like being strangled. It's from being suicidal, but without the commitment. I'm fortunate to have a boyfriend who understands and let's me enjoy it while being safe.",
   "created_utc": 1691957882,
   "score": 21,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2ca0d",
   "message": "I love eating ass. Idk. I love it when a female spreads her cheeks and begs me to eat it. Toying at the same time is grand. I guess I’ve always loved ass. I had a teacher that was Ms Florida and she was a smoke show. Sexiest and tightest ass. I always looked up ass (when I started watching porn). I guess she lead me here lol.",
   "created_utc": 1691966663,
   "score": 5,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2cu14",
   "message": "Being dommed by someone who knows how to be a bratty tease. \n\nIt came from anime.",
   "created_utc": 1691966896,
   "score": 5,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2i4vz",
   "message": "Feet. Growing up and discovering my likes and dislikes of kinks i didnt care for feet but after a bit of learning how submissive i am i love to pamper and spoil my partners starting at the  from feet and moving upward.",
   "created_utc": 1691969131,
   "score": 4,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2id6j",
   "message": "Eating pussy. I did it once. Got a good reaction. And now I can’t cum unless my wife does first.",
   "created_utc": 1691969231,
   "score": 5,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2l8ez",
   "message": "Feet. It's not even something I was looking for, or ever even thought of—until they **really** just started to catch my attention one day in early 2020.\n\nIt was just a completely random happenstance.",
   "created_utc": 1691970486,
   "score": 5,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2lxsn",
   "message": "Bondage. It was always there. I tied my barbies up long before I knew what sex was. Lol",
   "created_utc": 1691970794,
   "score": 4,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw20ggx",
   "message": "Beautiful women feet.",
   "created_utc": 1691961861,
   "score": 11,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1wq18",
   "message": "69",
   "created_utc": 1691960390,
   "score": 5,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw23zaf",
   "message": "Which one? Getting spanked, scratched, and treated feminine like despite being a guy. IDK how.\nCertain women's shoes. White is the leader, and it has to be like smooth, clean leather(man made or real and colored). No idea how either. That one started around 18-19.",
   "created_utc": 1691963272,
   "score": 5,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2sd11",
   "message": "not me, but my boyfriend developed a fetish for my stomach. i’m a skinny girl with a little bit of a bigger stomach. nothing abnormally large, but it kinda sticks out because of how it’s shaped. he finds it really cute and fun to play with. W bf honestly",
   "created_utc": 1691973639,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1r7oh",
   "message": "Golden shower, one of my sister friend use let me watch her pee and one day ask if she could pee on me and ever since then it’s my fetish",
   "created_utc": 1691958284,
   "score": 14,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1tyv6",
   "message": "https://reflectivedesire.com/\n\nIt didn't develop, it was always there, when I think about it.",
   "created_utc": 1691959340,
   "score": 6,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1vz2z",
   "message": "Restraint with a touch of pain added.\nDeveloped whn my ex kissed and choked me out in an elevator til I almost blacked out. Couldnt breathe. Felt like I was dying. Wanted to do it again.",
   "created_utc": 1691960108,
   "score": 7,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1vpad",
   "message": "Boobs. Someone said it's because I wasn't breastfed as a child.",
   "created_utc": 1691960003,
   "score": 3,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2iyy4",
   "message": "Being wanted\n\nAfter years of neglect",
   "created_utc": 1691969494,
   "score": 3,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2l8ho",
   "message": "Being talked bad and dirty to while he’s hittin it hard from the back.",
   "created_utc": 1691970487,
   "score": 3,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2eha7",
   "message": "Wait, we are only allowed one?",
   "created_utc": 1691967583,
   "score": 5,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2d51l",
   "message": "Dreaming about death. Developed after the realization what a shit hole this life is.",
   "created_utc": 1691967022,
   "score": 5,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw22gke",
   "message": "I started liking rough sex, it developed after trying rough sex for the first time, I'm very bipolar, I like it slow and romantic sometimes, and rough some other times",
   "created_utc": 1691962666,
   "score": 5,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw25ohe",
   "message": "Cumming on heels",
   "created_utc": 1691963957,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2g2y6",
   "message": "Tall busty redheads with thick thighs. My babysitter Miss Kristie.",
   "created_utc": 1691968258,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2glww",
   "message": "Walking barefoot in public places and showing off my dirty feet. I may be an exhibitionist but because of the conservative east asian laws, I couldn't just strip naked and flash around in public. I also like going barefoot anyway.",
   "created_utc": 1691968480,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2hfqu",
   "message": "i like it when girls burp....A LOT!. i don't remember exactly when i noticed it, but i was about \\~12 years old when i got my first erection because of it. i don't like it when boys or women who are much older\\\\younger than me do it at all!  but I have to say that it is a HUGE turn-on for me when a girl my age or a little older burps. the louder and the longer the burp, the more I get turned on. i don't know if i will ever tell my girlfriend about it, but since i don't have one (i'm only 17 years old), i don't know if i even need to.",
   "created_utc": 1691968833,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2hlm9",
   "message": "Your mom. I did your mom.",
   "created_utc": 1691968902,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2i7x7",
   "message": "The female orgasm.  \n\nThe level of affection afterwards is just so nice and I like to please.",
   "created_utc": 1691969168,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2jrka",
   "message": "I hated feet for the longest time but one time while we were doing the deed my gf started rubbing my thighs with her feet while riding me and it felt so good that it kind of just developed from there",
   "created_utc": 1691969842,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2krye",
   "message": "Intelligence. Spit some facts, and teach me something while you're riding me. Afterwards we can go get coffee and a nice Sammy",
   "created_utc": 1691970284,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2kyfl",
   "message": "Wrestling\n\nI saw was flipping through TV stations and happened to land on a WWE Divas match with Stacy Keibler locked in a Surfboard Stretch. Funnily enough, I was like 8 or 9 when this happened, so it took a few years for anything to actually come of it, but when it did, boy did it.",
   "created_utc": 1691970364,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2lcnb",
   "message": "Feet, facesitting and anal. All developed because i am a pervert.",
   "created_utc": 1691970537,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2nz70",
   "message": "I’m embarrassed even stating this 😂 But recently porn that has the guys penis rubbing the girls clit without penetration and him cumming. Or even when he starts doing that through her panties . Also like when he’s doing it and sometimes just puts the tip in a little , maybe a few full pumps, then back out to her clit 🙈😂 Such a turn on !! I think it might be called edging but could be wrong lol",
   "created_utc": 1691971692,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2ode3",
   "message": "Women who are bookworms. \n\nI'm a woman who's also a bookworm. (Undcover good time as well)",
   "created_utc": 1691971866,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2pctz",
   "message": "Anal. My first real girlfriend let me do it every time we had sex. Also, I somehow I managed to make her squirt on me.\n\nI miss her. Too bad she's married and has a kid.",
   "created_utc": 1691972301,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2prqm",
   "message": "Tickling.\n\nFriend in high school tickled my sides one day, and I got way too excited. Went home and got curious, so I searched tickling videos on the web. Fell deeper down that rabbit hole, and now I'm obsessed, lol.",
   "created_utc": 1691972482,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2qs9x",
   "message": "I like public sex. Animal mind if",
   "created_utc": 1691972930,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2shzr",
   "message": "Small breasts. \n\nI have absolutely no idea why but I think it has something to do with the fact that it’s an insecurity for some women, and making them feel better about it makes me happy?",
   "created_utc": 1691973701,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2srpy",
   "message": "Chicks who can skateboard and do so in sexy outfits. It developed from me seeing that happen lol.",
   "created_utc": 1691973821,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1tdso",
   "message": "1. **Country Girls**. Love the confidence, fashion, accent, and all-around general capability.\n2. **Redheads**. Love the pale skin, freckles, and pubic hair.\n3. **Pin-Ups**. Feel it was the last time in history women were \"naturally\" attractive before things like plastic surgeries and artificial augmenting via fashion became common.",
   "created_utc": 1691959114,
   "score": 5,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2cflj",
   "message": "Beards.\n\nProbably because of the mountain man archetype I grew up with.\nOr simply because of 2012 gay porn with hipsters lol",
   "created_utc": 1691966728,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2dvr1",
   "message": "eating healthy for a 6 days, and having a 16oz bag of chips for a late breakfast.",
   "created_utc": 1691967330,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2gfnz",
   "message": "\nI am not sure, i've always had a small interest  in electricity at least- and what it  felt like, but that opportunity only came once i actually bought some electric shock gag pens , which were cool\n\n-I had wondered a little bit about using them for other purposes....and then i DID once get the opportunity - \n\n\n at one point I decided to, for fun , bring out the shock pens with a person I was dating- and we played with them while playing with each other. We discovered you can do a poor mans body contact probe, (ala violet wand style) by holding a shock pen on the other person with it active, and using your other hand elsewhere to touch them, which would be electrified and the current would run to them. I was surprised when I used them or did this on certain areas (pussy, clit,etc)and it forced her to have REALLY hard orgasms , without fail. It was also cool running my hands over her bicep or leg or armpit or pussy and clit and watching her muscles convulse. But once I got to a erogenous area, the moans were nonstop, every time, and she would be on her way, FAST.\n\nShe then tried the same thing with me- and she starting playing with my penis while electrified, suddenly i felt the orgasm building, STUPID fast, as if i was masturbating, except i wasn't doing anything- and yeah, it worked on me as well, i'd be in a muscle clenching orgasm very soon, feeling the current running through my shaft. We discovered, it's really when you hit the right spots, it drives orgasms fast. It was really unlike anything else, suddenly having that feeling build hard- and then not being able to control the release at all and it was intense like nothing else ,every time. Though it took a bit of experimenting to find the right spots at first. We were even doing things like giving electrified massages with hands, and making out was interesting! It was interesting as well seeing her hit the area around my prostate and watching my penis spasm as if i was clenching that muscle on purpose(I wasn't)-hitting that area especially also triggered me getting hot fast as well....\n\nI miss dating that person- the women i've dated and talked about this with since, didn't have an interest at the time in even trying anything with electricity, (or anything ,actually ) , and that killed all that ,sadly.\n\nI now have more dedicated equipment that BLOWS the old shock pens out of the water when it comes to forcing orgasms,,, (Violet wand and body contact probe,  two estim units so far one of which can play audio thru electricity), and sidenote: When you can control (and adjust) frequency and power level, like with a dedicated Estim box [and have the pads in the right spots ] it does cause that heat of orgasms to come suddenly and build stupid fast, every time. ) but now no girl to play with..\n\nWhich is also why I have a long term goal to find one open to electro play- and just try things similar to what I did before , with the pens -and things i didn't get to.\n\n(electrified oral, playing music through the electricity and massaging someone with it , so they literally feel the music through the current- or electrified sex where both partners share the circuit -and other things like these that let you do insane stuff- and really drive someone wild. And there's the orgasm-forcing effect that only electricity can do)\n\n\nelectro is known to be the one thing that beats *vibrators* in getting people off(, but it's a little cheaty in terms of how- \nThe weak gentle currents spasms muscles in genitals and your erogenous zones, which is an indescribable feeling,  ,the current actually  activates erogenous nerves directly as it goes thru.genitals,  and finally, the electricity goes through you , internally AND externally)\n\n So it shouldn't be a surprise it's kinda intense with all that going on^\n\n\nYes, some turn it up with some devices to where it's uncomfortable and intentionally do pain play  (Analogy: a water stream can be made to be uncomfortable if you make the stream thin aarrow and high power), but personally for me(not into pain play really)- the gentle sensual and other erogenous direct effects of it on people- are *way* too spoiling- and nothing else can stimulate people like this...\n\n\nIt must be one of the least known but weirdest secrets of science  out there; that electricity will get someone off very fast before they realize it, when used correctly. Somehow i suspect no one else will have ever tried something quite like this... Hopefully I can find another 'sparky' someday....who'd have an interest in trying this sort of thing..,...",
   "created_utc": 1691968406,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2jqdq",
   "message": "Abuse and abuse.",
   "created_utc": 1691969827,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2lzlq",
   "message": "I have a fetish for fetishes, especially fetishes of fetishes. I think it developed from other fetishes.",
   "created_utc": 1691970815,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw23qkd",
   "message": "Chubby women. God damn I love chubby women. ❤️ Why? After having sex with a chubby there was no going back. Big boobs, ass and thighs make me go nuts.",
   "created_utc": 1691963176,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1y04t",
   "message": "Big beautiful women with big breasts! My 39yr old step aunt took my virginity when I was 17 and now I am attracted to women that look like her.",
   "created_utc": 1691960892,
   "score": 2,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2c6id",
   "message": "I jerk off to pictures of women in dresses and I'm not ashamed",
   "created_utc": 1691966621,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw274ml",
   "message": "big areolas, saggy tits, piss, facesitting, age play, choking, slapping, facefucking, bukkake, cuckolding, couples sucking cock, spring break/mardis gras, all of the above should be amateur, girl next door, facials",
   "created_utc": 1691964542,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2bpt1",
   "message": "Castration. When is as but a young lad I was exposed to the \"The Ice Pirates\", which has a perilous scene where the male slaves are \"redesigned\", featuring a machine that snatched up their genitals in a claw and bites their cock and balls off. \n\nEver since the jolt of erotic victimhood from viewing that concept, I've enjoyed the fantasy of being non-consensually castrated by a powerful woman.",
   "created_utc": 1691966426,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2bxj1",
   "message": "Daddy fetish/ age gap. I don't know why, but I've ALWAYS been into older dudes.  Don't get it twisted, not incest.  But an older guy that spoils you but will also discipline and dominate you.  I've recently been OK with this fetish.  It bothered me for a while and I would live out the fantasy when my husband and I would swing, but when I read books, I always picture my husband.  I know it's so freaking silly because we have always been so honest about our fantasies, and he knew I had a thing about it because I would clearly go after older men when we swung, but I was scared he would feel weird if I called him \"daddy\" because we're only 6 years apart.  Luckily, he loves it. \n\nIt was never a problem going after older couples because my husband has a milf kink as well.",
   "created_utc": 1691966515,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2807d",
   "message": "Some NTR artist are just too good.",
   "created_utc": 1691964898,
   "score": 0,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw1wx6k",
   "message": "Spitting in her mounth, cuz when i was a child\nI spit on my pets mounth",
   "created_utc": 1691960466,
   "score": 249,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2evot",
   "message": "Females but I think they don’t exist",
   "created_utc": 1691967750,
   "score": 255,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw27e9b",
   "message": "- Dominance.\n\nIt came about due to the extreme lack of control I had growing up.\n\n- Daddy Kink\n\nIt came about due to wanting to provide acknowledgement, comfort, and understanding to others the way I wish it had been given to me.\n\n- Lingerie (choosing what my partner wears, not panty sniffing)\n\nSimilar to the lack of control bit, it's a fettish due to the power associated with getting to see something not many people get to see. The exclusivity makes me feel special and gives me a certain sort of sense of power.",
   "created_utc": 1691964650,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw29rt1",
   "message": "Exhibitionism. Started when I was young. Being naked outside gave me a thrill. I love for my wife to \"show me\" when we are out.",
   "created_utc": 1691965615,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2dpyp",
   "message": "Dominant women. Idk i just like to feel protected",
   "created_utc": 1691967263,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2f3ad",
   "message": "Pup play, I saw a guy at a gay bar with a hood on and thought wow he is hot and here we are now.",
   "created_utc": 1691967838,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2fbuk",
   "message": "Once you go squirrel you never need a girl",
   "created_utc": 1691967939,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2h4ip",
   "message": "I have this fetish for girls in fur coats",
   "created_utc": 1691968701,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2i81y",
   "message": "Really small boobs, no idea why, and biting, because if done right, just hits different, and honestly, being straddled. Gf does it to me, so hot, and last one, really sharp nails and teeth\u0026lt;3",
   "created_utc": 1691969169,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2j7zk",
   "message": "Loose-fitting clothes. Specifically dress shirts that aren't buttoned up all the way.",
   "created_utc": 1691969605,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2jaua",
   "message": "Which one?",
   "created_utc": 1691969640,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2jncl",
   "message": "Is it vanilla if all that matters is if they're extremely hot?",
   "created_utc": 1691969791,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2knoa",
   "message": "Oh let’s see I have a few. Pantyhose and thigh highs because I had an amazingly hot fifth grade teacher who always wore skirts and hose. Once we were working in groups building a bridge out of tooth picks, sitting on the floor. She had bent over to help one group and I saw up her skirt and was enamored by the way the hose looked over her panties.\n\nGroup sex. Hooked after my son to be ex wife and I had our first three some eleven years ago. \n\nRough sex. Soon to be ex and I dated a girl who was very into being used roughly and I learned how much I enjoyed it.",
   "created_utc": 1691970232,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2luod",
   "message": "Public/Quickie stuff. \n\nJr year of highschool after the homecoming game of football. Cheerleader said let’s get it. We got it lolo",
   "created_utc": 1691970755,
   "score": 1,
   "submission_id": "15q8wwx"
  },
  {
   "comment_id": "jw2tued",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15q8wwx"
  }
 ]
}