{
 "submission_id": "15q98q9",
 "title": "What’s an unusual fact that most people don’t know? (serious)",
 "selftext": "",
 "created_utc": 1691958328,
 "permalink": "/r/AskReddit/comments/15q98q9/whats_an_unusual_fact_that_most_people_dont_know/",
 "score": 144,
 "url": "https://www.reddit.com/r/AskReddit/comments/15q98q9/whats_an_unusual_fact_that_most_people_dont_know/",
 "comments": [
  {
   "comment_id": "jw1rbxv",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1691958328,
   "score": 1,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw1sbs4",
   "message": "Portugal is the world's largest producer of cork.",
   "created_utc": 1691958714,
   "score": 31,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw1z1fb",
   "message": "When someone gets a kidney transplant they generally just cram the new one in and don't take out the old ones. So the person ends up with three kidneys.\n\nMore eels swim out of the Bermuda Triangle than swim into it.",
   "created_utc": 1691961299,
   "score": 95,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3bm5k",
   "message": "Wearing white wedding dresses only came into fashion after Queen Victoria started the trend. White isn’t meant to have any other meaning or represent purity as many people think. Before this trend most brides just wore their best dress of any colour as it was expensive to buy a dress just for the occasion.",
   "created_utc": 1691982612,
   "score": 251,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw312go",
   "message": "Pink used to be a masculine color. \n\nDuring the height of the British Empire, the soldiers in the far reaches of the world donned their red coats in battle and patrol. The newer recruits would look especially sharp with a bold red color. The rugged war-heroes though? Their coats were faded and worn into more of a pink color. If you saw a guy wearing a pink coat, odds are they have stories to tell with a thousand yard stare. This became a desirable thing to show off your experience and grit.\n\nHence pink was associated with combat prowess and ruggedness, and became a masculine color during that time.",
   "created_utc": 1691977592,
   "score": 105,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw2fq49",
   "message": "A day on Venus (one complete rotation around its axis) is longer than a year (a complete revolution around the sun) on Venus.",
   "created_utc": 1691968106,
   "score": 170,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3evdy",
   "message": "When going to surgery for a gunshot, we don't typically search for bullets. The body will encapsulate it to protect itself.",
   "created_utc": 1691984289,
   "score": 117,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3729r",
   "message": "The average fully grown horse puts out around 14 horsepower",
   "created_utc": 1691980372,
   "score": 163,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw20ahc",
   "message": "Buzkashi is a popular Afghan sport played with the decapitated corpse of a goat.",
   "created_utc": 1691961794,
   "score": 110,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3irj8",
   "message": "I love when this question comes up because I get to talk about the thunder clappers. \n\nWhen the Lewis and Clark expedition were exploring the west of North America, their diet of dried meat left them constipated. They were all taking these pills called thunder clappers to make themselves shit. The active ingredient in thunder clappers is mercury, and historians can track the expedition because they left increased deposits of mercury in the soil.",
   "created_utc": 1691986409,
   "score": 241,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw2odi2",
   "message": "Warm lemons rolled between the table and your palm give the most juice.",
   "created_utc": 1691971867,
   "score": 192,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw39h3s",
   "message": "The tongue  of a blue whale weighs the same as a fully grown African Elephant",
   "created_utc": 1691981542,
   "score": 120,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw2uua4",
   "message": "Abalones (a snail) have 5 assholes.",
   "created_utc": 1691974750,
   "score": 80,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw35th7",
   "message": "Syracuse NY has the only upside down traffic light in the world, where the red light is on the bottom and green is on the top.",
   "created_utc": 1691979774,
   "score": 74,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw1xeyr",
   "message": "Iron is the most stable atom in the universe.  When fusion in the sun's core 'burns', it fuses *up* the period table until it reaches iron.  From that point, fusion really isn't generating any more energy and the core collapses.\n\nFrom the other side of things, all elements heavier than iron eventually fission down to iron (though i grant you, it may take a *very* long time, even at cosmological timescales).\n\nAtoms are perceived to be everlasting and timeless.  That's technically not *really* the case over the very long term except for iron.  This is why, if I ever get married I'm going to request an iron wedding band.  If I want a timeless representation of my love I can think of nothing better, than something that will last, (even if only elementally) to the heat death of the universe.",
   "created_utc": 1691960661,
   "score": 74,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw2wotw",
   "message": "Frogs swallow with their eyeballs. They use their eyes to help them push the food down.",
   "created_utc": 1691975591,
   "score": 70,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3hrfm",
   "message": "Sprinkling powdered sugar on a prolapsed anus will cause it to retract back into place.",
   "created_utc": 1691985845,
   "score": 66,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw38iu6",
   "message": "McDonald's engineered bubblegum flavoured broccoli in an attempt to get kids to eat more vegetables.\n\nThey still didn't want to eat it.",
   "created_utc": 1691981080,
   "score": 95,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw2t7ox",
   "message": "LEGO manufactures more tyres than any other company on the planet.",
   "created_utc": 1691974021,
   "score": 124,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3wn34",
   "message": "The Korean people have an enzyme that makes us have dry ear wax and a propensity to lack body odor.\nFor the first 20 years of my life I had no idea why my earwax was flaky when everyone else's was more like a jam or paste and why I didn't have to wear deodorant.\n\nI'm not saying that Koreans are immune from body odor but it is much less prevalent and requires much more disregard for hygiene.",
   "created_utc": 1691995535,
   "score": 34,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3leov",
   "message": " The male giraffe will continuously headbutt the female in the bladder until she urinates. The male then tastes the pee and that helps it determine whether the female is ovulating. If she is, it’s business time.",
   "created_utc": 1691987941,
   "score": 61,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3r0ui",
   "message": "Each time I read a question like this I am reminded of this, \n\nIf you made 10,000 dollars everyday since the signing of the Declaration of Independence in August 2, 1776, you still wouldn’t wouldn’t have 1 billion dollars.\n\nAnd it is just mind boggling!!",
   "created_utc": 1691991507,
   "score": 62,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3vjho",
   "message": "A quarter of the population of Iceland is part Native American because when Lief Ericsson landed in Newfoundland, he brought one Native American woman back with him.",
   "created_utc": 1691994701,
   "score": 26,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw1s5oe",
   "message": "Octopuses have a brain in each of their tentacles as well as a main one in their body.",
   "created_utc": 1691958649,
   "score": 71,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3isy4",
   "message": "In the 1880s the battlefield at Gettysburg was such an popular tourist destination that the railroad company built a funfair with a merry-go-round next to Little Round Top.",
   "created_utc": 1691986432,
   "score": 20,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3ixjs",
   "message": "Laura Bush killed a guy.",
   "created_utc": 1691986506,
   "score": 22,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3ko91",
   "message": "Wombat poos are cube shaped.",
   "created_utc": 1691987508,
   "score": 23,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3lc0y",
   "message": "Bluetooth is named after Danish King “Harald Bluetooth “",
   "created_utc": 1691987896,
   "score": 22,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3voel",
   "message": "In WWII, the American navy had barges with ice cream bars on them visit soldiers in the Pacific after battles as a way of boosting morale.",
   "created_utc": 1691994805,
   "score": 20,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3qo0n",
   "message": "The raw image we see with our eyes is actually upside down. Our brains subconsciously flip it back to the correct way.",
   "created_utc": 1691991273,
   "score": 20,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3y042",
   "message": "The Rodney King beating was only recorded because the man who filmed it was trying to record the shooting of what would be the Bad to the Bone scene in Terminator 2 at the biker bar. The full length version of the Rodney King video features Arnold Schwarzenegger, while Terminator 2 has some of the Rodney King cop cruiser lights visible in the background.",
   "created_utc": 1691996558,
   "score": 17,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw33enl",
   "message": "Echidnas hatch from eggs.",
   "created_utc": 1691978662,
   "score": 54,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw2h4tn",
   "message": "The average person is woefully underrepresented when asked to name an unusual fact.",
   "created_utc": 1691968705,
   "score": 62,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw1w6kt",
   "message": "Medical students commonly learn how to administer pelvic exams by practicing on unconscious patients, often without first obtaining explicit consent from patients to do so. While 21 states currently have laws that require teaching hospitals to obtain consent from patients to participate in this educational experience.",
   "created_utc": 1691960187,
   "score": 87,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3rxb3",
   "message": "Whale milk is the same consistency as toothpaste.",
   "created_utc": 1691992123,
   "score": 14,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw49quf",
   "message": "I have recently learned that Lobsters don't display senescence which is the deterioration of the body as it ages. Their bodies are continuously growing and their exoskeletons get heavier and heavier, hence when they molt into a new exoskeleton it takes more and more energy to take off the old one. Eventually they die because one day they just go, \"Yeeeeeaaaah sooo like this exoskeleton is too heavy so imma just go meet Lobster God and head out from the mortal world.\"\n\nNow a thought... If a group of people helped a lobster shed it's exo- skeleton... And if said lobster kept growing... Technically, a giant lobster could be brought into existence should the lobster not die from old age.",
   "created_utc": 1692005730,
   "score": 13,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw2ycwy",
   "message": "The average person has slightly less than two legs.",
   "created_utc": 1691976343,
   "score": 25,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3du6o",
   "message": "It’s possible to lactate without being pregnant",
   "created_utc": 1691983750,
   "score": 24,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3l7tk",
   "message": "Bone marrow transplant, it’s possible blood type may change to the donors blood type",
   "created_utc": 1691987828,
   "score": 25,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw34yhd",
   "message": "Koalas have bifurcated penises and vaginas",
   "created_utc": 1691979370,
   "score": 11,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3qe8r",
   "message": "Most wasabi in tiny packets is just horseradish coloured green",
   "created_utc": 1691991091,
   "score": 11,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3efkn",
   "message": "The average number of skeletons in the human body is greater than 1 (but less than 2)",
   "created_utc": 1691984060,
   "score": 46,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw1rs50",
   "message": "If you were to scale an atom of average mass to the size of our solar system, where the Nucleus is the Sun, then the space between the Nucleus and the orbiting electron field would be about 16 times farther than the distance between the Sun and Pluto.\n\nNow imagine all the atoms around you. Basically everything you think is solid is actually mostly empty space.",
   "created_utc": 1691958504,
   "score": 20,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3fuwf",
   "message": "A small child has all of the permanent teeth right above the temporary ones. You can look it up. It’s very terrifying",
   "created_utc": 1691984813,
   "score": 23,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3ix0p",
   "message": "If you have all ten toes and all of your fingers and thumbs still attached, you statistically have more than the global average.",
   "created_utc": 1691986498,
   "score": 21,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw2wdlc",
   "message": "A day on Venus is longer than a year on Venus.",
   "created_utc": 1691975447,
   "score": 9,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3mcpk",
   "message": "People with diabetes often have pee that tastes incredibly sweet. Generally this is in poorly or not controlled cases, where they end up with excess glucose (sugar) in their urine due to the body's inability to process it, so it goes ahhh that's waste let's pee it all out.",
   "created_utc": 1691988511,
   "score": 9,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3ewr2",
   "message": "Crabs in the river think fishes are flying",
   "created_utc": 1691984309,
   "score": 39,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw2b1bq",
   "message": "There are more Lego mini-figures than there are people on Earth.",
   "created_utc": 1691966142,
   "score": 27,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3nasj",
   "message": "Neptune is actually a warmer planet than Uranus!\n\nDespite being about a billion miles away from Uranus on average, it is warmer not because of sunlight, but because of internal heat! This internal heat is what kicks up the intense winds and storms on Neptune!",
   "created_utc": 1691989091,
   "score": 8,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3iq34",
   "message": "Cocaine was found in the White House recently and the secret service investigation was closed without any suspects despite it being found in an area in view of multiple cameras.   \nSomeone in power got crunk af",
   "created_utc": 1691986386,
   "score": 45,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3b25u",
   "message": "Shaq only scored one 3-pointer.",
   "created_utc": 1691982331,
   "score": 8,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw4femx",
   "message": "We are always seeing our own nose but the brain ignores it",
   "created_utc": 1692009785,
   "score": 7,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3feau",
   "message": "There are over 1400 species of cockroaches. They range from 1/4 inch to 18 inches in length. Many of them fly. In a nuclear holocaust, roaches will survive.",
   "created_utc": 1691984568,
   "score": 14,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw1rrq1",
   "message": "That people think about themself most of the time, so you should also put yourself first.",
   "created_utc": 1691958499,
   "score": 37,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3hgov",
   "message": "The Najaf cemetery in Iraq is the largest in the world, spanning about 1500 acres and containing millions of bodies.",
   "created_utc": 1691985679,
   "score": 7,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3vg5h",
   "message": "Flamingos can drink boiling water",
   "created_utc": 1691994634,
   "score": 5,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw29llm",
   "message": "We are all made up of cosmic dust that spread throughout the cosmos after the big bang. And now, billions of years later, you are sitting and reading this and probably don't even realize that you are made up of stars and other dust.",
   "created_utc": 1691965543,
   "score": 27,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3ek40",
   "message": "You never move your upper teeth, its the jaw",
   "created_utc": 1691984126,
   "score": 14,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw40jtc",
   "message": "The World's first animated movie, the World's first radio broadcast, and the World's first fingerprint identification, happened in a place you wouldn't expect. That place is the Republic of Argentina.\n\nThe battery was invented in 1800, but the lightbulb was not invented until 1879.\n\nThe World's highest mountain, is actually Mount Chimborazo in the Republic of Ecuador.\n\nThere are more French timezones than any other, totaling to 12 French timezones.\n\nGreenland, the largest island on Earth, is actually larger by landsize than the United States of Mexico. This means that in regards to landsize, the Kingdom of Denmark in a way is the 3rd largest nation in the North Region of America, while the United States of Mexico is the 4th largest by landsize in the North Region of America. Greenland is also 1.26 times larger than Alaska by landsize.\n\nAdding to the previous fact, the Mexican GDP is the 14th highest in the World. This makes the Mexican GDP higher than the Dutch GDP, which is only the 19th highest in the World.\n\nThe train was invented 83 years before the bicycle.\n\nThe oldest customer complaint, dates back to before we had writing utensils and paper. It was written in a stone tablet.\n\nThe origin of marbles is actually unknown.\n\nThe Braille System was invented in 1824. Morse Code and the telegraph were not invented until the 1830s, and the typewriter was not patented until 1868.\n\nThe Simpsons is older than the Czech Republic. The Simpsons aired in December 1989, while the Czech Republic did not exist until January 1st, 1993.\n\nBlack Panthers don't actually exist. Many people argue that they exist, but they don't. Black Leopards and Black Jaguars exist, but they are not a Subspecies or separate Species.\n\nThe first movie ever made, was made in the 1880s. The radio was not invented until 1893. This means that movies are older than radios.\n\nSpain was founded as recently as 1479. 14 years later in 1493, only a year after Columbus sailed, Spaniards reached the American island of Saint Martin. Then some time later, the Spaniards left Saint Martin. When other Europeans arrived, the Spaniards returned to kick them all out, but then left again, as the salt on Saint Martin was of no profit or necessity to the Spaniards.\n\nThere was only ever one female Chinese Monarch to rule China, when China was still under Monarchy rule.",
   "created_utc": 1691998518,
   "score": 11,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3tfmj",
   "message": "For any creative domain, the square root of people operating in that domain, do half the productive work",
   "created_utc": 1691993175,
   "score": 5,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3yl1r",
   "message": "Certain species of jellyfish are literally immortal and can not die from natural causes.",
   "created_utc": 1691996993,
   "score": 6,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw42tbn",
   "message": "That the reason people sneeze when they go outside into the bright sunlight is that---- in some people, in the first weeks of forming as a fetus when the brain and other organs are being formed, that the optic nerves are formed close the olfactory bulb in the brain.\n\nSo when someone whose optic nerves lay close to the olfactory bulb in the brain goes outside into bright sun (or other high light conditions) the bright light excites the optic nerve and as it lays close to the olfactory bulb, the bulb is excited from strong nerve impulses in the optic nerve. And that makes some people sneeze.",
   "created_utc": 1692000306,
   "score": 4,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw43nwu",
   "message": "Australia has almost 12,000 beaches along its 60,000km coastline. If you visited one per day, it would take more than 32 years to see them all. However, it is suggested that you plan for three or four days in each destination so your probably too late.",
   "created_utc": 1692000973,
   "score": 6,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw4ag09",
   "message": "Everyone has hemorrhoids, they're not pimples on your butt like I used to think, but are actually tge name of the muscles you use to push out your poop.\n\nIf you don't eat enough fiber, or really push too hard when pooping (drink more water!) You can inflame and irritate those muscles.",
   "created_utc": 1692006260,
   "score": 4,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3cp6y",
   "message": "A pregnant goldfish is called a twerp",
   "created_utc": 1691983165,
   "score": 12,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3wfnz",
   "message": "James Drummond Dole was an American businessman who convinced the US to annex Hawaii simply so that he could create pineapple plantations there. Previously, pineapples had been a very rare commodity that only the wealthy could afford but because of the US annexation of Hawaii, the market became rapidly oversaturated by a sudden increase in the availability and plenty of this rare fruit. James Dole himself was called the Pineapple King as he controlled more than half of the entire world’s pineapple production. He was also the founder the the Dole Food Company. The same one that still sells little cans and cups of pineapple today.",
   "created_utc": 1691995378,
   "score": 4,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw45tbc",
   "message": "There is a reaction with UV sensitive chemicals in some fruits that causes extreme blistering. One of the most common culprits is slicing limes in the sunlight, and is called phytophotodermatitis, or a \"margarita burn\".",
   "created_utc": 1692002671,
   "score": 4,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw48slx",
   "message": "There are more tigers kept as pets in the USA than there are in the wild",
   "created_utc": 1692004997,
   "score": 5,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw4cjc4",
   "message": "When you bite your tongue by accident it hurts but not if you do it consciously, and chances are you are biting your tongue right now",
   "created_utc": 1692007793,
   "score": 4,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3nbn5",
   "message": "In Sweden it's required by law that every home have a bomb shelter",
   "created_utc": 1691989106,
   "score": 5,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw40119",
   "message": "Cracker Barrel is scamming it's customers with the BYO\n\nI used to work at CB and they intentionally make their menu text small to make the \"create your own\" options more pleaseable, as these are usually in a bigger, bolder front and in a big old yellow box to make it more visible. They do have larger-print options available but the menu is hard to read and poorly formated, so people (mostly old people with bad vision) who don't go to CB much will be drawn to the BYO which is 5-10 more dollars than the other options on the menu.\n\nAlso, they sell hella jackets (these are 40 USD+) even in the summer by intentionally making the restaurant cold. I've worked there in Texas during June and July and the poor old people would have to buy a jacket from the store because inside was 60ish degrees with fans blasting down on them.",
   "created_utc": 1691998108,
   "score": 3,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw45kc4",
   "message": "Ducks.... Rapists .",
   "created_utc": 1692002472,
   "score": 3,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw4boo6",
   "message": "Dragonfly's have the largest predator sucess rate of any animal by a HUGE margin. If they try to kill something there is a 99% chance they will. Next is one of the large cats (lions maybe?) at like 48%.",
   "created_utc": 1692007179,
   "score": 3,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw1tsuv",
   "message": " It is impossible for most people to lick their own elbow. ...",
   "created_utc": 1691959275,
   "score": 5,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw330dn",
   "message": "That human beings/life on earth are quite LITERALLY made of star dust, supernova explosions.",
   "created_utc": 1691978479,
   "score": 4,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3j4rh",
   "message": "Lyme Disease can be a chronic condition and the short-term antibiotics don't always get rid of it, especially if you catch it late.",
   "created_utc": 1691986621,
   "score": 5,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3h9d9",
   "message": "[removed]",
   "created_utc": 1691985568,
   "score": 8,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3buyi",
   "message": "The average number of testicles that a human has is 1",
   "created_utc": 1691982736,
   "score": 7,
   "submission_id": "15q98q9"
  },
  {
   "comment_id": "jw3t4b0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15q98q9"
  }
 ]
}