{
 "submission_id": "15qfxs2",
 "title": "What American city has fallen the furthest in the last 5 years?",
 "selftext": "",
 "created_utc": 1691975068,
 "permalink": "/r/AskReddit/comments/15qfxs2/what_american_city_has_fallen_the_furthest_in_the/",
 "score": 26,
 "url": "https://www.reddit.com/r/AskReddit/comments/15qfxs2/what_american_city_has_fallen_the_furthest_in_the/",
 "comments": [
  {
   "comment_id": "jw3m474",
   "message": "Oakland looked like it was on the path to bigger and better things before the pandemic. A few tech companies moved headquarters there and more were looking to move. Urban renewal looked like a real possibility. Then the pandemic hit and undid all the progress and then some. Parts of Oakland feel lawless; 911 does not respond and criminals walk from car to car, breaking windows in broad daylight. The local government seems utterly incompetent. Really sad situation for everyone living here.",
   "created_utc": 1691988367,
   "score": 94,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3p7yj",
   "message": "San Francisco. Born \u0026amp; raised there \u0026amp; I’ve never seen it like this. People are leaving notes in the windows begging thieves not to break their windows a coworker took the tint off his windows so they can see he doesn’t have anything. They busted his windows \u0026amp; took his 49er bobble head that was on his dashboard.",
   "created_utc": 1691990323,
   "score": 98,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3uuof",
   "message": "Chicago is doing fairly well all things considered, but many of the other cities in the state of Illinois are on track to suffer the same fate as Gary, Indiana. Chicago has the advantage of scale and a highly educated labor force, so companies are willing to deal with the high property taxes in Illinois to be in proximity to Chicago. Other cities in the state like Bloomington, Rockford, Springfield, and Decatur don't have these same advantages, so companies looking to open a plant (mainly manufacturing/food processing) have no reason to chose them over comparable places with lower taxes like Indiana and Iowa. This has lead to massive population loss and increases in crime basically everywhere that isn't a college town. When you hear about Illinois suffering a massive exodus, it's from places like this downstate, not Chicago.",
   "created_utc": 1691994191,
   "score": 214,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3idb3",
   "message": "I love America, I travel there several times a year, have done for 30 years. \n\n\nAll I can say is what is happening in downtown  San Francisco, Seattle and Los Angeles is truly concerning \u0026amp; frightening  - but for sheer rate of change over 5 years I think Portland would have to be a contender.",
   "created_utc": 1691986185,
   "score": 123,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3iljk",
   "message": "Portland\n\n* Many amazing restaurants closed.\n* The rollout of drug decriminalization was an absolute clusterfuck. I'm fine with drug use, but I think it needs to be responsible. When it spills onto innocent bystanders, the behavior needs to be nipped in the bud. Instead it festers in Portland, the government instead decided to enable addicts, letting people smoke hard drugs on busses and on public sidewalks. I don't want to get your secondhand phentanyl smoke. In the name of harm reduction, boofing pamphlets and straws were given out, despite straw restrictions for restaurants.\n* Small businesses were repeatedly vandalized and windows were smashed. This caused a lot of cool places to close and makes it less appealing to go to the current ones. \n* Neighborhoods have random strangers busted RVs roll in and set up camp with their shit spilling into the road creating dangerous situations. These people are defecating in bushes and littering everywhere. Some are meth labs.\n* Car and bicycle theft and vandalism has significantly increased. The police hardly do anything. Spontaneous stops into a store, carrying reusable bags, and multi-store trips have all but ended because I don't want my car getting broken into again. So instead of local stores getting my money, I order online.\n* Large efforts to make public transportation more viable but little to no effort is made to protect passengers and drivers from mentally ill or people on drugs. Roads have been redesigned to take away car lanes and add bike lanes. But bike chop shops are common and allowed to accumulate in plain sight. I'm not going to ride somewhere and risk being stranded so an addict can get his next hit.\n\nThe perspective on the social construct is all one way if you are a drug addict. But if you are trying to make ends meet in the working or middle classes, very little is done to improve your life with excessive regulations making things slower and more expensive.",
   "created_utc": 1691986314,
   "score": 35,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3mhzs",
   "message": "Y'all are all missing the answer. It's New Orleans. Hands Down. Dwindling tax base is exasperating a lack of police and collapsing infrastructure, civic corruption and crime are at all time highs, causing even more attrition. In about 20 years it won't even be the biggest city in the state.",
   "created_utc": 1691988600,
   "score": 161,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3uzur",
   "message": "The answer is Davenport, IA but but no one gives a sh\\*t about it, including the elected officials of Davenport, IA.",
   "created_utc": 1691994296,
   "score": 214,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3sgbn",
   "message": "“The city I live in” -Every answer on here",
   "created_utc": 1691992485,
   "score": 200,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3pljz",
   "message": "the real answer is hundreds of medium sized towns with no economic anchors scattered across the US that have been slowly suffocating and withering away since march 2020. The opiod epidemic and political conspiracy theories have absolutely ravaged the American middle class",
   "created_utc": 1691990567,
   "score": 211,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3zp3z",
   "message": "None of y'all know the right answer because it's Memphis Tennessee. For the first time in Generations a few years ago Memphis was doing good. Now? where to start.\n\nAbout a year ago the I-40 Bridge has a giant crack in one of the sides because the inspector was afraid of heights. this bridge goes over the Mississippi and has hundreds of thousands of people going over daily. people fucking around with a drone are the only reason we found out about it.\n\n[https://www.nbcnews.com/news/us-news/inspector-who-failed-catch-mississippi-river-bridge-crack-fired-n1267723](https://www.nbcnews.com/news/us-news/inspector-who-failed-catch-mississippi-river-bridge-crack-fired-n1267723)\n\nJust last month over 500,000 people lost power multiple times for multiple days in a row. Why? it rained. it wasn't a tornado, it wasn't a flood, it was just four or five consecutive heavy rains. I Was without power for nearly 15 of the 31 days last month. \n\nCan't drink the water because the pipes keep bursting during the winter and it causes sewage to back up into it. but that's not bad enough because the power keeps fucking going out the diesel generators running the pumping stations have been overused and started to leak into the groundwater meaning gasoline is now in our drinking water!\n\nRIP Tyre Nichols. \n\nI can keep going to. dude shot a doctor in his office like a month ago. We still don't know why.\n\nThis city is absolutely fucked and it does not look like it's going to turn around. \n\nAlso were the most dangerous city to live in in America now. 237% higher than the national average.\n\nFuck...",
   "created_utc": 1691997845,
   "score": 167,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3qfvo",
   "message": "Y’all don’t even know.. Kansas City keeps getting worse every year",
   "created_utc": 1691991121,
   "score": 143,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3y7pr",
   "message": "I’m highly considering moving to Portland and this post was scaring me. Visited earlier this summer and absolutely loved it. It looked like it had some bad pockets but nothing crazy.",
   "created_utc": 1691996715,
   "score": 229,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw2w46m",
   "message": "San Francisco.  I just saw yesterday where they were able to do a meta-study of local activity based on cell phone network data usage.  Whereas cities like New York City and Chicago have mostly recovered, downtown San Francisco is still barely above COVID lockdown levels.",
   "created_utc": 1691975328,
   "score": 144,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw2vq02",
   "message": "Portland and LA",
   "created_utc": 1691975149,
   "score": 209,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3z0j4",
   "message": "Eugene Oregon(smaller, I know, but still) \n\nOnce a college town focused on athletics and university living. Home of the Olympic trials and even the world's tourney for track. \n\nIn the last few years, they've lost a majority of the bars on campus, a couple of frats, and you have to be careful about walking downtown after dark. The homeless are rampant and, due to lack of punishment, can be found shooting up in broad daylight mere blocks from any of the police stations in town. \n\nWent from somewhere I was excited to go to school for, to somewhere I've been caught up in 3 separate shootings, 2 muggings(both on campus), and a number of close calls. All since the pandemic",
   "created_utc": 1691997324,
   "score": 77,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3r9am",
   "message": "Portland and San Fran are probably the wrong answers, as much as people like to whine about homelessness they're still very prosperous cities. If you want to get the actual answer look at the cities that are seeing the largest population decline\n\nhttps://www.census.gov/library/stories/2023/05/large-cities-no-longer-biggest-population-losers.html",
   "created_utc": 1691991667,
   "score": 207,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3kd2b",
   "message": "Portland, OR is like Gotham City now. \n\nEdit: I will elaborate. I lived there for 15 years and witnessed the collapse of the city. When I moved there it was awesome. Little to no traffic, great food, affordable rent, eclectic culture. Then Keep Portland Weird happened and the influx of weirdos and hipsters bulked up, which was fine, but made it WAY more crowded. Then real estate investors came in and started gentrifying everything while also building luxury high rises. So all of us, including the weirdos and hipsters, couldn’t afford to live in our city anymore so we either moved out of the city or took to the streets. Then fentanyl and Covid happened so even more people were on the streets and in dire straits. Then all of the protests like BLM were MADE violent by the PPD but portrayed on the news as the cities inhabitants were just going nuts, which was not true. I luckily got out of there before they decriminalized everything- but I still have friends who live there (bc they can’t afford to move bc it’s so expensive to live there) and they send me pics and updates. It’s horrible. It was such a cool city.\n\nEdit II: I am not a conservative. I am all for harm reduction and helping the homeless, I was homeless at one point in my life so I know what that feels like. HOWEVER, with all of these things mentioned above combined, the crime, trash, illnesses, untreated illnesses, and overall homeostasis of the city is at 0%. I do not see it recovering.",
   "created_utc": 1691987326,
   "score": 73,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3tbai",
   "message": "Damn, I moved to Portland 3 months ago and have thought it's been amazing, safe ,and super lively. However after reading this thread I will now barricade myself in my house and just watch the news and read reddit to get the story of what it's really like in Portland. /s",
   "created_utc": 1691993091,
   "score": 57,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw46hcc",
   "message": "The problem of ‘fallen’ cities isn’t caused by the poor, the homeless, the addicted.  Look back twenty, thirty years with an honest eye.  I’ll use Seattle for an example, since I live in the area and lived in the city thirty years.\n\nI came to Seattle in 1988.  I was a homeless street kid.  I had a friend who moved there who let me sleep in their dining room when our paths crossed, otherwise I just hung out with friends, ate at Teen Feed, and scrounged enough change to get tobacco and some coffee at the Last Exit.  Drugs were plentiful, frequently free or dirt cheap.  Food was not difficult to come by.  Work was easy to get, and you could get a job, save your money up for a couple of checks, and find an easygoing landlord who’s rent you a studio for 300 a month, all utilities paid.  I lived in the same cheap, divey apartment building for ten years that was all double studios with kitchens.  The bathrooms were down the hall.  The carpets were paper thin and the roaches were an ongoing struggle.  But you could get by on ten dollars of folding money in your pocket.  In 1998, by the time I moved, ‘gentrification’ was still an abstract concept, but it was coming.  People started buying up the old crack houses in the Central District, and turning them either into cute little bungalows, or razing them and building the first generation of townhouses and condos, precursors to the ugly boxes of mixed use retail below, housing above we have now.  That building I lived in?  They built the worlds tiniest functional bathrooms in the closets, and now they rent for $3000 or more a month.  Minimum wage was always tight, but now you need to be making nearly $30 an hour just to comfortably live.  So, what happened?\n\nUnfettered corporate greed and developers deciding that tearing down the affordable housing to put up condos.  Suddenly you had people moving to Georgetown, South Beacon Hill, West Seattle.  Places that were cheaper, but still in the city.  Time passes, you start seeing the developers turning their eyes to those areas, and the cycle repeats.  I’m a cook for The University of Washington.  I work for the state.  It used to be the best paying cooking job in Seattle, and benefits that are very nice.  I had to move from Seattle to Bremerton because I got priced out of Ballard.  And now, you need to be making Seattle money to live in Bremerton..  Everything is more expensive, the money is pooled in the hands of the ‘upper class’, and the poor and working class suffer for it.  People live in their cars and campers and tents because the other people with the money don’t want to share \n\nPeople turn to drugs, and when they become addicted, they turn to crime to keep their heads above water.  The justice system is a mugs game, police only show up for violent crimes.  Nobody seems to care about the people that used to get by who don’t anymore.  \n\nI’m tired and it’s nearly two in the morning, and now this missive will bring out the keyboard warriors who will pick apart my words and tell me I’m stupid or old or if I don’t like it, just move.\n\nI did move.  No one who works for the state should have to have two jobs.  No one should not be able to buy a house, and be forced to either pay double my mortgage in rent or live in their car.\n\nWe need to stop these people who only see things in terms of how much money they can make.\n\nI’m tired I’m gonna go to bed.  This feels like an incomplete piece of writing from me.  Have at it.",
   "created_utc": 1692003202,
   "score": 241,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3tu5x",
   "message": "Houston is really looking shitty. I don’t think that’s been a problem just over the last 5 years alone, but it doesn’t look good out here at all. \n\nSeems like everywhere is just getting worse and worse as the years go by.   So many places that were awesome to visit are being closed up for good.",
   "created_utc": 1691993457,
   "score": 58,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw47ue1",
   "message": "All the cities across the U.S. have most of the same issues: declining tax revenue, rising homeless population, exploding drug addiction rates, and wild spending to fix the last two issues. These issues have been building for decades and will take decades to fix. Cities are spending money to solve a national issue. This comes at the detriment of city services that people rely on.",
   "created_utc": 1692004267,
   "score": 35,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw43ona",
   "message": "Fine, screw it, I'll throw down an answer that isn't Portland or San Francisco.\n\nTampa, FL.\n\nI moved there in 2012, and it was good, if not great. My first 1 BR/BA was $625 a month, near USF. Yes, it was slightly sketchy on the edge of Temple Terrace, but the campus nearby kept it mostly safe (only drug deals I saw go down were weed deals). \n\nIn the decade+ since? \n\nMOSI became a shell of itself. They mothballed most of the building and let a bunch rot and deteriorate. The walkway near the USF campus is full of homeless people who literally shit on the ground and leave it.\n\nThe county/city raised taxes to improve public transportation - and the courts deemed it unconstitutional. Years of extra taxes paid that couldn't be used to help the area.\n\nTraffic improved dramatically during COVID times, but now that we're out of the pandemic, it's gotten so much worse. Tampa's infrastructure is designed from the 1980s. It is a thoroughly commuter city, and it still shows.\n\nPrices have gone nuts. Tampa is one of the hardest hit inflationary cities in the country. And even as inflation gets under control overall, Tampa remains an outlier with prices still going up.\n\nThat $625 apartment a decade ago? It's $1200 now, with no improvements or changes. Meanwhile, ancillary costs like utilities and insurance have exploded. You cannot live in the city unless you're making $60k+ and have roommates. USF pumps out 10k+ graduates a year that need to move away because living in a \"college town\" is too expensive.\n\nAnd then there's the general malaise of having a governor who spends his term campaigning for president while his state suffers. DeSantis has no love for Florida and will gladly ruin it and do nothing productive to \"own the libs\" if he thinks he can become president. His only shot is Trump getting jailed, because no one outside of FL likes him, and half us stuck here hate him.",
   "created_utc": 1692000989,
   "score": 83,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3zqbb",
   "message": "Charleston WV. It’s population has steadily *declined* by an average of about 1.5% per year for over two decades. It’s the only state capitol in the US is dying.",
   "created_utc": 1691997871,
   "score": 77,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3xps1",
   "message": "I live in the suburbs of Atlanta and found that in the past couple years the most racist and rude people have moved in. The traffic has gotten worse and the prevalence of crimes have exploded in my city.",
   "created_utc": 1691996341,
   "score": 42,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3hc1k",
   "message": "Rural America is a pit unlike its ever been. Cities are fine, it’s small towns that went to shit here.",
   "created_utc": 1691985609,
   "score": 227,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3c7kb",
   "message": "Portland, OR",
   "created_utc": 1691982914,
   "score": 81,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw43fuk",
   "message": "Portland, I’ve heard bad things about the decline of cities for years. Drove cross country a few years ago and hit most major cities that are apparently lburned to the ground” or whatever especially according to conservative media. I didn’t see it myself. I thought Chicago and San Francisco were amazing but Portland, dear god, I could not get out of there fast enough. \n\nPart of it was I had never been there before and really had a totally different image in my head. Was picturing sort of a quaint bohemian town on the river. It instead it really is a huge city like any other city. But the homeless encampments started on the highway on ramps and just got worse as I drove into the city. The one day I happened to be there, was some big Saturday Market that they have. People were arguing over politics in the square near the river, there was a public shooting in that area the next day. Not a place I will be returning to anytime soon.",
   "created_utc": 1692000795,
   "score": 17,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw47hbu",
   "message": "Portland, OR.\n\nTed Wheeler is complete failure, just a feckless excuse for a human being.\n\nI was born here, raised nearby, visited a ton in childhood, moved back in '99. It was never perfect, but it had a friendliness and charm and quiet beauty most cities couldn't touch.\n\nNow? It's a patchwork of slums and gentrification, undrivable bike-assimilated semi-roads and homeless camps, with an endless wandering mass of Walking Dead-esque junkies. I've had two cars stolen in the last three years, and I'm constantly followed by street criminals.",
   "created_utc": 1692003982,
   "score": 20,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3du60",
   "message": "Tech bros moved into Seattle and made it too expensive for anybody else to live there. Used to be a fun town.",
   "created_utc": 1691983750,
   "score": 139,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw41hz4",
   "message": "Portland, Oregon, for basically all of the reasons that people are listing here. It's just as someone from Vancouver, Washington, I must dogpile on my neighbors whenever I can :D",
   "created_utc": 1691999271,
   "score": 2,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw44x4p",
   "message": "When I went to Portland I was amazed that there were so many trees and green stuff in the city for it to smell like a giant fucking litter box.",
   "created_utc": 1692001955,
   "score": 4,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw474ob",
   "message": "San Francisco and Portland",
   "created_utc": 1692003708,
   "score": 4,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw32rkl",
   "message": "Maui",
   "created_utc": 1691978368,
   "score": 133,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw41jrx",
   "message": "Houston. [They've fallen about 3.4 inches in that time.](https://www.washingtonpost.com/climate-environment/2023/05/30/land-sinking-us-subsidence-sea-level/)",
   "created_utc": 1691999311,
   "score": 25,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw49tq3",
   "message": "America, America has a problem",
   "created_utc": 1692005789,
   "score": 1,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw45ovv",
   "message": "Asheville has gotten extremely shitty since I last went there in 2012. I visited last year and the cheapest hotel was $300/night but came with junkie blood stains on the bed sheets and I couldn’t even swap them because they didn’t have any more. The hotels were housing the homeless and druggies so it jacked the price up for everyone else. Overall the town was snobby and elitist when it used to be a cool hippy town with friendly people",
   "created_utc": 1692002574,
   "score": 24,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3sk81",
   "message": "Miami",
   "created_utc": 1691992562,
   "score": 8,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3bj5c",
   "message": "This thread will be dominated by conservatives who don't live in big cities.",
   "created_utc": 1691982569,
   "score": 47,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3vm4i",
   "message": "Portland is fucked.",
   "created_utc": 1691994757,
   "score": 11,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw43k38",
   "message": "San Francisco. A lot of empty tech buildings. Thousands of tech layoffs, falling equity values and the crypto meltdown have only deepened the blow to the area.",
   "created_utc": 1692000889,
   "score": 22,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3noy8",
   "message": "San Francisco. Ever since the Pandemic, downtown is dead, lots of retailers have closed shop, and the homeless problem got even nastier thanks to the fentanyl freaks.",
   "created_utc": 1691989338,
   "score": 25,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw44lv9",
   "message": "I second Portland Oregon. I travelled there every year from Vancouver Canada because it was a great city with fun breweries, food options and a good vibe overall.\n\nI went there recently( haven't been since the Pandemic) and it was a completely different city. The Uber ride in from the airport to downtown was the first red flag that things had changed. I saw homeless encampments underneath overpasses and off ramps. It seemed like tents were everywhere. When I was downtown the number of drug addicted homless people was shocking. I saw 2 of them fighting in the street, another man was going up to bystanders yelling and threatening  The homeless were very aggressive and this was in the tourist areas I've visited in the past. It didn't feel safe to be there and I never had that feeling in all my years travelling there before.\n\nI visited Detroit a few weeks ago and quite honestly the downtown area there felt much safer there then downtown Portland.",
   "created_utc": 1692001708,
   "score": 5,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3e0f3",
   "message": "Portland, OR",
   "created_utc": 1691983840,
   "score": 27,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw48bcn",
   "message": "Most on the West Coast.  Seattle, Portland, Oakland, San Francisco, Los Angeles, and maybe San Jose.  \n\nAbsolute shit show.",
   "created_utc": 1692004633,
   "score": 7,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw2vsli",
   "message": "Lemme guess -- you're a big Legion of Skanks fan, aren't you?",
   "created_utc": 1691975182,
   "score": 7,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3vdg4",
   "message": "Every city in Florida",
   "created_utc": 1691994579,
   "score": 13,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw44s8f",
   "message": "Philadelphia",
   "created_utc": 1692001849,
   "score": 4,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw2xvar",
   "message": "San Francisco from what I have seen on TV.",
   "created_utc": 1691976122,
   "score": 46,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3ae8b",
   "message": "Denver",
   "created_utc": 1691981997,
   "score": 19,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3rnib",
   "message": "Seattle was always kind of shit. But Portland is absolutely disgusting right now. It used to be cute and clean and green and a fun place to visit. Now it’s dark, and dead, and nasty, and filled with homelessness and graffiti and garbage. Awful place to visit",
   "created_utc": 1691991936,
   "score": 10,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw40gbn",
   "message": "In my experience Portland Oregon has fallen a lot just in the last 3 years",
   "created_utc": 1691998446,
   "score": 2,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw426pr",
   "message": "Not a big city, but I drove through Meridian MS after several years and the decay was really shocking. Everything seemed shuttered and dead, except Walmart.",
   "created_utc": 1691999811,
   "score": 2,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw42b1s",
   "message": "Portland, Oregon",
   "created_utc": 1691999906,
   "score": 2,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw43h2q",
   "message": "San Francisco",
   "created_utc": 1692000821,
   "score": 2,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4914d",
   "message": "I lived in SF for YEARS and left about 9 years ago after the tech people started coming, I come back at least once a year for work stuff and it’s more and more depressing every time",
   "created_utc": 1692005181,
   "score": 39,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4bopg",
   "message": "Having lived in PA and FL I expected more Miami's and Daytona's and Philadelphia's but apparently the west coast really sucks huh?",
   "created_utc": 1692007179,
   "score": 102,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4bpek",
   "message": "Portland",
   "created_utc": 1692007193,
   "score": 1,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4c7k7",
   "message": "San Francisco",
   "created_utc": 1692007560,
   "score": 1,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4dvwy",
   "message": "You ever been to Portland?",
   "created_utc": 1692008740,
   "score": 1,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw2w0q0",
   "message": "San Francisco \n\n\nLos Angeles has been in the gutter for more than 5 years.",
   "created_utc": 1691975283,
   "score": 24,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw33cgw",
   "message": "Seattle. \n\nSo many homeless",
   "created_utc": 1691978633,
   "score": 18,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw42a9l",
   "message": "Washington, D.C. has seen twice as many armed robberies and carjackings since the pandemic but that’s just my experience it sounds like things are bad everywhere",
   "created_utc": 1691999890,
   "score": 22,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3z22l",
   "message": "Portland is a complete trash fire anymore. I think the most disheartening thing is seeing all the lemmings here acting like the “this is fine” dog and refusing to see or acknowledge any kind of problem we have. You’re just an eViL nImBy FaScIsT if you do.",
   "created_utc": 1691997357,
   "score": 6,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw3zwb5",
   "message": "Portlander here: all you said is very true. Add in Kate Brown’s Covid policies to wrap around all of this. Her Covid policies basically wrecked the restaurant industry and she exempted homeless from all persecution to avoid filling jails. We overreacted to Covid way more than nearly any state in the US and are paying dearly for it (when you combine it with all the above poster said).",
   "created_utc": 1691998002,
   "score": 5,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw431zh",
   "message": "I’d have to say San Francisco. Makes me really sad to see it the way it is now. I hope they can turn things around.",
   "created_utc": 1692000492,
   "score": 4,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4e0n2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4iltc",
   "message": "Hearing about these makes me appreciate the progress Detroit has made in the last 5-10 years. The Motor-city is getting better everyday.",
   "created_utc": 1692011814,
   "score": 46,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4f6ud",
   "message": "I haven’t been to the west coast so I’m probably not correct, but Austin TX looks like a dystopian nightmare compared to when I lived there in 2002-2009 and again in 2015 and San Antonio TX seems to have had an explosion in meth use, it’s like Walter White set up shop in the Alamo or something.",
   "created_utc": 1692009638,
   "score": 67,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4ma8a",
   "message": "Portland, OR. And it’s a damn shame. Growing up there, it used to be incredibly beautiful and welcoming. Now it’s a homelessness drug hell hole with no end in sight.",
   "created_utc": 1692013940,
   "score": 1,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw48jzk",
   "message": "What American city hasn’t fallen? Pretty sure we can argue which has for all eternity.",
   "created_utc": 1692004816,
   "score": 21,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4gwia",
   "message": "New orleans. Our current mayor is blatantly corrupt, and open about it. She's been caught misusing public funds and banging one of her security officers on city time and on city dime. She took absolutely NO accountability during the pandemic despite enforcing outrageous covid restrictions that she herself never followed. Our infrastructure is crumbling. We had the Hard Rock Hotel collapse during construction killing 3 workers and injuring 20+ more. It took 2 years to demo that building and retrieve the bodies. When trying to demo the construction crane, they used a \"controlled explosion\" which catastrophically failed and caused the crane arm to swing, potentially killing hundreds in the immediate area despite being in a closed off area. Luckily it didn't break off (which it was SUPPOSED to do because that's what the demolition was supposed to accomplish). This added tk the over 2 years it took to demo the site. \n\nOur public transportation system is becoming more scarce, with fewer streetcar routes, fewer bus routes, and longer wait times for public transit. Average police response time is anywhere from 4 to 9 hours is there is no reported injuries, and 35 to 50 minutes for violent crime or reported injuries. Violent crime is the worst it's been since before Katrina, and the housing market is outrageous despite the properties falling apart. The job market is abysmal, and no reputable companies want to operate in the city. \n\nNew Orleans is ACTUALLY what people picture when they think of Detroit.",
   "created_utc": 1692010751,
   "score": 13,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4gi5y",
   "message": "Portland",
   "created_utc": 1692010500,
   "score": 6,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4jwob",
   "message": "Be the change you want to see in your city.  Get involved.  Get on councils, get into civics, get into politics.\n\nChances are the people involved in making your city a better place are burnt out, overwhelmed, or past their prime and need replaced.",
   "created_utc": 1692012588,
   "score": 5,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4lh6e",
   "message": "Portland, Washington D.C., and Seattle. All of them were shit and it just kept getting worse.",
   "created_utc": 1692013492,
   "score": 1,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4f5vb",
   "message": "Why is every city in the US just getting worse and worse?",
   "created_utc": 1692009619,
   "score": 22,
   "submission_id": "15qfxs2"
  },
  {
   "comment_id": "jw4e9n7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15qfxs2"
  }
 ]
}