{
 "submission_id": "15qhx87",
 "title": "Doctors of Reddit, what’s it like when you go in for a doctors appointment? Do you and your doctor discuss what is wrong with you like it’s a group project? Do you not go at all because you’re your own doctor?",
 "selftext": "",
 "created_utc": 1691980612,
 "permalink": "/r/AskReddit/comments/15qhx87/doctors_of_reddit_whats_it_like_when_you_go_in/",
 "score": 65,
 "url": "https://www.reddit.com/r/AskReddit/comments/15qhx87/doctors_of_reddit_whats_it_like_when_you_go_in/",
 "comments": [
  {
   "comment_id": "jw435la",
   "message": "I have been a PCP for nearly 10 years and went to see a dermatologist because I thought I was developing psoriasis. I had a scaly-looking rash on my knees, elbows, and tailbone. There was some starting to show up on my scalp as well. \n\nShe very quickly told me it looked like a Celiac rash. I was immediately skeptical as I had zero gastrointestinal symptoms and the rash had been present for over a year. My recent labs also looked perfect. \n\nShe was 100% right. The Celiac panel lit up like a Christmas tree and a gut biopsy confirmed it. \n\nIt is very nice to get an outside perspective.",
   "created_utc": 1692000568,
   "score": 42,
   "submission_id": "15qhx87"
  },
  {
   "comment_id": "jw3hfat",
   "message": "You basically just present your story in doctor language and it takes like 30 seconds",
   "created_utc": 1691985658,
   "score": 34,
   "submission_id": "15qhx87"
  },
  {
   "comment_id": "jw3gr4r",
   "message": "I've been seeing him for so long now that it's really just a handshake and a brief, \"Hey how are the kids?\" and then he says, \"So what's it today a cold?\" or whatever and I'll say yeah and then he writes me a script for codeine.",
   "created_utc": 1691985294,
   "score": 77,
   "submission_id": "15qhx87"
  },
  {
   "comment_id": "jw3sasb",
   "message": "Speaking as someone who constantly uses Web MD, I find that talking to my fellow Medical Field Colleges about my issues is very collaborative in deed. I tell them I obviously have cancer, they tell me its allergies, and we go back and fourth bouncing ideas off each other to and fro",
   "created_utc": 1691992375,
   "score": 31,
   "submission_id": "15qhx87"
  },
  {
   "comment_id": "jw3dclz",
   "message": "I’ve had a doctor commiserate with me over having to wait nearly an hour for appointments and not getting special treatment because he’s “just another patient”. He also asked if I’d learned my lesson after being raped, so I don’t really feel inclined to empathize for his wait times.",
   "created_utc": 1691983496,
   "score": 39,
   "submission_id": "15qhx87"
  },
  {
   "comment_id": "jw3v5rt",
   "message": "I am just waiting for the eventual doctor to describe how did he performed a vasectomy on himself.",
   "created_utc": 1691994420,
   "score": 4,
   "submission_id": "15qhx87"
  },
  {
   "comment_id": "jw49cpk",
   "message": "I've heard that doctors make the worst patients",
   "created_utc": 1692005434,
   "score": 3,
   "submission_id": "15qhx87"
  },
  {
   "comment_id": "jw3wwqe",
   "message": "Am not a doctor, but work in healthcare. Docs just write their own referrals, I've had a few come up to me to ask to make their appointments for them. I don't know if they can write their own prescriptions, but I imagine if they couldn't and needed to they'd just approach a colleague and ask them to do it.\n\nThey can't write medical certificates for their loved ones though. My GP had to send her kid to another doc because he got sick during his HSC and she said she legally wasn't allowed to do it.",
   "created_utc": 1691995738,
   "score": 4,
   "submission_id": "15qhx87"
  },
  {
   "comment_id": "jw43led",
   "message": "Not yet a doctor but a medical student, I have had mixed experiences but mostly bad. A few when heard I was studying medicine asked about what year I was in and treated me as a colleague. Most doctors (basically all the lazy bums) don’t take it particularly well especially if you try to point out that what they are saying is actually wrong. \nI can say with certainty that at least 50% of the time doctors that visited me where either wrong about stuff or using informations and methods that were outdated, I sadly lost much of my respect for the profession and for mild things just treat myself if possible, no use to being told it’s just influenza if I have an advanced pharyngeal infection or that’s “normal” when fainting of dehydration after severe and sustained vomiting",
   "created_utc": 1692000917,
   "score": 7,
   "submission_id": "15qhx87"
  },
  {
   "comment_id": "jw4h8kj",
   "message": "Just call it a professional codeine exchange program 😆👨‍⚕️",
   "created_utc": 1692010962,
   "score": 0,
   "submission_id": "15qhx87"
  }
 ]
}