{
 "submission_id": "15qhzfy",
 "title": "What pushed you away from your ex-best friend?",
 "selftext": "",
 "created_utc": 1691980799,
 "permalink": "/r/AskReddit/comments/15qhzfy/what_pushed_you_away_from_your_exbest_friend/",
 "score": 226,
 "url": "https://www.reddit.com/r/AskReddit/comments/15qhzfy/what_pushed_you_away_from_your_exbest_friend/",
 "comments": [
  {
   "comment_id": "jw3nww8",
   "message": "When I realized that the only time she ever got in touch with me was because she wanted something from me.",
   "created_utc": 1691989479,
   "score": 151,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3dvy3",
   "message": "I got therapy.",
   "created_utc": 1691983775,
   "score": 171,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw38m7m",
   "message": "When I realized that they just brought negative energy and drama with them everywhere. Something or someone always had to be wrong and they desperately needed to be the center of everyone’s attention. It just became grating and I found myself less happy around them. So I had to remove myself from the friendship.",
   "created_utc": 1691981125,
   "score": 51,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3984w",
   "message": "she used to make fun of me behind my back with others",
   "created_utc": 1691981421,
   "score": 148,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3grjt",
   "message": "She ignored me whenever we had other people around, but when she didn't have anyone else to hang out with she would've texted me but she would've got mad and try to make me feel bad if I couldn't hang out with her",
   "created_utc": 1691985300,
   "score": 255,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3baeo",
   "message": "He started smoking crack and insists that the world is a simulation",
   "created_utc": 1691982447,
   "score": 111,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3fu8o",
   "message": "Her negative energy. She would literally talk about everybody because she was insecure and I got so tired of it and just stopped talking to her.",
   "created_utc": 1691984804,
   "score": 216,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3rah4",
   "message": "She only wanted to talk to me about her relationship problems with her crazy boyfriend. My advice to her fell on deaf ears and I couldn’t handle hearing about how poorly he treated her over and over.",
   "created_utc": 1691991689,
   "score": 36,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3jp28",
   "message": "Friends for 15+ years, basically sisters. Things had definitely been changing in our friendship, but I looked past it because she was practically family. Then I asked her not to smoke weed around me right after a particularly bad experience I had with it, and she proceeded to roll her eyes and say, \"Weed didn't rape you, he did. Get over it.\" \n\nHaven't spoken to her in 4 years. I still hope she's doing well and will always hope the best for her, but I couldn't move past that.",
   "created_utc": 1691986940,
   "score": 31,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3mnoo",
   "message": "My answer seems lame to everyone else’s. \nTime and distance. She’s no longer my best friend but she’s sort of my friend.",
   "created_utc": 1691988696,
   "score": 139,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3u6rx",
   "message": "My ex-bff and I were both about 33 at the time. I met her daughter (12yo) for the very first time and she was a complete b*tch to me the entire lunch. Saying things like “Wow, you’re really ugly” and “that’s so stupid” after I would say something. “Your hair looks like a witch” “your clothes are gross.” Loud enough that other tables kept looking over. And the ex-bff never once scolded her, or even told her to stop. Instead she’d sheepishly laugh and say “She’s just a little headstrong” “don’t pay attention, she’s always difficult with new people” “she doesn’t really mean it”\n\nI did make a couple of attempts to make her stop, but I wasn’t about to scold a child I didn’t really know, in front of her actual parent. I’d say things like “Geez, what a cruel thing to say,” or “It’s odd that you’re being so mean for no reason” but the ex-bff never even added anything on to that. \n\nA couple years later I was organizing a formal, black tie party and I sent her an invite with a plus one. She asked if she could bring her daughter since it was her custody weekend to have her. I. SAID. NO. The event was child-free, at an upscale wine bar that was reserved for the private party. Ex-bff begged, pleaded with me to make an exception, she was older now, blah blah. I held firm, said this was an important event to me, I would have professional peers from my industry there, and based on a) her daughter’s behavior two years prior and b) her lack of discipline, I didn’t feel confident that nothing similar would happen. I could just picture her insulting my dress, the food, the music, the location… and as this was an unofficial marketing event, I could NOT allow that. \n\n\nShe exploded. She said I was a pretentious b*tch, and that I was choosing being fake over being her friend. There were some other choice words. It was kind of the first time she’d ever spoken to me like that in our entire friendship. And of course, her daughter was just joking, she really did like me. *Yeah right.* \n\n\nShe immediately blocked me on everything. This was in 2016. We haven’t spoken since.",
   "created_utc": 1691993708,
   "score": 106,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3b3u4",
   "message": "She went from venting to emotional dumping and I couldn’t take it anymore.",
   "created_utc": 1691982355,
   "score": 220,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3dxcs",
   "message": "Two ex-best friends. I was sexually assaulted at a party by someone we all knew. My now ex-friends were there at the time. After that they drifted away. They stopped inviting me to hang out, and the few times I saw them it was uncomfortable. They didn’t  even ask me how I was doing. I don’t know why they weren’t there for me—guilt, discomfort maybe? It’s been over a year since I last saw them and it still hurts a lot.",
   "created_utc": 1691983796,
   "score": 39,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw38g8w",
   "message": "He came back from Iraq really fucked up. It would be one thing if he was experiencing emotional trauma because of things he had to do but he would brag about the people he killed and describe in unsolicited detail the things he did to them (war crime-level shit). Deep down I think he was bullshitting but to me that's something super fucked up to lie about.",
   "created_utc": 1691981045,
   "score": 113,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3pjkf",
   "message": "He got my wife pregnant.Then, knowing she wasn't mine. They hid it from me, hoping I wouldn't figure it out.  I didn't find out my daughter wasn't mine until she was 4",
   "created_utc": 1691990532,
   "score": 230,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw38bai",
   "message": "Her bad attitude",
   "created_utc": 1691980977,
   "score": 70,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw40qdz",
   "message": "BFFs for about 10 years. I finally distanced myself because I couldn’t handle her relationship. It was very unhealthy, IMO. She literally couldn’t do anything alone; if she showered, he showered. She went to work \u0026amp; he went \u0026amp; hung out there for her shift. It got to the point of me telling her that he wasn’t invited so he would stop showing up with her to our hangouts. And at that point she would either refuse to come, cancel at the last minute or she would come \u0026amp; rush through whatever we had planned so she could meet him outside where he would loiter waiting for her to finish hanging out with me. Or she would come \u0026amp; he would “show up” about 10 mins later \u0026amp; act like it’s a coincidence that we’re at the same place \u0026amp; then join us. Very annoying. \n\nHe also never had a job. And not he was unemployed \u0026amp; looking but he was unemployed \u0026amp; planning to stay unemployed \u0026amp; let my friend work for their household money. When we managed to get some time alone, she constantly complained about their lack of money \u0026amp; how she wanted him to work \u0026amp; stop smothering her. I encouraged her to either talk to him \u0026amp; work it out or dump him. She promised to talk to him but never did. And dumping him was not an option according to her because she couldn’t be alone. \n\nI just couldn’t watch her disrespect herself anymore when the solution was so simple. \n\nWe still have mutual friends so I know they are still together, about 13 years now. They have 2 kids. He still doesn’t work but he’s not a SAHD either. From what I’ve been told, now that she’s not in retail anymore \u0026amp; he can’t loiter inside, he sits in their car outside her office everyday. And from what I’ve heard, that togetherness extends to parenting. If the kids are sick or have a dentist appointment or something, boyfriend doesn’t take them. Ex-BFF takes time off work so they can do it together.",
   "created_utc": 1691998660,
   "score": 177,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3lb9h",
   "message": "My ex best friend left me when I got engaged to my now husband. We were both raised mormon and were not getting married in the temple. Big deal in the mormon church. She thought we should \"wait until we were worthy\" and that we were only getting married to have sex. Husband and I have been together 11 years now, no longer mormon and, for the record, got married because we love each other.",
   "created_utc": 1691987884,
   "score": 205,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3pqtu",
   "message": "His constant rejection and mockery of my advice and any help that I could offer made me understand that there was no longer anything that I could contribute to his life, so I walked away.",
   "created_utc": 1691990662,
   "score": 63,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3uovq",
   "message": "Got a new friend and hung out together a few times. New friend mentioned how old friend was treating me like absolute shit and I didn't seem to notice. As soon as new friend mentioned it, that's all I could notice.",
   "created_utc": 1691994073,
   "score": 194,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw39h0w",
   "message": "Her kids.",
   "created_utc": 1691981541,
   "score": 76,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3ibcf",
   "message": "I talked about the SA I experienced as a kid and she had too tough of a time receiving it because my parents (perpetrators) were more present during our youth than hers. \n\nWe stopped talking but I still think of her a lot and tell my kids about how funny and awesome she is. Sometimes people are ready to handle things at different times.",
   "created_utc": 1691986154,
   "score": 122,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3ev85",
   "message": "Racism and conspiracy theories.",
   "created_utc": 1691984287,
   "score": 202,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3k34d",
   "message": "They moved to another state and continuously dogged the state we are both from. All I hear was how great new state is and how much money they make and everything is better. After a couple years it got old.",
   "created_utc": 1691987165,
   "score": 42,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3ozn6",
   "message": "Not ex-friends, but I wouldn't consider him the *best* anymore, even having known him for over 20 years. \n\nHe talks just to talk and will only respond to anything else with \"yeah\" or \"uh-huh\" until he has the chance to talk again. He will hijack conversations entirely, and before I know it, he's talking about himself again. \n\nAlso, he only ever seems to tell stories of our time in high school/college, and only the same four or five over and over.\n\nAt first I thought it was a social thing, but it happens every time without fail regardless of where we are. It's incredibly frustrating to be talking to a group of people and being interrupted.",
   "created_utc": 1691990170,
   "score": 166,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw44vdo",
   "message": "he got a girlfriend and doesn't need me anymore. his personality has changed a lot and I can't recognize him anymore. also he started ghosting me. i miss my best and only friend",
   "created_utc": 1692001917,
   "score": 109,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3sgai",
   "message": "She got mad.... At my reaction.... To what SHE did TO ME! Fk sake. Bye",
   "created_utc": 1691992484,
   "score": 118,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3s2rj",
   "message": "I met a girl, and he tried to sabotage the relationship, literally everytime we hung out.",
   "created_utc": 1691992225,
   "score": 73,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3gniw",
   "message": "Another guy he was working with was giving off bad vibes, I told my best friend about it and told him not to trust this guy.  He said not to worry, he would never trust him enough to go into business with him (both plumbers) \n\nThey start hanging out, I get pushed to the sidelines, so I go do my own thing, ex best friend goes into business with the scumbag.  A year later, scumbag leaves the business, moves to the states, just as all the debts and bills are coming to final notice.  He hid them from ex-bf long enough to take all the money and run.\n\nLast I heard, ex-bf nearly died from a heart attack, is left unable to work, and is stuck on welfare.\n\nHe reached out to me, all i could do is tell him that i warned him, got pushed aside, ignored, and now you're stuck in this.  \n\nYou should have listened.",
   "created_utc": 1691985240,
   "score": 164,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3qg24",
   "message": "She started dating someone I had a really negative history with even though she promised nothing romantic was going on between them. Oh, but she didn't tell me I had to read between the lines. It's been two years and I think they are still together so good for them I guess.",
   "created_utc": 1691991124,
   "score": 39,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3sppz",
   "message": "Another friend in our groups dad died, he posted a picture of that guys dead dads open casket from the funeral “as a joke” online. He didn’t like when I called him out on it, when my grandmother died I realized how uncomfortable I would feel telling him and others in the group. I pretty much cut them all off.",
   "created_utc": 1691992669,
   "score": 60,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw38t1l",
   "message": "He was supposed to be my best man but a month before my wedding he went silent and quit responding to all communication. Two days before my wedding he calls and says he can’t make it due to losing his job six months prior. All he would have to have done was tell me the truth and not dropped it on me two days before my wedding so my side was a person short and it was awkward. Should have just been honest with me and kept open communication. He was my best friend, I would have understood. Hell, I’d have paid for him to be there.",
   "created_utc": 1691981218,
   "score": 95,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3ay3f",
   "message": "He started dating someone who seemed cool at first, but we found out he was a meth head. My friend said he broke up with that person and they were no longer in his life. A few days later, he invited my partner \u0026amp; over for dinner and to hang out. We get there and his \"ex\" is there. I told him we had to go home, I didn't want to be around that. He called me an asshole and shut the door in our face. We've not spoken or seen each other since. Hope he's doing okay and didn't get sucked into the world of drugs. He had a great job and a promising life. The whole event really changed the way I let people into my life and really, to this day, my partner and I do not have a social circle for reasons, such as this (and a few others). It is just less stressful to have each other and the cats.",
   "created_utc": 1691982274,
   "score": 27,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3m4o9",
   "message": "She told me she wanted to be with me so I thought about it and realized I did like her and I told her. She changed her mind about it and said she was emotionally unavailable. She started dating a guy a few weeks later and at that point I stopped caring. \n\nTook her a while to realize I wasn’t coming back. It’s been a few years since then and she’s tried twice to get my attention, but once you disrespect me then im gone. I wish her the best, but I’d never mislead someone that close to me.",
   "created_utc": 1691988375,
   "score": 86,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3qus7",
   "message": "In his 40's he started banging 18 year olds.   I was like, \"I'm out.\"",
   "created_utc": 1691991394,
   "score": 110,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3f709",
   "message": "He moved to another country in another continent with his family, it even hard to get visa to this country, very small chances to visit each other.",
   "created_utc": 1691984461,
   "score": 43,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3oj2y",
   "message": "This is going WAY back to 8th grade.  I had a best friend through much of elementary school.\n\nBy the time we hit 14 our friendship wasn’t as big as our egos.  We liked the same girls and were both kind of at the top of the pecking order.\n\nIt finally came to a boiling point and we beat the shit out of each other. Pretty evenly matched, so it was pretty brutal.  We both had bloody noses, fat lips, and few good lumps.\n\nHigh school rolled up a few month later and we fell into different friend groups.  Never talked to him again.",
   "created_utc": 1691989872,
   "score": 34,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3qcb7",
   "message": "Not having mutual respect for each other",
   "created_utc": 1691991055,
   "score": 32,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3wm3y",
   "message": "I realized I’m a people pleaser and started setting boundaries. The rest sorted itself out…",
   "created_utc": 1691995513,
   "score": 160,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3871r",
   "message": "He was my ex and decided that we don't have chemistry as friends. I created a subreddit in response.",
   "created_utc": 1691980918,
   "score": 49,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3n8e9",
   "message": "The constant judgement and comments wore me down \"OMG I would never let my nails get like yours\"",
   "created_utc": 1691989049,
   "score": 72,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3mmmc",
   "message": "Slept with another mutual friends wife after he had a stroke and was hospitalized.",
   "created_utc": 1691988678,
   "score": 68,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3ohh3",
   "message": "She became a Trumper and anti COVID anti vaxxer. Became her whole personality and I just couldn't do it. Pretty much ghosted after a few bad outings.",
   "created_utc": 1691989843,
   "score": 119,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3qlh1",
   "message": "Constantly guilt tripping me.",
   "created_utc": 1691991226,
   "score": 30,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3u6kf",
   "message": "I worked my ass off to better myself.  Went to university.  Learned some skills. Made an effort.  Worked hard, sucked up, got some breaks, got lucky, and made it out of that godforsaken racist, one-horse town.  Not rich, but I am doing ok and will retire soon with a full pension in my 50s.\n\nHe stayed the same.  Refused to do anything.  Blamed his life on everyone else.  Never got an education, or even any skills to use for making a decent wage. And he constantly gave me shit for getting a Master's degree and being a nerd.  My white collar job isn't real work.\n\nHe would be close to 60 and still works as unskilled labor and for minimum wage.  Can't cook, so he has lived his life on fast food.  Just found out through mutual friends that he is diabetic and just lost his foot.  He's claiming his newfound 'freedom' will be living the sweet life on government assistance.",
   "created_utc": 1691993704,
   "score": 62,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3rrme",
   "message": "I became obsessed with working out and would make that a priority over our friendship. I was getting skinnier and had a different crowd to run with. The person wasn't supportive of my lifestyle changes, so they emailed me saying good-bye.",
   "created_utc": 1691992014,
   "score": 8,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3a260",
   "message": "We work together. I work harder than he does, I have awards and recognitions, I never complain about work even though I'm constantly harassed by my manager.\n\nHe complains all day. Barely does his work during the day. Then chooses to work at night until 3am. Complains the next day as if he's putting 20 hour work days. Misses a ton of work days but he's our managers favorite. \n\nGuess who gets everything served in a silver platter, gets internal offers out of the blue, accepts them, then has the luxury to reject them because it's not what he expected...\n\nI understand that this has been strategically done by my manager. And I heavily dislike her. And while I'm still friends with the guy, I've certainly taken a few steps back with him. I have no respect for people who get everything handed with no effort and yet have the audacity to complain bc what's being given (often times what they were even asking for) turn out to be not as expected.\n\nNot only it's a respect thing, it's more related to trust. I cant be friends with someone I can't trust.",
   "created_utc": 1691981833,
   "score": 23,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3my6f",
   "message": "He chose drugs. I did not",
   "created_utc": 1691988873,
   "score": 37,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3o66i",
   "message": "His wife sucks. She honestly drove most of his friends away. We still hangout sometimes though.\n\nAnother person I once considered a best friend became a pretty serious drug addict.",
   "created_utc": 1691989641,
   "score": 44,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3t13b",
   "message": "They were anti-therapy when I started it, when I cut down on drinking they got mad, when I talked about exes and depression they got mad. Basically if I tried to be a complex human being and not just their yes man they got passive aggressive and annoyed with me. They had my name saved in their phone with derogatory spellings. They always questioned my loyalty as a friend but honestly I just don’t think they even liked me but liked that I introduced them to a social life when they moved back from college and liked that I was a body to hang out with and drink with. Even when they were trying to be supportive and inspirational towards me their dialogue was stuff like “I thought you were a pussy but you started proving me wrong” etc",
   "created_utc": 1691992890,
   "score": 42,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3umy4",
   "message": "Lack of mutual respect. Seemed like it was all one sided too. They tried to reconnect but that just spurred a panic attack which is never good when they were once a good friend.",
   "created_utc": 1691994033,
   "score": 22,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3fxo8",
   "message": "they became angry alcoholics and often violent against their women...",
   "created_utc": 1691984854,
   "score": 16,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3lspj",
   "message": "He tried to steal from my parents",
   "created_utc": 1691988176,
   "score": 27,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3qa19",
   "message": "Unfortunately I think I’m going to be in this boat soon, but not caring about my recent diagnosis with an incurable, progressive disease. I’ve been quite sick these days, as I am taking modified chemotherapy pills for my treatment. My entire life has changed and my husband and I never got to be a happily married couple as I started having symptoms before, during and after our wedding. Scary symptoms too, like losing all sensation in my feet and going blind in one eye. We are unable to have children for another 1.5 years, which is something that has also been truly gutting for both of us.\n\nI’ve had very little energy over the past couple of months due to my treatment. Before that, I have been battling not only with symptoms, but also with deep depression stemming from this diagnosis. There have been days where I have wished I weren’t alive anymore. I am still working full time, despite all of this. So many awful conversations around all of it. What if my treatment gives me cancer? What happens when I inevitably need to go on disability? What can we do to move somewhere cooler since my disease makes me heat intolerant? This friend of mine never really asked how I was around any of it and wanted to carry on like it never happened. So I just didn’t talk about it with her and figured she wasn’t equipped to deal with it. Whatever.\n\nNow, my friend is pregnant and I haven’t been very involved because I’m having a hard enough time showing up for myself every single day. She has grown passive aggressive over this and is angry at me for not going out of my way to tell her how overjoyed I am 24/7. Again, independent of my symptoms/grappling with how my life is completely fucked up now, I was also planning on being pregnant now too, prior to my diagnosis. Her inability to acknowledge the profound sense of loss I feel around all of this is really upsetting.\n\nMeanwhile, two of my closest friends (honestly my real best friends) have checked in with me weekly. One of my friends even lives in a different state and has sent me care packages. I’m not asking for pity around any of this, but just wish my friend could exercise some level of grace and understanding towards me. She is really only a “best” friend at this point due to the age of our friendship, but I’m willing to cut my losses and move on.",
   "created_utc": 1691991013,
   "score": 9,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3skh1",
   "message": "Instead of talking to me like an adult about the (completely valid) issues she had with me, she just started treating me like shit until I got so tired of it that *I* ended the friendship. She moved out of state shortly after so I think she kinda just said \"fuck it\" with me since she knew she was moving, which really hurts despite knowing I have fault in our friendship falling apart.",
   "created_utc": 1691992567,
   "score": 26,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3z8wc",
   "message": "She never stopped doing the dumb shit we did in our teens/early 20s. Nail in the coffin was her not taking Covid seriously. She wouldn’t get vaccinated because she “didn’t have time” but then would post pictures online at a club or show or bar. Meanwhile she has two kids, no job, and lives with her mom who had cancer. \n\nI was working in the northeast tracking deaths and spread for my company. So I was literally reading daily about bodies in unrefrigerated trucks and overwhelmed hospitals. Made me furious.",
   "created_utc": 1691997502,
   "score": 43,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3mv6z",
   "message": "Dude fell for the trump wagon. Had a pretty loud fuck you moment drunk at a bar one night when he said something heinous about \"illegals\" never spoke to him again.",
   "created_utc": 1691988822,
   "score": 36,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3m133",
   "message": "Way way waaaaaay too needed. I had three kids with very active schedules and she wanted too much of my time and energy. She’d call me everyday. She’d get mad if I didn’t call her back the same day…it was just too much.",
   "created_utc": 1691988314,
   "score": 16,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw39zve",
   "message": "His wife.",
   "created_utc": 1691981801,
   "score": 15,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3n3wu",
   "message": "She wouldn't stop pushing her beliefs on me, even after we had our first fight about it and I told her that I wouldn't talk about my beliefs if she stopped talking about hers. She also never stopped complaining about her life, and it took a toll on my mental health and it just got really annoying.",
   "created_utc": 1691988974,
   "score": 14,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3riuo",
   "message": "Almost every time he is drunk at someone’s house he breaks something. Great guy, but when he’s drunk he is an animal and becomes unpredictable",
   "created_utc": 1691991846,
   "score": 39,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3t2dx",
   "message": "She was like a sister to me till she decided that telling a guy who was practically emotionally blackmailing me to date him a lot of things that I told her in confidence was a good idea. I was in a very vulnerable physical and mental state for a few months and he took full advantage of that and she played a solid role in manipulating me against his abuse by reiterating how he is the nice guy and I should be giving him a chance etc etc. I hate her guts.",
   "created_utc": 1691992915,
   "score": 19,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3tbgx",
   "message": "Her husband is the CEO of the company I work for. Lots of nepo-hires from her family including a cousin who was my immediate supervisor. Cousin proceeds to power trip by going ballistic that I had the gall to ask his immediate supervisor who is the highest rank in our department for leave for my honeymoon. I mentally broke down and quit then and there. CEO made things right by firing his ass but a few months later had to rehire the cousin as a rank and file for his wife, my best friend.\n\nShe hasn't considered how much trauma that caused. I haven't talked to her since.",
   "created_utc": 1691993095,
   "score": 23,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3xyky",
   "message": "They became transphobic",
   "created_utc": 1691996526,
   "score": 8,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3m9tu",
   "message": "He had found out that his wife cheated on him 6 years ago. I tried to be supportive but he let it turn him into a self proclaimed incel who thinks women are nothing but cheating liars, he thinks homeless people deserve it, and he thinks Trump did a good job. He either completely changed or showed his real self to me. Either way I had to get away from him",
   "created_utc": 1691988462,
   "score": 46,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3oog9",
   "message": "Religion. She’s a born again whack job. I’m an atheist.",
   "created_utc": 1691989967,
   "score": 27,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3n2k4",
   "message": "He became very \"fundamentalist\" Catholic. I know that's almost an oxymoron, I do not know any better term to describe it.\n\nI was Best Man at his wedding.\n\nAnd then I left the faith aand came out as Trans. It remains unclear to me, to this day, which of those two events he disliked more.",
   "created_utc": 1691988950,
   "score": 14,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3pn4p",
   "message": "He cheated on his wife, the woman I introduced him to.",
   "created_utc": 1691990596,
   "score": 21,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3tb0z",
   "message": "His girlfriend was very manipulative/drama thirsty and he lost the ability to think for himself. I feel like your partner can change you for the worst if you pick up their one of many bad habits and mannerisms.",
   "created_utc": 1691993086,
   "score": 21,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3owlo",
   "message": "she was constantly jealous over my other 2 friends, called them names and always tried to start a fight. It was so annoying.",
   "created_utc": 1691990114,
   "score": 4,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3p1x2",
   "message": "She told me she could no longer handle my highs and lows. The other part is too stupid to go into at all. Happy she did this. Do not want to be around people who do not want to be around me.",
   "created_utc": 1691990212,
   "score": 4,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3ryee",
   "message": "She wanted to control my life. Where I worked, what I wore, how I did my hair and makeup, stuff like that. Just kinda snapped out of dealing with it one day, and quietly moved out.",
   "created_utc": 1691992144,
   "score": 20,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3w1r0",
   "message": "My sister and I were friends with her together. \n\nShe was never a great friend to me, she was closer to my sister. They’re the same age (a year younger than me), went to school together, knew each other longer. \nShe always treated me at the third wheel, but I just wanted to fit it with my gorgeous sister and her gorgeous friend.\n\nI think at first we both had blinders on to her. She was always giving half compliments or very backhand compliments. She ALWAYS copied everything my sister did or wanted to do. It got to the point where she was constantly putting my sister down, putting her relationship down, making snide comments about how she looked (my sister is a fucking goddess and I am not just saying that), and it seemed like my sister just didn’t notice.\n\nOne particular weekend, my sister and i were in town and staying with her and I had had enough by the second night. My sister noticed my mood change and asked what was up. I ask her if she even realized what this person was doing? She said she hadn’t noticed. But then she thought about it and she realized I was right. I just told my sister she deserves way better than that. \n\nI distanced myself after that weekend, but she and my sister remained friends for a while longer. They finally had a falling out a couple of years ago where my sister finally stood up for herself and stopped putting up with this girl’s bullshit. \n\nI know that we are both better off for it. This person is the most toxic person I’ve ever met in my life.",
   "created_utc": 1691995080,
   "score": 42,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3wfmp",
   "message": "Told her I'd been SA'd. She replied 3 days later saying 'I should get over it and I'm not the only one who's got problems.' We weren't even kids at the time. I was 25, her 26. Haven't talked to her since. It's been 3 and a half years. Good riddance to her.",
   "created_utc": 1691995377,
   "score": 50,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3zntp",
   "message": "She fucked my bf",
   "created_utc": 1691997818,
   "score": 19,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw43cvy",
   "message": "Addiction. I've had two best friends who have now sadly lost their battle with drug addiction / mental health problems. Both of them took their own lives. I've struggled with knowing how alone they must have felt at the end... but in the grips of addiction I couldn't stand around and continue to be their friend while they destroyed their lives. I think about them often",
   "created_utc": 1692000729,
   "score": 23,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw44vs6",
   "message": "Turned out to be a pretentious twat",
   "created_utc": 1692001925,
   "score": 13,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3n3v9",
   "message": "When we reached HS he ditched me for the \"cool kids\". Sucked for a little but realized if thats who he wanted to be like then I didnt need him as a friend, Id rather be a loser than one of the douchebags he wanted so badly to be adopted by. They all talked the same, wore the same clothes, had the same haircuts, it was pretty sad and Im glad it happened",
   "created_utc": 1691988973,
   "score": 22,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3ribf",
   "message": "He was increasingly unreliable. Would make plans such as buy concert tickets and he would not show up. Always used work as an excuse.  Got tired of getting let down so I just stopped trying. He’s called recently and I’m worried he’s just getting in touch for some MLM scheme. I have anxiety about calling him back and my gut tells me to keep the status quo.",
   "created_utc": 1691991836,
   "score": 21,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw39uzb",
   "message": "Toxicity. I realized one day he was never going to stop being so toxic even though I had talked to him so many times about it, and finally managed to stand up for myself and tell him I was done",
   "created_utc": 1691981735,
   "score": 15,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3l4rg",
   "message": "TL;DR\n10+ year friendship. It was always about her, what she wanted, and what she deemed as \"right.\" No one else's thoughts or opinions mattered, only her's. \n---\nI spent my entire university career working towards traveling the world after graduation, and then the coronavirus pandemic happened. Couldn't travel, couldn't find work, and took a dead end job working at a furniture store because I couldn't find anything else. I was so depressed. My best friend of 10+ years called and asked me to visit her (40 miles away) right after I had just started this job, so I couldn't request off. I apologized and told her I couldn't. She cried and told me I'd forget about her if I didn't visit. All she could think about was what a bad friend I was being right after I had told her my dreams had been crushed. Meanwhile, she went to her dream school and was on the path to being exactly what she wanted. \n\nStrike 1. \n\nDuring the heated election between Biden and Trump, she asked me to explain how long lines were a form voter suppression. No matter how much I explained, she thought the people complaining about lines were just being babies and needed to get over it--not understanding the effect it would have on disproportionately affecting votes in certain communities. For someone who declared herself a \"patriot\", she sure didn't see why restricting access to voting was wrong. \n\nStrike Two. \n\nMy family are refugees from Laos. I have a complicated viewpoint of the US military because of the Secret War in Laos. I expressed to her that I hate US propaganda that constantly make us seem like \"the good guys\" when in reality a lot of innocent people (American soldiers and foreign civilians) have been killed for our interests. She says I \"need to stop talking\" because \"she has family fighting overseas protecting this country.\" ...I explain I wasn't talking about the men and women who bravely protect our country. I was talking about nationalist propaganda. But that's all she heard and shut me down. \n\nStrike Three.\n\nThere were so many other instances that drove me away from her, but those were the final three. \n\nI'm living in DC now with my dream job. Happy as a clam. Last I remember, she was $250k+ in debt from her Top Tier school. None of our mutual friends from our hometown talk to her anymore. Guess they realized she wasn't worth it either.",
   "created_utc": 1691987778,
   "score": 17,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3mxjf",
   "message": "joke that went too far",
   "created_utc": 1691988861,
   "score": 11,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3ocar",
   "message": "They gave me the ultimatum to either leave my family behind, or to cut contact.",
   "created_utc": 1691989750,
   "score": 4,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3rm43",
   "message": "For 6/7 of them it was that they were mean spirited girls that either scapegoated me, or treated me horribly bc of their insecurity and jealousy.  The one friend, it was just moving away and losing most contact, losing the bit we had left bc I quit the religion she was still in. That made me a bad person to know for her as far as the faith went.",
   "created_utc": 1691991910,
   "score": 3,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3t72a",
   "message": "currently getting into the process of moving away from them, but it's just so many red flags and things that piss me off. they have no manners, smoke/vape constantly even tho they know i hate that stuff, they're friends with really questionable people, super pushy and doesn't take no for an answer, very unaware of basic decency (goes to the manners thing). honestly i could list a shit ton of stuff they did that pissed me off but i'm not going to type it all. i feel bad cuz we've been friends since elementary school\nbut i can't handle the way they act anymore so i just keep ignoring their texts but imma be fucked when we go back to school :/",
   "created_utc": 1691993008,
   "score": 3,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3tlp9",
   "message": "They liked coke a little too much and not the cola kind. The one before that started on non prescription meth. Maybe it's me 🤔",
   "created_utc": 1691993291,
   "score": 3,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3uivw",
   "message": "Not best friends but someone I thought was a good friend decided to talk a lot of shit behind my back. I and other people started to realize he liked using people. He was using me because he had very little friends in our area but once he used my connections to make new friends he then stopped talking to me. 🤷🏻‍♂️He later apologized saying he feels so bad but he kept doing it so I was like lol okay bye.\n\nAnother friend said he just stayed at his house randomly and borrowed his car and drove around using all the gas. After dinner he Venmo requested money for dinner. If you stay for free at a friend’s place and use his car the least you could do is cover dinner, right? So my friend just Venmo requested him back for all the gas and for staying at his place.",
   "created_utc": 1691993952,
   "score": 3,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3umkf",
   "message": "Their addiction to Adderall and alcohol...",
   "created_utc": 1691994026,
   "score": 3,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3xz84",
   "message": "She joined a sorority and completely changed into a mean girl. Total 180 from the person I'd grown up with.",
   "created_utc": 1691996538,
   "score": 24,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3z0u3",
   "message": "She stayed Mormon and I did not.",
   "created_utc": 1691997331,
   "score": 7,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw420py",
   "message": "My mental health slipped beyond anything I wanted my friend to see so I ghosted them until I’m in a better place, which I’m very close to now.",
   "created_utc": 1691999678,
   "score": 9,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw426vz",
   "message": "I finally realized why any new people I tried to introduce her to did not like her. She was a Diva and would hide how rude she was with \"keeping it real\". I wish her the best.",
   "created_utc": 1691999816,
   "score": 18,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw498dp",
   "message": "We worked together and eventually managed different departments.   He bullied people.  At first I thought I was him trying to be funny.  Then I had people coming to hide in my department or asking me how I deal with him.  \n\nHis excuse is they can’t take a joke.  Or why do I care what they think.  \n\nI left that job last spring.  A handful of my employees followed me to my new job.   I doubt he would have anyone care if he left.",
   "created_utc": 1692005341,
   "score": 9,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3nb69",
   "message": "Staunch Trump supporter, follows his kids on IG, loves Ron DeSantis (also follows him on IG), anti vax. When my uncle passed from Covid in 2020 she somehow turned his death into a conspiracy, never once expressed her condolences towards me. Sleeps around unprotected knowing full well she has HPV, neglects to inform her partners until way after the fact. Friends since high school 2001-2020. Good riddance",
   "created_utc": 1691989098,
   "score": 14,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3ktq0",
   "message": "She was unhappy with her life and she took it out on me.\n\nRight after graduation she got a job as a flight attendant with a very famous airline. Apparently it had been her biggest dream (she had even kept the fact that she had been actively working towards it from me). But I think she had really bought the glamorized and romanticized life of a flight attendant without balancing it with some of the negative aspects of it. She became insufferable, materialistic, and racist (would tell me stories of how a certain race or nationality behave on a plane that’s most certainly a gross generalization). And she would put me down and try to make me feel as miserable. I didn’t like it, hanging out with her was no longer fun so I just stopped.",
   "created_utc": 1691987600,
   "score": 6,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3sm1u",
   "message": "She was working on a project for a mutual friend, one that had been paid for by this friend, and did such an awful job (not to mention she used total shit materials instead of using proper materials that would look good and last). Mutual friend was very unhappy, so I offered to try, turned out exactly what they wanted and ex friend got unreasonably pissed and blocked us both. Sad, really.. stupid reason to write someone out of your life. I even offered to help her instead of just doing it myself, but she wouldn't hear it.",
   "created_utc": 1691992599,
   "score": 4,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3s31f",
   "message": " Trump supporter. \nBye dude!",
   "created_utc": 1691992230,
   "score": 8,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3iss8",
   "message": "Time",
   "created_utc": 1691986429,
   "score": 2,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3kmo4",
   "message": "Them moving away and with no contact to be made.",
   "created_utc": 1691987482,
   "score": 2,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3nos2",
   "message": "We divorced",
   "created_utc": 1691989335,
   "score": 2,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3obmr",
   "message": "Different values. Constantly late. Feeling like I was trying harder than her.",
   "created_utc": 1691989738,
   "score": 2,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3ojtb",
   "message": "Location",
   "created_utc": 1691989883,
   "score": 2,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3pa5k",
   "message": "6000 miles of physical distance",
   "created_utc": 1691990363,
   "score": 2,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3q3vo",
   "message": "Politics, unfortunately",
   "created_utc": 1691990902,
   "score": 4,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3qfs7",
   "message": "Their lies.",
   "created_utc": 1691991119,
   "score": 2,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3r9sb",
   "message": "Always late and superficial.",
   "created_utc": 1691991675,
   "score": 2,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3sisk",
   "message": "Chronic alcoholism",
   "created_utc": 1691992534,
   "score": 2,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3ts9t",
   "message": "Stopped caring what he thought about anything",
   "created_utc": 1691993420,
   "score": 2,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3tv94",
   "message": "They became a fucking loser. No joke, they r a highschool dropout, drug addict, alcoholic, and they stole like thousands from their dad.\n\nAnother person: kinda became friends with the wrong Crowd and then treated me like shit. Never appreciated what I did for them. ( I let them stay over for 2 months. Ate most my food , left messes, etc)\n\nA few of my other friends just kinda drifted apart sadly.",
   "created_utc": 1691993478,
   "score": 3,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3u4ct",
   "message": "Crazy woman.   Then she did it again 10-15 years later.  “Fool me twice, can’t getchagin.”",
   "created_utc": 1691993660,
   "score": 2,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3u5y6",
   "message": "Turned into a raging misogynistic asshole. Started turning into that backwoods reject and filling in all the gaps so his new girl would like him more.\n\nThey're getting married next year and I haven't spoken to him in almost 5 now.",
   "created_utc": 1691993692,
   "score": 3,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3u8ue",
   "message": "She had been with e convicted pedophile, me, her family all said BAD IDEA  since she had a daughter around his victim age. Her response to us all saying LEAVE was we were JEALOUS of their relationship. Yeah got a call crying saying he was grooming her for 2 years. Not even a week after kicking that guy out she drives to our state (Missouri, to Arkansas) 2 hours from us WITH the same daughter to hook up with a guy she went to high school 20 years ago and couldn't grasp how stupid she was to endanger her daughter. Her response \"why is that so bad? I went to high school with him 20 years ago?\" I told her that she USED to know him 20 years ago she doesn't know him NOW! She still couldn't grasp it. Last I k ew she was sleeping with 5 different guys (one married) and had complained to me that she doesn't understand WHY none of these guys are picking her and WHY do they all keep telling her she's just fun to fuck with but not have a relationship with because she's not relationship material. These dudes expect exclusive she's obviously \"out playing the field\", but she also then expects these men to take on raising 3 kids, and doing all the work while she is a \"stay at home mom.\" She still couldn't grasp the fact that not one single man will just simply say hey yeah let me just work 50+ hours so you can \"stay home\" with your grown children (youngest the daughter is 10) her son's are 18+ and 17. She traps men into relationships and will work for about 8 months then quit her job and suddenly expect these men to pay her bills and take care of her and her kids. There is no conversation she just does this. She doesn't cook, she doesn't clean. Her ex husband (my husband's cousin), and her now pedo ex have both said the same thing. I myself have seen this. She invited people over and had them clean while she sits there. She's also that type of lady that sits there gossips and talks HORRIBLY about everyone as soon as they leave.",
   "created_utc": 1691993749,
   "score": 10,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3u9o1",
   "message": "Started spouting COVID conspiracies, I tolerated it for a bit until my dad passed from COVID and this guy just doubled down on the crazy",
   "created_utc": 1691993766,
   "score": 16,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3v83z",
   "message": "She got my little brother hooked on meth. She ended up being a heroin and meth addict, to date has been to rehab 6 times. (If she couldn't get heroin she would do meth till she could. I am aware one is an upper and the other is a downer.) Then tried to \"do\" him at a family event (funeral) (while underage.)... She used to be a different person when we first became friends and I'm not sure when she changed into a whoring druggie but I'm sure her personality changed when she got heavy on the drugs. It also didn't make sense as she came from a loving family, no abuse, no neglect, relatively wealthy for where we lived cars for a 16 bday nice jewelry as a monthly gift they paid for what ever hobby or extras she wanted as long as she kept the piano lessons. She got anything she wanted for the most part pending she had good grades and kept a pt job. (When I say whoring I mean before I found out about the meth we talked regularly about her sex list which had over 200 guys on it. The list included guys from when we were 16 to 23 when we had kept in touch...  20 best, 20 worst, 20 most creative, 20 most kinky, 20 weirdest dicks....) Sometimes I wonder how she is but I won't ever let her back into my life.",
   "created_utc": 1691994469,
   "score": 4,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3vco6",
   "message": "Talked about our friends behind their backs, often brought negative energy but not to me, and we really didnt talk much even if i’d talked first…",
   "created_utc": 1691994563,
   "score": 2,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3vf37",
   "message": "I was her emotional dump. When I told her that I don’t support her decision to cheat on her fiancé with her coworker, getting pregnant by her coworker and meeting his parents all while she and her fiancé were building a house together (and they also bought her mothers apartment complex and he was renovating the apartments by himself). I was the bitch for not understanding that she wanted to be a mother RIGHT NOW (her fiancé wanted to wait until the house and the apartment renovations were finished, which made sense to me) and this was the only way. When I then realised it had been months since she asked how I was doing, I just left and never answered her again.",
   "created_utc": 1691994612,
   "score": 12,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3vfi0",
   "message": "In hindsight, everything about the friendship had become one-sided. We always had to do the things she wanted to do and talk about the things she wanted to talk about. If not, she'd pout like a literal toddler. Towards the end of the friendship, I realized trying to talk to her was like trying to cross a minefield while blindfolded.",
   "created_utc": 1691994621,
   "score": 27,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3viur",
   "message": "Racism. I called her out on it and since then she has been passive aggressive, so I just don't really bother contacting her anymore.",
   "created_utc": 1691994688,
   "score": 3,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3vlb7",
   "message": "In the middle of my very emotionally painful  separation my closest friend since childhood comforted me while I was breaking down, right after the separation was over he came home to me with her crazy and insanely violent brother and told me he was seeing her now and threatened me not to talk about this to anyone or they would come back \"not as happy\", fun fact! I had just agreed and signed to rent his mother's extra apartment next to her. On Christmas eve I had to wake up to the sound of him lying and making up shit about me through the paper thin walls while they were opening presents and enjoying Christmas.",
   "created_utc": 1691994739,
   "score": 3,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3vq53",
   "message": "He ended up being an animal abuser",
   "created_utc": 1691994841,
   "score": 3,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3vytp",
   "message": "After an hour and a half of travelling to go out with him on his birthday, he text me when I was walking up his street telling me to go home with no explanation, no apology, nothing. Hasn't said a word about it since. \n\nThis was the proverbial straw, of course. Many other issues.",
   "created_utc": 1691995020,
   "score": 12,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw49m7z",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3ycag",
   "message": "I realized how many times I had to ask her to hang out and make plans and remake them when she canceled last minute before we'd actually hang out. And every time we did, she was going through a crisis and needed to cry and vent. I was happy to listen and help. But the TWO times in our whole friendship I asked for help, she couldn't make the time or just flat out ignored my texts. Realized she'd never once gone out of her way for me for anything. Stopped asking to hang out, and she still hasn't. Guess that's that.",
   "created_utc": 1691996808,
   "score": 44,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3wtfh",
   "message": "We had a group of 4 of us that were really close. The guy that has introduced us all to each other started dating an girl a decade younger than him. I knew her from school and warned him she was a pathological liar, but he decided I was the liar and jealous and turned the other two against me. They all stopped talking to me. 6 months later sure enough they realized she was full of shit and tried making amends with me but I couldn’t get over how quickly and easily they all turned on me so I just did my own thing. Fuck em.",
   "created_utc": 1691995667,
   "score": 31,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3webu",
   "message": "Money. Loaned a sizeable amount to my best friend in a time in need to buy a cheap car so he could start a job.  He got said job and blocked me from everything.  My Mom and his were best friends from when me and him were first born so we were always together.  Entire friendship down the drain over money.",
   "created_utc": 1691995350,
   "score": 29,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw4k1vp",
   "message": "We’d hang out on the weekends and smoke weed and play video games until we would go to sleep. I noticed my bags kept being suspiciously light the next day but I never really thought anything of it. \n\nEventually after a few weeks it started to get ridiculous, like I’d put my weed bag away and we’d go to sleep, and the next day it would literally be halved. So I started weighing it before I’d lay down, and then I’d weigh it again after he went home the next day and he was definitely taking weed while I was sleeping. \n\nOne day I wake up and see him with my bag putting nugs into his own bag. I didn’t say anything and did some head math, and I was like this mother fucker has stolen hundreds and hundreds of dollars worth of weed from me without even asking.\n\nI wasn’t gonna end the friendship over that, but the next time we hung out I had my weed stored in the shed and didn’t let him smoke any. It was awkward because I could just tell he was waiting for me to pull out the weed and start a sesh but I just wasn’t going to. He asked if we were gonna smoke and I was like no, I’m basically out, he asked a few more times before we went to sleep. In the morning before he went home he asked if he could have some weed for when he got home and I was like dude no lol.\n\nA few weeks go by and we’re hanging out like usual, and we meet up with one of our mutual friends randomly at McDonald’s and he asks my best friend “if he has anymore of that weed he can buy” and it all clicked. Homie stole hundreds of dollars worth of weed off me, and not only that but made a profit by selling some of it.\n\nIt would have been one thing if he just asked if he could have some, or better yet buy some. I wouldn’t have cared either way if he decided to sell it afterwards. I also didn’t entirely care that he stole the weed, it’s just herb and I had a good job so I could afford it. But it was the combo of stealing it behind my back and profiting off of me essentially losing money without even asking once. Haven’t talked to him in like 5 years besides one time during covid but the vibe was gone and I couldn’t wait for the conversation to end.\n\nDamn didn’t realize I wrote so much about such a stupid thing lmao",
   "created_utc": 1692012672,
   "score": 67,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3uq77",
   "message": "They started to hang out with the person that dislikes me and said “they didn’t do none wrong to me”. The betrayal and anger I felt.",
   "created_utc": 1691994099,
   "score": 3,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw42h8m",
   "message": "I learned that she was telling others that we've been dating for several months and were planning a future together in Australia with adopted kids. imagine my surprise and confusion when one of her college friends asked me why I haven't put the moves on her [ex-friend] yet.\n\nI also realized after the fact that she'd been pushing me away from my other friends and was trying to monolopolize all of my free time. also, she made quite a few back-handed compliments and \"just joking\" comments.",
   "created_utc": 1692000044,
   "score": 3,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw4q9le",
   "message": "-only would talk to me to complain abt their life, and not once asked abt me.. would keep me on the phone for HOURS and not stop talking that whole time\n\n-another friend got sucked down the qanon/trumpie wormhole and he never got back out.. it was exhausting being constantly debated and hearing abt total bullshit conspiracy lol",
   "created_utc": 1692016032,
   "score": 3,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw4qtcp",
   "message": "She used to pick me up and drop me whenever she pleased and never wanted to do anything unless it was completely on her terms, couldn't hang out with someone else without getting the third degree, her mentality for everything was so incredibly negative and definitely taught me some bad habits.",
   "created_utc": 1692016311,
   "score": 14,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw4qvn5",
   "message": "It was always me checking in with her asking her to do things etc... Now I have 0 friends.",
   "created_utc": 1692016343,
   "score": 9,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3x2s7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw5hzyn",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3zkbc",
   "message": "she was a good friend in a lot of ways and helped me through some major areas of my life but i couldn't stand the inconsistency. she would only gas me up when i was very low. when i was on my high or neutral even, she would make very underhanded comments.\n\nex) me- \"we're both beautiful girls so we should stop thinking we're ugly\"  \nher- \"well, at least i am\"\n\nex 2) me- \"i really liked that workout class! thanks for bringin me\"  \nher- \"it's so funny when i see you trying to work out like you think you're so strong or something\"\n\njust unnecessary lmao. like it's not funny, it's not adding value to anyone so just stop. and then she'll call me beautiful when i'm crying about a guy or smth. like how can i believe you when you tried to call me ugly a few days ago? when guys would like me she would look at me in a really weird way too; if i had to guess what she's thinking it'd be along the lines of, \"what's so special about her?\"\n\nshe'd also go through periods of ghosting me like when i was dealing with a major heartbreak and my dad was in the hospital then come back to my life when it was convenient to her and when i didn't respond say \"oh i was worried something happened with your family\". well you wouldn't know since you basically left me on read so you're not the first person i'd go to lol.\n\new, typing this out and reading it back makes me realize i made the right decision. i want friends that are consistent and love me when i'm on my lows and my highs. just didn't feel like she could truly be happy for me without comparison. glad i let that go.",
   "created_utc": 1691997741,
   "score": 16,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw3zop5",
   "message": "She promised to visit when my dog died but then she didn’t. Then she promised to visit when she got her new car but didn’t. She’s still not met my son who is nearly 2. I’ve given up. I did so much for her but it appears it was one sided. I still miss her and what I thought we had",
   "created_utc": 1691997836,
   "score": 9,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw4nkmr",
   "message": "When he started dating his now wife. She was jealous because I knew him longer than she did (?????) and made him block me in everything. She also made him block several other friends for the same reason, and all the girls he had in his Facebook because \"they were all bitches\". \n\nShe even made a post later bragging about making him stop talking with all the bitches in his life. 🤷‍♀️\n\nHe did followed me on insta years later, but I never reached out. Best keep the distance of spineless guys and their insane wifes.",
   "created_utc": 1692014641,
   "score": 10,
   "submission_id": "15qhzfy"
  },
  {
   "comment_id": "jw5tt9v",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15qhzfy"
  }
 ]
}