{
 "submission_id": "15qn3rh",
 "title": "Why do you think so many people grow up depressed?",
 "selftext": "",
 "created_utc": 1691996235,
 "permalink": "/r/AskReddit/comments/15qn3rh/why_do_you_think_so_many_people_grow_up_depressed/",
 "score": 147,
 "url": "https://www.reddit.com/r/AskReddit/comments/15qn3rh/why_do_you_think_so_many_people_grow_up_depressed/",
 "comments": [
  {
   "comment_id": "jw3xuyb",
   "message": "I mean, look around. The world's on fire",
   "created_utc": 1691996450,
   "score": 225,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw3z7bm",
   "message": "Bc everybody is full of sht and nothing matters.",
   "created_utc": 1691997469,
   "score": 198,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4ind1",
   "message": "Age 5: What do you want to be when you grow up?\n\nAge 10: Work hard or you can't be X when you grow up.  You don't want to end up in retail or waiting tables...\n\nAge 17: Go to college for X or you won't be able to be X when you start working.\n\nAge 23: You don't just BECOME X because you have a degree.  Gotta pay off that degree somehow.  Work retail or wait tables and do X on the side until you make it.\n\nAge 30: X is no longer a career you can live off of, even if you \"make it,\" maybe in the 90's it was.  I don't know what you were smoking getting that degree.  What a waste.  Better hold on to that retail/foodservice job and hope you can get an online degree for something useful.  Why don't you have a house/car/kids yet?\n\nHow we treat career education in the US is appalling.  \nWe set kids up to feel like failures.",
   "created_utc": 1692011840,
   "score": 190,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw44hq3",
   "message": "Constant comparison with others",
   "created_utc": 1692001618,
   "score": 97,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4863k",
   "message": "The world is changing at a faster pace than the average person can cope with and then we are blamed for our own misery. Because sure, you're responsible for yourself. But you can't change the world, which makes it hopeless. And a major cause of depression is the (illusion of) inability to change things. \"Learned helplessness\" in a sense. All the psychological stresses are normalized to an extent that those who can't cope with this \"normality\" are considered pathological. It's really just a collective of powerful people shifting or narrowing the normal curve because it's profitable and shitting on everybody who doesn't want to comply - or who can't comply - turning into depressed people. They can't even change themselves for the better because some people aren't stress-tolerant enough or simply already have enough stress and can't deal with even more. So it's a mix of biological factors, pure luck and arguably a little bit of willpower (which on the other hand is also hereditary and depends on the people you are surrounded with). But it's not their fault. If you put a caveman into today's society he would get mad in no time. It's natural.",
   "created_utc": 1692004523,
   "score": 152,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw407x9",
   "message": "I think that even for the ones that do not stem from trauma or childhood, we live in a society that puts increasingly more pressure on its society than ever before. Also, mental health has become less of a taboo and we have the means to diagnose ppl much better, so stuff like autism and ADHD are now much more visible than ever before (despite some ppl claiming \"we didn't have autism in my day\"). So imo we are slowly seeing the effects of both this and the fact that more people seeking help for mental health issues, our current society puts on us",
   "created_utc": 1691998261,
   "score": 45,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw3y3yc",
   "message": "For me it was an alcoholic parent, 1 income household, financial insecurity that we had to hear about 24/7, too many siblings, constant struggle of comparing myself to my peers, it all manifested into severe mental illness as I got older and I experienced more disappointment and trauma.",
   "created_utc": 1691996638,
   "score": 57,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw47fc2",
   "message": "After long consideration of socio-economic factors over the past hundred years, my own personal conclusion is that Capitalists saw the shift of women's empowerment as a \"perfect storm\" to exploit not only the average working man, but also the average working woman to create a larger market of consumers with income to buy their products.\n\nAs a result of coordinated planning, cartels and monopolies, wages stagnated while technology yielded incredible improvements in productivity. The two working parent household became a necessary dynamic to \"keep up with the Jones'\" and live the American dream of 2.5 children, a house, a car and a dog.\n\nThe end result for children were severely disengaged parents that gave less attention to their kids, were less involved in their education, and allowed far more time for idle hands and frustrated introspection from teenagers.\n\nThe grim truth is that the standard of living has been gradually declining for households with children, and children feel the most effect from that. Capitalism's cancerous overreach is, imo, the root cause of so much suffering. The system is unsustainable, and we are approaching it's collapse.",
   "created_utc": 1692003940,
   "score": 74,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw43djq",
   "message": "School,parents that don’t know how to parent right, and most likely politics and economic conditions have a part in it too",
   "created_utc": 1692000744,
   "score": 11,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4bfpe",
   "message": "Lot of factors to list off a few if we cut out childhood traumas. \n\n- Access to information. It's not to say people didn't see or hear bad things on the news or the likes before. But now people can pick up their phone or just glance at a device and even if they're not intending to cancel see something horrible going on. Makes people feel hopeless when EVERYTHING seems like it's on fire and that you can't do anything. \n\n- Isolation/expectations. More so coming off of the pandemic shutdowns (yes even still), a lot of people are alone, sometimes minimal or no contact with no idea how to. Coupled with the expectation that you should be married, have kids, and be surrounded by friends it can be crippling to some of even one of those are missing (and for many all of them are). \n\n- Work life balance and general work life. People work A LOT and very few people actually like their job, even in a field they want to be in. It also just eats a lot of time, so even when you get a break, suddenly you're doing errands for half a free day and realize you haven't had a moment to yourself. Couple all of that with jobs across the board being more demanding it's easy to get lost in a cycle of another day going by with brief snaps that months or years went by and you've not enjoy most of that time. \n\n- Realization of getting older/getting trapped in the past. Kind of couples with expectations of yourself, but getting hung up on what you haven't done and what's past rather than on what there is to accomplish. Although it's not always to say people don't get depressed looking forward either, by setting sky high goals they feel they can't reach, or negative events happening like the loss of a family member/someone close. \n\n- Getting stuck in the headspace. When you're sad/depressed you often compound by connecting to other moments or sadness or depression, wh re good memories often feel lackluster or far and few between. It's important to get out of the headspace, pick out something that was good every day and build the habit to think on the positives when you can. Even small stuff like \"what I had for dinner tasted good\" or \" I heard something funny\".\n\nAlso as a big ending note to this list. I know it can seem depressing and believe me I deal with my own dark places often. However you have to keep moving on, look on the bright side when you can, and just set achievable goals, even something small and easy for yourself and strive to achieve them.",
   "created_utc": 1692006992,
   "score": 31,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw43hye",
   "message": "1. Shit parenting.\n2. Serious entitlement problems where these perceived entitlements aren't actually handed out for free\n3. Too much uncontrolled/unmonitored access to social media (usually through the fault of bad parenting and companies pushing things on kids)\n4. The mainstream media. It is just dogshit on every channel at any time.\n5. Shit funding for schools leading to important classes and event cancellations as well as discount teacher hires. You get what you pay for therefore if you pay shit wages to teachers, you're going to get shit teachers.\n6. Ease of access for things that give instant gratification. Search what you want and instantly get it. This causes impatience if kids are given access too early. There was a study that showed the dangers of giving your young ones access to Cocomelon YouTube videos. It changes scene every single time in under 5 seconds. This leads to kids having serious issues with patience. Growing up impatient can definitely cause depression issues",
   "created_utc": 1692000842,
   "score": 47,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4cmrr",
   "message": "Modern life is just too stressful for a lot of people.",
   "created_utc": 1692007860,
   "score": 7,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4i0om",
   "message": "School",
   "created_utc": 1692011451,
   "score": 4,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4i5dn",
   "message": "Reality as you get older often doesn't meet the expectations from our youth, as you grow older you get more dissillusioned about how the world works, and aspirations and dreams don't always survive.\n\nI think those things can play a part.",
   "created_utc": 1692011533,
   "score": 166,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4kq0z",
   "message": "Capitalism",
   "created_utc": 1692013058,
   "score": 2,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4jh9q",
   "message": "Childhood abuse was normalized for far too long. It does not do good things for a human to be raised an environment where they are constantly neglected, ridiculed, humiliated, compared to their siblings, treated as property and not human beings with their own needs and feelings. Boomers really only had one book on child-rearing that came out in 1946 by Dr. Benjamin Spock. Child rights weren’t even a thing until the 80s, and let’s not forget that we’re living in a capitalistic patriarchy, whose main intent is not to turn out happy citizens or fulfill their needs, but rather to exploit them for labor. We do not live in a system that is built for long-term happiness.",
   "created_utc": 1692012335,
   "score": 13,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw3ztmm",
   "message": "i think its forcing yourself to be someone your not, trying to be like everyone popular from social media maybe",
   "created_utc": 1691997944,
   "score": 11,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw40i9a",
   "message": "....what you've never run into hard times?\n\nMust be nice",
   "created_utc": 1691998486,
   "score": 7,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw3ybwf",
   "message": "F-ed up childhood",
   "created_utc": 1691996801,
   "score": 6,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4c7gz",
   "message": "#1 We all idealize and promote the dark triad personality traits.\n\n#2 And we shame and demote weakness.\n\nThis creates a world where you are in constant stress to be perfect, to never make any mistakes or fall out of norm. \n\nWho can be happy if they are not allowed to be themselves?  And to have flaws?",
   "created_utc": 1692007558,
   "score": 11,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4fw16",
   "message": "Few people have meaning in their lives, have few if any friends, and don't belong to any community, if any communities even exist around them. Their lives are atomized and they're just irrelevant replaceable cogs in some massive nondescript machine called society. \n\nAdd your typical social media to that where for the typical normie it's being subscribed to a bunch of people who constantly show off a better life than you and reading nothing but ragebait and arguing in the comments about it. \n\nA lot of people live a frankly soulless existence and it's no wonder they are depressed as a result.",
   "created_utc": 1692010107,
   "score": 12,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4gish",
   "message": "Because their parents are depressed.",
   "created_utc": 1692010511,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4h7po",
   "message": "Ahhh this is easy we grow up being constantly told that owning this and tht would make us so happy then when we do get it or not get it hen there is something else we should have. and eventually we cant have it because we live on a material world where poeple care more about what they have than who they are and grown up children take more care of a sofa than they do thier parents and poeple treat possessions like they have a Beating heart even more over poeple this world is so messed up poeple are willing to hurt real poeple rather than thier things .. i could understand if it was last bit of food or something by it isnt. You olny have to ask how many poeple you know care about things without a heartbeat",
   "created_utc": 1692010947,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4ha0h",
   "message": "Poverty\n\nToxic/abusive parents\n\nToo much work/school stress\n\nNo future.\n\nThe world is going to shit\n\nNo medical help.",
   "created_utc": 1692010987,
   "score": 18,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4hqt8",
   "message": "as abba said so nice: \"money money money\"",
   "created_utc": 1692011278,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4i2ln",
   "message": "Because we're hooked on consumerism and productivity and high expectations since the youngest of age.",
   "created_utc": 1692011484,
   "score": 2,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4nsz1",
   "message": "Controversial opinion: I don’t think most of them are depressed, I think most lack direction in life",
   "created_utc": 1692014764,
   "score": 3,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4phm5",
   "message": "For me, it's change.\nI hate change.\nSo you can only image within the same 2 years (11-12) how hard it was for me when I hit puberty, went to a new school, started taking the bus, got a new baby sister, my dog died, I got new friends and my old ones left me. It wasn't fun.\n\nWe also live in a broken world. What's not to be depressed about.",
   "created_utc": 1692015641,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw43b5d",
   "message": "People are horrible to each other. Some can take it. Others cant and all those terrible people chip away at them for years until they break mentally.",
   "created_utc": 1692000690,
   "score": 10,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4c203",
   "message": "Lack of exercise, lack of exposure to the outside world, poor diet, lack of clear goals.\n\nBasically, you're a bunch of fat, lazy bastards and that's not good for you on any level.",
   "created_utc": 1692007449,
   "score": 2,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw46re0",
   "message": "People don't rely on discipline anymore but on motivation to get things done. Motivation ist not reliable.\n\nIf you work hard every day regardless of your feeling. If you learn a New skill, go to the Gym even when you don't feel motivated...then you wont become depressed.\n\nYou become depressed If you don't do anything because you don't have motivation. You chase the quick dopamine. Yeah a pizza and Netflix is awesome! Video games are awesome too right?\n\nWell do it long enough in a certain frequency and you become ugly. You don't want to meet people because you feel worthless. You get rejected by people because you don't offer much....and to escape that you Play more video games and chill at home.\n\nYour wasted potential makes you depressed just because you don't show discipline\n\nHow long have it been that you went to the gym? And why are you not start working out and eat healthy?\nMimimi excuses incoming",
   "created_utc": 1692003423,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4arzj",
   "message": "We put massive stress on everyone since they are like 5 what did we expect? We need the first years of education to be much more focused on doing and learning by playing with others. We need to stop putting the weigh of the world on our teens, too. I know why I first developed depression, because I was physically and emotionally abused at home and school, and depressed became the baseline for my experience in life. It didn't help that when the abuse lowered and eventually dissapeared, I was still being crushed by incressingly demanding academical challenges and constantly hearing about how teenage me needed to know what to study or risk messing up her whole life.\n\nI have only been happy when giving and being surrounded by love, that is my reason to live. Whether I use my degree a lot or end up working somewhere else doesn't matter that much to me anymore. I just want to be able to cultivate meaningful relationships, to offer myself to someone who loves me, and to surround myself in precious friendships. However I pay for that is not that important.\n\nThing is, I am particularly privileged to have the chance to notice that. I've finished studying and work few hours while I heal from burnout and a rough patch in my life. Most people don't get this break, they go from depressed teens to depressed adults studying and then slaving away at work.\n\nEducation is super important, but how we educate is the most important aspect of it. Right now, very few places have it right. We treat young people as if they were workers because we have to \"prepare\" them for the real world. Kids being handed punishments and hours of homework and told to attend school and then keep studying at home so they can compete with all the other depressed kids.\n\nThis is bullshit in my honest opinion. Why prepare people for a shitty world when we should be inspiring them to make it better? We have the technology to be esrning more from working less and yet we keep pushing kids to work harder than the last generation ever did.",
   "created_utc": 1692006509,
   "score": 5,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4fh7i",
   "message": "100% your fucking cell phone.",
   "created_utc": 1692009834,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw3xsy4",
   "message": "Probably learned it from their parents.",
   "created_utc": 1691996408,
   "score": 3,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw42agj",
   "message": "Because SpongeBob turned bad",
   "created_utc": 1691999894,
   "score": 2,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw41wfc",
   "message": "Because most people who have kids are not good enough to have kids and shouldn’t be allowed to have them.",
   "created_utc": 1691999583,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw44ol8",
   "message": "Society and bad parents. The younger generation is in some problems the older generation didn’t give a shit to fix.",
   "created_utc": 1692001769,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4btwh",
   "message": "Undiagnosed issues and shitty parenting either of themselves or the kids around them.",
   "created_utc": 1692007283,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw41fn3",
   "message": "Hormone imbalances and excessive indoctrination in schools.",
   "created_utc": 1691999219,
   "score": 253,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw44w8h",
   "message": "abortion is generally frowned upon by society.",
   "created_utc": 1692001935,
   "score": 255,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4acmc",
   "message": "My question is. How do so many people grow up completely oblivious to the horrors of existence on this planet?",
   "created_utc": 1692006187,
   "score": 253,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4cf81",
   "message": "Capitalism people working longer hours no time with family or for hobbies everyone from 1st world countries have a sense of entitlement the media only shows news to make you sad or angry the media pitting people against each other either through sexual orientation or race and that's just off the top of my head",
   "created_utc": 1692007711,
   "score": 255,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4gjx6",
   "message": "DEPRESSION ISN'T REAL",
   "created_utc": 1692010532,
   "score": 252,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw45a4b",
   "message": "It all…. And I **mean** all… can be blamed on bad parenting.",
   "created_utc": 1692002241,
   "score": 249,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw3ykmp",
   "message": "In my opinions the top 3 are game addictions , drug addictions, and losing a family member",
   "created_utc": 1691996984,
   "score": 253,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4cwzn",
   "message": "Even tho I'm not depressed I can understand that the world sucks and the life is a torture. How am I not depressed? The life already suck you have to make it worse with depression?",
   "created_utc": 1692008067,
   "score": 0,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw465pp",
   "message": "Because they won’t set goals , allow others input into their lives , don’t work out , me I was taught depression is a chemical we make on our own that we can clearly stop our bodies from making . Just don’t allow things to ruin you . Stand up and fight for your happiness no matter what . I’m my water boy fans voice (You Can Do It )",
   "created_utc": 1692002952,
   "score": 249,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw47avc",
   "message": "Social media",
   "created_utc": 1692003845,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw47n2o",
   "message": "Watching the news.",
   "created_utc": 1692004107,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4834m",
   "message": "Our parents fucked around, and we're all finding out.",
   "created_utc": 1692004456,
   "score": 15,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw48hy5",
   "message": "I'm not sure but I'm sure it is your fault.",
   "created_utc": 1692004773,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw48ysm",
   "message": "Late-stage capitalism.",
   "created_utc": 1692005132,
   "score": 255,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4arq0",
   "message": "An entire gender talking shit about another gender.\nSociety removing the societal ladder that used to make you want to climb, but now you will end up being mediocre nevertheless? Yeah, I don't know.",
   "created_utc": 1692006504,
   "score": 0,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4b70e",
   "message": "Because people keep voting for republicans",
   "created_utc": 1692006812,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4b86s",
   "message": "I come from the country and for a lot of people here it’s the generational poverty, alcoholism, addictive personalities, and the lack of coping skills. No one really knows how to deal with the shitty things in life so they turn to a bottle or drugs and end up poorer than they already were.  I’ve definitely been guilty of looking to liquor for support and it sucks. But yeah that’s what I think the reason is for so many people growing up depressed. At least out here",
   "created_utc": 1692006836,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4bqol",
   "message": "“Good times create weak men.”\n\nWeak in the sense of not as resilient, not weak because you’re depressed. When you don’t have to worry about basics needs 24/7, you worry about things that don’t matter. Things that don’t give you any real meaning. \n\nWhen you have to literally go out and get food or don’t eat today, you worry less about how come you can’t afford a vacation to the Maldives every year or why Emily doesn’t like you back.",
   "created_utc": 1692007219,
   "score": 2,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4cuhp",
   "message": "Negativity on social media, society having a shit ton of problems, and personal stuff ig",
   "created_utc": 1692008017,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4cz4m",
   "message": "The world is shit.",
   "created_utc": 1692008109,
   "score": 255,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4d2co",
   "message": "Have you been outside lately? Or watched the news?",
   "created_utc": 1692008172,
   "score": 255,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4d87o",
   "message": "Because information age is a double edged sword, and part of this includes being exposed to a certain knowledge.",
   "created_utc": 1692008289,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4d9ks",
   "message": "After reading most of the answers, none of them are why I have dealt with depression.\n\nI had a great childhood. I don’t have money issues. I haven’t been pretending to be someone I’m not.\n\nI lacked human interaction. We are social creatures; we are not meant to be alone. My job was pretty isolating, but I was still pretty social playing in a volleyball league, hiking \u0026amp; mountain biking with friends, going to the climbing gym with friends…. until the injury. \n\nWhile injured I couldn’t do any of the things that brought me joy and human connection. This started a pretty dark spiral that I’m lucky to have escaped. And it’ll probably happen again, cause this wasn’t the first time.",
   "created_utc": 1692008315,
   "score": 8,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4dook",
   "message": "People become parents without even picking up a book on raising a child. Imo the majority of parents aren’t good parents.",
   "created_utc": 1692008602,
   "score": 255,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4duc6",
   "message": "In today's world I find it more common just because of social media influencers trying to always make it seem like they're always happy 25/7 and when young people see this they think that they're supposed to be the same way but in reality without sadness there wouldn't be happy",
   "created_utc": 1692008710,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4enpa",
   "message": "My gf left me on Christmas",
   "created_utc": 1692009275,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4ev1u",
   "message": "My Mother had a sixth grade education that was probably enough, but my instantaneous death, and unheard of survival from so many obstacles, had her doubting herself at every turn. She had worried herself ragged. I'm the same way now.",
   "created_utc": 1692009412,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4fajo",
   "message": "older generations have normalized child abuse as a form \"discipline\" when in fact, youre making your own child resent them and taking away their self asteem",
   "created_utc": 1692009708,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4fcpz",
   "message": "Because",
   "created_utc": 1692009750,
   "score": 0,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4fg9z",
   "message": "Well as an Asian kid a big role is played by parental \u0026amp; academic pressure",
   "created_utc": 1692009816,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4fgwh",
   "message": "It's not that depression is on the rise, it's that mental health awareness and diagnosistic modalities have gotten better.",
   "created_utc": 1692009828,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4fx5r",
   "message": "There's a few working theories that I think will (or have already) been established as being impactful on mental wellbeing of under 20s. \n\nThe first is lack of social interaction due to indoor living becoming the norm. Here in the UK kids hardly ever 'hang' outside any more. I live in a village with 1000 souls and the only times I see teenagers on the road is when the school bus comes back. I don't see them playing football in the park or kissing under the trees or anything like that. That is purely anecdotal, but there are clear indicators that being in full daylight is beneficial to your mental health as well as being 'active' in terms of exercise. \n\nThe other thing that is increasingly under the spotlight is (ultra) processed food. We live in an age where the food we eat is so artificial (because it's more 'convenient') that our gut flora has changed dramatically. The link between a healthy gut flora and mental wellbeing is being demonstrated more strongly in science and progress in this area makes it seem inevitable that healthier eating (and drinking) contributes to better wellbeing.",
   "created_utc": 1692010128,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4g7mo",
   "message": "Childhood trauma",
   "created_utc": 1692010314,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4gtq6",
   "message": "Attention, confused and generally an easy help me card for likes from friends",
   "created_utc": 1692010704,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4i7kh",
   "message": "This shit is rigged against 90% of people",
   "created_utc": 1692011571,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4isg1",
   "message": "Probably Childhood, Bad parents, or bad decisions in life",
   "created_utc": 1692011926,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4itg6",
   "message": "People grow up realizing that the American Dream just doesn't become a reality for everyone. Not everyone can be a homeowner, business owner, rich or wealthy. \n\nThe basic necessities shelter and food are increasingly expensive.",
   "created_utc": 1692011943,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4iuv5",
   "message": "I think, aside from some cases where it's genetically determined, depression mostly stems from a sense of uselessness and hopelessness, especially the latter.\n\nUnder our current capitalist system the worth of a human being is determined solely by economic output benefitting the rich and where automation is supposed to lead to lower workloads and increased leisure, it instead leads to the obsolesence of the working class in the eyes of shareholders and culture is shaped to communicate that notion clear as day.\n\nSo we create a world where everyone needs to be exceptional to matter, and we tell kids that they can achieve excellence simply by effort.\n\nThe problem is: excellence by definition is exclusionary, so of course most people will not achieve that and will, as societies work, assimilate under the quiet masses which would usually be fine, in a culture where participation itself is valued as it should, but here even the government, through unliveable salaries and extreme expectations, tells you that you are in fact worthless and that you have no human value.\n\nIt is hard not to let that get to you.",
   "created_utc": 1692011967,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4iye0",
   "message": "Who knows..? I guess life just ain't what it used to be there's no penitentiary built big enough for me..",
   "created_utc": 1692012026,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4k0uz",
   "message": "Technology like social media that keeps people in their own little bubbles and destroys a sense of community. There have been recent studies done showing that depression is virtually unheard of in more primitive cultures where people live in tight knit communities, despite those people having to work much harder to survive than the typical westerner.",
   "created_utc": 1692012656,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4k37s",
   "message": "Because families aren't families anymore, women call in back up from other groups of people that end up destroying the team you wanna build.\n\nI can attest for this",
   "created_utc": 1692012693,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4k3lo",
   "message": "Because the system we live in makes simple things like getting a job and a family a lot harder than it should be and for no apparent reason",
   "created_utc": 1692012700,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4ka7l",
   "message": "Because they don’t have perspective sometimes. I had it pretty tough as a kid—but other kids had it tougher.",
   "created_utc": 1692012807,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4kbas",
   "message": "Lack of social support.  Whether due to a poor work life balance, a poor financial situation or health conditions, most people don't have a support base of friends and family members to alleviate stress or to simply help. \n\nYou'd be surprised what having a friend to talk to every once in a while can do.",
   "created_utc": 1692012825,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4kkq2",
   "message": "The world is on fire.\n\nYou grow up surrounded by bs, you look around you snd you're still surrounded by bs and then you reach out and you're still surrounded by bs.\n\nEverything's on fire so you look at social media and you see that the world is on fire.\n\nYou go  back and lock yourself inside your little box. You hide yourself from the world. Turn yourself off. Become numb. You hide from the fire but you also don't get to experience the kind warmth the sunlight gives you",
   "created_utc": 1692012974,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4l370",
   "message": "Our parents fucked us up",
   "created_utc": 1692013272,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4ldzm",
   "message": "We are not meant to spend our lives working then the rest being to tired to do what we want.",
   "created_utc": 1692013442,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4lk14",
   "message": "Nature vs nurture. Falling apart society plus abusive parenting in one way or another (general statements of course, and abuse can be from beating to starving to neglecting. It’s a very broad scope)",
   "created_utc": 1692013537,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4lkqf",
   "message": "Childhood trauma.\nGeneral mistrust in people.\nAddiction to social media.\nBeing betrayed over and over again.",
   "created_utc": 1692013548,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4lv9x",
   "message": "They think they deserve more than they are willing to put in.",
   "created_utc": 1692013713,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4m3sq",
   "message": "Modern life for the average person is depressing and unfulfilling by default. We’re responsible for creating our own joy and peace, but there’s hardly time with all the bullshit we’re forced to deal with. School, work, and everything else. No time or energy left to do anything but survive, rest, repeat. But we get to constantly have it rubbed in our faces that a handful of rich jerkoffs don’t have that experience. They get to live like every day is a vacation. They live like gods because they have better numbers on their screens (bank accounts) than we do. So they get to live what the rest of us can only dream about. That’s depressing too.",
   "created_utc": 1692013843,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4m8x0",
   "message": "Sabbatean monopoly.",
   "created_utc": 1692013921,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4mtxm",
   "message": "Because they were paying attention",
   "created_utc": 1692014242,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4n61f",
   "message": "https://www.youtube.com/live/J8XejQ9lFz4?feature=share",
   "created_utc": 1692014424,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4ngo9",
   "message": "Because, life sucks and then you die.",
   "created_utc": 1692014582,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4o1ek",
   "message": "Bad parents, bad countries, and overall the world has been in a bad state for awhile now, people just didn't start noticing until 2018.",
   "created_utc": 1692014888,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4o6p5",
   "message": "Screen time.  Go back to zero and play outside.  Get that sun and vitamin D and interact with your peers.  We were made to be running around outside, adventuring.  Now all of our adventures are watching other people do it from our couches.",
   "created_utc": 1692014964,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4o9v7",
   "message": "Because those bringing them up have had their own issues and absurdity of the world at large doesn't help.",
   "created_utc": 1692015010,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4orei",
   "message": "Not making good life decisions !!!",
   "created_utc": 1692015264,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4oyid",
   "message": "What's there to look forward to?",
   "created_utc": 1692015367,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4p5o9",
   "message": "Because seemingly the world keeps on inventing new ways to get worse.\n\nWhich is funny, when you think about it. \n\nThe world and life has always been bad. \n\nWe think about how $20 used to buy groceries,  but that is also when you only made $9hr - which was fantastic. \n\nNow $20 gets you barely anything.",
   "created_utc": 1692015471,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4p8dt",
   "message": "I don't think I have it in me to write down literally over 100 issues that exist for people to grow up this way because I wanna move on to the next post and comment there.\n\nI'll just try to sum it up in one sentence. 'The world is fucked and a fucked world gives birth to fucked people'.\n\nThat is all.",
   "created_utc": 1692015511,
   "score": 255,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4pbuq",
   "message": "Moral degeneracy leading to lifestyles of cheap gratification instead of actual fulfilment.",
   "created_utc": 1692015560,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4pd9f",
   "message": "Until our society reckons with the severely underrecognized issue of childhood sexual abuse and how it manifests (“treatment-resistant depression”, BPD, narcissism, unrecognized dissociation) as well as encourages a substantial shift in the way people approach both mental illness and each other, a substantial section of the population (25%+ if reporting is believed and yet is likely lower than the “real” prevalence in the population) is functionally doomed. \n\nThis notion of certain people “deserving” victimhood when so many of these people - who often become addicts because our society presents such anemic if extant tools for recognizing and healing such trauma - were abused in ways the average person cannot comprehend is sickening. Further, given that these people are entirely disenfranchised from what is presented as what people should want and be capable of means that a certain subsection of them will be always motivated to burn everything to the ground since they feel doomed anyway. The lone wolf phenomenon is a symptom of this.",
   "created_utc": 1692015580,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4pkqh",
   "message": "To be 100% honest I think a lot of it is shit diet.\n\nOr even not a shit diet one that triggers immune responses via allergy.",
   "created_utc": 1692015684,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4ppxp",
   "message": "Because everything is sh!t and nobody has common sense.",
   "created_utc": 1692015757,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4ppz9",
   "message": "Suicide prevention.",
   "created_utc": 1692015758,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4pwx6",
   "message": "[gestures vaguely at fucking everything]",
   "created_utc": 1692015855,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4q114",
   "message": "*gestures at fucking everything*",
   "created_utc": 1692015912,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4qyec",
   "message": "I mean, I was one of those kids that was called gifted in early life, put into much harder academics, got hooked on coffee, and then everything else happened.",
   "created_utc": 1692016383,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4r76p",
   "message": "Poverty",
   "created_utc": 1692016506,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4r8nn",
   "message": "I just assumed people were getting smarter and more knowledgeable, both of which are associated with higher incidence of depression.",
   "created_utc": 1692016526,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4xxjm",
   "message": "Always looking at the next best thing and not looking at what they have",
   "created_utc": 1692019637,
   "score": 3,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4zawd",
   "message": "Inflammation from too many carbs and sugar. And because society is collapsing into corporate slavery.",
   "created_utc": 1692020238,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw50lef",
   "message": "Millennials all the way up to the current generation in the USA grew up/are growing up while seeing national/international tragedies on the news pretty much daily. Kids barely out of kindergarten are being shown videos of the people who jumped from the towers on 9/11. So many kids have unfettered access to the internet and grow up seeing porn, gore, and hate speech. Kids here all have to do school shooter drills or even dealing with a real one. Our planet is dying on us due to our own kind killing it. Then when you are an adult, there is no help financially or mentally from the majority of Boomers/Oldest Gen Xers, because they’ve shut the door and pulled up the ladder behind them. Kids and younger adults are constantly being fed tons of negative and anxiety-inducing information all day every day. Not to mention the plastics/toxic chemicals in our food and water are poisoning us, and the constant exposure is basically causing us to undergo a rapid evolutionary event. More genetic anomalies are discovered in genetic testing all the time, and many of them are still not researched enough to know if they’re bad or good.",
   "created_utc": 1692020800,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4y7i2",
   "message": "Capitalism.",
   "created_utc": 1692019757,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4xzmi",
   "message": "I think this question is has multiole layers for an answer.\n\n- diet has more sugar and refined carbs. This has a snowball effect on mood and body comp\n\n-our body comp has an effect on mood\n\n-certain chemicals have effects on mood like detergents, plastics etc increasing estrogen\n\n-society has become more civilized and have created laws against physical violence but lack real punishment for cyberbullying or other means of psychological assaults\n\n-things like toxic masculinity, female body shaming, etc",
   "created_utc": 1692019662,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4rvm0",
   "message": "Can you think of a single reason we shouldn't be depressed? \n\nThere's three options. \n\nDepression. Indignation. Acceptance. \n\nIndignation is seen as being spoilt brats and acceptance is seen as being lazy and apathetic.",
   "created_utc": 1692016840,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4s3d6",
   "message": "I was told as a child to dream wildly and love unreservedly, that imagination and hope is enough to make the world a better place. The first time I was on antidepressants was also the first time I was homeless, and no amount of dreams, love, imagination or hope saved me from what could’ve been far more terrible, it was putting up an nigh impassable wall between my logical determination and all the feelings that made life worth living. I sold my body to the government and now, honestly, I question each day “what’s the point?” …  but, I did manage to find my meaningful life once more and tore down the wall brick by brick, yet even so it’s a constant struggle to exist with the sheer LIES we were told as children to shut us up long enough to grind us down. It doesn’t surprise me one bit that it’s a struggle but to be positive or at least neutral.",
   "created_utc": 1692016943,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4slq3",
   "message": "A lot of it is because you're constantly told you have to live up to a standard that doesn't exist anymore.\n\nBe born, listen to your parents, do well in school, go to a good college, get a well paying 9 to 5 job, meet a good man/woman and have kids before you turn 30, buy a home, raise your kids to be like you, retire and let the cycle repeat. Any deviation or failure to live up to this standard means you're a failure.\n\nIt's not surprising that a lot of people are depressed when they feel like they're not able to live up standards set by society.",
   "created_utc": 1692017189,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4t2ys",
   "message": "Media In all forms, or some brains are just that way. Seems like so many songs, movies, tv etc is depressing.",
   "created_utc": 1692017418,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4t8mo",
   "message": "People get bullied online and in real life and a lot of parents are total shit.",
   "created_utc": 1692017492,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4td6c",
   "message": "Social media",
   "created_utc": 1692017552,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4tvnw",
   "message": "We teach kids that life is a fairytale when we should train them like it's a battleground.",
   "created_utc": 1692017792,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4un0l",
   "message": "Porn",
   "created_utc": 1692018148,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4v675",
   "message": "In the US for a very long time a person’s reality ended up so much better than they could have imagined. \n\nFinish high school, get a job, work hard and you too can own a house and raise a family. \n\nAfter time add college to the mix.\n\nThen a time came where regardless of your degrees and gumption success was not guaranteed. \n\nWhen your outcomes are less than your expectations, you are in for a bad time.",
   "created_utc": 1692018398,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4vd6h",
   "message": "Nothing matters anymore and there are no real connections between people very often. While everything is about material possessions in form of money itself or in form of degenerate status symbols through goods or attention through time wasting social media like instagram and TikTok. As same as the common sense in the dating world is gone since concepts like Tinder started and love is more and more a capitalistic market than about emotion. There is even more but that is the base.\n\nI recommened to  you the YT Channel: \"Moon\" which is about society dynmanics and ongoings.",
   "created_utc": 1692018487,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4vhoz",
   "message": "The more we learn about the world. The less understanding and confidence we gain.",
   "created_utc": 1692018546,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4w128",
   "message": "I [19M] would personally say that these days, through social media, it's far too easy for people, especially for kids and teenagers, to get instant gratification: you can have your wishes instantly met (e.g.: \"do you feel horny/ lustful? Here's some porn.\" \"Do you want to have your ego boosted? Post anything, you'll have hundreds of random people giving you fake internet points. The more you have, the better you ought to feel.\" etc, etc.) It's the same concept as poor people thinking that EVERY SINGLE son/ daughter of the wealthy must be happy and have a fulfilling time on this planet, hence they have everything they ever wanted, only to marvel at the news of them committing suicide. Just look at the creator of Minecraft: bro has hundreds of millions, yet he spends a lot of it on parties and fake friends to drown out the loneliness and emptiness which was created by giving up on his projects.\n\nI'd also add that giving kids \"participation trophies\" and the mindset of \"everyone is a winner\" is just plain stupidity. How on God's green Earth are kids going to be happy as teenagers / adults if the realisation of having to better themselves and fight harder for the things they want hits too late? Or when they get hit with the fact that often times they WILL LOSE no matter how hard they work, because there's always someone with more effort and/or knowledge behind them? How do we expect them to accept that when they aren't socialised in an environment where they learn it? On the same note, what do we expect from teenager who was never told no? How do we expect people, who were never taught discipline, to react in a situation where they need it? They certainly won't be happy about it. \n\nIn the end, I thank my parents for not raising me too liberally, because I wasn't robbed from a more than okay childhood by the lack values. I'm also glad that I wasn't introduced to the internet untill age 12, or that they convinced me to do sports (martial arts to be precise) so that I could learn about comradery, discipline and the notion of always reaching for the better.\n\nI can confidently say that now I'm an adult, I am doing better than a lot of those I grew up with, simply because achievements weren't served to me on a silver platter.",
   "created_utc": 1692018792,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4w54q",
   "message": "lack of phsical activity\n\nlow quality food\n\noverstimulation and addiction from intense satisfying media (reality can't compete)\n\nbeing distant to the work you actually do (farming your own food vs buing ready-made products)\n\nparents struggling with mental health --\u0026gt; incapable of entertaining and education their children\n\nAND it's a trend to victimize oneself. Some people love the attention and care they get from simulating (or just dramatizing) not being well.\n\nfinally, a hedonistic culture.",
   "created_utc": 1692018844,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4wl2t",
   "message": "Capitalism",
   "created_utc": 1692019043,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4wpj1",
   "message": "Because there will always be 8 billions of other people living and you're nothing but one more? And dead or alive you make no difference, unless you have billions in your bank?",
   "created_utc": 1692019097,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4x2ta",
   "message": "Up bringing,genetics,lifestyle,life traumas.",
   "created_utc": 1692019261,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4x7i6",
   "message": "We've always been depressed. We just didn't know about it before.",
   "created_utc": 1692019318,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4xbh5",
   "message": "Because we don’t really get a choice in what life is. Sure we can pursue a career in “whatever” we want, marry “whoever” we want, etc but it’s very much being born into a preset existence of what human life should be. We have the capitalist blueprint and that’s it, like it or lump it. Oh wait; you can’t lump it because it’s illegal to tap out early",
   "created_utc": 1692019367,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw4xsz1",
   "message": "Speaking just for Americans - combination of comparisons and excessive goodness.\n\nComparison is horrible.  My pay puts me [firmly in the top 10%](https://www.yahoo.com/now/much-money-top-1-5-100000529.html?guccounter=1\u0026amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8\u0026amp;guce_referrer_sig=AQAAAE0tvM3aH0xGvIHojA3H82djeBkwEz7Egoa3bdEi0IswmN4jGmcrduyAiImAwa8Tm3oXoazraLtqeTk7Du8AF_pgSIyyiK-3687CVnrbiG_q9cTJ9mkr6qzM3_zTa-PmFG5U6-x1hqVmu3lW9PQWGxOoJcAK_9PGnj2hYY3mNPim#:~:text=Landing%20in%20the%20top%2010,were%20roughly%20%24173%2C000%20in%202020.) of US earners and with a little luck, Ill hit 5% next year.  Yet if I compare myself to Elon or Gates Im a rounding error on their monthly income statement.  Now extrapolate that to someone who is in the middle 50% and all they see is everyone else doing better than they are without even realizing that they are in the top 10% globally.\n\nThe second its how, in relative terms, life is so easy for most Americans.  So many of us take for granted that the power will be on, the water will be drinkable and available and no one is going to invade and subjugate you.  All of that is unusual for huge portions of the world and almost unique across history.  Most Americans live in a level of luxury that is better than any king 400 years ago.  The medical care available at the local Doc in a Box would have been world leading 200 years ago.  The food selection at Wegman's or even Lidl is greater than what any Gilded Age Robber Barron could even imagine.  Most of the \"greatest generation\" grew up without electricity.  If it weren't for Oregon Trail most Americans would have no idea what dysentery is.  \n\n36 years in the Army I had the opportunity to \"visit\" a lot of foreign places.  Most of the times I was an \"invited guest\" but a few I was a de facto occupier and a few I was in active armed conflict.  In every case there was an absolute power imbalance where the \"host\" country didnt really have a choice.  My first duty station was in West Germany in the former British Zone that was the home of the British Army On the Rhine. It was not lost on any of the German population that they had no say in our presence there. No living American has ever experienced that.   \n\nWhen your daily life sucks so bad that you dont know if you are going to catch a fatal sickness from your next glass of water, you dont have a lot of time to get depressed.  And when you are surrounded by people actively trying to kill you, the joy you get from making it to sunrise tends to chase away depression.  \n\nIm not advocating for anyone to choose a sucky life full of fear and death.  What I am advocating is for people to take joy in the fact that their life is, in relative terms, amazing.  Are there still bad things in America?  No doubt.  Do some people in America life in fear, hunger and medical need?  Absolutely.  But amazingly they are actually the exception in this country and that freedom from want has the horrible side effect of causing some to dive into depression, starving themselves of the ability to see joy.",
   "created_utc": 1692019581,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw52rvf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw53veb",
   "message": "Because the world sucks and is a cruel place full of assholes who are mean about everything",
   "created_utc": 1692022166,
   "score": 6,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw56kv6",
   "message": "Porn has to be a huge part of it. Kids are burning out their dopamine receptors watching stuff that most humans in history couldn’t even imagine. Then by the time they’re in their late teens, they can no longer experience happiness except in brief, fleeting moments.",
   "created_utc": 1692023243,
   "score": 3,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw5mtwv",
   "message": "Basically any adult can imagine it how they got demoted to child again\n\n\\- your family holds all money and permissions needed for your life and may use them as an infinite leash\n\n\\- at best you have your own room, privacy is on benevolence of your family\n\n\\- you must either justify or pretty-please anything you want, it still doesn't guarantee\n\n\\- you work 60-80h a week, unpaid\n\n\\- it's clerical work, that you are told you need 10-15 years experience off before minimal wage job\n\n\\- they are open big part of work you do just brainwashes yourself to be more comfortable for them\n\n\\- if you fail it you are threatened to be pariah and homeless\n\n\\- if you get beaten the attacker at best would be fired, you aren't protected by court or self-defence laws. In fact you would suffer more for self-defence\n\n\\- from propaganda to social control by every adult, people work for you not to have sex and punish you for it\n\n\\-- they still treat you as second class if you actually don't have it\n\n\\- your office is cramped like a sweatshop\n\n\u0026amp;#x200B;\n\nP.S.\n\nActually we know one example, those are \"Uygur concentration camps\" in China. Basically they don't do anything worse than treating some adult people like children for a while and that puts any adult to existential horror",
   "created_utc": 1692029368,
   "score": 3,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw5tp6h",
   "message": "Poor.  People seem to want to look for any other reason, but money would solve 9/10 people's problems.",
   "created_utc": 1692031835,
   "score": 3,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw5uqvt",
   "message": "A lot of people gave you false hope and promises, while lacking honest intentions. \n\nMany deny your goals (claiming it's unattainable) because they don't want someone else achieving their own. \n\nToo many selfish, ignorant, and oblivious individuals. \n\nJust because you have survived many \"hardships\" doesn't mean that others are not enduring the same or are even able to survive from similar.",
   "created_utc": 1692032208,
   "score": 3,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw670qu",
   "message": "The pressure to conform to societal expectations and achieve certain milestones might lead to feelings of inadequacy and depression.",
   "created_utc": 1692036602,
   "score": 3,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw5b1ka",
   "message": "Well for me it’s because of mental disorders",
   "created_utc": 1692024978,
   "score": 2,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw5e26o",
   "message": "Tummy issues, vitamin deficiencies, toxic environments, no access to coping mechanisms, learning too many things too late, struggle for survival, no access to anything stressdiluting, loneliness, mental disorders , no kindness, no will power, no access to good medicinal or therapy sources,",
   "created_utc": 1692026132,
   "score": 2,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw5g9uy",
   "message": "There is nothing to look forward to.",
   "created_utc": 1692026960,
   "score": 2,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw5i90o",
   "message": "Childhood trauma. Far too many people that shouldn't be parents are having children. The parents treat their children horribly because that's how it is was for them. Generational trauma is the worst because it's seen as normal. It doesn't stop until someone stops the cycle.",
   "created_utc": 1692027690,
   "score": 2,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw5t9bl",
   "message": "Corrupted people corrupt others. Everyone is either corrupted or waiting to corrupt someone else",
   "created_utc": 1692031678,
   "score": 2,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw5tqyw",
   "message": "This is a newer phenomenon and is heavily related to social media.  Could certainly argue that the “food” a lot of people eat is a major factor as well as the indoctrination people get in the school system.",
   "created_utc": 1692031853,
   "score": 2,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw55257",
   "message": "Life is a hard mode for 99% of the population.",
   "created_utc": 1692022643,
   "score": 3,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw5wxeh",
   "message": "Lack of connection to parents",
   "created_utc": 1692032991,
   "score": 1,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw6j70m",
   "message": "Cause they fake it for attention",
   "created_utc": 1692041007,
   "score": 0,
   "submission_id": "15qn3rh"
  },
  {
   "comment_id": "jw5f18d",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15qn3rh"
  }
 ]
}