{
 "submission_id": "15r19yu",
 "title": "What is the most terrible thing you've ever witnessed?",
 "selftext": "",
 "created_utc": 1692034480,
 "permalink": "/r/AskReddit/comments/15r19yu/what_is_the_most_terrible_thing_youve_ever/",
 "score": 91,
 "url": "https://www.reddit.com/r/AskReddit/comments/15r19yu/what_is_the_most_terrible_thing_youve_ever/",
 "comments": [
  {
   "comment_id": "jw61llw",
   "message": "A group of homeless men broke into my car and had an orgy in it",
   "created_utc": 1692034658,
   "score": 214,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw62pgq",
   "message": "One time I went to winn-dixe (a grocery store) in the morning for some breakfast items and found a guy unconscious in the back of the stores building outside. It was a hot day and he was In The sun. Many people passed him but no one stopped. I thought to myself. It’s 87 degrees out (it’s Florida) and he’s passed out in the sun with no shade. I walk over to him to offer him a water. He didn’t respond. He was dead. I didn’t understand that he was dead so I continued to try and wake him up until eventually I called ambulance and they tried to bring him back to life but he overdosed and was dead for 30 minutes already by the time I went to help the dude. Truly traumatic.",
   "created_utc": 1692035056,
   "score": 144,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw674gc",
   "message": "When my mentally ill gf (now ex) killed our dog. I didn't see the act itself, I just heard him whimpering and then I saw him bleeding from his nose. Took him to the vet, he had broken ribs and a collapsed lung, and we were basically broke so we couldn't pay for the treatment (which included putting him on a ventilator that would've cost like $200 per day). Putting him to sleep was unfortunately our only option. When I asked her what happened, she said \"Well, he peed on our bed, so that's what he gets.\"",
   "created_utc": 1692036639,
   "score": 72,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6259s",
   "message": "I was at a underground live concert and it was end of the night. I Walk out the club and watched four people get hit by a car full force. They got knocked down like bowling pins.\n\nEdit: might I preference—they were all lined up side by side walking down the street when a car hit them and sent them flying. I’ve never heard more ear shrieking screams.",
   "created_utc": 1692034853,
   "score": 194,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw65ie5",
   "message": "That time a motorcycle going triple digits lost it and the guy got shredded on the guardrail posts was pretty fucked. Ended up running over some pieces of dude. Not the worst thing I've seen tbh, just gruesome.",
   "created_utc": 1692036059,
   "score": 54,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw694q7",
   "message": "Saw a lady drop 2 handfulls of tacos at a taco truck, like a dozen tacos just gone!",
   "created_utc": 1692037364,
   "score": 120,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6fio2",
   "message": "Went to a party with my girlfriend at the time about 5 years ago to a friends house. His cat just had a litter of kittens and he was offering them for free to anyone who came in and wanted them (the party wasn’t for the kittens, just so happened they were born like 2 weeks before the party). \n\nOne of the guys who came asked if he could keep one of the kittens. Guy with the kittens agreed. A few hours later when everyone is drinking and having a good time the guy with the kitten and 2 other guys go outside with it and said “hey watch this guys!” \n\nThey ran down the stairs (we were on the 3rd floor with a balcony), 1 of them got in a car and started to drive around the apartment complex to come back. As he rounded the last corner to come back he floored it and as he did this, his friend holding the kitten threw it underneath the car killing it instantly. \n\nThey all came back up stairs laughing hysterically. My gf after seeing that happen immediately broke down crying (several folks did) and after she composed herself we left immediately.",
   "created_utc": 1692039679,
   "score": 128,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ek0d",
   "message": "As a teenager I volunteered at an event called Muddy Buddy (think low-grade Spartan/Tough Mudder before it became popular). I was serving water at an A-frame cargo net obstacle when a man fell from the top and landed like a log with a major thud. People continued to climb down and walk around him while he had a blank stare and odd, repetitive breathing. Shortly thereafter, a few people in the race started applying cpr while waiting for the ambulance. It took over 20 minutes for the ambulance. They loaded him up and hauled him away but he was already very blue in the face. I believe he had a heart attack, and I never knew if he made it, but I was not hopeful.",
   "created_utc": 1692039328,
   "score": 96,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw69lf6",
   "message": "First thing that pops to mind is when I was in traffic some years ago. A mother mallard walked into the road with her ducklings trailing behind. Everyone naturally stopped to let them cross. All except this one thug-life-livin' a-hole; just kept driving and crushed one or two of the babies. I couldn't watch, but I saw the shocked and disgusted looks on the other drivers' faces.",
   "created_utc": 1692037531,
   "score": 121,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw69ugd",
   "message": "There has been quite a few, but one that comes to my mind was few weeks ago when I was working a nightshift. My coworker asked me help to assist with a fallen patient, so I went there to do just that.\n\nPatient hadn't hit her head, she was laying on bathroom floor. There was blood however, it was coming from patients leg apparently. Her leg was broken, and it was in abnormal position. End of her leg had broken clean off, her skin was only thing holding it together. It was mangled laying on floor. She asked: \"How does it look?\" and I replied: \"Very bad.\"\n\nWe had no idea how it happened. She was still conscious and not in huge pain. We had problems getting help from the ER or from ambulance. Apparently they didn't think it was that big of priority. When someone did show up. Even them called doctor again to make sure what to do. \n\nWe got patient together to ER. \n\nThere are few others as I said, and this isn't probably even worst, but it is the one I can think of right now.",
   "created_utc": 1692037622,
   "score": 107,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6h3ri",
   "message": "7th Grade Social Studies (would have been the year 2005) we had a substitute teacher. All of us were filing into the classroom to grab our seats. Everyone noticed the substitute looked like they were napping and a few kids were cracking jokes and doing impressions of snoring.\n\nIt became quickly apparent as the substitute teacher's face started turning blue that something was wrong and two students ran to get the assistant principal while another dialed 911 on the in class telephone (no smartphones yet). \nWe were rushed out of the classroom and set up with optional counseling and the rest of the week off afterwards.\n\nHe had died of some kind of choking or cardiac arrest, I cannot remember which. In fact, I have tried to get this out of my head for years because I'll never know if I saw them die or if they were dying in front of me while I did nothing.\n\nWhile the image of them with their head down on the teacher's desk slowly turning blue is etched into my mind, it's really the sounds of the mocking students that haunt the memory of it all.\n\n(It is also the reason I regularly get certified for CPR and other basic first response to this day.)",
   "created_utc": 1692040263,
   "score": 106,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw69k4z",
   "message": "I watched a motorcyclist crash and die",
   "created_utc": 1692037519,
   "score": 23,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6en24",
   "message": "The first thing that comes to mind is when I was driving home with my parents in the evening in the city center and there a biker's head was torn off by a chain when he crashed into a car.",
   "created_utc": 1692039358,
   "score": 62,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6f9va",
   "message": "When we was young at a addicts house, she overdosed💉. Leaned on the wall slid down and never stood up again",
   "created_utc": 1692039591,
   "score": 28,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6hkkd",
   "message": "Many, many years ago ago I was driving home for Christmas and I got stuck on a major highway behind a horrific accident. Eventually they opened up a single lane and as cars came to pass through the accident scene they had lined up 5-6 deceased people on the shoulder of the highway in the snow. An entire family was wiped out and visible to all who were still moving. Even now decades later it still makes me sick to my stomach just thinking about it. This was maybe two days before Christmas.",
   "created_utc": 1692040433,
   "score": 239,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6imwa",
   "message": "The decline and eventual death of a cancer patient.",
   "created_utc": 1692040813,
   "score": 31,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6kuzm",
   "message": "Probably ripping my own arm open because I went through a single pane of glass, panicked, twisted my arm and pulled it out. \n\nGot a decent scar.",
   "created_utc": 1692041603,
   "score": 26,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6lu35",
   "message": "Watching a woman have her puppy stolen from her while she screamed for help and cried. \n\nNote I was 4 stories up in an apartment and heard the commotion then looked to see what was happening, bystanders all watched. This took place in London.",
   "created_utc": 1692041949,
   "score": 49,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6o7mq",
   "message": "Watched my father die a slow painful death.",
   "created_utc": 1692042787,
   "score": 40,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ckkw",
   "message": "Daniel Pearl beheading video. That kind of brutal shit is all over now but not so main stream back then. Was really fucked.",
   "created_utc": 1692038613,
   "score": 15,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6do76",
   "message": "Ronnie McNutt's shotgun suicide video. Hit harder because my fiance is also a veteran who struggles.",
   "created_utc": 1692039010,
   "score": 26,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6la2b",
   "message": "Watched my mother essentially what I can only describe as; Rot from the inside out due to X amount of different Cancer treatments.    \n    \nSomeone so strong, so full of life, become a few shades off an animated corpse is enough for me to question ever undergoing treatmemt should I ever fall ill with the same thing.    \n    \nIf I am to be remembered by those that love me, I  don't want to be remembered like that as the last thing they see.    \n    \nI don't blame the doctors at all, but treating cancer is so much of a gamble, I am really not sure it's worth it.",
   "created_utc": 1692041752,
   "score": 31,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ts8d",
   "message": "Gang rape victim.  Humanity sucks.",
   "created_utc": 1692044778,
   "score": 14,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6e45b",
   "message": "First Tuesday in November, 2016",
   "created_utc": 1692039167,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6lvg7",
   "message": "My ex girlfriend singing.",
   "created_utc": 1692041963,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw65wru",
   "message": "My son push poop out with a diaper offf",
   "created_utc": 1692036200,
   "score": 7,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6clrs",
   "message": "2 girls, 1 cup.",
   "created_utc": 1692038624,
   "score": 13,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6f4x5",
   "message": "In London I witnessed a Pimp threaten one of his girls under a bridge, pull up her skirt, and beat her across the face.",
   "created_utc": 1692039540,
   "score": 5,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6bqtz",
   "message": "A slow murder that was prolonged by months and months of torture and starvation. I'm still wrapping my head around it all",
   "created_utc": 1692038313,
   "score": 10,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6i169",
   "message": "A girl I liked giving head to another guy(who knew I liked her)\n\nIn that moment i went through a lot of emotions.\n\nIt was a situation where I couldn't blame anyone except my own luck.\n\nNeither the girl nor the guy mean anything anymore but I have stopped sharing with people regarding who i like and other love related things.",
   "created_utc": 1692040597,
   "score": 6,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6m9md",
   "message": "It was late night in long beach in a free dance studio in long beach, ca. A black kid ran up to me really fast, it is long beach like I said. I was alarmed and ready for anything, but he was crying, like fucking crying. I was like WTF. he asked for help, his cousin or his bother was stabbed in the neck and was dying. We called 911 police and ambulance came. But the police blocked the ambulance for some reason. I was a young cum guzzler so I didn't know what to do, we all watch a kid die that night. Mexican dudes stabbed him in the neck.",
   "created_utc": 1692042103,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw653sf",
   "message": "Found a guy in a graveyard who committed suicide. Was a great start to a Monday morning",
   "created_utc": 1692035914,
   "score": 24,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw687mr",
   "message": "Death. I work in a nursing home.",
   "created_utc": 1692037034,
   "score": 6,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6fkqx",
   "message": "Driving down the highway, I'm a bit behind a truck carrying very large tires. Like for massive tractors or something. Some kind of machinery. The tires are covered in a tarp. I see something small fall off of the back of the trailer and it bounces up past my window, and I see it's one of those rubber tie-down tarp straps. Like seriously, just one. \n\n\u0026amp;#x200B;\n\nThe truck goes around the curve in the road ahead of me, and one of those massive tires slips right off of the side. A van is driving next to them and it slams into the van and just crumples the thing. Tire bounces back into my lane, I swerve wildly to avoid being killed. It was awful. Just an absolute mind fuck of a moment that all seemed to happen in slow motion.",
   "created_utc": 1692039701,
   "score": 53,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6g0f0",
   "message": "Saw someone get stabbed in England.",
   "created_utc": 1692039863,
   "score": 2,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6g8ln",
   "message": "My bio dad’s face. I shit you not. He’s that fucking ugly.",
   "created_utc": 1692039947,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6htbp",
   "message": "When I was a kid, there was a neighbor kid I was friends with. I saw his mom go batshit once and start beating him, it was traumatic just to witness.",
   "created_utc": 1692040519,
   "score": 19,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6iue1",
   "message": "Several but the one that springs straight to mind, is a woman being hit by a bus on a zebra crossing and her foot being ripped off on the railings. The noise will haunt me forever",
   "created_utc": 1692040885,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6j9zz",
   "message": "I was at a punk show at my friend’s house and while a lot of us were hanging out on the front porch, this lady who lived across the street shot her grandfather point blank in the back of his head killing him instantly.",
   "created_utc": 1692041036,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6jbyw",
   "message": "Some of my classmates showed me a video of a cat in a blender, it just became red slush immediately",
   "created_utc": 1692041055,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6jhdp",
   "message": "It's between my neighbor falling and hitting his head on concrete and the aftermath of my dog getting hit by a truck.",
   "created_utc": 1692041109,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ke0n",
   "message": "Witnessed a lethal injection execution one time",
   "created_utc": 1692041434,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ke41",
   "message": "Whle walking home from school in Jr. High, I saw an infant fall 2.5 stories out of a window onto a concrete driveway.",
   "created_utc": 1692041435,
   "score": 9,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6lipa",
   "message": "Where I was present? Nothing really. But some of the shit I’ve seen in r/fiftyfifty is pretty fucked up",
   "created_utc": 1692041838,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6mduu",
   "message": "I have two because they're both awful.\n\nOnce I was camping with my dad and brother. I was roughly 11- 12 yrs old. I don't remember exactly. We were standing by a lake watching the boats and stuff when a boat hit a girl on a jet ski. As they pulled her finally to the dock, we saw that the propeller had basically ripped/cut her leg off. It was just barely hanging on. The ambulance finally arrived and they carted her away. She was not conscious. I always wondered how/if she recovered. \n\nAnother time, I was sitting at the table with my mom and our neighbor playing cards. I was 12-13 yrs old. It was dark outside because it was getting late on a weekend night. Someone knocked at the door so I got up to answer it. The second I opened it, this poor old guy who looked in terrible shape and likely homeless, asked me for water and then dropped dead right in the doorway. I think from the time I opened the door to the time he dropped was maybe 3 seconds. He said only \"water\" when I opened and then fell. My neighbor who was over was a nurse so she came running to help. We called 911 but I didn't see how everything ended. My mom made me go upstairs to my room once he had fallen in our doorway.",
   "created_utc": 1692042143,
   "score": 6,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6mo8m",
   "message": "The Taliban rounding villagers up in the town center and chopping off their heads.  Viewed from a live ISR feed.  Rules of engagement prevented us from firing a missile until the first attack.",
   "created_utc": 1692042245,
   "score": 9,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6nyrz",
   "message": "Reading some of these other posts mine is very mild but still I think about it often..\n\nI used to mow my grandma's lawn every week for years. One year I guess I went over a rabbit hole and it startled some of the bunnies who ran out and I had hit one with the blade. \n\nThe sounds of it's tiny shrieks still stick with me and the picture of half of its face gone is burned in my brain.  I didn't know what to do but I knew I had to put it out of its misery as fast as I could so I picked it up with a shovel and put it in my bag of cut grass and suffocated it.\n\nI know it wasn't my fault but I still feel terrible.",
   "created_utc": 1692042701,
   "score": 117,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ql1l",
   "message": "The video of that bodybuilder murdering his ex on Instagram livestream with the baby crying on the floor as he executed her right in front of it",
   "created_utc": 1692043639,
   "score": 20,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6qriw",
   "message": "The body of a relative.",
   "created_utc": 1692043704,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6qw7k",
   "message": "Saw someone jump off of the Golden Gate Bridge.",
   "created_utc": 1692043751,
   "score": 9,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6r8eq",
   "message": "YouTube video of a guys killing himself live….",
   "created_utc": 1692043872,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6r9z2",
   "message": "When I was about 9 or 10, our neighbor was backing into his garage with cement walls with his arm hanging out the window. He accidentally got too close to the wall and smashed his arm... he proceeded to panick and jet forward and backwards, repeatedly and ineffectively, severing his arm almost completely. His arm was hanging off of the bare remaining tendons (I think) looked like a stringy thing. My family was outside enjoying a nice sunny day playing catch. We were all shocked and jaws all dropped. It took literal several minutes before my dad could move his legs to run and go call for an ambulance.\n\nI am now afraid of anybody sticking their arms or feet out my windows.",
   "created_utc": 1692043888,
   "score": 20,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6rd7p",
   "message": "I was driving to work on 14th avenue in Joburg. A taxi driver had JUST been shot like a minute or so before. I saw him hanging out the drivers window with blood down the door and puddling on the floor. It was fucked.",
   "created_utc": 1692043919,
   "score": 6,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6rrws",
   "message": "I was standing at the school bus stop one morning and a cat was walking across the road when a big Cadillac car drove right over it. It sounded like if you stepped on a bag of potato chips 😭",
   "created_utc": 1692044066,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6rsox",
   "message": "I saw a dog get hit by a car while I was waiting for the bus stop in middle school.  I had noticed two dogs running along the road unsupervised, and I wanted to go to them but they were very big dogs. Plus I was worried if I left the stop, and the driver saw no one there, the bus would just keep going (it had happened before). \n\nSo I watched the two dogs for a little bit until the pit bull got clipped by a car. I still vividly remember him spinning mid air and off to the side of the road. I REALLY wanted to go see if he was okay but it was so far away. The car didn't swerve to try and avoid him or anything, and it didn't even stop. The other dog stood next to his downed friend the whole time.\n\nEventually a lady pulled over, picked up the dog, and put him (and his buddy) in her truck. I hope the dog was okay, but I'll never know. \n\n(I also had unsupervised internet access growing up, but I feel like the dog was worse somehow. Maybe because I blame myself for not stopping it.)",
   "created_utc": 1692044074,
   "score": 6,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6rwsk",
   "message": "The death of 2 people that I caused",
   "created_utc": 1692044116,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6s2ky",
   "message": "Seen a guys foot implode from a rv and another guys hand get completely smashed and his fingers looked like chicken tenders. Bother we’re pretty bad but there’s a lot worse you can find on the internet. In person tho that sht was like wow",
   "created_utc": 1692044173,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6s858",
   "message": "Saw someone get their head run over in a hit and run, skull cracked open like a smashed pumpkin and his brains looked like scrambled eggs and ketchup all over the road.",
   "created_utc": 1692044228,
   "score": 7,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6sdah",
   "message": "A group of ten people screaming at each other in the middle of the street because \"grandma\" was dying and they wanted to know about inheritance. I quote \"How cares what happens to her, what's important is what each of us is getting!\". \n\nI entered home kind of depressed (They happened to be discussing this outside of my building).",
   "created_utc": 1692044281,
   "score": 11,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6spgi",
   "message": "I saw a plane crash into a house two blocks from my high school, everyone in school saw the plane falling from the sky, crash and we could immediately hear and see the smoke/fallout.",
   "created_utc": 1692044400,
   "score": 5,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6sr5r",
   "message": "Sometime in my high school years, in a west Texas town, a neighborhood pal wrecked his 4wheeler. No helmet on, hit a large metal barred fence head first. Running up to the incident was rough. The driver was on the ground flat on his back convulsing and the passenger who rode on the back was 10-15 feet away rolling on the ground with one of his legs not moving. The drivers face was turning blue. Blood seeped out of his mouth and he had bones sticking out of this wrists. \n\nWe tried CPR on the driver and to calm the passenger down but with your knee and below not being attached to the rest of your body it was almost impossible. \n\nI’ll tell ya what, the worst part was after 10 minutes of us high school teens trying, the dad of the driver showed up. We weren’t even a mile from his house. He tried to revive his son but after some time he stood up crying out to the crowd “somebody help me! Somebody save my only son!” Core memory locked in at that moment.",
   "created_utc": 1692044417,
   "score": 40,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6szvt",
   "message": "Saw a dog drown in the ocean.\n\nThere was a high tide warning that day, and we had gone to a nearby beach to walk on it, when these tourists showed up and just let their dog loose. After a few minutes, they were screaming at the dog to come out, but it was too late. I felt bad for the dog, but not the people. Fuck them.",
   "created_utc": 1692044502,
   "score": 3,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6t3qr",
   "message": "Saw a pitbull kill a smaller dog in a park that was pretty messed up",
   "created_utc": 1692044539,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6td8n",
   "message": "Teenager do a cartwheel through the air after a car tried to beat a yellow light. The kid rolled a few times along the pavement and stopped on the grass on the opposite side. I hsd no working phone to call 911, but other witnesses were on it almost immediately. As I was walking back there were like 4 police units and an ambulance along with an engine.",
   "created_utc": 1692044631,
   "score": 6,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6th65",
   "message": "found a floating corpse in the river.",
   "created_utc": 1692044671,
   "score": 10,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6tmoj",
   "message": " Female genital mutilitation",
   "created_utc": 1692044724,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6tuhg",
   "message": "Anything that involves Korean people is pretty awful.",
   "created_utc": 1692044800,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6u33j",
   "message": "Watching my best friend die.",
   "created_utc": 1692044883,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6udmx",
   "message": "I saw a guy climb up on a hill to watch a thunderstorm come in with his son. The storm was miles away, it wasn't even raining where we were. \n\nAfter about five minutes of me and my friend exchanging comments like \"he really shouldn't be up there\", he got struck by lightening. His son came running down the hill. Somehow he wasn't hit even though they were standing really close together. \n\nI was still there when the ambulance came and got him off the hill. He died instantly, and his hair had turned white. \n\nI was 12-13 and my friend and I were taking the bus to the mall so I could buy a Black Sabbath CD that contained the song \"Electric Funeral\".",
   "created_utc": 1692044988,
   "score": 9,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6uemv",
   "message": "I saw someone pour boiling water on a sleeping homeless man.",
   "created_utc": 1692044998,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ul9x",
   "message": "A kangaroo getting completely destroyed by a road train",
   "created_utc": 1692045063,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6uq43",
   "message": "Was made to watch someone shoot a puppy.",
   "created_utc": 1692045110,
   "score": 7,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6us5y",
   "message": "Animals being skinned alive and tortured in other ways",
   "created_utc": 1692045129,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6v89v",
   "message": "Parents receiving the news that both their daughters passed in a car crash. We said goodbye to them before they left less than an hour before.",
   "created_utc": 1692045285,
   "score": 17,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6v8m2",
   "message": "I once saw someone break a bottle of rum on someone else’s head. The amount of blood that came out was concerning. The guy was fine, but seeing the floor absolutely splashed with blood like some had been murdered was… traumatic. Like, I legit don’t know how the guy wasn’t fainting or something, like, it was so much blood! But no, the guy fought the other guy off, then left the place and called the cops while holding his shirt over his head to stop the blood from going all over him.\n\nGuys… like, I’m not kidding, it was a lot of blood. Like… 16 feet of blood covering the floor. It legit looked like someone had been stabbed or something. And the smell… ugh, the smell was the worst! It was gross. It didn’t smell like metal, which is what I would’ve thought it would smell like. Honestly, I haven’t smelled anything similar since, so I have nothing to give a reference to, but it smelled bad. Not as bad as rotten food or something like that. It wasn’t as intense, but it did smell bad. Like a lingering medium level fart. But obviously, it didn’t actually smell like a fart.\n\nYeah, that memory is INGRAINED in my head. Although now that I think of it, the memory has lost some of its definition. Maybe one day I’ll forget about most of it… I certainly wouldn’t mind.\n\nAnother terrible thing I witnessed was someone punching one of my parents in the face, and my parent just… bleeding from the mouth, and I had to get in there and separate them. That was a rough night.\n\nOh! And also, the day my dog (who at that time belonged to the streets) got run over. The way she was sucked in under the tire… the memory of it makes me wanna cry. She thankfully survived and I picked her up from the streets and took her to a vet. Fast forward a couple days and she was in my home recovering. Then I adopted her. It’s been like 5 years since and I LOVE that dog. She’s my baby. She even sleeps in bed with me. She’s the sweetest.\n\nOh, I also saw a homeless guy that had his face covered in dried up blood. Idk what that was about, and when I first saw him, I thought he was dead, but then he moved a little and I was like “oh”. He seemed to be high or drunk and I was little so I didn’t approach him to ask if he was ok. I hope he is. I hope he turned his life around. Poor guy.\n\nMan… I’ve seen some shit. I mean, maybe not something as horrifying as seeing someone get their head blown off or something, but I think I’ve seen a fair share of fucked up things.",
   "created_utc": 1692045288,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6w9jp",
   "message": "When my friend had a seizure while driving and crashed the car we were in, he wasn't wearing his seat belt, and kinda went forward into the windshield before landing in my lap. As I was stuck underneath him for about 36 minutes, I had nothing but time to, well, look at his pretty gnarly injuries. \n\nHis hand had gone into the windshield pretty good, but I'm why we can't have nice things, and I've seen tendons and degloving injuries before. What I had never even considered a possibility though? Was your talus bone shooting straight out the side of your fucking ankle and through your shoe, which is what homeboy had going on. I'm glad he was still out of it from the seizure in a way, because there is absolutely nothing I could've done to tell him THAT was gonna be alright. \n\nSpoiler alert - it wasn't OK, and now we're both amputees. The Mazada Protégé was not designed to hit a brick yoga studio at full force. \n\nThe jaws of life are pretty cool though.",
   "created_utc": 1692045645,
   "score": 140,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw728sf",
   "message": "New Year's Eve about 20 years ago me and a group of friends were at our local pool hall and one of our friends and his girlfriend got into an argument and she stormed out and started walking to her apartment which was about a half a mile away. We didn't think much of it we just kept playing pool. So right before midnight decided to head to my place and when we walked outside that's when we saw emergency vehicles flying past us so we walked out to the edge of the parking lot and we can see a couple of cars down the street where the ambulances started to pull up so we started walking towards it and when we got there we could see my friend's girlfriend mangled and dead on the side of the road and then a little further up my friend and another man were laying on the road. The other man was clearly dead but my friend was still alive and trying to get up and the paramedics were trying to get him to stay down but he was a very big guy so they were having trouble keeping him down. After life flight came and got him we all started heading toward the hospital but he died on his way there. Apparently when she stormed out of the bar and started walking home he started following her when she was hit by a car andI instantly killed. The man stopped and got out of his car and while him and my friend were trying to tend to her when they were both hit by a drunk driver. The man that hit her was killed instantly but my friend was still alive I remember him trying to get up screaming her name so we thought that he was going to survive but apparently he was in shock and died on the way to the hospital. That was one of the worst nights of my life that shit still haunts me to this day.",
   "created_utc": 1692047737,
   "score": 77,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw76kgn",
   "message": "My brothers dead body. He shot himself with a shotgun (or so we thought). I found his body. The blood. The brains. The hole.  The blood on the wall. The carpet welts. Turns out my cousin broke in a shot him over a girl. We didn’t know for 20 years. But .. either way worse thing I ever seen.",
   "created_utc": 1692049315,
   "score": 106,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6xt2j",
   "message": "My mom had been sick for years, survived cancer twice but that takes a toll on you. We had her home in her bed, she had stopped swallowing well and the hospice nurse said it would be soon. I was in the kitchen with my family and I don’t remember the conversation but I know it was pissing off my dad. I said “hey, dad let’s go back and see mom.” To get him away from it for a bit. I wheel him down the hallway to their bed room. As we come thru the door the nurses are sitting there and you can hear mom breathing hard. I loudly say “hey mom, we came to see you”, the nurse gets up and says it too and puts her hand on moms shoulder. As we get closer to the bed I suddenly realize it’s quiet. The nurse puts up her hand in a stop motion to us and I see her check moms pulse. She stands up and looks at the other nurse who says “oh”. I ask if she just passed and the nurse slowly nods and says “yes”. I am kinda in shock but then I hear dad make the saddest noise I have ever heard. I look at his face and see everything on it at once, sad, loss, pain, happy.  \n\nSo, probably not the worst thing on here but the look on my dads face when I accidentally brought him back to see my mom at the exact moment she died is so far the worse thing I have personally seen so far.",
   "created_utc": 1692046185,
   "score": 39,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7avbt",
   "message": "Worked at a funeral home, after getting my suit on for a service I went into the chapel room to turn lights on. The wife of the deceased was there already with their newborn baby. She had her baby on his chest and telling her to say goodbye to daddy while she cried. He was electrocuted on the job. I don’t do the description justice but for all the sad things I saw there- that got to me the most.",
   "created_utc": 1692050900,
   "score": 39,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw72p06",
   "message": "Top 3 contenders.\n\n1) My father's blood and brain matter on his kitchen floor where he was murdered. I cleaned it up. I wasn't going to hire someone to come in and do it.\n\n2) 4 college students in a convertible ran a red light and went under a semi-truck. I saw 2 heads in the road and the bodies still in the car.\n\n3) My parent's 1980 Cadillac after they hit a lady on Hwy 27 in the middle of the night who ran in front of them.  It tore her leg off; flesh, blood and bits of clothes packed into the grill and wipers of the car.",
   "created_utc": 1692047899,
   "score": 24,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7bxb1",
   "message": "My own birth.. I was forced to watch it on vcr when I was 7....",
   "created_utc": 1692051298,
   "score": 14,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7j0ww",
   "message": "Second worst - my mother breaking down when I told her I was raped at knife point the night before and barely escaped with my life (15 years ago).\n\nActual worst - my mother breaking down even worse when I told her I have stage 4 lung cancer (a month ago).\n\nThe Reaper has unfinished business with me, it seems. I say fuck him.",
   "created_utc": 1692054093,
   "score": 37,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw77jro",
   "message": "Deaths in combat are the absolute worst.  Ever see a person get most of their face shot off by a shotgun look at you and all around you in utter confusion with their one remaining eye as the inevitability of their own death is slowly dawning on them upon them and their esophagus opens and closes trying to gasp for air?  It's the sound that is worst of all.",
   "created_utc": 1692049675,
   "score": 37,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw79dx2",
   "message": "I watched a young man medical volunteer burn alive in the Syrian civil war 2012;\na sniper shot his (ambulance) car and it lit on fire and he burnt alive in it",
   "created_utc": 1692050348,
   "score": 13,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw769r9",
   "message": "My healthy loving mom died 7 months ago from pancreas cancer. The slow way the illness was eating her was so painful to watch. I’m 30 years old and i know there are people here who’ve been through worse but i can’t cope with this shit. I don’t know how to deal with what i’ve been through.\n\nWe just got the keys of our new home we bought so we could start our family near our parents (future grandma and grandpa). We grew up around here so that felt so good to come back home. We start to renovate and she even helped us with cooking and what not. Just three days later we get the news at the hospital. She would live 3 months or less. Thise 3 months became 7 weeks actually. 100 to 0 just like that.\n\nMy life was such a rollercoaster that period. I was building up my life for a future. At the same time my life would change for the worse and was collapsing. \n\nOne day my mom calls me on the phone. I was at the store for a quick supply run for the house in a nearby city. My dad actually was on the phone completely panic. Thats when i knew this was the end. I could literally feel it in my body. I could hear my mom screaming in pain. They would’nt send an ambulance because the situation wasn’t life threatening. I was so furious and scared. I drove to their house in less than 5 minutes (was like 10km away).\n\nI come in and see my mom just in a pain i can’t even describe. She did see my gf and me and she made a sound that told me she knew were there.\nI called the emergency services (again for the fifth time) demanding an ambulance and they finally send one. Unfortunately she died just after i came in. Before they came in she sat straight up between me and my only brother just fu***** dying from pain. I told her it was okay and she was the very best mother we could wish. I told her she won’t have to suffer and i’ll never forget her. She passes out and the operator said we should start CPR immediately. \n\nThe feeling from that experience i’ll never forget. It haunts me to my very core every single day ever since. I was pushing her chest and breathing air in her mouth. I know i should’ve wanted her to wake up but to be honest i was praying she wouldn’t. I feel so guilty about this i actually hate myself. I’ve slipped in my life since this happend. Gained a lot of weight and can’t sleep. She was in so much pain. I didn’t want her to suffer anymore but i tried my best to get her back. Thats when the paramedics, cops, firedepartment and doctors came in. They were too late but i doubt they could’ve done anything about this. \n\nSome people said seeing a person dying from cancer or whatever decease. I can relate and please know you’re not alone in this. Life is hard sometimes.",
   "created_utc": 1692049206,
   "score": 16,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw76yov",
   "message": "In 1999 I went on a road trip trough Spain by car. One night we decided to sleep on one of those resting areas of highways.\nA family parked near us and decided to sleep there too. It was father, mother, a 5yo kid and a 10 yo girl (at least they looked like that). They played a bit and then entered the car to sleep.\nIn the morning they left and when I heard them leaving, I woke up and decided to go too. They were less than 1km from us\nWhen we got to the highway we noticed a cloud of dust ahead. \nWe saw cars stopping and people waving.\n\nThe family car had flipped, the body of the little girl was hanging from the back seat window without the head, still bleeding.\n\nMy girlfriend started screaming and all I could do was put my hand on my mouth and it stayed there for kilometres. \nWe both couldn't sleep with that thought. Never have and never will forget that sight \n\nI do not know if anyone has survived that accident.",
   "created_utc": 1692049460,
   "score": 18,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw70vss",
   "message": "the staff in the troubled teen industry who had been in the program or a similar one themselves. they had been \"re-educated\" and truly believed in it. wilderness therapy is an endless cycle of trauma and brainwashing",
   "created_utc": 1692047249,
   "score": 11,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw76t5o",
   "message": "I saw a person bleeding out of their mouth and anus while giving chest compressions. I have also seen a full code cancer patient squirting blood out of their neck while a Lucas was doing compressions. It looked like all of their ribs were broken. A Lucas is a medical device used to provide quality CPR.  I work in a ICU.",
   "created_utc": 1692049405,
   "score": 13,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7dmly",
   "message": "Crash c-section. Mom was hit by car. She ended up coding. We cut her open and get the baby out to try to give it a chance. God. That one sticks with me.",
   "created_utc": 1692051947,
   "score": 12,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw76sar",
   "message": "I think I’ve already wrote this story somewhere, but back in the day I was in university, (Bogota, Colombia, a well respected university near the cerros orientales) we were architecture students, long story short, we went way up parque nacional, and saw a guy and two girls chopping at a bleeding tote bag",
   "created_utc": 1692049396,
   "score": 9,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw779lq",
   "message": "In 2005 a passenger ferry capsized on Lake Albert between Uganda and the Congo. After a couple of days the ugandan government sent a truck to pick up the unclaimed dead. Maybe 2 dozen bodies. On the way back that truck stopped at the hostel I was working at.",
   "created_utc": 1692049572,
   "score": 9,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw79mqx",
   "message": "In Afghanistan we did a medevac on a young pregnant mom and her child that inadvertently triggered a roadside IED. They were both still alive. The mom was missing a leg and her unborn baby was hanging outside her by it’s cord. The little 6 yr old girl was missing an arm and half her face.",
   "created_utc": 1692050439,
   "score": 13,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ycam",
   "message": "Man jumping in front of a train to end his life. It was just a single moment, he jumps, and the sound of his body hitting the train has stuck with me even today.",
   "created_utc": 1692046370,
   "score": 8,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw762zo",
   "message": "A man fell right in front of me and died at a music festival.  It was obviously an overdose, he was pale and sweaty and before he fell he was all bug eyed from ecstasy.  It was pretty crowded and it took a few minutes for the ems to get to him.",
   "created_utc": 1692049136,
   "score": 7,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw76ksk",
   "message": "Probably my ex breaking down into tears when I broke up with her, thinking she did not value me. My utter shock when tears were streaming down her face.\n\nNot what I expected at all so it crushed me.",
   "created_utc": 1692049318,
   "score": 7,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw76r8n",
   "message": "I worked in an Emergency Room years ago, a pregnant woman registered herself and then disappeared when we tried calling her in. Security said there’s a woman outside smoking crack. Yup that’s her, and now she’s smoked out, we put her in the gurney and began to wheel her in. She’s screaming my baby is coming out, then she takes off her pants and starts fingering her vagina, to show us that she can touch her baby. Wild. She had the baby and was arrested shortly afterwards, with the baby being sent to wherever they send babies without moms.",
   "created_utc": 1692049385,
   "score": 11,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw77a4v",
   "message": "During my first Deployment in Afghanistan a group of guys from my unit where going on a patrol when an IED went off. It warped the frame and caused the guys inside to be trapped and they burned to death. My buddy though tried to get them out and burned his hands and really destroyed him mentally. He started drinking and he had been issued the hydrocodone for his burn. He went from being a fantastic soldier, father and husband to being a homeless heroine addict. His wife left with the kids within a year of him getting back. He had difficulty keeping up with the requirements our commander gave him and he ended up getting a dishonourable discharge and OD’d not long after.",
   "created_utc": 1692049577,
   "score": 9,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw77nwt",
   "message": "We lived in an apartment once and we were sitting on our balcony. On a Saturday. The man that lived above us was having some drinks on his balcony with friends. He was joking about jumping/falling off. He then lost his balance, fell off, hit our balcony on his way down and landed on his back on the ground.",
   "created_utc": 1692049718,
   "score": 8,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw79fde",
   "message": "I saw a guy get shot at a gas station. It was surreal.",
   "created_utc": 1692050363,
   "score": 8,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw79vsk",
   "message": "I was at a bus stop. It was on the corner with a light n four streets. One of the streets was at a slight incline. There was a tractor trailer at the red light on the street with the incline. A lady crossed the street behind the tractor trailer. The light turned green the truck went back a few inches before it started going forward. It knocked the lady down n the tire went directly over hee head. It literally smashed it flat on the ground. Her brains was white just flat on the street. There was no blood. The lady still had her bag still in her hand. The lack of blood n the fact that she still gripped the handbag really stuck with me.",
   "created_utc": 1692050532,
   "score": 9,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6yhf1",
   "message": "It was a video.\n\nThink it was from an Indian news outlet or something.\n\nIt was a kid who in ever literal sense of the word got flattened between a wall an elevator. Kid was probably between the age of 5-6. \n\nWhat happened was that they just left the elevator, the mom started walking while the siblings fucked around as they do.\n\nThen the older sister closes the door on him which proceeds to lock. And then some things I don't quite remember happens which causes the kid to get trapped between the door and the elevator which flattens the kid slowly as it goes up.\n\nAll the way from his toes, knees, hips, ribs, shoulders, neck and finally head. Crushed.\n\nYou see many terrible things on the internet but truthfully, watching a child accidentally dooming their younger siblings a slow torturous death while the mom happened to look away was pretty bad.\n\nNot just what you see but also how the mother and the older siblings must've felt seconds after.\n\nChances are the older siblings probably saw the kids crushed body fall past the door soon ish afterwards.",
   "created_utc": 1692046420,
   "score": 7,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw74nla",
   "message": "My daughter have a febrile seizure. I had no idea what was happening and thought she was dying in my arms",
   "created_utc": 1692048613,
   "score": 8,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw75np5",
   "message": "My brother killed himself. The police checking my moms hands for gun powder residue probably takes the cake. She is/was the best mom anyone could ask for. My brother just fell into drugs and screwed his life up. Not my moms fault.\n\nShe was shaking with grief while they tested her. Just awful.",
   "created_utc": 1692048982,
   "score": 7,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw788hb",
   "message": "Can it be something that happened to you personally?\nIf so I'd have to say pretty much seeing my own skull in my car's rear view mirror right after a car accident where I went forehead first through the windshield.\nIt ripped a hole in my forehead around 2.5 in by 1.5.\nThe image is buried into my brain and I have to gnarly scar to remind myself of it when I look into mirrors.",
   "created_utc": 1692049925,
   "score": 5,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw79d3v",
   "message": "I saw a dog get run over in real time. \n\nHe was on the highway panicking and I was 8 looking out the window at a restaurant. \n\nHe didn’t see it coming because it was a car from behind that just mowed through him. He was crushed down the middle. I looked away and cried heavily that night.",
   "created_utc": 1692050340,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw79eh9",
   "message": "I waited all night (at least from six to midnight) for a train from Chicago to Milwaukee. An old, large black man in the room began shaking uncontrollably. It took around ten minutes and several people yelling “I think he’s having a seizure!” for him to get medical attention. He turned out okay, and they got him onto a stretcher and took him away, but the rest of us just kept waiting. At around 11:00, some guy came in and told us that our train had struck and killed a pedestrian, and that another one was coming. This only caused more of a riot. The train didn’t come until 12:30.",
   "created_utc": 1692050354,
   "score": 5,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7dbpd",
   "message": "Hobo sex",
   "created_utc": 1692051831,
   "score": 8,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7enzd",
   "message": "I saw a cameraman get decapitated when a drag car flipped over the rail at a track.",
   "created_utc": 1692052347,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7hj32",
   "message": "Trump",
   "created_utc": 1692053484,
   "score": 3,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6vhmq",
   "message": "While staying in a sketchy part of Tacoma, a friend and I had to go out to get food because we were starving (at 11 pm). It was basically just us on the sidewalks and cars on the streets. While we were on our way back to the hotel, we see this kid (probably a teenager) running out of a 7/11 with two 6 packs of beer and he was being chased by the store clerk. He runs out onto the street and I yell at him to get the fuck off the busy road or else he'll get hit. The store clerk was smart enough to at least look both ways before following him onto the street. Unfortunately the kid did not. Literally seconds after I warned that he would get hit, a car fucking SMACKS this kid, going probably 45-50 mph. So my friend and I run over to the accident to see if he's ok and this MF is on the ground bleeding profusely, in shock and unable to spit out a single intelligible word or sentence. At that point I knew he was fucked up. \n\nHe stands up and tries to run away but he forgets that he just received heavy brain damage so his legs weren't working the way they were supposed to. I tried to encourage him off the road to lay him in the grass or on the sidewalk at least but before I could bring him to safety his stupid friends in their get away car grab him and shove him in the car to escape the police that were coming. From there I just hoped like hell that they dropped him off at a hospital at the very minimum. I hope he's alive, as unwise and stupid as he may have been that day.",
   "created_utc": 1692045374,
   "score": 2,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6zfhh",
   "message": "When I was about 20 I was working at my local hospital as an orderly, really what I did was the heavy lifting nurses didn't want to. Another part of my job was to respond to code blues to do chest compressions. I came into a scene where a guy was vomiting large amounts of blood quite violently, then coded. Blood was pooling behind his head, coming out of orifices and flying everywhere as we tried to save him. It was pretty wild and has stuck with me since.",
   "created_utc": 1692046746,
   "score": 5,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw710e8",
   "message": "A post autopsy corpse, before embalming.",
   "created_utc": 1692047294,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw75clc",
   "message": "I saw someone at an arts/crafts store knock over a large jar of tiny beads off a shelf.. The beads spread like a wave over the entire store.. The workers looked in horror.. I could tell it was an accident though.. because it was me 😣",
   "created_utc": 1692048869,
   "score": 8,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7gh64",
   "message": "I can’t go into detail because of confidentiality, but I was present when a shift partner initiated and escalated a confrontation between him and an underage, adolescent  residential care client, then retaliated when the client fought back and began trying to inflict temporarily disabling injures on the child. Despite doing my best to literally wedge myself between them, I couldn’t get them to stop. \n\nI made sure the police, social services, my supervisor, managers, and the boy’s family were informed, in detail of all the events surrounding the incident, including my suspicion that this coworker was unsuited to work in our field at all, let alone with such an extremely vulnerable child who already has trauma, should anyone wish to pursue any legal actions. If you’re at all familiar with my post history you’ll know that would have been…quite a document. Essentially a true crime novel. A screenplay for a John Woo short film. \n\nI’ve faced flak over it but I really could not care less. I saw what I saw and I’m not going to lie about it. You just don’t do that to a child.",
   "created_utc": 1692053064,
   "score": 5,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7mrz8",
   "message": "I had to watch doctors do CPR on my 3 week old daughters lifeless body. It’s so haunting and painful to think about 💔",
   "created_utc": 1692055625,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7mt8x",
   "message": "Once I was standing in an apartment complex parking lot and a woman came screaming out of her apartment and grabbed me and pulled me into her apartment. Apparently, her husband had hanged himself in the back bedroom. I had to hold his body up while she found a knife to cut him down. The paramedics came and were trying to revive him but I knew he was gone. The asshole had two little boys in the apartment and they were hysterical and looking at me like I could do something to save their daddy. I went home and got hammered trying to kill it away but of course, I remember.",
   "created_utc": 1692055639,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw73jjt",
   "message": "I watched a woman get sawed in half, (vertically) then 2 guys had their way with the halves.\n\nNo, I didn't see this on a video, I watched this happen in person. I reported it to the police as soon as I could.",
   "created_utc": 1692048204,
   "score": 8,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6wg4l",
   "message": "I knew an old hooker pimping out her 12 year old daughter for drug money.",
   "created_utc": 1692045711,
   "score": 2,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7stfd",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7jex0",
   "message": "Julias Malema singing about killing white farmers and a stadium full of followers singing with him.\nAbsolute racist hate in South Africa that goes unpunished because he is black.",
   "created_utc": 1692054253,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7saxl",
   "message": "The death of my daughter.",
   "created_utc": 1692057887,
   "score": 5,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7vjsz",
   "message": "I was the only one to see a car accident on a dark road. When I came up to the truck I saw a man with half of his face hanging off. He was trying to pull it off because he didn't know what it was. I ended up holding his face on until the ambulance arrived.",
   "created_utc": 1692059214,
   "score": 6,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7xtaa",
   "message": "Why in the fecking HAIL do I keep reading these?",
   "created_utc": 1692060137,
   "score": 6,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7dej9",
   "message": "I was dispatched to a residence for a domestic. When we got there, he had barracaded himself in the house. We attempted to talk through the door for about 30 seconds. Then we heard a loud scream, shotgun go off, then a blood curdling scream, we started kicking at the door, then another shotgun blast... We gained entry in time to watch him turn the shotgun on himself. He had the barrel in his mouth and the whole top of his head blew off. The first shot we heard was him shooting his 7 yr old daughter directly in the face. Then, he did the same thing to his wife before off'ing himself. We only knew the daughter went first because the second scream was from mom, who had to watch her husband kill their daughter from only a few feet away before killing her. From witness accounts the argument was over money.",
   "created_utc": 1692051861,
   "score": 5,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7o6u5",
   "message": "I tell this story a lot, but when I was a kid at the Hoover Dam some guy looked at me, winked, then jumped off. He bounced all the way down before hitting a retaining wall and full-on exploding in gore. I remember they had to drop a bodybag off the ridge to be able to get the body, because it was in such a remote area.\n\nThey put in a fence on top of the dam after that. Not sure if this was the reason or other jumpers.",
   "created_utc": 1692056199,
   "score": 5,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7q2d6",
   "message": "My convoy was ambushed in Iraq, during the initial invasion. The lead vehicle was hit with an RPG, before any vehicles had armor. Two Marines were killed, two more severely wounded. A fire also started, and it took a minute or two for someone to get to them. I was manning the 50 cal machine gun, firing like crazy to suppress the ambush. I heard the sounds, then I smelled the smells. 20 years later and I can still hear them and smell them. Then when we secured, I saw the incredibly young militia that had attacked us. It was pretty easy to see which ones the 50 had hit. I swear one kid looked 14. Quite a few were about to die. I held one kids hand as he gasped for breath (punctured lung from a m16 round). I left the Marine Corps immediate after I got back from Deployment. I still have nightmares.",
   "created_utc": 1692056968,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7vf04",
   "message": "Worked on a hog farm for a year around 30 years ago. In the summer all the waste trucks (trash trucks for nasty stuff like biowaste and dead hogs) broke down. So two very hot weeks later when they caught up, we had a lot of excess beside the waste container we had to somehow get in the container. So we get the tractor and use the boom to do so. Well things didn’t go so well. Rotten limbs tearing off. Bugs crawling out of places you don’t want to see bugs. The odor. Oh god the odor. I was heaving instantly. The farm veterans made fun of me and jumped on the tractor to show me how it’s done. A rotten decapitation later everyone was dry heaving. Truly an awful experience. But i decided to go to college that day.",
   "created_utc": 1692059161,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7vox4",
   "message": "A guy jumped off a bridge and landed at the yacht club I was working at. I was the first person up to him just seconds after he hit. I can still see everything from his CD player still spinning, his left boot a few feet away, and his clothes...21 years later as of 18-Aug",
   "created_utc": 1692059274,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7wq1w",
   "message": "I watched a 6 year old girl ask me to help her find her eye after a man hit her in the face with a hatchet .",
   "created_utc": 1692059692,
   "score": 3,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7xshv",
   "message": "In 7th grade, I witnessed a classmate of mine brutally assault our elderly female substitute teacher. She was trying to settle the class down when after a tense back and forth, he cocked back and punched her square in the jaw.  It landed with a sickening thud.  The teacher took it pretty well, but I can't say the same for the 10 or so follow up shots.  We watched in stunned silence.  Finally a few kids grabbed him and as they held him back, she threw a pair of scissors at him and hit him on the head, unfortunately the rounded end hit him.  He didn't get arrested but we never saw either of them again after that day.",
   "created_utc": 1692060128,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw7xys3",
   "message": "Unknowingly housed in the room my dad took his own life in on the weekend he was buried. My older brother and I were wrestling and somehow managed to shimmy the bed away from the wall...what we saw were remnants of his decision splattered on the wall. To this day, I will never understand why his mom thought it was a good idea to bunk up his two sons(6  and 11) in that room...unless she was hoping for years of therapy for me.",
   "created_utc": 1692060201,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw80f7u",
   "message": "What timing. Witnessed a disfigured body and face from being hit by a car. ive seen gore online but nothing compares to seeing it in person",
   "created_utc": 1692061221,
   "score": 3,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw86jb4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15r19yu"
  }
 ]
}