{
 "submission_id": "15r19yu",
 "title": "What is the most terrible thing you've ever witnessed?",
 "selftext": "",
 "created_utc": 1692034480,
 "permalink": "/r/AskReddit/comments/15r19yu/what_is_the_most_terrible_thing_youve_ever/",
 "score": 80,
 "url": "https://www.reddit.com/r/AskReddit/comments/15r19yu/what_is_the_most_terrible_thing_youve_ever/",
 "comments": [
  {
   "comment_id": "jw61llw",
   "message": "A group of homeless men broke into my car and had an orgy in it",
   "created_utc": 1692034658,
   "score": 73,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw62pgq",
   "message": "One time I went to winn-dixe (a grocery store) in the morning for some breakfast items and found a guy unconscious in the back of the stores building outside. It was a hot day and he was In The sun. Many people passed him but no one stopped. I thought to myself. It’s 87 degrees out (it’s Florida) and he’s passed out in the sun with no shade. I walk over to him to offer him a water. He didn’t respond. He was dead. I didn’t understand that he was dead so I continued to try and wake him up until eventually I called ambulance and they tried to bring him back to life but he overdosed and was dead for 30 minutes already by the time I went to help the dude. Truly traumatic.",
   "created_utc": 1692035056,
   "score": 57,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw674gc",
   "message": "When my mentally ill gf (now ex) killed our dog. I didn't see the act itself, I just heard him whimpering and then I saw him bleeding from his nose. Took him to the vet, he had broken ribs and a collapsed lung, and we were basically broke so we couldn't pay for the treatment (which included putting him on a ventilator that would've cost like $200 per day). Putting him to sleep was unfortunately our only option. When I asked her what happened, she said \"Well, he peed on our bed, so that's what he gets.\"",
   "created_utc": 1692036639,
   "score": 36,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6259s",
   "message": "I was at a underground live concert and it was end of the night. I Walk out the club and watched four people get hit by a car full force. They got knocked down like bowling pins.\n\nEdit: might I preference—they were all lined up side by side walking down the street when a car hit them and sent them flying. I’ve never heard more ear shrieking screams.",
   "created_utc": 1692034853,
   "score": 24,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw65ie5",
   "message": "That time a motorcycle going triple digits lost it and the guy got shredded on the guardrail posts was pretty fucked. Ended up running over some pieces of dude. Not the worst thing I've seen tbh, just gruesome.",
   "created_utc": 1692036059,
   "score": 14,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw694q7",
   "message": "Saw a lady drop 2 handfulls of tacos at a taco truck, like a dozen tacos just gone!",
   "created_utc": 1692037364,
   "score": 31,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6fio2",
   "message": "Went to a party with my girlfriend at the time about 5 years ago to a friends house. His cat just had a litter of kittens and he was offering them for free to anyone who came in and wanted them (the party wasn’t for the kittens, just so happened they were born like 2 weeks before the party). \n\nOne of the guys who came asked if he could keep one of the kittens. Guy with the kittens agreed. A few hours later when everyone is drinking and having a good time the guy with the kitten and 2 other guys go outside with it and said “hey watch this guys!” \n\nThey ran down the stairs (we were on the 3rd floor with a balcony), 1 of them got in a car and started to drive around the apartment complex to come back. As he rounded the last corner to come back he floored it and as he did this, his friend holding the kitten threw it underneath the car killing it instantly. \n\nThey all came back up stairs laughing hysterically. My gf after seeing that happen immediately broke down crying (several folks did) and after she composed herself we left immediately.",
   "created_utc": 1692039679,
   "score": 11,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ek0d",
   "message": "As a teenager I volunteered at an event called Muddy Buddy (think low-grade Spartan/Tough Mudder before it became popular). I was serving water at an A-frame cargo net obstacle when a man fell from the top and landed like a log with a major thud. People continued to climb down and walk around him while he had a blank stare and odd, repetitive breathing. Shortly thereafter, a few people in the race started applying cpr while waiting for the ambulance. It took over 20 minutes for the ambulance. They loaded him up and hauled him away but he was already very blue in the face. I believe he had a heart attack, and I never knew if he made it, but I was not hopeful.",
   "created_utc": 1692039328,
   "score": 11,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw69lf6",
   "message": "First thing that pops to mind is when I was in traffic some years ago. A mother mallard walked into the road with her ducklings trailing behind. Everyone naturally stopped to let them cross. All except this one thug-life-livin' a-hole; just kept driving and crushed one or two of the babies. I couldn't watch, but I saw the shocked and disgusted looks on the other drivers' faces.",
   "created_utc": 1692037531,
   "score": 10,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw69ugd",
   "message": "There has been quite a few, but one that comes to my mind was few weeks ago when I was working a nightshift. My coworker asked me help to assist with a fallen patient, so I went there to do just that.\n\nPatient hadn't hit her head, she was laying on bathroom floor. There was blood however, it was coming from patients leg apparently. Her leg was broken, and it was in abnormal position. End of her leg had broken clean off, her skin was only thing holding it together. It was mangled laying on floor. She asked: \"How does it look?\" and I replied: \"Very bad.\"\n\nWe had no idea how it happened. She was still conscious and not in huge pain. We had problems getting help from the ER or from ambulance. Apparently they didn't think it was that big of priority. When someone did show up. Even them called doctor again to make sure what to do. \n\nWe got patient together to ER. \n\nThere are few others as I said, and this isn't probably even worst, but it is the one I can think of right now.",
   "created_utc": 1692037622,
   "score": 7,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6h3ri",
   "message": "7th Grade Social Studies (would have been the year 2005) we had a substitute teacher. All of us were filing into the classroom to grab our seats. Everyone noticed the substitute looked like they were napping and a few kids were cracking jokes and doing impressions of snoring.\n\nIt became quickly apparent as the substitute teacher's face started turning blue that something was wrong and two students ran to get the assistant principal while another dialed 911 on the in class telephone (no smartphones yet). \nWe were rushed out of the classroom and set up with optional counseling and the rest of the week off afterwards.\n\nHe had died of some kind of choking or cardiac arrest, I cannot remember which. In fact, I have tried to get this out of my head for years because I'll never know if I saw them die or if they were dying in front of me while I did nothing.\n\nWhile the image of them with their head down on the teacher's desk slowly turning blue is etched into my mind, it's really the sounds of the mocking students that haunt the memory of it all.\n\n(It is also the reason I regularly get certified for CPR and other basic first response to this day.)",
   "created_utc": 1692040263,
   "score": 5,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw69k4z",
   "message": "I watched a motorcyclist crash and die",
   "created_utc": 1692037519,
   "score": 5,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6en24",
   "message": "The first thing that comes to mind is when I was driving home with my parents in the evening in the city center and there a biker's head was torn off by a chain when he crashed into a car.",
   "created_utc": 1692039358,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6f9va",
   "message": "When we was young at a addicts house, she overdosed💉. Leaned on the wall slid down and never stood up again",
   "created_utc": 1692039591,
   "score": 5,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6hkkd",
   "message": "Many, many years ago ago I was driving home for Christmas and I got stuck on a major highway behind a horrific accident. Eventually they opened up a single lane and as cars came to pass through the accident scene they had lined up 5-6 deceased people on the shoulder of the highway in the snow. An entire family was wiped out and visible to all who were still moving. Even now decades later it still makes me sick to my stomach just thinking about it. This was maybe two days before Christmas.",
   "created_utc": 1692040433,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6imwa",
   "message": "The decline and eventual death of a cancer patient.",
   "created_utc": 1692040813,
   "score": 3,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6kuzm",
   "message": "Probably ripping my own arm open because I went through a single pane of glass, panicked, twisted my arm and pulled it out. \n\nGot a decent scar.",
   "created_utc": 1692041603,
   "score": 3,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6lu35",
   "message": "Watching a woman have her puppy stolen from her while she screamed for help and cried. \n\nNote I was 4 stories up in an apartment and heard the commotion then looked to see what was happening, bystanders all watched. This took place in London.",
   "created_utc": 1692041949,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6o7mq",
   "message": "Watched my father die a slow painful death.",
   "created_utc": 1692042787,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ckkw",
   "message": "Daniel Pearl beheading video. That kind of brutal shit is all over now but not so main stream back then. Was really fucked.",
   "created_utc": 1692038613,
   "score": 2,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6do76",
   "message": "Ronnie McNutt's shotgun suicide video. Hit harder because my fiance is also a veteran who struggles.",
   "created_utc": 1692039010,
   "score": 2,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6la2b",
   "message": "Watched my mother essentially what I can only describe as; Rot from the inside out due to X amount of different Cancer treatments.    \n    \nSomeone so strong, so full of life, become a few shades off an animated corpse is enough for me to question ever undergoing treatmemt should I ever fall ill with the same thing.    \n    \nIf I am to be remembered by those that love me, I  don't want to be remembered like that as the last thing they see.    \n    \nI don't blame the doctors at all, but treating cancer is so much of a gamble, I am really not sure it's worth it.",
   "created_utc": 1692041752,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ts8d",
   "message": "Gang rape victim.  Humanity sucks.",
   "created_utc": 1692044778,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6e45b",
   "message": "First Tuesday in November, 2016",
   "created_utc": 1692039167,
   "score": 4,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6lvg7",
   "message": "My ex girlfriend singing.",
   "created_utc": 1692041963,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw65wru",
   "message": "My son push poop out with a diaper offf",
   "created_utc": 1692036200,
   "score": 2,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6clrs",
   "message": "2 girls, 1 cup.",
   "created_utc": 1692038624,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6f4x5",
   "message": "In London I witnessed a Pimp threaten one of his girls under a bridge, pull up her skirt, and beat her across the face.",
   "created_utc": 1692039540,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6bqtz",
   "message": "A slow murder that was prolonged by months and months of torture and starvation. I'm still wrapping my head around it all",
   "created_utc": 1692038313,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6i169",
   "message": "A girl I liked giving head to another guy(who knew I liked her)\n\nIn that moment i went through a lot of emotions.\n\nIt was a situation where I couldn't blame anyone except my own luck.\n\nNeither the girl nor the guy mean anything anymore but I have stopped sharing with people regarding who i like and other love related things.",
   "created_utc": 1692040597,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6m9md",
   "message": "It was late night in long beach in a free dance studio in long beach, ca. A black kid ran up to me really fast, it is long beach like I said. I was alarmed and ready for anything, but he was crying, like fucking crying. I was like WTF. he asked for help, his cousin or his bother was stabbed in the neck and was dying. We called 911 police and ambulance came. But the police blocked the ambulance for some reason. I was a young cum guzzler so I didn't know what to do, we all watch a kid die that night. Mexican dudes stabbed him in the neck.",
   "created_utc": 1692042103,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw653sf",
   "message": "Found a guy in a graveyard who committed suicide. Was a great start to a Monday morning",
   "created_utc": 1692035914,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw687mr",
   "message": "Death. I work in a nursing home.",
   "created_utc": 1692037034,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6fkqx",
   "message": "Driving down the highway, I'm a bit behind a truck carrying very large tires. Like for massive tractors or something. Some kind of machinery. The tires are covered in a tarp. I see something small fall off of the back of the trailer and it bounces up past my window, and I see it's one of those rubber tie-down tarp straps. Like seriously, just one. \n\n\u0026amp;#x200B;\n\nThe truck goes around the curve in the road ahead of me, and one of those massive tires slips right off of the side. A van is driving next to them and it slams into the van and just crumples the thing. Tire bounces back into my lane, I swerve wildly to avoid being killed. It was awful. Just an absolute mind fuck of a moment that all seemed to happen in slow motion.",
   "created_utc": 1692039701,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6g0f0",
   "message": "Saw someone get stabbed in England.",
   "created_utc": 1692039863,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6g8ln",
   "message": "My bio dad’s face. I shit you not. He’s that fucking ugly.",
   "created_utc": 1692039947,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6htbp",
   "message": "When I was a kid, there was a neighbor kid I was friends with. I saw his mom go batshit once and start beating him, it was traumatic just to witness.",
   "created_utc": 1692040519,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6iue1",
   "message": "Several but the one that springs straight to mind, is a woman being hit by a bus on a zebra crossing and her foot being ripped off on the railings. The noise will haunt me forever",
   "created_utc": 1692040885,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6j9zz",
   "message": "I was at a punk show at my friend’s house and while a lot of us were hanging out on the front porch, this lady who lived across the street shot her grandfather point blank in the back of his head killing him instantly.",
   "created_utc": 1692041036,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6jbyw",
   "message": "Some of my classmates showed me a video of a cat in a blender, it just became red slush immediately",
   "created_utc": 1692041055,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6jhdp",
   "message": "It's between my neighbor falling and hitting his head on concrete and the aftermath of my dog getting hit by a truck.",
   "created_utc": 1692041109,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ke0n",
   "message": "Witnessed a lethal injection execution one time",
   "created_utc": 1692041434,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ke41",
   "message": "Whle walking home from school in Jr. High, I saw an infant fall 2.5 stories out of a window onto a concrete driveway.",
   "created_utc": 1692041435,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6lipa",
   "message": "Where I was present? Nothing really. But some of the shit I’ve seen in r/fiftyfifty is pretty fucked up",
   "created_utc": 1692041838,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6mduu",
   "message": "I have two because they're both awful.\n\nOnce I was camping with my dad and brother. I was roughly 11- 12 yrs old. I don't remember exactly. We were standing by a lake watching the boats and stuff when a boat hit a girl on a jet ski. As they pulled her finally to the dock, we saw that the propeller had basically ripped/cut her leg off. It was just barely hanging on. The ambulance finally arrived and they carted her away. She was not conscious. I always wondered how/if she recovered. \n\nAnother time, I was sitting at the table with my mom and our neighbor playing cards. I was 12-13 yrs old. It was dark outside because it was getting late on a weekend night. Someone knocked at the door so I got up to answer it. The second I opened it, this poor old guy who looked in terrible shape and likely homeless, asked me for water and then dropped dead right in the doorway. I think from the time I opened the door to the time he dropped was maybe 3 seconds. He said only \"water\" when I opened and then fell. My neighbor who was over was a nurse so she came running to help. We called 911 but I didn't see how everything ended. My mom made me go upstairs to my room once he had fallen in our doorway.",
   "created_utc": 1692042143,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6mo8m",
   "message": "The Taliban rounding villagers up in the town center and chopping off their heads.  Viewed from a live ISR feed.  Rules of engagement prevented us from firing a missile until the first attack.",
   "created_utc": 1692042245,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6nyrz",
   "message": "Reading some of these other posts mine is very mild but still I think about it often..\n\nI used to mow my grandma's lawn every week for years. One year I guess I went over a rabbit hole and it startled some of the bunnies who ran out and I had hit one with the blade. \n\nThe sounds of it's tiny shrieks still stick with me and the picture of half of its face gone is burned in my brain.  I didn't know what to do but I knew I had to put it out of its misery as fast as I could so I picked it up with a shovel and put it in my bag of cut grass and suffocated it.\n\nI know it wasn't my fault but I still feel terrible.",
   "created_utc": 1692042701,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ql1l",
   "message": "The video of that bodybuilder murdering his ex on Instagram livestream with the baby crying on the floor as he executed her right in front of it",
   "created_utc": 1692043639,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6qriw",
   "message": "The body of a relative.",
   "created_utc": 1692043704,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6qw7k",
   "message": "Saw someone jump off of the Golden Gate Bridge.",
   "created_utc": 1692043751,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6r8eq",
   "message": "YouTube video of a guys killing himself live….",
   "created_utc": 1692043872,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6r9z2",
   "message": "When I was about 9 or 10, our neighbor was backing into his garage with cement walls with his arm hanging out the window. He accidentally got too close to the wall and smashed his arm... he proceeded to panick and jet forward and backwards, repeatedly and ineffectively, severing his arm almost completely. His arm was hanging off of the bare remaining tendons (I think) looked like a stringy thing. My family was outside enjoying a nice sunny day playing catch. We were all shocked and jaws all dropped. It took literal several minutes before my dad could move his legs to run and go call for an ambulance.\n\nI am now afraid of anybody sticking their arms or feet out my windows.",
   "created_utc": 1692043888,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6rd7p",
   "message": "I was driving to work on 14th avenue in Joburg. A taxi driver had JUST been shot like a minute or so before. I saw him hanging out the drivers window with blood down the door and puddling on the floor. It was fucked.",
   "created_utc": 1692043919,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6rrws",
   "message": "I was standing at the school bus stop one morning and a cat was walking across the road when a big Cadillac car drove right over it. It sounded like if you stepped on a bag of potato chips 😭",
   "created_utc": 1692044066,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6rsox",
   "message": "I saw a dog get hit by a car while I was waiting for the bus stop in middle school.  I had noticed two dogs running along the road unsupervised, and I wanted to go to them but they were very big dogs. Plus I was worried if I left the stop, and the driver saw no one there, the bus would just keep going (it had happened before). \n\nSo I watched the two dogs for a little bit until the pit bull got clipped by a car. I still vividly remember him spinning mid air and off to the side of the road. I REALLY wanted to go see if he was okay but it was so far away. The car didn't swerve to try and avoid him or anything, and it didn't even stop. The other dog stood next to his downed friend the whole time.\n\nEventually a lady pulled over, picked up the dog, and put him (and his buddy) in her truck. I hope the dog was okay, but I'll never know. \n\n(I also had unsupervised internet access growing up, but I feel like the dog was worse somehow. Maybe because I blame myself for not stopping it.)",
   "created_utc": 1692044074,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6rwsk",
   "message": "The death of 2 people that I caused",
   "created_utc": 1692044116,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6s2ky",
   "message": "Seen a guys foot implode from a rv and another guys hand get completely smashed and his fingers looked like chicken tenders. Bother we’re pretty bad but there’s a lot worse you can find on the internet. In person tho that sht was like wow",
   "created_utc": 1692044173,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6s858",
   "message": "Saw someone get their head run over in a hit and run, skull cracked open like a smashed pumpkin and his brains looked like scrambled eggs and ketchup all over the road.",
   "created_utc": 1692044228,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6sdah",
   "message": "A group of ten people screaming at each other in the middle of the street because \"grandma\" was dying and they wanted to know about inheritance. I quote \"How cares what happens to her, what's important is what each of us is getting!\". \n\nI entered home kind of depressed (They happened to be discussing this outside of my building).",
   "created_utc": 1692044281,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6spgi",
   "message": "I saw a plane crash into a house two blocks from my high school, everyone in school saw the plane falling from the sky, crash and we could immediately hear and see the smoke/fallout.",
   "created_utc": 1692044400,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6sr5r",
   "message": "Sometime in my high school years, in a west Texas town, a neighborhood pal wrecked his 4wheeler. No helmet on, hit a large metal barred fence head first. Running up to the incident was rough. The driver was on the ground flat on his back convulsing and the passenger who rode on the back was 10-15 feet away rolling on the ground with one of his legs not moving. The drivers face was turning blue. Blood seeped out of his mouth and he had bones sticking out of this wrists. \n\nWe tried CPR on the driver and to calm the passenger down but with your knee and below not being attached to the rest of your body it was almost impossible. \n\nI’ll tell ya what, the worst part was after 10 minutes of us high school teens trying, the dad of the driver showed up. We weren’t even a mile from his house. He tried to revive his son but after some time he stood up crying out to the crowd “somebody help me! Somebody save my only son!” Core memory locked in at that moment.",
   "created_utc": 1692044417,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6szvt",
   "message": "Saw a dog drown in the ocean.\n\nThere was a high tide warning that day, and we had gone to a nearby beach to walk on it, when these tourists showed up and just let their dog loose. After a few minutes, they were screaming at the dog to come out, but it was too late. I felt bad for the dog, but not the people. Fuck them.",
   "created_utc": 1692044502,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6t3qr",
   "message": "Saw a pitbull kill a smaller dog in a park that was pretty messed up",
   "created_utc": 1692044539,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6td8n",
   "message": "Teenager do a cartwheel through the air after a car tried to beat a yellow light. The kid rolled a few times along the pavement and stopped on the grass on the opposite side. I hsd no working phone to call 911, but other witnesses were on it almost immediately. As I was walking back there were like 4 police units and an ambulance along with an engine.",
   "created_utc": 1692044631,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6th65",
   "message": "found a floating corpse in the river.",
   "created_utc": 1692044671,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6tmoj",
   "message": " Female genital mutilitation",
   "created_utc": 1692044724,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6tuhg",
   "message": "Anything that involves Korean people is pretty awful.",
   "created_utc": 1692044800,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6u33j",
   "message": "Watching my best friend die.",
   "created_utc": 1692044883,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6udmx",
   "message": "I saw a guy climb up on a hill to watch a thunderstorm come in with his son. The storm was miles away, it wasn't even raining where we were. \n\nAfter about five minutes of me and my friend exchanging comments like \"he really shouldn't be up there\", he got struck by lightening. His son came running down the hill. Somehow he wasn't hit even though they were standing really close together. \n\nI was still there when the ambulance came and got him off the hill. He died instantly, and his hair had turned white. \n\nI was 12-13 and my friend and I were taking the bus to the mall so I could buy a Black Sabbath CD that contained the song \"Electric Funeral\".",
   "created_utc": 1692044988,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6uemv",
   "message": "I saw someone pour boiling water on a sleeping homeless man.",
   "created_utc": 1692044998,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6ul9x",
   "message": "A kangaroo getting completely destroyed by a road train",
   "created_utc": 1692045063,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6uq43",
   "message": "Was made to watch someone shoot a puppy.",
   "created_utc": 1692045110,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6us5y",
   "message": "Animals being skinned alive and tortured in other ways",
   "created_utc": 1692045129,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6v89v",
   "message": "Parents receiving the news that both their daughters passed in a car crash. We said goodbye to them before they left less than an hour before.",
   "created_utc": 1692045285,
   "score": 1,
   "submission_id": "15r19yu"
  },
  {
   "comment_id": "jw6v8m2",
   "message": "I once saw someone break a bottle of rum on someone else’s head. The amount of blood that came out was concerning. The guy was fine, but seeing the floor absolutely splashed with blood like some had been murdered was… traumatic. Like, I legit don’t know how the guy wasn’t fainting or something, like, it was so much blood! But no, the guy fought the other guy off, then left the place and called the cops while holding his shirt over his head to stop the blood from going all over him.\n\nGuys… like, I’m not kidding, it was a lot of blood. Like… 16 feet of blood covering the floor. It legit looked like someone had been stabbed or something. And the smell… ugh, the smell was the worst! It was gross. It didn’t smell like metal, which is what I would’ve thought it would smell like. Honestly, I haven’t smelled anything similar since, so I have nothing to give a reference to, but it smelled bad. Not as bad as rotten food or something like that. It wasn’t as intense, but it did smell bad. Like a lingering medium level fart. But obviously, it didn’t actually smell like a fart.\n\nYeah, that memory is INGRAINED in my head. Although now that I think of it, the memory has lost some of its definition. Maybe one day I’ll forget about most of it… I certainly wouldn’t mind.\n\nAnother terrible thing I witnessed was someone punching one of my parents in the face, and my parent just… bleeding from the mouth, and I had to get in there and separate them. That was a rough night.\n\nOh! And also, the day my dog (who at that time belonged to the streets) got run over. The way she was sucked in under the tire… the memory of it makes me wanna cry. She thankfully survived and I picked her up from the streets and took her to a vet. Fast forward a couple days and she was in my home recovering. Then I adopted her. It’s been like 5 years since and I LOVE that dog. She’s my baby. She even sleeps in bed with me. She’s the sweetest.\n\nOh, I also saw a homeless guy that had his face covered in dried up blood. Idk what that was about, and when I first saw him, I thought he was dead, but then he moved a little and I was like “oh”. He seemed to be high or drunk and I was little so I didn’t approach him to ask if he was ok. I hope he is. I hope he turned his life around. Poor guy.\n\nMan… I’ve seen some shit. I mean, maybe not something as horrifying as seeing someone get their head blown off or something, but I think I’ve seen a fair share of fucked up things.",
   "created_utc": 1692045288,
   "score": 1,
   "submission_id": "15r19yu"
  }
 ]
}