{
 "submission_id": "15r41lq",
 "title": "Men: How do you prevent your pubes from smelling when showers and antibacterial soap aren’t cutting it?",
 "selftext": "",
 "created_utc": 1692040510,
 "permalink": "/r/AskReddit/comments/15r41lq/men_how_do_you_prevent_your_pubes_from_smelling/",
 "score": 103,
 "url": "https://www.reddit.com/r/AskReddit/comments/15r41lq/men_how_do_you_prevent_your_pubes_from_smelling/",
 "comments": [
  {
   "comment_id": "jw6i9xn",
   "message": "If you're needing to resort to antibacterial soaps down there, you need to clearcut the forest/ wax and rebuild.",
   "created_utc": 1692040684,
   "score": 126,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6hzxx",
   "message": "Trim them. They hold a lot of sweat",
   "created_utc": 1692040584,
   "score": 83,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6r8fz",
   "message": "Shave them off and tell him to stop lying and wash his dick. There is no reason for it to get to the point you are saying unless the person is gross and lazy about it",
   "created_utc": 1692043873,
   "score": 220,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6tudi",
   "message": "Is it possible you biologically just don't like his pheromones? Was this always the case with your current partner, or did it start recently?\n\nOne problem could actually be the use of antibacterial soap... This stuff often wipes out the good bacteria that we need for healthy skin, and foul bacteria survives and takes over.",
   "created_utc": 1692044799,
   "score": 93,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6kavi",
   "message": "I'm at a loss, maybe he should check out a doctor? It really shouldn't smell if hygiene is okay. Maybe there's a fungus or something.",
   "created_utc": 1692041403,
   "score": 42,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6hyie",
   "message": "I've never smelled my pubes.  I'm not that flexible.",
   "created_utc": 1692040570,
   "score": 56,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6orun",
   "message": "Wait. \n\nPubes shouldn’t smell. Pubic areas can. Lotta stuff goes on down there. \n\nRecommendations: \n\nTrim it all down. \nShower or dude wipes the area before/after sexy time. \nShower daily. (If that wasn’t obvious) \nGet ball deodorizer. \nWet wipes for 2. Asure the ENTIRE area is cleaned well after poops. Every single poop. \nHydrate. \nClean diet. (Fruit helps) \nDon’t reuse really dirty clothes. If he constantly wears shorts that have a funk, then his junk will have the funk. \n\n\nIf the funk continues, go see a dr cuz something is wrong.",
   "created_utc": 1692042988,
   "score": 66,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6w32h",
   "message": "That honestly sounds like your man doesnt wash his taint, behind his nuts, or less frequently than once a day or so. It shouldn’t be that bad of an odor",
   "created_utc": 1692045582,
   "score": 13,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6nyub",
   "message": "Shave.  The hair itself has become the problem.",
   "created_utc": 1692042701,
   "score": 24,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6lw8o",
   "message": "He does not wash as well as he says he does. Also, how is his diet? That can make a person's BO terrible even with decent hygiene.",
   "created_utc": 1692041971,
   "score": 29,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6l1g6",
   "message": "Just shave your shit bro",
   "created_utc": 1692041667,
   "score": 46,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6kzpr",
   "message": "Manscaping.",
   "created_utc": 1692041650,
   "score": 9,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6vn7o",
   "message": "If your lower abdominal area stinks directly after washing it,  you should go see a doctor.",
   "created_utc": 1692045427,
   "score": 7,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7hjrs",
   "message": "2 to 4% Zinc Pyrithione soap for down low and pits. You can get it on Amazon. It has both antibacterial and antifungal properties, and any area of the body with a skin fold/where arm\n or leg meets the body is more prone to sweat and darkness. Our body’s natural skin bacteria “eat” the sweat and that causes the distinctive, traditional “BO” we all know about. Because of sweat, warmth and darkness in those same areas, yeast and fungus are more likely to proliferate which can also add to the funk. Zinc soap targets bacteria and fungus, and yeast a little bit, not quite as much if yeast or fungus are already out of control. Also, athletes foot meds are good for fungus on skin, but they can’t be used on genitals (unless a doc says so). \n\nIf the smell is from a significant overgrowth of candida (yeast), it can, but not always, have a distinctive smell (almost like pungent sourdough bread, or sometimes even sweet-ish, depending on other chemical factors), in which case you might need to target that more specifically with a shampoo with keteoconazole in it. It also sometimes helps with fungus. Good luck sister!\n\nETA: If anything smells putrid or rotten, it could mean skin breakdown or microbial resistance to normal OTC interventions, which case the person should see a doctor.",
   "created_utc": 1692053492,
   "score": 5,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6od6a",
   "message": "Somewhat unrelated, but when my armpit hair smells bad - and that is easy to tell and soap doesn’t make it right and you’ll be able to smell it through deodorant (well I can and have been labeled a super sniffer and BO is one of those I can easily identify)\n\nMy go to is shampoo.  Seems to work 100% of the time for me.  Might be worth trying",
   "created_utc": 1692042842,
   "score": 5,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7lj34",
   "message": "The funk is coming from the inside out. Anything topical won't address the root.\n\nI used to have TERRIBLE swamp ass anytime a drop of sweat pooled in my nether regions. It washed away in the shower, but sometimes I sweat after taking a hot shower. So I'd get musty even though I just cleaned myself thoroughly.\n\nAfter changing my diet significantly and improving my gut health, I could sweat all day and it wouldn't smell anything near the death and destruction of carcass odor my ass used to produce.",
   "created_utc": 1692055115,
   "score": 6,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7raxs",
   "message": "Seek medical attention",
   "created_utc": 1692057471,
   "score": 5,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6rpjw",
   "message": "Is it hi is pubes or ass? The smell could be wafting.",
   "created_utc": 1692044043,
   "score": 4,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7hr4g",
   "message": "It could be a fungal infection, but that would require a doctor appt.\n\nOtherwise…Trim his bush down as close to the skin as possible clean with soap…exfoliate… clean again. Air dry.   \nMake sure he also wipes his ass clean. Men have a lot of hair in the taint and ass hole area. Make sure he gets in their with his soapy hand and cleans well. If he is uncircumcised that could be an issue as well, he needs to clean well after workouts.. sex… peeing… just every day really. Pull that foreskin back and gently clean.",
   "created_utc": 1692053573,
   "score": 3,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw83d9r",
   "message": "My junk used to smell a lot due to the underwear that i was wearing, even with daily showers. Once i switched from tight polyester based briefs to cotton boxers, it gave my boys room to breath. Tighter briefs and non breathable fabrics trap all sorts of smells throughout the day in that area. If all other hygiene tips from this thread dont work, give this a try.",
   "created_utc": 1692062451,
   "score": 4,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6lof6",
   "message": "So many questions.",
   "created_utc": 1692041894,
   "score": 3,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6xft6",
   "message": "Maybe he's not washing thoroughly enough? You can't treat your junk like you're handwashing a cashmere sweater. Get a loofah and spend some time soaping and scrubbing down there.",
   "created_utc": 1692046055,
   "score": 3,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw75x1e",
   "message": "There are anti fungal powders / creams , if that’s the problem, also betadine soap will get you a new start, since sometimes odors are a combination of fungus and bacteria",
   "created_utc": 1692049077,
   "score": 3,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw784oo",
   "message": "Not a super big guy but I have meaty thighs and the dad bod going on. I used to shave it all off but as I got older it just became a pain in the ass with ingrown hairs and itchiness growing back. \n\nThis is how I roll: if I haven't trimmed and they're looking a little long, shampoo it or condition it. Stuff for beards work great in that area cause it's just as bushy. I also use a facial cleaner for the inside of my legs to prevent heat boils from going to the gym or sitting on the toilet.  That shit will 100% get rid of it in case anyone on here has the same problem. \n\nWhen I get out I use deodorant on arm pits and leg pits. Yes, you have leg pits. The section of legs connecting to your pubic area has sweat glands and trust me, if you sleep at night and sweat most likely that area will be sweaty. \n\nWomen love it! That area does not ever have any odor at all and it be smelling fresh all the time. \n\nYou're welcome.",
   "created_utc": 1692049887,
   "score": 3,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw8vkho",
   "message": "If it's getting stinky down there and you're washing regularly there's a good chance you have jock itch.",
   "created_utc": 1692076159,
   "score": 3,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6s4to",
   "message": "Doctor time.",
   "created_utc": 1692044196,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6suc9",
   "message": "I shave them",
   "created_utc": 1692044448,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6xc27",
   "message": "What??????",
   "created_utc": 1692046018,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw713bx",
   "message": "Should see a doctor…",
   "created_utc": 1692047323,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw73cfn",
   "message": "Use a shampoo for dandruff; zinc or ketokonozal (sp). It kills stuff regular soap doesn’t. Works really well for body odor causing stuff like yeasts.",
   "created_utc": 1692048131,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw73mkh",
   "message": "Trim the verge, then have a sitz bath with a couple tablespoons of baking soda.",
   "created_utc": 1692048234,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw77yal",
   "message": "CeraVe SA cleanser. I wash my face, then I wash the pits and pubes. Many times I don't even need deodorant. Keeping well trimmed helps too.",
   "created_utc": 1692049823,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7ry8g",
   "message": "TIL pubes could smell.",
   "created_utc": 1692057740,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw8q3r3",
   "message": "I've kept my sack shaved since I was 20. Never have I had stinky ball problems.",
   "created_utc": 1692072980,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw8regf",
   "message": "Hack anf whack the forest down friend.",
   "created_utc": 1692073691,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw8tcv2",
   "message": "Stop using anti bacterial soap! Youre killing your skins microbiome that keeps it healthy! Its not the hair that is stinky its the fungi and bacteria that are thriving because youre killing off the good bacteria. Use some head and shoulders down there to ward off fungi and try a simpler routine with diluted oil soap (dr. Bronners) every other day to give your skin some rest. Our skin has natural barriers and when you fuck with it too much other shit takes over!",
   "created_utc": 1692074814,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw8yg31",
   "message": "Time to call in the landscaping crew for a full makeover!",
   "created_utc": 1692077998,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw8yiac",
   "message": "Trim and look into manscaped. They have a wash for down there that has been wonderful for me",
   "created_utc": 1692078037,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6mmff",
   "message": "If it's truly the hair you need to wax and start over. There may be bacteria or fungal growth.",
   "created_utc": 1692042227,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6qvuh",
   "message": "Try apple cider vinegar.  It works on rashes and infections, I don't see why it wouldn't work underneath either",
   "created_utc": 1692043748,
   "score": 3,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6t2ax",
   "message": "It could be fungal.   Put some athlete's foot cream on the area a couple times a day and see if that helps.",
   "created_utc": 1692044525,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6xpgq",
   "message": "Must be a jungle if it’s that bad, clear cut and practice controlled forestry.",
   "created_utc": 1692046150,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6qsuf",
   "message": "It may be time to trim Abe Lincolns beard there friend.",
   "created_utc": 1692043718,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6ucfr",
   "message": "🔪🍆",
   "created_utc": 1692044976,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw72cbn",
   "message": "chop it down",
   "created_utc": 1692047772,
   "score": 2,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7el7i",
   "message": "If regular hygiene isn't cutting it I'll usually just hang a car air freshener from my junk.",
   "created_utc": 1692052317,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7rwxf",
   "message": "I shave all my pubes.",
   "created_utc": 1692057724,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6mdam",
   "message": "Shave",
   "created_utc": 1692042138,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6vnw4",
   "message": "Try rubbing in some coconut oil. Anti microbial, anti fungal, anti viral, all natural, and smells decent also.",
   "created_utc": 1692045433,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6odlj",
   "message": "I guess you could give vinegar or baking soda a go.   The Internet recommends that for everything else.",
   "created_utc": 1692042846,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6p3nl",
   "message": "Shave, eat healthier",
   "created_utc": 1692043106,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6q5tp",
   "message": "Shave them off.",
   "created_utc": 1692043487,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6twvp",
   "message": "shave them",
   "created_utc": 1692044823,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6v661",
   "message": "Trim/shave. Pubes retain sweat like nobody's business. Especially during the summer.",
   "created_utc": 1692045264,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6xkj9",
   "message": "Shave it",
   "created_utc": 1692046101,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6zo76",
   "message": "That's all really normal. Women aren't naturally odorless. We're not naturally, like, \"the anti-man\"; hairless, odorless, clean, frizz-free, and delicate in opposition to the \"male\". Like, women in the wild are stinky, hairy, dirty, messy, and strong.\n\nIf you're sniffing the crotch of your trousers at the end of the day and personally find it repulsive to know you have a smell it might be worth your time to consider why. But, if you can \"smell yourself\" and worry others can too, and it's affecting your confidence I'd suggest cotton underwear, and vulva friendly wipes when you're on the toilet and maybe looser pants. Lots of douches and deodorants can actually worsen the problem by imbalancing the delicate biome of your vulva/vagina and aren't gynecologist approved.",
   "created_utc": 1692046828,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6zs77",
   "message": "Always keep the bush and under arms…not shaved but trimmed down once a month. For reference I use a 2 guard when I trim lol.",
   "created_utc": 1692046866,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7179d",
   "message": "clean shave",
   "created_utc": 1692047362,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw71l1f",
   "message": "Remove them",
   "created_utc": 1692047499,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw720w9",
   "message": "Shower, wash knob, balls and ass.. towel dry - properly dry, get good antiperspirant, put on underarms as usual, then spray around knob/balls, then down through legs, reach-around and spray ass crack.",
   "created_utc": 1692047659,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw723g0",
   "message": "Uh what? I think you need to shave that shit down. 🤢",
   "created_utc": 1692047685,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw73wll",
   "message": "Shave",
   "created_utc": 1692048337,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw73wmh",
   "message": "Shave...",
   "created_utc": 1692048337,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw77s7r",
   "message": "Pubes don't smell!!wtf,must be ur dick",
   "created_utc": 1692049762,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw786k2",
   "message": "Shave it off",
   "created_utc": 1692049906,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw78mqv",
   "message": "Shave?",
   "created_utc": 1692050071,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw78msi",
   "message": "Shave it all off",
   "created_utc": 1692050071,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7gk5t",
   "message": "Shave, wash, drink water and exercise. If that doesn't work, go to the doctor. I'm a 29 year old male who trims but doesn't shave, my pubes have never smelled before..",
   "created_utc": 1692053098,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7koeq",
   "message": "Shave",
   "created_utc": 1692054769,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7m0ov",
   "message": "Don't knock the scent - those pherenomes are pumping out the call sign",
   "created_utc": 1692055315,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7mbek",
   "message": "My American friend was in Iraq. He said they’d put hand sanitizer 70% alcohol on parts that smelled.",
   "created_utc": 1692055437,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7mkpc",
   "message": "Get that fool nair! That way if they fear the dick nick they just gotta go hang out in the shower and let that shit do its job.",
   "created_utc": 1692055543,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7r1tz",
   "message": "This crazy new invention called a razor",
   "created_utc": 1692057368,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7vet2",
   "message": "Try shaving them, then antibacterial soap",
   "created_utc": 1692059159,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7vijh",
   "message": "Bro just use Nair on it at this point",
   "created_utc": 1692059201,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6wles",
   "message": "It's 2023 man shave them off",
   "created_utc": 1692045761,
   "score": 0,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6x919",
   "message": "Shave it.  It's more hygienic.",
   "created_utc": 1692045989,
   "score": 0,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6y2s1",
   "message": "I keep mine shaven/trimmed. Same with armpit hair. Even as a man, I find it gross. I spend a lot of time at the gym so I like keeping a clean aesthetic free of odor.",
   "created_utc": 1692046277,
   "score": 0,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6zk89",
   "message": "This is normal.",
   "created_utc": 1692046790,
   "score": 0,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw762ux",
   "message": "Who the fuck still has pubes?",
   "created_utc": 1692049135,
   "score": 0,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw79rs3",
   "message": "Shave it off to start the bush again. If that’s no good, ask the doctor because after a proper good wash, it should not smell.",
   "created_utc": 1692050490,
   "score": 0,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6t0m7",
   "message": "Pubes?  This ain’t the 1980’s.",
   "created_utc": 1692044509,
   "score": 255,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6oe1l",
   "message": "this thing everyone talks about, smell sounds nice I wish I had it",
   "created_utc": 1692042851,
   "score": 0,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6tbc7",
   "message": "if i can smell my pubes i am giving myself a blow job",
   "created_utc": 1692044613,
   "score": 0,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7bl9x",
   "message": "Alcohol Wipes \n\nRub It\n\nRub It Hard",
   "created_utc": 1692051171,
   "score": 255,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7fs0l",
   "message": "Quick spritz of Aridxx deodorant on the boys, half second will do ya.",
   "created_utc": 1692052782,
   "score": 255,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7vtxh",
   "message": "Controlled burn",
   "created_utc": 1692059330,
   "score": 255,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6ismp",
   "message": "embrace the flavors and aromas of your body",
   "created_utc": 1692040869,
   "score": 249,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6q45q",
   "message": "Never had that issue. But I imagine good old fashion Ax body spray would work. I’m sure most of us still an old canister kicking around in a box somewhere from our high school days lol",
   "created_utc": 1692043470,
   "score": 251,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6ixvd",
   "message": "I’ve never had that problem. I go full commando, so I’m always getting maximum air flow",
   "created_utc": 1692040920,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6k9xi",
   "message": "Gold Bond.\n\nI sweat like hell down there to the point that I smell just hours after a shower. One application of Gold Bond covered a whole camping trip.",
   "created_utc": 1692041393,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6o1dv",
   "message": "Bath \u0026gt; shower",
   "created_utc": 1692042726,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6s5eg",
   "message": "I’m confused. Is this only an issue during sex? Is he not showering before sex? I mean it’s normal to have some odor down there after a long day working, but if she showering right before sex and he still smells, then something isn’t right. \n\nSounds like hygiene is an issue. Manscape it, I’d clean shave it if possible. Shower every day. Id invest in some deodorant for down there. Also, make sure he’s wiping really well. Personally, a bidet has worked wonders for me. I can’t recommend it highly enough. If that’s not an option, scented wipes after TP. \n\nIf all that doesn’t work, diet change and maybe talking to dr.",
   "created_utc": 1692044201,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6t5p8",
   "message": "Tonight on Reddit:\n\nMen: how would you feel if your girlfriend posted on Reddit that your pubes smell bad before telling you to shave?",
   "created_utc": 1692044558,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6uhrs",
   "message": "There’s no practical way for me to go ‘nose-to-bush’ so it can’t be a thing. I do wash thoroughly though. I bought a soap-on-a-rope recently as I felt most of the shower gel was going on the floor. I had to cut the rope off though as it was very course and was chafing my perineum.",
   "created_utc": 1692045029,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw6y1d1",
   "message": "Manscaping is important",
   "created_utc": 1692046264,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw70ig4",
   "message": "Trim it down quite a bit.\n\nUse powder.\n\nMake sure you dry everything off really well before putting on underwear. Any moisture is going to make the funk start.",
   "created_utc": 1692047119,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw72br6",
   "message": "Benzoyl Peroxide kills bacteria. I’ve used it on my armpits as needed. I follow it up with a regular soap. Also, the Panasonic ER-GK60-S is great for trimming in that area. Always use the guard.",
   "created_utc": 1692047767,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw72hbd",
   "message": "I’ve never had this issue and I frequently run multiple miles and do jiu jitsu.",
   "created_utc": 1692047823,
   "score": 1,
   "submission_id": "15r41lq"
  },
  {
   "comment_id": "jw7p15w",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15r41lq"
  }
 ]
}