{
 "submission_id": "15r7gq1",
 "title": "What’s the worst smell you’ve ever smelled?",
 "selftext": "",
 "created_utc": 1692048022,
 "permalink": "/r/AskReddit/comments/15r7gq1/whats_the_worst_smell_youve_ever_smelled/",
 "score": 113,
 "url": "https://www.reddit.com/r/AskReddit/comments/15r7gq1/whats_the_worst_smell_youve_ever_smelled/",
 "comments": [
  {
   "comment_id": "jw778an",
   "message": "My husband put a bag of potatoes in a rarely used, dark, lower cabinet and forgot about it.  For at least a year.   Because it was encased we didn’t smell it for a long time.  When we did, it was hard to pinpoint, and usually there was no food in that cabinet so we never suspected it.   \n\nFinally one night I was tired of this weird random smell and I sniffed until I figured it out.  I opened the cabinet and gagged.  The bag was mostly liquid, the potatoes had been in there so long.   It’s a good thing I’m not much of a puker or that would have done it.",
   "created_utc": 1692049558,
   "score": 34,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw73k0t",
   "message": "Rotting body",
   "created_utc": 1692048209,
   "score": 57,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7jy5u",
   "message": "Onetime I was working in the ER. We had a woman come in by ambulance.\n\nShe had had a yeast infection, that started around 5 or 6 years prior.\n\nShe was too embarrassed to see a doctor when it didn't go away.  \n\nThe last year she had gotten too embarrassed to let her husband help he bathe.\n\nThey called the ambulance when she became unresponsive.\n\nWhen she arrived he body was pretty much just infection from the armpits down.\n\nShe had gangrenous sores covering her legs.  Had 3 toes that had literally rotted off.  The parts of her that weren't black and rotted were bright pink and red, with white lines where layers of skin had pealed away over the infection.\n\nThat was the worst thing I ever smelled.  We withdrew care shortly after she arrived.  There was nothing to be done for her.",
   "created_utc": 1692054471,
   "score": 246,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw73ps2",
   "message": "A combination of pallets of expired meat, dairy, and produce mass tossed into a metal dumpster and left to rot in the US Deep South summer heat for three days.",
   "created_utc": 1692048267,
   "score": 157,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7dz14",
   "message": "Just last month I drove around for over a week in the sweltering heat as my car got smellier and smellier. I legit thought there was a dead animal somewhere in my car. No searching in the seats yielded any results and eventually during a trip to the laundromat, I lifted one of the baskets we placed in the trunk up and saw a plastic bag buried under various trunk mess. Low and behold in it was a packet of ground beef my brother intended to bring in with the groceries he’d bought for college almost two weeks ago! When I confronted him about it he said something like, “I KNEW there was a second one somewhere.”  My car continued to smell like a dead animal for the next week and a half.",
   "created_utc": 1692052082,
   "score": 146,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7461w",
   "message": "Burnt out rear differential fluid. One sniff and instant purge for me.",
   "created_utc": 1692048432,
   "score": 111,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7367n",
   "message": "OMG when my cat released his anal glands from fear at the vet. NO NO NO NO do not recommend",
   "created_utc": 1692048070,
   "score": 1,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw781mn",
   "message": "I was doing a summer job at a nursing home a long long time ago when there was a big blackout in North America. like 25 years ago.\n\nThey were not prepared and there was this really big bed ridden woman who needed oxygen to live... well the backup generator was going to go out and they had to move her to the ground floor where they got some temporary generators.\n\nWhen we rolled her to try to get her from the bed to a stretcher, i swear to god a part of her peeled off and was left on the sheets. i have no idea how badly the nurses neglected her, I mean she was a super bitch so I can guess why, but they shouldn't have it was their job.\n\nThe smell from that bed sore was something I can never forget. I immediately threw up.",
   "created_utc": 1692049856,
   "score": 158,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7wej9",
   "message": "I have gastroparesis. On two occasions I started belching this horrid, rotten egg, sulfur smell. That lasted around 16 hours while feeling absolutely horrible. Couldn’t even force myself to puke. One person smelled one of the belches and insisted someone shit their pants. \n\nBy the time I finally started throwing up, it was violent, and smelled so bad I started vomiting more from the odor. I would have rather been throwing up dog poop. It was straight death coming from my mouth, pure rot gut. It lasted over an hour pretty much non stop. \n\n911 had to be called, they gave me a barf bag and when I puked they had to chase me down because I was trying to run from the smell. \n\nThink I figured out it was movie theater popcorn with their “butter” since both times were around a week after seeing a movie. Haven’t ate popcorn since and have not had that reaction again.",
   "created_utc": 1692059561,
   "score": 99,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw73s4w",
   "message": "Broken colostomy bag.",
   "created_utc": 1692048291,
   "score": 86,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7dgh4",
   "message": "40 dead bodies in a house in the Iraqi desert heat.",
   "created_utc": 1692051882,
   "score": 62,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7kykv",
   "message": "I was in a cadaver dissection lab in college (the smell already takes some powering through at first). We had to crack the pelvis in front to examine the pelvic floor, genitals, and lower digestive tract (exactly what you think it is). The prof instructed us VERY SPECIFICALLY to tie off the intestine just above the rectum before we tried to separate the pelvic bones... one group did not. \n\nSplit the whole lower colon like a truly cursed sausage. Several people puked, more were gagging for the next 20 minutes.",
   "created_utc": 1692054883,
   "score": 45,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw754kv",
   "message": "Steve",
   "created_utc": 1692048787,
   "score": 36,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7d1ev",
   "message": "I stepped into the corpse of a well aged, and maggot covered, raccoon, that smell drew up a deep fear within me...something at my core lizard brain. \n\nI still feel revolted by it writing about it now. It literally changed my mind from wanting to be buried, to wanting to be cremated.",
   "created_utc": 1692051722,
   "score": 42,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7ds5t",
   "message": "My dogs anal glands being expelled",
   "created_utc": 1692052007,
   "score": 33,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7pddy",
   "message": "The smell coming off the body of someone who had committed suicide by drinking bleach. Truly horrible, I still struggle with the smell of bleach now, over 30 years later :(",
   "created_utc": 1692056683,
   "score": 41,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7pqn1",
   "message": "When I was in high school my mom had a bit of a drug problem and occasionally bills wouldn't get paid and utilities would get shut off, usually for a day or two, before she paid whatever the minimum was to get service reinstated. Eventually water company decides they need to be paid in full before they turn the water back on, leaving us without a way to flush the toilet for almost two weeks til the next paycheck comes in.\n\nWe had two bathrooms, and designated one for pee and one for poop. The poop toilet smelled the same on day ten as it did on day one. The pee toilet got worse exponentially.",
   "created_utc": 1692056834,
   "score": 42,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw77nww",
   "message": "Was in high school. Found some old plastic bottles thought they were full of stashed liquor. Opened one and the smell hit my nose, I wretched.\n\nTurns out there were multiple years old bottles of Dip spit, which had been fermenting away.",
   "created_utc": 1692049718,
   "score": 57,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw79pl4",
   "message": "A garbage can full of used tampons.  Wasn’t changed for about a month.  A rotting carcass smells better.",
   "created_utc": 1692050468,
   "score": 80,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7wson",
   "message": "Rotting dead fish\n\nYou breath through your mouth and you can taste the odor.\n\nLewiston Idaho is a close second. It has a paper mill and a fertilizer plant. It smells like rotten eggs and the water at the bottom of the trash bin.\n\nResidents are divided on whether or not it's that bad.\n\nIt is.",
   "created_utc": 1692059722,
   "score": 37,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7ghhq",
   "message": "A toilet backed up at the YMCA and no one noticed for days.\n\nIt was on a college campus and over the summer break, so I don't think there was even staff to take notice for days. By the time someone did, it had been days of 90+ heat and humidity.\n\nI can't describe the smell. It wasn't shit. It was Impossible Shit.",
   "created_utc": 1692053067,
   "score": 29,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw80f3h",
   "message": "Okay here’s the worst smell of them all\n\nI know a guy who used to work as an imagineer at a Disney park. The ride he was working on had a section where he and his coworkers wanted to smell really bad (think it was a swamp or something). This park had a lab where they keep hundreds of smells in little vials for use in attractions. He asks the guy working there for the worst smell they have. The lab guy is like “you don’t want to smell that,” but my friend insisted. The lab guy pulls out a vial labeled “rotting human flesh #5.” He pulls off the cap, and everyone who smelled it immediately vomited. No delay at all. Immediate vomit. They ended up using “wet dirt #2” for the ride instead.",
   "created_utc": 1692061220,
   "score": 38,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw772cc",
   "message": "Part of my job requires me to break into aircraft waste systems from time to time for routine maintenance.\n\nI can usually handle it with no issues.\n\nHowever, there's a few aircraft that come through that are primarily Amsterdam based.\n\nI don't know what the Dutch eat, but whatever it is, the smell absolutely knocks me whenever I have to do toilet maintenance on these jets.\nI have never smelt anything so foul that triggers such a reaction from me.",
   "created_utc": 1692049497,
   "score": 48,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7bpt1",
   "message": "So my restaurant has a grease trap, basically a thing that catches all the nasty shit out the sink before it hits the plumbing. I didn’t even know it was a thing until I ended up with poo water all over my floor one day because it hadnt been cleaned/serviced properly. Next thing I know two members of management are in the kitchen with this thing open and cleaning it out.    \nDear god that’s the grossest shit i remember smelling in recent memory.",
   "created_utc": 1692051220,
   "score": 53,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7f0hk",
   "message": "Potatoes rotten in the heat... Uri Orlov was right",
   "created_utc": 1692052482,
   "score": 18,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7829c",
   "message": "Fresh out-of-the-skunk skunk spray.\nTwo huge male skunks were fighting outside the window of my travel trailer. Not just 'wrasslin' but somebody's running away bloody fighting.\nThey sprayed each other at the same time. The smell was very much like a heavy plastic bag full of feces doused in diesel fuel then set on fire. At that same moment, it wafted into the trailer, burning eyes, noses and lungs; my poor panicked sub-brain was fairly certain we would never breathe again.\nI can only surmise the standard smell associated with skunks is an oxygenated version - foul, yes. But it's nothing compared to the initial blast.",
   "created_utc": 1692049862,
   "score": 18,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7zw87",
   "message": "A woman came into the Emergency Department after a botched hysterectomy at a different hospital. The surgeon had nicked her colon before closing. She came to us three days later and she was septic. We opened her up for a washout and to repair the damage. Her entire abdomen was full of pus, shit, and blood. We use large suction containers in the OR called Neptunes. I forget the capacity, but we filled three of them. The smell was so bad that you could smell it through the walls. Everyone had to leave the room at some point except the surgeon.",
   "created_utc": 1692061001,
   "score": 26,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw74abh",
   "message": "Chitlins",
   "created_utc": 1692048476,
   "score": 17,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7o0c9",
   "message": "Dead rotting body police found in a car this summer. Rotting for 3 days in hundred degree heat. Wasn't even gonna walk down that street but I saw the cops blocking off the street and homeowners standing outside. Just got curious and as I walked by they opened the door and I got a good glimpse of puffed up body followed by the WORST smell ever. I gagged so hard.",
   "created_utc": 1692056127,
   "score": 17,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7nifq",
   "message": "I spent two weeks in Iwo Jima buried under a pile of dead bodies. The smells I smelled there you could not even imagine. But I will always remember what I smelled in that church. It was a vengeful stink. It was a stink for the ages.",
   "created_utc": 1692055924,
   "score": 49,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw767n1",
   "message": "The inside of some people's cars.",
   "created_utc": 1692049184,
   "score": 12,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7k8m7",
   "message": "When I was a paramedic, I was called out for a \"man down.\" Yep, he was down. The coroner said he had been dead about a week. This, my friends, is an awful smell I'll never forget.",
   "created_utc": 1692054591,
   "score": 14,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7nvgk",
   "message": "Liquid pig shit being spred as fertilizer over tobacco fields in Lancaster County PA.",
   "created_utc": 1692056071,
   "score": 13,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw84zd9",
   "message": "There were a few\n\nDead mouse\n\nBurning plastic\n\nSadly though, probably the worst have been several people who had poor hygiene to the point where their smell stayed in the same spot long after they moved away :( someone like that was in the library yesterday and I felt nauseous long after they walked past. But I feel really bad for them cause there's usually a reason other than 'laziness'\n\nI also have a sensitive smell cause sensory issues and so many things are deeply unpleasant to smell lol",
   "created_utc": 1692063133,
   "score": 15,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw73dya",
   "message": "Oh, let me tell you about the time I accidentally opened a forgotten container of leftovers that had been hiding in the back of my fridge for months. The smell was so powerful that it started its own yoga class – downward dog, anyone? It was like my fridge had turned into a smelly meditation retreat overnight!",
   "created_utc": 1692048147,
   "score": 28,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw76ndt",
   "message": "Had a patient with a really bad UTI. Almost threw up multiple times during and after collecting her urine sample. I can vividly recall the smell, 5 years later on.",
   "created_utc": 1692049345,
   "score": 24,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw79tuz",
   "message": "I went down on someone who didn't tell me about her yeast infection, it was not pleasant",
   "created_utc": 1692050511,
   "score": 23,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7ukep",
   "message": "Had an alcoholic uncle that I hadn't seen for several years. Got a call that he died and was tasked with cleaning out his apartment. He was shut in for a year or two, was shitting and pissing in bags and boxes and bottles that were just left laying around everywhere. Not to mention he was deceased for awhile before he was found, after not paying rent. They opened the door, the smell hit, roaches fled, we all vomited, and hired a biohazard company to take care of it.",
   "created_utc": 1692058816,
   "score": 29,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7alom",
   "message": "I grew up on the edge of a desert city, behind my house was wide open desert. Some local rancher just dumped a few dead horses and a cow in a arroyo in the desert I used to play and explore in the desert with my friends and we came across these dead animals in the middle of 100+ F summer. What a horrible stench",
   "created_utc": 1692050801,
   "score": 10,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7jv9d",
   "message": "My neighbour emptying his septic tank into someone elses garden secretly in the middle of the night. No im not joking.\nI tried to cover my nose with my t-shirt and my hands, but even then, i almost puked like 5 times.",
   "created_utc": 1692054438,
   "score": 12,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7wid1",
   "message": "What ever the fuck my dad births in the bathroom",
   "created_utc": 1692059604,
   "score": 20,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7pdy9",
   "message": "Old farm house, no air conditioning, middle of summer, so you either had to leave the windows open or you would just die. Dad was mowing hay, right up the hill from the house, and he vaporized a whole family of skunks. You know that Phil Collins song that goes \"I can feel it in the air tonight...\", well, replace the word \"feel\"with the word \"taste\". It literally transcended smell. \n\nMom said fuck a whole bunch of this shit, and took my sister and I to grandma's place for a few days, and let dad deal with everything.",
   "created_utc": 1692056690,
   "score": 11,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7uyq7",
   "message": "Gangrene. No question.",
   "created_utc": 1692058974,
   "score": 9,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw78imb",
   "message": "A slaughterhouse",
   "created_utc": 1692050029,
   "score": 9,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7g2hj",
   "message": "Death.",
   "created_utc": 1692052900,
   "score": 7,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7mma9",
   "message": "My dad worked in sales and primarily sold to shit plants. \n\nHe took me with him to work one day. It was cool to see and learn the process of how the water gets filtrated and goes back into our ecosystem, but DAMN. I never smelled anything worse than this.",
   "created_utc": 1692055560,
   "score": 8,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7xdaw",
   "message": "2 smells;\n\n1--When I bought my house, I was digging up the garden, and my pick axe squelched into something wet and meaty. I felt it, saw it, and called the police before I moved it. I've never smelled anything as bad as that putrescent, decaying rack of ribs the spiteful son of the seller buried in the garden for us to think was a body then have to call the police (8 cars arrived).\n\n2--If you strike a skunk at speed in your car, the car is pretty much going to smell like skunk for about a month, no matter what you do. It is awful.",
   "created_utc": 1692059955,
   "score": 10,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8jhh0",
   "message": "College roommate didn’t tell us he had Crohn’s disease and we went out drinking all night.  Dude had like 12 shots of Morgan and after we got back to the apartment he collapsed in the hallway and shit EVERYWHERE.  There are no words that could describe the smell, but that’s how it came to be.",
   "created_utc": 1692069592,
   "score": 11,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7ysfg",
   "message": "GI bleed. Found my aunt bleeding out on the toilet, I’ve never seen so much blood in my life. Clots the size of baseballs. Thankfully 911 had an ambulance there in 5 minutes.  She pulled through after multiple blood and plasma transfusions and 2 weeks in the hospital, but it was a very close call. \n\nThat was two years ago and you can still smell it in the back bedroom. The carpet has been shampooed multiple times, but she really just needs to get it replaced. I’ve been saving and am planning on doing that for her for Christmas this year. She’s one of my most beloved humans and I am so grateful she is still with us.",
   "created_utc": 1692060539,
   "score": 15,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw749sp",
   "message": "Rancid spoiled chicken liver.",
   "created_utc": 1692048471,
   "score": 5,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7jdj2",
   "message": "Large pile of cut grass in the summer heat for a few months",
   "created_utc": 1692054238,
   "score": 3,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7tc6v",
   "message": "I have a bloodhound nose and some smells make me overstim easily, so this would be a long list. What takes the cake is the dead sea lion I found on the beach, back in my home country. It was dead for at least a month, but since it was winter no one moved it or anything.",
   "created_utc": 1692058314,
   "score": 6,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw84hwv",
   "message": "Decomp. Great walking into the morgue in the morning, taking a sip of your coffee, and finding out they pulled a floater out of the river.",
   "created_utc": 1692062930,
   "score": 5,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8hv0k",
   "message": "I was a caretaker for the elderly in a super expensive care facility. We had a new lady come in one of the days I was off. I showed up for work two days later (night shift) and she had been unbathed and unchanged for two fucking days and smelled of rancid urine. I will never forget the smell nor the anger I felt that she had been left in such a state. Quickly got her showered and a change of clothing as well as immediately filed a complaint with the nurse. I'm still angry about it almost 15 years later and the smell of urine still makes my stomach churn.",
   "created_utc": 1692068811,
   "score": 8,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8m9sn",
   "message": "A decomposing body.  A bad GI bleed is 2nd.\n\nEdit to add 30+ years as a paramedic.  Not stashing bodies.",
   "created_utc": 1692070967,
   "score": 6,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw73bzo",
   "message": "My friend always does the most vile smelling shits",
   "created_utc": 1692048127,
   "score": 13,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7m81y",
   "message": "Where's that swamps of dagobah comment?",
   "created_utc": 1692055398,
   "score": 13,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7dkyi",
   "message": "Surströmming",
   "created_utc": 1692051930,
   "score": 10,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7eqy3",
   "message": "Sheep intestines",
   "created_utc": 1692052380,
   "score": 4,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7owtt",
   "message": "A family that burned to death in a drunk driving accident.",
   "created_utc": 1692056496,
   "score": 5,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7xhhm",
   "message": "Fake vanilla. I think it’s because my elementary school was fully carpeted and when a kid would vomit, they would sprinkle some cat litter stuff scented with artificial vanilla to soak up the fluids. So fake vanilla = vomit for me.",
   "created_utc": 1692060001,
   "score": 5,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw84ijw",
   "message": "Durian",
   "created_utc": 1692062937,
   "score": 7,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8gw7c",
   "message": "I had been cleaning out my parents garage a few years ago and found a few old cat litter cases buried in the back corner. One of them seemed to be filled with a fluid of some reason, so I dragged it outside and opened the lid. I looked inside at the strange, pinkish, sludgey liquid for a moment before the smell wafted up and hit me. It was a horrible, moldy, sickly sweet smell, like rubbing alcohol mixed with expired fruit juice mixed with rotting potatoes. I ran into the front yard to get away from the smell but it was stuck in my nostrils. After a while, it dissipated, so I pulled my shirt over my nose and carefully creeped into the backyard again. The bin was right next to a large patch of grassless soil, so I resolved to just tip it over and vacate the area while it drained. The patch of soil still reeked of it for a bit after, but eventually faded. From the now empty bin, I found an old bag of grass seed. My best guess is the liquid was water that somehow leaked into the bin full of grass seed and began to ferment, and maybe a rat or something got trapped inside and basically liquified in the stuff. (though I'm not 100% sure and /probably/ shouldn't have dumped the weird liquid into my lawn lmao) Whatever it was, I genuinely hope to never smell it again",
   "created_utc": 1692068355,
   "score": 5,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw81kgm",
   "message": "The multi vitamin I take daily, it's disgusting and you can smell it theough the bottle.\n\nOn the upside, I casually told my sister to \"smell this\" while she wasn't paying much attention, and she took a big ol' whiff. I had a good belly roll laugh.",
   "created_utc": 1692061699,
   "score": 10,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7wbpr",
   "message": "My dog fear farted at me when I was carrying my suitcase when I came home after dark and my hands were too full to turn on a light. It permeated the suitcase so fully I had to toss it out.",
   "created_utc": 1692059529,
   "score": 8,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7x3z8",
   "message": "Do you smell it? That smell. A kind of smelly smell. The smelly smell that smells... smelly.",
   "created_utc": 1692059849,
   "score": 9,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7unub",
   "message": "Celiac farts",
   "created_utc": 1692058853,
   "score": 6,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7y7o9",
   "message": "When I was young, I was something of an experimental scientist. I don’t recall having a particular goal in mind but I wouldn’t recommend piercing an orange with a fork and then putting it in the microwave.",
   "created_utc": 1692060303,
   "score": 3,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7zthm",
   "message": "My parents once opened a can of surströmming and we all had to leave the house until it was disposed of. I wore a nose clamp for 6 or 7 hours afterwards to avoid the smell of rotten feces.",
   "created_utc": 1692060969,
   "score": 3,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8138d",
   "message": "My husband had a baseball sized boil on his back. The leakage from it was rancid. I almost vomited on him while changing the dressing on it a few times.",
   "created_utc": 1692061504,
   "score": 5,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8k5pl",
   "message": "Papermill factory in Wisconsin. It's sickly sweet like rotting and decay that was then attempted to be covered with another sweet scent like vanilla or brown sugar. It's cloying and like sticks to you just awful. I'm gagging thinking about it.",
   "created_utc": 1692069916,
   "score": 4,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw77jqq",
   "message": "Nasty cooch.",
   "created_utc": 1692049675,
   "score": 6,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7grzh",
   "message": "The rotting meat in the dumpster behind the supermarket I used to work at",
   "created_utc": 1692053184,
   "score": 3,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7gwbj",
   "message": "Fryer trap. Immediately followed by patchouli.",
   "created_utc": 1692053233,
   "score": 2,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7prdb",
   "message": "Skunk blew it out under our house and I dreamed of the smell before waking. Had terrible nausea for three days till it subsided. Horrible, horrible smell.  Previously not so bothered by skunks. Whole family was sick",
   "created_utc": 1692056842,
   "score": 3,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw7qzq0",
   "message": "The fat truck. If you worked in a supermarket, you know. Has to be what a dead body smells like.",
   "created_utc": 1692057345,
   "score": 2,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw82mlb",
   "message": "Back in first grade, someone's mother walked into the classroom, and it STUNK real bad immediately. Like, I couldn't imagine how a *living person* could possibly smell that bad unless pieces of their flesh were literally rotting away. What's strange was that her son didn't smell at all, and I don't know what was wrong with his mother.\n\nIt's been decades since then, and I've never encountered B.O. that baffled me to that extent. Maybe it wasn't necessarily the *worst smell* but it left the biggest impact on me.",
   "created_utc": 1692062143,
   "score": 2,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw839dm",
   "message": "My first poo after getting my gallbladder removed.",
   "created_utc": 1692062407,
   "score": 2,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8924k",
   "message": "My husband’s farts. Oh, and umbilical cord stump..  aka rotting flesh.",
   "created_utc": 1692064874,
   "score": 5,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8djl9",
   "message": "Rotting death",
   "created_utc": 1692066835,
   "score": 2,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8ixhu",
   "message": "Grease trap. Satan's anus is perfume compared to that.",
   "created_utc": 1692069324,
   "score": 2,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8ny9e",
   "message": "My sweaty shoes after my 10 hour shift at a warehouse",
   "created_utc": 1692071832,
   "score": 2,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8on97",
   "message": "Visiting my wife's grandmother in a care home. She shared a room and the other old lady needed to take a dump. Nurse just wheeled in a commode and pulled the curtain round her bed. The smell was horrific but we just had to sit there out of respect for granny, all I wanted to do was run out of the room and vomit 🤢",
   "created_utc": 1692072199,
   "score": 5,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8p5bd",
   "message": "I used to work as a house keeper at a nursing home and it was my responsibility to take at the big trash can full of soiled diapers. It always smelled gross, but it was even worse when they had anything spicy.",
   "created_utc": 1692072463,
   "score": 3,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8p9bz",
   "message": "Pure butyric acid",
   "created_utc": 1692072523,
   "score": 2,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8pjce",
   "message": "My mother on a camping trip",
   "created_utc": 1692072672,
   "score": 2,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8q8kx",
   "message": "My house after having covid. Like mix of rotting garbage and paint thinner. Went back to normal eventually, but holy crap it was wierd.",
   "created_utc": 1692073053,
   "score": 2,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8r85r",
   "message": "Lactose intolerant farts after dairy.",
   "created_utc": 1692073594,
   "score": 4,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8sbt9",
   "message": "According to my girlfriend, my breath this morning.",
   "created_utc": 1692074215,
   "score": 3,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8u9n8",
   "message": "Durian.",
   "created_utc": 1692075357,
   "score": 2,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw875jh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15r7gq1"
  },
  {
   "comment_id": "jw8hjzj",
   "message": "A smell...... A smelly smell... The type of smell that smells.......\n...\n...\n\nSmelly.",
   "created_utc": 1692068668,
   "score": 4,
   "submission_id": "15r7gq1"
  }
 ]
}