{
 "submission_id": "15rc6y6",
 "title": "People who prefer winter over summer, what are your reasons?",
 "selftext": "",
 "created_utc": 1692058866,
 "permalink": "/r/AskReddit/comments/15rc6y6/people_who_prefer_winter_over_summer_what_are/",
 "score": 117,
 "url": "https://www.reddit.com/r/AskReddit/comments/15rc6y6/people_who_prefer_winter_over_summer_what_are/",
 "comments": [
  {
   "comment_id": "jw7utj5",
   "message": "The cold weather is much more comfortable and no bugs.",
   "created_utc": 1692058916,
   "score": 144,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw80qjx",
   "message": "1) I like being cozy. \n\n2) You can always put on another layer.  Only so much you can take off.\n\n3) I hate the feeling of sweat.\n\n4) No bugs\n\n5) I love the smell of winter air.  Especially when it is about to snow.  It's hard to describe it.\n\n6) It is peaceful.  No loudness outside like fireworks or leaf blowers.",
   "created_utc": 1692061356,
   "score": 96,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7uze5",
   "message": "When it's hot I can only remove so much clothes before I'm arrested. In winter I can add all the layers I want until I am satisfied.",
   "created_utc": 1692058982,
   "score": 141,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7uuce",
   "message": "It's not hot af outside",
   "created_utc": 1692058926,
   "score": 56,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7uw4w",
   "message": "No yard work, no bugs",
   "created_utc": 1692058946,
   "score": 25,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7ztl0",
   "message": "I live in the South. I opened the door to walk my dog this morning, and the heat slapped me in the face and called me a little bitch boy.",
   "created_utc": 1692060970,
   "score": 24,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7z71b",
   "message": "1. Soup\n2. Football\n3. Holidays\n4. I don't sweat balls everywhere.",
   "created_utc": 1692060708,
   "score": 17,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7vi3l",
   "message": "A space heater or electric blanket doesn't sound like a diesel engine in my room but my AC does",
   "created_utc": 1692059196,
   "score": 18,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7w1ic",
   "message": "Cold weather brings good mood good food good weather.",
   "created_utc": 1692059414,
   "score": 14,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7w2sv",
   "message": "It's colder, quiet, and darker days which are more relaxing to me. Perfect for hot tea and writing sci-fi stories. \n\nAll my bad times seem to happen in the spring/summer anyway so I feel better in the winter when mostly nothing happens. Mostly.",
   "created_utc": 1692059429,
   "score": 12,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7xj7f",
   "message": "It’s not summer. Summer sucks.",
   "created_utc": 1692060021,
   "score": 11,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7xp3l",
   "message": "I'm more comfortable. I get to wear clothes I like. No bug bites or stings. No sunburns. No sweaty sticky body. No allergies. \n\nI like cold weather. A hot cup of tea by the fireplace on a cold day is heavenly. Summer is far and away the worst season.",
   "created_utc": 1692060089,
   "score": 23,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7yphx",
   "message": "Longer nights. Cooler weather. Living in the southern U.S. it gets very toasty up until October. Christmas lights. Comfort food. Taking a run and not feeling like a soaked dish rag afterward. Using my telescope without as much haze.\n\nI find the dark comforting.",
   "created_utc": 1692060507,
   "score": 7,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7zfm6",
   "message": "1 I'd rather be cold because I can wear jackets. If it's burning hell I can't take off my clothes to feel cooler.\n\n2 Christmas and Thanksgiving vibes\u0026gt;\u0026gt;\u0026gt;\u0026gt;\n\n3 AC cost more money. my electric bill is less in winter \n\n4 no mosquitoes",
   "created_utc": 1692060806,
   "score": 8,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7v10d",
   "message": "I like to be covered up extra, I like the fact that people have more of a \"home\" feeling in their heads, and I like breathing the cold air. \n\nI wouldn't say I *prefer* winter, there are aspects of all seasons that I like, but these are the parts of winter that I like which summer just doesn't have.",
   "created_utc": 1692059000,
   "score": 6,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7v6lg",
   "message": "I live in California, so Winter here is basically comfortable and temperate. We love our winters.  \n  \nI could understand how someone from Buffalo, NY would hate winters though.",
   "created_utc": 1692059064,
   "score": 7,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7wxdp",
   "message": "No mosquitos.",
   "created_utc": 1692059775,
   "score": 6,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7xy3w",
   "message": "Cold is peace, quiet, no bugs, no nonsense. It sharpens the senses. Cold is also a terrific way to halt anxiety, something that I learned only recently. I suppose that impacts my decision as well.",
   "created_utc": 1692060193,
   "score": 6,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw81kjb",
   "message": "I'm in Houston and we've had about a month, if not more I've lost count, of 100+ degree weather every day with still no end in sight. Going outside in any capacity is not pleasant because within 5 minutes you're drenched in sweat. Being stuck inside gets you cabin fever, my electricity bills are insane, this insane heat has me worried about the future because 30 years ago when I was a kid it was never this hot. What's it going to be like 30 years from now? Meanwhile politicians that supposedly represent me still claim that everything is just fine. At least this is understandable because they're in big oil's pockets. What gets me more is many everyday people around me who have nothing to gain, but everything to lose still feel like being in the climate denial tribe is in their best interest.\n\nBut no no. I should stop complaining because \"yOu DoN't KnOw WhAt iT's LiKe To HaVe tO sHoVeL tHe WaLk.\"",
   "created_utc": 1692061700,
   "score": 6,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7wf28",
   "message": "Snowboarding",
   "created_utc": 1692059566,
   "score": 4,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw827v2",
   "message": "As someone who works outside, winter is so much better. No bugs, you can take off an put on layers as needed, I’m not dripping sweat all day, it’s not hot as fuck.",
   "created_utc": 1692061971,
   "score": 4,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw82dlg",
   "message": "I absolutely love when it gets dark early. I don’t feel like I need to go, go, go all the time, and I don’t feel lazy if I’m not working outside til it gets dark, because that’s 5pm. It’s cozy in my warm house and perfect for baking.  I also love the cold weather. Bundle up and you’ll be fine. Summer is humid and miserable and not matter how little you wear, the heat is unbearable. Update- forgot some words.",
   "created_utc": 1692062037,
   "score": 5,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw82hsm",
   "message": "Ask the giant fireball in the sky why I have so much sweat in my underwear.",
   "created_utc": 1692062087,
   "score": 4,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw82ybl",
   "message": "I live in AZ.",
   "created_utc": 1692062278,
   "score": 4,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8fcvg",
   "message": "I just physically handle cold better — I seem to not tolerate anything over 80F well. (I mostly just feel sick.) Plus, I’m originally from New England, so it’s just normal for me to have it cooler most of the year. (Autumn FTW!) But, yeah, winter over summer any day for the temperature alone; I like being cozy and wearing layers.",
   "created_utc": 1692067655,
   "score": 4,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7x1id",
   "message": "I prefer the cold over the heat and humidity and it gets dark earlier, among other reasons.",
   "created_utc": 1692059821,
   "score": 3,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7ynrx",
   "message": "No bugs to deal with, putting on more layers to stay warm to me is more manageable than making sure I have AC, sunscreen, water, etc.",
   "created_utc": 1692060487,
   "score": 3,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7z51n",
   "message": "It's over 100 on a regular basis in the summer whereas winters are very mild here. I prefer spring over both but I'll take what I can get.",
   "created_utc": 1692060685,
   "score": 3,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw80eox",
   "message": "I love how quiet it is. I am so tired of noise pollution.",
   "created_utc": 1692061215,
   "score": 3,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw80kzz",
   "message": "I like skiing",
   "created_utc": 1692061290,
   "score": 3,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw80vkc",
   "message": "In summer I've got a constant layer of sweat, in winter I wear a coat and feel comfortable. In summer there's swarms of insects, in winter they fuck off back to hell.",
   "created_utc": 1692061415,
   "score": 3,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw818dk",
   "message": "My favorite types of clothing are sweaters.",
   "created_utc": 1692061563,
   "score": 3,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw81o0h",
   "message": "idk about you but in summer the air feels sticky and gross not to mention the flies",
   "created_utc": 1692061740,
   "score": 3,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7x6zi",
   "message": "Busty friends of mine all prefer cold weather because they can coverup.",
   "created_utc": 1692059883,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7zuar",
   "message": "You can cover up and add more blankets to warm yourself up when it's cold, but you can't take anymore clothes off after you're naked in the heat and it's still too hot.",
   "created_utc": 1692060978,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw80v6j",
   "message": "I hate heat, being in the cold is so much better",
   "created_utc": 1692061410,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw82m6f",
   "message": "I love snow and honestly I feel like 35 degrees is my fav outdoors temp. I find it comfortable. I love winter clothing. I love snow covered mountains. I love how happy our male dog is when he’s running in the snow. I love sipping hot chocolate inside while it’s snowing. So many reasons.",
   "created_utc": 1692062137,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw82pp9",
   "message": "No wasps, no sunburn, no sweat",
   "created_utc": 1692062178,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw83nyp",
   "message": "I've lived most of my life in South Florida. \nSummer here =Heat and humidity so high that when you go outside if feels like your face has just been grabbed by the hand of a sweaty giant. Electric Bills through the roof, but it's nearly impossible to live without air conditioner, at least not comfortably, so you deal with the cost, because 5 minutes after you turn off your a/c you start to melt. Which reminds me...hurricanes, after which the power can be out for days or even weeks at a time..no lights, no internet, and NO AC I never thought I'd wind up sleeping in my car, but I did, because it was impossible to sleep in the house. We dont always have hurricanes every summer, but we do always have rainstorms, heavy, blinding, nearly impossible to drive in-torrential rain and thunderstorms, 5 or 6 days a week, nearly every week from June July through September or October.\n\nWinters Here=lower temps, low humidity, lower power bills. You can turn off the AC and sleep with just a fan. Days in the 70s or 80s and nights in the 60s.\nNo rain for days for weeks at a time. Cloudless or nearly cloudless skies the most incredibly brilliant shade of blue.\nThe occasional cold snap when the temps get down into the 50s or even 40s for a few nights in and it almost feels like actual winter time for a little bit and we get to dig out our jackets and sweaters and even turn on our space heater and feel all cozy for a short while , then by the time we're sick of the cold, the spell has past and temps are back up the 70s again.",
   "created_utc": 1692062575,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw83onb",
   "message": "I live in Florida.",
   "created_utc": 1692062583,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw83qyc",
   "message": "I like snow, don't mind rain and I hate hot weather. It also suits me more because of my chronically formal and overdressed style of clothing.",
   "created_utc": 1692062610,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw83rmw",
   "message": "Heat brings back some very bad memories, plus I take meds that make me more sensitive to heat. I much prefer to be cool than hot. Also, wasps, ants, spiders and snakes go back to hell where they belong.",
   "created_utc": 1692062619,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw83yb9",
   "message": "Snowboarding, clothing style options, hot cocoa, walking in the cold bundled up with your love, staying inside watching the snow fall down through a foggy window, seeing white tipped mountains while driving a long road trip, no bugs, ice skating, snow angels, snowball fights, thanksgiving and christmas, seeing family for the holidays.",
   "created_utc": 1692062697,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw842cs",
   "message": "I can always put another kayer on to keep warm, I can not take my skin off when it is hot \n\nI'm autistic and heat causes the worst sensory overload for me.. I get depressed during the summer because I can't be more active due to the heat and my temperature dysregulation",
   "created_utc": 1692062744,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw84p7w",
   "message": "Summer because I have raynauds disease.",
   "created_utc": 1692063016,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw85ozu",
   "message": "I'm not sweating, I don't have to worry about bugs, I'm not in sensory overload all of the time, I feel more at ease, I'm not depressed, it's pretty, it's quieter, I can sit outside for hours and just read and not have to worry about anything flying at me at lightspeeds.",
   "created_utc": 1692063436,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw85xce",
   "message": "Because it's Texas.",
   "created_utc": 1692063537,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw86enx",
   "message": "The pillow is actually cold🤤",
   "created_utc": 1692063741,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw87f3x",
   "message": "I think and have found that really hairy dudes prefer the winter.",
   "created_utc": 1692064174,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw87wix",
   "message": "Parasites and tourists",
   "created_utc": 1692064379,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw88vb0",
   "message": "SSSSSNNNNOOOOOOOOOWWWWWBBBBOOOOOAAAAAARRRRRRRDDDDDIIIIIIINNNNNGGG\n\nWOOOOOOOOOOOOOOOOOOOOOOOOOOO",
   "created_utc": 1692064791,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw88z08",
   "message": "You can always put on more clothes, but you can only take off so many.",
   "created_utc": 1692064836,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw89hoj",
   "message": "Have you endured Las Vegas in the summer? Vegas is great for 9 months of the year. The worst ones are the summer months.",
   "created_utc": 1692065061,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8br59",
   "message": "My country catches fire in summer.\n\nAir con is expensive to run, and putting on more clothes is cheap.",
   "created_utc": 1692066052,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8de9w",
   "message": "Until you’ve gone for a walk on a clear, windless winter night, only the sound of snow and ice crunching under foot and a flask of bourbon in your parka, you wouldn’t understand.",
   "created_utc": 1692066768,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8dk6q",
   "message": "Love the cold weather, much easier to stay warm than to cool off. Lose more weight shivering than sweating. \nLove the food and holidays associated with winter. Not into snow too much but mild winters from Va south to Ga is nice. Love the Appalachians (Pigeon Forge, Asheville/Boone, Elijah/Brasstown Bald/Dahlonega)",
   "created_utc": 1692066842,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8eezm",
   "message": "I hate the heat, I don't like most typical summer sports and activities, I hate bugs, and too much sunshine makes me depressed. The colder it gets the more I feel alive and active. I love the coolness of an autumn afternoon, and I love the sunlight shining on pure drifts of snow.",
   "created_utc": 1692067226,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8egsz",
   "message": "I'm Autistic and have sensory issues and have a hard time functioning if the temperature isn't just right. Also, you can only take off so many layers, but you can always add another layer somewhere lol",
   "created_utc": 1692067249,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8fvch",
   "message": "“Prefer” may be extreme, but I like winter because:\n\n1) it’s way easier to dress to get warm, than dress to cool off\n\n2) no bugs\n\n3) bright, dazzling blue skies and crisp white blankets of snow\n\n4) outdoor stuff (sledding, skidoo, skating, etc)\n\nI prefer summer…but winter has its up-sides!",
   "created_utc": 1692067885,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8hkdv",
   "message": "Longer nights, shorter days, cold weather, Fall/Winter have all the best holidays.\n\nSummer is just too damn hot and too bright.",
   "created_utc": 1692068673,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8jfc1",
   "message": "Drifting my truck through fields with my buddy tide behind on a tube.  Being in the middle of nowhere in Michigan can get boring so you have to come up with something.",
   "created_utc": 1692069564,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8pbiq",
   "message": "You can always put on a sweater…you can’t peel off your skin",
   "created_utc": 1692072556,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8pz61",
   "message": "The coldness. It makes me sleep easier.",
   "created_utc": 1692072911,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7w04d",
   "message": "I much prefer to be cold over hot plus I think winter clothes are cuter",
   "created_utc": 1692059398,
   "score": 2,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7vrqi",
   "message": "Honestly, the older I get, I find myself hating both. I miss the winter in the summer and I miss the summer in the winter.\n\nThe struggle is real",
   "created_utc": 1692059305,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw85fij",
   "message": "Sex",
   "created_utc": 1692063324,
   "score": 0,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7vsho",
   "message": "Cold",
   "created_utc": 1692059313,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7w3lz",
   "message": "Well I love my country and here winter lasts 7 months of the year or more so just seven months over two years",
   "created_utc": 1692059438,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw7zznr",
   "message": "I'm susceptible to rashes, especially if I'm hot and I sweat a lot. I'll do it but hate taking care of them, it takes up a lot of my time and money to fix each problem.",
   "created_utc": 1692061040,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw80n0r",
   "message": "Florida.",
   "created_utc": 1692061314,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw80xes",
   "message": "NO BUGS and Christmas",
   "created_utc": 1692061437,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw82859",
   "message": "Less sweat, nicer clothing.",
   "created_utc": 1692061974,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw829nx",
   "message": "Better to be cold than too hot.",
   "created_utc": 1692061992,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw839a1",
   "message": "It’s not 100 something degrees out or humid, plus the temperature matches my heart",
   "created_utc": 1692062406,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw83kyh",
   "message": "It's hot as balls outside for 100 days where I live. The humidity is like breathing hot soup through a sweater.",
   "created_utc": 1692062540,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw83njm",
   "message": "It’s not hot",
   "created_utc": 1692062570,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw83nm7",
   "message": "Where I live it's very humid in the summer so you can't do anything without putting sweat and getting gross. Putting on makeup or work clothes is the worst.",
   "created_utc": 1692062571,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw83ym0",
   "message": "Winter is cozy; summer is sweaty. \nClouds are better than no clouds.\nSnow is fun \u0026amp; pretty. \nAll the holidays. \nHot toddies, apple cider, cappuccinos!\nSweaters!\nSnuggles with a loved one. \nHot baths.\nEtc.",
   "created_utc": 1692062700,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw84kja",
   "message": "I live in Texas, our summers are too much",
   "created_utc": 1692062960,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw84lor",
   "message": "I live in Arizona",
   "created_utc": 1692062974,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw84naq",
   "message": "The heat is just unbearable",
   "created_utc": 1692062994,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw84zos",
   "message": "You can keep putting clothes on if it's cold, but doing the reverse when it's hot can get one arrested.",
   "created_utc": 1692063137,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8583o",
   "message": "I live in the south. Georgia to be exact. It gets hotter than an 100k, slow burn, hurt/comfort smut fic",
   "created_utc": 1692063238,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw85jbs",
   "message": "so many reasons but christmas is the best",
   "created_utc": 1692063368,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw862mm",
   "message": "I hate insects and heat",
   "created_utc": 1692063597,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw86qe5",
   "message": "Texas",
   "created_utc": 1692063881,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8712l",
   "message": "1. I can wear my favorite coat in which I look like a damn cool wizard, without dying cuz it‘s warm.\n2. Cold air is sooo nice to breath in.\n3. I do not sweat all the time.\n4. the process of getting home and warming up is sooo satisfying.\n5. I can sleep so much better cuz I love my blanket but in summer it is just disgusting under it.\n6. It‘s getting dark sooner, which is good cuz I rlly do not like the sun on my skin for a longer period of time.\n7. I can scare ppl by looking like a wizard who walks thru the city at night asking ppl to pick a card \u0026gt;:)",
   "created_utc": 1692064008,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw878ke",
   "message": "I welcome winter just as much as I welcome Summer.\n\n1. No more yard work.  \n2. No more bug bites.  \n3. I can finally get started on those indoor projects.  \n4. I think I might be a vampire, it's dark all the time.\n5. Big chunky oversized sweaters, I freaking love them. You have no idea.  \n6. Snow blowing the driveway is therapeutic.\n7. I love being outside late at night in the middle of winter. It's so cold and crisp and quiet. It feels magical.  \n8. Chili season and any type of winter cooking.  \n9. I love climbing into a cold bed. I like to keep the house in the mid '50s at night and form a cocoon with the blankets.  \n10. A nice long winter makes me appreciate taking my motorcycle out in the spring more.",
   "created_utc": 1692064097,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw87f12",
   "message": "I feel like I get a better nights sleep when the weather is colder",
   "created_utc": 1692064173,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw87g8x",
   "message": "As others have said, no bugs, you can always add a layer, less humidity, BUT: nothing is more beautiful than a crystal clear moonlit Winter night. Nothing. Something happens in Winter that makes the nights deeper, more vast. If you’ve never experienced it, you need to. Ethereal.",
   "created_utc": 1692064187,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw87htj",
   "message": "Can it be my turn to ask this next?",
   "created_utc": 1692064206,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw87r3w",
   "message": "Summer here: 112F\n\nWinter here: 52F\n\nIt depends where you live",
   "created_utc": 1692064315,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw87rip",
   "message": "Bugs. I live in a rural area. I can't wait for those little fuckers to die off in the fall.",
   "created_utc": 1692064320,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw886kn",
   "message": "I could bundle up to get warm. \n\nSummer sucks because you can only take off so much, and when you do, it still sucks.",
   "created_utc": 1692064498,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw88c95",
   "message": "Snowboarding",
   "created_utc": 1692064566,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw88ipu",
   "message": "I like the look a lot better. And as others have said. You can always out more clothes on in the winter. You can only take so much off during the summer",
   "created_utc": 1692064641,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw88nrm",
   "message": "Too many mosquitoes, it’s too hot so that rules out hand-holding, you can’t drink or eat hot things, no extra blankets on the bed, no snow",
   "created_utc": 1692064701,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw894zd",
   "message": "Probably just the overall winter vibe for me, not to mention the satisfaction of walking on snow",
   "created_utc": 1692064908,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw89can",
   "message": "Try to live near the equator line. You will understand.",
   "created_utc": 1692064996,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw89ml6",
   "message": "Arizona.",
   "created_utc": 1692065118,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw89wvb",
   "message": "mosquitoes",
   "created_utc": 1692065241,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8a34o",
   "message": "I used to be summer \u0026gt; winter but over the past few years I’ve for sure become winter \u0026gt; summer. Where I live, most older houses (like mine) do not have central air, despite 90°-100° summer days. I do not sleep well when I’m hot. I do not function well when I don’t sleep well. I have to wait till sunset to walk my dogs because it’s too hot for them during the day, and I go to work (outside) at 6am so I can’t really walk them in the morning when it’s still nice. Also I’ve taken up running and running in the summer makes me question all of my life choices. Basically the heat makes me a cranky, sweaty, zombie bish 😬",
   "created_utc": 1692065318,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8a7qb",
   "message": "Mainly trauma related. But it’s also prettier to me, and there’s nothing better than the smell(actually lack of all smells lol) of winter!",
   "created_utc": 1692065373,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8ano6",
   "message": "I live in New Orleans",
   "created_utc": 1692065570,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8ap1f",
   "message": "Skiing",
   "created_utc": 1692065586,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8awhm",
   "message": "I live in Phoenix",
   "created_utc": 1692065679,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8b25u",
   "message": "I live in Florida. The feels like was 120°. I can’t think wait for winter so I can go outside again.",
   "created_utc": 1692065747,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8c3mg",
   "message": "It’s quiet, no bugs, and I’ll take a winter storm (as long as I’m not driving) over a summer storm any day",
   "created_utc": 1692066202,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8cked",
   "message": "1. I live in Arkansas.",
   "created_utc": 1692066399,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8cqlv",
   "message": "I like to bundle up at night and wear my nice longcoat outside without bursting into flames.",
   "created_utc": 1692066475,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8cud1",
   "message": "I have heat but not ac",
   "created_utc": 1692066522,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8e10h",
   "message": "Winter where I live means highs in the 50s on actual cold days, but it’s not unusual to see highs in the 70s. \n\nSummer is hotter than hades. We’ve had three weeks of temps \u0026gt;100F.",
   "created_utc": 1692067051,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8e1gs",
   "message": "Every summer I head to the basement because it's so much cooler down there. Like a 10 degree difference from upstairs. I love the coolness. I mean I like summer when there's a nice breeze and such but winter is getting under some comfy covers, watching a movie and seeing the fireplace give some warmth.",
   "created_utc": 1692067057,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8ej5g",
   "message": "I live in SoCal, so winter isn't that cold.  I just need a sweater.  Summer can be unbearably hot, though.",
   "created_utc": 1692067279,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8es0k",
   "message": "It's a damn lot easier to get warm when you are cold than cold when you are warm",
   "created_utc": 1692067390,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8etjj",
   "message": "Comfort, pretty, football, best holidays",
   "created_utc": 1692067409,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8f7eh",
   "message": "I like to get cozy, enjoy warming up more than cooling off. I really dislike sweating and sometimes having to shower twice a day because of it. I worked outdoors most of my life so super hot days were killer. No bugs is also a bonus.\n\n\nDon't get me wrong, I enjoy comfortable summer nights and all, but give me Autumn or winter any day over it.",
   "created_utc": 1692067585,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8fjfj",
   "message": "I can always add layers but I can only take but so many off. More layers in winter is cozy, literal nudity in the summer and I’d still feel like I need to crawl out of my skin and into an air conditioned freezer.",
   "created_utc": 1692067736,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8ful9",
   "message": "Head trauma.",
   "created_utc": 1692067875,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8g21p",
   "message": "Im fat",
   "created_utc": 1692067970,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8gczz",
   "message": "I hate sweating my balls off in 90/100 degree weather.",
   "created_utc": 1692068111,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8gg02",
   "message": "Skiing. Winter hiking. No humidity.\n\n\nWinter is the best.",
   "created_utc": 1692068149,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8gpmf",
   "message": "When it is hot I am extremely unproductive",
   "created_utc": 1692068271,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8gs4m",
   "message": "I absolutely hate the heat, and I’m more comfortable in the cloths I wear in the winter. And yea no bugs like other people said.",
   "created_utc": 1692068304,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8hcmy",
   "message": "I hate humidity. I'm useless when it's humid.",
   "created_utc": 1692068570,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8hfw9",
   "message": "I'm pasty white and live in a country with a weak ozone. I can feel it burning me when im out there.",
   "created_utc": 1692068613,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8hibm",
   "message": "You can always put more clothes on to stay warm only can take off so much before indecent exposure",
   "created_utc": 1692068646,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8ho3l",
   "message": "Texas\n\nBecause I live in Texas",
   "created_utc": 1692068721,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8hrsg",
   "message": "If I had a car I would probably prefer winter, but I bike everywhere ans get seasonal depression in the winter.",
   "created_utc": 1692068770,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8i2r8",
   "message": "I don’t like sweating just standing outside",
   "created_utc": 1692068910,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8i2uc",
   "message": "No bugs, no sweating, less showers, less stank, more fashion choices, and you can always bundle up if need be. You can only take off so much and you’ll still be hot, sweaty, and gross during a hot ass summer.",
   "created_utc": 1692068912,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8i76z",
   "message": "Snowboarding, it's easy to put more layers on but there's only so many you can take off, less tourism, and most importantly ... hockey.",
   "created_utc": 1692068971,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8ibob",
   "message": "I have epilepsy and if I get too hot during summer, it can trigger bad seizure’s. Winter and snow is just easier on my body.",
   "created_utc": 1692069032,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8idjr",
   "message": "I would much rather put more on than have nothing left to take off",
   "created_utc": 1692069057,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8igh5",
   "message": "✨ cozy layers of sweaters \u0026amp; blankets\n✨ no more sticky skin, hair, scalp, getting baked in the car, etc. \n✨ yummy hot drinks + cuddles\n✨ no more noisy AC \n✨ holiday markets",
   "created_utc": 1692069095,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8il84",
   "message": "I live in Louisiana.",
   "created_utc": 1692069159,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8ilrq",
   "message": "If it is cold - you can put on some clothes, if it is hot - you can’t put off your skin.",
   "created_utc": 1692069167,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8imit",
   "message": "The warm weather and that one day it actually gets cold in my area, winter sucks here but summer sucks far worse",
   "created_utc": 1692069177,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8iquk",
   "message": "In the winter, you can put more clothes on when it is cold. Summer is different",
   "created_utc": 1692069236,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8jdm6",
   "message": "I hate humidity.",
   "created_utc": 1692069541,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8jfkd",
   "message": "Building a fire is far more enjoyable than turning on an air conditioner.",
   "created_utc": 1692069567,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8jqgf",
   "message": "skiing. That's the reply.",
   "created_utc": 1692069710,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8k3mm",
   "message": "I live in Phoenix",
   "created_utc": 1692069887,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8k41k",
   "message": "1. Snowboarding \n2. Extra layers for clothing, lots of options for dress and extra pockets!\n3. I sleep better in a cold bedroom, thus during the winter it's easy to have a cold bedroom. As a bonus I like it extra cold where you have to use an extra blanket.\n4. The lack of bugs/insects.",
   "created_utc": 1692069893,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8kbzo",
   "message": "I hate sweating and love sweaters \u0026amp; scarfs. I prefer hot cocoa over ice cold drinks. I hate sunburns and love the cool breeze.",
   "created_utc": 1692070001,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8kdyg",
   "message": "I have melasma, which is cause by sun exposure, and I have rosacea, which is triggered by sun exposure and heat. \n\nI don't like to be hot. \n\nI like sweaters.\n\nI love to be cozy.\n\nI like how snow sparkles and I like how trees look like underwater corals at night when covered in snow.\n\n I like how when branches are coated in ice and you look at a streetlight through them they seem to ring around the light in shards. \n\nI like to see my dog romp in the snow.\n\nI like to feel cold air on my cheeks and breathe in deeply.\n\nI like to throw snow at my husband and push him into snowbanks.",
   "created_utc": 1692070027,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8kmnj",
   "message": "Sweating feels gross",
   "created_utc": 1692070146,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8kof9",
   "message": "I live in Arizona.\n\nDuring the winter the temperature is in the 70°F to 80°F range. \n\nDuring the summer the low temperatures here have been around 90°F and high temperature ar around 110°F.\n\nWinter is the time of the year when it is best to be in the desert.\n\nDuring the winter, I can go outside all day.\n\nDuring the summer, it is hard to stay outside in the Arizona heat for more than a few hours during the middle of the day.\n\n\nArizona Weather stats for this year.\n\nLast month set and broke heat record after heat record nearly every day since July 8. \n\nAccording to the weather service:\n\n* The average maximum temperature in July was 114.7 degrees.\n* The average minimum temperature was 90.8.\n* Every day in July had above-normal temperatures.\n* Only one day in July had a high temperature below 110 degrees.\n* July set a new all-time record for the most consecutive days with high temperatures at or above 110 degrees (31 days) from June 30 to July 30.\n* July had 19 days with low temperatures at 90 degrees or higher.\n* 17 days in July hit maximum temperatures at or above 115 degrees, breaking the previous record of six days set in 2020.\n* July set a new all-time record warm low temperature of 97 degrees.\n* Three days in July reached 119 degrees.\n* 12 days in July broke or tied daily high-temperature records.\n* 16 days in July broke or tied daily warm low-temperature records.\n* The longest stretch of days under an excessive heat warning was set from July 1 to July 29, nearly quadrupling the number of days from the previous record, which was eight days.",
   "created_utc": 1692070172,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8krng",
   "message": "I personally love the cold. Im a shorts and t-shirt in January guy. Drawback is noone else goes outside.",
   "created_utc": 1692070216,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8kwzu",
   "message": "If you're asking a Texan; Texas.",
   "created_utc": 1692070287,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8l8nu",
   "message": "I live in Alabama.  In August if the sun is up you are breathing a hot moist suffocating melange of tree pollen and humidity.  Or it's a thunderstorm drenching you and possibly relocating your home.  When it stops all the rain ensures you get a nice humid lung full.",
   "created_utc": 1692070448,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8ldgs",
   "message": "I like coats, and that warm fuzzy feeling of being warm.",
   "created_utc": 1692070515,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8lgim",
   "message": "No bugs. If I’m uncomfortable i can put on more clothes. Conversely, i can only take off so many layers before I’m desperately trying to cut skin off or live in a freezer.",
   "created_utc": 1692070558,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8ls8f",
   "message": "i have seasonal depression except instead of winter it typically takes place during summer",
   "created_utc": 1692070721,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8luqf",
   "message": "you can turn on an ac or a fan in summer but your electric bill is going through the roof, but in winter you can just layer up and at most a small heater will be enough when you get home.  \nalso sleeping in winter is so much easier for me.",
   "created_utc": 1692070756,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8lwq8",
   "message": "I sleep better when it’s cold outside. Can always snuggle with my boyfriend and a blanket. Summertime it’s about not getting any decent sleep due to the heat and it doesn’t seem to cool off at all inside.",
   "created_utc": 1692070784,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8m3eo",
   "message": "Nothing blooms that makes me sneeze.",
   "created_utc": 1692070878,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8mv61",
   "message": "Florida is my reason.",
   "created_utc": 1692071271,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8n322",
   "message": "Summer in Las Vegas is at minimum 100 and routinely hits 110-116.  Winter here is 55-65",
   "created_utc": 1692071384,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8n72v",
   "message": "I like the snow, I like my winter clothes better.",
   "created_utc": 1692071440,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8npac",
   "message": "You can keep putting on layers, you can’t keep taking them off. Bugs, idiots everywhere outside, I can’t wear my favorite clothes, summer sucks. I love winter, especially when it’s snowing. Growing up in a hell scape desert will do that to you",
   "created_utc": 1692071702,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8nubf",
   "message": "I don’t like people bothering me, less people bother me during winter.",
   "created_utc": 1692071775,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8nvue",
   "message": "Hot chocolate, mostly.",
   "created_utc": 1692071798,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8ny9c",
   "message": "I can put on a sweater if I'm cold but removing my skin if I'm hot would be so much more difficult.",
   "created_utc": 1692071832,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8o7xu",
   "message": "Heat stroke 10 years ago, and medication that warns against sun exposure makes me love cool weather.",
   "created_utc": 1692071972,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8oc9n",
   "message": "A lot of reasons I have are already listed, but Ill throw in one from me, and one from my wife.\n\nFrom me: Winter has a \\*lot\\* of comforting darkness, rather than the garish and unfeeling light of day.\n\nFrom my wife: 'I SHOULD NOT STEP OUTSIDE AND HAVE MY PHONE SCREEN FOG UP DUE TO HEAT AND HUMIDITY'",
   "created_utc": 1692072034,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8oeng",
   "message": "Allergies are getting worse because of global warming and im more miserable every year",
   "created_utc": 1692072070,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8omik",
   "message": "The heat index isn’t 115 in the shade.",
   "created_utc": 1692072187,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8op1p",
   "message": "no bugs, no sweat, no blush 👍",
   "created_utc": 1692072225,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8opim",
   "message": "Shredding gnar",
   "created_utc": 1692072232,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8oqtl",
   "message": "1) no bugs \n2) I still hike but have the path to myself \n3) skiing \n4) it’s cozy - warm hot coco by the fire watching a movie \n5) break from yard work. During the summer I mow the lawn 1-2x per week, lay mulch, trim constantly and water plants.\n6) the night walks are beautiful and quiet. Air is crisp and snow absorbs sound.",
   "created_utc": 1692072251,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8oz8w",
   "message": "I like the cold.\n\nI like running the heat in my car. It feels great.\n\nI love snow.\n\nI like having heavy blankets on.",
   "created_utc": 1692072374,
   "score": 1,
   "submission_id": "15rc6y6"
  },
  {
   "comment_id": "jw8qoao",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15rc6y6"
  }
 ]
}