{
 "submission_id": "15rcw5m",
 "title": "What’s the most physically painful thing that has happened to you?",
 "selftext": "",
 "created_utc": 1692060654,
 "permalink": "/r/AskReddit/comments/15rcw5m/whats_the_most_physically_painful_thing_that_has/",
 "score": 129,
 "url": "https://www.reddit.com/r/AskReddit/comments/15rcw5m/whats_the_most_physically_painful_thing_that_has/",
 "comments": [
  {
   "comment_id": "jw7zmpj",
   "message": "Herniated spinal disk at L5/S1.  I laid in bed crying for a week.",
   "created_utc": 1692060889,
   "score": 39,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8d4qy",
   "message": "An RPG blast blowing out a 4 inch section of my forearm bone.",
   "created_utc": 1692066651,
   "score": 235,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8ehao",
   "message": "Ovarian cyst rupturing",
   "created_utc": 1692067255,
   "score": 57,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw87n9f",
   "message": "I was 14 and riding a bike barefoot, caught my foot in the spoke and tore my big toe completely off. Six surgeries and fifty years later, it resembles Frankenstein's but I can walk pain free and with a barely noticeable limp 👊",
   "created_utc": 1692064270,
   "score": 192,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw87drq",
   "message": "I stubbed my toe while watering my spice garden and I only cried for 20 minutes",
   "created_utc": 1692064157,
   "score": 244,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8ehhg",
   "message": "After my appendix burst \u0026amp; i had it removed, my other organs didn't want to \"wake up\" apparently I had some dangerous fluid building up in my stomach. So they had to shove this big ass tube up my nose, down my throat and into my stomach to pump it out. I was awake for the entire thing. Two nurses held either of my arms while another shoved the tube in. Even after it was in, it was awful. I kept vomiting over the days I had to keep it in, and eventually started vomiting blood from it rubbing my throat raw. Totally sucked. I live with chronic pain from interstitial cystitis, have given natural birth to 4 large kids, recently broke my tibial plateau in 3 places \u0026amp; had surgery \u0026amp; NONE of it compares to the feeling of that tube going in \u0026amp; coming out.",
   "created_utc": 1692067257,
   "score": 162,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8k5da",
   "message": "Cluster Migraines. \n\nNothing like begging to every god and devil you can think of to either save or kill you",
   "created_utc": 1692069911,
   "score": 127,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw7zkqy",
   "message": "kidney stones...",
   "created_utc": 1692060866,
   "score": 125,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8btv2",
   "message": "Salmonella. It feels like acid is eating your insides. \n\nAlso, abscessed tooth. Feels like an ice pick slammed into your gums.",
   "created_utc": 1692066083,
   "score": 244,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8dsj2",
   "message": " It on a peanut butter and jam sandwich with a tooth that I soon found out needed a root canal. Stopped me in my tracks. Dental pain is no joke.",
   "created_utc": 1692066946,
   "score": 225,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8g8xc",
   "message": "A horse stepped on my pinky toe and wouldn’t get off 🥲",
   "created_utc": 1692068059,
   "score": 210,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8nzeh",
   "message": "Looking at these responses like 😳 because I’ve personally gone through: IUD insertion, ovarian cyst rupture, gallstones, and a herniated disc at L5/S1. \n\nCan confirm, none felt good.",
   "created_utc": 1692071848,
   "score": 94,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8entg",
   "message": "Novocaine running out during a cavity drilling. I was 17 and didn't know you could ask for more, so I just clenched my toes and got through it\n\nTerrified of the dentist now.",
   "created_utc": 1692067337,
   "score": 7,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw88zfv",
   "message": "Grief",
   "created_utc": 1692064841,
   "score": 128,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8k8gz",
   "message": "Sneezing with three broken ribs.",
   "created_utc": 1692069953,
   "score": 174,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8d95p",
   "message": "Gave birth to a nine-pound six-ounce baby with no drugs because my labor lasted less than two hours. I have had lots of injuries in my life, but that was the most painful for sure.",
   "created_utc": 1692066705,
   "score": 175,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8275o",
   "message": "Gall stones (which led to a surprise emergency gallbladder removal) - I was actually so sure I was dying that I couldn’t believe I didn’t.",
   "created_utc": 1692061963,
   "score": 26,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8fp6v",
   "message": "Pancreatitis and torn ACL. Wouldn’t wish that pain on my worst enemy.",
   "created_utc": 1692067808,
   "score": 228,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8gahv",
   "message": "Endometriosis",
   "created_utc": 1692068080,
   "score": 46,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw83zcb",
   "message": "APPENDICITIS",
   "created_utc": 1692062709,
   "score": 53,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8hlkz",
   "message": "In order...part of my jaw started to rot from a massive tooth infection. Gout. Passing a kidney stone. Copperhead bite. Watching the movie Cabin Fever....I cried at the end, not because it was good but because Ill never get that time back.",
   "created_utc": 1692068688,
   "score": 105,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8djql",
   "message": "2 weeks ago i basically had my skull taken apart and then put back together. That wasn't fun.",
   "created_utc": 1692066837,
   "score": 1,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8hetz",
   "message": "Heartbreak , I didn’t know it hurt physically until I experienced it.",
   "created_utc": 1692068600,
   "score": 216,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8e3iv",
   "message": "IUD insertion",
   "created_utc": 1692067083,
   "score": 218,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8ng7w",
   "message": "SHINGLES",
   "created_utc": 1692071571,
   "score": 187,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8cx3c",
   "message": "Gum graft. The roof of your mouth is fkn painful. Holy shit",
   "created_utc": 1692066556,
   "score": 32,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8deqy",
   "message": "I fractured my back rock climbing right after I turned 30. That was the most insane amount of pain I had ever experienced, took almost 8 months to recover from fully. I couldn’t walk further than a couple feet. Oof.",
   "created_utc": 1692066774,
   "score": 56,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8nvaj",
   "message": "Getting an IUD inserted",
   "created_utc": 1692071790,
   "score": 46,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw7zpqi",
   "message": "Probably when I was going down a hill at like 30 mph and went into a curb … straight into my knee! tissue was basically lying on the sidewalk, could see my bone and all. Thankfully got stitches and I can walk fine! If it was my head I don’t think I’d be here today",
   "created_utc": 1692060924,
   "score": 102,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8eub1",
   "message": "Bladder Infection",
   "created_utc": 1692067419,
   "score": 33,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw80oii",
   "message": "Gall stones probably",
   "created_utc": 1692061332,
   "score": 42,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8fe7j",
   "message": "Ooh I got a story \nI was in 8th grade I have a skin condition that makes my skin tear easily and I was running to my bus from 6th period pe and this popular girl type trips me and I fall and like skid on the ground I tore a baseball size hole in my elbow and a ton of smaller scabs all over my body. But that’s not the most painful part when I get home my dad refuses to take me to the doctor even though I was drenched in blood and had a giant hole in my arm he tells me to take this old dishwasher brush and some dish soap into our hot tub and scrape all the dirt and concrete out of my arm hurt like hell.",
   "created_utc": 1692067671,
   "score": 70,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8hwen",
   "message": "When I was in the hospital with double pneumonia I found out that I'm allergic to potassium when it was added to my IV line. It felt like my insides were burning. I could feel every vein in my body. I've never before nor since experienced that kind of pain and would not wish it on anyone.",
   "created_utc": 1692068829,
   "score": 78,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw82drr",
   "message": "Kidney stone",
   "created_utc": 1692062039,
   "score": 23,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8i7ie",
   "message": "Had my hip sheared off, ball of hip in socket, femur no longer attached. 0/10 do not recommend.",
   "created_utc": 1692068976,
   "score": 136,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw80bpv",
   "message": "My period.",
   "created_utc": 1692061179,
   "score": 131,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8nmet",
   "message": "Anaphylaxis rash.\n\n100% of your body(including in between fingers) with the worst sunburn you’ve ever had, then you bathed in itching powder.\n\nFor *8* hours",
   "created_utc": 1692071660,
   "score": 66,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8r1cm",
   "message": "When I was four we were getting our driveway paved. It was a hot 90+ degree day and my friend and I were playing tag. I was \"it\" and chasing my friend (who was three years older and significantly bigger) . We ran down my stairs when my friend jumped over the four foot wide gap of steaming hot ashphalt. I,being 4 and not knowing any better ,tried to jump this gap only to land and sink about an inch deep into this ashphalt. I ran into the house with the ashphalt stuck to the bottoms of my feet. Mom quickly put my feet in a tub of ice water.and drove me to the hospital, I'll never forget the pain of taking my feet out of that water to the sound and feel of literal sizzling pain. This resulted in third degree burns on the bottoms of my feet, cast and crawling on my hands and knees for a little over a month.\r  \n\r  \nEdit: The pain when the doctors were peeling it off of my feet and the skin coming off with it was an equally as bad experience.\r  \n\r  \nTL,DR: Bare feet and newly laid smoking ashphalt",
   "created_utc": 1692073489,
   "score": 170,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8hblu",
   "message": "Acute pancreatis. I have never felt such pain before, morphine didn't even help. Thankfully Delaudid did the trick!",
   "created_utc": 1692068557,
   "score": 37,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8r9ll",
   "message": "I passed a kidneystone that tore its way out. The pain was so intense that I blacked out and hit my head against the wall and floor.\n\nThe damage it dealt on its path out was enough to give me a blood infection and caused my kidneys to start shutting down putting me into sepsis.\n\nI was kept at the hospital for 5 days. Dreading every time I would need to urinate due to the massive pain, and it was frequent due to the amount of fluids they pumped through me.\n\nThen I had to have a Pic line inserted so that I could self administer the \"nuclear option\" antibiotic near my heart. That was a great two weeks.\n\nI would not wish that whole ordeal on anyone.\n\nThen I got the bill....",
   "created_utc": 1692073617,
   "score": 40,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw81a8t",
   "message": "I had a vasectomy. A girl I used to hang out with (platonically), would lay down next to me on the floor to watch movies since that was the only comfortable place for the first couple of days. She accidentally nut tapped me when moving *THREE* times over that time.\n\nWe wound up getting married btw. Way out of my league, so I’m convinced she’s still making it up to me because why else lol",
   "created_utc": 1692061584,
   "score": 167,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8r2zm",
   "message": "My IUD insertion and the immediate aftermath. \n\nDoctor comes in, gets ready talking to two people who are clearly teenagers (me and my ex) \n\nThen told 18 y/o me \" Some women compare this to childbirth so just so you know.\" Didn't ask if I was ready and then used that damn spike. \n\nTo be clear I am not saying it is compared to childbirth. I am saying what my doctor told 18-year-old me. Anyone with an IUD knows that fucking spike, I nearly screamed. \n\nI couldn't stand up for almost 1 hour  afterwards and was stumbling home. \n\nI'm lucky I was driven because I don't think I would have been able to go on public transportation  afterwards. I would have had to call for a pick up. I couldn't walk properly for weeks without pain.",
   "created_utc": 1692073514,
   "score": 14,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8hrh9",
   "message": "Being told by my fiancé two weeks before our wedding she no longer loved me and didn’t want to get married.  The emotional and psychological pain manifested in physical pain and insomnia. Insomnia sucked too.",
   "created_utc": 1692068766,
   "score": 86,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8c1mw",
   "message": "Abcessed tooth \n\nCrush injury to hand",
   "created_utc": 1692066178,
   "score": 30,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8cv0h",
   "message": "When I was a teenager both of my lungs collapsed twice (4 different episodes). Very painful \u0026amp; the recovery was brutal",
   "created_utc": 1692066530,
   "score": 41,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8o5q6",
   "message": "Severe alcohol withdrawal to the point of hospitalization",
   "created_utc": 1692071939,
   "score": 64,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8q9ko",
   "message": "IUD. I thought my pre-bc period was bad (severe depression, anxiety, and suicidal thoughts + sitting on the toilet all day from period shits and stabbing cramps that couldn’t be relieved because it would enhance the soreness of my back and hips+ anemia). Then the IUD. Definitely more than just a pinch and the numbing did absolutely nothing—- screamed, cried, nearly passed out (should have let myself pass out) walked out like a zombie with cramps and nausea, felt violated, betrayed, traumatized enough that i likely won’t get it done again. That one day alone was enough for me to say I’d rather deal with pre-bc shit, which is already another wack level pain.",
   "created_utc": 1692073068,
   "score": 14,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8jshn",
   "message": "C section recovery. The morning after was brutal.",
   "created_utc": 1692069736,
   "score": 26,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw80e12",
   "message": "Stomach hernia that my bowel pushed through. Horrible pain.",
   "created_utc": 1692061207,
   "score": 22,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8lzpk",
   "message": "Gout.  I was 23 and had a healthy weight and lifestyle, so I never figured out where it came from.  It's by far the most intense pain I've ever experienced, including the time I impaled my arm on a broken-off broom handle.  Vicodin barely took the edge off.",
   "created_utc": 1692070827,
   "score": 35,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8nxzw",
   "message": "Waking up after hours of major abdominal surgery and finding out that the morphine wasn’t working for me.",
   "created_utc": 1692071828,
   "score": 61,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8khjk",
   "message": "Migraines are a bitch for a few hours. \n\nTry gout for a few days and weeks.  \n\nIt’s the worst I’ve had, truly terrible",
   "created_utc": 1692070076,
   "score": 57,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8ajn7",
   "message": "A migraine.",
   "created_utc": 1692065520,
   "score": 24,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8qh6z",
   "message": "Watching my three month old daughter die. Many might not think grief is painful and they’re correct…it’s agony.",
   "created_utc": 1692073182,
   "score": 127,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw88fn0",
   "message": "The third time I dislocated my elbow. There was a screw in there from a previous surgery that got moved around and likely hit my nerve when the dislocation happened. It hurt so bad I was screaming. Post ACL surgery was horrible too once the nerve block wore off.",
   "created_utc": 1692064605,
   "score": 23,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8e6lf",
   "message": "My periods and when I broke my tibia and had an oedema at my bone marrow.",
   "created_utc": 1692067121,
   "score": 13,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8j8te",
   "message": "IUD insertion",
   "created_utc": 1692069476,
   "score": 9,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8fcwd",
   "message": "Pitocin only vaginal birth",
   "created_utc": 1692067655,
   "score": 15,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8ne3v",
   "message": "Shutting my finger in a car door. My finger swelled up and the doctor had to make a hole in the nail to relieve pressure. The nail eventually fell off then grew back. It still looks different from my other fingernails.",
   "created_utc": 1692071541,
   "score": 18,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8q2zl",
   "message": "IBS, it has made me faint, vomit and profusely sweat too many times",
   "created_utc": 1692072969,
   "score": 49,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8q5gn",
   "message": "When they removed the epithel of my cornea on my left eye. Your eye feels it‘s being drilled into and on fire at the same time. Whether open or closed doesn‘t matter. For months afterwards I was so photosensitive.",
   "created_utc": 1692073005,
   "score": 17,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8dxbc",
   "message": "When my baby got stuck on the way out.",
   "created_utc": 1692067004,
   "score": 25,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8fkgr",
   "message": "Disappointed my mum once as a kid.",
   "created_utc": 1692067749,
   "score": 25,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8phk7",
   "message": "I partially expelled my IUD on a friday night. We had waited the full recommended 3 months for intimacy but it still happened. The waves of pain was worse than any cramp ive ever had which is saying something since i have PCOS. Every time the wave hit I would immeadiatly vomit. It radiated up my spine and down to my legs. My knees buckled and I was unable to walk. My boyfriend carried me into the ER but they refused to remove it. However they didnt hesistate to charge me for all the unneccessary imaging ($1.2k). They told me to take some advil and call my obgyn on monday to remove it. I had to endure the pain the entire weekend unable to eat and barely able to drink anything. I called my gyno the moment their office opened and luckily they saw it as an emergency and told me to head their way asap. I cried in relief when they pulled it out and the nurse hugged me. went back to the pill after that.",
   "created_utc": 1692072646,
   "score": 114,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8qkjm",
   "message": "Mauled by a dog for 5 minutes and was completely scalped ear to ear. Took over 300 stitches and 4 reconstructive surgeries to fix it.",
   "created_utc": 1692073233,
   "score": 54,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8fdul",
   "message": "TMJ  no question about it. I've had surgeries,  childbirth, broken bones etc. TMJ I wouldn't wish on my worst enemy. Basically cried for 3 days and couldn't even sleep from the pain.",
   "created_utc": 1692067667,
   "score": 15,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8pfss",
   "message": "I got shot in my pelvis, that hurt... a fucking lot, they gave me the morphine clicker when I woke up.  I clicked away while they told me all the medical stuff they did.  Woke up, got up to pee and pulled my catheter out... hurt way worse.  Then they took away my morphine clicker.",
   "created_utc": 1692072619,
   "score": 25,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8r3xq",
   "message": "My first kidney stone.  When the bastard finally passed I saw it had a hook on it.",
   "created_utc": 1692073528,
   "score": 15,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw890kh",
   "message": "Rupturing my eardrum. I did it diving into a pool.",
   "created_utc": 1692064855,
   "score": 16,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8hcnu",
   "message": "Broken heart lol",
   "created_utc": 1692068570,
   "score": 10,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8fk26",
   "message": "Ruptured appendix",
   "created_utc": 1692067744,
   "score": 5,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8i05o",
   "message": "Dislocated knee and having to pop it back into place. Not fun.",
   "created_utc": 1692068877,
   "score": 6,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8i6bz",
   "message": "Painful was gallbladder for sure. I couldn't lay down, or stand up straight without being in pain that made me want to end it all. My gallbladder essentially rotted inside of me. When they tried to remove it, it came out in peices because it was falling apart. The most uncomfortable mentally was my stroke. I was so nauseated, kept seeing streaks of rainbow ish colored lightning bolt shapes in my vision. The color of them was kind like the static screen from an old 90s TV when you had all the colored speckled. I lost my balance significantly as well and had to hold to a wall to walk.",
   "created_utc": 1692068960,
   "score": 7,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8i7vf",
   "message": "Triple bypass surgery as a 50 ish woman. Brutal recovery!",
   "created_utc": 1692068980,
   "score": 7,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8kysv",
   "message": "The flu with fibromyalgia, childbirth was up there but I could get an epidural. Nothing (to me) is worse than constant full body aches that last for days, can’t get comfy, joints constantly ache, can’t sleep because the pain is too severe. It’s unbearable and by the end I’m in tears.",
   "created_utc": 1692070311,
   "score": 6,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8mwcu",
   "message": "I'd say kidney stones, but I have such bad IBS that sometimes sends burning aches up my back and down to my knees.  Imagine having the severe urge to shit out of your knees, hips, and all the way up your back.  I'll feel fine then randomly get a stab right in the tail bone that drops me to the floor.  I have it about half of the time.  Pain gets to a point where I start to hallucinate.  Without THC I would only get 2 hours of sleep tops.  \n\nRemember to eat healthy while you can, because I became intolerant to a lot of healthy things, and it's so depressing.",
   "created_utc": 1692071289,
   "score": 6,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8nf99",
   "message": "My IUD insertions were the most pain I’ve ever experienced. \n\nNumber 2 was when I was stabbed in my upper abdomen and the recovery. I still have some “phantom” pains that almost feel like gallstones. Took 5ish years, multiple ultrasounds and MRIs that were negative for gallstones before anyone could put 2 and 2 together and suggest nerve damage or scar tissue was causing the pain to present like gallstones. Got a bisalp recently where the surgeon took photos of my abdomen and there is definitely scar tissue in that area, but my gallbladder (and everything else) looked healthy.",
   "created_utc": 1692071558,
   "score": 6,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8ofjb",
   "message": "Kidney stones or IUD insertion. Kidney stones are a more prolonged pain... IUD insertion was way more intense.",
   "created_utc": 1692072083,
   "score": 5,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8ol7b",
   "message": "Breast reduction. It was 25 years ago, and I'm glad technology has advanced since then. \n\nIUD insertion and the hell I experienced for months until I got it taken out.\n\nMigraines. Enough said.",
   "created_utc": 1692072167,
   "score": 5,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8pvqn",
   "message": "Tie for Herniated disc and IUD insertion",
   "created_utc": 1692072860,
   "score": 5,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8q28e",
   "message": "72 hours of labor, brought on by pre-eclampsia, along with every intervention in the books before ultimately having an emergency c-section and placed on a ventilator. When they Suction fluid out of your lungs it hurts really bad! And then the 6 six weeks of physical pain along with mental fog and shock :)",
   "created_utc": 1692072957,
   "score": 5,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8q362",
   "message": "Coughing with intercostal muscle strain. The sheer anticipation of pain is dreadful.",
   "created_utc": 1692072972,
   "score": 5,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8qcwa",
   "message": "Tip of my right ring finger chopped off by 15,000lbs of steel.",
   "created_utc": 1692073117,
   "score": 18,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8qh0m",
   "message": "I’m 35 and I had both hips replaced three years ago, got a vasectomy last week, had an endoscope slammed down my nasal passageway a couple years ago, and had four wisdom teeth removed without gas during one sitting a couple of years ago. But nothing, absolutely nothing can compare to how badly a heart can ache.",
   "created_utc": 1692073179,
   "score": 6,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8tjdv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8rw4d",
   "message": "My fiancé passed away on June 21 of 2009 after being engaged for 36 hours. It broke me but I’ve healed and moved forward \n\nNext to that, an infected toe nail was absolutely brutal",
   "created_utc": 1692073969,
   "score": 102,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8sls5",
   "message": "neuropathy. nerves on entire body firing. searing burning pain.",
   "created_utc": 1692074377,
   "score": 24,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8g35n",
   "message": "Went from a back seat of a vehicle, tearing out the seatbelt, over the drivers head, through the windsheild and into a tree at 55 mph. Died twice.",
   "created_utc": 1692067983,
   "score": 14,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw9769u",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8r786",
   "message": "Uterine rupture. It just ripped the fuck in half. Both I and my daughter would have died if we'd lived more than 5 minutes from the ER. AGONIZING pain. I'd been through a lot in my three pregnancies, but this was world-endingly painful.\n\nIf you are having a high-speed crash C-section, your body is basically like a car in a NASCAR pit, a dozen people are all frantically doing very synchronized prep work on your body so they can cut you open as soon as possible.\n\nIf you're having a regular, cool C-section, there are 1 or 2 nurses/anesthetists who are slowly doing all the things to get you ready over the course of a couple of hours. If you have a crash emergency C-section, you are the car in the NASCAR pit and everybody's working REALLY FAST to get you surgery-ready in about 7 minutes. My spouse almost didn't make it into the OR because they went so fast. It took two minutes for them to walk him to the prep room after I was rushed away, and 3-4 minutes for him to put on his scrubs so he could enter the OR, and by the time he walked in they were literally cutting me open.\n\n(Also, if you are having a C-section and there are 12 people in the OR, that is a normal number. If you are having a C-section and there are 40 people in the OR, they are concerned that you and your baby both might die; there are crash teams for both of you.)",
   "created_utc": 1692073580,
   "score": 46,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8r99b",
   "message": "Miscarriage at 20 weeks.",
   "created_utc": 1692073611,
   "score": 32,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jw8ygi0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15rcw5m"
  },
  {
   "comment_id": "jwacy2b",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15rcw5m"
  }
 ]
}