{
 "submission_id": "15rdkpb",
 "title": "People who have served in the army, what was it like seeing real, brutal action for the first time?",
 "selftext": "",
 "created_utc": 1692062364,
 "permalink": "/r/AskReddit/comments/15rdkpb/people_who_have_served_in_the_army_what_was_it/",
 "score": 200,
 "url": "https://www.reddit.com/r/AskReddit/comments/15rdkpb/people_who_have_served_in_the_army_what_was_it/",
 "comments": [
  {
   "comment_id": "jw848ej",
   "message": "x3 Afghaniland trips, in my experience you either freeze or don't really process what's happening (at the time)  \nIt's muscle memory, it's reactionary, but more than anything else it's knowing if you don't do what you're trained for you're a liability at best and dead at worse.\n\nI always compared taking a life to having a math problem you can't quite figure out, you know what it is, you may even already know the answer, but you don't know *how* it got there.",
   "created_utc": 1692062817,
   "score": 95,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw8gkeu",
   "message": "When the alarms for indirect fire (mortars, rockets, etc.) sound and you hurry to a bunker, it can be a little frightening.\n\nThere is a sense of total helplessness as you sit in the bunker, which is essentially just a few concrete slabs. Every war movie you've ever watched features an enemy attack, followed by the soldiers charging forward with their weapons to repel the assault. In truth, there is little you can do but wait as the Taliban fires mortars at you.\n\nThe alarm is screaming at you as you sit down in the bunker, but you are utterly helpless to do anything about it. As the Taliban adjusts their aim and tries to fall rockets on your head, you sit there and listen for small arms fire, for people screaming (if they were hit), and for explosions coming closer and closer to you.\nThe worst part is that everything fucking sounds like that IDF alert when you get home. Your heart rate spikes to 120 when someone pushes back a chair on a tile floor, and you go for a weapon that you are no longer holding.\n\nAn image of a typical bunker on an Army Forward Operating Base has been provided.",
   "created_utc": 1692068204,
   "score": 43,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw8h81d",
   "message": "A vets-only reverse boot camp has my full support. When they return, they continue to hang out with their fighting squad, but maybe in a dorm at a campsite. Spend three to four months relaxing while making improvements to national parks outside in the pleasant weather. Open hours for family visits. provide a lot of counseling services that are accessible round-the-clock. Retrain people to be citizens, not troops. That would, in my opinion, do wonders for mending the psychological harm caused by deployment while also saving the VA some money in the long run.",
   "created_utc": 1692068510,
   "score": 37,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw8hf4r",
   "message": "This is what bothers me the most, brother. I can still see the horror in the young girl's eyes as she entered the line of people from around the corner.They both froze and just gazed at me in fright as 50 pointed and her mother followed behind her. I waved them through while raising the gun and attempted to smile to reassure them that everything was well, but as I did, I was torn up by the prospect of my daughter experiencing the same level of anxiety as that little girl. continues to. I fired many shots with my firearm, yet that girl stayed by my side.\n\nAlthough I'm aware that worse things have happened to others and have even happened to me, I still think about that girl.",
   "created_utc": 1692068603,
   "score": 99,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw8uzej",
   "message": "Ah, the first time... I answered wrong the first time.\n\nYeah, muscle memory kicks in and you only realize the gravity of what the fuck just happened multiple hours later while your taking a dump in a wag bag.",
   "created_utc": 1692075793,
   "score": 44,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw8wac8",
   "message": "I went through the \"react to contact\" motions, which are taking cover and establishing suppressing fire. I remember that once it got quiet, my mind tried to catch up to what my body did as if it was butthurt for being hijacked, yet grateful. Then I look over and see our casualty.\n\nThe poor private who took one to the front plate was probably having the opposite perspective while laying there. I've never seen someone get shot, and then just lay there pouting like they just got rejected by their crush. It was just tough for him to laugh it off with a busted rib, so he resorted to making a one-armed sand angel until the AO was clear.\n\nThe most badass people don't take themselves seriously.",
   "created_utc": 1692076607,
   "score": 57,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw8u3a6",
   "message": "It's easier to pull the trigger when you or your buds are in immediate danger as opposed to pulling the trigger on someone planting an IED at night while posted at an LP/OP",
   "created_utc": 1692075248,
   "score": 24,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw894h0",
   "message": "It was fun until a .308 round cost me my left kidney.",
   "created_utc": 1692064902,
   "score": 75,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw89rfq",
   "message": "I never served, but my dad did, and, honestly, most of his family going back generations did too as far as I know. (On a side note, I kinda felt weird for, like...Not doing so? Like it was this family tradition or something, and I wondered if my dad was dissapointed? anyway...)  \n\n\nSo my dad, he served in Germany i nthe cold war, and Ireland during what we affectionately call \"The Troubles\".  \nHe used to tell us stories, about what he was told t odo if the Soviets ever attacked (Which essentially amounted to -in his words- Clog their gears with your bodies until we can bring about a nuclear reprisal. Dunno how serious he was in it, but that was, im certain, his takeway from the lesson. He did not walk into German yexpecting to walk out.  \nBut he did. And he joked about al lthe dumb shit he did in berlin (got blackout drunk on leave once. Managed to make it back to where he was staying, but doesnt remember anything until he woke up several days later in hospital) all this he would tell with a Jovial tone.  \n\n\nBut Ireland? He never spoke about that. Not a single goddamn word. Because that is where he saw combat. Ok, Almost no words. He told me one instance, once, I dont know why, but it just came out. almost no details. Patrol. Oh shit. He wakes up in hospital the only survivor of a group patrolling a, I belive, Warehouse, that was no longer standing.  \n\n\nI dont think he was ashamed, or sad my brother or I never wanted to join - he was a bit sad when my eldest sister (who did want to join the airforce, but her eyes went to shit pretty quickly which meant she couldnt join, and she moved to other things in life) but no, I dont think he was really upset.  \n\n\nAs for my other family... Well. My mum has been on a ancestry kick for a few years and discovered a Great Uncle my dad never knew about and his dad never spoke of. Killed somewhere in the Somme.  \n\n\nSo yeah. People who have seen \"real, brutal action\"? I dont think many of them really talk about it, not for clout certainly.",
   "created_utc": 1692065177,
   "score": 43,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw8vnca",
   "message": "If I live one thousand years, I will never forget the unmitigated horror of watching a man shit in another man’s bed for the first time.",
   "created_utc": 1692076208,
   "score": 23,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw8ouop",
   "message": "What have I gotten myself into.",
   "created_utc": 1692072307,
   "score": 9,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw8ryby",
   "message": "A lot of no-win choices get made faster than you'd like. I don't regret my time in, but there were situations I really wish had been different..",
   "created_utc": 1692074004,
   "score": 15,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw8t8g4",
   "message": "“People will never know the violence it took to become this peaceful”\n\nIt’s true. Easier not to go spouting off stories all giga-Chad. Live life and move on",
   "created_utc": 1692074744,
   "score": 21,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw98f3v",
   "message": "Marines. I got an all expenses paid trip to some real garden spots in the early 2000’s. In all honesty, it happened so fast, I am not sure I really remember anything; most of my “memories” are probably a conglomerate of rehashing the contact with my squad, and reading some of the reports later.\n\nOne minute, we were executing a bounding overwatch, to isolate a building that was putting out sporadic sniper fire, and generally being a pain in the ass. Next thing I know, I am behind a short brick wall, and have blown through three mags. It was muscle memory, adrenaline, and noise. I didn’t even hear the shots incoming. My squad leader shoved my ass down, pointed in the right direction and that was that. It lasted maybe three minutes. \n\nWhen we started to move again, I looked at the wall behind us (across a narrow-ish street; maybe 30 feet) and there were a bunch of new bullet holes. I got the adrenaline shakes pretty good a couple of hours later, when we finally rolled back into the FOB. \n\nLots of other fun stuff happened later, but that was the first time someone was shooting at me with malicious intent. My guys down the way just so happened to be a lot better shots.",
   "created_utc": 1692085217,
   "score": 1,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw83i3n",
   "message": "[deleted]",
   "created_utc": 1692062506,
   "score": 3,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw94wno",
   "message": "0/10 would not recommend.",
   "created_utc": 1692082564,
   "score": 1,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw83g6o",
   "message": "[deleted]",
   "created_utc": 1692062484,
   "score": 248,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw95amy",
   "message": "As an Israeli soldier I think I have a different perspective then most of the people here. While I have never experienced war with a trained army in Lebanon or Gaza. I have experienced countless skirmishes with terrorists in the West Bank.\nThe first time I got shot at it took a second to realize what was happening. And then we we’re like “ oh shit we should get behind cover” I guess when the enemy is an 18 year old who took there dads ak47 you just not so scared of them.",
   "created_utc": 1692082848,
   "score": 246,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw9540h",
   "message": "I'm war criminal...",
   "created_utc": 1692082713,
   "score": 255,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw8nt5u",
   "message": "I've been playing call of duty since I had the Wii.. and let me tell ya. \n\nJK lol",
   "created_utc": 1692071758,
   "score": 233,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw9avsq",
   "message": "Stupid question.",
   "created_utc": 1692087137,
   "score": 1,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw83bvw",
   "message": "[removed]",
   "created_utc": 1692062436,
   "score": 246,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw8fwvn",
   "message": "Not enough money in the world to ever convince me to serve in the armed forces. They're useless anyway and don't actually help protect a damn thing. They're still obsessed with trying to match me with young girls.",
   "created_utc": 1692067904,
   "score": 205,
   "submission_id": "15rdkpb"
  },
  {
   "comment_id": "jw90h6b",
   "message": "Id like to give a huge fuck you to anyone and everyone that has willingly joined the US army. The world would be a much better place without you",
   "created_utc": 1692079371,
   "score": 227,
   "submission_id": "15rdkpb"
  }
 ]
}