{
 "submission_id": "15rk0vs",
 "title": "How did you conclude that your sexual orientation is what it is?",
 "selftext": "",
 "created_utc": 1692079508,
 "permalink": "/r/AskReddit/comments/15rk0vs/how_did_you_conclude_that_your_sexual_orientation/",
 "score": 216,
 "url": "https://www.reddit.com/r/AskReddit/comments/15rk0vs/how_did_you_conclude_that_your_sexual_orientation/",
 "comments": [
  {
   "comment_id": "jw93rf5",
   "message": "I saw a Playboy when I was like 6 and my mind was blown.",
   "created_utc": 1692081728,
   "score": 227,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw90pzy",
   "message": "mfs just be sexy",
   "created_utc": 1692079541,
   "score": 115,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw90yqg",
   "message": "I was sold on boobs from an early age.",
   "created_utc": 1692079709,
   "score": 96,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw96fbu",
   "message": "Look at woman with big chest -\u0026gt; Ooga Booga\n\nLook at man with attractive body -\u0026gt; No ooga booga.",
   "created_utc": 1692083691,
   "score": 219,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw91mcp",
   "message": "Idk I’ve always been attracted to women\nNever really wanted to try anything with guys",
   "created_utc": 1692080171,
   "score": 218,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9ekm0",
   "message": "I saw Selma Hayek. And my brain shut down.",
   "created_utc": 1692090031,
   "score": 229,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9heeo",
   "message": "Saw a hot girl. Saw a hot guy. Thought “yeah both is good”",
   "created_utc": 1692092199,
   "score": 211,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9cngq",
   "message": "I kissed a girl and I didn't like it.",
   "created_utc": 1692088524,
   "score": 144,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9401u",
   "message": "I ate a girl out and ever since then I just can’t fucking stop doing it",
   "created_utc": 1692081902,
   "score": 236,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw92b2b",
   "message": "At 15 all my friends constantly talked about their crushes on our male classmates or their favorite male rock star. I was constantly thinking about my female teacher. My thoughts were never physical; they were about mundane things.  So I tried to convince myself I wasn’t gay. But I knew I couldn’t talk about my feelings. One day in class I was sitting on the floor with some other students and the teacher randomly put her hand on the top of my head. I felt like I was going to faint.  The infatuation lasted a couple of years. If I saw her walk by all the way across the cafeteria I would be in a good mood the rest of the day. \n\nA couple of years later it happened again with a coworker closer to my age.  The constant thoughts started up, just mundane things like replaying our discussions in my head. One day I had to talk to her about something. I was standing about 3 feet in front of her and looking at her, and I felt like I wasn’t going to be able to breathe.",
   "created_utc": 1692080664,
   "score": 199,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9jmdp",
   "message": "Heterosexual 34M here. Contrary to a lot of heterosexual men, I'm not just saying \"well I'm straight, that's it\" because you also do have to realise it at some point...  \nI played basketball and practised jiu-jitsu, saw a lot of beautiful, athletic men showering naked, and never was attracted to them. I had beautiful gay men hitting on me and didn't feel attracted (nor repulsed, just: it's not for me, sorry). So I concluded I was straight.",
   "created_utc": 1692093849,
   "score": 149,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw94bpz",
   "message": "[deleted]",
   "created_utc": 1692082142,
   "score": 146,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw984mz",
   "message": "After well over 20 years of never having a crush on anyone, it starts to dawn on you that maybe you're the odd one out not feeling anything. For me, sex was always just this super distant thing which I never, ever thought about unless it was brought up externally. Masturbation was always an \"oh yeah people do that, right\" kinda deal. Any sexual body part was always either completely unremarkable or outright ugly. That people really did imagine having sex with people was surprising to me. \"Wait, they're not just meming about a taboo subject because it's taboo? People actually think that way?\" Porn never interested me, and I have zero desire to look at it when I can instead be watching a documentary on Dave Stieb. Yeah, at some point it becomes hard to ignore that you're different. \n\nWhile I don't feel like I'm missing out on anything by being asexual and being in a position where I never want to try sex, I definitely do feel like I'm missing out by (possibly) being aromantic. I can appreciate a well-written romance (note: most are not for infuriating pacing reasons alone), and it does feel like it's something I'm missing even if I've never felt it. While I can think of someone as \"pretty\" or \"cute,\" words like \"hot\" and \"sexy\" have no intuitive and intrinsic meaning to them. I can give you a dictionary definition, and I can tell you how other people use them, but I don't actually feel it.",
   "created_utc": 1692084995,
   "score": 253,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9552s",
   "message": "I’ve liked guys since I was like 3.\n\nWhen I was 14 briefly wondered if I might be gay. Realized I’d never liked a girl and liked many guys so decided it was very unlikely. \n\nWhen I was 20 realized straight people weren’t typically interested in or turned on by the thought of having sex with people of the same sex as them. Decided I like guys so much more \nthan I would ever be interested in a girl that it really didn’t matter. The thought of dating a girl is also a complete turn off for me. \n\nBut I also have the mindset that I wouldn’t rule out anyone (female, male, nonbinary, trans, etc.) if I connected with them and enjoyed being around them, so was told that probably makes me bi or pan. But considering I’ve only ever liked guys, only ever dated guys, and do have a very significant preference toward males I just say I’m straight.",
   "created_utc": 1692082734,
   "score": 83,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw99oww",
   "message": "Sometimes I get hard just by the thought of a woman. I have never gotten hard looking at a guy. Is that how you tell?",
   "created_utc": 1692086212,
   "score": 96,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9bgjf",
   "message": "Teenage me, looking at boys = *meh*\n\nTeenage me, looking at girls = *meh*\n\nSame (zero) reactions for both, and 0=0, so I must be bisexual!\n\n/jk. I’m at peace having the label ace now.",
   "created_utc": 1692087587,
   "score": 216,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw90q2d",
   "message": "Never even had to think about it. I'm straight.",
   "created_utc": 1692079543,
   "score": 242,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9c1ht",
   "message": "I can't remember a time where I didn't feel attracted to both men and women. It never went away, never wavered. Figured by 25, that's pretty well set that I'm bisexual",
   "created_utc": 1692088040,
   "score": 81,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw98npp",
   "message": "When I was really small I didn't distinguish between one or the other and found out only later that most did not feel like that.\n\nThen around 15 I accepted I was bi and then when I was 18 I found what pansexual meant and found it applying better to me.",
   "created_utc": 1692085403,
   "score": 164,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw95q2b",
   "message": "Tried the other side once F2F and it was bloody awful- never again. So I know absolutely for sure I’m straight.",
   "created_utc": 1692083164,
   "score": 120,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9e4bx",
   "message": "I've never understood what other people my age were feeling but somewhere online I found others who felt the same and they called themselves \"asexual.\" \n\nTbh I'm still not clear on my sexuality. I've never felt the desire to kiss anyone but I like looking at people doing sexual dances / wearing revealing clothing online. I've only had crushes on men but I prefer lesbian love stories.",
   "created_utc": 1692089680,
   "score": 94,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw94opk",
   "message": "Looked at women, pp soft. Looked at other men, pp hard. I think it’s pretty clear for me lol.",
   "created_utc": 1692082403,
   "score": 89,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw96l41",
   "message": "There are few men that I'm attracted to, but there are some.  Realizing I was at least conceptually indifferent about the \"bits\" a partner has, I called myself bi for some time.  When I found myself considering gender expression as a spectrum rather than a series of discrete labels, I realized the male/female binary did not accurately conceptualize what I found attractive and what I didn't.\n\nSo \"pan\" is accurate, I suppose. I'm not super comfortable with labels, as it turns out.  There are sometimes implications and assumptions that come with them that don't apply.  If I think you're cute and we're into each other, I don't need to dissect why I feel that way.",
   "created_utc": 1692083815,
   "score": 34,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw98b4t",
   "message": "I accepted that I like women pretty quickly, but it was far harder for me to accept that I DIDN’T like men. I don’t know why but apparently that’s pretty common with lesbians. Compulsory heterosexuality (look it up) is a bitch. \n\nBut one memory I frequently go to as proof is my especially close relationship with my “best friends” and literally using one of her shirts as a pillowcase, vis a vis Jenny by Studio Killers. Also, having sex with a woman for the first time and all my fears melting away once I got lost in the moment. I can’t fathom being intimate with a man without feelings of extreme anxiety and nausea (no offense gents, you’re all great!! This is a me problem, not you!)",
   "created_utc": 1692085131,
   "score": 165,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw93gpt",
   "message": "Losing my virginity at 15 to a girl one grade above me.\n\nThat brand new, never-before-felt, sensation of a warm, wet, \\[lady-bit\\] sliding onto my \\[man-bit\\] could not be explained with words. It's like everything sexy about a girl merging together into a force that feeds directly on your attraction.\n\nIt's fucking electric. That sexy feminine vibe is now a raw feeling and the idea that they're trying to coax your cum out of you because they want it-- because they want you? --- ***oh my god***.\n\nThere was no mistaking it or going any other way.",
   "created_utc": 1692081510,
   "score": 102,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw98jel",
   "message": "Looked at a hot girl, boner. Looked at a hot guy, boner.\n\nThat's pretty easy boner math.",
   "created_utc": 1692085310,
   "score": 93,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw96gk7",
   "message": "I just love women, they give me happy feelings even if there’s no sexual tension and nobody is trying to flirt with anyone.\n\nI have interacted with homosexual men here and there and some have tried to flirt with me but the latter felt just kinda unpleasant. Not hating on homosexuals but me doing intimate things with a man just doesn’t compute.",
   "created_utc": 1692083717,
   "score": 91,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9831l",
   "message": "Saw boobs, pp hard. Not complicated",
   "created_utc": 1692084961,
   "score": 57,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw96tvn",
   "message": "I tried men and women. Several times. Just to be sure because I was never like omg ew gay. When most 13 year olds around me at the time were. \nI'm a curious soul. \nAnd I have never ever ever felt for a man the things I feel for women.\nHowever I haven't explored with any other letters of the rainbow Mafia yet, if I'll ever have that opportunity I'm not sure. I've always been curious about it. So I guess I'm pansexual.",
   "created_utc": 1692084001,
   "score": 70,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw957mp",
   "message": "I never cared about what the outside looked like or what was going on down there. I was never attracted to anything physically.\n\n\u0026amp;#x200B;\n\nWho they were as a person was all that mattered to me.",
   "created_utc": 1692082788,
   "score": 103,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw91cjm",
   "message": "When i got off birth control and had sex with someone more experienced. Then i realised this whole sex thing isn’t for me.",
   "created_utc": 1692079980,
   "score": 155,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw96cw7",
   "message": "When I was in middle school I got in an argument with my gay friend that it was odd to give yourself a label when I thought you could potentially be attracted to anyone if they were attractive enough. Eventually after a lot of discussion I came to the conclusion that if that’s the way I see people, mayhaps I’m pansexual. A few good years of experience later I realized it was true and as soon as I had that label to give myself, to feel like “part” of the LGBTQ+ community, it actually made me feel really good and positively affirmed.",
   "created_utc": 1692083639,
   "score": 140,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9d94n",
   "message": "Met someone who was Ace. Never even considered it as an option before that. I just experienced aesthetic attraction to both men and women so I just thought I was Bi. Now I am out as Ace and in a Ace relationship. It's nice to be able to be romantic without the pressure of having to provide wild sex hanging above everything.",
   "created_utc": 1692089002,
   "score": 49,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9lb8d",
   "message": "A beautiful lady ---\u0026gt; Waaaah 🤩\nA handsome man ---\u0026gt; Waaaah 🤩\n\nCan I live my life with a lady : yes\nCan I live my life with a man : yes\n\nSo if you ask me how I'm doing\nHere is my reply :\nI'm gettin' bi",
   "created_utc": 1692095054,
   "score": 56,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw93p02",
   "message": "I never had that need to explore my sexuality I see a lot of people have, because I have only ever felt attracted to men. I’ve had women come up to me, but I have never even felt curious, I just don’t feel attracted to them. I guess that makes me straight.",
   "created_utc": 1692081678,
   "score": 25,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9b45q",
   "message": "Never had to question it. At a certain age girls just suddenly seemed very interesting.",
   "created_utc": 1692087317,
   "score": 23,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9cgn8",
   "message": "Well I was walking down the street one day thinking to myself “huh, I guess people can be attractive no matter what gender they are” and that’s really all the thought I ever put into it",
   "created_utc": 1692088376,
   "score": 25,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9igvq",
   "message": "I'm gay and grew up in a small, christian, village. So being openly gay was not really an option. I first realized that I liked man at the tender age of 12 while watching The Mummy with Brendan Fraser for the first time. Everyone was talking about Rachel Weisz and I was always thinking \"She's pretty but... Did you see that guy?!\". Then things moved back into the shadow thanks to some religious brainwashing and witnessing how my best friend was send away to one of these \"healing camps\" for just mentioning that he things he is gay, when we were 16.\n\nSo I bottled it up. Dated a couple of girls, later woman. Never was really into any of them. And I'm still to this day really sorry that I wasted their time. I completely closed that chapter when I moved to a big city and was finally able to explore myself without the fear of the entire village finding out and talking. I was 24 and had finally a feeling of knowing who I am and where I belong.",
   "created_utc": 1692093000,
   "score": 23,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jwa8454",
   "message": "The thought process was:\n\n- Well girls like boys so I’m straight.\n- Hang on, the thought of dating my female best friend is appealing to me. I’m bi?\n- But I don’t want to have sex with her, and I guess I don’t really want to have sex with guys either, so biromantic asexual?\n- *after every date with a guy* Man that was so awkward and uncomfy, either I’m just an awkward person or maybe I’m demiromantic?\n- *first date with a woman* OH.",
   "created_utc": 1692106819,
   "score": 26,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9eeqf",
   "message": "When I was a teen I questioned it because I thought that even thinking some men are attractive made you gay. But I later realized that I didn't want to been physical or romantic with men at all, I actually am kinda repulsed by the idea of naked guys, I simply liked they way they looked. Same way I look at a car or something else that is aesthetically pleasing. But with women I want to experience them physically, emotionally, \u0026amp; intimately. I want to be with a woman, I don't want to be with a man in any way. So that's when I understood I'm straight.",
   "created_utc": 1692089904,
   "score": 57,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9al8h",
   "message": "I believe in equal opportunities for *everything.* and I mean ***everything***",
   "created_utc": 1692086912,
   "score": 83,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9mdop",
   "message": "Honestly, I still haven’t. And that’s okay.",
   "created_utc": 1692095808,
   "score": 21,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw91ffw",
   "message": "As a kid seeing movies with female nudity and got a peek at that nice little triangle patch and boobs. Yeah I had to have em.",
   "created_utc": 1692080036,
   "score": 50,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9fv40",
   "message": "Accepting I was also attracted to women after years of suppressing crushes on friends and female celebrities. I think I kind of knew when I was 13 but clammed it up until I was 19 for a lot of reasons; I didn't want to say I was bi without being sure, I went to high school during the earlier part of the 2010s and while we had a GSA and live in a fairly liberal area, the biphpbia even in gay spaces is *still* pretty prevalent. I didn't want to come across as seeking attention and since I wasn't actively dating I just sat on it for six years. After that was just a lot of introspection and mentally shifting through hypotheticals.",
   "created_utc": 1692091020,
   "score": 17,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9beiz",
   "message": "I just knew as a young girl that I really liked boys. I had two older sisters and I loved it when they'd invite their boyfriends over! I would bother them and ask them questions.",
   "created_utc": 1692087543,
   "score": 18,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9eren",
   "message": "I am not concluded, I don't think I ever will. You don't need to categorize your sexual orientation with names.\n\nMy sexual orientation is \"I fuck who I am attracted to.\"",
   "created_utc": 1692090179,
   "score": 18,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9gk7h",
   "message": "I didn't feel something special with anyone and never had a crush for someone. I considered everyone as a close friend or I just knew them enough. Never thought in having kids or being with someone for the rest of my life. So I decided one day to know myself better and searched a definition for it. Let me tell you, I instantly knew that was me when I saw that sunset flag. Aro-ace is what I became and who I am now, and I like it.",
   "created_utc": 1692091550,
   "score": 16,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw98ivv",
   "message": "I haven't concluded anything yet and I'm 39. New and wonderful ways to experience other people are always out there",
   "created_utc": 1692085299,
   "score": 44,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9fuzq",
   "message": "so i saw this androgynous guy, and i thought he was a girl, and i was like, \"damn, shes hot as fuck\" and then i found out he was a guy and i was like \"damn.... *shrug*\"",
   "created_utc": 1692091017,
   "score": 15,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9jt2a",
   "message": "Just knew. Never questioned if I'm straight. As I said in another comment, it's different if you're never questioned or told you're wrong for loving someone. It's sad to hear the stories the community has about all of it.",
   "created_utc": 1692093984,
   "score": 13,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9o418",
   "message": "I know I'm bisexual with a male lean. \n\nI know this cause I can fuck other dudes, and women, but I can't fall in love with women. Only other men.",
   "created_utc": 1692096953,
   "score": 29,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9eipt",
   "message": "Trial and (an awful lot of) error.",
   "created_utc": 1692089991,
   "score": 13,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9k1js",
   "message": "I fell in love with a man who transitioned.  After I'd come to terms with \"losing\" my lover, I realised that I still loved her just as much as I'd ever loved him, and that was that, my pansexual orientation was born.",
   "created_utc": 1692094152,
   "score": 13,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9msoi",
   "message": "when I was 9 years old looking up \"woman boobs\" on google",
   "created_utc": 1692096091,
   "score": 15,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9jlrw",
   "message": "I wanna bang everyone in my age bracket, I’m bi.",
   "created_utc": 1692093837,
   "score": 12,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9mlfp",
   "message": "I always thought women were attractive but then I started thinking that guys were also attractive. Had a friend that was gay and asked if he wanted to mess around. Turns out I am very much not gay. You never now how gay you’re not until there’s another dudes dick in your hand.  I’ve never seen my dick less interested in something, never know until you try.",
   "created_utc": 1692095956,
   "score": 15,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw98sen",
   "message": "I wasn’t really attracted to people unless I was friends with them and knew them. Didn’t realize what it was until years later when I did more research in college.",
   "created_utc": 1692085504,
   "score": 23,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9c9km",
   "message": "I like basically everything, especially if it’s more feminine, and I like looking a bit more feminine, so I am femboy, who likes femboys and women primarily",
   "created_utc": 1692088220,
   "score": 29,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9djuw",
   "message": "After countless relationships and 2 failed marriages, I can say with some confidence I am asexual. My 2nd wife really helped me to understand and accept this about myself.",
   "created_utc": 1692089236,
   "score": 26,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9dxrs",
   "message": "When I was a kid, one day in 8th grade Math class, It was any other ordinary day. Except that day Danny walked in. And I didn’t understand why, but him walking in REALLY interested me. And I just started noticing him. Before that day Danny was just another face in the crowd, after that day seeing him became what I looked forward to every single day. He sat two seats ahead of me and one seat to the left. I use to watch him draw and just think he is so talented and amazing and I also really liked his face, and his clothes. And he’s also really funny. And just really cool.\n\nI wanted to hang around him and I made great effort to. Looking back I cringe but I smile because it was cute and innocent.",
   "created_utc": 1692089537,
   "score": 30,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9jt54",
   "message": "Not something I thought about much. Had crushes on boys most of my life until I was around 13. Was at an overnight camp and found myself very attracted to one of the girls. Smelled her bra when she went to take a shower(yep kinda creepo vibes).\n\nI dated a lot of men for a while, and am now single and somehow am finding women much much more attractive and appealing then men. \n\nI now happily identify as bi.",
   "created_utc": 1692093986,
   "score": 20,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9tu88",
   "message": "If you're asking for insight to better understand others that are different from you, I think you've gotten plenty of great responses already. \n\nHowever, if you're looking for info relating to your own definition of sexuality, then I want to STRONGLY impress upon you that there isn't actually any need to define yourself with labels. Society is really obsessed with putting people into categories to better understand them. You don't have to do that. It's totally fine (and I feel really healthy) to just  experience life as it comes. \n\nMy mom is 65+, 3 previous hetero marriages, and has recently found a girlfriend. It doesn't mean she's been gay the whole time. It doesn't mean she's straight and acting out. She's just in love, and that's great.",
   "created_utc": 1692100317,
   "score": 20,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9i9jb",
   "message": "I can tolerate sex with a guy, it’s not bad but I rarely finish. But with a woman? Whole different thing. I actually physically and mentally enjoy it on every level. I’m also drawn to physical affection with women outside of sex. I want to hold their hand and run my fingers through their hair",
   "created_utc": 1692092848,
   "score": 11,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9it9k",
   "message": "I like my bestfriend -\u0026gt; I like girls -\u0026gt; bi?? -\u0026gt; I've never been attracted to a man -\u0026gt; lesbian 👍",
   "created_utc": 1692093254,
   "score": 9,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9ea4t",
   "message": "I've never been interested in sex or being in a relationship, did some research, and figured I was asexual",
   "created_utc": 1692089805,
   "score": 16,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9f5et",
   "message": "people of any gender are just really fucking pretty",
   "created_utc": 1692090476,
   "score": 8,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9jiub",
   "message": "I always felt like being bisexual, but I never accepted it, until one day I just said fuck it, and accepted myself",
   "created_utc": 1692093778,
   "score": 8,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9n9fa",
   "message": "Biology? Anatomy? Nature? Instincts? Also I saw a picture of your mom",
   "created_utc": 1692096402,
   "score": 6,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9cnts",
   "message": "vi from arcane. that is all i will say",
   "created_utc": 1692088532,
   "score": 16,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9eean",
   "message": "Friend asked me out of the blue, “Hey, have you ever wondered if you’re bi?”\n\nI had not, in fact, but did afterwards and soon realized I’m pan lmao.\n\nAsked my friend months later what prompted them to ask and they said, “You just spent a lot of time at movie night talking about Amanda Seyfried”",
   "created_utc": 1692089895,
   "score": 15,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9h705",
   "message": "I never wanted to cuddle all the guys I fucked, so obviously I'm 100% straight.",
   "created_utc": 1692092037,
   "score": 14,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw92t7x",
   "message": "Lea Thompson in Back to the Future when I was 6 or 7 confirmed that I was into women",
   "created_utc": 1692081035,
   "score": 8,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9bw5m",
   "message": "When i made out with a guy drunk af at a club and didn’t realise until the next day.. when I didn’t really care I knew I was bi",
   "created_utc": 1692087921,
   "score": 6,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jwaelx4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jw9d8s4",
   "message": "I’m a bisexual female in my 30s and I had inklings of it with a friend of mine in HS. I was in a little all female friend group, but I remember thinking she had cherry colored lips you would die to kiss or kiss to die! Never kissed her but the color of her lips in my heart are unmatched",
   "created_utc": 1692088994,
   "score": 10,
   "submission_id": "15rk0vs"
  },
  {
   "comment_id": "jwclm3d",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15rk0vs"
  }
 ]
}