{
 "submission_id": "15rnu3e",
 "title": "People who have been fat and then became fit, what advice would you give to someone who is just starting to diet and lose weight?",
 "selftext": "",
 "created_utc": 1692092153,
 "permalink": "/r/AskReddit/comments/15rnu3e/people_who_have_been_fat_and_then_became_fit_what/",
 "score": 69,
 "url": "https://www.reddit.com/r/AskReddit/comments/15rnu3e/people_who_have_been_fat_and_then_became_fit_what/",
 "comments": [
  {
   "comment_id": "jw9ia14",
   "message": "Don’t think of it as a diet.  It got to be a whole life change.  Also remember when it comes to  exercise, what works for one person may not work for you.  Try different things, find what you like.",
   "created_utc": 1692092859,
   "score": 33,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9nbml",
   "message": "Pay attention to portion sizes.\n\nLearn to tell the difference between true hunger, thirst, and boredom/emotional eating. \n\nDon't expect to be able to run a marathon right away. Start with what exercise you can handle, even if it's just walking a few dozen yards and back. Work your way up.",
   "created_utc": 1692096442,
   "score": 169,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9ngmn",
   "message": "Go to the subreddit page Loseit. \n\n\nNo gimmicks, no costs, no meds or special items except for a bathroom scale and a food scale. \n\nLots of help, good advice, and positive support. \n\nYou got this! You can do it!",
   "created_utc": 1692096534,
   "score": 232,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9qj26",
   "message": "Keep at it and don't expect miracles. It's not \"a diet\". It's \"a new lifestyle\". Try to lose around 500 grams a week. Don't crash diet because you'll yoyo right back up to your previous weight.\n\nAnd seriously: think in the span of years. Not months. Losing weight and getting fit doesn't have an end station but rather it's a journey. It's corny I know but you'll never be done.",
   "created_utc": 1692098430,
   "score": 71,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9mbmv",
   "message": "It gets easier. You eventually stop craving the bad stuff to the point that you’ll turn down a free pizza in front of you.\n\nAlso,\n**DON’T DRINK YOUR CALORIES**\n\nEdit: In case anyone needs some extra motivation today. I used to get pizza nearly every day after school. Now I’ve just finished a 4km run and I’m looking forward to a bowl of yogurt with oats when I get home. It gets easier.",
   "created_utc": 1692095768,
   "score": 91,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9lgvp",
   "message": "Find the workout routine that you enjoy and can stick to. Fitness is a skill, you’re not going to be great right away but consistency is the key to success. \n\nDon’t drink you calories, no soda, alcohol, sweetened drinks. \n\nAvoid processed foods. \n\nI lost 110lbs over the course of 4 years, it started with easy lifestyle changes, small diet adjustments, then introducing light exercise. To the point now where I eat almost only whole foods with the occasional cheat, and I exercise daily, I used to weigh 260lbs, and now I have a 6 pack. It’s not easy, but it is simple.",
   "created_utc": 1692095169,
   "score": 36,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9ijgt",
   "message": "Stick with it and take pictures.\n\nIt will take some time and you might not see the changes by looking at yourself in the mirror.\n\nDrink water and cut the booze.\n\nMealprep and count your calories.\n\nLots of protein in your meals with at least 100g a day.\n\nTry intermittent fasting.",
   "created_utc": 1692093053,
   "score": 147,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9odbd",
   "message": "Consistency, consistency, consistency.",
   "created_utc": 1692097116,
   "score": 25,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9nqoy",
   "message": "You've got to take it one step at a time. \n\n* Exercise is very important. Start slow. Maybe 15 minutes, 3 times a week. Just walking, or resistance training. If you have no equipment, yoga/body weight training will work too. \n* After you get in the rhythm of exercising regularly, then we can look at drinks. Trade out full sugar for zero/low cal. Try to drink more water. \n* Make small adjustments. Eat when you are hungry, not when you're bored or stressed. High volume low cal can help. Protein is a winner, it helps maintain muscle and also takes more calories to consume. Greek yogurt, cheese, fruits and veggies can be great sources of protein. Powder can help fill in gaps but isn't needed. \n* Do not feel guilty if you stumble/fall. Just get back to what you are doing and keep at it. One bad day will not ruin you. Fat is not easily lost but it's also not easily gained. \n* Make sure this is something you actually want. Weight loss is a huge commitment. If you are weighing yourself, make sure it's in the mornings, before breakfast. Also understand that weight will fluctuate even when in a calorie deficit, water weight can be very misleading.\n\nWeight loss can be very hard. The most important factors are discipline and motivation. You really need to ease yourself into it, though. If you find that you can't restrict your calories as much as you'd like, intermittent fasting is a solid option. 16/8 is popular, although I also don't mind one 24 hour low-cal period (max 500 cals) per week.",
   "created_utc": 1692096715,
   "score": 89,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9pce6",
   "message": "The best way to lose weight is to do it slowly by making small, achievable changes to your eating and physical activity habits. You may like to set yourself one or 2 small changes to work on at a time, only adding to these once these have become your new way of life.",
   "created_utc": 1692097719,
   "score": 16,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9rd0n",
   "message": "When it comes to weight loss, diet is far more important than exercise. Change in diet will make you loose weight. Change in exercise while remaining the same diet probably won’t. Combining both is obviously best.\n\nEdit: spelling",
   "created_utc": 1692098920,
   "score": 55,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9lhtt",
   "message": "All things in moderation, including exercise. Like overdoing exercise can hurt you.",
   "created_utc": 1692095188,
   "score": 10,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9t4gz",
   "message": "I only lost weight once I started writing down everything I ate. Because I would forget all those little snacks throughout the day, but seeing them written down I could properly count calories.\n\nThen I found foods I could eat every day that I could enjoy and feel full. My go to was a large salad with Thai spicy tuna and feta cheese. Measure everything you add.",
   "created_utc": 1692099924,
   "score": 10,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwa4b5o",
   "message": "Throw out your scale and just go off of how you look like in pictures and full length mirrors.\n\n80% of weight loss comes from what you put in your mouth. While exercise does help increase your metabolism, you need to be running at a caloric deficit in order for the pounds to come off.\n\nWater and sleep are your weight loss friends. Get plenty of both.\n\nYou're committing yourself to a new lifestyle. Not a diet. After you lose the weight you want to make sure it stays off.\n\nGive yourself 1 cheat meal per week which you can indulge a bit in your favorite less healthy foods like pizza, burgers, fries, pasta, etc. Not only does this cheat meal give you something to work towards each week, it actually helps keep your metabolism elevated across you weight loss journey. But be warned - still eat reasonable portions here and don't eat to excess.",
   "created_utc": 1692105202,
   "score": 10,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9jwfe",
   "message": "Make it a habit, not a phase.",
   "created_utc": 1692094050,
   "score": 8,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9sz8g",
   "message": "Don’t focus on breaking bad habits focus on making new ones 😊 \n\nI stopped thinking oh I mustn’t do that / eat that .. and started creating healthy habits and focusing on doing them and slowly but surly those bad habits just faded out",
   "created_utc": 1692099841,
   "score": 7,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwa50zu",
   "message": "Three things. First, do it for you. Don’t do it to get a BF/GF, or anything like that. Don’t cheapen your accomplishments by making them for someone else. The people who will only like you when you’re skinny and not when you’re a bit chunky are shallow people and you don’t need that shit in your life.\n\nNumber two, don’t go overboard. Your body has a level that it likes, and it’s hard to break that wall. Personally, I can gain and lose weight easily, but once my body hits 175, it becomes really hard to lose any more than that, so I don’t force it.\n\nThree, find something you think you’ll enjoy and use that as your workout. Swimming, biking, martial arts, etc. If you enjoy it, you’ll have fun and lose weight.",
   "created_utc": 1692105507,
   "score": 8,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9pp0g",
   "message": "I'd say try to start understanding your body, it's needs and urges. The sugar craving that you might get from being accustomed to consuming a lot of refined sugar is very different from the craving that you get from looking at a nice piece of meat for example.\n\nLearning to identify the sugar cravings for what they are, and feeling much better when fulfilling all the other needs is what made me consistent in staying away from it, maybe it could help you too.",
   "created_utc": 1692097933,
   "score": 6,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9pfjs",
   "message": "Find an exercise you like..Many find the gym boring but enjoy bike riding, skating, hockey etc..there's a fun physical activity for you, just have to find it",
   "created_utc": 1692097772,
   "score": 6,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwa98wz",
   "message": "A food diary turned the tide for me. I used the My Fitness Pal app.",
   "created_utc": 1692107292,
   "score": 10,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9sx90",
   "message": "Heey OP, it is very simple. Do it in these steps and stop going to the gym in the beginning, because you need to focus at one thing at a time.\n\nMost important from 1 till :\n\n1. Diet, get your BMR calories in every day for 1 month. See a Dietist or gym with a balanced diet of: Veggies, protein, carbs and fats.\n2. Start cutting away 500 calories of that diet to stay in a deficit. Stay consistent on the diet for atleast 1 month without training.\n3. Start lifting weights with a 500 calories deficit. Start doing a training like Push/Pull/Legs/Rest/Push/Pull/Legs/Rest\n4. Cardio: Do like 5 minutes of crosstrainer warmup and 15 minutes after the weightlifting.\n5. Start improving your weight lifting journey: Start every day that you workout with a compound excercise.\n6. After you have cut of the fat that you want you should set a goal of improving PR's and start to eat at BMR or above to bulk a little for some more muscle.\n7. Do not worry about motivation because that comes and goes. Go to the gym even if you do not feel like it. That is when you realize you have to do things in life that you do not feel like or enjoy but still have to do. You can be lazy, but then you should not start this journey.\n\n\u0026amp;#x200B;\n\nPro tip: QUIT Alcohol or you might never see any results and get a scale to weigh every morning when you wake up: Wakeup \u0026gt; Toilet \u0026gt; Scale. I have a scale (€26,-) that has a app called \"Fitdays\". It shows me all my progress on the scale. The fat % might not be so accurate but it does keep your weight in the app. Just do it every morning when you wakeup, even if you don't feel like it. Also buy a food scale.\n\n\u0026amp;#x200B;\n\nThis whole journey will take you at least a few years to get all the ropes, but the diet you can start today. Start with that and focus on nothing else because losing weight is 100% staying consistent in your eating habits.",
   "created_utc": 1692099810,
   "score": 5,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwad9es",
   "message": "Drop sugar to special occasions. Intermittent fasting every day. That simple for me",
   "created_utc": 1692108908,
   "score": 6,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9ojt4",
   "message": "Don't jump straight onto these prescribed diets by fitness websites, if you go from McDonald's to Kale smoothies you'll be absolutely miserable, the easiest thing to change for a start is portion sizes and activity levels.\n\nI started going for a walk every day and eating smaller portions of every meal, I did that for a solid month before ever setting foot in a gym. I wasn't really changing much about my life, I was moving more and eating less without doing a hardcore training routine and diet and it made a difference, I also started buying audio books so that my walking time became book time and I had something else to look forward to.\n\nBy taking it slow for a month I wasn't turning my whole life upside down and I felt much better and healthier, I also lost a decent amount of weight so the results gave me motivation. I kept this up but introduced a couple of days in the gym per week and started to look at healthier foods over time, this is the best way, slow and consistent progress with manageable goals, you won't become the rock overnight so you don't need to start training like him, just take it slow and the changes will happen.",
   "created_utc": 1692097231,
   "score": 3,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwaijfe",
   "message": "Just because you missed a day, or a week, or even a month doesn’t mean “it’s ruined”. Pick up where you left off. Consistency",
   "created_utc": 1692110931,
   "score": 4,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwar9qt",
   "message": "90% of it is better eating habits.\n\nIf all I have in the fridge are carrots and humus, that's what I'm eating.\n\nDitch the empty calories of drinks, soft drinks or alcohol. Load up on water, keto or low glycemic snacks, like crunchy vegetables and hard proteins and meats.\n\nEat a good, but portioned breakfast. Snack 2-3 times in portion controlled ways until dinner and have a measured meal. You don't need to be hungry, if you snack smart\n\nMoving is important, but you really can't excercise yourself thin if you're overeating",
   "created_utc": 1692114101,
   "score": 4,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwarbzm",
   "message": "Brush your teeth after dinner.  Like 8pm so you aren’t tempted to snack because your teeth are already clean and it would be insane to brush again and even more insane to sleep with a dirty mouth.\n\nCutting out that late night snack (or two!) is an easy 1,500 calories week.  Which in itself can be 17 pounds a year.  (1 pound=3,500 calories).\n\nIf you find you go to bed too late and you can’t sleep because it is 2 AM and you’re actually hungry because you haven’t in 6 hours… I’m sorry to tell you you have to go to bed much earlier. 11pm, 12am max.  Your body needs that sleep.  No.  You don’t understand.  You NEED that sleep for your body to digest and metabolize properly and your brain to stop desiring absolutely shitty empty quick calories just to keep going because you’re just so tired.  Stop it.\n\nJust don’t buy those snacks.  Keep them out of the house and you won’t be tempted by them sinply because they are convenient.  Stop throwing away all your money on alcohol and fast food.\n\nMake a serving of fruit and vegetables for every meal and force yourself to eat those first so you are filled up with them and less likely to want to pound seconds or thirds and extra breads and things.\n\nIt is okay to say yes to junk food, just not every time.",
   "created_utc": 1692114124,
   "score": 5,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9odd5",
   "message": "walk more. move more. \navoid sugary foods/drinks\n\nthat's good for starters",
   "created_utc": 1692097117,
   "score": 3,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9qoh3",
   "message": "\rPeople need to understand that losing weight isn't primarily done in the gym, it's done in the kitchen. If you continue to overeat, you won't lose weight. Simple as that. You need to cut back on your calories, doing sports and going to the gym is just the cherry on top but definetly not needed for weight loss.\r  \n\r  \nCount your calories, don't cheat. And if you cheat, cut those calories on the next day. You need discipline, if you lack that you will never make it.\r  \n\r  \nAnd my tip: Don't go running for losing weight, go walking. You don't burn significantly more calories when running the same distance as compared to just walking it. So get your ass outside and go walk. Go on a stroll, walk wherever you can. Just be active. Worry about going to the gym later.",
   "created_utc": 1692098519,
   "score": 3,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9tvu6",
   "message": "1) bloodwork, full panel to see if there are any underlaying health issues.\n\n2) count/track your calories and basic macros.\n\n3) always eat in a deficit; doesn’t have to be huge.\n\n4) Dicipline - motivation comes and goes, it’s being disciplined and going for an apple instead of a snickers\n\n5) weight loss is food not the gym. You cant workoff a shit diet and calorie surplus.",
   "created_utc": 1692100341,
   "score": 3,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwa60ua",
   "message": "Be curious about what other powers you body possesses besides its ability to store fat.",
   "created_utc": 1692105920,
   "score": 3,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwa9j4n",
   "message": "Lost 40kg in 4 months (from 125kg to 85kg)\n\nThis is how I did it:\n\nStopped drinking entirely (especially beer) - but was still a smoker (no weed and I know dumb af but whatever, quitted years later)\n\nStarted working out (2-3 times a week, for about 1-2 hours, just cardio aka bycicle, walking on a treadmill, some light arm/leg exercises, planking etc.)\n\nCompletely turned over my eating habits:\n\nBreakfast - (bio, low sugar) yogurt, oatmeal, blueberries/fruits - gives you constant energy throughout the day (especially the oatmeal)\n\nLunch - 1 or 2 bananas or sometimes a salad\n\nDinner - (~300gr) rich salad (as extra some nuts, sometimes good ham \"sprinkles\" or cheese dices or even fruits) and 1-2 times during weekdays some light pasta/rice dish etc.\n\nIf I would crave sweets I would treat myself with a mini snickers bar (the one's that are as big as your thumb) but this was rather rarely the occasion. Whatever I ate out of my daily routine, I would always watch out to eat it for the luxury of the taste and not for the quantities. For example a small bowl of chips/crisps instead of the whole bag\n\nDrinking only water (except for the morning/lunch coffee - also reducing the milk/cream and sugar I put in it)\n\nWeekends were different. I would occasionally (!) eat a pizza or burgers or whatever, just keep an eye on portions and treat it as something special (as it should've been all along) don't hunger yourself until weekend to go on a food rampage. Everything in moderation.\n\nWhenever I went out with friends I would also occasionally drink a beer (or two but not get hammered etc.)\n\nBut in all that, what's already been pointed out several times, is the continuity and discipline. In the beginning it'll feel strange and you'll find yourself \"re-wiring\" but the longer it goes on, the more it becomes a routine (or you could even say a lifestyle)\n\nI just made one mistake in all of this which is easy to avoid if you know it before: if you have a (bigger) belly focus also at least ¼ of your training on exercising your core muscles otherwise you'll have that \"flesh lump\" I used to have",
   "created_utc": 1692107409,
   "score": 3,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwabse8",
   "message": "When you are fat and are running and you take your shirt off, you get a bunch of \"keep going man\" and \"doing good mate!\" from onlookers.\n\nOnce you are fit and you take your shirt off, you get a bunch of \"fucking tool\" and \"douchebag\" yelled at you instead.",
   "created_utc": 1692108321,
   "score": 3,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9r2ct",
   "message": "Exercise is free!!! I know it sounds daft so say but I didn't realize it in the beginning. I was always under the impression that I would have to join a gym subscription or spend money on books/equipment but you would be surprised at how much you can achieve with none of that. \nJust starting with implementing a walk everyday can  do wonders for your motivation and gets the ball rolling. \nAlso, YouTube has so much to offer in terms at home workouts with no/minimal equipment that can really whoop your ass.",
   "created_utc": 1692098745,
   "score": 4,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9jcmy",
   "message": "Strength training is very vital in your journey, if you don’t do it, you will become skinny and weak instead of it, all of your muscle under the fat will go.\n\nLose the weight slowly, that way you won’t lose ridiculous amounts of muscle and send your hormones crazy.\n\nYou don’t have to drain in your sweat, walking is the best way to burn calories and enjoy some outside peace.",
   "created_utc": 1692093652,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9om15",
   "message": "You can do it dude",
   "created_utc": 1692097270,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9s8r5",
   "message": "It probably took you years to become overweight. And if you start eating better and less it will be the same process, don't look for fast results,  just change your eating habits.",
   "created_utc": 1692099428,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9vdvq",
   "message": "Weigh yourself when you wake up \n\nBye bye beer and whisky (terrible for sleep and your cardiovascular system)\n\nIntermittent fasting is your friend \n\n... Finally....Fuck all those people who don't respect you and your efforts by not considering you (and your diet) when preparing meals, etc...",
   "created_utc": 1692101140,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwab12w",
   "message": "If you are a day where you absolutely don't want to work out go for a long walk. People underestimate simple walking. Another walking tip is multilevel malls or building if you have any near you. Use the stairs not the elevator or escalator while doing laps. NO FOOD COURT! Eat before you go if you have to.",
   "created_utc": 1692108018,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwacoop",
   "message": "first start eating healthy and start counting calories. Count honest especially those you drink. \n\nDo that for a couple of weeks and then start excersing. Don't start excersing right away. I will only give you excuse to eat more/unhealthy. No cheat days. Be consistent. You have to break your habbits first. \n\nCounting calories will help you to understand what to eat and what not. It is anoying but will help you to understand nutrition.",
   "created_utc": 1692108680,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwadgrz",
   "message": "Do not make perfect the enemy of good.  Live your life. If you're at a birthday party, have some cake. If you're out celebrating a milestone with friends, have a beer. These aren't everyday events and this isn't your everyday diet.\n\nThe everyday diet should be easy. Salads are easy. Oven-roasted chicken breast is easy. Instant pot beef chili is easy. Keeping fresh fruit on hand for snacks is easy.\n\nHeck, frozen meals are easy, though they probably aren't healthy or filling.",
   "created_utc": 1692108990,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwafm4m",
   "message": "Walking is the easiest way to start.",
   "created_utc": 1692109819,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwaijge",
   "message": "Cut way back on alcohol and soft drinks. Walk for an hour a day.",
   "created_utc": 1692110931,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwaosmb",
   "message": "get a calorie counting app and be honest\n\nalso - don’t get discouraged if the scale says you aren’t losing weight. you need to trust the process and wait until you have at least a month of data to see what’s happening\n\nsome weeks you weigh in and you can’t believe you lost that much. other weeks, you gain 2 pounds despite everything.\n\nbut really, a lot of the fluctuation is water weight or other factors, which is why you need to give it time to really see results",
   "created_utc": 1692113197,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwasauf",
   "message": "90% diet and 10% exercise.\n\nI lost 20kgs by getting enough steps in my day (8000-10,000), eating enough protein and being in a calorie deficit. I was still eating what I wanted but made smarter choices.",
   "created_utc": 1692114475,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwashzr",
   "message": "I’m only a couple of months into living a healthier lifestyle but number one was stopping drinking soft drinks everyday. Don’t underestimate the power of walking. After getting off of pop I started walking every night. Muscle burns more calories then fat head over to r/fitness and look at their wiki on beginner strength training. I personally recommend taking baby steps and easing into a healthier lifestyle building good habits.",
   "created_utc": 1692114545,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwaxztp",
   "message": "Eat less, move more.\n\nDon’t “diet”, instead CHANGE your diet. Improve how you eat, it helps immensely.",
   "created_utc": 1692116503,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwbbv41",
   "message": "Once you have weighed yourself initially, and planned your calorie deficit accordingly, do not concentrate on the weight of the scale thereafter, just concentrate on making progress in your performance of the physical activity of choice. Such as lifting heavier, running further/faster or whatever you are doing. This is because you can build substantial amounts of muscle mass in the first few months, even year, of working out. Muscle is dense ans heavy, so the lack of weightloss could discourage you.\n\nA good secondary indicator is how your clothes start to fit differently, you may find yourself needing to tighten your belt, or that shirts will start feeling loose at the belly and tighter at the shoulders. These are good signs you are doing the right thing and making good progress.\n\nDont concentrate too much on your daily calorie intake: its the weekly/monthly/yearly average that matters. If you do your shopping everyweek, just make sure you eat everything and nothing more. This can result in you overeating by 100kcals one day, but gets balanced out by eatingg less another day, and it makes it so much easier to follow a diet than concentrating on it every day.\n\nOnce a month, treat yourself, have 1 meal where you eat whatever you want, consider it a treat for having been good the whole month, and it gives you something to look forward to every month and can help motovate you to stay on track.\n\nDont try to lose weight too fast, it can cause an upset stomach, can leave you with a lot more excess skin, and is less sustainable than gradual change.\n\nIf you can afford it, get a personal traiber once or twice a week, they can help you ensure you exercise appropriately and can usually help with some nuances of your diet that an internet stranger can't.\n\nHope this helps, beat of luck!",
   "created_utc": 1692121603,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwbccb6",
   "message": "You have to eat less calories than you're burning daily. There's no diet or workout that does anything for you that's breaking those rules. Going to the gym can help you burn calories and diets, all just coincidentally make people eat less calories.",
   "created_utc": 1692121773,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwbcz8d",
   "message": "Try out long cardio exercises like running for an hour or so. It might excite you. And remember, the main factor is what you eat.",
   "created_utc": 1692121996,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwbf91c",
   "message": "Change your lifestyle not your diet. Smaller portions, regular movement. Don't snack too often. Replace unhealthy food with healthy but yummy meals. Don't quit any food completely. Focus more on reducing it.",
   "created_utc": 1692122808,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwbgoxg",
   "message": "Focus on your diet. Exercise is a nice little bonus, but you won't lose weight if you don't fix your diet.\n\nAlso : more lean protein.",
   "created_utc": 1692123323,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwbh23s",
   "message": "Taking up a sport, team sports are good or running is very accessible especially if you join a local club.  \n\n\nEventually you will stop seeing it as I am doing x to lose weight and will start seeing it as I am doing x to get better at something I am passionate about.\n\n\u0026amp;#x200B;\n\nRunning is also good as the first milestones are easy example : first 5k, first 10k etc, after these as you get better you start beating your old times and hitting new milestones first 5k under 30 mins etc.",
   "created_utc": 1692123455,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwbjfaa",
   "message": "Your diet is more important then exercise. Don’t get me wrong exercise is very important but diet is more important. You could workout for 3 hours a day but that wouldn’t do any good if you go home and eat a bunch of high calorie or foods with high sugar content. I think you have to find a healthy balance. Also if you don’t like going to the gym no wonder you stop going. You have to try to find exercises that you enjoy doing. For me I like to go for bike rides gets me moving and gets me out of the house. Try to find things that are healthy to eat and that you enjoy eating and try to find exercises that you enjoy doing. Hope everything goes well for you!",
   "created_utc": 1692124296,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwbpmld",
   "message": "Go for long walks instead of the gym. Don’t consume any sugar especially from soda or juice. Most fruits that aren’t berries are full of sugar. Try not to go on a diet. Instead focus on eating healthy things. Meat, vegetables, berries, nuts etc. Don’t make a big deal out of each meal.",
   "created_utc": 1692126496,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwbur9s",
   "message": "Tracking calories is the way, I found it's easier to stick to them when you can see how much you're eating. It's good also to just find lower calorie alternatives to your favourite foods, and a higher protein diet helps you feel filler for longer.",
   "created_utc": 1692128311,
   "score": 1,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwbx71b",
   "message": "Don’t start and exercise regimen at the same time as beginning a new diet! \n\nLosing weight is 90% diet. Start losing weight by changing your diet and relearn your body’s hunger cues. If you start exercising then you will be hungrier than ever and will struggle to eat less.",
   "created_utc": 1692129173,
   "score": 1,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9v4k4",
   "message": "In reality the only way to lose weight is to consume fewer calories. Calories in calories out. There are no magic diets, they all work the same by consuming fewer calories. Fuck anyone who says otherwise. They are wrong \n\nTrack what you eat now for a week. Get an average on how many calories you are eating now. You have to eat less than that. Start by eating 200 calories less. If you lose weight great keep those calories. If not subtract another 100.\n\nAs for exercise the more exercise you do the more calories you burn. Try to find any activity at all you like.",
   "created_utc": 1692101003,
   "score": 5,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9lam1",
   "message": "Try to walk stairs instead of taking lifts when you can",
   "created_utc": 1692095043,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwabq8g",
   "message": "I’m 5’6 male and weighed 245lbs. On 1 April I decided enough was enough. I’m fairly stocky so wasn’t just fat but my biggest tip to you is diet is 85% of it and exercise and consistency is the rest. \n\nI ate the same thing for 3 months without exception and by doing so, quit drinking alcohol and full fat coke. \n\n1650 calories a day. \n\nPorridge with water and 2 scrambled eggs in the microwave for breakfast and 1 espresso. \n\n1 ribeye steak and mushrooms fried in olive oil with a dab of butter. 1 medium potato baby corn and green beans for dinner. \n\nWater but mainly Coke Zero for drinks. \n\nI walked the dog for 30 mins before breakfast and 1 hour at 4pm after work everyday, ensuring 10000 steps per day. \n\nI lost 14lbs after two weeks and by 2.5 months I was at 200lbs. \n\nThe steak every day was really satiating and I never felt hungry. If I did start to feel it, I would go to bed early. I was always in bed by 9pm. \n\nI have weights and a bench in my garden as I used to be into lifting. I did t have to do any resistance training at all. Just the walking and staying in calorie deficit. \n\nThen I hit a wall and didn’t lose any further. But I stuck with the meal plan and reduced the steps to 5000 a day and have had chocolate and cashew nuts in bed for the last couple weeks and weight has maintained. \n\nNow I’m gonna cut that shit out and increase the steps again and introduce some resistance training to try and lose another 14lbs and my remaining belly. I’ve also started cold showers to see if this has the benefits claimed in changing fat cells and calorie burning through body temp changes. \n\nIt’s been amazing. Belt buckle down 4 notches, clothes fit again, back ache gone, sleep is uninterrupted and I am fresh all day now. Having a prime ribeye everyday meant I always had something to look forward to and so I didn’t feel the need to ‘cheat’ with shit junk food or takeaway, as I already felt like I was cheating everyday. \n\nI hope this helps and Good luck with your attempt.",
   "created_utc": 1692108297,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9igsq",
   "message": "Sugar and salt are addictive... if it's that bad, you may need to treat it with therapy.\nThe drive to get fit depends on you and your willpower... Never quit.",
   "created_utc": 1692092999,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9nodi",
   "message": "Look in the mirror before eating. Lots of mirrors everywhere.",
   "created_utc": 1692096673,
   "score": 2,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwajj1h",
   "message": "Thank you so much everyone for the genuine help and suggestions! \n\nJust woke up and saw this post has received so much attention!!\n\nThanks a ton!",
   "created_utc": 1692111301,
   "score": 1,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9l1ku",
   "message": "Join a gym",
   "created_utc": 1692094868,
   "score": 0,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9odi4",
   "message": "This could lead to other issues but coffee, cigarettes and cocaine will do it",
   "created_utc": 1692097119,
   "score": 254,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwa4rvi",
   "message": "Stop being afraid of sufering. Stop waiting for a solution that will make things easy, the food tasty, the exercise painless. Eat the horrible food, do the cardio, lift the weights. If you renounce all source of food related pleasure and embrace the pain, in 4 months you'll be a diferent person.\n\nWith this mentality I was loosing 1kg per week. It works. But you cant be depending on your motivation, on outside support or on some program to do the heavy lifting for you. You have to do it even when you don't want to, even when you feel like shit. The truth is, you're alone in this because that's the only way it can really work.",
   "created_utc": 1692105407,
   "score": 0,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwak5g0",
   "message": "Try a ketogenic diet, or at minimum cut carbs, mainly sugar and grains. You’ll drop weight fast if you do this, exercise or not.",
   "created_utc": 1692111534,
   "score": 0,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9hkcz",
   "message": "Be active and hydrate.\n\nNo bread or sugar before lunch.\n\nNo solid food 3 hours before bedtime.",
   "created_utc": 1692092323,
   "score": 250,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9jnv3",
   "message": "No food before bedtime, exercise daily and vigorously. Eat at a calorie deficit (one big meal at dinner and a small lunch). It’s important to allow yourself to have something like a snack you love or a soda to prevent complete demotivating yourself. If you like soda have one can every other day or so. A healthy snack is popcorn with little to no salt or butter",
   "created_utc": 1692093879,
   "score": 253,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9wkn2",
   "message": "I was no fat but my advice is “discipline”\nGood luck 🍀",
   "created_utc": 1692101752,
   "score": 255,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jw9rpbt",
   "message": "Check out kinobody on youtube.",
   "created_utc": 1692099119,
   "score": 0,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwbpdvz",
   "message": "Very basic but don't give up, I always felt like I wanted to quit and just live with it, but I kept going and now I'm jacked. \n\nP.S. if your a guy, think of all the babes you'll get lmao",
   "created_utc": 1692126411,
   "score": 0,
   "submission_id": "15rnu3e"
  },
  {
   "comment_id": "jwat634",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15rnu3e"
  }
 ]
}