{
 "submission_id": "15rtakt",
 "title": "Where is the worst place to have diarrhea?",
 "selftext": "",
 "created_utc": 1692107375,
 "permalink": "/r/AskReddit/comments/15rtakt/where_is_the_worst_place_to_have_diarrhea/",
 "score": 76,
 "url": "https://www.reddit.com/r/AskReddit/comments/15rtakt/where_is_the_worst_place_to_have_diarrhea/",
 "comments": [
  {
   "comment_id": "jwabw8u",
   "message": "Stuck in traffic.  \n\nDefinitely not from personal experience.",
   "created_utc": 1692108364,
   "score": 34,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwa9jm1",
   "message": "Your own wedding",
   "created_utc": 1692107414,
   "score": 52,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwa9vyd",
   "message": "Rollercoaster 🎢",
   "created_utc": 1692107554,
   "score": 97,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwagfvu",
   "message": "Can confirm the worst place to have diarrhea is on the top of a mountain with your best friends and VERY SOON to be fiancé. I had to run away, hide, shit my brains out off the side of a mountain, wipe with leaves quickly cause people start calling my name wondering where I am. I finally yell out that I'm okay and I'm just \"peeing\". I go back with everyone and my bf gets down on one knee to propose to me. Little did he and everyone know I had just unloaded on that mountain from my butthole. I still said yes.\n\nEdit: This BLEW up. Ha. Thanks everyone for the hilarious poop anecdotes and encouraging words!",
   "created_utc": 1692110139,
   "score": 67,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwa9nf5",
   "message": "Anywhere that’s not your own home\n\nEdit: I beg you all to please stop telling me about your diarrhea stories😭",
   "created_utc": 1692107458,
   "score": 19,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwa9x1b",
   "message": "your pants",
   "created_utc": 1692107566,
   "score": 123,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwaoeh1",
   "message": "I’ll tell you from personal experience. The worst place is on a 24 hour international bus ride with only one stop.",
   "created_utc": 1692113052,
   "score": 29,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwaddxr",
   "message": "Airplane and you're the only pilot",
   "created_utc": 1692108959,
   "score": 182,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwabnz2",
   "message": "On a plane during a long flight.",
   "created_utc": 1692108272,
   "score": 129,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwamygd",
   "message": "In a 5 man submarine.",
   "created_utc": 1692112526,
   "score": 162,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jway83q",
   "message": "My worst was Morocco.\n\nHorrendous fever for two nights and days, in an extremely heavy sleep whilst shivering/sweating getting up every half hour. Lifting the heavy, square metal lid off the floor in the courtyard to expose the well and at least a bazillion scuttling cockroaches.\n\nLower the bucket, fill it with water. Hobble off to the hole in the ground. Aim my bare ass at the hole and spray the area. Wash and clean everything including myself.\n\nShuffle back to the mattress on the floor. Fall into incredibly heavy sleep whilst shivering/sweating for about 30 minutes and repeat.\n\nEach time felt like I'd been asleep for hours so the first night seemed to last about two weeks. Damn, I was so ill I think I managed to get jet-lagged in a house!",
   "created_utc": 1692116592,
   "score": 142,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwa9j5p",
   "message": "Probably at a porn shoot with an anal scene.",
   "created_utc": 1692107409,
   "score": 24,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwa9zn5",
   "message": "In outer space, right in the suit 🚀",
   "created_utc": 1692107595,
   "score": 246,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwa9m5k",
   "message": "I'd say a crowded swimming pool. People will start screaming and chaos will break out. You'll be surrounded in a brown cloud and seen as the point of origin. A truly shitty situation.",
   "created_utc": 1692107443,
   "score": 42,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwabaf4",
   "message": "While squatting at the gym.",
   "created_utc": 1692108122,
   "score": 238,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwabdto",
   "message": "On public transportation",
   "created_utc": 1692108161,
   "score": 111,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwb8chv",
   "message": "The worst I've heard of was an old colleague. Left work with a dodgy stomach and had an accident in his pants on the street on the way to the train. He had to go into this shop to grab a pair of denims. Runs (presumably squishing) to pay and on to train.\n\nLocks himself in toilet and sets to work cleaning himself up. It was early 2000s and you could slide part of the train window open in the toilet. Only a very small window but enough to get rid of the evidence, soiled pants and jeans launched into the breeze. \n\nOpens up his shopping bag to put the fresh trousers on and he had accidentally bought a denim jacket.",
   "created_utc": 1692120333,
   "score": 5,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwacxys",
   "message": "While bungee jumping.",
   "created_utc": 1692108780,
   "score": 66,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwaissy",
   "message": "Crowded broken elevator at your work.\n\nImagine you are locked in a crowded broken elevator for 2 hours. You get diaherra and you and others get to smell that for a couple of hours. And everyone is judging you",
   "created_utc": 1692111028,
   "score": 130,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwaykvt",
   "message": "Airplane.  6 hour flight.   Not diarrhea exaclty but I had just survive colon cancer and my ileostomy bag was reverse so I was starting to go #2 the normal way…. Except I don’t have a rectum so I didn’t extract all of the water out.   Anyways.  I know tmi.  It’s like soft serve ice cream 🍦\n\nI needed lots of paper to wipe.  Flush after flush. I’m embarrassed.  And then it’s clogged.   \n\n\nI leave and tell the flight attended that it’s clogged hoping she will “fix it” and I could tell she was annoyed and proceeds to lock the door and announce to everyone that only one bathroom is available.    5 hours of shame….    \n\n\nI learned to not eat before a flight due to the changes of air pressure and I take a Imodium right before with psyllium husks fiber right before to bulk up what’s left and dry it out….\n\n\nThis is 13 years ago so I’m better off now but still remember that flight of shame….",
   "created_utc": 1692116732,
   "score": 60,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwaag5t",
   "message": "Arizona, New Mexico. It can be a long way between rest stops",
   "created_utc": 1692107783,
   "score": 58,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwb61xt",
   "message": "I was with a friend once who got a sudden case of diarrhea.\n\nWe were two hours into a corn maze. A corn maze with super dense walls, bridges, lots of fake routes into dead ends or loop-backs. One that was notorious for being hard as hell and requiring actual skill to escape, with most people taking 3 hours.\n\nDude ran straight through the walls. I have no idea how he got out. But he did. Jesus I've never seen someone so panicked. I know I would have been freaking out lol",
   "created_utc": 1692119462,
   "score": 55,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwahrir",
   "message": "I can answer this from experience:\n\nIn Tokyo Japan, middle of summer, underground in a small train station bathroom with no ventilation or AC at 100+ degrees F and 95% humidity. 9:30pm, very few people around. No toilet paper left. Shitty toilet without a bidet.\n\nIt was a religious experience.",
   "created_utc": 1692110639,
   "score": 109,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwbdz5x",
   "message": "This actually happened to me: I was touring the pope’s summer home, it is a 45-ish minutes tour, the entire way through it’s basically nothing but gardens and important art works I’ve only seen in books, 15 minutes into the tour I have this immediate need for bathroom, I asked for bathroom and the tour guide said the closest one is at least 15 minutes away. I had to pull the tour guide along with one of the guards aside and tell them if I don’t find a toilet soon I will literally shit myself in pope’s yard. So I got on the guard’s cart and he drove me to a small bungalow to take a shit. Turns out that small bungalow / hut is where the pope would be staying if he is around. Long story short I nuked the pope’s toilet.",
   "created_utc": 1692122350,
   "score": 54,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwaay2m",
   "message": "Going back home in the bus. Stoped between 2 cities, pooped in the grass, cleaned my ass with my socks and walked 20km back home",
   "created_utc": 1692107984,
   "score": 101,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwat4v9",
   "message": "In line at Disney world when you’ve already stood in line for an hour and you’re halfway to the front and it hits you like a truck as you think of the 3 chili dogs  and bucket of buttery salty popcorn you had earlier that day and you have to haul 2 screaming toddlers away from the ride they were waiting to get on and make your way all the way to the other side of the park to use the family restroom  cuz you can’t let your kids just wander around while you shit your brains out.",
   "created_utc": 1692114771,
   "score": 48,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwable3",
   "message": "Rectal exam",
   "created_utc": 1692108244,
   "score": 41,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwacsyx",
   "message": "Cell in a prison with 10 other inmates",
   "created_utc": 1692108725,
   "score": 44,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwa9max",
   "message": "Don’t know if this is the absolute worst, but in likely terms: probably an airplane. Although you’d at least have a change of clothes available…",
   "created_utc": 1692107445,
   "score": 41,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwaw069",
   "message": "I read a horror story about someone who had it on a chartered flight for work. The plane only had an emergency toilet, which was in the main cabin and hidden under one of the seat cushions. So he had to have miserable diarrhea in an enclosed space surrounded by his coworkers.",
   "created_utc": 1692115784,
   "score": 38,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwb25c7",
   "message": "A few years ago I was looking to buy my first house and in doing so went to viewings quite often. The estate agent that would show me around these houses was a girl I knew from my school days, she’d grown up to become quite an attractive woman so it was nice seeing her now and again also. \n\n One day I went to a viewing after a night on the cider, I woke up feeling a bit rough, took my dad with me to view this potential house. As we pull up outside and meet the woman I suddenly feel my stomach drop, I need a hangover shit, why I didn’t think of this before leaving I don’t know but now it’s here and I have to go right now. I soldier on, we start looking around downstairs of this house, it’s nothing special. I’m sweating, I’m going to shit  myself imminently, in a shitty panic I go upstairs, into the bathroom and just release the wettest, greasiest shit I’ve had in a long time, painting the toilet. I’m just glad not to have shit my pants, I breathe a sigh of relief when I go to clean myself up and wipe, noticing that the bathroom is obviously empty, it’s an empty house and obviously the bathroom doesn’t contain any toilet paper. \n \nI start panicking again and frantically come to the conclusion that the only thing I can wipe with, the only other thing in the room, is the toilet mat. I pick it up wipe with the underside of the pink fabric mat and put it back in it’s rightful place. I get up, leave the violated toilet mat behind me and meet my dad and the estate agent about to come up stairs, I make my excuses and get us the fuck out of the house, never to return again",
   "created_utc": 1692118070,
   "score": 69,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwaa0p7",
   "message": "Submarine",
   "created_utc": 1692107607,
   "score": 30,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwapiol",
   "message": "I had it one time while driving in a convoy in western Iraq.  \n\nMy team leader didn't want that foul smell in the truck, so they made me hop down from the turret and the entire squad pulled 360 security while I pooped in the middle of the road leaning against the back of the truck. \n\nDuring the mission debrief the PSG conducted, this was brought up as a sustain, and we discussed how successful we were with a hasty road block, cordon and search, and communication with hire command. \n\nWhen asked by the base CSM why we halted traffic on a major road for 25 minutes, my PSG has no problem explaining, and I was told the next morning that was the highlight of the NCO brief for the week.",
   "created_utc": 1692113461,
   "score": 34,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwaifoe",
   "message": "I got cramps in a maze one time. Not cool. I was running, desperately asking kids where the enterance or exit was.",
   "created_utc": 1692110892,
   "score": 61,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwab8s0",
   "message": "In a packed jacuzzi on live TV.",
   "created_utc": 1692108104,
   "score": 55,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwb98le",
   "message": "We had about 1/2 hour before Xmas dinner at my gf's mom's house. I was bored and wanted fresh air. \"I'm gonna go out for a walk, be back in 10 minutes.\" (This was in the days before cell phones.) Stupidly, I didn't check the address when I walked out the door.\n\nIt was getting dark. It was one of those '50s housing tracts, and all the houses looked alike. When I decided to go back, I realized that I couldn't tell which one was hers. I started to worry. My bowels followed suit. \n\nThen it dawned on me - I was totally lost! \n\nIt was getting very dark, and the pressure was increasing - a LOT! I felt ready to EXPLODE.Very, very painful. And nothing looked familiar.\n\nI couldn't imagine a homeowner's reaction if I knocked on a door and said, \"I'm lost and have terrible diarrhea. Can I use your toilet?\" I was desperate and started wondering what shrubbery would serve best as a shitter. But what an awful mess - oh my god!\n\nAll of a sudden, I spotted a house that looked possible. I took the chance and knocked on the door.\n\nIt was her mom. Whew!\n\nAll she did was chuckle and ask \"Did you get lost?\" \"Yep,\" I said, adding no details and making a beeline for the bathroom.\n\nDinner was good. No questions were asked and my ordeal was never mentioned.",
   "created_utc": 1692120657,
   "score": 26,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwag71n",
   "message": "Barnes and Noble and then Karen Smith tells everyone about it and then repeats it again in front of every girl in 11th grade",
   "created_utc": 1692110046,
   "score": 51,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwbc9np",
   "message": "Ex of a friend had diarrhea like a cat flap in the Hoover Dam whilst we were in a huge traffic jam on the road. We were literally standing still for over an hour with no escaping. No trees. No houses. Only a very small puddle . At some point she just couldn’t hold any longer and did the dump full-public roadside. All cars honking. \n\nOmg it was terrible.",
   "created_utc": 1692121746,
   "score": 22,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwbkj6o",
   "message": "It was 6 months ago. Two of my friends came home and we drank a lil bit (EU, drink at 18). The next evening, i have to give a presentation i haven't started yet. In the morning we go to see a castle like 2 hours away. On the way there i pull out my laptop in the car but put it away because im dizzy. After touring the castle, we stop for pizza just outside the castle and then we start driving back. Im doing my presentation and i feel dizzy again, and then i close my eyes for 10 minutes. I start again and my stomach starts bubbling. I say we need to pull over immediately. Theres only one gas station between us and the exit we need to take, and that one is closed. It takes us 10 minutes from the end of the exit to park in the driveway. I fly out of the car waddling while squeezing as hard as i can. I throw the door open and feel a bit coming out. I sit on the toilet unloading my insides. I see Jesus and Allah at the same time (im indian so i should be seeing niether). A solid 10 minutes later my stomach comes to a rest. I assess the situation and determine that tp is useless. I just hop in the shower and soap up my crack like thrice, everytime is just as dirty as the last. Eventually its clean and i step out to see i have 20 minutes till i have to be there to deliver my presentation. We are racing through the city while im sitting on the side doing my presentation at breakneck speed and we arrive like 10 minutes late. Lucky for me the people im presenting to are still arguing about something and i add more to my presentation. And then i deliver my worst ever presentation to these poor fellows in a language that i was learning for just 5 months. And then i passed out, in tears, on my way back home",
   "created_utc": 1692124694,
   "score": 21,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwaawz3",
   "message": "In your mouth.",
   "created_utc": 1692107972,
   "score": 85,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwbkggg",
   "message": "I know a girl who got invited to her BF’s parents’ place for Thanksgiving and got food poisoning in Penn Station right before and sharted up the guest bedroom. She ended up retelling the story in a Poopourri commercial and marrying the guy, but every time she pops up on my IG feed all I can hear is “I sharted in my mother in law’s bed” in her thick accent",
   "created_utc": 1692124667,
   "score": 16,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwb4a4v",
   "message": "absolute worst place ever is 35,000 feet in the air while being stuck on an international flight that has a flight time of over 8 hours. EVERYONE in the back of the plane can hear and SMELL as the odor leaks out when the doors open and close. Also, you will be stuck in the bathroom and there are lines of people forming waiting to use it afterwards. They all know its you and there is nowhere.to.hide",
   "created_utc": 1692118824,
   "score": 15,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwbnunu",
   "message": "I had just started a new medication and diarrhea was a potential side-effect. My husband and I were on our way to his grandparents' house where we were supposed to help care-take for them in their old age and visit with extended family. During the drive over I thought I had to pass gas but lo...it was NOT gas. I was wearing overalls and just a t-shirt and underwear beneath, and the underwear was...very wet. Ready to be retired to the trash. \n\nMy husband was driving his car so I had nothing stowed away anywhere. It was an \"Oh shit, did that just happen??\" moment. We were already running late with our family asking where we were in a group text, and we were nowhere near home. \n\nI felt baffled--I just didn't know what to do. \"I mean, we need to be there,\" my husband shrugged, though sympathetic. So...we continued driving while I wallowed, accepting my potential social demise.\n\nWhen we arrived my husband distracted his family as I waddled past him into the bathroom to assess the situation. I ended up wrapping my underwear in tons of toilet paper and stowing it in my purse, needing to zip it shut to hide the *aromatic* evidence. Then, after cleaning up as well as I could, I had no other choice but to go commando in my overalls, knowing full well that another confident fart could ruin me. I clenched my buttcheeks the whole day, feigning enthusiasm to see everyone.",
   "created_utc": 1692125866,
   "score": 15,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwbgrsj",
   "message": "(Non-eng speaker here) My dad once had diarrhea in the african jungle. He couldn’t hold it so he relieved himself completely naked next to an abandoned train. Suddenly an army dude popped up with a big ass gun. My dad said ‘please sir I’m sorry I’m sick’. The army dude didn’t say anything and just stood there… looking at my father naked shitting his guts out in the jungle. Most embarrassing thing that ever happened to him.",
   "created_utc": 1692123352,
   "score": 14,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwacubq",
   "message": "During a work meeting",
   "created_utc": 1692108740,
   "score": 13,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwacwsq",
   "message": "The sandpaper store.",
   "created_utc": 1692108767,
   "score": 22,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwafdt3",
   "message": "In the lungs",
   "created_utc": 1692109730,
   "score": 25,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwbjris",
   "message": "I have both Celiacs and IBS. Both of these were only diagnosed more recently in my late 30s. I have pretty amazing sphincter control considering, but I get diarrhea daily and have for most of my adult life. In fact I am currently spraying my toilet bowl while writing this comment. \n\nHere are my top three. \n\n1. In a clean facility for electronics manufacturing. It was a dream tour of mine and I had called in a lot of favors to get there. It takes 15 minutes to get your suit on and decontaminate enough to be in there. I BARELY made it back out in time, but I couldn't complete the tour because I kept having to go. \n\n2. On stage in high school, during a play where I was wearing a difficult to remove costume. One where I was shirtless though and supposed to be a sexy demigod. I managed to hold it until I was off stage, but I missed the final bow. \n\n3. This one is the worst, and probably beats anything in this thread. Underwater while scuba diving about 90 meters under water and requiring at least a 5 minute stop on my way up in order to avoid getting the bends. I had to just shit in the suit, which was particularly gross because it squished up my skintight suit and made it all the way up and around my beard. The fish loved it though and it caused them all to swarm around me like some sort of Disney princess then some barracudas came and scared me, unfortunately not shitless, followed by some sharks.\n\n3b. The diarrhea continued for the next 2 days, including the 2 hour boat ride home. There was no head and we were 15 people crammed shoulder to shoulder in this little boat with my stinking equipment and suit in the boat too. They had to take frequent stops to let me out of the boat to shit again in the water. The sharks were following us.",
   "created_utc": 1692124419,
   "score": 10,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwab8ku",
   "message": "Stuck in traffic",
   "created_utc": 1692108102,
   "score": 26,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwacp0a",
   "message": "probably anywhere other than a fucking toilet",
   "created_utc": 1692108683,
   "score": 20,
   "submission_id": "15rtakt"
  },
  {
   "comment_id": "jwakdzi",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15rtakt"
  }
 ]
}