{
 "submission_id": "15rwb94",
 "title": "How is your “if we are single by 30, we’re getting married” friend doing?",
 "selftext": "",
 "created_utc": 1692114338,
 "permalink": "/r/AskReddit/comments/15rwb94/how_is_your_if_we_are_single_by_30_were_getting/",
 "score": 68,
 "url": "https://www.reddit.com/r/AskReddit/comments/15rwb94/how_is_your_if_we_are_single_by_30_were_getting/",
 "comments": [
  {
   "comment_id": "jwawk35",
   "message": "She’s been living a WILD life. We made the pact at 22, she got married by 24, divorced by 25, new relationship and got pregnant at 26, married at 28 and divorced at 30. \n\nIn that time she dropped out of college, went back to college, completed her associates, got nailed for a few drug charges and is currently fighting for custody of her kid with the dad.",
   "created_utc": 1692115982,
   "score": 118,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwavga1",
   "message": "She told me that 5 years ago. I said: why not just try dating now? We did. We're married now :D Why wait?",
   "created_utc": 1692115587,
   "score": 75,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwb823m",
   "message": "His wife has banned him from speaking to me",
   "created_utc": 1692120222,
   "score": 137,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwberwx",
   "message": "He’s my soon to be ex husband… lol.",
   "created_utc": 1692122638,
   "score": 75,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwb2uy2",
   "message": "This actually did happen for a friend of mine and his wife.\r  \n\r  \nBut it was more of a conversation along the lines of \"hey remember that pact we made when we were 18 about getting married at 30 if we were both single? Well we are now 30 and single, did you want to give dating a shot\"?\r  \n\r  \n5 years later and they are now happily married, I have no idea why they didnt give dating a shot years before, but thats none of my business.",
   "created_utc": 1692118322,
   "score": 67,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbekqu",
   "message": "I’ve made that pact with so many people that I hope no one comes to make claims when I turn 30",
   "created_utc": 1692122564,
   "score": 106,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwb8eoe",
   "message": "She's married to my good friend. But things are rocky. I just got divorced so maybe we'll revisit this in our 40s? Just kidding.",
   "created_utc": 1692120356,
   "score": 98,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbv627",
   "message": "I'm marrying him in November! Well, marrying him to another woman....I'm their officiant :D",
   "created_utc": 1692128458,
   "score": 106,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwb50bu",
   "message": "I just talked to them the other day. We’re both over 30 and still both unmarried 😇",
   "created_utc": 1692119086,
   "score": 58,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwb23sl",
   "message": "I married her sister. I never wanted to marry her, she was my friend and she thought of the “if we aren’t married by 30”, thing.",
   "created_utc": 1692118055,
   "score": 141,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwb8e3q",
   "message": "He’s unhappily married to someone else.  Spends all his time gardening now.",
   "created_utc": 1692120350,
   "score": 184,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbsu3w",
   "message": "I kissed her this morning when I was leaving for work, we get married in 3 days. \n\nNo joke, made the pact, reconnected in person after a few years on my 31st birthday which is 3 days before her 30th, we went out for a date and we haven’t spent a night apart since. And in 3 days we say the ol I Do’s.",
   "created_utc": 1692127631,
   "score": 160,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwb1mrb",
   "message": "He’s in San Diego, living his best gay life.",
   "created_utc": 1692117886,
   "score": 65,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbjq2l",
   "message": "When we were 29/31, we decided \"if we're all alone at 50, we can be roommates\". We got married at 30/32 instead and got 2 kids now.",
   "created_utc": 1692124404,
   "score": 171,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbufot",
   "message": "We both got married before 30 to other people. She married a cool dude and had 4 kids.  They had a beautiful family and so do I. I was genuinely happy for her and glad we didn’t “end up” with each other.  She died of cancer a few years ago when her youngest kid was still in elementary school.  My heart breaks for her and her family.  I feel closer to them than they realize because I knew her since middle school. I think of them often and hope they are finding peace and happiness in this crazy life.",
   "created_utc": 1692128197,
   "score": 6,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbxf8q",
   "message": "I had a friend in middle/high school that told me we should make a marriage pact. if we weren’t married by 30 we’d get married. I lost contact with her after high school because she had a scary jealous boyfriend. She randomly added me on Facebook and asked for my phone number. I didn’t think it was a big deal so I sent it. She sent me a very graphic photo of herself and said “hey it’s me crisi!” And I was like hot damnnnn. We talked for a bit that day, but that was our only real conversation. She had brought up our pact and we joked about it for a bit. A few months later she messaged me asking if she can use my shower because her water got shut off. I thought that was unusual so I just told her it wasn’t a good time. That’s happened to me before and I’d normally message a family member or close friend. A couple days later she posted a video of her and some dude (not her old boyfriend) smoking crack under a freeway overpass. She had a bandana on her face and the filmed themselves smoking head banging to music thinking they looked bad ass. I felt really bad for her at that point. Then I wondered if I had let her use my shower if she would’ve robbed me with her cholo looking boyfriend. Not too long after that her boyfriend started posting online that she was missing and he can’t locate her. Two weeks after that he changed his status to single on Facebook and I still haven’t heard from my childhood friend. I hope she’s ok out there. Really hope she can get her shit together and get clean.",
   "created_utc": 1692129254,
   "score": 82,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbusye",
   "message": "She’s a single mom now so I’m getting ready to strap my step dad boots on here shortly.",
   "created_utc": 1692128328,
   "score": 38,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbe7d7",
   "message": "I have a friend who says this to me every once and a while. I'd have no problem with that except she makes it sound like she'd be miserable if she had to end up with me so no thanks. You keep dating horrible men and I'll watch from the sideline if I have time",
   "created_utc": 1692122431,
   "score": 147,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbewdd",
   "message": "I do actually have a friend who did this. They reconnected after not seeing each other for a good while. They laughed and reminisced about their funny agreement to get married at 30 if they hadn't met someone else. They did get married pretty quick and were happy...for about a year. Then they spend a couple more years miserable together. Things got very bad and he ended up divorcing her. He's now happily married to someone who seems to be much better for him.",
   "created_utc": 1692122681,
   "score": 166,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbez2r",
   "message": "He has like 5-6 kids. He actually hit me up when we were 30 (were 32 now) and asked about the deal. I was like “dude don’t you have like 5 kids???” I was not gonna take on that circus 😂",
   "created_utc": 1692122709,
   "score": 24,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbe70j",
   "message": "Turns out we’re both gay, so not happening",
   "created_utc": 1692122427,
   "score": 80,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwb3db3",
   "message": "Been married 16 years. Together for 20. Longest 4 days away from him after we made the pact to meet in Paris. Still haven’t been to Paris but I have the love of my life.",
   "created_utc": 1692118502,
   "score": 132,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbuvbb",
   "message": "Not me, but I have a former coworker that made that pact with his senior high school prom date. Lost touch for 7 or so years. Reconnected at the 10 year high school reunion. Got married 2 years later. Now 2 kids with a third on the way and VERY happy. It was cool to watch the majority of that story go down",
   "created_utc": 1692128351,
   "score": 165,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwb3c67",
   "message": "Great! Married with two kids, living his best life. Our cut off was 28 and I was married by 21, he was married by 22.",
   "created_utc": 1692118492,
   "score": 109,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbynal",
   "message": "Over COVID I saw her profile pop up on my switch, so I reached out to her and started catching up for the first time since I moved away for college. One thing lead to another, I asked her if she’d like to move up the timeline on our promise, and we plan to get married next fall at the nice young age of 26.",
   "created_utc": 1692129691,
   "score": 70,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwblj89",
   "message": "My current bf told me that in high school when we were just friends that “we’re best friends and If i dont find a wife by 30, we’re getting married”. We decided just to date eachother 6 months later. Its been 7 years now together.",
   "created_utc": 1692125051,
   "score": 103,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbl5oz",
   "message": "With us it was “if we are still single at 65 let’s just move in together - at least we like each other.” We met first year at university and had been close friends ever since.\n\nShe died of breast cancer at 63. Miss her every day.",
   "created_utc": 1692124915,
   "score": 55,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbovqs",
   "message": "He's married to a GORGEOUS woman with two of the CUTEST babies I've ever seen.\n\nHe's a white man and was racist af in high school (something my hormonal ass was willing to overlook), but now he owns a gym with his best friend who is black, and his wife is Asian. Dude turned around and achieved his dreams in the best way imaginable. Killer combo. Livin his best life.\n\nAnd I'm in a long term relationship myself, so we're both out here just killin it",
   "created_utc": 1692126232,
   "score": 141,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwat9yl",
   "message": "She got marrried years ago.\nWe were both in relationships at 30.",
   "created_utc": 1692114822,
   "score": 45,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwboft5",
   "message": "He’s driving. We are pulling our camper. Our 9 year old is in the backseat. We just finished a 4 night camping trip with his younger brother and his fiancé (also a “if we’re single…” couple). They have two girls, 2 and 4. We are all still excellent friends. My bil and his fiancé dated right after high school. My husband and i didn’t hook up until 2 days before we eloped. Married 11 years yesterday. Friends since ‘94",
   "created_utc": 1692126074,
   "score": 128,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbguyx",
   "message": "we didn't last long. got married at 25. Still going strong.\n\nMade the deal at 23. Married at 25. Going on 13 years together.",
   "created_utc": 1692123383,
   "score": 156,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbf55q",
   "message": "He's fabulously gay (I am a woman). Should be interesting.",
   "created_utc": 1692122769,
   "score": 151,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwas8pw",
   "message": "She married someone else.",
   "created_utc": 1692114454,
   "score": 97,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbfua1",
   "message": "We’re dating and happy as could be. We’re almost 30 now though so we’re going to have to break up to honor our marriage pact",
   "created_utc": 1692123019,
   "score": 81,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwb7a8v",
   "message": "I have no idea, but we made the deal for 40, so I’ve got time.",
   "created_utc": 1692119929,
   "score": 29,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbhom3",
   "message": "We decided on age 50. He’s married with one kid, and another coming. I’m a little bummed, since I was really counting on his health insurance.\n\nWe’re still besties.",
   "created_utc": 1692123677,
   "score": 25,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwblp14",
   "message": "He's a rather successful programmer and overall great guy, so I'm unsure why he's single still. We made the pact when we were 15.\n\nI am happily married to an amazing man, so sometimes I think of my promised friend and hope that a spectacular woman (or man, if that's what he wants) finds their way into his life.\n\nI wish him nothing but happiness, whichever form it takes.",
   "created_utc": 1692125107,
   "score": 25,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwc2a8h",
   "message": "He's upstairs, I'm downstairs. We didn't get married but we did buy a house together, platonic like.",
   "created_utc": 1692131003,
   "score": 49,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbcqmw",
   "message": "Wait. Ya'll guys have one? Where's mine?",
   "created_utc": 1692121912,
   "score": 64,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbq8ul",
   "message": "Ours was 35 actually.\n\nShe lives a few states away. She lives with her ex boyfriend, because her current boyfriend still lives with his mom. She has an animal addiction. She can't say no when someone wants to sell her a living creature. She has dogs, cats, rats, snakes, sugar gliders, fish, and other random stuff to round out her zoo. She \"can't work\" because of her anxiety... except she totally had a job for like six years, but complained through that whole time that she couldn't work. She wants to go on disability, but just thought she could go in and get on it by filing some paperwork and that was it. She doesn't trust doctors, so she has no documented proof of all of her \"ailments.\" \n\nShe is broke, the ex and the current boyfriend pay all of her bills, she sits at home and takes care of all these pets all day, and is generally a drain on society. But she complains about always being broke.\n\nSo in other words I dodged a fucking bullet.",
   "created_utc": 1692126716,
   "score": 59,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwas017",
   "message": "No one would be crazy enough to enter that deal with me.",
   "created_utc": 1692114367,
   "score": 83,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbv0yh",
   "message": "Sitting next to me in bed.\n\nMy wife will be livid when she finds out.",
   "created_utc": 1692128407,
   "score": 125,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwb372c",
   "message": "Still never finished a bachelors after 4+ failed attempts because he won't ask for math help. Still working at a hotel front desk at nearly 60 years old and with no possibility of more. Has no retirement to speak of, went through bankruptcy, and remains in deep debt. Is a hoarder.\n\nWe are not friends anymore, all of these conditions caused him to turn into a right asshole for no reason. 20 year friendship ended a couple years back.",
   "created_utc": 1692118441,
   "score": 85,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbjwzh",
   "message": "Hear me out- we started dating about 2 years ago and grew apart???\n\nSo now after about 2 months of being without her I'm realizing how much work it takes to be in a relationship and I'm working my damn hardest to win her ass back.\n\nNeither of us are 30 yet. So I guess there's a chance?",
   "created_utc": 1692124473,
   "score": 34,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwb9ylo",
   "message": "“Good. I hear (s)he’s doing real good.” -Sally Albright",
   "created_utc": 1692120920,
   "score": 16,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbj6jo",
   "message": "I got married, then he got married right before my divorce.  I remarried years later, right before his divorce 😂",
   "created_utc": 1692124209,
   "score": 16,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwbo62t",
   "message": " We dated when we were 25 but it wasn't serious. We are mid-40's now and both currently single. I took her out for dinner and a concert last November. We remain good friends and our possible marriage is still in the cards. It's been pushed up to 50 now!",
   "created_utc": 1692125978,
   "score": 14,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwashl3",
   "message": "We no longer talk stopped talking years ago. I met them back in 2020 when the pandemic started. We were super close, then even had a relationship together, but then we randomly stopped talking. No, it wasn't cause of our past relationship. We just fell off. I miss her every day.",
   "created_utc": 1692114541,
   "score": 97,
   "submission_id": "15rwb94"
  },
  {
   "comment_id": "jwc0qvz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15rwb94"
  }
 ]
}