{
 "submission_id": "15s7qua",
 "title": "How do you feel about the proposal by native Hawaiians to demolish most of the expensive hotels and resorts, and kick out most of the tourists?",
 "selftext": "",
 "created_utc": 1692139773,
 "permalink": "/r/AskReddit/comments/15s7qua/how_do_you_feel_about_the_proposal_by_native/",
 "score": 34,
 "url": "https://www.reddit.com/r/AskReddit/comments/15s7qua/how_do_you_feel_about_the_proposal_by_native/",
 "comments": [
  {
   "comment_id": "jwcr4ha",
   "message": "Hawaii survives on tourism. Without it the islands would become another Haiti",
   "created_utc": 1692140410,
   "score": 173,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcsaoe",
   "message": "I mean their entire economy is tourism sooo.....",
   "created_utc": 1692140888,
   "score": 93,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd0bey",
   "message": "How long before people start dying of starvation from the lack of tourist revenue?",
   "created_utc": 1692144151,
   "score": 21,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd0pdz",
   "message": "It would be better if they kicked out a lot of the people who aren’t natives and then run the resorts themselves instead of massive companies running them.",
   "created_utc": 1692144309,
   "score": 65,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcq1i5",
   "message": "They don't own said hotels so that would be quite criminal.\n\nAnd good luck having an economy without tourism.",
   "created_utc": 1692139969,
   "score": 71,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd1f70",
   "message": "Never been but I feel like tourism Is what keeps people going and the economy going.",
   "created_utc": 1692144602,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd1u2e",
   "message": "I'd say good luck...",
   "created_utc": 1692144772,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcqdru",
   "message": "If this is even true, Their economy would be decimated. I get why they may want their land back, but destroying the buildings and kicking people out will most likely only crash their economy and they wouldn’t be able to restore the land that’s already been built on. I don’t know. Maybe it’s a shit take, but change takes time, and a drastic decision like this wouldn’t end well\n\nEdit: it would also ruin their economy to end tourism, and yeah they have other ways of making money, sure, but tourism is a huge part of that. If they cut that out, where would they get the money to tear down these buildings and restore the land??",
   "created_utc": 1692140107,
   "score": 18,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcsh85",
   "message": "That sounds like the set up for a hilarious dumpster fire!",
   "created_utc": 1692140962,
   "score": 9,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcpy5u",
   "message": "Can vote in politicians who will change their state constitution",
   "created_utc": 1692139932,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcpya8",
   "message": "Source?",
   "created_utc": 1692139933,
   "score": 0,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcvp96",
   "message": "What for?",
   "created_utc": 1692142271,
   "score": 2,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcsa52",
   "message": "I feel that ship has sailed, the colonists have won, and the Native Americans aren't going to be retaking their ancestral lands any time soon either.\n\nDon't get me wrong, I love the thought of it and would support it if I could, but it's not a winning battle at this point in history.",
   "created_utc": 1692140882,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcvros",
   "message": "I support any measures that would help the natives reclaim the occupied land. It's a shame that they themselves, cannot afford to stay in such expensive places, despite them being built on their native lands. \n\nThe plan should encourage native Hawaiians to reclaim the land and convert it to housing owned by them, where they can live affordably and sustainably on their native lands. I wouldn't mind the U.S. government allocating a budget to help accelerate the refunding and purchasing process of the targeted lands. The natives should also ensure that some of the reclaimed land is always being used to both, maintain the economic benefits of their tourism industry, and, for the conservation and education of their culture.",
   "created_utc": 1692142298,
   "score": 254,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcq2h9",
   "message": "It’s always a tense battle between people who grew up in a city/county versus the new arrivals from outside.\n\nSan Francisco.\n\nAustin.\n\nDenver.\n\n- - -\n\nAnd now.. Hawaii (or at least, Maui island in Hawaii)..\n\nIf Oprah wants to buy land in Hawaii, can locals stop her? It’s a free market, the buyer with the most cash gets to buy the most land. No?\n\nOprah is accumulating vast amounts of land in Hawaii. Why does that translate to “kick out the hotels, kick out the tourists”?\n\nAlso, how will Hawaii earn money without the tourists?",
   "created_utc": 1692139979,
   "score": 3,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwczl4p",
   "message": "Sounds hilarious, I'm in.",
   "created_utc": 1692143855,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcxxbh",
   "message": "I feel that I could've sworn Hawaii belonged to the United States. If that kind of ludicrous proposal manages to get traction (which I doubt it will, Hawaiians are well aware that their entire economy is tourism-based), maybe we need to remind them of who's in charge.",
   "created_utc": 1692143172,
   "score": 251,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd0ha1",
   "message": "as a croatian, i agree 100%, best idea ever",
   "created_utc": 1692144218,
   "score": 254,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd0on4",
   "message": "It’s kind of along the lines of my own desire to abolish private vehicle ownership and massively expand public transportation. Like I understand the dream but it will never happen",
   "created_utc": 1692144301,
   "score": 251,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwct1uj",
   "message": "I really don't care",
   "created_utc": 1692141191,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd2r9y",
   "message": "They gonna want government assistance when the states economy collapses?",
   "created_utc": 1692145152,
   "score": 10,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd4555",
   "message": "They lost so much money during Covid. They may have liked the lack of tourists, but tourism is Hawaii’s major industry.",
   "created_utc": 1692145724,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd4n9e",
   "message": "Fine by me. Fuck that capitalism rape the land bullshit.",
   "created_utc": 1692145936,
   "score": 248,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd57bj",
   "message": "I don’t think kicking out tourists will have the effect a lot of them hope it will have. Many of them would lose their jobs either directly or indirectly from the tourism industry collapsing. Native Hawaiians benefit from the tourists who come there on vacation and leave after 1-2 weeks. They may not like it, but it’s a huge driver of their economy. \n\nHowever, I think the rich people who own investment properties in Hawaii are the bigger issue. I could definitely understand them wanting to kick rich investors out who are just sitting on property, because those kinds of people are making it less affordable for native Hawaiians to live in their homeland.",
   "created_utc": 1692146167,
   "score": 75,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd9k2c",
   "message": "I think there is no serious proposal by native Hawaiians to do that. It's just noisemaking on social media. \n\nNative Hawaiians make up about 10% of the population of Hawaii. If you include those who are mixed, it's about a third of the population. Of those Native Hawaiians, the overwhelming majority support tourism as an economic model. There are differing opinions on how governance should be handled and the rights that the Hawaiian people should have to the land, but the people calling for the expulsion of tourism are a minority within a minority. They just happen to be a loud one. \n\nI \"feel\" the proposal is kind of pointless. It's not going to happen. And legally, it couldn't happen without Hawaii leaving the United States (which is also not going to happen anytime soon).",
   "created_utc": 1692147990,
   "score": 72,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwde6ml",
   "message": "Hawaii without tourism is like the Ivory Coast without Cocoa Beans. It's literally the backbone of their economy.",
   "created_utc": 1692149920,
   "score": 14,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd5w3h",
   "message": "They already hate tourists and anyone from the mainland. Went to Kauai last year and the whole “tourist not welcomed” and “Hawaii is not part of the United States” is posted all over the place.",
   "created_utc": 1692146453,
   "score": 67,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdn6td",
   "message": "I am unsure what native hawaiins mean, is it those that can prove their ethnic purity of actually having Hawaiian ethnicity? Or does it mean those who just actually live on the island?",
   "created_utc": 1692153797,
   "score": 7,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd7r40",
   "message": "I think you’re hearing from a loud activist minority of natives",
   "created_utc": 1692147231,
   "score": 19,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd8g6u",
   "message": "Completely unrealistic",
   "created_utc": 1692147522,
   "score": 19,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd6tq4",
   "message": "They've modeled their entire economy off tourism. So many natives depend on tourism for income. I understand their sentiment but I think it'd ultimately be a really bad decision for their economy and livelihoods",
   "created_utc": 1692146843,
   "score": 16,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdnpo5",
   "message": "Proof?",
   "created_utc": 1692154030,
   "score": 3,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdxcre",
   "message": "Can you say, specifically, who was speaking on behalf of the Native Hawaiian people?  Under what authority did the present this?  Or is this just some people talking?",
   "created_utc": 1692158800,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd5x8z",
   "message": "Fine, so long as they buy it. I think their economy would be fucked.",
   "created_utc": 1692146467,
   "score": 9,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd8a4v",
   "message": "This is a question for an economist more so than a humanitarian.",
   "created_utc": 1692147452,
   "score": 5,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdb2yx",
   "message": "Honestly?  I would wonder what chinese entity is behind the movement.",
   "created_utc": 1692148636,
   "score": 6,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdmnk3",
   "message": "native Hawaiians are some of the most pretentious, douchey people I've ever met in my life. they all have a massive chip on their shoulder. because of that, I don't give a rats ass about their dumb proposals, they can suck eggs and deal with it. I'd gladly even accept such a proposal, and watch their economy crash and burn without tourism.",
   "created_utc": 1692153555,
   "score": 4,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdc70n",
   "message": "That would absolutely ruin their economy",
   "created_utc": 1692149097,
   "score": 2,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdnr65",
   "message": "Why even speculate on something that will never happen?",
   "created_utc": 1692154049,
   "score": 2,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdo9h1",
   "message": "Tourists bring a LOT of money to the islands.",
   "created_utc": 1692154278,
   "score": 2,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdochc",
   "message": "They will not enjoy their choice, but it's fine with me.",
   "created_utc": 1692154316,
   "score": 2,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdu2be",
   "message": "Fair",
   "created_utc": 1692157067,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdxq2y",
   "message": "There are a lot of places in the world with nice beaches. I say okay. When they find out how much money the tourists bring in they might be shocked but they'll be okay",
   "created_utc": 1692159004,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd8m2b",
   "message": "This sounds noble and all, but what’s going to then fuel their economy? Can Hawaii really be self sustaining without tourism? That seems highly doubtful. It makes up about 25% of their GDP.",
   "created_utc": 1692147591,
   "score": 2,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdo0qk",
   "message": "They dont own the island, plus tourism makes up most of Hawaiian enconomy",
   "created_utc": 1692154170,
   "score": 3,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdnny7",
   "message": "why stop there. why not return to a time before the native hawaiians moved there.",
   "created_utc": 1692154010,
   "score": 3,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdt4ys",
   "message": "Just look at the developing country status  of the rest of the South Pacific.\n\nIt won't revert to some romantic, simple paradise it will be unsanitary semi poverty with no work \u0026amp; sharing your front yard with the family pig",
   "created_utc": 1692156605,
   "score": 3,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd9z57",
   "message": "They can fuck right off. It's a US state, their ancestors voted rather overwhelmingly for it to be one. Its no different than going to any other state.",
   "created_utc": 1692148166,
   "score": 6,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdlmcn",
   "message": "Does no one in this thread know how the US obtained Hawaii? It really sheds some light on the perspective of native Hawaiians.",
   "created_utc": 1692153097,
   "score": 2,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd55aw",
   "message": "If they hadn't have sold their land in the first place there would be a lot fewer hotels, resorts, and tourists.",
   "created_utc": 1692146144,
   "score": 2,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdfnw9",
   "message": "Seeing as how the US pretty much violently possessed the island as if the land was uninhabited and the lives of the people were unimportant, I’d say I’m all for it. They threatened to kill their queen for god’s sake. She had to accept to relinquish her throne and was offered that the lives of her people be spared and be given citizenship and meanwhile their culture is dying.\n\nThe problem would arise after their revolt, but I believe it’s for them to figure out. We have plenty of people who even refused to get a vaccine for the safety of themselves or others, but people are against the Hawaii natives taking back their land? \n\nThen they’re hypocrites. The only thing they care about is living the dream soaking up the sun in a resort lining the pockets of billionaires who are starving them little by little.",
   "created_utc": 1692150543,
   "score": 255,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd8z8k",
   "message": "Give it back to them. 100%.",
   "created_utc": 1692147744,
   "score": 252,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdcohn",
   "message": "I think its a great idea.  Hawaii was its own country. Let it survive that way in the modern world.",
   "created_utc": 1692149293,
   "score": 0,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdqmix",
   "message": "I support Indigenous people taking back their land and culture and to have sovereignty over their land and what the do with it.",
   "created_utc": 1692155388,
   "score": 255,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdggkc",
   "message": "Hawaiian lands have been usurped by a massive war loving empire. They were forced out of their native lands and lifestyle and were made to get jobs and live according to the conquering empire’s way of life. For this empire Hawaiian lands are not just another land and people to conquer but an excellent geographical military location. Even if they could “kick haole out” (haole is their term for white people, it means without soul), and they can’t, they’re almost entirely unarmed,  the empire would never willingly give up that tactical position.",
   "created_utc": 1692150878,
   "score": 255,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwda4sq",
   "message": "I think every place on earth should do this, and all at the same time.",
   "created_utc": 1692148233,
   "score": 0,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdawrk",
   "message": "I think it’s an awful idea. If I were one, I would love to share my beautiful land with others. If they trash it, then that is on them, but the vast majority of people take good care of the land and respect it, so why not let the people keep coming?",
   "created_utc": 1692148563,
   "score": 0,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdhta3",
   "message": "Good luck living on that pineapple money",
   "created_utc": 1692151452,
   "score": 0,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdijiq",
   "message": "I think since Hawaii went up in flames, tourists are what will keep it afloat now.",
   "created_utc": 1692151759,
   "score": 0,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdn1kn",
   "message": "Money speaks the loudest. It is unrestricted Capitalism.",
   "created_utc": 1692153730,
   "score": 0,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdurw2",
   "message": "Enjoy going back to the Bronze Age, dipshits. Without tourism their entire economy collapses.",
   "created_utc": 1692157430,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdkk2r",
   "message": "That’s fine, I’ll go spend my money somewhere else. Their loss.\n\nI haven’t been to Hawaii yet but it’s been on my list of potential vacations. California is happy to receive my money.",
   "created_utc": 1692152626,
   "score": 255,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd5p6v",
   "message": "Fantastic idea. Let’s start with Maui!",
   "created_utc": 1692146375,
   "score": 254,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdql13",
   "message": "Like all harebrained lefturd ideas, it's stupid.",
   "created_utc": 1692155367,
   "score": 253,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd9v3z",
   "message": "Source? I am not saying I don't believe OP - I just haven't heard anything about this proposal and I would like to learn more.",
   "created_utc": 1692148117,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd9y33",
   "message": "Time to invest in sunscreen companies, Hawaii gonna need 'em!",
   "created_utc": 1692148153,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwddagf",
   "message": "That wouldn’t work because their entire economy relies ON tourism.\n\nPeople forget that when you get rid of hotels, you don’t just get rid of tourists… you get rid of jobs.  Some of those resorts are HUGE and they employ anywhere between 500-1000 people…. Locals.",
   "created_utc": 1692149547,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdefta",
   "message": "Define native? There's a whole Lotta Japanese descents there",
   "created_utc": 1692150027,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdfipq",
   "message": "They NEED those tourist dollars.  Isnt it expensive as it is to live in Hawaii? \n\nMaybe have one large island for tourism and the others for native Hawaiians.",
   "created_utc": 1692150481,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdfmre",
   "message": "I heard the plan was to destroy what’s there and build smart cities, whatever that means there. Don’t know the truth to that \nBut my thought is. Destroy what’s there and rebuild it as a military base bc we need a strong point in the pacific. But that’s my theory.",
   "created_utc": 1692150530,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdgqrh",
   "message": "how  would they decide which tourists to kick out? when would they be notified - after they got there?",
   "created_utc": 1692150999,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdmjz1",
   "message": "I guess, I mean it's their land.  But they will end up losing most of their economic stability.  And with cost to send anything anywhere.  I don't know where that will help your low income family there, let alone middle income family.",
   "created_utc": 1692153511,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdovnz",
   "message": "Fuck yeah do it.",
   "created_utc": 1692154562,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdq51f",
   "message": "I don't care what Hawaii does, I don't live there.",
   "created_utc": 1692155156,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdqjte",
   "message": "I feel like they’d regret it real quick when their economy took a major hit since tourism is like 20-25% of their whole economy…",
   "created_utc": 1692155352,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdqsgx",
   "message": "Seems like a bad idea. Tourism is a big part of their economy",
   "created_utc": 1692155468,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdralc",
   "message": "I'll donate a sledgehammer.",
   "created_utc": 1692155710,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdx4qs",
   "message": "Good 🫶🏼",
   "created_utc": 1692158681,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdyi4n",
   "message": "More power to them, but is that a good economic move long term?",
   "created_utc": 1692159439,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdzics",
   "message": "I think that's an extremist POV and that must Native Hawaiians are more moderate and sensible in their discussions on such issues. \n\nI imagine many Hawaiians would find the idea of demolishing hotels incredibly stupid when they have housing issues.",
   "created_utc": 1692160002,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdzm4k",
   "message": "Technically Native Hawaiians may include mainlanders that have lived in Maui for years. For them, there is a difference not often expressed\n\nI'd suggest all the major tourist hotels creat a common trust, that would be used to rebuild the hotels and reorts only, no public money. \n\nMaui needs tourists to grow.",
   "created_utc": 1692160062,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdzupt",
   "message": "Give them their land back.",
   "created_utc": 1692160198,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwdzwmy",
   "message": "Cuba?",
   "created_utc": 1692160229,
   "score": 1,
   "submission_id": "15s7qua"
  }
 ]
}