{
 "submission_id": "15s7ki7",
 "title": "Married people of Reddit, what's something you just hate about your in-laws?",
 "selftext": "",
 "created_utc": 1692139349,
 "permalink": "/r/AskReddit/comments/15s7ki7/married_people_of_reddit_whats_something_you_just/",
 "score": 194,
 "url": "https://www.reddit.com/r/AskReddit/comments/15s7ki7/married_people_of_reddit_whats_something_you_just/",
 "comments": [
  {
   "comment_id": "jwcs8pb",
   "message": "The way they travel. Constant need to overpack,shop for shit to take home, etc always results in like half a dozen overweight suitcases and carryons that they then ALWAYS have to re organize to handle the weight and they ALWAYS expect everyone in the group to pack light to accomodate incase they have to dump shit on you…..\n\n\nI hate it and it pisses me off everytime",
   "created_utc": 1692140866,
   "score": 97,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcp7wg",
   "message": "My MIL isn’t too nice to the kids. Granted, she has 15 grandkids, you can tell which ones she likes more. And less. My kids are in the middle.",
   "created_utc": 1692139643,
   "score": 18,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd5c1h",
   "message": "My FIL called my wife and her 3 sisters whores all while standing I’m MY house. Reason you ask? They all got married outside of the Catholic faith. We haven’t spoken in 6 years. Best 6 years of my life.",
   "created_utc": 1692146222,
   "score": 166,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcs4mm",
   "message": "I absolutely love my inlaws, but compared to my family they are *REALLY*  loud. Like instead of taking turns talking they just talk louder over each other until someone listens. I leave with a headache, and that's including times I sneak to an empty room for peace.",
   "created_utc": 1692140820,
   "score": 221,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcx7j4",
   "message": "My MIL loads the dishwasher like a fuckin animal",
   "created_utc": 1692142882,
   "score": 190,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdaa07",
   "message": "Oh man, how much time do you have?\n\nNumber one thing is that they are drama vampires.  They can’t live without it.  Everything is about them, and if it isn’t, it will be soon.  They are cartoonishly childish and it’s as ridiculous as it is sad.  I feel terrible for my spouse and her siblings.  Every family get-together is a shitshow.\n\nNumber two is that they can’t make a plan without overcomplicating the ever-loving shit out of it, which my wife has inherited.",
   "created_utc": 1692148294,
   "score": 90,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd5d94",
   "message": "Oh God, do I have stories. My MIL is one of the cheapest people I have ever met and  a hoarder. For my sons first birthday she gave him a roll of paper towels because...\"Look! he loves it, doesn't even know whether it is a toy or not!\" At age 3 for Christmas she gave him some random toiletries and cleaning supplies she bought at the dollar store, wrapped them and everything. Now I have to give my boy credit on those...after he opened them he said \"This Christmas Sucks!\" which caused major drama for my wife and I.",
   "created_utc": 1692146236,
   "score": 163,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd3dzi",
   "message": "How fake they are. They just care about their image and how they appear to others, very little, if anything, is genuine about them.",
   "created_utc": 1692145411,
   "score": 60,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd4yj6",
   "message": "My MIL? Love her, she's great.  \n\n\nMy FIL? Cheated on my MIL with her sister, and still sees said sister on a weekly basis while somehow still remaining married to my MIL. Bought himself and the sister a new car while my MIL drives a 20-year-old F-150. When he is home all he does is drink Budweiser from 11 am on while watching TV. And complains about everyone else in the family. Doesn't come to his grandkids' birthday parties and just hands us some cash to go buy something and to say it's from him. On several occasions, he's been at nice dinners and gets drunk and belligerent to the point of embarrassing everyone with him. \n\n\u0026amp;#x200B;\n\nSo when it comes to my FIL, to answer the question...just about everything.",
   "created_utc": 1692146066,
   "score": 61,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcyq57",
   "message": "All the meth, thievery, and abuse of people kind enough to try to help them.",
   "created_utc": 1692143502,
   "score": 58,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdbjvz",
   "message": "There's nothing I hate about my in-laws but my MIL occasionally says some things that give me pause when she's in the room. For example, she wished me a happy birthday recently to which I casually replied, \"Just another trip around the sun.\" My comment resulted in a 20 minute lecture about how the sun actually orbits the Earth based on her visual observation of it rising in the east and setting in the west every day. I often wonder how much of my partner's childhood trauma is a direct result of her mother's \"unusual\" beliefs.",
   "created_utc": 1692148831,
   "score": 55,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd8x70",
   "message": "My sister-in-law is one of the most toxic people I know. Total narcissist. Everything must be all about her at all times. And her husband is a codependent simp who enables her behavior.\n\nThe rest of my in-laws are cool though.",
   "created_utc": 1692147720,
   "score": 97,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdavzf",
   "message": "My SIL is fun to party with but doesn’t know when to cool it. She’s had a lot of jobs and some have included professional photography and photography as a hobby. SIL is from way out of town and volunteered to be our wedding photographer. Not just take pictures, but as a major gift to us, the whole package. We discussed what it entailed and thanked her plenty. Night before she wanted to throw a party and we asked her not to knowing how much she drinks. SIL ended up showing up to hair and makeup barely able to stand and never really recovered into the wedding.\n\nAnd yes, people have talked to her about her drinking since.",
   "created_utc": 1692148554,
   "score": 36,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcorou",
   "message": "Blocking my view when Christmas presents are being unwrapped",
   "created_utc": 1692139463,
   "score": 27,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd4kut",
   "message": "Nice try MIL",
   "created_utc": 1692145909,
   "score": 51,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd7y4y",
   "message": "Outlier here I think.\n\nI love my in-laws like my parents, and I have known them since elementary school (I married my childhood friend), but here goes: Please stop telling old stories about me and my wife to my kids. I didn't need them knowing I was a wimpy kid that needed to be protected by my wife from bullies.",
   "created_utc": 1692147314,
   "score": 47,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd0u5r",
   "message": "They are amazing people. If the world was like them, we'd have kindness and peace.\n\nBut since you asked, broke-people mentality. They live beyond their means and the *second* you bring up anything regarding budgeting/saving/investing, you (me) are viewed as cheap/don't know how to live life/etc.",
   "created_utc": 1692144362,
   "score": 68,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcowe5",
   "message": "Nothing.  I won the in-law lottery.",
   "created_utc": 1692139516,
   "score": 92,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd2pm7",
   "message": "They are very nice people. They paid for our wedding and honeymoon and I can't thank them enough for doing that for us. The only thing I dislike is how they talk to their daughter. They promise things and then act like they didn't promise anything. Ever since I've known her, they treat her like she knows nothing and she has to do everything that they say otherwise they won't help her at all.",
   "created_utc": 1692145133,
   "score": 20,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd790i",
   "message": "My mother in-law abused my wife physically and emotionally. She is the cause of her PTSD, and I suspect, her anxiety. The woman is a narcissist who uses people and then drops them if they lose value. When my father in-law was in the hospital for his third stroke, she preyed upon his family, asking them for money to pay her bills. No one knows what she did with the money, and my heavily disabled father in-law swiftly lost his home (despite the loans supposedly being for the mortgage payment). We have gone as no contact as possible",
   "created_utc": 1692147021,
   "score": 20,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdnoj9",
   "message": "Their concept of time. They're all always shamelessly late to everything. And they all act like it's a cardinal sin to be early. They think they're \"early\" if they stroll in just in the nick of time. \n\n For example, I've told them, \"We have to be there at 7,  and it's a 20 minute drive, so we should leave by 6:35 at the latest. So you need to be at our house at 6:30 so we can load the car\". \n\n\"Why so early? I'll be at your house at 6:45\".\n\nThen they show up at 6:55 and can't understand why I'm pissed. And we get to where we're supposed to be at 7:15 and can't understand why everyone there is pissed. \n\nAt least my husband has gotten better about it. He still hates to be anywhere early but he plans and takes steps to be on time, not late.",
   "created_utc": 1692154017,
   "score": 20,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwczonc",
   "message": "MIL refuses to discuss anything that bothers her. She just goes dead silent for a moment, then pivots to a different subject.",
   "created_utc": 1692143896,
   "score": 35,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdaelm",
   "message": "How critical they are of my partner. He is loving, kind, smart and unique. Nothing he ever does will ever be enough for them. As a result he has major anxiety and perfection issues. He’s hard on himself and constantly apologizes over minor things. I wish he knew how awesome he is. For this reason I’ve chewed out both his dad and mom with them being clueless as to why. What issues? I’d love to be close to them if things were different; however see how dysfunctional they are and am totally okay with zero contact.",
   "created_utc": 1692148349,
   "score": 17,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd1j3c",
   "message": "My MIL shows no emotions at all, can’t tell what the hell mood she is in. My FIL RIP was just genuinely fun to be around, he was a cut up, and would go out of his way to make sure everyone is having a good time.",
   "created_utc": 1692144647,
   "score": 14,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd304z",
   "message": "They have no concept of privacy, and they are fighting each other all the time, then come to me as if they wanted me to take sides. Nope.",
   "created_utc": 1692145253,
   "score": 14,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd11l5",
   "message": "Never met them because my wife is from Kenya but moved to Canada to be with me; but from what my wife told me, I'm not fond of her father because he cheated on my wife's mom decades ago and my wife has a half sister that she found out about a year ago.  \n\nMIL forgave him, but I'm not sure if that's because of financial need or if they made things work.",
   "created_utc": 1692144447,
   "score": 12,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd3b86",
   "message": "That they exist",
   "created_utc": 1692145378,
   "score": 10,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd00fd",
   "message": "My husband has a twin. Both of them feel anything of his is hers. This seems to include full access to our house, fridge, computer, TV and occasionally my wardrobe. Also he tells her everything so anything I want to confide in him will also go to her and I guess whoever she chooses to talk to. I think I actually hate her. Also MIL for being a dick, ditto FIL.",
   "created_utc": 1692144027,
   "score": 32,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd0cdm",
   "message": "I'm divorced now but when I was married I honestly liked my in laws. They had much different upbringings than me but surprisingly similar worldviews. MIL could be kind of rude with service workers like waitstaff and what not, though, which is a big turn off to me.",
   "created_utc": 1692144161,
   "score": 9,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd38fz",
   "message": "Hate is a bit strong, but I judge my step-MIL because she posts EVERYTHING on Facebook. I swear she can’t take a shit without posting",
   "created_utc": 1692145347,
   "score": 9,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcwz4j",
   "message": "For the most part, nothing, I love them more than my own parents. However, my MIL can be a little mean and impatient with my FIL, his hearing is not that great and she knows that. I wish she would just chill a little.",
   "created_utc": 1692142788,
   "score": 15,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwde0qs",
   "message": "My husbands mother and 2 sisters really went out of their way to make me feel unwanted and unliked early in our marriage. They judged me, gave me the cold shoulder. Criticized everything I did. Jokes on them. My husband and I have been married for 30 years. So I learned a lesson: screw the naysayers.  Haters gonna hate. Lol",
   "created_utc": 1692149853,
   "score": 16,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcpn4w",
   "message": "They are dead. My MIL died before we had kids. My FIL died in 2020 of a stroke, but he had Alzheimer's by that point, and we think he wasn't sure who his daughter was on some visits.\n\nI'm sure their grandkids wished they were still around.",
   "created_utc": 1692139810,
   "score": 15,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd3cc3",
   "message": "I got sooo lucky with a narcissist in law but also she lives her own life that doesn’t involve me clubbing out with her anymore so yeah. This lady had the audacity to say I didn’t want to let her family see my baby first day out of the hospital, while her family was on the way to my house (which is a couple of blocks away) and she stayed home. Smh.",
   "created_utc": 1692145391,
   "score": 6,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd4d5i",
   "message": "nice try, wife",
   "created_utc": 1692145819,
   "score": 6,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd6ssw",
   "message": "They live in FLA.  I hate FLA.  I like my in-laws.",
   "created_utc": 1692146832,
   "score": 7,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdhhyz",
   "message": "I loved them so much.  They expressed their love for me,  for almost 40 years.  I hate they got old and died.",
   "created_utc": 1692151318,
   "score": 12,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcx8jn",
   "message": "My mother-in-law is a religious zealot who legit hates more than half of her children. One is a lesbian, one is trans, my wife is non-binary, their other brother is gay. But she doesn’t know he is.",
   "created_utc": 1692142893,
   "score": 20,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcz7qp",
   "message": "Same thing I hate about my own family- religious extremists. But TBH, his are not nearly as bad as mine.",
   "created_utc": 1692143703,
   "score": 11,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwczo9x",
   "message": "Alcoholism",
   "created_utc": 1692143892,
   "score": 5,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdbcmo",
   "message": "That they are no longer with us. \n\nMy first set were whatever. \n\nMy second set were great. They treated my kids like they were their flesh and blood grandkids. The first Christmas my kids lived with us they took all the seats out of their Chevy Venture LWB minivan and packed it full of toys clothes and other gifts for my kids. They never missed calling them on their birthdays. \n\nI would do anything for them. My MIL fell and broke her ankle after her husband passed. I worked at an elementary school and had the summer off and the kids were off with their mom. So I packed a bag and drove 7 hours to help her out for a few weeks.",
   "created_utc": 1692148749,
   "score": 5,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwddicf",
   "message": "I had a step monster in law from hell. It took about two hours with her before she started the southern Baptist crap and how everything was hell. My kids figured it out when they were young. My ex wouldn’t stand up to her and felt obligated to visit, etc.",
   "created_utc": 1692149640,
   "score": 4,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdvd6k",
   "message": "They’re racist, homophobic trump humping  Mormons.",
   "created_utc": 1692157739,
   "score": 8,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcz449",
   "message": "Nothing, now that they're dead.",
   "created_utc": 1692143661,
   "score": 4,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdl4s2",
   "message": "I'm not even getting started on this one.",
   "created_utc": 1692152880,
   "score": 4,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd4g7r",
   "message": "My in laws are great. I always wanted a warm loving family that welcomed and accepted me and I finally got it with my in laws.",
   "created_utc": 1692145854,
   "score": 6,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd129q",
   "message": "I really really like my in-laws. That being said…\n\nThey keep a “Young Earth” book on their coffee table. They are super conservative and religious.",
   "created_utc": 1692144454,
   "score": 6,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdfwsr",
   "message": "1) ALWAYS late\n\n2)Talking endless shit.",
   "created_utc": 1692150646,
   "score": 3,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdikfm",
   "message": "They cook their bacon to an absolute C R I S P",
   "created_utc": 1692151769,
   "score": 3,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdl47j",
   "message": "Constantly undermining my parenting and treating my husband and I like we're children. It's so frustrating especially since we live next door.",
   "created_utc": 1692152873,
   "score": 3,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdrnxp",
   "message": "The gossiping about us to anyone who will listen. And the guilt trips. Every single guilt trip tactic to get us to drag our family of four across the country to go see them. Also, that they were absolute shut parents to my husband. Both allowing physical, mental, and verbal abuse to run rampant and then have the audacity to expect a relationship with their adult child.",
   "created_utc": 1692155892,
   "score": 3,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwduy37",
   "message": "That they weren't my parents.  I love my in laws.  He won't say it but my wife says my FIL feels I'm the son he wishes he had and he's definitely the Dad I wish I had.  Dude rocks.",
   "created_utc": 1692157519,
   "score": 3,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdvc6e",
   "message": "That they passed away :(",
   "created_utc": 1692157725,
   "score": 3,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcuy3c",
   "message": "That she died too soon and won't get a chance to see her grandchild grow up.",
   "created_utc": 1692141965,
   "score": 5,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdehi8",
   "message": "My wife is more mature than her mom. I think she’s not capable of being serious. I know I’m wound tight, but she’s the complete opposite.",
   "created_utc": 1692150046,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdh3mw",
   "message": "That I lost them in the divorce. They were the closest thing to family I have ever felt.",
   "created_utc": 1692151150,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdh4lo",
   "message": "My MIL blatant racism…",
   "created_utc": 1692151161,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdi4ab",
   "message": "Mil is the sweetest person on earth, but she loves to touch people. I dislike anyone but my husband and son touching me. No reason for it, I just don't want to be touched. \n\nFIL looks like the villain from Up and acts like Sheldon Cooper, only throw in Boomer humor/racism with it. The important thing is, HE knows he's charming and the smartest person in the room, even if no one else thinks so. \n\nLuckily, MIL divorced FIL 30 years ago.",
   "created_utc": 1692151581,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdi7ng",
   "message": "My wife’s dad is a very “I’m right, or you’re wrong” kinda person. If he’s not right, he refuses to admit it and will just leave and not speak to you for a long time. Then show back up and act like nothing happened.",
   "created_utc": 1692151621,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdkmo9",
   "message": "That they were neglectful parents. I realize that they weren't in the best financial situation while my partner was growing up, but they kept his learning disability diagnosis a secret from him and he was left to his own devices most of the time. He's the youngest by a lot, and likely was not planned. He grew up without being encouraged to do well in school or to set goals in life. He also struggled a lot with affection early in our relationship because it wasn't modeled in his home growing up.\n\nMy partner doesn't hold it against them though, merely sees his childhood as a way to not raise our child so I have to commend him on that. I just wish he had been given the support and love a child deserves too.",
   "created_utc": 1692152659,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdkxxs",
   "message": "That they are dead. They were pretty awesome people.",
   "created_utc": 1692152797,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdmolh",
   "message": "That my MIL is dead and i never got to meet her.\n\nThat my husband and his brother went no contact with his father so i dont know him that well. I do FB chat him our son's life updates.\n\nThat my BIL lives too far away. I won the BIL lottery with him. He's  awesome!",
   "created_utc": 1692153568,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdmvlf",
   "message": "Learned helplessness and a know it all attitude",
   "created_utc": 1692153655,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdmxti",
   "message": "My FIL is a piece of shit alcoholic that makes my wife an emotional mess. I’d like to think she’ll feel better after he finally drinks himself to death, but I doubt it. 23 years of putting up with that fucking guy and his ability to make my wife sad.",
   "created_utc": 1692153683,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdn7ek",
   "message": "My mother in law is always cooking good ass food and making me fat. It’s all her fault!",
   "created_utc": 1692153805,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdnf9c",
   "message": "They blame me for us moving away, even though it was my wife's idea. She's told them it was her idea. But they need a scapegoat.",
   "created_utc": 1692153902,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdnjyz",
   "message": "My MIL is a major narcissist and racist.",
   "created_utc": 1692153961,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdope0",
   "message": "They don’t ever communicate to my wife about really important shit. \n\nHey 👋 driving down for radiation let’s meet up \n\nWhat … 👀",
   "created_utc": 1692154481,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwduzwy",
   "message": "Lotta MAGA. Trash.",
   "created_utc": 1692157545,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdw1xh",
   "message": "How shitty their relationship is. It's gotten bad recently. My mil was diagnosed with terminal cancer a few months ago and my FIL immediately acted as if she's already dead. Ever since I became a part of that family, almost 20 years ago, I wondered why they were together. Mom has moved out of the house and wants to sell it; FIL wants to sell and move to Florida where he doesn't know anyone and keeps saying, \"no on will take care of me.\" FIL makes no sense and I'm here for the ride. It sadly makes me happy that my family is dead.",
   "created_utc": 1692158101,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdx36h",
   "message": "Die hard maga. And Christian",
   "created_utc": 1692158658,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdxeua",
   "message": "That they're all toxic assholes.",
   "created_utc": 1692158830,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwe1hpw",
   "message": "My MIL still blames me for moving her daughter away and still cant believe we moved for better economic opportunities 11 years ago. She will call my wife and cry almost every other night about how she doesn't know how much time she has left and refuses to visit even when we offer to pay the travel expenses. She puts on this poor me sob story everytime we visit my GOD just STFU!",
   "created_utc": 1692161152,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwe39er",
   "message": "Not married but my girlfriend's parents are always doing low key, casual racism.",
   "created_utc": 1692162220,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwe6i6u",
   "message": "Mine mother in low is mentally unstable. \nThat the jist of it.",
   "created_utc": 1692164304,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwefvx3",
   "message": "The drinking culture",
   "created_utc": 1692171030,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwf2mc0",
   "message": "They live 3,500kms away. It’s a little closer than I would like.",
   "created_utc": 1692186762,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcom6h",
   "message": "Their constant need to invite us out",
   "created_utc": 1692139402,
   "score": 5,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd8koo",
   "message": "They disowned my wife for marrying me and they hate me because I'm non-binary",
   "created_utc": 1692147575,
   "score": 4,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdi2qm",
   "message": "When we go to my in-laws, we never leave the house. We sit in the den, watch TV twelve hours a day and listen to my father-in-law crap on anything and everything he sees on the idiot box. We finally told them that the condition for our coming was to turn off Fox News. \n\nAnd it's not because he's 84 and a grump old man. He's been doing this for the past thirty years. Everybody, everything is stupid but him. Just this constant stream of negativity. \n\nAnd my mother-in-law isn't much better. She will sit there and talk about everybody else under the sun and how stupid those people are. I've started just leaving for a couple of hours for a sanity break. I have to demand my children go visit them once a year.",
   "created_utc": 1692151563,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcrzcq",
   "message": "They eat only a small amount of acceptable things.",
   "created_utc": 1692140761,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd66c4",
   "message": "I loved my mother in law, my only complaints are uninformed political views and the minor annoyance of mispronunciations. Stuff like Walmart being Wall Marks",
   "created_utc": 1692146573,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdgqfg",
   "message": "My in-laws live with me, so I have a lot. But the thing that pisses me off the most about my MIL is that she has a short temper and she always thinks she's right. She'd yell at my FIL for the stupidest reasons, like when she needs him for something trivial and he's in the shower, or when he does something perfectly fine but not the way SHE wanted it done. She doesn't yell at me, but I know when she's upset with what I do because she'll grumble or slam the door etc. The last time she did that was when she was helping my 9yo son put on his shoes, and I told my son to put on his shoes on his own, and she started slamming things around. Wtf. He's 9. He can put on his own shoes. Don't fucking spoil him.\n\nMy FIL is a saint for putting up with my MIL. But he sometimes annoys me too. He's very educated but lacks common sense. For example, we had a wasp nest outside our window a few months ago. I was going to go get the wasp spray, but while I was getting it, he decided to poke it with a stick instead. Yeah, he got stung. He also likes to do things that IMO are a huge waste of time and money. For example, he likes to wash the garage...wtf? Like as soon as he finishes, it gets dirty again because, you know, that's where we park the cars...and cars are dirty... *Insert Jackie Chan meme*\n\nEvery winter, he (and also my MIL) makes me set up a greenhouse in our backyard so their stupid plants won't freeze to death. Don't even get me started on the plants...they just like the idea of planting but have no idea how to raise the plants... anyway, back to the greenhouse. I put it up in the winter, and when it gets warm again, they make me take it back down. They say it's because the greenhouse takes up too much space. But we literally put the greenhouse in the corner where no one goes. Then they change their tone and say it's an eyesore...but they were the ones who wanted it. I argue back and tell them the greenhouse is probably the best environment for the plants because I installed fans for circulation and also grow lights on a timer. But nope, they want to move the plants back out in the yard, tucked in a corner where there's shade for probably 50% of daytime. And where it also burns to death in the heat of summer. But you know, a greenhouse with somewhat of a controlled climate is just such a eyesore, moreso than dead plants. And when they die, they want to go buy more if the same plant to replace the dead one, but they don't change anything.\n\nThe only reason why I put up with them is because they help take care of my kids while my wife and I are at work. Also happy wife, happy life, right?",
   "created_utc": 1692150995,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdipq8",
   "message": "Their I got money so I’m superior attitude. \nOne of the first things they said when we started dating was “ he has no money and is covered in tattoos. And I heard he smokes weed” \nI’m still covered in tattoos added about 100 more, don’t have much money but I own a house outright , paid off my wife’s car and have another car that does the job. Don’t smoke weed anymore tho. Thanks to me wife.",
   "created_utc": 1692151833,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdt6w3",
   "message": "You know those white women who start drama with black women and then turn around and act the victim.  My MIL does that.  \n\nSpends too much money on a gift you already said you didn't want(Kurig) and gave multiple reasons.  Open up the gift, smile politely and say thank you and put it to the side with the other items. 20 minutes later she just randomly throws a tantrum about how we don't like anything she gives us.  We said NOTHING other than thank you.  We didn't act crazy excited but we controlled our faces and were polite\n\nShe cooks exactly the food you don't like and then gets upset when you try it but don't like it. \n\nSo much around the bad food and her two face behavior when she is around her family. \n\nShe magically made it infertility problems all about her. Should have never told anyone tbh",
   "created_utc": 1692156633,
   "score": 2,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdvfy9",
   "message": "MIL is incredibly overbearing to my wife",
   "created_utc": 1692157781,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcowyz",
   "message": "Their constant need to invite us out",
   "created_utc": 1692139523,
   "score": 0,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdp0jn",
   "message": "They are both ☠️ but we lived with them for a year on the living room floor. (Worst year of my life) but kept my mouth shut \u0026amp; head down. I was giving them $100 a month on the 1st \u0026amp; was never late it could be January 27th, they will let me know everyday that it’s almost the 1st and they can’t wait to go to bingo. One day they was moving into a new house \u0026amp; said we could stay there \u0026amp; this time, have our own room. Something in me just made me tell them, I would rather sleep in the job parking lot because I go on a lease with them.",
   "created_utc": 1692154625,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdq6c7",
   "message": "I hate that my father in law was a pig headed son of a bitch and refused the vaccine. Left my wife with ashes.",
   "created_utc": 1692155173,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdtvwc",
   "message": "They don't come over and take their grandchildren enough. We made them for you, why do we have to raise them too!",
   "created_utc": 1692156979,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwer4ve",
   "message": "Their kid they gave me 🥴🤣",
   "created_utc": 1692179698,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdqix1",
   "message": "How they have done absolutely nothing for myself my husband or my children, yet my husband thinks they deserve our time and attention. They are morbidly obese, with no desire to change. They think the world owes them and they are lazy and dirty. I hate how much energy my husband gives them.",
   "created_utc": 1692155339,
   "score": 255,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwcxy4n",
   "message": "Nothing.  They are dead.",
   "created_utc": 1692143181,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd1inu",
   "message": "They died before I appreciated them more.",
   "created_utc": 1692144642,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd5tqp",
   "message": "The only thing I hate is that I never had the chance to meet my FIL. He passed away before I even met my husband 😞",
   "created_utc": 1692146427,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd6vbs",
   "message": "They kept their house at 78F when it was 15F outside last time we visited at Xmas.",
   "created_utc": 1692146862,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd9fsa",
   "message": "no boundaries. theyre still alive,",
   "created_utc": 1692147940,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwd9i1p",
   "message": "They are basically stupid. As in not trusting banks and sitting on all of there meager nest egg in cash.",
   "created_utc": 1692147966,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdb0wi",
   "message": "I hate that they've passed away. They were amazing people.",
   "created_utc": 1692148612,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdb4jr",
   "message": "That they loved my husband the least of all three of their kids and massively enabled their drug addicted mentally ill \"special\" child at my husband, mine and my kids expense.",
   "created_utc": 1692148655,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdetet",
   "message": "They are christian, right-wing, QAnon'ers. If it gravitates to politics, I feel like I can't keep up with all the conspiracy theories unless I keep my phone out to Google topics. If I don't know of some backwater story, they delight in trying to make me seem like I'm ignorant to the world's biggest news reveal. \n\nWe are getting better at shutting down these conversations with simple phrases or just walking away.",
   "created_utc": 1692150183,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdf9kk",
   "message": "FIL is the cheapest person I’ve ever met. Some of his behavior borders on criminal and MIL is the bread winner.",
   "created_utc": 1692150372,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdg84t",
   "message": "Nothing.  \n\nThey're dead.",
   "created_utc": 1692150778,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdhgew",
   "message": "We don't have any they all pass away",
   "created_utc": 1692151300,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdicsi",
   "message": "I get along great with my MIL and FIL as individual people and have close relationships with both. But good god they have a horrible relationship. It’s really awkward sometimes. I have no idea how or why they are still together. They literally hate each other.\n\nEdit: early in our relationship I attempted to gently inquire about what I had observed after getting to know my wife’s parents a bit. Before I even finished asking she just casually said “yeah they should have divorced a long long time ago, we (her siblings) all think they need to give it up”",
   "created_utc": 1692151680,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdiqt5",
   "message": "That one of them lives with me",
   "created_utc": 1692151846,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdj3px",
   "message": "That I don't have any to complain about.",
   "created_utc": 1692151999,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdkioy",
   "message": "They always put my wife down. Belittle her. Say she’s a disappointment. And try to get her to quit her (high paying) job she loves more than anything to go work as a mechanic because that’s what her dad is🙄 I swear I’d literally kill them if it wasn’t taboo and illegal. There not meant to be humans on this planet .",
   "created_utc": 1692152609,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdkzru",
   "message": "They have four kids, the only boy is their favorite and they ignore their daughters which includes my wife. The heartbreak on her every time they blow her off to go spend more time with their son is gut wrenching. They took him to Vegas, on her birthday, two years in a row.",
   "created_utc": 1692152819,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdl22i",
   "message": "The fact that they're all dead.",
   "created_utc": 1692152847,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdl3xz",
   "message": "That they live so far away",
   "created_utc": 1692152869,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdl5zw",
   "message": "They are terrible with money and have tried to drag my immediate family down with them. \n\nThis has led to me stop acting like an ATM for them to our detriment and then them being resentful that we won’t support their bullshit anymore. \n\nOh and my SIL is a true narcissist who uses her brother to pick at me as she is no longer capable of hurting me directly, so she attacks him, angering me for hurting him. She even started her bullshit with my daughter who just ignores her(she’s 16 and a more functional human that SIL). Oddly enough I met my husband through her as we briefly went to college together-she flunked out but lies about it.",
   "created_utc": 1692152895,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdlb66",
   "message": "That they won't hold up to the warranty and take my wife again.",
   "created_utc": 1692152958,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdlrhr",
   "message": "That I am too nice of a guy to tell them I didn’t want to live with them.",
   "created_utc": 1692153162,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdlvv3",
   "message": "Their refusing to acknowledge our kid(s) due to not being baptized in Christianity. They now do but it took years. What's even worse is my spouse won't acknowledge it even happened. Or he'll say it's in the past. Pisses me the fuck off. Still does. They were assholes for years. I refuse to go see them. I'd rather study in school.",
   "created_utc": 1692153216,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdm3q6",
   "message": "Ex mil 1 smoked pot all day sometimes did laundry and made pretty horrible food. She’d pass out when sitting our kids we would come home to our kids watching whatever on tv with her snoring on the couch. \n\nEx mil 2 stole my car and drove drunk to get more booze. She very sloppily painted the kids rooms got paint on the floor because she didn’t use drop cloths. She also set up my office ignoring my request to leave the room alone. \nTold ex wife 2 that I should get over it after I explicitly said she can check on the house not stay at the house while on a trip. As long as she doesn’t go through my things. Well, my keys were in my night stand with my other things. \n\nCurrent gf’s mom… ffs… she’s a handful. Gave me the third degree upon meeting me. Only owns her house because she squatted it when her dad died. It’s in a family trust and she still squats there. Has an ok job, idk why she was judging me so hard. I made the same money she did and I’m 30 years younger. Turns out she likes to use her family for free labor. She’s a bizarre and very self centered woman that’s Christian one week and new age the next. I’m glad she’s on medication for her mind. The world is a better place with her medicated.",
   "created_utc": 1692153313,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdm6ud",
   "message": "MIL has borderline personality disorder and is just hell to be with.  It’s made worse by her refusal to get cataract surgery or hearing aids.  We’ve offered to pay.  I can come home, turn on the TV only to discover she had the volume cranked to 98.  She was so hard of hearing that she complained about her neighbors shaking the floor of her apartment.  Turns out she had the volume on her TV so loud it shook the floor.",
   "created_utc": 1692153351,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdm8ss",
   "message": "She's got health issues, blows up the toilet, and doesn't clean it, but will clean up after her dogs with no problem.",
   "created_utc": 1692153374,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdn4cb",
   "message": "I love everything about my in-laws. My wife? Not so much.",
   "created_utc": 1692153766,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdnm1d",
   "message": "The smell. They died 9 years ago.",
   "created_utc": 1692153987,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdo4m4",
   "message": "I love my in-laws to death. They are *almost* perfect. But despite his upbringing and political leanings, my FiL has some of the shittiest takes on raising minimum wage, and my MiL does really bad at handling criticism and starts to project and deflect.",
   "created_utc": 1692154218,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdo9oy",
   "message": "Manners of my FIL. He talks on speaker phone and very loudly. No one wants to hear his conversation and it's just rude. Also burping out loud in restaurants and acting like it's normal and no big deal. That is the one that really frustrates me because I notice people looking at our table and that's embarrassing for an adult to bring attention like that from a damn burp.",
   "created_utc": 1692154280,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdob93",
   "message": "I love my MIL. Great person full of what you’d consider typical southern hospitality, just not great with money. At all.",
   "created_utc": 1692154300,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdorl8",
   "message": "The constant criticism. I married their only son and nothing I do is good enough. My house is never clean enough, my one year old doesn’t “behave”, and my cooking sucks. The passive aggressiveness is so overwhelming.",
   "created_utc": 1692154510,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdos14",
   "message": "My MIL is overly Christian... And reminds us regularly we're going to hell because we don't go to church.  My incredible wife responds with either, see you there or, that's where all our friends are going, why wouldn't we want to go!",
   "created_utc": 1692154516,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdp6qk",
   "message": "They live too far away. I wish we could spend more time with her aunts, uncles, and cousins. They’re a blast.",
   "created_utc": 1692154705,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdpbin",
   "message": "My MIL can't hear worth shit and she refuses to wear hearing aids. Not old age related, as she's had hearing problems half her life. She can seemingly hear everyone that talks to her except for me. So I have to talk like the character Andy Samberg plays in Parks n Rec, and my family little recoils when that happens.",
   "created_utc": 1692154766,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdpcbo",
   "message": "That they are both dead. I really miss them...",
   "created_utc": 1692154777,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdpczm",
   "message": "They still use ringers on their phones. Beeps constantly",
   "created_utc": 1692154786,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdpm20",
   "message": "The conservative fundamentalist christianity and the lack of realization that no one wants to talk with them about that shit.",
   "created_utc": 1692154905,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdpsmd",
   "message": "They seem immune to my raw machismo.",
   "created_utc": 1692154991,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdq08d",
   "message": "I'd have to say it's knowing that they weren't good parents and the residual effects of that on their now adult children.",
   "created_utc": 1692155093,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdqx6z",
   "message": "Widow here - I was just absolutely blessed with two sets of in-laws and with fresh sarcasm seeping from that statement I am now going to remind myself of the quote, “if you have nothing nice to say then don’t say anything at all.”",
   "created_utc": 1692155532,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdr3ie",
   "message": "I dont hate anything about my in-laws really. But if i had one complaint it would be that theyre not very clean. My wife is thankfully a very clean person. Our house is as clean as can be for a married couple having 3 animals and a toddler. But her side of the family just isn't very neat. And they know it too. They just don't care. Almost all of them have good money, but they just don't show it. Simple living and not cleaning every week adds up.",
   "created_utc": 1692155615,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdryok",
   "message": "My MIL is very controlling. She wants everything her way or she will make you feel guilty. My husband’s family does a lot of things that I don’t agree with having my kids around all the time; drugs and drinking. My FIL also has different people over all the time, someone new that we’ve never met. Don’t want complete strangers around my kids. They are more than welcome to come over to our house to see the kids. We live five minutes down the same road but guess who never come to see their granddaughter’s? Because it’s not at their house and on their terms. I do have to say though that his mom will help us out if we need it in regards to money like when I was on maternity leave and didn’t get paid but two weeks. However, though they help and we are grateful, it’s hung over our head. They absolutely aren’t the worst. \n\nMy SIL—my husband’s sister—is a huge pot stirrer and loves to cause drama when she’s not the center of attention. She talked a lot of crap about me and my family at our wedding. I forgave her. She then physically tried to attack my mother who was defending me once while SIL was yet again saying mean things about me. I didn’t talk to her for a long time after that until our first daughter was born and she extended an olive branch. It was okay for a year until our daughters first birthday until she caused drama again by trying to make our child’s birthday about her and accommodating her. That was my last straw. I haven’t had a relationship since with her but she did manage to comment on a picture of her brother and I on social media putting on a show for their family as if she wasn’t invited for something we did for his birthday(of course she wasn’t invited as I don’t associate with her but most of their family don’t know that and she was trying to make me look bad). Somehow I always get called a b*itch by her and this time around I also got told that I look like a fat marshmallow—I was also pregnant with my second daughter when she was insulting me like this. Real nice thing to say to your brothers wife. \n\nNeedless to say I’m not a huge fan of my in-laws.",
   "created_utc": 1692156035,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdstbq",
   "message": "I hate that they’re gone. I never met my wife’s mother, she passed before my wife and I met, but from all the stories I’ve heard she was a fantastic person. My father in law though, I was close with. He was quiet, but so supportive. He loved his kids and grandkids so much, you could see that was what kept him going through some health challenges.",
   "created_utc": 1692156447,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdt5tb",
   "message": "My SIL homeschools her kids in a Bible-based, unregulated, hogwashery-ridden make-believe educational program because the secular world might corrupt her children. I have a masters degree in counseling, and I can draw you a map of how many fallouts she is creating in her children's future due to her own inability to deal with her traumas and insecurities. I cannot even say the word BUTT in front of her 8 and 11 year old children. Forget the dinosaurs-are-fake narrative, I just see all the future casualties she is blindly creating so that she can be certain that Taylor Swift never comes through the speakers, Family Guy never comes on the TV and the kids never know what it feels like to eat Halloween candy for a week.",
   "created_utc": 1692156617,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdtacj",
   "message": "They buy two litre bottles of soda, which they keep in the pantry. Then they open them warm and pour the warm soda over ice- which is completely flat at that point",
   "created_utc": 1692156680,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdubpt",
   "message": "Weekly family dinners.",
   "created_utc": 1692157201,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdueji",
   "message": "My MIL is a super right wing hardcore Bible thumper who donated $25k to Trump. Need I say more?",
   "created_utc": 1692157241,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwduiiq",
   "message": "The main thing I would say I dislike (not hate, too strong of a word) is my SIL has depression issues and my husband's family enables her behavior, making it worse, rather than encouraging her to get help.",
   "created_utc": 1692157297,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwdunor",
   "message": "My MIL is a judgmental Catholic. There is nothing that can't be explained with \"It's God's will\".",
   "created_utc": 1692157370,
   "score": 1,
   "submission_id": "15s7ki7"
  },
  {
   "comment_id": "jwf0j2g",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15s7ki7"
  }
 ]
}