{
 "submission_id": "15s7qua",
 "title": "How do you feel about the proposal by native Hawaiians to demolish most of the expensive hotels and resorts, and kick out most of the tourists?",
 "selftext": "",
 "created_utc": 1692139773,
 "permalink": "/r/AskReddit/comments/15s7qua/how_do_you_feel_about_the_proposal_by_native/",
 "score": 34,
 "url": "https://www.reddit.com/r/AskReddit/comments/15s7qua/how_do_you_feel_about_the_proposal_by_native/",
 "comments": [
  {
   "comment_id": "jwcr4ha",
   "message": "Hawaii survives on tourism. Without it the islands would become another Haiti",
   "created_utc": 1692140410,
   "score": 32,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcsaoe",
   "message": "I mean their entire economy is tourism sooo.....",
   "created_utc": 1692140888,
   "score": 26,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd0bey",
   "message": "How long before people start dying of starvation from the lack of tourist revenue?",
   "created_utc": 1692144151,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd0pdz",
   "message": "It would be better if they kicked out a lot of the people who aren’t natives and then run the resorts themselves instead of massive companies running them.",
   "created_utc": 1692144309,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcq1i5",
   "message": "They don't own said hotels so that would be quite criminal.\n\nAnd good luck having an economy without tourism.",
   "created_utc": 1692139969,
   "score": 19,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd1f70",
   "message": "Never been but I feel like tourism Is what keeps people going and the economy going.",
   "created_utc": 1692144602,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd1u2e",
   "message": "I'd say good luck...",
   "created_utc": 1692144772,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcqdru",
   "message": "If this is even true, Their economy would be decimated. I get why they may want their land back, but destroying the buildings and kicking people out will most likely only crash their economy and they wouldn’t be able to restore the land that’s already been built on. I don’t know. Maybe it’s a shit take, but change takes time, and a drastic decision like this wouldn’t end well\n\nEdit: it would also ruin their economy to end tourism, and yeah they have other ways of making money, sure, but tourism is a huge part of that. If they cut that out, where would they get the money to tear down these buildings and restore the land??",
   "created_utc": 1692140107,
   "score": 10,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcsh85",
   "message": "That sounds like the set up for a hilarious dumpster fire!",
   "created_utc": 1692140962,
   "score": 4,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcpy5u",
   "message": "Can vote in politicians who will change their state constitution",
   "created_utc": 1692139932,
   "score": 2,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcpya8",
   "message": "Source?",
   "created_utc": 1692139933,
   "score": 2,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcvp96",
   "message": "What for?",
   "created_utc": 1692142271,
   "score": 2,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcsa52",
   "message": "I feel that ship has sailed, the colonists have won, and the Native Americans aren't going to be retaking their ancestral lands any time soon either.\n\nDon't get me wrong, I love the thought of it and would support it if I could, but it's not a winning battle at this point in history.",
   "created_utc": 1692140882,
   "score": 3,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcvros",
   "message": "I support any measures that would help the natives reclaim the occupied land. It's a shame that they themselves, cannot afford to stay in such expensive places, despite them being built on their native lands. \n\nThe plan should encourage native Hawaiians to reclaim the land and convert it to housing owned by them, where they can live affordably and sustainably on their native lands. I wouldn't mind the U.S. government allocating a budget to help accelerate the refunding and purchasing process of the targeted lands. The natives should also ensure that some of the reclaimed land is always being used to both, maintain the economic benefits of their tourism industry, and, for the conservation and education of their culture.",
   "created_utc": 1692142298,
   "score": 2,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcq2h9",
   "message": "It’s always a tense battle between people who grew up in a city/county versus the new arrivals from outside.\n\nSan Francisco.\n\nAustin.\n\nDenver.\n\n- - -\n\nAnd now.. Hawaii (or at least, Maui island in Hawaii)..\n\nIf Oprah wants to buy land in Hawaii, can locals stop her? It’s a free market, the buyer with the most cash gets to buy the most land. No?\n\nOprah is accumulating vast amounts of land in Hawaii. Why does that translate to “kick out the hotels, kick out the tourists”?\n\nAlso, how will Hawaii earn money without the tourists?",
   "created_utc": 1692139979,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwczl4p",
   "message": "Sounds hilarious, I'm in.",
   "created_utc": 1692143855,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwcxxbh",
   "message": "I feel that I could've sworn Hawaii belonged to the United States. If that kind of ludicrous proposal manages to get traction (which I doubt it will, Hawaiians are well aware that their entire economy is tourism-based), maybe we need to remind them of who's in charge.",
   "created_utc": 1692143172,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd0ha1",
   "message": "as a croatian, i agree 100%, best idea ever",
   "created_utc": 1692144218,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd0on4",
   "message": "It’s kind of along the lines of my own desire to abolish private vehicle ownership and massively expand public transportation. Like I understand the dream but it will never happen",
   "created_utc": 1692144301,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwct1uj",
   "message": "I really don't care",
   "created_utc": 1692141191,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd2r9y",
   "message": "They gonna want government assistance when the states economy collapses?",
   "created_utc": 1692145152,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd4555",
   "message": "They lost so much money during Covid. They may have liked the lack of tourists, but tourism is Hawaii’s major industry.",
   "created_utc": 1692145724,
   "score": 1,
   "submission_id": "15s7qua"
  },
  {
   "comment_id": "jwd4n9e",
   "message": "Fine by me. Fuck that capitalism rape the land bullshit.",
   "created_utc": 1692145936,
   "score": 1,
   "submission_id": "15s7qua"
  }
 ]
}