{
 "submission_id": "15s9bp5",
 "title": "What's an obscure historical fact, person, or moment you know about that profoundly changed history without receiving recognition?",
 "selftext": "",
 "created_utc": 1692143623,
 "permalink": "/r/AskReddit/comments/15s9bp5/whats_an_obscure_historical_fact_person_or_moment/",
 "score": 94,
 "url": "https://www.reddit.com/r/AskReddit/comments/15s9bp5/whats_an_obscure_historical_fact_person_or_moment/",
 "comments": [
  {
   "comment_id": "jwd3q8a",
   "message": "Ignaz Semmelweis and his work on hand hygiene and infection control in the mid-19th century.\r  \n\r  \nIgnaz Semmelweis was a Hungarian physician who worked in the maternity wards of the Vienna General Hospital in the 1840s. He observed that there were significantly higher rates of maternal mortality from childbirth fever in the ward where medical students and doctors conducted autopsies before attending to pregnant women. In contrast, the midwives' ward, where there was no direct contact with autopsies, had much lower mortality rates.\r  \n\r  \nSemmelweis hypothesized that there was some sort of \"cadaverous particles\" carried by the doctors from the autopsy room to the maternity ward, causing the spread of infections. He introduced a strict handwashing protocol using chlorinated lime solution before examining patients, and the mortality rates in the doctors' ward dramatically decreased.\r  \n\r  \nHowever, Semmelweis faced strong resistance from the medical community of his time. His theories challenged the prevailing medical dogma and were met with skepticism and even ridicule. His ideas were not widely accepted during his lifetime, and he suffered both personal and professional hardships.\r  \n\r  \nDespite his contributions, it took several more decades for the medical community to fully understand the importance of hygiene and infection control. The work of Semmelweis eventually laid the foundation for the modern understanding of germ theory and paved the way for the adoption of proper sanitation practices in medical settings.\r  \n\r  \nWhile Semmelweis did not receive the recognition he deserved during his lifetime, his efforts had a profound impact on shaping the future of medicine and saving countless lives through the prevention of infections.",
   "created_utc": 1692145551,
   "score": 89,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwczi50",
   "message": "that Soviet military who avoided a nuclear war because he disobeyed an order to fire missiles",
   "created_utc": 1692143821,
   "score": 38,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwczuaq",
   "message": "Fritz Haber and Carl Bosch for making food abundant through the creation of artificial fertilizer",
   "created_utc": 1692143959,
   "score": 43,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwczn8o",
   "message": "About any famous persons great grandparents? without them doing it they wouldn't have existed. You could also say grandparents but they are sometimes mentioned.",
   "created_utc": 1692143879,
   "score": 252,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwd1o75",
   "message": "It's not considered 'historical' yet because the events are fairly new, but Ruth Bader Ginsburg didn't get the 'credit'/criticism she deserved for not stepping down during the Obama presidency to ensure the Supreme Court would maintain a Democrat majority.  \n\nInstead, she pretty much bet the entire future of the country on Hillary beating Trump because she thought it would be more symbolic and poetic for the first female president to name her successor.\n\nWell that plan went to shit because Hillary lost and RBG died during Trump's presidency.  Now there's a Republican majority and Roe v Wade is abolished (among other new developments).",
   "created_utc": 1692144704,
   "score": 48,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwd1p1d",
   "message": "Genghis Khan and his sons impregnated so many women, some good portion of all of us are his descendants",
   "created_utc": 1692144714,
   "score": 6,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwd1qfq",
   "message": " Chien-Shiung Wu was a critical part of the Manhattan project but forgotten as a chinese-american woman",
   "created_utc": 1692144730,
   "score": 1,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwd45yd",
   "message": "I went back in time and jizzed in the primordial slush of life.\n\nTrue story",
   "created_utc": 1692145734,
   "score": 251,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwd890i",
   "message": "Vincent Youmans.  Guy is pretty much responsible for jazz, most of the hits of the big band era you've heard guys like mario lanza and frank sinatra sing, rewriting the national anthem, trained most of the great broadway composers, launched the US national image on behalf of the navy in the 1920s, started the US national obsession with the tropics and coffee.  Is quite literally the most prolific composer to ever come out of the US.  Got swept under the rug so music companies could make money off his work after his death, the nation would forget about the whole \"Hail Columbia\" thing, etc.\n\nIf you've heard Join The Navy, Without a Song, or Tea for Two, you've heard his work.\n\nJoin the Navy-\nhttps://www.youtube.com/watch?v=6k4vpmOobn8\n\nI'm pretty sure the only person from the big band era who didn't rip him off was Dean Martin.  Without a song - \nhttps://www.youtube.com/watch?v=9lc8W5o16aA\nhttps://www.youtube.com/watch?v=fyEG3cCUGNk\nhttps://www.youtube.com/watch?v=Lcbn9QL9hjA\n\nDoris Day and people like that too, the quiet little mousy man was behind everyone pulling the strings - \nhttps://www.youtube.com/watch?v=D0MtzQDltr0\nhttps://www.youtube.com/watch?v=hBC5ZVlBWcY\n\nHe wrote the Carioca too - \nhttps://www.youtube.com/watch?v=Pn2awcu32zk\n\nTrained most of the Broadway people or wrote their music - \n Ira Gershwin, Otto Harbach, Oscar Hammerstein II, Irving Caesar, Anne Caldwell, Leo Robin, Howard Dietz, Clifford Grey, Billy Rose, Edward Eliscu, Edward Heyman, Harold Adamson, Buddy DeSylva and Gus Kahn.",
   "created_utc": 1692147439,
   "score": 9,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwd6kb9",
   "message": "Rosalind Franklin. Thankfully she’s not as obscure as she was for many years anymore but still not enough people know. She photographed the structure of DNA, and could’ve developed a structure from those photos. However, Watson and Crick stole her photographs and used them to create the DNA structure which they received notoriety and Nobel prizes (I think….) for",
   "created_utc": 1692146734,
   "score": 29,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwd8332",
   "message": "Norman Borlaug. Credited with feeding the world.\n\nhttps://www.worldfoodprize.org/en/dr_norman_e_borlaug/about_norman_borlaug/",
   "created_utc": 1692147371,
   "score": 8,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwd9pgh",
   "message": "Tesla for a while there about the radio",
   "created_utc": 1692148052,
   "score": 3,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwdax26",
   "message": "Hannibal didn't lose the war because of the mountains, he lost because he was heavily constipated from a diet of high protein and almost zero fiber, the constipation got so bad that he couldn't think anymore and thus couldn't command his army strategically well. It was very very bad constipation",
   "created_utc": 1692148567,
   "score": 18,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwd7wyo",
   "message": "Nancy Reagan, after bad press about her spending lavishly, consulted “their” astrologer about improving her image. The result was Just Say No.",
   "created_utc": 1692147300,
   "score": 10,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwd9d0h",
   "message": "Henry Clay. Not obscure to people who know basic American history, but definitely obscure to most of the public. He wasn’t a President ever, so who the hell would know him?",
   "created_utc": 1692147907,
   "score": 6,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwd6lod",
   "message": "John Money. Pedophile researcher who laid the groundwork for todays latest fad",
   "created_utc": 1692146749,
   "score": 253,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwdhiss",
   "message": "Norman Borlaug. Plant pathologist who’s revolutionary Work has saved billions  from starvation. Hey",
   "created_utc": 1692151328,
   "score": 5,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwdrsga",
   "message": "Tom Pendergast. Missouri political boss/crime lord during the 1910's to the 1940s. He got Harry Truman elected to Congress in a relatively dark horse victory. Of course, Truman would go on to become the VP of FDR and then president of the United States himself, and was responsible for the atomic bombings of Hiroshima and Nagasaki and the policy of containment with the USSR. Without Tom Pendergast, very well none of that could've happened.",
   "created_utc": 1692155953,
   "score": 8,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwdzq1j",
   "message": "Modern exterior doors always open outward. This is due to the triangle shirt waist factory fire.",
   "created_utc": 1692160125,
   "score": 5,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwe44em",
   "message": "Henrietta Lacks \nShe was an African-American whose cancer cells are the source of the HeLa cell line, the first immortalized human cell line and one of the most important cell lines in medical research. Her cells were taken without her permission and her family didn’t know the magnitude of how important her cells were until years later.",
   "created_utc": 1692162758,
   "score": 4,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwdomm8",
   "message": "Many think the Treaty of Versailles was a harsh punishment for Germany but I don’t think it ends there. I think it’s the biggest/costliest mistake in human history",
   "created_utc": 1692154446,
   "score": 5,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwdmglu",
   "message": "Hernan Cortes was a bloodthirsty man who conquered the Aztec Empire. Him and his small army persuaded the neighboring tribes of Central Mexico to join them in their plan to overthrow and destroy the Aztecs. Cortes is directly responsible for an attempted genocide of the Aztecs. They besieged the Aztec capital, forced women and children to die of starvation and smallpox and killed an estimated 100,000 people.",
   "created_utc": 1692153467,
   "score": 5,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwdop4g",
   "message": "Slaves didn’t build the pyramids. They were skilled workers that were paid. Also, it’s unlikely that Jews were ever in Egypt or enslaved making the Passover story a myth. Evidence is a bitch. Shocker, another Bible story is not true.",
   "created_utc": 1692154478,
   "score": 8,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwdwr0g",
   "message": "The fall of Constantinople and the end of the Roman Empire (aka Byzantine Empire) had a profound effect on the world. First on the Renaissance through refugees and Ancient Greek and Roman writings that went to Europe.\n\nSecond, I also believe that it lead to Columbus’ travels because of the impact on trade with China and India becoming more dangerous and costly so alternative routes were being sought. I’m not a scholar though so I could be profoundly mistaken.",
   "created_utc": 1692158473,
   "score": 2,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwdxecz",
   "message": "Officer dan daly\n1900 dan daly was sent to china to deal with the boxer rebellion and was left alone after his platoon left to find the backup they were supposed to receive got lost. At night dan was still alone as over 200 kung fu fighters with muskets and melee weapons rushed daly and he he fired apon the army. In the distance his platoon and the backup soldiers heard the gun fire get quieter and slower, in their minds they thought dan had died and the people that they were tasked with protecting would be slaughtered. But once they arived they saw dan daly smoking his pipe and leaning on his maching gun  with thw most arowdinamic mass grave they had ever seen, thus getting him hin first Medal of Honor.\n\nIn World War I, Daly became further entrenched in Marine Corps lore when he is said to have yelled, \"Come on, you sons of bitches, do you want to live forever?\" to his company before charging the Germans at the Battle of Belleau Wood. Butler described Daly as \"the fightingest Marine I ever knew...It was an object lesson to have served with him.\"\n\nDaly's Medals of Honor are on display at the National Museum of the Marine Corps in Triangle, Virginia, which also features the \"live forever\" quote etched in the stone of the building's rotunda.\n\nDaly was given 2 medals of honor the distinguished service cross and the navy cross (because they said no to giving him three medals of honor.) dan daly is the reason the marines are call devil dogs and the reason you can only have one medal of honor anymore. the most bad ass marine I’ve heard of.",
   "created_utc": 1692158823,
   "score": 2,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwe8jnl",
   "message": "Jean Baptiste Bernadotte.\nOne of Napoleon's officers who was randomly offered to become king of Sweden in the early 1800s. They were hoping it would strengthen Sweden's ties with Napoleon and help defeat the Russians and take Finland back.\nInstead, Bernadotte, who hated Napoleon, made peace with Russia, gave up Finland, joined the coalition against Napoleon, defeated Denmark and occupied Norway, and after Waterloo he remained the only Napoleon-connected king in Europe who could keep his throne.\nHe fought Sweden's last ever war (so far) and initiated a policy of staying out of conflicts, paving the way for 200 years of peace. He shaped the current borders of Scandinavia, since both Norway and Finland gained strong autonomies following these events, paving the way for their independences in 1905 and 1917.\nHe never learned Swedish, and he got up every day at noon. His wife stayed in Paris because she hated Sweden. He is the ancestor of the current royal family.",
   "created_utc": 1692165684,
   "score": 1,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwdw2ab",
   "message": "The guy who invented toilet paper.",
   "created_utc": 1692158107,
   "score": 1,
   "submission_id": "15s9bp5"
  },
  {
   "comment_id": "jwea73x",
   "message": "US Divorcee Wallis Simpson got Edward VIII to abdicate the throne.   Edward was a nazi sympathizer, and his brother who became king after him opposed Germany's tyranny, and were it not for Wallis Simpson seducing the king and getting him to leave, WWII might have looked very different for Europe.   I would postulate that Wallis Simpsons saved Europe, by saving England from a useless ruler.",
   "created_utc": 1692166842,
   "score": 1,
   "submission_id": "15s9bp5"
  }
 ]
}