{
 "submission_id": "15sd5r7",
 "title": "What would your reaction be if your friend was a porn star?",
 "selftext": "",
 "created_utc": 1692153567,
 "permalink": "/r/AskReddit/comments/15sd5r7/what_would_your_reaction_be_if_your_friend_was_a/",
 "score": 226,
 "url": "https://www.reddit.com/r/AskReddit/comments/15sd5r7/what_would_your_reaction_be_if_your_friend_was_a/",
 "comments": [
  {
   "comment_id": "jwdqd5e",
   "message": "I wouldn’t care.\n\nSource: my college best friend was never a star, but she did a few scenes, including with a famous pornstar.\n\nEdit: this happened nearly a decade ago. She used the money to fund her drug addiction. She is married now and is no longer involved in sex work (not that there would be anything wrong with it if she was). So no, I will not be giving more information, sorry lol",
   "created_utc": 1692155264,
   "score": 162,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdqta0",
   "message": "Not necessarily a pornstar but I do know a couple of people that successfully out-earn me to varying degrees on OnlyFans. None of our friends really care, but we are a little jealous of the money and not having to answer to a boss.",
   "created_utc": 1692155479,
   "score": 112,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdms3m",
   "message": "Furious googling.",
   "created_utc": 1692153612,
   "score": 59,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdp2nb",
   "message": "I’d be surprised. At this point in life my wife \u0026amp; kids are my only friends.",
   "created_utc": 1692154652,
   "score": 31,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdph47",
   "message": "Compare dicks. 🤷‍♂️",
   "created_utc": 1692154840,
   "score": 223,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdpb7v",
   "message": "I mean, I would probably look. Isn't that what you're really asking? \n\nOtherwise, no different my eyes.",
   "created_utc": 1692154763,
   "score": 192,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdvrb2",
   "message": "Be slightly jealous they get paid to fuck and I dont.",
   "created_utc": 1692157945,
   "score": 231,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdpjxs",
   "message": "Lmao wouldn't necessarily call her a porn \"star\" but somewhat encountered this situation. Girl I knew from when I was younger didn't really know what she wanted to do and tried becoming influencer for a couple years, that didn't work. I followed her and always tried to be supportive of her doing influencing stuff bc it was semi related to the industry I'm in. Anyways that wasn't doing well so she decides to start an onlyfans, she asked all her friends to subscribe and support her. It was like 5 bucks so I said alright fuck it lmao. For a while I didn't want to even check it out bc it felt weird but ngl I did at some point sift through what she was posting but it felt so weird I was like nah",
   "created_utc": 1692154877,
   "score": 101,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdqg75",
   "message": "Depends on the friend either a bleach bath for my eyes or a night of studying",
   "created_utc": 1692155304,
   "score": 222,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdndeg",
   "message": "Prove it",
   "created_utc": 1692153880,
   "score": 81,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdpexw",
   "message": "I wouldn't give much of a fuck.",
   "created_utc": 1692154811,
   "score": 89,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdprw4",
   "message": "“A-WIGGITY-WIGGITY-WHAAAA?”",
   "created_utc": 1692154982,
   "score": 84,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdmrx5",
   "message": "Cool.",
   "created_utc": 1692153610,
   "score": 26,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdpjaq",
   "message": "Smile and move on with life. Occasionally search up their material to show some support.",
   "created_utc": 1692154868,
   "score": 77,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweb29k",
   "message": "As the Joker said, “if you’re good at something, never do it for free.” \n\nBut in seriousness no big deal. As long as it’s consensual and they aren’t being coerced into stuff, sex work is work and shouldn’t be stigmatized.",
   "created_utc": 1692167460,
   "score": 131,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdqwl3",
   "message": "Surprised that he never told me after years of telling him he was  made for it .",
   "created_utc": 1692155524,
   "score": 18,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdrt1t",
   "message": "I just asked her a lot of questions. (She was retired by the time I met her.)",
   "created_utc": 1692155961,
   "score": 43,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdwsmj",
   "message": "[deleted]",
   "created_utc": 1692158497,
   "score": 58,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweasrz",
   "message": "I have a friend who’s done more than one professional porno. It’s been about 8 years since his last one. He received an offer from a producer shortly after we graduated high school. He claims he and the producer totally randomly connected over Snapchat. I suspect he researched the producer and reached out first. My friend is a good looking guy, and hasn’t been shy about his manhood. He made home videos with a girl, and I believe he passed those along... The girl in his home videos did amateur porn after. \n\nWhen he first told me I didn’t believe him. He’s shown me some of his work, and frankly I’m pretty impressed that he put himself out there. The one “film” he showed me featured him and an actress twice our age. I’m jealous that he had the opportunity. I’m not sure I’m secure enough to do it myself. He made enough money to put a decent down payment on a Dodge Ram, and he stopped after his parents found out, which is hilarious to me. He was also told that if he wanted to make real money he had to switch teams.\n\nI asked him his thoughts on the whole process, and he basically said it was easy money and a lot of fun. He’s a happy-go-lucky kind of guy. I was curious if he felt any pressure or nerves, and he said he didn’t. Nowadays, he’s in the trades, he’s single, and he’s kind of a man whore.",
   "created_utc": 1692167269,
   "score": 116,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwduk42",
   "message": "Call the police, my friend is 14",
   "created_utc": 1692157320,
   "score": 56,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwea1r8",
   "message": "I found out that one of my incredibly attractive female friends has an OF, so i did what any normal person would do: I subscribed, lol. \n\nIt was only temporary because it was really weird to know what her asshole looked like when it winks after a serious pounding. \n\nShe doesn't know, but i honestly doubt that she would care because this is what is allowing her to go to college.",
   "created_utc": 1692166740,
   "score": 50,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdw49c",
   "message": "hell yeah bro fuckin slam that shit my guy",
   "created_utc": 1692158136,
   "score": 7,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe9x6a",
   "message": "We found out our cousin was a porn star, my mom and aunt (both 70 at the time) asked me to google her name to see if it was true, first image was her holding two cocks getting plastered in jizz, safe to day I don't google family members anymore.",
   "created_utc": 1692166649,
   "score": 41,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdqe1f",
   "message": "Giggity",
   "created_utc": 1692155275,
   "score": 24,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdq73y",
   "message": "Are they hiring tech crew? I need some extra money",
   "created_utc": 1692155184,
   "score": 17,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdr96h",
   "message": "No judgement. Earn your snaps however you want. I'd only check out their content if they're comfortable with it. I'm loyal, we're going to be friends always, now lets have drinks.",
   "created_utc": 1692155691,
   "score": 20,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdu5u0",
   "message": "One of my good friends from high school is a cam girl now. I was surprised at first, but mostly just sad for her. I respect sex workers, but this friend is not the kind of person who can handle it",
   "created_utc": 1692157117,
   "score": 5,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdvbif",
   "message": "🎶 “LeTs MaKe A MooOOOOoooVaaAAAaaY”",
   "created_utc": 1692157715,
   "score": 4,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwebid7",
   "message": "I have friends that have done, and still do things like OnlyFans, so it's normal",
   "created_utc": 1692167782,
   "score": 7,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdr0jj",
   "message": "Would find it super cool and extensively ask them how the job is.",
   "created_utc": 1692155576,
   "score": 11,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe4epw",
   "message": "# A job is a job.",
   "created_utc": 1692162940,
   "score": 19,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdu3rp",
   "message": "Critique their work",
   "created_utc": 1692157088,
   "score": 14,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdsvep",
   "message": "Not touch them.",
   "created_utc": 1692156475,
   "score": 5,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdxzto",
   "message": "Download all her videos",
   "created_utc": 1692159154,
   "score": 7,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe19jt",
   "message": "Wait! You too?",
   "created_utc": 1692161017,
   "score": 10,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe1o75",
   "message": "My friend? I wasn't even aware I had one. This is great news!",
   "created_utc": 1692161261,
   "score": 46,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdqmwn",
   "message": "Good for them? It's just a career, nothing to make a scene about.",
   "created_utc": 1692155393,
   "score": 21,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwds34r",
   "message": "Cheers!",
   "created_utc": 1692156094,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdu8sp",
   "message": "Remind them that team work makes the dream work. And that I'm always wearing my jersey. Wink fucking wink",
   "created_utc": 1692157160,
   "score": 4,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe14xi",
   "message": "“Uh okay. Just be safe.”",
   "created_utc": 1692160941,
   "score": 8,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweagj6",
   "message": "Be supportive and make sure they’re doing ok and not I’m forced labor/slave/owed $ situation.",
   "created_utc": 1692167027,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwebc9y",
   "message": "I actually went through this situation recently. One of my closest and oldest friends needed a shoulder, I knew she had been struggling for a while and she revealed that she's been working for a website similar to OnlyFans, and that she's doing amazingly well, but she's more miserable than ever, it's destroying her. She said she would save enough money for fixing her finances and get out as soon as she can. I'm the only one in the world who knows, I haven't even told my wife. She talked about that a few times, cried every time.\n\nShe's got a new job, it's a really simple one and it doesn't pay that well, but she seems happy about it. I don't ask her about that stuff, so idk if she left that other gig behind already.",
   "created_utc": 1692167663,
   "score": 45,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweg35n",
   "message": "I would ask her to join her on all the cool porn cast events and go back stage. Like the Venus event in Berlin. (it is the Oscar for the porn industry)",
   "created_utc": 1692171184,
   "score": 5,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdogym",
   "message": "“Please tell me you don’t let anybody spit in your mouth or face”!",
   "created_utc": 1692154372,
   "score": 7,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdqcoh",
   "message": "Oh we are gonna watch some scenes and I am gonna clown them so hard. It is gonna be relentless. Then we're gonna hug it out and play some PS2. Probably have a beer.",
   "created_utc": 1692155258,
   "score": 4,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdqbgc",
   "message": "Offer my video production and editing services lmao",
   "created_utc": 1692155241,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdqdv0",
   "message": "\"good for you, hope it is a positive experience for you\"",
   "created_utc": 1692155273,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdqwpu",
   "message": "Go best friend 🥳",
   "created_utc": 1692155526,
   "score": 5,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdsoqm",
   "message": "I was shocked. Asked a lot of questions. Accepted them without condemnation.",
   "created_utc": 1692156386,
   "score": 4,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdss4i",
   "message": "I have a friend who was a porn star. Wasn't a big deal. Didn't care or react differently.",
   "created_utc": 1692156430,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdsvwz",
   "message": "Probably no different than when I found out my cousin was in the industry",
   "created_utc": 1692156483,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdt2e5",
   "message": "As long as they are either an independent content creator or with a very reputable studio, good on them. My only concern would be some of the predatory studios, but where i live that is highly unlikely to be an issue.",
   "created_utc": 1692156570,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdtt1r",
   "message": "I'd do the obvious. Take out the pack of cured bacon in my fanny pack, bust out my battery powered frier, and get cooking. Then I'd eat the bacon. And then....who knows",
   "created_utc": 1692156940,
   "score": 21,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdtw1d",
   "message": "meh....probably wouldn't even bring it up. I feel women would make a bigger deal out of it than most men.",
   "created_utc": 1692156981,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwduhq2",
   "message": "I am friends with a porn star. I'm not sure I ever had a reaction to finding out.",
   "created_utc": 1692157286,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdusk8",
   "message": "Depends if this “friend” was a guy or a girl.",
   "created_utc": 1692157440,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdutgx",
   "message": "My neighbour was one, she was hot af haha",
   "created_utc": 1692157453,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdv6zu",
   "message": "Can I go to you guys Christmas party please?",
   "created_utc": 1692157648,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdvnk6",
   "message": "Found out my best friend's little brother was a famous gay porn star. Never had any desire to see him in action. We went out for drinks once, and I didn't bring it up. Incidentally, he lives in Maui but hasn't lost his home to the fire.",
   "created_utc": 1692157891,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdvxap",
   "message": "Cool, but don’t keep telling me about it or I’m cutting ties",
   "created_utc": 1692158033,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdw01a",
   "message": " I have a friend who has an only fans, and I don’t care. She uses it as a source of income, kind of like a part time job. I don’t know if it’s the same thing, but it seems similar. People should do whatever they want. As long as that person is happy and healthy, and doing it because they want too, it’s fine.",
   "created_utc": 1692158073,
   "score": 5,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdwbsd",
   "message": "Ask if they had a referral scheme.",
   "created_utc": 1692158248,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdwl1k",
   "message": "Ask her to start paying for shit",
   "created_utc": 1692158384,
   "score": 10,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdx9g6",
   "message": "them too huh? i should invite them them to the next bbq",
   "created_utc": 1692158751,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdxhiv",
   "message": "GET ME SOME PUSSY!",
   "created_utc": 1692158871,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdxifn",
   "message": "Idk... My girlfriend and daughter are my usual interactions. I guess I might accidentally check it out if she was one of a few in mind. Probably would feel very weird though. Next time I ran into her I would eventually need to tell her I jerked off to her videos using my tears as lubricant.",
   "created_utc": 1692158885,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdxubp",
   "message": "If a pornstar was my friend, we'd be chill. If my friend was a pornstar, we'd be chill after some googling.",
   "created_utc": 1692159069,
   "score": 6,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdyjkf",
   "message": "Well if they were a dude, adamant high five. If they were female... a thorough google search.",
   "created_utc": 1692159460,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdytwx",
   "message": "My old roommate did this, she was already a sex worker but still. She wasnt famous by any means and did some pretty....um....gross stuff on camera. It completely turned me off pornography for a while and changed my attitude towards woman.",
   "created_utc": 1692159622,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdzmtp",
   "message": "As someone who had friends in the industry, when meeting new people in the industry chances are I was familiar with their performances. So it was mostly reminding myself to not ogle, to not be overfamiliar, and to not talk about work because you need a general level of trust to talk about that with a “normie” because of the stigmas (this was about 10ish years ago, hopefully it’s changed for the better now). \n\nAs far as finding out that my friends were in the industry, I general already knew? I want interested in most of the friends I had who were, sexually speaking, and the ones I was interested in were taken so whatever. Just a job.\n\nI did have a really fun stack of business cards I called my porn-o-dex, that I used to keep in this frog shaped business card holder for some reason. It was usually side projects of people like their podcast or variety group or whatever.",
   "created_utc": 1692160073,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdzn4w",
   "message": "I would disagree with the decision, but not insult them or order them to quit. Pornography promotes the exploitation and objectification of human beings. Sex workers are also at higher risk of becoming victims of perverts, due to the nature of their work, so I would worry for them.",
   "created_utc": 1692160078,
   "score": 10,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdzn6j",
   "message": "One of my friends (or I should say ex friends) is a pornstar she only has 4 videos but I’m not surprised she started it.",
   "created_utc": 1692160079,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdzsa8",
   "message": "Honestly: \n\nI would watch the porn of my attractive friends once or twice before giving up on it, my urges satisfied.\n\nAs for my unattractive friends, wouldn't think about it for a second. \n\nIn both cases my opinion of them wouldn't change except for some increased respect for bravery.",
   "created_utc": 1692160159,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdzvf6",
   "message": "Oh no, that’s terrible…where?",
   "created_utc": 1692160209,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe051p",
   "message": "One of my clients is an ex porn star!😊 And I watched some of her videos before \u0026amp; after I met her!🙂😊",
   "created_utc": 1692160364,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe0hoz",
   "message": "My sister has a friend that I bought groceries for during covid \u0026amp; who I carpulled and hung with in houston who is a porn star\n\nI found out by practically googling almost an exact video title by coincidence and recognized certain tattoos and scars \n\nShe has almost 100k on twitter and has done vdieos with owen gray, \u0026amp; other popular porn stars",
   "created_utc": 1692160563,
   "score": 4,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe0ldf",
   "message": "I have a friend who is a porn star. I don’t really bring it up. But if I were to I’d just tell her to follow her dreams. 💝",
   "created_utc": 1692160621,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe0pd4",
   "message": "My cousin was. Camming with her husband paid for their house and then she quit. I congratulated her.",
   "created_utc": 1692160685,
   "score": 5,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe0tqj",
   "message": "Roommate of mine did it for a while. I'm not into him and he isn't into me so nothing ever came of it. I didn't feel the need to google him so I still haven't seen anything he's done.\n\nIronically, while I've avoided seeing him naked, he's walked in on me having sex twice.",
   "created_utc": 1692160757,
   "score": 6,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe0vca",
   "message": "We all use some parts of our body to make money. Like literally all of us",
   "created_utc": 1692160784,
   "score": 4,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe2jl2",
   "message": "Mine actually is, so i feel qualified to answer. Honestly, now i really don't care. When she first started and told me i was tempted to search for the content but out of respect for her i didn't, and as time went on i just kinda moved on and now i don't really think about it at all unless specifically mentioned. The one thing that has surprised me is she has actually gotten quite \"large\" in terms of popularity and definitely the money she's earning.",
   "created_utc": 1692161784,
   "score": 7,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe2mmh",
   "message": "I ran into a high school friend about 6 years after graduating and learned that she was doing porn. It made all the sense in the world because was always highly sexual in school and she was open and not sorry about it at all. Was nominated for a VPN award too so she was doing quality stuff, I’ve been told.\n\nI just asked her question after question. It’s a pretty fucked up world they live in. Wild and fun, but brainwashy and not good for the soul.",
   "created_utc": 1692161835,
   "score": 30,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweb208",
   "message": "i would not have a very strong reaction",
   "created_utc": 1692167455,
   "score": 5,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweftvp",
   "message": "I'd be so proud",
   "created_utc": 1692170986,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwefzql",
   "message": "Nice",
   "created_utc": 1692171111,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweg25m",
   "message": "Set up my computer to watch their video on repeat, help them get views so they can get that bag",
   "created_utc": 1692171162,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweg3jb",
   "message": "🧴🧻",
   "created_utc": 1692171193,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwegoet",
   "message": "Jeremy? I'd be shocked because that's just not like him. Besides, he's married with a daughter.\n\nKurt? Yeah I believe it he's a slut.",
   "created_utc": 1692171639,
   "score": 7,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweh1ow",
   "message": "Not a pornstar in the literal sense, but a goth girl I worked with started an onlyfans a few years ago.\n\nShe's the only person I've ever subbed to on OF, \u0026amp; I used to jerk to her videos and pictures and she had no idea, until one of our colleagues let it slip at a works Christmas party. \n\nwe fucked that night and never spoke to eachother again",
   "created_utc": 1692171926,
   "score": 91,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweh1ym",
   "message": "She better invite me to dinner",
   "created_utc": 1692171932,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweif5j",
   "message": "I would watch their scene for support",
   "created_utc": 1692172988,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdqw0z",
   "message": "“But you’re 13…?!?!”",
   "created_utc": 1692155517,
   "score": 6,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdwls1",
   "message": "Which friend?\n\nAlso, how do we define \"star\"?  Having an OnlyFans that made $45 last year doesn't make you a porn star, Julie.",
   "created_utc": 1692158395,
   "score": 16,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe1m9k",
   "message": "i would hype my bestie up and ensure they are being treated well and fairly and that they take care of their health. \n\ni support sex workers.",
   "created_utc": 1692161229,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdx6o3",
   "message": "Ask for the link lmao",
   "created_utc": 1692158709,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdnio6",
   "message": "That's their choice and I support them.",
   "created_utc": 1692153945,
   "score": 1,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdvcjo",
   "message": "I’d be concerned about their exposure to organized crime and hard drugs.",
   "created_utc": 1692157730,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdonbv",
   "message": "Ask them for some live action",
   "created_utc": 1692154455,
   "score": 1,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweg1yo",
   "message": "Depends is it a she and is da boobs big",
   "created_utc": 1692171158,
   "score": 1,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdmskt",
   "message": "Male or female? 😏",
   "created_utc": 1692153618,
   "score": 0,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdthvw",
   "message": "Bro, get your life together. Stop using your body to get money, and actually try to get a real job. One that does not run the risk of you getting emotionally abused.",
   "created_utc": 1692156786,
   "score": 250,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdpso7",
   "message": "Pic or it didn’t happen",
   "created_utc": 1692154992,
   "score": 0,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdsz40",
   "message": "Probably wouldn't be her friend. By all means do porn, make that dough, she has the freedom to do that, but I like to live a wholesome life so I'd no longer talk to her. Respect her choice, but since it doesn't mesh well with my values, I'd choose not to remain friends.",
   "created_utc": 1692156525,
   "score": 249,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdvej0",
   "message": "Cool. How many bitches have you gotten?",
   "created_utc": 1692157760,
   "score": 0,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweik9h",
   "message": "I'd be fine with it. He does have a huge, thick penis.",
   "created_utc": 1692173099,
   "score": 1,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweba2v",
   "message": "Have fun in hell",
   "created_utc": 1692167618,
   "score": 253,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdp7mo",
   "message": "Can I be his agent 😍",
   "created_utc": 1692154716,
   "score": 255,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdv3ws",
   "message": "My reaction all depends on my friend’s gender",
   "created_utc": 1692157602,
   "score": 255,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe00t7",
   "message": "Idk, maybe tell him why",
   "created_utc": 1692160295,
   "score": 255,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwefsjc",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdt3sr",
   "message": "That would be the funniest shit I've ever heard , he's 5'5 350+lbs",
   "created_utc": 1692156589,
   "score": 9,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwezmhq",
   "message": "Who cares. I'm friends with them, not their profession. As long as everybody is consenting adults then I don't give a fuck.",
   "created_utc": 1692185164,
   "score": 6,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdt2a7",
   "message": "Become curious about their experiences and back them up if their family ever become difficult about it. They're my goddammit friend, and the industry doesn't sound like it can be conducive to good mental health at times. I'll be there for them if they need me (not as part of it tho, no thanks)",
   "created_utc": 1692156569,
   "score": 4,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwduknc",
   "message": "Depends. I wouldn't be too phased if they were *just* a friend, if anything I would respectfully stop looking further and attempt to erase the image from me. If I had anything else for them, I'd be averse but curiosity would become a problem and a lingering thought",
   "created_utc": 1692157327,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdun23",
   "message": "Good for you, get it! 🤑",
   "created_utc": 1692157361,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweqrdl",
   "message": "My last girlfriend used to be a cam-girl.  I legitimately didn't care, but we weren't that serious anyway.  We broke up because her brothers were racists and she had a gambling problem.",
   "created_utc": 1692179426,
   "score": 7,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweqv31",
   "message": "I wouldn't be to broken up or shocked by it. I work with a guy that found a video of his current gf hiding that from him. I would have alot of a harder time getting that out of my head.",
   "created_utc": 1692179500,
   "score": 5,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwes3r2",
   "message": "\"Send me the link\"\n\nI'm not joking. Not a porn star but A close friend from a few years ago really had the urge to upload her video and kept asking me if she should. My first response was **send me the link**. She was cool as hell. We got along great.🤣",
   "created_utc": 1692180393,
   "score": 4,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwf32c3",
   "message": "I’d just keep the info to myself. Maybe enjoy the show if it’s the type of friend I can see that way of not immediately turn it off. But no hate ppl do what they do",
   "created_utc": 1692186989,
   "score": 5,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwdv5f3",
   "message": "I'm roasting tf outta them. Wym?",
   "created_utc": 1692157625,
   "score": 6,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwe6isg",
   "message": "Lemme join you!",
   "created_utc": 1692164315,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweipie",
   "message": "Join",
   "created_utc": 1692173212,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweizow",
   "message": "Shrug my shoulders and say, \"Get your money.\"",
   "created_utc": 1692173433,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwelixe",
   "message": "See if they need coworkers",
   "created_utc": 1692175420,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwenief",
   "message": "Wouldn't care.",
   "created_utc": 1692176957,
   "score": 5,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwenovj",
   "message": "Ask for advice, *For research purposes*",
   "created_utc": 1692177095,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwenroy",
   "message": "I have a few.  Maybe not “Star” level, but making some money.\n\nThey’re just people.  It’s like “your best friend is a postal worker… how would that make you feel?”",
   "created_utc": 1692177155,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwens2w",
   "message": "Can I be in your next video in the background",
   "created_utc": 1692177163,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweo8zp",
   "message": "Can I make an appearance?",
   "created_utc": 1692177533,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwerr95",
   "message": "Depending on which friend, I'd watch it. Alone.",
   "created_utc": 1692180148,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwesokw",
   "message": "\"Oh\"\n\n\"Do you get good money?\"\n\nMy friend: Yeah.\n\n\"Nice, bro\"",
   "created_utc": 1692180799,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwesoti",
   "message": "\"Hey, can we collab?\"",
   "created_utc": 1692180804,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweud02",
   "message": "If a friend of mine were a porn star, my reaction would be rooted in empathy, understanding, and respect for their personal choices. I believe in supporting individuals in their pursuit of happiness, as long as it doesn't harm others. While society may have varying opinions on the adult entertainment industry, it's important to approach the subject without judgment and recognize that everyone has their own path in life. I would prioritize open and honest communication, ensuring my friend feels comfortable discussing their experiences and addressing any concerns they might have. Ultimately, maintaining a strong friendship is about acceptance, support, and embracing each other's unique journeys, regardless of the paths we choose.",
   "created_utc": 1692181951,
   "score": 5,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweun0f",
   "message": "You guys hiring?",
   "created_utc": 1692182135,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwevdi9",
   "message": "I would die laughing.",
   "created_utc": 1692182619,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwevol1",
   "message": "20% to keep it a secret from your parents",
   "created_utc": 1692182820,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwews5x",
   "message": "I honestly couldn't care less. If they're my friend and they're happy then i'm also happy.",
   "created_utc": 1692183509,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwezd5u",
   "message": "ask if i could join",
   "created_utc": 1692185018,
   "score": 2,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jweyfjc",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwehg9i",
   "message": "I have a trans pornstar friend who is a sexy badass bitch.",
   "created_utc": 1692172237,
   "score": 5,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwf25yv",
   "message": "My friend and old roommate is a porn star. We have lunch at Panera sometimes.",
   "created_utc": 1692186528,
   "score": 4,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwgruha",
   "message": "Dude…. Can I join?",
   "created_utc": 1692210344,
   "score": 3,
   "submission_id": "15sd5r7"
  },
  {
   "comment_id": "jwiaaj5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15sd5r7"
  }
 ]
}