{
 "submission_id": "15skl7f",
 "title": "What's the dumbest thing you've heard someone say?",
 "selftext": "",
 "created_utc": 1692176916,
 "permalink": "/r/AskReddit/comments/15skl7f/whats_the_dumbest_thing_youve_heard_someone_say/",
 "score": 255,
 "url": "https://www.reddit.com/r/AskReddit/comments/15skl7f/whats_the_dumbest_thing_youve_heard_someone_say/",
 "comments": [
  {
   "comment_id": "jwf4g8g",
   "message": "A new guy started at work.  Just a regular guy, nothing unusual about him.  This one idiot woman looked at him and said \"I don't like that guy, he looks prejudiced\".  \n\nNo amount of explanation could persuade her to see the irony.",
   "created_utc": 1692187677,
   "score": 68,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jweq9jw",
   "message": "That the victims of the Holocaust deserved it because they agreed to experience it before coming to earth.",
   "created_utc": 1692179062,
   "score": 252,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jweq2qk",
   "message": "My little brother's girlfriend told us, with pride, that she screamed at her doctor for not diagnosing her with ADHD. \n\nShe's not a smart or nice lady.",
   "created_utc": 1692178922,
   "score": 195,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf09tq",
   "message": "That Canada was a US state because it shares a border.  \n\nWhen I asked if Mexico was a state because it also shares a border… I was told “that’s just dumb”",
   "created_utc": 1692185522,
   "score": 36,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwetf8h",
   "message": "I didn't hear it directly, but the CEO of the Titan Sub criticised the \"obscenely safe diving regulations\" and how counter-productive they were to innovation and exploration.",
   "created_utc": 1692181312,
   "score": 230,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jweuode",
   "message": "“How can you be Spanish? It’s a language, not a nationality”",
   "created_utc": 1692182160,
   "score": 4,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jweysek",
   "message": "“I've been on food stamps and welfare. Anybody help me out? No. No.” -Craig T Nelson, arguing against government aid",
   "created_utc": 1692184704,
   "score": 215,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwex1be",
   "message": "“You shouldn’t aim for the stars, you should aim further, aim for the sun!!!”",
   "created_utc": 1692183663,
   "score": 149,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwenjhu",
   "message": "The earth is flat",
   "created_utc": 1692176981,
   "score": 23,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jweqb29",
   "message": "I drink my alkaline water with fresh squeezed organic lemon juice. \n\n-G Paltrow\n\n\nAlkaline water is a scam in the first place, but by adding an acid it is no longer alkaline.",
   "created_utc": 1692179093,
   "score": 191,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwezyvb",
   "message": "My brother who was probably 40 at the time asked if you have to pay credit cards back.",
   "created_utc": 1692185357,
   "score": 219,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwevy9o",
   "message": "On the news, interviewing someone about euthanasia.\n\n\"You might regret it afterwards\"\n\n💀\n\nEta: for all those suggesting explanations - she was put on the spot and it was very much one of those moments where you could tell she'd cringe at her answer when seeing it back.",
   "created_utc": 1692182993,
   "score": 20,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwenj9h",
   "message": "Dinosaurs aren't real",
   "created_utc": 1692176975,
   "score": 247,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jweu59n",
   "message": "Warned us on a hot day to not drink too much ice water... Because it makes you fat.. just ice water, or really cold water though....I explained that, no.. water can not make you fat, as water has no calories..\n\nHe spent the lunch hour trying to find something on the internet to prove himself right, even asking Siri, with no luck..",
   "created_utc": 1692181805,
   "score": 215,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwez1g3",
   "message": "I knew a guy at the gym who would work out every day, and then take a cigarette break between sets.\n\nHe said that he liked to smoke to clear his lungs out.",
   "created_utc": 1692184843,
   "score": 208,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jweungq",
   "message": "It's the bubbles in soft drinks that make you fat.  Even diet soft drinks.",
   "created_utc": 1692182144,
   "score": 234,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jweq522",
   "message": "Once overheard someone asking if Wi-Fi is gluten-free. I guess they were worried about internet allergies?",
   "created_utc": 1692178969,
   "score": 225,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf2lgj",
   "message": "\"If we desalinate the oceans we'd solve all the world's problems\"\n\nMan, I'm just trying to get my haircut",
   "created_utc": 1692186749,
   "score": 26,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf3s34",
   "message": "I told a friend that I was visiting family in Kansas. They laughed, and asked where I was really going. \n\nThey thought I was just trying to say I was going to somewhere far away. Because Kansas is a fictional place from that one movie (The Wizard of Oz).",
   "created_utc": 1692187345,
   "score": 155,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwev1qj",
   "message": "I used to know a guy who dead ass believed the Earth is hollow, it has its own sun inside, there's holes in the poles which allow the light to escape thus causing the aurora borealis, and inside this hollow earth are giants called Nephilim.\n\nThat and flat earth/chemtrail believers.",
   "created_utc": 1692182404,
   "score": 44,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwevui3",
   "message": "\"I don't want a pay rise because it will push me into the next tax bracket\"",
   "created_utc": 1692182927,
   "score": 229,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwenmvk",
   "message": "potatoes are a fruit",
   "created_utc": 1692177052,
   "score": 108,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf0b1v",
   "message": "The meteor that killed the dinosaurs was us in a space shuttle. We had abandoned Mars because we killed it. And weed was a plant that we brought with.",
   "created_utc": 1692185541,
   "score": 232,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwethn0",
   "message": "“I don’t think marital rape is a thing, you should already know they’re like that before you marry them”  just proves my point that just bc someone has a degree, does not make them intelligent.",
   "created_utc": 1692181357,
   "score": 54,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwepf1p",
   "message": "\"How can I be sure that the baby is mine? He might have cheated and I could be pregnant with another woman's child.\"",
   "created_utc": 1692178429,
   "score": 246,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf2rbk",
   "message": "I remember a girl in college who thought California was where all gay people come from.",
   "created_utc": 1692186833,
   "score": 15,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwepvgm",
   "message": "A rugby mate once said that paper ws made from the leaves of trees, he was 23 at the time.",
   "created_utc": 1692178772,
   "score": 71,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfaabt",
   "message": "Guy is arguing with a physicist about objects in space.\n\nGuy: \"That's not how that works!\"\n\nPhysicist: \"pretty sure I have a degree in physics\"\n\nGuy: \"Yeah, but you don't have a degree in SPACE!\"",
   "created_utc": 1692190451,
   "score": 213,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwesfrw",
   "message": "Dinosaurs didn't exist",
   "created_utc": 1692180628,
   "score": 128,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf2wda",
   "message": "Had a coworker swear to god that Melania Trump was a descendent of Anastasia and that she had a blood type never before seen. I proceeded to tell her that we found the Romanov family in the 90's or something. Then I asked her what determined a person's blood type. She didn't like talking to me after that. Also, the moon landing was faked.",
   "created_utc": 1692186905,
   "score": 132,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jweoqea",
   "message": "A friend (who was pregnant at the time) told me that the pee and period blood come from the same hole and pee comes from the uterus.",
   "created_utc": 1692177900,
   "score": 209,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf5zzf",
   "message": "When someone was trying to argue that mixed race relationships were wrong, someone told me - \" I can prove white people and black people are different, if you crack an egg over a black persons head, it doesn't run.\"",
   "created_utc": 1692188434,
   "score": 126,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwev6oe",
   "message": "\"Why tf are we driving everywhere? It's a 3 minute walk to the gas station from the house\" said by a family member to me. In a car. On our way to fill up the tank.",
   "created_utc": 1692182494,
   "score": 211,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jweyoes",
   "message": "Why do I need to plug my router into the electrical outlet, it's wireless?",
   "created_utc": 1692184639,
   "score": 209,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf5n2p",
   "message": "“Women have to admit their role in getting raped too. Wearing revealing clothing, being a tease, not traveling in packs. It’s their fault too.” \n\n- My uncle, who taught this very ideology to a group of 15-16 year old girls in a Sunday school class.",
   "created_utc": 1692188259,
   "score": 75,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwex3j6",
   "message": "You're under financial curse if you don't pay your tithes - General overseer of a church I know.",
   "created_utc": 1692183700,
   "score": 44,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwezavt",
   "message": "Grew up in DC, girl I grew up with thought we lived in Washington state because DC is commonly referred to as Washington, found this out about her when we were 20…",
   "created_utc": 1692184983,
   "score": 119,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf3fgj",
   "message": "Asked my ex what kind of music she liked.\n\n\"I love Various Artists! They are so versatile.\"",
   "created_utc": 1692187173,
   "score": 193,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf6vco",
   "message": "My Biology class Freshman year of college, “WAIT. Gorillas are real?! I thought they were fake.” \n\nThere was also someone in my high school Holocaust and Genocide studies class Junior year, who thought their entire life that Helen Keller was black in addition to being blind, deaf, and mute. I am assuming she mixed up Harriet Tubman and Helen Keller together at some point.",
   "created_utc": 1692188854,
   "score": 169,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jweqvg7",
   "message": "Chocolate milk came from brown cows...  literally believed this. She was 24",
   "created_utc": 1692179507,
   "score": 111,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf2i6a",
   "message": "For the Aussies: I overheard a woman asking the guy she was with; “Does Red Rooster only sell roosters?”",
   "created_utc": 1692186702,
   "score": 45,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf8f9y",
   "message": "Coworker came rushing into the office one morning freaked out that she could see the moon. When we all asked what she meant, she explained, “I didn’t know the Moon was in the sky during the day.”",
   "created_utc": 1692189596,
   "score": 162,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwezyf1",
   "message": "It's raining wet water",
   "created_utc": 1692185350,
   "score": 38,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwett80",
   "message": "Representative Marjorie Taylor Greene to a Twitter exec\n\n“You violated my first amendment rights, I’m a member of congress, not you.” She started speaking bullshit and debunked herself without realizing it",
   "created_utc": 1692181577,
   "score": 76,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf9c50",
   "message": "Someone legitimately started crying in front of me because “vegans are killing the apples”. She was 19 years old",
   "created_utc": 1692190019,
   "score": 33,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfi39s",
   "message": "\"I smoke 2 packs of cigarettes a day and I'm healthier than you because the smoke kills all the germs in my lungs\". Guy's been dead since the early 80's.",
   "created_utc": 1692193762,
   "score": 162,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfabrp",
   "message": "when making small talk at the bar i work at, i mentioned i’m taking my brother to a nearby water park. \n\n“well the water park is fun and all but it’s crawling with illegal immigrants. how do they even afford to go to a water park? i don’t get vaccines, but if we didn’t have all these illegals coming in bringing their diseases from their third world countries, we wouldn’t even need vaccines.” \n\nabsolutely stunningly ignorant, bizarre, and even contradictory at points.",
   "created_utc": 1692190469,
   "score": 71,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfacvh",
   "message": "God told me",
   "created_utc": 1692190483,
   "score": 18,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwenm4l",
   "message": "What about Oklahowomans?",
   "created_utc": 1692177037,
   "score": 28,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwey88c",
   "message": "My boss of two years implied he knew me better than I know myself",
   "created_utc": 1692184380,
   "score": 59,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf1gjw",
   "message": "That ww2 starts in 1941",
   "created_utc": 1692186159,
   "score": 17,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfatpm",
   "message": "To presume is to make an ass out of you and me.",
   "created_utc": 1692190694,
   "score": 32,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfefs6",
   "message": "Flat mate showed me a video a couple days ago where this woman asked If a pregnant woman had sex with another woman how would she know the baby was hers and not the other woman's.\nHad to rewatch it a couple times to make sure I had heard correctly.",
   "created_utc": 1692192258,
   "score": 81,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwew851",
   "message": "\"*universities should be paid by the people who attend them\"\n\nyeah, why have the most competent people rise to powerful positions instead of rich kids",
   "created_utc": 1692183162,
   "score": 21,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf7ro8",
   "message": "Had a customer yell at me for putting eggs on her salad. She told me she was lactose intolerant. So I naturally didn't put cheese on the salad. But apparently, eggs in her mind were also of the lactose family, and therefore, I was trying to poison her.",
   "created_utc": 1692189289,
   "score": 97,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf9u9o",
   "message": "The worlds flat, vaccines cause autism, etc",
   "created_utc": 1692190251,
   "score": 7,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfa5tx",
   "message": "Politics doesn't affect me",
   "created_utc": 1692190394,
   "score": 61,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfj3ac",
   "message": "Freshman in College. Humanities class. We were doing a unit on Ancient Egypt and one person said \"I'm so fascinated with Egyptian culture that I went out and bought all three Mummy movies.\"\n\nAnother classmate said they \"had no idea how they built those pyramids all those millions of years ago.\"",
   "created_utc": 1692194155,
   "score": 51,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfk1dc",
   "message": "MIL while looking at our lemon tree - \"They are limes at the moment, if you want limes pick them when they are small and green. If you want lemons, wait till they are bigger and have turned yellow\".",
   "created_utc": 1692194533,
   "score": 98,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfpe13",
   "message": "That Barack Obama had a big part of 9/11 by not being at the White House during a terrorist attack.",
   "created_utc": 1692196602,
   "score": 7,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwesfoo",
   "message": "In the last hour?",
   "created_utc": 1692180626,
   "score": 19,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jweo9gc",
   "message": "The sun is as big/small as a basketball.",
   "created_utc": 1692177543,
   "score": 18,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwewac5",
   "message": "The earth is flat.",
   "created_utc": 1692183198,
   "score": 9,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf5e5g",
   "message": "\"I need like, more than a gram of weed to get high, though, because my IMMUNE system is too high!\"",
   "created_utc": 1692188138,
   "score": 38,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf7v6m",
   "message": "Watched a girl plug a power strip into itself and then ask “why doesn’t it work?”\nNo, she wasn’t kidding.",
   "created_utc": 1692189334,
   "score": 82,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf9gpu",
   "message": "My cousin said feeding dead cows to other cows which led to the mad cows outbreak was necessary. Because Thatcher and the conservatives were fighting the soviets. He’s one of those types that will defend the tories.",
   "created_utc": 1692190078,
   "score": 6,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwffhrc",
   "message": "That acne is a form of herpes 🤦🏼‍♀️",
   "created_utc": 1692192700,
   "score": 6,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf75f7",
   "message": "“why do you think cheating means we don’t want to be in a relationship😂?? You’re thinking from a female standpoint (with emotion). From a males standpoint (impulse) cheating doesn’t mean we don’t want a relationship, it means I was horny and you aren’t here 😂.” \n\nA man said this under a woman’s post about cheating and relationships. I read this and laughed out loud, made a disgusted and confused face. There’s no way he seriously thinks this.",
   "created_utc": 1692188990,
   "score": 50,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jweskys",
   "message": "that she poured bleach on her emails",
   "created_utc": 1692180727,
   "score": 12,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf0l9a",
   "message": "That clouds in the sky go BEHIND the moon. 🤣 she has seen it happen with her own eyes🥴",
   "created_utc": 1692185694,
   "score": 17,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf3t11",
   "message": "I took a class on the World Wars in the Summer, we spent several weeks in Europe. We were assigned 3 books to read prior to leaving - just so we had some ind epth background knowledge on some of the specific locations we would go. \n\nThis was the inagural class. While on Utah Beach, standing feet from the English a student asked the professor if the State of Utah was named after the beach in France. \n\nMost of us wanted to push her into the Channel and hold her till the bubbles stopped. She's now an attorney. \n\nThat was also the last time that class was offered",
   "created_utc": 1692187358,
   "score": 12,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwepkk4",
   "message": "I knew someone who thought the “white pride” movement was misunderstood",
   "created_utc": 1692178545,
   "score": 21,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwevlza",
   "message": "trUmP woN!!",
   "created_utc": 1692182772,
   "score": 22,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf8lpe",
   "message": "“The 2020 election was stolen.”",
   "created_utc": 1692189679,
   "score": 23,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwflzzc",
   "message": "That it was pointless to become an archeologist since there is nothing left for archeologists to find because everything worth discovering has been discovered already.",
   "created_utc": 1692195299,
   "score": 71,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf8k2e",
   "message": "Two come to mind\n\"I am the chosen one\", trump\n\"I'm an alpha male\" insecure morons",
   "created_utc": 1692189658,
   "score": 12,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf6uf6",
   "message": "I had a colleague who claimed that you shouldn't drink water too often. She claimed water is unhealthy.",
   "created_utc": 1692188841,
   "score": 4,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfi9np",
   "message": "Someone told me that Donald Trump was the best president ever",
   "created_utc": 1692193832,
   "score": 16,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfjjfx",
   "message": "\"Alaska is an island.\"\n\n\"No... It's not.\"\n\n\"I've seen it on the map, just like Hawaii.\"",
   "created_utc": 1692194335,
   "score": 43,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfmc8v",
   "message": "There’s the classic “I drive better when I’m drunk/high.”",
   "created_utc": 1692195431,
   "score": 54,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfpwqk",
   "message": "Anything Flat Earthers say.",
   "created_utc": 1692196797,
   "score": 3,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwf9m51",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfwunk",
   "message": "I heard a guy say he wanted to be a garbage man because they have great pay (they do make crazy money) and they only have to work one day a week. He thought that since his trash was picked up once a week that was all the fellas worked…",
   "created_utc": 1692199356,
   "score": 14,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfx7fi",
   "message": "“Those aren’t my pants.”\n- the guy getting arrested for having drugs/weapon in his pocket",
   "created_utc": 1692199484,
   "score": 35,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfdwzs",
   "message": "Jesus is the greatest American of all time!\n\nJesus is white.",
   "created_utc": 1692192041,
   "score": 50,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfnz5k",
   "message": "My sister asked if mlk was at the protest I went to, this was ten years ago... Generally anything out of her mouth. Folks from Ghana came to her church and she got up to welcome the gonorrheans!",
   "created_utc": 1692196061,
   "score": 33,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfmpxb",
   "message": "\"Why are so many people on Star Trek named Ensign?\"",
   "created_utc": 1692195578,
   "score": 27,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfpz8w",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfnvqk",
   "message": "At a national park, lady behind me was asking the ranger why they built the Native American ruins so far from the road 🤔 I was speechless",
   "created_utc": 1692196025,
   "score": 53,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwg0bta",
   "message": "I was a homeless teen in the 90s. My coworker heard me talking about it with a student who was struggling, giving her resources, etc. After my colleague came up to me and said, \"I had no idea you were homeless as a young person! That's so interesting! I always wanted to ask.. why do people choose to be homeless and what made you decide to turn your life around?\"",
   "created_utc": 1692200599,
   "score": 57,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwgffie",
   "message": "I have an entire list of dumb shit my sisters said but once we were driving, monday morning and she goes ‘why are there binmen out’\n\n‘Because they’re collecting the bins??’\n\n‘But its not Tuesday’\n\n‘Yeh… they pick up different bins in different areas on different days…?’\n\n‘No they collect them all on tuesday?’\n\nOur bins are collected on Wednesday…",
   "created_utc": 1692205963,
   "score": 36,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwg06gk",
   "message": "I had a coworker warn someone not to eat ethnic food prior to DNA TESTING themselves (as if Mexican food would result in Mexican heritage) she was entirely serious. 😶",
   "created_utc": 1692200545,
   "score": 29,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwgfeak",
   "message": "\"Why are you reading a magazine when you've got a headache!?\" - My dad \n\nI didn't have a headache, I had menstrual cramps. I'd asked to stay home from school because of how bad it was. He didn't really believe me because he knew the woes of the female body better than his inexperienced teenage daughter /s\n\nFor clarity, some women do get migraines during their periods but that's not \"normal\" menstrual cramps. Still bad though, thankfully I've never had it.",
   "created_utc": 1692205951,
   "score": 14,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfmnwd",
   "message": "“Hey, looks like Thanksgiving’s on a Thursday this year.”\n\n-my 35 year old wife",
   "created_utc": 1692195556,
   "score": 27,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwgibcs",
   "message": "Me at the drive thru at McDonalds: can I have a dozen assorted muffins\nEmployee: Im sorry we dont have that flavour\nMe: it means a few of each \"assorted\"\nEmployee: so how many do you want?\nMe: a dozen\nEmployee: do you want 1, 6? How many?\nMe: A dozen. It means 12! I need twelve not all the same flavour\nMy husband: dont be mad they're very young \n\nNot sure who was dumber the worker or my husband for thinking kids are that stupid",
   "created_utc": 1692206980,
   "score": 15,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwh3w76",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwftfue",
   "message": "\"If it's legitimate r\\*\\*e, the body has ways of shutting that down.\"",
   "created_utc": 1692198114,
   "score": 22,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfxsxb",
   "message": "The vapor trails that planes and jets leave while flying in the upper atmosphere are them spreading coronavirus and infecting people on earth.  I just walked away from listening to that nonsense.",
   "created_utc": 1692199695,
   "score": 18,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfrwer",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfysfm",
   "message": "This girl in jail said that she thinks doing meth while she was pregnant made her kids smarter.",
   "created_utc": 1692200050,
   "score": 18,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfxwxc",
   "message": "That if a women wants a child, any man she chooses is obligated to give her one",
   "created_utc": 1692199734,
   "score": 20,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwgcnzd",
   "message": "My father told me to stop taking drugs for my depression and testosterone because he thinks that I don't need them. That my depression is just feeling a bit down and that I don't need testosterone(that my body doesn't produce at all) because I'm male and I don't need it.\nNeedless to say when I was underage I've been miserable because both of my parents would dismiss my problems and didn't allow me to see doctors to get me medications I really needed. Fuck them both",
   "created_utc": 1692204974,
   "score": 17,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwghqap",
   "message": "Was headed to a concert in San Antonio. Standing on a corner, waiting to cross the street with about 10 other people, when one of those romantic horse-drawn carriages pulls up.\n\nOne guy, with a complete straight face, looks up, and says \"Oh neat, a cow!\".\n\nIt took a second to register what the man said, but as soon as it did, I look up, and no one even bats an eye. No one corrects him. Nothing.\n\nThere's been other experiences that I have had in SA that have led me to believe that the average intelligence level there is not knowing the difference between horses and cows.",
   "created_utc": 1692206774,
   "score": 18,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwfjvdd",
   "message": "\"You lost your unborn baby, but think that way: what's for you won't go by you. It didn't ment to be.\" It hurt me more than going though miscarriage for a second time.",
   "created_utc": 1692194466,
   "score": 17,
   "submission_id": "15skl7f"
  },
  {
   "comment_id": "jwg8ncs",
   "message": "That she doesn’t understand why people drink cow urine…. Milk. She thought milk was urine. This was a grown ass adult in a highly accredited university.",
   "created_utc": 1692203544,
   "score": 14,
   "submission_id": "15skl7f"
  }
 ]
}