{
 "submission_id": "15sll0i",
 "title": "People who leave shopping carts in parking spots/lots… who tf raised you?",
 "selftext": "",
 "created_utc": 1692180222,
 "permalink": "/r/AskReddit/comments/15sll0i/people_who_leave_shopping_carts_in_parking/",
 "score": 96,
 "url": "https://www.reddit.com/r/AskReddit/comments/15sll0i/people_who_leave_shopping_carts_in_parking/",
 "comments": [
  {
   "comment_id": "jwewdm7",
   "message": "People are getting more and more selfish and self centered.",
   "created_utc": 1692183256,
   "score": 46,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwfbhdh",
   "message": "[https://scoop.upworthy.com/viral-shopping-cart-theory-determines-moral-character-440106-440106-440106#](https://scoop.upworthy.com/viral-shopping-cart-theory-determines-moral-character-440106-440106-440106#)",
   "created_utc": 1692190988,
   "score": 14,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jweyjkn",
   "message": "Park next to the cart return.  Make it easy",
   "created_utc": 1692184561,
   "score": 11,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwexyk6",
   "message": "Every time there's a shopping cart thread, I have to post my experience as a supermarket worker. **A mess in the parking lot meant I didn't have to be inside and/or around management.** Every shift I worked, I hoped for cart slobs so I could chillax, walking around the parking lot, listening to music, and bringing carts in. The last thing I wanted to do was restocking, cleaning, or go-backs.\n\nCart slobs are the backbone of supermarket employment.",
   "created_utc": 1692184216,
   "score": 46,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwffph3",
   "message": "Nobody, that is the problem.",
   "created_utc": 1692192792,
   "score": 4,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwesrau",
   "message": "My mom and dad",
   "created_utc": 1692180852,
   "score": 3,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwf00ko",
   "message": "In some areas of Miami it's just normal. My parents' Publix doesn't even have cart returns in the parking lot.",
   "created_utc": 1692185383,
   "score": 3,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwfsls8",
   "message": "My first job was at Kmart. Rounding up the carts was inconvenient, especially during inclement weather, but the worst was when people left dirty diapers in the carts. I don’t know why it was a thing, but it happened at least every other week. One time someone left a dirty diaper on top of the ashtray at the entrance to the store. The trash can is literally an arms length from the ashtray! 🤮",
   "created_utc": 1692197803,
   "score": 2,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwetibp",
   "message": "At the same time 'muricans at the fact that at most European stores / malls you have to insert a coin / token to get a cart, which you get returned upon returning the cartwhere it's supposed to be (on of the common culture shocks posted by 'muricans visiting Europe for the first time...)",
   "created_utc": 1692181371,
   "score": 6,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwfigut",
   "message": "I watch Cart Narcs and know it’s mostly entitled folx trying to “ save time” but end up arguing for a half hour with these people instead of just putting it away when asked politely.",
   "created_utc": 1692193911,
   "score": 3,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwes2vl",
   "message": "The projects! 👍🏾",
   "created_utc": 1692180376,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwf9y3o",
   "message": "Park next to the cart return. Make it easy",
   "created_utc": 1692190298,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jweyseb",
   "message": "I find it's a political test.  Most republicans don't return their carts.",
   "created_utc": 1692184704,
   "score": 245,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jweu00h",
   "message": "My mom uses that hand scanner at our grocery store so checkout is easy and says she was just the cashier and the bagger and I doesnt need a thrid job at Stop and Shop as a cart wrangler to.",
   "created_utc": 1692181706,
   "score": 248,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwf9fzp",
   "message": "[deleted]",
   "created_utc": 1692190069,
   "score": 0,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwflj91",
   "message": "Your mom. (I don't actually do that I just really wanted to say that)",
   "created_utc": 1692195121,
   "score": 0,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwfrdc3",
   "message": "Usually put it back unless trying to piss off sister she drives will put right behind car I’m a avid believer in the carts you have to put loonie in I like when people are lazy I get a extra loonie",
   "created_utc": 1692197347,
   "score": 0,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwfsr5i",
   "message": "I try not to, whenever it's even remotely reasonable, but I have on occasion left a cart in the corners between 4 spots, as out of the way as possible.  \n\nI will explain my reasoning; it's fucking Florida, in August.  Walmart doesn't have any kind of covering, so when you park you are leaving your car to literally bake in the sun.  Sometimes the dashboard is soft because it's partially melted.  It's fucking MISERABLE outside.  If I have been in the store long enough for that to matter, then that means I've got a lot of groceries to load up.  That's even less fun.  I also have a 5 year old who is sitting in said hot car.  The AC is on, but it's not really doing shit until I get the car moving and there is air flow into the radiator.  Even then, I need to get that kid home ASAP.  I can't like, pre-cool the car at all.\n\nIf the cart return area is nearby, I'll return it, but sometimes I have to park so far from one that I just don't give a fuck, I put it in a safe spot, kicks the wheels so it won't wander in a breeze, and go on about my day.\n\nTL;DR, Florida is stupid hot and I don't want my 5 year old to get a heat stroke.",
   "created_utc": 1692197858,
   "score": 249,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwg67bn",
   "message": "It all depends on how my knees are feeling that day, how far I have to walk, and if there is a cart return anywhere nearby. I should get a handicap placard but I'm not quite ready for that yet.",
   "created_utc": 1692202677,
   "score": 255,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwga78k",
   "message": "I leave shopping carts around for several reasons. The main reason is that was my job as a youth and i jumped at the chance to go into the parkinglot to grab a smoke while i gathered carts\nJust looking out for the next gen of me. Job security. Just like not pumping your own gas up north\nDown south we look at you as less than human if you cant pump your own gas.\nI was at a gas station once and some old man was having a breakdown over having to pump his own gas\nYoure an adult, pump your own gas.\nLeave the carts everywhere, i need to make an unauthorized worktime phone call. Plus you find all kindsa goodies in the parkinglot searching for carts\nAnd the final reason i dont return carts is because I refuse to take moral advice from Glenn Danzig",
   "created_utc": 1692204096,
   "score": 255,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwes6vq",
   "message": "The farm",
   "created_utc": 1692180453,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwffmo5",
   "message": "Probably the \"I don't own anyone anything\" mindset",
   "created_utc": 1692192759,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwfl81q",
   "message": "Everyone at Publix lol",
   "created_utc": 1692195000,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwfs148",
   "message": "The streets",
   "created_utc": 1692197590,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwfz71q",
   "message": "While we're at it, maybe we could also ask who pushes shopping carts blocks away from the store and leaves them at bus stops and parking strips. That kind of selfish laziness is next level.",
   "created_utc": 1692200193,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwg3apg",
   "message": "\u0026lt;SMALL CARTS\u0026gt; \u0026lt;LARGE CARTS\u0026gt;\n\nHow fucking hard is that?",
   "created_utc": 1692201642,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwg4dxf",
   "message": "there isn’t a good reason to not put a cart in the return receptacles. Prove me wrong.",
   "created_utc": 1692202029,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwgbeq4",
   "message": "What about people that take carts miles away and leave them on the sidewalk. Or throw e-scooters in the river",
   "created_utc": 1692204530,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwgdpun",
   "message": "Nazis",
   "created_utc": 1692205348,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwgensa",
   "message": "a homeless man, hey, at least I didn't steal it.",
   "created_utc": 1692205685,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwgf0rj",
   "message": "Streets.",
   "created_utc": 1692205816,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwgqg9m",
   "message": "Makes my blood boil. It would take you ten seconds to be a good person to the next one in need of a trolley but they say noooooo there's already an old man who gets paid for that.",
   "created_utc": 1692209851,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwguhxc",
   "message": "In South Africa, someone will come get the cart directly from you. I miss it. But also, walking fucking 10 yards to stow a cart is hardly a big effort.",
   "created_utc": 1692211279,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwgvym8",
   "message": "Think that's annoying, how about those assholes who get a cart and then just leave it at the register knowing they can just drop it off where they got it upon leaving",
   "created_utc": 1692211801,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwh9g42",
   "message": "Best way to really see someone's personality is how they act when they don't have to be good - like returning their cart to the corral.\n\nUnfortunately I didn't check this before getting married, and now I have a spouse that just leaves the cart at the head of the space if I don't take it myself.",
   "created_utc": 1692216618,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwhaeop",
   "message": "No one obviously",
   "created_utc": 1692216959,
   "score": 1,
   "submission_id": "15sll0i"
  },
  {
   "comment_id": "jwhb2et",
   "message": "Only time I’ve done this was when there was a car taking 3 spots next to me they were assholes so I was too and I bike locked a cart to there tire",
   "created_utc": 1692217192,
   "score": 1,
   "submission_id": "15sll0i"
  }
 ]
}