{
 "submission_id": "15smtje",
 "title": "Which fast food will you not eat and why?",
 "selftext": "",
 "created_utc": 1692184081,
 "permalink": "/r/AskReddit/comments/15smtje/which_fast_food_will_you_not_eat_and_why/",
 "score": 122,
 "url": "https://www.reddit.com/r/AskReddit/comments/15smtje/which_fast_food_will_you_not_eat_and_why/",
 "comments": [
  {
   "comment_id": "jwg461q",
   "message": "Most of it, because it's too fucking expensive.",
   "created_utc": 1692201952,
   "score": 53,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwfmrvw",
   "message": "Fast food in general. It’s all too expensive now. I shouldn’t have to spend upwards of $30 for my husband and I when we could go to an actual restaurant for nearly the same price. We just eat exclusively at home now.\n\nEdit: seems like lots of people are asking about the price comparisons. I know prices can easily vary greatly by location.\n\nExample: if I go to El tapatio and order Burritos deluxe which is 2 burritos (one chicken and beans and one beef and beans) and a side of either beans or rice, it’s $8.50. This could have also changed based on the last time I was there.\n\nIf I go to Taco Bell and get a chicken and cheese burrito (not listed on the menu here so it has to be customized from a bean burrito to add chicken) and a beef and bean burrito (also not on the menu here and has to be customized as well) it’s already nearing the price of the other restaurant but the burritos are about half the size and there is no side. Then you would have to double your Taco Bell order and add a side so now it comes close to $15 when I could go to an actual, non fast food restaurant for the same amount of food for less money and better food.\n\nIf I go to Cracker Barrel, most of their breakfast meals are under $15 here. A few are under $10.\n\nWhen we dine out (maybe 3 or 4 times a year) we don’t buy sides (especially if they already have sides as part of the meal) and we don’t buy drinks (alcohol, sodas, tea, etc). Lastly, we don’t buy dessert.",
   "created_utc": 1692195599,
   "score": 224,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwfhmfa",
   "message": "Subway. I swear I get sick every time!",
   "created_utc": 1692193575,
   "score": 170,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwfgwoa",
   "message": "Long John Silver. Can't do fast food fish. Plus I used to do deliveries for a company called Airborne Express. A huge vat of their vinegar busted on my van. I hated it.",
   "created_utc": 1692193284,
   "score": 81,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwfxh4j",
   "message": "Nobody has said Del Taco...and I won't either. Viva Del Taco!!",
   "created_utc": 1692199580,
   "score": 16,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwey3yg",
   "message": "Sonic. Those burgers are not good. I’ll stick to their drinks.",
   "created_utc": 1692184308,
   "score": 146,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwfh9k2",
   "message": "KFC, gosh the oil that they reuse again and again is filthy.",
   "created_utc": 1692193428,
   "score": 37,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwexv0h",
   "message": "I don't like McDonald's or most other fast food burgers. I don't dislike them but they're so meh that I rarely eat them",
   "created_utc": 1692184157,
   "score": 236,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg2y1v",
   "message": "Burger King. Sloppy, soggy shit.",
   "created_utc": 1692201519,
   "score": 121,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg86nn",
   "message": "Burger King. I had the chicken sandwich a few years back, and had horrible stomach flu symptoms for a few days afterwards. It could be unrelated, or could've been food poisoning from it, but that's the last thing I remember eating before it all hit me.",
   "created_utc": 1692203378,
   "score": 28,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg61xu",
   "message": "KFC. The smell alone makes me nauseous.",
   "created_utc": 1692202623,
   "score": 97,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg1w52",
   "message": "The primary reason why I don't eat fast food anymore is because it's too expensive. I can get breakfast anytime at my local diner, and it's less than six bucks. I can also get a burger and fries at the same diner for less than eight bucks. (Link to menu, in case anyone thinks I'm exaggerating: [https://zmenu.com/rhonda-s-emerald-diner-hubbard-online-menu/](https://zmenu.com/rhonda-s-emerald-diner-hubbard-online-menu/))  \n\n\nWhen I eat at my local diner, Rhonda and her staff make money, and that money goes right back into my community. When I eat at a fast food restaurant, that money goes into a CEO's pocket. Screw that.",
   "created_utc": 1692201150,
   "score": 84,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg2s2s",
   "message": "Five Guys. They pretty much rob you. I went there with my ex and when the total came out to $38, I was like ' We could have gone to an actual Restaurant'.",
   "created_utc": 1692201460,
   "score": 218,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg8k33",
   "message": "Long John silver; gross",
   "created_utc": 1692203511,
   "score": 41,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwgeyos",
   "message": "Subway, Chipotle, Burger King. All because of food poisoning. The Chipotle one was the worst. That day, myself, my boss and my wife all went to Chipotle, but 3 separate locations and *all three of us got food poisoning*",
   "created_utc": 1692205795,
   "score": 49,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwf3aq2",
   "message": "Arby's. I've tried 3 things from their menu and didn't like any of them. I'm good on leaving it at that.",
   "created_utc": 1692187106,
   "score": 153,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg8vqt",
   "message": "Jack in the Box\n\nI've never been in a clean, well-functioning one.",
   "created_utc": 1692203627,
   "score": 14,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwgg2js",
   "message": "Panera Bread because it sucks shit and is way too expensive.",
   "created_utc": 1692206189,
   "score": 101,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwfo4ws",
   "message": "All of it",
   "created_utc": 1692196123,
   "score": 50,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwf87vd",
   "message": "In-N-Out has bad fries.",
   "created_utc": 1692189500,
   "score": 252,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg3alv",
   "message": "KFC. I never tried it till I was 18. My mum wouldn't let me try it bc my uncle apparently worked at one when he was in his late teens and told her stories about people spitting in the food, and other gross stuff she always refused to tell me (so I'll let your imagination wander on that). But my bf's family ate it all the time so I kinda had to try it one day while staying at his. I genuinely thought the food itself was disgusting and never touched it again (I'm now 34yo).\n\nAlso Papa John's. I used to love it but one day, about five years ago we ordered and the cheese was full of long strands of human head hair. I practically threw up on the spot. Haven't had takeout pizza since.",
   "created_utc": 1692201641,
   "score": 43,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg68yi",
   "message": "Wienerschnitzel, just horrible all around. Cold buns, bland hot dogs, obviously canned chili beans and unmelted cheese. It really tastes like hospital food, and to top it off it's pricey af for what it is.",
   "created_utc": 1692202693,
   "score": 17,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg4z9u",
   "message": "Burger King, because it's just horrible.  Every now and then I see some limited time thing advertised that sounds decent, but it's disappointing at best.",
   "created_utc": 1692202239,
   "score": 19,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg8gm8",
   "message": "Chicken nuggets look like the most cardboardy, ultraprocessed crap of all time.",
   "created_utc": 1692203478,
   "score": 11,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwfmfr5",
   "message": "Pizza Hut because why is my pizza always sweet with cinnamon flavor ?? Stopped going",
   "created_utc": 1692195468,
   "score": 31,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwfau3g",
   "message": "Burger King. A chicken nugget SQUEAKED when I bit into it. Like styrofoam! Do not want!",
   "created_utc": 1692190699,
   "score": 39,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwfvhau",
   "message": "KFC. Always nuked my stomach. :(",
   "created_utc": 1692198862,
   "score": 17,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwfw2jn",
   "message": "KFC is absolutely vile.",
   "created_utc": 1692199075,
   "score": 21,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg2i56",
   "message": "Chick fil a I just don’t see the hype. They’re too expensive and it’s really not that great. 🤷🏻‍♀️",
   "created_utc": 1692201363,
   "score": 82,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg33uu",
   "message": "McDonalds, aside from being not very good, they pissed me off one day. I had ordered something at the drive thru. I then went to the first window and paid. I went to the 2nd window to pick it up and they tell me that item was not available so they were going to give me something else instead. I told the person I didn't want that item, only what I had ordered. I told her to give me my money back instead. She refused. She insisted I accept the alternate item. Told her no way, that they are unable to provide me the item I ordered so they had to give me my money back. After a few minutes of back and forth all of a sudden they were able to get the shake machine working and they were able to provide the vanilla shake I had ordered. I said that was it, I was done with McDonalds and I haven't been back in 10 years.",
   "created_utc": 1692201575,
   "score": 16,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg9296",
   "message": "None of it.  (OK, OK, but if I was forced at gunpoint to eat it then I would choose Culver's; it's actually good for being fast food).  Did you know there are over 50 ingredients in a Chick-Fil-A Original sandwich?",
   "created_utc": 1692203692,
   "score": 13,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwgktdj",
   "message": "I stopped eating fast food about 4 years ago. I do stop at McDonald's once a week, but that's only for the HI-C orange. I was on cloud 9 when they brought that back. Lol!",
   "created_utc": 1692207861,
   "score": 3,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg2r8r",
   "message": "Jack-In-The-Box burgers. They are hockey pucks.",
   "created_utc": 1692201451,
   "score": 12,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwexxk3",
   "message": "I don't like any of the greasy ones. They're too greasy",
   "created_utc": 1692184200,
   "score": 22,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwf4dud",
   "message": "DQ food",
   "created_utc": 1692187645,
   "score": 24,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwf1ede",
   "message": "McDonald's  - it can barely be called food.  I haven't eaten it for over 10 years and have no plans to eat it any time soon.",
   "created_utc": 1692186128,
   "score": 31,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg17js",
   "message": "Subway. Bread is god awful. Meats are slimy and bland. The fresh veggies looked like they were picked last year. Slap all that together for a $12 sandwich. Hard pass. \n\nLong John silvers. No explanation needed.",
   "created_utc": 1692200911,
   "score": 15,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg6vk9",
   "message": "McDonald’s McNuggets. I threw up after eating them as a kid, and I just can’t do it. I’ve tried them since and they are still so nasty.",
   "created_utc": 1692202915,
   "score": 9,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwfu4b4",
   "message": "Five Guys. I've tried it twice in my life, years apart, both times with my wife. We both got horridly sick immediately after both attempts, my stomach was so dicked up I threw up the first time, managed to keep it down the second",
   "created_utc": 1692198366,
   "score": 10,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg7ayy",
   "message": "Burger King, i worked there for one day a long time ago and the way I saw things being prepared and flash heated, never again!",
   "created_utc": 1692203067,
   "score": 3,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg9fy3",
   "message": "Carl's Jr.\n\nWhere I live, a manager was caught on camera stirring their sauce(not sure what) with his bare hands! He then scrapped it off into the bowl...🤢🤮\n\nEdit: https://youtu.be/dcSDPQcfohY",
   "created_utc": 1692203827,
   "score": 10,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg9ud7",
   "message": "Long John Silver's\n\nThe idea of fast food fish is pretty gross but as a kid my family went too often for my liking( because of those God damn Bear Essential coupons!) Dysentery was almost a guarantee, everytime.",
   "created_utc": 1692203970,
   "score": 3,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwh2wc8",
   "message": "KFC, because it's gross.",
   "created_utc": 1692214271,
   "score": 4,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwh35dd",
   "message": "Hot Dogs. Was eating one while watching my dog take a shit when I was 7. Can’t eat one anymore without thinking its a turd in a bun.",
   "created_utc": 1692214362,
   "score": 3,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwfcdt4",
   "message": "Chick fil a. Not supporting homophobes.",
   "created_utc": 1692191384,
   "score": 118,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwf9sh5",
   "message": "Chipotle.  Bland, insipid food. I don't get why it's popular, especially in Southern California, where they have so many good taco/burrito shops.",
   "created_utc": 1692190227,
   "score": 28,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwg515z",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwgac5n",
   "message": "White Castle. I’d rather not talk about it",
   "created_utc": 1692204147,
   "score": 8,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwhb7f3",
   "message": "Fast food eggs, from anywhere. That shit weirds me out.",
   "created_utc": 1692217240,
   "score": 6,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwfyd7m",
   "message": "Almost Anything from McDonald’s is pretty horrible at this point.  It’s either the quality just keeps going down or it’s possible that when I avoid it long enough I don’t like it.  I like their fries and their breakfast stuff.  I will occasionally eat chicken McNuggets but I haven’t eaten anything else there in years.  The burgers are horrible.",
   "created_utc": 1692199896,
   "score": 4,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwgqqgr",
   "message": "Fish filet... something about fast food fish gives me the heeby jeebies.",
   "created_utc": 1692209951,
   "score": 3,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwgzqvm",
   "message": "Burger King. I worked at burger king when I was a teenager and the food wasn't bad, but I recently went in with a coupon (I will not pay for fast food at 'normal' prices anymore) and the food was horrible. Pathetic tiny patties that were chewy, gross vegetables, stale bread. And the fries were bland, gritty and greasy.",
   "created_utc": 1692213151,
   "score": 4,
   "submission_id": "15smtje"
  },
  {
   "comment_id": "jwgmcuf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15smtje"
  }
 ]
}