{
 "submission_id": "15spdra",
 "title": "How do you feel towards the person you lost your virginity to? Do you still remember them?",
 "selftext": "",
 "created_utc": 1692191077,
 "permalink": "/r/AskReddit/comments/15spdra/how_do_you_feel_towards_the_person_you_lost_your/",
 "score": 174,
 "url": "https://www.reddit.com/r/AskReddit/comments/15spdra/how_do_you_feel_towards_the_person_you_lost_your/",
 "comments": [
  {
   "comment_id": "jwfkz7u",
   "message": "Yes, I still remember my wife. I think she's pretty good.",
   "created_utc": 1692194903,
   "score": 158,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfmw5t",
   "message": "I don’t feel one way or another. I haven’t seen her in over 20 years or so. I haven’t thought about her in years until this post.",
   "created_utc": 1692195646,
   "score": 121,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfkri0",
   "message": "Pretty sure she was the one who got away, but we dated in highschool and she moved away before our relationship could find a conclusion. At this point it's probably just nostalgia lol.",
   "created_utc": 1692194820,
   "score": 112,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfoich",
   "message": "Yo that’s crazy how many of you married your first but respect",
   "created_utc": 1692196265,
   "score": 238,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfwugh",
   "message": "I mean, we've been married for 15 years and have 5 kids. I guess she's OK.",
   "created_utc": 1692199354,
   "score": 69,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfco3y",
   "message": "I've been with her for 10 years and I hope to still be with her for another 60 or so",
   "created_utc": 1692191509,
   "score": 76,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfdtzm",
   "message": "Still remember her? Dafuq? I doubt there is a single person, who has a healthy brain, who would forget their first partner",
   "created_utc": 1692192007,
   "score": 244,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfqw53",
   "message": "I miss her to be honest.\n\nShe was fun, fiercely intelligent and far too good for me.  It’s was humbling being completely ill-equipped to argue with her, but fun to watch her demolish adults in debate and run rings around them in conversation.\n\nIt’s been 22 years since I last saw her, 17 since we last communicated by email.  She has a family of her own now, and inevitably was an enormous success in her career.",
   "created_utc": 1692197168,
   "score": 43,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfk15h",
   "message": "Pretty damn good. It's only been a few months but I'm totally into him and (despite his self proclaimed aversion to relationships) he pushed to be exclusive and he's texting on an almost daily basis wanting to get together.\n\nAs for how I feel, 50% horny, 40% happy and 10% anxious sums it up well.",
   "created_utc": 1692194530,
   "score": 46,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfkptr",
   "message": "I love her. That's why I married her!",
   "created_utc": 1692194802,
   "score": 40,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfohhq",
   "message": "It was my high school girlfriend. I ended up breaking up with her. We hooked up again about 6 months after the breakup. Just casual sex. No labels. Ended up go to different colleges in the same city. Hooked up and went on some dates during our freshman year. Still no labels.\n\nEventually she basically gave me an ultimatum. Said she emotionally couldn’t do the casual thing anymore. Basically we get back together for real or we go our separate ways. I wasn’t willing to get back together, but I respected her decision and didn’t want to toy with her feelings. She wanted to be together, and I knew that any kind of just treating her like a normal friend would have only give her hope. So I basically just cut out all communication.\n\nThat’s been 8-9 years ago now. She seems to be doing well. Just recently got engaged. She was a good girl, and I’m happy for her. Wish it didn’t have to end like it did, because she was cool and I liked spending time with her. But it would have been selfish and emotionally manipulative to do anything besides cut off communication like I did. I have nothing but fond memories of her. I hope she’d say the same of me.",
   "created_utc": 1692196256,
   "score": 44,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfnz7x",
   "message": "Well on the \"hot/crazy\" matrix she was firmly in the top right hand corner lol\n\nSo I remember her very vividly, the sex is still some of the best that I've ever had. Luckily I had some older and wiser friends who kind-of dragged me out of that relationship. For which I am very grateful.\n\nI have no idea what became of her, and I don't particularly care :-)",
   "created_utc": 1692196062,
   "score": 21,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfu9sr",
   "message": "They were cool. Wish them well. No hard feelings",
   "created_utc": 1692198422,
   "score": 19,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwflxj8",
   "message": "I hate her with every fiber of my being and the world became a better place the moment she died",
   "created_utc": 1692195273,
   "score": 94,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfch1m",
   "message": "I think that if I forgot my wife (to whom I've been married for decades) she'd take me to see a healthcare professional.  Because she loves me.",
   "created_utc": 1692191423,
   "score": 30,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwftsl7",
   "message": "I remember her.  I married her 42 yrs ago.",
   "created_utc": 1692198247,
   "score": 13,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg5meh",
   "message": "He's still my husband 20 years later.",
   "created_utc": 1692202470,
   "score": 12,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfda9l",
   "message": "I’m married to him.",
   "created_utc": 1692191773,
   "score": 25,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfdky7",
   "message": "Woke up next to her this morning.",
   "created_utc": 1692191900,
   "score": 21,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfttqh",
   "message": "Shes pretty cool but sometimes annoying af… shes with the kids right now",
   "created_utc": 1692198259,
   "score": 26,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfo1jz",
   "message": "Still in a relationship with him. 9 years and going strong!",
   "created_utc": 1692196087,
   "score": 8,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfvu42",
   "message": "I love her with every ounce of my soul.  Married her at 19, will be my 20th anniversary in December.  She's my Peach and I'm her Bowser.  I mean I'm her Mario.",
   "created_utc": 1692198990,
   "score": 8,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfntol",
   "message": "I'm still married to her, so yeah I hope I remember them!\n\nFirst girl I fooled around with, yes fond memories of that Summer we dated, and we ended up being friends for the rest of their life.",
   "created_utc": 1692196003,
   "score": 7,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfp23h",
   "message": "He was a friend I met during a school theatrical production. I was 17, I told my dad I was staying back at school to do assignments and then hiked it to his place. His father nearly caught us. He’s a good person, and has come so far. He was addicted to prescription meds for a long while. I won’t ever forget him and I hope he’s doing well since coming off that shit :))",
   "created_utc": 1692196476,
   "score": 10,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfvfb7",
   "message": "I still very much love and remember my husband!",
   "created_utc": 1692198842,
   "score": 6,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfwjvu",
   "message": "Seeing as i am married to her 10 years later and we have a 3mo son? I love this woman! 😀",
   "created_utc": 1692199249,
   "score": 5,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfjtc6",
   "message": "Last I knew they were addicted to heroin. I assume they're dead now and I honestly couldn't care less.",
   "created_utc": 1692194443,
   "score": 11,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfv4e5",
   "message": "Oofta, I do remember them. But it’s not a romantic story at all. I was caught up in the “everyone is doing it, better get it over with” and I lost it to a stranger at 15. He was also 15 and it was his first time. 😩",
   "created_utc": 1692198732,
   "score": 7,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfxio7",
   "message": "I still remember her, but I hate her guts now. She ended up cheating on me, and then thought it would be alright to still be friends after.",
   "created_utc": 1692199595,
   "score": 3,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwferho",
   "message": "I married her.",
   "created_utc": 1692192396,
   "score": 8,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfpy3c",
   "message": "I still think about him and that was 20 years ago. He was a great guy.",
   "created_utc": 1692196811,
   "score": 5,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfqlvj",
   "message": "Yeah, it was a good highschool relationship. I don't hold any ill will towards her. I hope she's doing well.",
   "created_utc": 1692197060,
   "score": 5,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfwf8b",
   "message": "He raped me. I don't count that as my first time anymore, but a few weeks later, I had consensual sex with him. I was in full denial about what happened for a while.\n\nHe is vile. He thinks I'm psycho coz I called him a rapist. He got very mad when I called them ugly. But thought it was funny when I called him a rapist. Dude clearly has some issues. Last I knew, he got bashed and mugged. Unfortunately he lived.",
   "created_utc": 1692199203,
   "score": 5,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfzzcv",
   "message": "He's cool. We're friends on social media, I'm glad he went after his dreams and has a family he loves.",
   "created_utc": 1692200475,
   "score": 5,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfhd0v",
   "message": "Christ yes, she was so gorgeous, adventurous and young, I’ll never have another woman that young and attractive, it just wouldn’t be morally right. But the memories of both her and me at that age are still so vivid. I still remember the pain of loosing her as well, due to my lack of communication skills. I was so young I was still developing my emotional vocabulary and trying to understand what it was I was feeling, over and above plain lust and the joy of fucking. Couldn’t articulate with any degree of nuance or insight, and not enough experience, or desire actually, to fake it, to keep the relationship going.",
   "created_utc": 1692193468,
   "score": 11,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfot7s",
   "message": "Indifferent. It was like 37 years ago and she’s now a big Trumper and into selling MLM shit. So I just don’t pay her any mind.",
   "created_utc": 1692196382,
   "score": 3,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfnqp0",
   "message": "I have no feelings towards her one way or another apart from that I don't want to keep in contact. Not a terrible person, just a hard life, and I enjoy my peace.",
   "created_utc": 1692195973,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfqy30",
   "message": "Best blow job ever. I've been chasing that dragon ever since.",
   "created_utc": 1692197188,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfua23",
   "message": "Does my hand count?",
   "created_utc": 1692198424,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfy01h",
   "message": "I had only two relationships, so yeah I remember him very well as he’s my only ex. I don’t have nice thoughts for him because he did a lot of bad things, but I don’t really think about it or care now.",
   "created_utc": 1692199766,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfye3j",
   "message": "I remember her fondly. Still talk to her on a rare occasion even after 30 years",
   "created_utc": 1692199905,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg0z6v",
   "message": "I lost my virginity my senior year of high school. It was a bit embarrassing as maybe ten minutes into it, her younger sister came in. Luckily we were both wearing most of our clothes with a blanket over us. I was on top. And her sister sat on my back, and talked to us for a couple minutes. After she left, we did not continue. Sadly, this was the only time her and I had sex.   \n\n\nShe broke up with me about a month later, for some guy she met at the gym.  \n\n\nShe now has three kids from two separate people. I hope she is doing well and happy with her life.",
   "created_utc": 1692200829,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg146l",
   "message": "I’ve been sleeping with him for almost 33 years now",
   "created_utc": 1692200878,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg1f29",
   "message": "Of course. She’s a great person. We dated for 4 years in HS and college. Just normal growing apart. She’s married with a couple of kids. We still message each other when we see the other had a life event or on birthdays. It’s been almost 15 years since we broke up.",
   "created_utc": 1692200984,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg1jg4",
   "message": "No emotion. It was good while it lasted. Years 18-20 so can’t complain",
   "created_utc": 1692201027,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg4nop",
   "message": "We're actually going out tonight to meet our son's new girlfriend.  Our Grandkids tend to side with her, but I'm good if they need a fast $20 at Walmart or Target.",
   "created_utc": 1692202126,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg7qgz",
   "message": "sweetest guy i ever met. i was fresh out of a breakup when i was 19 and thought “screw it im gonna be a virgin forever if i don’t lose it soon”. i matched with a guy on tinder (i know) who was super sweet and mature and cute and fun to talk to. i was like “hey this is a weird question but would you maybe want to do it? oh and i’m a virgin btw” and he was so respectful and kind and it was a great experience. we saw each other a few months ago before he was deployed. sweetest most mature respectful guy i’ve met and we’re still friends. wish him nothing but the best",
   "created_utc": 1692203218,
   "score": 3,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg850k",
   "message": "I want a redo!!!",
   "created_utc": 1692203362,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwglnih",
   "message": "Indifferent. He was a jerk but we were both 16, so I hope his life has turned out satisfactory and that he is a good person now.",
   "created_utc": 1692208152,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwgyz0g",
   "message": "She was a senior in high school and while I thought it was cool at the time, I was taken advantage of heavily and manipulated hard. I had no clue what sex really was other than shit talk from friends and what not. \n\nSuffice to say, I regret it tremendously and have no interest in continuing any kind of discussion with that girl again— she was a few cards short of a deck and it just wasn’t natural with what happened. \n\nI was only 15 years old.",
   "created_utc": 1692212873,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwgz326",
   "message": "fuck that guy, I hate his guts now. he was my first real boyfriend when I was 17 and he manipulated me, emotionally abused me, and kept me from seeing my cats after we broke up (at the time we were still cordial). I miss my cats and I hate him for keeping me from seeing them",
   "created_utc": 1692212913,
   "score": 3,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfcr0i",
   "message": "We're not in touch, but we have a mutual friend, \u0026amp; he's a multimillionaire who even pilots his own Learjet...  He broke up with me to date someone he met on vacation, but she \u0026amp; I had actually gone to school together, \u0026amp; they married a short time later...",
   "created_utc": 1692191543,
   "score": 3,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfnacc",
   "message": "I don't know how I feel about him. I do remember him. I wonder if he knew better than to have sex with someone my age. It wasn't legal and he would have been in trouble if anyone found out.",
   "created_utc": 1692195797,
   "score": 3,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfhp0c",
   "message": "i remember him because of his enormous penis that he had and i was super scared as it was my first time but we made it work.. but i have strong hate towards that man because after few weeks i found out he is crazy and hits woman if something is not done his way.. but the penis is unforgetable lol",
   "created_utc": 1692193604,
   "score": 5,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfffw2",
   "message": "Remember them? I get reminded every single day...",
   "created_utc": 1692192678,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfjcj3",
   "message": "Of course I remember her.  She's an artist now.  She was forced to attend MIT, but ultimately decided to take the creative route in life.\n\nI tried to contact her; but she's not amenable to hanging out with me.",
   "created_utc": 1692194258,
   "score": 3,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfc1r6",
   "message": "A little embraced when I saw them, but it was fun, and I liked them.",
   "created_utc": 1692191238,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfun5v",
   "message": "Ew",
   "created_utc": 1692198558,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwgfa2y",
   "message": "Disgust. Pure disgust. He’s now a white supremacist. I’m Black, so it’s a bit odd.",
   "created_utc": 1692205909,
   "score": 0,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg6ecr",
   "message": "Damn I wish there would be a lesbian here saying \"sure I remember, i married her\". And i wish this lesbian would be me. lol",
   "created_utc": 1692202747,
   "score": 255,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfvrv7",
   "message": "I kinda just lost my v to the first girl I could bc I was not abt to graduate a virgin lmao. She was a whore we fucked a few times but than she started telling people I confessed my love for her and made her breakfast in bed and a bunch of sappy ass shit like that I didn’t do so I cut her off",
   "created_utc": 1692198968,
   "score": 255,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwggixk",
   "message": "How could I forget my dog",
   "created_utc": 1692206352,
   "score": 254,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfnub9",
   "message": "Felt very hard and then squirt squirt soft serve.",
   "created_utc": 1692196010,
   "score": 249,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwflm3u",
   "message": "We're still in touch decades later, through Facebook.  I don't think she knows she was my first.   I knew I wasn't hers.",
   "created_utc": 1692195151,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfnjsx",
   "message": "He was kind of annoying but a good guy overall. The whole losing my virginity part was unimpressive and humiliating.",
   "created_utc": 1692195898,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfno9e",
   "message": "She was a nice Person but we were both not mature enough to have a steady relationship",
   "created_utc": 1692195947,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfnquu",
   "message": "Yeah, she was pretty cool. We fell out so I haven’t really talked to her since we broke up, but it’s salvageable if i ever wanted it to be lol. Unless she’s married or something by now I guess.",
   "created_utc": 1692195974,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfou7w",
   "message": "Yes. Somedays wonder how he is now.",
   "created_utc": 1692196393,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfouq5",
   "message": "It's been 50 years ago now. I remembered her but not her name. It was really just a horny hookup. She had a crush on me. We didn't date, just hooked up twice. She stalked me around campus for about another year.\n40+ years later, my wife introduced me to an obese neighbor lady whose kids were friends with my stepdaughter. While we were talking about colleges, she mentioned her sorority and it became apparent to me was \"her\".  Next time we bumped into her she said she looked me up in the yearbook and that I was one of her sorority \"sweethearts\" or something like that.\nI acted surprised and claimed to not remember.\nI told my wife. She laughed. \nShe and I never mentioned it, but we both knew.",
   "created_utc": 1692196398,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfpbjc",
   "message": "Not really was 15 years ago at this point and it was just an ex that I haven't talked to or even seen any mention of her in at least 13 years. \n\nI don't even remember their last name, age, or barely remember what they even look like\n\nAs time goes on I forget about more and more of all my past partners and life and I'm sure in another 10-20 years I won't even remember their first name",
   "created_utc": 1692196576,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfpduk",
   "message": "Bump into her occasionally as we both ended up on the same town (where she grew up). Good memories and I wish her nothing but the best. Looks like her life turned out and I am happy how things ended up for me.",
   "created_utc": 1692196600,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfq80i",
   "message": "Still married to her.",
   "created_utc": 1692196916,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfqe7r",
   "message": "Don't remember them. Never knew them. Hope they're rotting in the deepest part of hell",
   "created_utc": 1692196981,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfqwgt",
   "message": "I hate him with all my heart! Lol such a scum bag…",
   "created_utc": 1692197172,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfr0m9",
   "message": "It was over 25 years ago, not only do I remember her but remember every single detail. Short as it was it's never leaving my memory. She's still insanely beautiful and hope I bump into her again some day.",
   "created_utc": 1692197214,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfrq54",
   "message": "I still remember that selfish cunt",
   "created_utc": 1692197478,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfrxxj",
   "message": "She was my first love and it was in public so that was fun. She was adorable back then. Now she is hideous and ended up being a jerk so I don't know Good memories but she ended up being awful. It was great at the time but she was always talking about her friend's boyfriend being so attractive needless to say I disinvited her to prom. It was a really good memory the first time and every time after but now she just looks like somebody's mom after a few kids and a trip to Hot topic.",
   "created_utc": 1692197557,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfs0gq",
   "message": "I was on a boarding school and was secretly in her buildung and having a sleep over with her. She was a emo girl and we had to listen to \"Amy Lee ft. Seether - broken\" for 2 hours straight in a loop. I remember that song at least as good as my 1st time",
   "created_utc": 1692197583,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfsey1",
   "message": "I feel like he was an abusive asshole who forced me to pay for his cigarettes when I barely had any money myself because I was a broke ass uni student. \n\nHe didn't make me cum once in the year we were together.",
   "created_utc": 1692197731,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfuf4s",
   "message": "I stuck my dick in crazy. Lingered in the relationship 4 years too long and ended up in jail for 2 days when I finally left. It's sad and funny that being in jail was better than being with her.\n\nWhat's also sad is she still tries to hit me up, 8 years later at this point. I'll get on fb with some crazy long message requests about how big of a piece of shit I am and that I ruined her life. I'm now married with child number 2 on the way, it just baffles me that she hasn't moved on yet.\n\nI don't think I hate her, I just feel sorry for her. She has had a rough life. I just wish she'd move on from me and leave me alone.",
   "created_utc": 1692198475,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfuoqt",
   "message": "Actually when I think about it I feel some degree of guilt.  Being male and 15 at the time; all I cared about was getting laid and losing my virginity.  So when someone easy came along I went for it.  Why guilty?  Because afterwards I was embarrassed to be seen with her in school (her reputation) that I dissed her.  It was kind of a crappy thing to do and I don't think she deserved it.",
   "created_utc": 1692198575,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfv3yw",
   "message": "No feelings at all really. Just a random high school hookup at a party. Two horny drunk/high kids",
   "created_utc": 1692198728,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfv5lr",
   "message": "She was fuckin crazy and I regret losing it so early",
   "created_utc": 1692198744,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfvd2a",
   "message": "Indifferent. Don't know them anymore",
   "created_utc": 1692198820,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfvixx",
   "message": "Gross. To this day, I have no idea what I was thinking. Still hits me up every now and then trying to rekindle some sort of friendship. I'm having none of it lol",
   "created_utc": 1692198878,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfvtzq",
   "message": "We have been together for almost 19 years now.",
   "created_utc": 1692198989,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfw2gi",
   "message": "Haven't talked to her in years. I'd say hey if I bumped into her, but I don't feel much of anything. She was a short-lived high school girlfriend.",
   "created_utc": 1692199075,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfwclm",
   "message": "I actually just reached out to my first, 15 years later.  I never told her she was my first and we are gonna meet up for drinks soon. This post is like a pink elephant.",
   "created_utc": 1692199176,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfwcym",
   "message": "I live with her.",
   "created_utc": 1692199180,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfwf0n",
   "message": "It was young love. About a month afterwards, she (and her mother) started being really horrible to me and I had a very miserable half-year until I plucked up the courage to break up with her. I think overall it was a regrettable set of circumstances but it taught me a lot of valuable lessons.",
   "created_utc": 1692199201,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfwg47",
   "message": "I do remember her. She was kind. She is married and has a family; she seems really happy.",
   "created_utc": 1692199211,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfwm71",
   "message": "Lost it to my high school boyfriend. Kind of embarrassed to have dated him but also could’ve lost it to someone waaay worse so I guess it’s fine. He always treated me good but was just a bit of a goof.",
   "created_utc": 1692199271,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfwsb8",
   "message": "She was so kind and lovely, and I felt guilty for ages for treating her so poorly. Got in touch online 20 years later and she said it was all cool (because she's still so kind and lovely).",
   "created_utc": 1692199333,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfwxzz",
   "message": "They're the love of my life. I'm marrying them. So I'd better bloody not forget they exist.",
   "created_utc": 1692199389,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfwzdu",
   "message": "Im in the boat where I wish I didn't remember them Jesus Christ...",
   "created_utc": 1692199404,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfy95y",
   "message": "It was over 40 years ago and we are still friends, by group text message thread, with some other old friends",
   "created_utc": 1692199856,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfy9iw",
   "message": "We were together for a short time. Like 3 weeks. She dropped out of school and moved back home. She lost a relative and another relative needed a lot of help. I still google her name and hometown. Maybe I miss her? I don't know.",
   "created_utc": 1692199859,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfyaz0",
   "message": "Well she's my stepsister now and we have not talked in 15 years, even at family events",
   "created_utc": 1692199874,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfyb5w",
   "message": "There is only one person who I hate more than them in the world and that's my abusive rapist father , he wasn't any better, but kinda hard to compete with my literal father for that title.  \n\nUnfortunately I'll always remember him",
   "created_utc": 1692199876,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfyfo6",
   "message": "Yes! We lost it to each other underneath a playground in the middle of the night after sneaking out. I was 14, he was 15. I wouldn't say it was the most functional session - as it seemed he didn't really know how to be on top lol. If I could go back I'd say to do it differently and not with him. Cause he didn't treat me very well and he didn't talk to me for like 3 weeks after. But now he's stuck in a toxic relationship with a woman who goes on social media to try and make him look bad. So I feel sorry for him. But also think I dodged a bullet haha",
   "created_utc": 1692199922,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfyv1u",
   "message": "I hate him with a passion that runs deep and true. Last I heard he was homeless in Seattle, but that feels to good for a scumbag pedo pos like him.",
   "created_utc": 1692200076,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfz2ea",
   "message": "It was rape so pretty disgusted. I was 13 he was 25. A neighbor",
   "created_utc": 1692200148,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfz2k9",
   "message": "I think of them fondly cause they didn’t force it they asked we planned ¯\\_(ツ)_/¯",
   "created_utc": 1692200149,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfz8y9",
   "message": "Ohhh I don’t want anything to do with her. She hurt me in a bad way but looking back, I wasn’t as good of a boyfriend as I originally thought, and for that, I feel bad. Live and learn though. I hope she’s doing well, I just don’t care to find out lol.",
   "created_utc": 1692200212,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfzdoi",
   "message": "She is great we are friends on FB not really in touch though. Of course I remember her always will :)",
   "created_utc": 1692200258,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfzo2c",
   "message": "We had an ugly break up, she started drama with girls I had relationships with after for a while and about 2 years ago was shot dead by her boyfriend in front of his 7 year old daughter. She had issues but didn't deserve to go out like that",
   "created_utc": 1692200362,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfzuw0",
   "message": "It was a hooker in February 1988. I remember her body more than her face.",
   "created_utc": 1692200431,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfzymx",
   "message": "She's still my cousin!",
   "created_utc": 1692200468,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwfzzlw",
   "message": "We didn’t stay together but fifty years later we’re friends again after having lost touch for many years. Fond memories of two young kids who meant well.",
   "created_utc": 1692200478,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg0eh6",
   "message": "I kind of vaguely remember him. Haven’t thought about him in decades though.",
   "created_utc": 1692200625,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg0p1g",
   "message": "She was one of my best friends in highschool. We ended up sleeping together after getting drunk one night. We both kind of pretended it didn't happen \u0026amp; remained friends for decades, though we didn't always see one another often enough. She passed away 6 years ago and I miss her a great deal.",
   "created_utc": 1692200729,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg0rwk",
   "message": "Last I heard, my ex is still a NEET living with his parents and playing WoW all day every day. He's a nice enough guy and I hope things improve for him, but I'm really glad I broke up with him almost 20 years ago. \n\nI actually ended up marrying one of his old college friends, but that's another story.",
   "created_utc": 1692200757,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg0uww",
   "message": "We’ve remained together for 38 years.",
   "created_utc": 1692200787,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg0vly",
   "message": "I'm happy she took my virginity but I'm sad and guilty I got her into trouble for sleeping with a minor. She has been shunned ever since.",
   "created_utc": 1692200793,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg0wfu",
   "message": "We don't talk anymore, but we're not on bad terms or anything. She was my high school sweetheart. We dated for 3 years. Broke up when we went to different colleges. But it was amicable. She's married now, he seems like a good dude. Although I've never met him. I think they're expecting their first kid. I wish her nothing but the best. She was a great girlfriend.",
   "created_utc": 1692200801,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg1sek",
   "message": "She said her name was \"Capri\" and she was a pretty, freckled redhead working at the old Mustang Ranch outside Reno.  She was very sweet and patient.  That was over 40 years ago and I have no idea what happened to Capri.",
   "created_utc": 1692201113,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg1sgp",
   "message": "Nostalgic. I hope she is happy and doing well. Hurt like hell when she broke up with me, but it was for the the best.",
   "created_utc": 1692201114,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg1twb",
   "message": "Last I heard he flunked out of uni because he was partying too much. That was like 25 years ago",
   "created_utc": 1692201128,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg1u69",
   "message": "She cheated on me many times with a few different guys. Honestly I don’t care anymore and I don’t know what she’s up to.",
   "created_utc": 1692201130,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg1uih",
   "message": "If I know them I don't know who they are yet",
   "created_utc": 1692201134,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg22tt",
   "message": "Fuckin awful. She tried to baby trap me, gave me an std she didn’t disclose about, and ended up having guns drawn on me by her friends who she told that I ‘hit it and quit it’. No, I wasn’t planning to pop my cherry that night and legit had to work early the next day, sorry I couldn’t make you breakfast in the morning when you just wanted to take a cute guys v card. I told you this, you just didn’t care to remember. \n\nWherever you are, Fuck you Erin.",
   "created_utc": 1692201215,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg22xp",
   "message": "I’m glad she died",
   "created_utc": 1692201216,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg24r3",
   "message": "We broke up very amicably. Things just weren't working out long-term and we agreed to break it off.  \n\n\nI've seen her a couple times since, she's doing well and I'm happy for her.",
   "created_utc": 1692201233,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg2ep3",
   "message": "I feel sorry for her.  We only did it the one time.  We were both 14.  A couple of months later she got pregnant by someone else, and kind of disappeared.  I found out much later from one of her friends that her father had been molesting her for years, and had kicked her out when she got pregnant.  The baby's father's parents took her in and helped raise the baby.  I don't know if anything ever happened to her father for the abuse.  This was over 30 years ago.",
   "created_utc": 1692201329,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg2f8w",
   "message": "fucking ACE!",
   "created_utc": 1692201335,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg2igk",
   "message": "I married him lol",
   "created_utc": 1692201366,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg30l2",
   "message": "She's the love of my life and I wake up next to her every morning 38 years later.",
   "created_utc": 1692201544,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg37eh",
   "message": "I remember her vividly. Skinny little thing 40 years ago. Now she’s over 300 lbs. with multiple chins living in a trailer park.",
   "created_utc": 1692201610,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg3l7q",
   "message": "I haven't talked to her since we \"dated\", but she has attempted to indirectly break up two of my relationships. She got into a verbal spat with my next girlfriend, and then when my wife and I started dating she posted a bunch of pictures of herself and I together and labeled the album \"New Beginnings\". Wasn't happy about being blindsided by that confrontation.",
   "created_utc": 1692201745,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg3v0d",
   "message": "We are still happily married.",
   "created_utc": 1692201844,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg43og",
   "message": "He's still my best friend. He's married with children now.",
   "created_utc": 1692201929,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg453r",
   "message": "Her name was Annie. A couple of years older than me and my first GF. Relationship didn't last SUPER long, but I don't have much negative to say about her. But no, I haven't spoken to her in YEARS",
   "created_utc": 1692201943,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg4iv2",
   "message": "She cheated on me with her ex, then when I wouldn't take her back she threatened to delete herself. It was harrowing as a teenager, but now that I'm all grown up,  i finally realize...\n\n...she's probably the reason I'm a sucker for girls who  openly wave their red flags around 😅",
   "created_utc": 1692202078,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwg4kdu",
   "message": "It was a stupid hookup. She went on to put a bunch of porn videos on the net of herself and then tried to make them go away when she regretted it. \n\nI’m mostly indifferent but I wanted to do some more stuff with them but they slept around a lot.",
   "created_utc": 1692202093,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwgzyhm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwhkfcg",
   "message": "Of course I know him, he’s me.",
   "created_utc": 1692220497,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwhnkwv",
   "message": "Of I course I remember Mittens. She was a good cat 😞 RIP mittens 2017",
   "created_utc": 1692221642,
   "score": 2,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwho4bj",
   "message": "Yes. We are sat next to each other on the couch. We've been together since we were 16 and we're 27 now.\nWe also have sex with other people sometimes because its fun.",
   "created_utc": 1692221840,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwgc3aw",
   "message": "yes we are still good friends. just unfortunate her parents moved overseas which made it a long distance thing which just didnt work for the both of us. we were already acting like great friends when we broke up so for me (and from how she act i also think her) it was as simple as putting the romantic feelings for eachother behind a lock.",
   "created_utc": 1692204768,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwgnkzp",
   "message": "I remember him. But we lost touch. I‘m pretty indifferent, of\ncourse hope he is happy",
   "created_utc": 1692208826,
   "score": 1,
   "submission_id": "15spdra"
  },
  {
   "comment_id": "jwgfhg2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15spdra"
  }
 ]
}