{
 "submission_id": "15sqfah",
 "title": "What is your best example of Hollywood actually getting something RIGHT, in your field/from history?",
 "selftext": "",
 "created_utc": 1692193681,
 "permalink": "/r/AskReddit/comments/15sqfah/what_is_your_best_example_of_hollywood_actually/",
 "score": 124,
 "url": "https://www.reddit.com/r/AskReddit/comments/15sqfah/what_is_your_best_example_of_hollywood_actually/",
 "comments": [
  {
   "comment_id": "jwgvuz4",
   "message": "I got a masters in epidemiology at a well renowned program and we watched Contagion on at least 2 occasions because they did a pretty good job of portraying infectious disease outbreaks/response - this was pre Covid btw",
   "created_utc": 1692211764,
   "score": 92,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwh5w8e",
   "message": "Superstore. The random shit the customers would do was pretty on par with things I saw when I worked at a big-box store.",
   "created_utc": 1692215353,
   "score": 56,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwgim3j",
   "message": "I used to work in a field of chemistry that intersected with quantum physics. The scientific content of Oppenheimer is actually pretty accurate. Christopher Nolan even hired physics Nobel laureate Kip Thorne to make sure the scientific content was accurately portrayed.",
   "created_utc": 1692207085,
   "score": 113,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwfl7i0",
   "message": "The movie Boiler Room nailed it.  I lived that life.  The atmosphere, the personalities, the pitches, the level of fraud.  Closer than any other movie that portrayed a phone room.",
   "created_utc": 1692194994,
   "score": 201,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwh516i",
   "message": "Late to this thread so this will probably get buried but:\n\nDoctor here. Scrubs is a bit dated, but sense of humor that some of the residents had can be pretty accurate.\n\nOn the flipside, I'd say Grey's anatomy is pretty unrealistic. A sweaty, smelly resident after a 24 hour shift is probably not someone you'd want to have sex with in a broom closet.",
   "created_utc": 1692215045,
   "score": 151,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwfi2tm",
   "message": "Mr Robot getting actual hacking / phishing right. Not just randomly mashing keys with new screens popping up every 2 seconds like every other Hollywood movie does",
   "created_utc": 1692193757,
   "score": 44,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwgauoi",
   "message": "Scrubs is the most accurate depiction of medical residency in it’s time. \nBurdened with theoretical knowledge and a lot of hope but not a clue of what to do with a real patient in front of you. Relying on experienced nursing to get you through the day. Idolizing certain attending physicians and carrying their lessons forever. And just life/culture at the hospital. They nailed it",
   "created_utc": 1692204329,
   "score": 134,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhoege",
   "message": "I'm an engineer with autonomous systems, for 15+ years now. Hollywood tends to indicate that robots turn evil by way of red lights. So, we simply use other colors when we actually need to have an indicator light (blue, green, amber, etc). If you don't install red lights, a robot can't turn evil. It's really that simple, and hasn't failed yet.",
   "created_utc": 1692221943,
   "score": 161,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwh9pap",
   "message": "The movie Cars was an extremely accurate depiction of the ways cars actually talk when I'm not taking my medication",
   "created_utc": 1692216711,
   "score": 33,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwgwc7s",
   "message": "Despite being a comedy, My Cousin Vinny actually showed proper criminal court procedure and displayed accurate ways how attorneys handle cross examining witnesses.",
   "created_utc": 1692211934,
   "score": 30,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwgira3",
   "message": "Oh, they never do. plumbing and fire sprinklers don't work that way.",
   "created_utc": 1692207136,
   "score": 198,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwfwaj4",
   "message": "If you've ever worked in a restaurant, you'll know how accurate Waiting is.",
   "created_utc": 1692199156,
   "score": 201,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwg7atl",
   "message": "Gone Girl. \n\nAfter Nick is released from questioning and returns to his house that was a crime scene there was black powder above and around the door handle. So many movies version of post crime scene is some police tape and stuff haphazardly thrown around but they took the time to show the place was at least processed for latent prints around the possible entry exit and that stuff sticks around. I have never seen a movie do that.",
   "created_utc": 1692203065,
   "score": 218,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwha0j5",
   "message": "Office Space.   Everyone wants to smash a printer.  PC load letter this!",
   "created_utc": 1692216822,
   "score": 59,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwflc70",
   "message": "*Silicon Valley* has some technical nonsense, but its depictions of IT culture are often quite spot-on (if exaggerated for comedic effect).\n\nThe whiteboarding session in the S1 finale is particularly great for being a very faithful depiction of a common practice, albeit with an absurd twist.\n\n*Office Space* is also beloved by people in IT for its realism, although obviously some of the technology, culture and practices are a bit dated.",
   "created_utc": 1692195044,
   "score": 50,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhmxsb",
   "message": "This is kinda more of a joke comment, but I used to work in Hollywood and Tom Cruise's character in Tropic Thunder was slightly exaggerated, but not inaccurate, depiction of some of the higher up personalities I would frequently run into.",
   "created_utc": 1692221407,
   "score": 48,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwh8ls4",
   "message": "Strange Brew is an accurate portrayal of the life of the average Canadian.",
   "created_utc": 1692216315,
   "score": 111,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwfshfg",
   "message": "The Righteous Gemstones are exaggerated but pretty close to church culture.",
   "created_utc": 1692197757,
   "score": 152,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwh233y",
   "message": "It's not really \"Hollywood\" but the chess in Netflix's \"The Queens Gambit\" was *on point*. IIRC they had Bruce Pandolfini - an extremely well renowned chess master and coach - on set as a chess advisor.",
   "created_utc": 1692213983,
   "score": 165,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhj38s",
   "message": "Master and Commander - Most accurate depiction of sea faring during the early 1800s. Amazing movie. Minutes points for replacing the Americans with the French though as they were afraid Americans wouldn't watch a movie where they are the bad guys.",
   "created_utc": 1692220016,
   "score": 139,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwh2cvi",
   "message": "The Menu. we do, in fact, want to murder the scumbag finance bros who eat at our restaurants. in reality, we settle for taking as much of their money from them as possible.",
   "created_utc": 1692214079,
   "score": 136,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwh0wur",
   "message": "As an astronaut and oil driller they got Armageddon right",
   "created_utc": 1692213566,
   "score": 202,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwgigr9",
   "message": "Can't think of one (legal field.)  Depictions of courtroom questions, answers and objections are a joke.  Portrayals of lawyers are mostly caricatures to fit good vs evil stereotypes.",
   "created_utc": 1692207032,
   "score": 32,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwgx3f1",
   "message": "I've quoted Dalton's rules from Road House many times when training a new security person at a bar/nightclub.",
   "created_utc": 1692212202,
   "score": 41,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhtgj9",
   "message": "In the first Madagascar movie, when Marty the zebra is in times square and asks the police horse for directions to grand Central, the horse gives him the exact real life directions to Grand Central from the corner of times square they're standing on.  He even gives the direction in the shorthand only another local would understand.  Only a local would catch it.  Great stuff",
   "created_utc": 1692223854,
   "score": 58,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwgrfes",
   "message": "The Big Short got a lot right.",
   "created_utc": 1692210195,
   "score": 107,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwh5fri",
   "message": "My old man said Casino was on target.",
   "created_utc": 1692215190,
   "score": 26,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhnpie",
   "message": "I thought Jarhead really captured the true insanity and inanity of the U.S. military in the 90s and 00s.\n\nI know technically it was about the first Gulf War and I served in Iraq 2: Electric Boogaloo. But not much changed in that time.",
   "created_utc": 1692221689,
   "score": 144,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhv5ep",
   "message": "Saving Private Ryan's opening scene of D day. I worked in a movie theater and remember veterans stumbling out of the theater in tears balling. Seeing an 80 year old guy ugly crying is something I will never forget. They said the movie captured what it was really like to be there. As I recall they had to setup a counseling hotline right as the movie released to help.",
   "created_utc": 1692224509,
   "score": 84,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhgl0h",
   "message": "I'm an Accountant, and I'd have to say The Accountant did a pretty good job of showing what bad ass killers we are.",
   "created_utc": 1692219130,
   "score": 140,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwgdwzr",
   "message": "While imperfect, *Interstellar* does a good job of using and displaying our current understanding of relativity as it pertains to time and space.\n\nHonorable mention for *The Expanse* as well.",
   "created_utc": 1692205419,
   "score": 146,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhi0pe",
   "message": "The Incredibles nailed the soul sucking job of a claims adjuster.",
   "created_utc": 1692219634,
   "score": 121,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhc4b4",
   "message": "Gladiator's depiction of Roman military camp structures was pretty accurate, according to my faded memories of my archaeologist parents' comments on the film.",
   "created_utc": 1692217561,
   "score": 41,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwha6x5",
   "message": "\"Highlander was a documentary and the events happened in real time.\"",
   "created_utc": 1692216885,
   "score": 15,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhbhhw",
   "message": "The linguistics in Stargate was pretty good. The military guys of course expected Daniel to whip out some magic chant, but he's there impersonating a chicken like anyone else.\n\nAnd when he does start communicating using his knowledge of Ancient Egyptian, they do a decent job showing that the prounciation of words had changed as the language on the new planet evolved over the years.  5k years of evolution of a language wouldn't have retained as much as they protrayed in the movie, but they got the concept down great.",
   "created_utc": 1692217338,
   "score": 43,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhhkwi",
   "message": "From my past life as a lawyer: when I was in law school they had us watch the scene in My Cousin Vinny where Marisa Tomei testifies as a lay expert witness. It’s a surprisingly accurate depiction of how to qualify and seat a lay expert.",
   "created_utc": 1692219481,
   "score": 31,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhr7ah",
   "message": "Hockey scenes from Letterkenney. They've captured it so closely that it makes my hands smell just watching.",
   "created_utc": 1692222985,
   "score": 38,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhqznk",
   "message": "Blackberry was a surprisingly detailed examination of startup culture and product development, and the incumbent dilemma.",
   "created_utc": 1692222906,
   "score": 14,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwh5xqi",
   "message": "The office accurately portrays the employees that do their jobs and employees that seem to do their jobs. And the \"work parties\" never go right.\n\nAlso that middle management is really useless.",
   "created_utc": 1692215367,
   "score": 29,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwgt30v",
   "message": "Im in IT and have some work in security. This is an industry secret but movies get it like 99% right. We're just sending viruses left and right, committing hack backs, rerouting middle men ro honey pot firewalls. \n\nOur hands are flying across keyboards, when one is overwhelmed a coworker will join in and we got 4 hands on one keyboard",
   "created_utc": 1692210784,
   "score": 32,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhizig",
   "message": "Benny and June probably has the best rep of neurodivercity ive seen",
   "created_utc": 1692219980,
   "score": 19,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhshdf",
   "message": "Now that I think about it, the whole scene at the end of Trading Places with the orange juice futures was an accurate if exaggerated depiction of futures trading. That is, what happened in the movie is a bit hyperbolic, but the underlying mechanisms were pretty accurate.",
   "created_utc": 1692223476,
   "score": 15,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhxrpq",
   "message": "Idicoracy is a pretty accurate documentary of where our society is heading 🤪.",
   "created_utc": 1692225548,
   "score": 4,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhhzku",
   "message": "Sadly, I thought “Inside Llewellyn Davis” gave an accurate portrayal of trying to make it in the music business.",
   "created_utc": 1692219622,
   "score": 6,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhoixb",
   "message": "Trinity using NMap in The Matrix Reloaded\n\n[Trinity uses Nmap](https://youtu.be/0PxTAn4g20U)",
   "created_utc": 1692221988,
   "score": 6,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhq7gd",
   "message": "The X-Files episode, \"José Chung's *From Outer Space*\", is an accurate depiction of modern UFOlogy, in that there really are multiple theories of what the aliens really are, each with more or less equally compelling evidence.",
   "created_utc": 1692222612,
   "score": 6,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwh5926",
   "message": "A lot of Broadcast News was pretty on target.",
   "created_utc": 1692215125,
   "score": 5,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhk9my",
   "message": "I’ve read saving private Ryan was a pretty good account of the events.",
   "created_utc": 1692220439,
   "score": 3,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhspyi",
   "message": "Not Hollywood, but having worked in the NHS for 14 years, some of the characters in the UK comedy Green wing are surprisingly close to actual people I've worked with.",
   "created_utc": 1692223568,
   "score": 7,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhyln4",
   "message": "The Big Short, while slightly dramatized, was accurate to the point where it was required watching in my audit/fraud class.",
   "created_utc": 1692225885,
   "score": 9,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwi3miz",
   "message": "The Hunt for Red October is almost a unanimously praised movie in the field of SONAR/submarine warfare. There’s some Hollywood stuff in it but for a movie to touch on a such a unique and niche part of the Navy, and military as a whole, makes a lot of us SONAR techs giddy.",
   "created_utc": 1692227944,
   "score": 22,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwi59xt",
   "message": "The version of amnesia shown in Memento (where the main character remembers his life before a traumatic event but doesn't have any ability to form new memories) is way, way more common than the version which you see a lot in pop culture (where they forget everything before the event but are pretty much fine otherwise). It was really accurately portrayed as well for the most part including a lot of little things, like how the character can still learn skills/be conditioned with some knowledge over time, but slowly and mostly implicitly.",
   "created_utc": 1692228632,
   "score": 23,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwi5o47",
   "message": "Born in the USSR and lived in Eastern Europe in the years after it's fall. HBO's Chernobyl is shockingly on point, especially about one thing - the mentality. Almost everything in that movie is spot on, even the slightly changed things are portrait quite accurately.\n\nThat cold mentality is the death of the human mind.",
   "created_utc": 1692228795,
   "score": 41,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhrohh",
   "message": "I’m a billionaire crime fighter and I’d say Dark Night was mostly accurate.",
   "created_utc": 1692223166,
   "score": 14,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhvsmz",
   "message": "Worked in a casino for 25 years and Casino was the only movie I have seen that got it right.",
   "created_utc": 1692224762,
   "score": 12,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhvtdn",
   "message": "Maybe a bit late... but the movie Arbitrage with Richard Gere captured the stress and anxiety of trying to close a major deal that is critical to your survival, while needing to maintain the appearance of success and stability.  \n \nHis wife keeps reminding him to get a cheque to their main charity \"Can you take care of it tomorrow?  It's only $2 million\" meanwhile he is $300 million in the hole and is basically broke until his deal closes..  \n  \nAnd the people around him keep telling him \"It's done, we're good, they are signing today\" except they keep fucking around and stalling as his anxiety and desperation grows.  \n \nAnother really good one is Margin Call.  I'm adjacent to finance, but I've met each and every one of the corporate characters at various levels of the organization and they nailed them.  The junior associate over-achiever, the junior associate bro, the \"young\" middle aged senior manager who is burned out, the \"youngish\" senior manager who is a killer and loves the game, the old senior partner who is all used up and cynical and regretful, the CEO who is charming and charismatic but you get the sense he is a dangerous psychopath underneath...",
   "created_utc": 1692224770,
   "score": 12,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhxhvk",
   "message": "The phreaking scene in Hackers was actually a real thing back in the day. Get the right tone, and you could bypass the pay phone charges.\n\nThe hacking the student information system to change classes is also quasi-legit. In that era, all the students systems were thick clients - requiring the right (not easily accessible) software, and funky settings. Most are web based now, so would be a lot easier to hack. And I can believe the water sprinkler scene, except few, if any, schools would have that on a network in the 90s. That was $$$$$$$$$ and nobody replaces your system unless it breaks.",
   "created_utc": 1692225441,
   "score": 2,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwi4ekb",
   "message": "It's minor but the Man of Steel movie mostly got military uniforms correct enough that I didn't notice any glaring issues during the time they showed on screen. \n\nFor such a relatively easy thing to get right (each branch literally publishes regulations on how to wear their uniform which are available on the open Internet), action movies/TV get it wrong *all the time*.",
   "created_utc": 1692228268,
   "score": 20,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwi92be",
   "message": "The mansplaining of photoshop in barbie",
   "created_utc": 1692230231,
   "score": 1,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwh648m",
   "message": "Not Hollywood, but Aussie comedy show Utopia is so accurate it can actually be painful to watch.",
   "created_utc": 1692215431,
   "score": 6,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwi3lkz",
   "message": "You might not realize it, but Lower Decks is a realistic portrayal of life in Starfleet at the lowest rung. It’s not all the glitz and glam captaining ships and having sex with aliens. Sometimes is just maintenance on a Runabout and having sex with aliens.",
   "created_utc": 1692227933,
   "score": 2,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhzqnt",
   "message": "Deepwater Horizon. I currently do Mikes job (Mark Walhberg) as an industrial maintenance guy. He hit the demeanor perfectly of how we act, especially the meeting scene where he just starts listing shit off.",
   "created_utc": 1692226343,
   "score": 7,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhwvpx",
   "message": "Schindler's List",
   "created_utc": 1692225195,
   "score": 1,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwi46vs",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwfwydy",
   "message": "[removed]",
   "created_utc": 1692199393,
   "score": 229,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhrbks",
   "message": "Strangely enough, the new Midway movie is amazingly accurate and mostly up-to-date with recent historical research. Considering Roland Emmerich... spotty... record with historical accuracy, that took a number of people by surprise. \n\nIt got dissed on pretty hard at the time, because no one wanted to say anything positive about n American history piece at a time when Donald Trump was in the white house, but people are starting to notice it now.",
   "created_utc": 1692223030,
   "score": 0,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhk22z",
   "message": "Not really based on full facts as I personally haven't seen anyone travel through time obviously. \nBut fuck me, interstellar is probably one of the greatest movies I think for how well they portrayed it, normally any Sci fi style film is butchered in one way or another but that film was majestic",
   "created_utc": 1692220364,
   "score": 255,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwgt65k",
   "message": "The Fighting Seabees, John Wayne",
   "created_utc": 1692210815,
   "score": 255,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhthof",
   "message": "My mother worked child services in the area gone by gone was set.  Many of her clients were extra. Almost all commented on how accurate it was",
   "created_utc": 1692223867,
   "score": 5,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwi2cg2",
   "message": "Maybe a small detail, but The Bear was the first show that depicted text conversations in a realistic way that didn’t seem utterly robotic and ridiculous. I’m not a chef but I’m assuming they did the cooking thing good too, lol. What a great show. First show that hooked me like that in a while.",
   "created_utc": 1692227412,
   "score": 12,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhzr2x",
   "message": "\"Sully\" did a pretty good job about showing how a flight crew (in this case US Airways 1549) handles an emergency in terms of aircraft control, running emergency procedures, and in that particular case - coming up with a creative solution.  Running through a QRC/QRH, transferring aircraft control, and most importantly keeping the compartmentalized attitudes of solving an in-flight emergency while keeping cool was all well done.\n\nWhat they didn't get accurate in the movie - albeit necessary for an engaging film - was the \"us vs. them\" attitude they presented towards the NTSB.  At the time, I don't think anybody was ever out to get Sully and Skiles.  It was pretty apparent that the flight and in-flight crews of Cactus 1549 did a phenomenal job of getting their aircraft down safely and saving all on board.  Likewise, the real-time \"run it again this way...\" analysis with the sim pilots at the end is pure Hollywood.",
   "created_utc": 1692226348,
   "score": 12,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwi26u5",
   "message": "I’m a teacher. The closest I’ve seen is Abbott Elementary. The most accurate thing on there is the amount of time we get for breaks. Everything else is pretty realistic. A lot of teachers can’t watch it for that reason.",
   "created_utc": 1692227347,
   "score": 14,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwi3fqi",
   "message": "I work in Hollywood. Hollywood gets a lot of stuff right about Hollywood all the time lol",
   "created_utc": 1692227865,
   "score": 7,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhxje6",
   "message": "The Accountant.  It's exactly like my current accounting job.",
   "created_utc": 1692225458,
   "score": 5,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhzg0i",
   "message": "Obligatory \"not my field\" but I have heard from multiple sources that law enforcement up to and including the FBI study the shootout scene in *Heat* for a demonstration on shooting from cover and reloading under pressure.",
   "created_utc": 1692226225,
   "score": 6,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwi1iie",
   "message": "The Wolf of Wall Street 100%",
   "created_utc": 1692227069,
   "score": 4,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwif7ll",
   "message": "TV- Mad Men. When they’re trying to start a new agency and none of the Execs and Account guys know where anything is so they have to call the old Secretary / Office Manager Joan to actually find the files they want to steal. As an admin person I appreciated that.",
   "created_utc": 1692232816,
   "score": 8,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwio0vo",
   "message": "Worked in law enforcement- the wire is the most accurate show I’ve seen in that genre",
   "created_utc": 1692236508,
   "score": 7,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwhnlqq",
   "message": "Dwayne Johnson actually did CPR pretty accurately in San Andreas. So did Ian in Shameless.",
   "created_utc": 1692221651,
   "score": 3,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwi2q96",
   "message": "My in-law was a Control room operator at a nuclear reactor. I guess Chernobyl was very bang-on for a lot of details. Was probably interesting to watch from his perspective as the Chernobyl disaster radically changed the course of safety protocols for that field.",
   "created_utc": 1692227569,
   "score": 3,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwi5dsh",
   "message": "Saving Private Ryan. My uncle served in Korea and Vietnam and he said the combat sequences were as accurate as any war movie he ever saw",
   "created_utc": 1692228677,
   "score": 3,
   "submission_id": "15sqfah"
  },
  {
   "comment_id": "jwia6b0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15sqfah"
  }
 ]
}