{
 "submission_id": "15su71p",
 "title": "What's the best real life example, you've witnessed, of someone destroying their own happiness?",
 "selftext": "",
 "created_utc": 1692202363,
 "permalink": "/r/AskReddit/comments/15su71p/whats_the_best_real_life_example_youve_witnessed/",
 "score": 70,
 "url": "https://www.reddit.com/r/AskReddit/comments/15su71p/whats_the_best_real_life_example_youve_witnessed/",
 "comments": [
  {
   "comment_id": "jwg5stx",
   "message": "My dad threw out a 15 year marriage with a woman he adored because he got drunk and fucked a random coworker.\n\nHe’s utterly miserable now.",
   "created_utc": 1692202533,
   "score": 135,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg5i1m",
   "message": "I have an insecure cousin who would regularly reject guys who were into her and chase guys who weren't interested.\n\nThe more distant and emotionally unavailable the guy was the harder she'd try to win him over.\n\nThe best real life example of \"I don't want to be a part of any club that would have me as a member\" I've ever seen.",
   "created_utc": 1692202427,
   "score": 69,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg8fgc",
   "message": "My sister was offered an incredible well paying job doing something she's great at.\n\nShe decided it would be too easy and opted for a far more challenging job, in a far less appealing setting, with an asshole of a boss she was hoping to impress.\n\nShe's fucking miserable now.\n\nI honestly don't get why she does this sort of shite to herself.",
   "created_utc": 1692203466,
   "score": 59,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg9b2k",
   "message": "My best friend gave up a boyfriend who adored her to \"help out\" her lying, cheating, alcoholic ex.\n\nHe said he needed her/was on the verge of suicide/had no one else.\n\nShe felt like she had to help her. Her current bf was not ok with it so she let him end it.\n\nShe's not officially back with the asshole yet but it's just a matter of time.\n\nHere's the best part, you may be thinking she secretly liked the cheating ex more...she did NOT. The cheater was also shit in bed. The new guy was \"incredible.\" \n\nShe and the cheater were just childhood friends and she couldn't bring herself to \"abandon\" him.",
   "created_utc": 1692203780,
   "score": 42,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgezl1",
   "message": "My father-in-law keeps on giving money to his drug addict son, to the cost of his credit, his reputation, his own retirement, the retirement of his wife, his marriage, his home, his car and his relationships with his family, friends and other son.\n\nEvery first- and fifteenth-of-the-month, when his pension hits, the kid pops up with a \"ya wanna believe this shit?\" story, and my father-in-law gives him whatever he asks for.  Addiction is a horrorshow, don't get me wrong, but enabling? \n\nPut it to you this way: if a hurricane is heading towards your house, and right before it hits, someone comes into your house, lets all the pets out, opens all the windows and doors and unties anything you had tied down, because he's worried all those precautions *might hurt the hurricane's feelings,* who do you blame for the destruction?",
   "created_utc": 1692205804,
   "score": 24,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgkpj7",
   "message": "Friend who got married because he he didn’t want to break it off and thought he would just be better off, he’s dying a slow death.",
   "created_utc": 1692207823,
   "score": 19,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg7ukz",
   "message": "Me. And my drinking habits. My life looks fucking great on paper, but I was still drowning myself in alcohol. About 7 months sober right now.",
   "created_utc": 1692203258,
   "score": 49,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgnixd",
   "message": "Two separate women. Married to really great men. Though every marriage is a two way street. Women cheated on the men multiple times.  Ended up leaving to be with the affair partners. Which didn't work out in both cases. Both women were miserable. Both men ended up happily remarried. To this day, both women say they regret everything and know they would have been much happier with their original spouse.",
   "created_utc": 1692208806,
   "score": 15,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgdxfu",
   "message": "I know a guy who gambled away $8 million his grandfather left him. He inherited at 21. It was gone by 23.\n\nHe's actually an incredible good guy too. That's what kills me.",
   "created_utc": 1692205423,
   "score": 29,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwghsrs",
   "message": "when the alcohol took control\n\n10 years as a non-functioning drunk.\n\n6 years sober",
   "created_utc": 1692206798,
   "score": 13,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgpo3u",
   "message": " My best friend was married to a guy who worked on the oil rigs and constantly suspected her to cheating though she didn’t give him any reason to believe that. Threw away a marriage with 2 kids on the basis of nothing.",
   "created_utc": 1692209574,
   "score": 12,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgehpt",
   "message": "My best friend was having an affair, and I was the only person (apart from the two of them) that knew what was going on. My friend knew that I was friends with his wife before they met and we were close but he just unloaded everything on me and said don't tell Kelly but the other one is pregnant. I said bro you've got 3 kids and a wife what are you doing. He said it was \"fun\". I'm a bit ashamed to say that I abandoned him and last I saw him he was in a group of street drinkers and he chased me up the street trying to talk to me. I'm still close with Kelly, she moved on and is with a great lad now.",
   "created_utc": 1692205624,
   "score": 18,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg5hk5",
   "message": "Girls crawling back to their ex boyfriends after they cheated on them multiple times",
   "created_utc": 1692202422,
   "score": 12,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg5mly",
   "message": "Kid I was close friends with when I was 14-15.  He had a great personality and sense of humor, and girls loved him.  He overdosed on heroin in his 20s after having 2 kids",
   "created_utc": 1692202472,
   "score": 11,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwggddv",
   "message": "My relationship with alcohol. Some days I catch a buzz, but most days, hell. \n\nI tried drinking my way out of hell, but it just got hellier. So now I just stare at it in my cabinet. But my happiness is greater.",
   "created_utc": 1692206296,
   "score": 5,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgtm12",
   "message": "Oh man, my ex-girlfriend from highschool. Valedictorian of our class, super smart came from an awesome family. I'm still friends with her sister and mom. Totally just dropped out of college moved to Baltimore and smoked crack for 15 years. Has a bunch of kids, its totally unintelligible to talk to its bananas.",
   "created_utc": 1692210969,
   "score": 5,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh17sd",
   "message": "A good friend I worked with for years was married to a great dude, super nice and everyone loved him, just a great guy all around. They had a couple middle school aged kids too. I think she was going through a mid-life crisis type thing but anywho, she reconnected with her old high school boyfriend on fb and they started having an affair. She ended up telling her husband about it and left him for the other guy, her husband was great about it, wanted her to be happy, great at co-parenting and didn't want to make anything harder on the kids, etc. \n\nThe old HS boyfriend was toxic as hell, I met him a few times and he was an absolute dick. They fought constantly, every other week they were breaking up, kicking each other out(of *her* condo) or he'd just go missing for days at a time and she'd be a wreck wondering where he was; which was usually a couple hours away at the beach on a drug bender with his friends(he's in his late 40s btw). \n\nShe said she got bored with her life with her husband and wasn't attracted to him anymore, but I think she just went off the deep end and wanted something that wasn't there anymore; that feeling and excitement of young puppy love, but that's not what she got. \n\nI think some people just need drama in their life, I felt like she threw away a happy life just because she missed the drama.",
   "created_utc": 1692213673,
   "score": 6,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg9t19",
   "message": "I met a guy who went to an ivy league law school, putting himself hundreds of thousands of dollars in debt. He passed the bar exam with an almost perfect score, but was rejected from the bar due to his drug history. He had been involuntarily committed to a psychiatric hospital after getting really high and becoming psychotic. No state is likely to ever accept him as a lawyer now. He's basically stuck making 40k a year as a legal assistant for the rest of his life, all because he did a bunch of drugs in college.",
   "created_utc": 1692203956,
   "score": 20,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgrlnn",
   "message": "While I was waiting for the bus; some couple was arguing. The woman wanted to leave and have a baby with a rich guy because she loved nice things. The man was like but I love you and will take care of you. I felt sorry for the man. That woman was insane.",
   "created_utc": 1692210257,
   "score": 10,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgdhp2",
   "message": "Me spending all my money and quitting/getting fired from every job and ruining every relationship I have",
   "created_utc": 1692205268,
   "score": 5,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgjs0a",
   "message": "Asking questions they cannot handle honest answers to.\n\n\"Am I annoying?\"\n\n\"Do you guys really like me?\"\n\nStuff like that. Usually politeness wins out, but when people answer these questions honestly, I don't get the impression the situation's improved at all.",
   "created_utc": 1692207493,
   "score": 4,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgnbqb",
   "message": "Me. I turned down an interview for a great job as a trainee because I thought I had something better. I ended up in a company where I quit a month after based on bullying from coworkers and a horrible chef. I should have taken it... (No, I couldn't go back to the other one.)",
   "created_utc": 1692208736,
   "score": 5,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgver6",
   "message": "My cousin was a drugaddict since she was like 13 and OD´d just after she had been clean. Very sad. She was a good person. Just had a shit life because she chose drugs because she mingled in those groups to escape from her strict mom. Also a lesson for strict parents. You don´t keep your children from sex, drugs and alcohol by being strict. You send them right into it. It is better to inform them. My parents were very easy going and informative and non of us ever got into drugs, 2 of the 3 sibblings of my cousin used harddrugs. \n\nMy mother was always having high expectations of people without expressing what she wanted of them so  she was always disappointed because it wouldn´t happen. She spend her whole life being sour and jealous of people who got what she wanted.",
   "created_utc": 1692211603,
   "score": 3,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgvly1",
   "message": "Me drinking!",
   "created_utc": 1692211674,
   "score": 3,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgb1p6",
   "message": "Hi. I’m here. It’s me.",
   "created_utc": 1692204399,
   "score": 3,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgv975",
   "message": "Is Elon's Twitter feed considered cheating?",
   "created_utc": 1692211548,
   "score": 3,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh0cny",
   "message": "My friend, Melissa, choosing to go back to her abusive husband over and over again",
   "created_utc": 1692213367,
   "score": 3,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgq5ep",
   "message": "When my friend Carl married that control freak Christine.",
   "created_utc": 1692209744,
   "score": 2,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh0wv3",
   "message": "My friend has a lot of free time on his hands and spends most of it on watching right wing conspiracy propaganda. He's angry all the time.",
   "created_utc": 1692213566,
   "score": 2,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh255f",
   "message": "Drugs, always fucking drugs",
   "created_utc": 1692214003,
   "score": 3,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh6u1z",
   "message": "My ex is on wife #5. He was and still is in love with wife #3. He cheated on her with wife #4. He blew up a great relationship (well all 4 divorced are cause he cheats) simply for a piece of ass!",
   "created_utc": 1692215683,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh80cj",
   "message": "My first real girlfriend, and our relationship.\n\n\nShe went back to her ex who has:\nTons of debt, is chronically unemployed\n\n an insane ex himself with kids (all of whom hate her), \n\n shared with her the gift of herpes and another STI (at least the other one is curable)\n\n Been put in jail for abusing her, twice\n\n\n\nIn that time, she has:\ndeveloped an alcohol issue\n\nBecause of company he keeps, she was beaten near to death by one of his friends\n\nLost most of her friends, who she offended by doing all the least advisable things then taking no accountability. (I still occasionally chat with her old friends… more than she does)\n\n\nEven still, I wish she’d get her shit together and do better. I did love the person she used to be, I’d never want anyone I loved to suffer like this.\nBut holy crap, she made the bed and is certainly being made to lay in it…\nWorst of all was like, 2 years after she asked if I would ever take her back because she hated her life.\nI could have been more mature but she got “that’s a hard fuck no for me” from me. That probably didn’t help.",
   "created_utc": 1692216100,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh8wq3",
   "message": "My parents getting married I'd say. According to them themselves they were so happy together when they were just dating. They married about 3 years after I was born I think, and now the house is a wreck. Nobody's happy here anymore hence why I'm leaving as soon as possible\n\nHell they didn't even want to get married. They only did it so airport security would stop asking why I didn't share a last name with my mother",
   "created_utc": 1692216424,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgk75r",
   "message": "A few family members are down the Q path. They are angry literally 24/7 and blame everything wrong in their personal lives on the dumbest shit possible. They talk about nothing except how democrats are killing babies for adrenochrome and the country is being \"stolen.\"",
   "created_utc": 1692207642,
   "score": 4,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgoluo",
   "message": "Alcohol and drug addiction led to every example I can think of that's mention worthy.",
   "created_utc": 1692209195,
   "score": 4,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgdd8f",
   "message": "Prince Harry\n\nY’all know why.",
   "created_utc": 1692205224,
   "score": 2,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgbuo6",
   "message": "Addiction.",
   "created_utc": 1692204685,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgdv9z",
   "message": "When my friend had an affair",
   "created_utc": 1692205402,
   "score": 0,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgxmss",
   "message": "buying Rainbow Six Siege",
   "created_utc": 1692212391,
   "score": 0,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg9ehc",
   "message": "me being born",
   "created_utc": 1692203813,
   "score": 251,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgj3ir",
   "message": "Shut up.",
   "created_utc": 1692207255,
   "score": 248,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh4kqy",
   "message": "Myself when I relapsed",
   "created_utc": 1692214881,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh6w7j",
   "message": " I've seen is someone always looking at what others have on social media. This made them feel not so happy about their own life.",
   "created_utc": 1692215704,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh761b",
   "message": "I had a friend in college who had a tendency to act before thinking, but was generally fun and well-meaning. After I had graduated, my friend apparently got coerced by a woman he was trying to sleep with to try heroin just once. As I heard it, he refused initially, then caved because he felt pressured. My friend overdosed and died. Just like that, one bad decision ended his life. RIP Mike.",
   "created_utc": 1692215800,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh9kl6",
   "message": "Female cousin. 55 years old. Hard-core Trumper and Anti-Vaxxer. Caught COVID. The bug triggered Guillan-Barre Syndrome. She died three weeks after her first grand baby was born.",
   "created_utc": 1692216663,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhbah8",
   "message": "I have a family member who inherited around $500k in cash and assets when his mother died. He had a decent job at the time. This inheritance meant that he started taking longer vacations and stopped consistently working. He bought a sports car and paid off the two pre-built condos that his mother had put down payments on but sold one immediately at a loss and then rented the other out for a while until his original tenants moved out then let it sit vacant for over a year and selling it at a loss. He “loaned” money to his half sister to pay for tuition at a job that would never allow her to repay him. He bought every new and interesting piece of electronics. \n\nThe electronics eventually caught up with him.  He went on holiday to the USA and on his way back across the border the guards wanted to search his laptop which led to the discovery of child porn. He was also trying to groom his niece (daughter of the half sister).  \n\nThere wasn’t much money left from the estate at that point. He was arrested and only managed to stay out of jail on a technicality that a very expensive lawyer found. He paid mid $50k for his defense. The two or three years that the criminal defense was going on he didn’t work at all. Just dipped out on his employer who would have continued employing him. He sold the sports car at a loss. Sold his last remaining property, the condo, at a loss. Sold a bunch of his expensive toys at a loss. Ended up penniless (actually probably bankrupt) but not in jail. Now his life consists of living in a small rented bedroom and working as a local trucker. \n\nHe didn’t just destroy his life, he nuked it from orbit and then salted the ground. He’s currently in his late forties and will probably never be able to retire. Most of the family won’t speak to him at all.",
   "created_utc": 1692217270,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhbehi",
   "message": "Probably when I broke up with my last girlfriend because everything is getting too stressful and busy for me, too many demands on my time.\n\nMost amazing woman I know, bloody gorgeous and sweet.",
   "created_utc": 1692217309,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhc4ja",
   "message": "The mirror, every day",
   "created_utc": 1692217563,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhcpzl",
   "message": "My wife's ex husband was left millions by his parents.  He got addicted to poker and over 10 years or so lost it all, and eventually lost the wife (and she married me). When she found out he was taking loans out againt the house they lived in. He's spent the last 5 years or so living in a dorm situation and struggling financially because he can't hold a job.",
   "created_utc": 1692217775,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhd17y",
   "message": "Known multiple men who married successful women and begged to become stay-at-home dads, then ended up cheating.",
   "created_utc": 1692217885,
   "score": 1,
   "submission_id": "15su71p"
  }
 ]
}