{
 "submission_id": "15su71p",
 "title": "What's the best real life example, you've witnessed, of someone destroying their own happiness?",
 "selftext": "",
 "created_utc": 1692202363,
 "permalink": "/r/AskReddit/comments/15su71p/whats_the_best_real_life_example_youve_witnessed/",
 "score": 186,
 "url": "https://www.reddit.com/r/AskReddit/comments/15su71p/whats_the_best_real_life_example_youve_witnessed/",
 "comments": [
  {
   "comment_id": "jwg5stx",
   "message": "My dad threw out a 15 year marriage with a woman he adored because he got drunk and fucked a random coworker.\n\nHe’s utterly miserable now.",
   "created_utc": 1692202533,
   "score": 108,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg5i1m",
   "message": "I have an insecure cousin who would regularly reject guys who were into her and chase guys who weren't interested.\n\nThe more distant and emotionally unavailable the guy was the harder she'd try to win him over.\n\nThe best real life example of \"I don't want to be a part of any club that would have me as a member\" I've ever seen.",
   "created_utc": 1692202427,
   "score": 197,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg8fgc",
   "message": "My sister was offered an incredible well paying job doing something she's great at.\n\nShe decided it would be too easy and opted for a far more challenging job, in a far less appealing setting, with an asshole of a boss she was hoping to impress.\n\nShe's fucking miserable now.\n\nI honestly don't get why she does this sort of shite to herself.",
   "created_utc": 1692203466,
   "score": 171,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg9b2k",
   "message": "My best friend gave up a boyfriend who adored her to \"help out\" her lying, cheating, alcoholic ex.\n\nHe said he needed her/was on the verge of suicide/had no one else.\n\nShe felt like she had to help her. Her current bf was not ok with it so she let him end it.\n\nShe's not officially back with the asshole yet but it's just a matter of time.\n\nHere's the best part, you may be thinking she secretly liked the cheating ex more...she did NOT. The cheater was also shit in bed. The new guy was \"incredible.\" \n\nShe and the cheater were just childhood friends and she couldn't bring herself to \"abandon\" him.",
   "created_utc": 1692203780,
   "score": 112,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgezl1",
   "message": "My father-in-law keeps on giving money to his drug addict son, to the cost of his credit, his reputation, his own retirement, the retirement of his wife, his marriage, his home, his car and his relationships with his family, friends and other son.\n\nEvery first- and fifteenth-of-the-month, when his pension hits, the kid pops up with a \"ya wanna believe this shit?\" story, and my father-in-law gives him whatever he asks for.  Addiction is a horrorshow, don't get me wrong, but enabling? \n\nPut it to you this way: if a hurricane is heading towards your house, and right before it hits, someone comes into your house, lets all the pets out, opens all the windows and doors and unties anything you had tied down, because he's worried all those precautions *might hurt the hurricane's feelings,* who do you blame for the destruction?",
   "created_utc": 1692205804,
   "score": 85,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgkpj7",
   "message": "Friend who got married because he he didn’t want to break it off and thought he would just be better off, he’s dying a slow death.",
   "created_utc": 1692207823,
   "score": 81,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg7ukz",
   "message": "Me. And my drinking habits. My life looks fucking great on paper, but I was still drowning myself in alcohol. About 7 months sober right now.",
   "created_utc": 1692203258,
   "score": 105,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgnixd",
   "message": "Two separate women. Married to really great men. Though every marriage is a two way street. Women cheated on the men multiple times.  Ended up leaving to be with the affair partners. Which didn't work out in both cases. Both women were miserable. Both men ended up happily remarried. To this day, both women say they regret everything and know they would have been much happier with their original spouse.",
   "created_utc": 1692208806,
   "score": 71,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgdxfu",
   "message": "I know a guy who gambled away $8 million his grandfather left him. He inherited at 21. It was gone by 23.\n\nHe's actually an incredible good guy too. That's what kills me.",
   "created_utc": 1692205423,
   "score": 155,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwghsrs",
   "message": "when the alcohol took control\n\n10 years as a non-functioning drunk.\n\n6 years sober",
   "created_utc": 1692206798,
   "score": 50,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgpo3u",
   "message": " My best friend was married to a guy who worked on the oil rigs and constantly suspected her to cheating though she didn’t give him any reason to believe that. Threw away a marriage with 2 kids on the basis of nothing.",
   "created_utc": 1692209574,
   "score": 63,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgehpt",
   "message": "My best friend was having an affair, and I was the only person (apart from the two of them) that knew what was going on. My friend knew that I was friends with his wife before they met and we were close but he just unloaded everything on me and said don't tell Kelly but the other one is pregnant. I said bro you've got 3 kids and a wife what are you doing. He said it was \"fun\". I'm a bit ashamed to say that I abandoned him and last I saw him he was in a group of street drinkers and he chased me up the street trying to talk to me. I'm still close with Kelly, she moved on and is with a great lad now.",
   "created_utc": 1692205624,
   "score": 48,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg5hk5",
   "message": "Girls crawling back to their ex boyfriends after they cheated on them multiple times",
   "created_utc": 1692202422,
   "score": 30,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg5mly",
   "message": "Kid I was close friends with when I was 14-15.  He had a great personality and sense of humor, and girls loved him.  He overdosed on heroin in his 20s after having 2 kids",
   "created_utc": 1692202472,
   "score": 34,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwggddv",
   "message": "My relationship with alcohol. Some days I catch a buzz, but most days, hell. \n\nI tried drinking my way out of hell, but it just got hellier. So now I just stare at it in my cabinet. But my happiness is greater.",
   "created_utc": 1692206296,
   "score": 20,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgtm12",
   "message": "Oh man, my ex-girlfriend from highschool. Valedictorian of our class, super smart came from an awesome family. I'm still friends with her sister and mom. Totally just dropped out of college moved to Baltimore and smoked crack for 15 years. Has a bunch of kids, is totally unintelligible to talk to... its bananas.",
   "created_utc": 1692210969,
   "score": 51,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh17sd",
   "message": "A good friend I worked with for years was married to a great dude, super nice and everyone loved him, just a great guy all around. They had a couple middle school aged kids too. I think she was going through a mid-life crisis type thing but anywho, she reconnected with her old high school boyfriend on fb and they started having an affair. She ended up telling her husband about it and left him for the other guy, her husband was great about it, wanted her to be happy, great at co-parenting and didn't want to make anything harder on the kids, etc. \n\nThe old HS boyfriend was toxic as hell, I met him a few times and he was an absolute dick. They fought constantly, every other week they were breaking up, kicking each other out(of *her* condo) or he'd just go missing for days at a time and she'd be a wreck wondering where he was; which was usually a couple hours away at the beach on a drug bender with his friends(he's in his late 40s btw). \n\nShe said she got bored with her life with her husband and wasn't attracted to him anymore, but I think she just went off the deep end and wanted something that wasn't there anymore; that feeling and excitement of young puppy love, but that's not what she got. \n\nI think some people just need drama in their life, I felt like she threw away a happy life just because she missed the drama.",
   "created_utc": 1692213673,
   "score": 35,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg9t19",
   "message": "I met a guy who went to an ivy league law school, putting himself hundreds of thousands of dollars in debt. He passed the bar exam with an almost perfect score, but was rejected from the bar due to his drug history. He had been involuntarily committed to a psychiatric hospital after getting really high and becoming psychotic. No state is likely to ever accept him as a lawyer now. He's basically stuck making 40k a year as a legal assistant for the rest of his life, all because he did a bunch of drugs in college.",
   "created_utc": 1692203956,
   "score": 53,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgrlnn",
   "message": "While I was waiting for the bus; some couple was arguing. The woman wanted to leave and have a baby with a rich guy because she loved nice things. The man was like but I love you and will take care of you. I felt sorry for the man. That woman was insane.",
   "created_utc": 1692210257,
   "score": 28,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgdhp2",
   "message": "Me spending all my money and quitting/getting fired from every job and ruining every relationship I have",
   "created_utc": 1692205268,
   "score": 6,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgjs0a",
   "message": "Asking questions they cannot handle honest answers to.\n\n\"Am I annoying?\"\n\n\"Do you guys really like me?\"\n\nStuff like that. Usually politeness wins out, but when people answer these questions honestly, I don't get the impression the situation's improved at all.",
   "created_utc": 1692207493,
   "score": 9,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgnbqb",
   "message": "Me. I turned down an interview for a great job as a trainee because I thought I had something better. I ended up in a company where I quit a month after based on bullying from coworkers and a horrible chef. I should have taken it... (No, I couldn't go back to the other one.)",
   "created_utc": 1692208736,
   "score": 12,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgver6",
   "message": "My cousin was a drugaddict since she was like 13 and OD´d just after she had been clean. Very sad. She was a good person. Just had a shit life because she chose drugs because she mingled in those groups to escape from her strict mom. Also a lesson for strict parents. You don´t keep your children from sex, drugs and alcohol by being strict. You send them right into it. It is better to inform them. My parents were very easy going and informative and non of us ever got into drugs, 2 of the 3 sibblings of my cousin used harddrugs. \n\nMy mother was always having high expectations of people without expressing what she wanted of them so  she was always disappointed because it wouldn´t happen. She spend her whole life being sour and jealous of people who got what she wanted.",
   "created_utc": 1692211603,
   "score": 16,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgvly1",
   "message": "Me drinking!",
   "created_utc": 1692211674,
   "score": 3,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgb1p6",
   "message": "Hi. I’m here. It’s me.",
   "created_utc": 1692204399,
   "score": 3,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgv975",
   "message": "Is Elon's Twitter feed considered cheating?",
   "created_utc": 1692211548,
   "score": 5,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh0cny",
   "message": "My friend, Melissa, choosing to go back to her abusive husband over and over again",
   "created_utc": 1692213367,
   "score": 7,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgq5ep",
   "message": "When my friend Carl married that control freak Christine.",
   "created_utc": 1692209744,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh0wv3",
   "message": "My friend has a lot of free time on his hands and spends most of it on watching right wing conspiracy propaganda. He's angry all the time.",
   "created_utc": 1692213566,
   "score": 8,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh255f",
   "message": "Drugs, always fucking drugs",
   "created_utc": 1692214003,
   "score": 3,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh6u1z",
   "message": "My ex is on wife #5. He was and still is in love with wife #3. He cheated on her with wife #4. He blew up a great relationship (well all 4 divorced are cause he cheats) simply for a piece of ass!",
   "created_utc": 1692215683,
   "score": 9,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh80cj",
   "message": "My first real girlfriend, and our relationship.\n\n\nShe went back to her ex who has:\nTons of debt, is chronically unemployed\n\n an insane ex himself with kids (all of whom hate her), \n\n shared with her the gift of herpes and another STI (at least the other one is curable)\n\n Been put in jail for abusing her, twice\n\n\n\nIn that time, she has:\ndeveloped an alcohol issue\n\nBecause of company he keeps, she was beaten near to death by one of his friends\n\nLost most of her friends, who she offended by doing all the least advisable things then taking no accountability. (I still occasionally chat with her old friends… more than she does)\n\n\nEven still, I wish she’d get her shit together and do better. I did love the person she used to be, I’d never want anyone I loved to suffer like this.\nBut holy crap, she made the bed and is certainly being made to lay in it…\nWorst of all was like, 2 years after she asked if I would ever take her back because she hated her life.\nI could have been more mature but she got “that’s a hard fuck no for me” from me. That probably didn’t help.",
   "created_utc": 1692216100,
   "score": 5,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh8wq3",
   "message": "My parents getting married I'd say. According to them themselves they were so happy together when they were just dating. They married about 3 years after I was born I think, and now the house is a wreck. Nobody's happy here anymore hence why I'm leaving as soon as possible\n\nHell they didn't even want to get married. They only did it so airport security would stop asking why I didn't share a last name with my mother",
   "created_utc": 1692216424,
   "score": 7,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgk75r",
   "message": "A few family members are down the Q path. They are angry literally 24/7 and blame everything wrong in their personal lives on the dumbest shit possible. They talk about nothing except how democrats are killing babies for adrenochrome and the country is being \"stolen.\"",
   "created_utc": 1692207642,
   "score": 10,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgoluo",
   "message": "Alcohol and drug addiction led to every example I can think of that's mention worthy.",
   "created_utc": 1692209195,
   "score": 5,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgdd8f",
   "message": "Prince Harry\n\nY’all know why.",
   "created_utc": 1692205224,
   "score": 255,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgbuo6",
   "message": "Addiction.",
   "created_utc": 1692204685,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgdv9z",
   "message": "When my friend had an affair",
   "created_utc": 1692205402,
   "score": 0,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgxmss",
   "message": "buying Rainbow Six Siege",
   "created_utc": 1692212391,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwg9ehc",
   "message": "me being born",
   "created_utc": 1692203813,
   "score": 251,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwgj3ir",
   "message": "Shut up.",
   "created_utc": 1692207255,
   "score": 248,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh4kqy",
   "message": "Myself when I relapsed",
   "created_utc": 1692214881,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh6w7j",
   "message": " I've seen is someone always looking at what others have on social media. This made them feel not so happy about their own life.",
   "created_utc": 1692215704,
   "score": 2,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh761b",
   "message": "I had a friend in college who had a tendency to act before thinking, but was generally fun and well-meaning. After I had graduated, my friend apparently got coerced by a woman he was trying to sleep with to try heroin just once. As I heard it, he refused initially, then caved because he felt pressured. My friend overdosed and died. Just like that, one bad decision ended his life. RIP Mike.",
   "created_utc": 1692215800,
   "score": 5,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwh9kl6",
   "message": "Female cousin. 55 years old. Hard-core Trumper and Anti-Vaxxer. Caught COVID. The bug triggered Guillan-Barre Syndrome. She died three weeks after her first grand baby was born.",
   "created_utc": 1692216663,
   "score": 25,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhbah8",
   "message": "I have a family member who inherited around $500k in cash and assets when his mother died. He had a decent job at the time. This inheritance meant that he started taking longer vacations and stopped consistently working. He bought a sports car and paid off the two pre-built condos that his mother had put down payments on but sold one immediately at a loss and then rented the other out for a while until his original tenants moved out then let it sit vacant for over a year and selling it at a loss. He “loaned” money to his half sister to pay for tuition at a job that would never allow her to repay him. He bought every new and interesting piece of electronics. \n\nThe electronics eventually caught up with him.  He went on holiday to the USA and on his way back across the border the guards wanted to search his laptop which led to the discovery of child porn. He was also trying to groom his niece (daughter of the half sister).  \n\nThere wasn’t much money left from the estate at that point. He was arrested and only managed to stay out of jail on a technicality that a very expensive lawyer found. He paid mid $50k for his defense. The two or three years that the criminal defense was going on he didn’t work at all. Just dipped out on his employer who would have continued employing him. He sold the sports car at a loss. Sold his last remaining property, the condo, at a loss. Sold a bunch of his expensive toys at a loss. Ended up penniless (actually probably bankrupt) but not in jail. Now his life consists of living in a small rented bedroom and working as a local trucker. \n\nHe didn’t just destroy his life, he nuked it from orbit and then salted the ground. He’s currently in his late forties and will probably never be able to retire. Most of the family won’t speak to him at all.",
   "created_utc": 1692217270,
   "score": 12,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhbehi",
   "message": "Probably when I broke up with my last girlfriend because everything is getting too stressful and busy for me, too many demands on my time.\n\nMost amazing woman I know, bloody gorgeous and sweet.",
   "created_utc": 1692217309,
   "score": 4,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhc4ja",
   "message": "The mirror, every day",
   "created_utc": 1692217563,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhcpzl",
   "message": "My wife's ex husband was left millions by his parents.  He got addicted to poker and over 10 years or so lost it all, and eventually lost the wife (and she married me). When she found out he was taking loans out againt the house they lived in. He's spent the last 5 years or so living in a dorm situation and struggling financially because he can't hold a job.",
   "created_utc": 1692217775,
   "score": 6,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhd17y",
   "message": "Known multiple men who married successful women and begged to become stay-at-home dads, then ended up cheating.",
   "created_utc": 1692217885,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhgdhy",
   "message": "My ex friend who took the unconditional love of her husband to treat him like dirt because he always forgave her. When he finally stopped 10+ years later she was shocked that she was divorced and whined about how her life was \"shattered\" and happiness \"stolen\".\nI'm still so very proud of him for getting away.",
   "created_utc": 1692219058,
   "score": 11,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhjmi0",
   "message": "This entire thread is pretty much affairs \u0026amp; addictions.",
   "created_utc": 1692220208,
   "score": 11,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhikc8",
   "message": "A friend of mine quit a job that paid six figures a year because he didn't trust his girlfriend to not cheat on him while he was at work. The kicker here being she was a hooker when they met.\n\nHe's a great guy but a complete idiot when it comes to women.",
   "created_utc": 1692219828,
   "score": 9,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhf2jd",
   "message": "My buddy who my ex cheated on me with, I know her brand of crazy and he has to be dying on the inside, everything could be amazing and she’ll find a way to argue, because if he man argues back he loves her and as soon as he stops arguing with her, hes checked out emotionally.\n\nMy 20s were OOF",
   "created_utc": 1692218602,
   "score": 7,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhgvh0",
   "message": "Currently, my manager at work is living with his mother who has Alzheimer's and is getting to a pretty bad state. He refuses any advice even from people who have gone through what he's going through and just doing what he wants. He refuses to get homecare to help when he's not there, basic things like getting a whiteboard to write a note for his mom so she won't need to call him 20 times a day and ask when he is getting off work, etcetera. I think he likes having something to complain about to us here",
   "created_utc": 1692219232,
   "score": 5,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhl6b1",
   "message": "My oldest cousin used to get regularly verbally abused by my extremely strict religious aunt growing up, and used to complain to me and my sister about the treatment he got. My paternal grandmother and my parents tried to intervene numerous times but to no avail, as my uncle (my dad's younger brother) used to 'support' the treatment that my aunt gave to my two cousins. Sadly nothing really got done in the end.\n\nFast forward to now. At 21 years old, my oldest cousin has now become a fundamentalist Christian who posts constantly on Instagram about it. What's really sad is, he doesn't trust anybody who doesn't go along with his beliefs - even family members, and he's extremely dismissive and hateful of anybody who lives a different life to him. Sadly this includes my grandmother - and it is breaking her heart that one of her grandkids refuses to speak to her, just because she doesn't share his beliefs.",
   "created_utc": 1692220768,
   "score": 5,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhlyt9",
   "message": "Dude got feelings for a girl he knew for some time. She was kind, caring, genuinely good person. They texted a lot and stuff and she seemed really interested in him.\n\nSo he decided to cut her off, while chasing after a mentally unstable toxic girl who just uses him and only reaches out to him when she wants something. \n\nAll while constantly whining that nobody wants him and that women are all backstabbing bitches who can't be trusted.",
   "created_utc": 1692221050,
   "score": 5,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhpd3s",
   "message": "I worked with a woman in a convenience store who was a super positive, dedicated, hard worker. She loved the job and the customers. She probably would have been the store manager within a few years.\n\nBut then she did some sketchy shit with scratch off lottery tickets and got fired. She kept coming back in the store for several weeks, threatening employees and the manager. She finally stopped coming in. Last I heard, she got really into meth after losing her job.\n\nI should note that it's possible she was already into meth before getting fired. But after, it became scary, scabby, teeth falling out into meth.",
   "created_utc": 1692222298,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhezbk",
   "message": "one of my friend met this girl on tinder and they eventually got into a relationship. she's both smart and beautiful. Couple months down the road he met another girl who was showing a lot on interest in him. One night when they were hanging out and they made out and surprisingly the guy didn't feel guilty.  \n\n\nHe is a really nice guy but he thought that he could date both of them without them knowing about each other. He loved both of them. Everything was going well for him, he knew how to be cautious and sneaky.   \n\n\nAfter a few months it became too overwhelming for him and started having fights with both of them and eventually he broke up with both of them.   \n\n\nLater, he was feeling alone and depressed and had no one in his life to care about him when earlier he had two loving, beautiful girls in his life with whom he could've had a good future with.",
   "created_utc": 1692218571,
   "score": 4,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhg8xk",
   "message": "I’ve known three people who committed suicide. That’s permanent.",
   "created_utc": 1692219015,
   "score": 4,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhgl19",
   "message": "My uncle. Happily married to his second wife. Adopted her 2 granddaughters. In 2021 he was arrested for molesting them and 2 other grandkids. No signs at all. They were a happy family. Kids were all smiles and happy when we saw them. Boom ruined his life and is in prison.",
   "created_utc": 1692219130,
   "score": 5,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhj2u0",
   "message": "Dude made his personality about being alpha and being successful. When he got dumped, and lost his job and positions of status - he absolutely crumbled.",
   "created_utc": 1692220012,
   "score": 3,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhojl9",
   "message": "I saw people that ended up on the streets as homeless, but here comes the important thing: In the country where i live, you get full coverage by social welfare. The state pays your rent for a home, pays your monthly insurance bills for healthcare access etc. and also offers you free detox, rehab and therapy for drug addiction, also therapy for mental health issues and other problems.\n\nStill, these guys that hang out on certain places of the public drug scene, they refuse any help. They have given up on themselves. \n\nEven when street workers come and offer them assistance, like doing the paperwork for getting social welfare, getting a new home etc. and even when they want to give them some warm clothes in the winter, they refuse.\n\nSome of them even refuse to get the basic things, like the free dog food we hand out here and the free vet care we offer them, there's no way to get through to them.\n\nThat's self-destruction that you can't imagine if you have never see it for yourself. Like when i was on drugs, i met this one guy, he had abscesses on multiple body part and he looked like someone had just beaten the shit out of him, i told him to see a doc asap, because the abscesses will lead to a sepsis, killing him. His answer was \"I'm fine, don't tell me what to do!!\"",
   "created_utc": 1692221995,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwht4wr",
   "message": "My grandmother. \n\nShe had a pretty nice life and frugality meant she could have had a very comfortable retirement. However, you never saw someone who would search for grey cloud to every silver lining.  Heck she made up more than a few clouds herself with hypochondria/munchausens.  Frugality turned into pathological cheapness.  \n\nThen because she had managed to Silas Marner her way into some serious cash in the bank, she decided we all only around her to get money. Borrowing money from banks was infinitely preferable to strings that came with her money. She owned you if you had the bad judgement to borrow from her.  As for inheritance, I have not seen a dime and I don't care. We stuck around out of misguided obligation and nothing more.",
   "created_utc": 1692223728,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhgf3f",
   "message": "I see this happen everyday.\n . Whether it’s politics or religion or comparing their lives to others or just stupid bull shit drama. Some people are experts when it comes to sabotaging their own happiness. \n   \n So here’s some advice for a happier life. Never invest emotionally in things that are beyond your control",
   "created_utc": 1692219073,
   "score": 2,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhnykf",
   "message": "Jared from Subway.",
   "created_utc": 1692221780,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhssif",
   "message": "I met a man who went to Vegas and \"decided\" he no longer wanted a wife and kids. In my opinion, he was experiencing psychosis from a week's long bender and, with a week of sobriety, would have realized how effing stupid he sounded. Anyway, I don't know how that story played out. His name was Ali. I want to say he was Indian.",
   "created_utc": 1692223595,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhgios",
   "message": "My wife, she is not American. We got married a little less than 2 years ago. She impatiently waiting to come and live with me but she keeps complaining about how she can't take it any longer but we're almost at the end of the stretch. It passes me off that she cant see how she just needs to wait like I am.",
   "created_utc": 1692219108,
   "score": 0,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhg83c",
   "message": "I am",
   "created_utc": 1692219007,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhmis2",
   "message": "I have PTSD, I destroy my real life happiness about every 6-9 months through breakups.",
   "created_utc": 1692221252,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhqyt8",
   "message": "Saw a kid drop an ice cream cone",
   "created_utc": 1692222897,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhr0cx",
   "message": "It’s me.",
   "created_utc": 1692222913,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhr11a",
   "message": "Johnny manziel",
   "created_utc": 1692222920,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhrqn4",
   "message": "Me. I am my own worst enemy and the destroyer of my own happiness.",
   "created_utc": 1692223189,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhsn1p",
   "message": "My bathroom mirror",
   "created_utc": 1692223536,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhto5n",
   "message": "Probably myself.  Instead of continuing my career as a chef, I went a different direction and got a job in purchasing for a restaurant equipment distributor.  It was great for 10 years, at which point they asked me if I wanted to try selling, and I said sure because it was a good pay increase.\n\nSales is fucking miserable.  People suck, but when you’re in sales, people really fucking suck. You are treated like a whipping boy at everyone’s beck and call. \n\nI’m out of sales now, but my new position is crazy stressful.  I’m so stressed, I started unconsciously pulling out hair from my eyebrows, and now I have weird eyebrows.  I’m working so hard, I feel too drained to start job searching after work.  \n\nI miss being creative. I miss the camaraderie, the sounds, the smells (though some I definitely don’t miss), the people… \n\nI have enough experience now that I can be a restaurant consultant, but I have no idea how to get started, so I just keep on chugging through my current stressful-as-fuck job.  \n\nFollow your dreams, people.  Don’t trade passion for security.",
   "created_utc": 1692223937,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhve9o",
   "message": "A person not taking the chance in whichever way they saw fit.",
   "created_utc": 1692224605,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhw68q",
   "message": "My best friend met an ex-addict at a brewery and got her pregnant within 2 weeks of meeting her. Nowadays, they pressure me to have a child of my own while simultaneously telling me how much they never have sex or privacy, how they never agree on anything and how stressed out and miserable they are. He works 10-12 hours days, she does not work, which has started causing them fights because he wants her to go back to work when their kid is old enough to go to school. She doesn't feel like she should have to because of her efforts staying at home, but only rarely can you see the floor of their apartment in areas outside of where the baby plays.  She drinks all day while looking after their now toddler and he comes home. Generally, she passes out and he cooks dinner and puts the kid to bed. He's been getting progressively more depressed and drinking and smoking more, as has she. \n\nThey have a whole menagerie of animals, exotic and run-of-the-mill including a grown pitbull that isn't walked. I don't mean like, isn't walked enough, but I mean like she doesn't walk him at all unless a friend forces her to go for a walk with the kid and my friend doesn't walk the dog when he gets home because he tired, still has to cook and is a stubborn ass who 'doesn't feel he should have to'. The dog pisses on puppy pads on their couch in the livingroom where the child plays, as if that isn't fucking horrifying. Recently, her day drinking has escalated their fights and led to her attacking him in front of their child. Then, she passes out in bed and doesn't remember anything she did to him the next day and gaslights him, saying he's making shit up about her to ruin their relationship. He drinks more as a result, which worsens their fighting. \n\nFour years ago he used to tell me how depressed he was working an 8 hour day and going home to an empty apartment to play video games and now when he vents to me he cries about how he had no idea how lucky he was then. They've both bit off more than they can chew with their animals, with parenting and with each other. She won't stop screaming about getting married and he's suddenly realizing that he can't and won't marry her, but she'll bankrupt him if he leaves her. \n\nAll I can do is babysit, be an involved Auntie, walk the dog and support him emotionally. The more I do this though, the more she gets on me and starts making shit up about me and my 'nefarious' intentions, which makes me like her less even though I know this is likely a result of her drinking habits. Both of their drinking is wildly out of control, but I'm not even a year sober yet so I don't have a soap box to stand on. \n\nI'm trying my hardest, because I'm the oldest child of an abusive home and it fucks me up all kinds of ways that his kid has to see and live all of this. Even when I don't agree with either of them, I'm always there because I love that kid. \n\nBut maaaan, I'd be fucking lying if I said I didn't want to grab him by his shirt some days when he's crying to me about this whole mess and snarl, \"*You were the only one who didn't think this was a bad idea. This is all on you.*\" because he knows that. \n\nLike, we all know how this is going to play out but for whatever reason, he thinks it'll be different for him. \n\nSo, we march on.",
   "created_utc": 1692224912,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhwffp",
   "message": "There was a guy I knew, selling hash oil. He'd get 5 pounds of it every month. He had a house, a cottage, a boat, a motorcycle, a 1970 Mustang, and tons of jewelry and toys.  \n\nHe got into coke, and went from the nose, to the pipe, to the arm.  \n\nThe last time I saw him he was bitching at a street corner dealer that wouldn't front him a gram of weed because his word was no good.",
   "created_utc": 1692225013,
   "score": 1,
   "submission_id": "15su71p"
  },
  {
   "comment_id": "jwhwzrq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15su71p"
  }
 ]
}