{
 "submission_id": "15t13m5",
 "title": "What is the stupidest reason you went to hospital?",
 "selftext": "",
 "created_utc": 1692217817,
 "permalink": "/r/AskReddit/comments/15t13m5/what_is_the_stupidest_reason_you_went_to_hospital/",
 "score": 93,
 "url": "https://www.reddit.com/r/AskReddit/comments/15t13m5/what_is_the_stupidest_reason_you_went_to_hospital/",
 "comments": [
  {
   "comment_id": "jwhe3ni",
   "message": "Hiccups that lasted 24 hrs, stopped right when the doctor stepped in the room. Lol",
   "created_utc": 1692218262,
   "score": 170,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhvkff",
   "message": "When I was a kid, I didn’t like pooping because I never felt like I was clean enough after wiping my butt. Not sure why really, I wasn’t ocd or anything but I didn’t like it; so I decided to stop pooping. Whenever I had to poop, I’d just hold it or go out and play and eventually the urge would go away. \n\nWell, I woke up in the middle of the night, one night, and I literally couldn’t breathe. I ran into my parents room and woke them up just gasping for air until I passed out. They rushed me to the hospital and I started being able to breathe again on the ride there. They did some blood work and an x-ray and saw in the x-ray that my colon was so backed up with poo that the poo was blocking my lungs, especially after laying in my bed sleeping for a few hours, which is why I woke up and couldn’t breathe. My poo impacted colon was basically pushing against my lungs so I couldn’t inflate them when I tried to breathe in. \n\nThey gave me some ex lax and had to bring in a stool sample for the next couple months, I guess for some sort of testing, but never had a problem after that. I just learned that the poo has to go somewhere so I better get used to pooping. Waking up and not being able to breathe was one of the scariest things I’ve been through",
   "created_utc": 1692224671,
   "score": 154,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhd2b8",
   "message": "Panic attack thought I was dying lol",
   "created_utc": 1692217896,
   "score": 47,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhkwu8",
   "message": "Migraine that presented as body numbness.  Got a 3-day workup for a stroke to find out that I not only have migraines but an aneurysm. So thank you, migraines, for saving my life.",
   "created_utc": 1692220672,
   "score": 39,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhv9ql",
   "message": "I pissed myself and thought my water broke.  🤷‍♀️ Oh the joys of pregnancy.",
   "created_utc": 1692224555,
   "score": 14,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhj5oz",
   "message": "I got kicked in the shin by a robot.",
   "created_utc": 1692220039,
   "score": 152,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhtmvh",
   "message": "Broke my hip…\n\n…Getting up from the couch.\n\nIt was already really fucked up thanks to a medication I’d been on for years and hurt like a bastard. When it finally snapped I didn’t think “SHIT! My hip broke!” I thought “Shit! This thing’s acting up!”\n\nTurns out the bone was necrotic and released a massive infection into my system, I woke up from a medically induced coma a month later with no idea how I wound up in the hospital.\n\nEdit: Wow, woke up from a nap to see a ton of replies and upvotes! Thanks, everyone!\n\nEdit 2: Just started replying to everyone’s questions but the gist is this:\n\n1. Prednisone (steroid used for rheumatoid arthritis) is what ruined my hip. I had a doctor who claimed it was “safer” than the pain meds I was on at the time…I *really* disagree with him after all that. \n\n2. My Dad was the one who called the ambulance a few days after it happened since I passed out from exhaustion (only place I felt remotely comfortable was my PC chair and was stuck there for a whole night, he moved me to the living room couch where I finally got some sleep) and spiked a fever.\n\n3. Doing SO much better now. I got my hip and a few other joints replaced over the next couple years. I’m still in pain from my rheumatoid arthritis but its a million times more manageable than it was before. Plus I have much more competent doctors who are willing to listen to my concerns instead of the guy who put me on prednisone and said “Which one of us has the medical degree? Yeah, I thought so, do what I say.”\n\nIn fact my current pain management doctor told me to stay away from steroids like prednisone completely- They also ruined my bone density, among a couple other problems we’re hoping to fix or at least manage. He’s awesome, the total opposite of the guy who put me on prednisone.\n\nThanks, everyone for the replies and upvotes!",
   "created_utc": 1692223924,
   "score": 172,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwho7wz",
   "message": "Butt cheek injuries caused by a door.\n\nI hate touching door knobs with my hands and always use my forearm to rub against the doorknob in a downward motion using friction to turn the knob. Was joking around with my gf saying I can open a door with my buttcheek exactly like how I use my forearm. Jumped at the door butt first and the little metal thing that guides the door cut my buttcheek (i think they call it strike plate or latch strike). The cut wasn’t a clean cut because the thing wasn’t that sharp. 30+ stitches. \n\nAfter that she had to stand behind me holding a bowl to cover my wound every time I take a shower so it doesn’t get wet, and we live in a hot country so she has to do that twice a day for like a month.",
   "created_utc": 1692221875,
   "score": 165,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhumtc",
   "message": "My then 2 year old daughter shoved a broken crayon up her nose. It took a week, we saw 2 doctor's then a trip to the ER with no luck. The ER doctor actually managed to shove it in farther. I finally was able to get an appointment with a pediatric ear, nose and throat doctor who had it out in about 60 seconds. She's in her 20s now and i still tease her about it. Oh, and the crayon? It was green.",
   "created_utc": 1692224312,
   "score": 136,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhrear",
   "message": "I took my daughter to the hospital after she had been puking for 12 hours,  Nurse was making me feel really stupid.  My daughter threw up all over the nurses computer.  She took us right back to a room after that.",
   "created_utc": 1692223058,
   "score": 51,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhs3a8",
   "message": "When I was about 3, I was running up the stairs in my house and fell.  I hit my chin on a step and bit my tongue nearly off.\n\nMy parents took me to the local hospital where they sewed up the gash in my tongue *without anesthetic*.  I still remember it to this day.",
   "created_utc": 1692223323,
   "score": 17,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhtznh",
   "message": "Severe unexplained chest pain. Turned out I pulled a muscle in my chest using my asthma inhaler",
   "created_utc": 1692224061,
   "score": 116,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhhgpn",
   "message": "Cafeteria.  I liked their food . \n\nNo one was ill or there.",
   "created_utc": 1692219439,
   "score": 100,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhtmzp",
   "message": "I got my diva cup stuck",
   "created_utc": 1692223925,
   "score": 116,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhwi2z",
   "message": "I got stuck in my moms womb for 9 months or so. What a dumb fetus I was.",
   "created_utc": 1692225043,
   "score": 120,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhsqn8",
   "message": "I worked there ... ugh.",
   "created_utc": 1692223575,
   "score": 190,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhqpde",
   "message": "When I was 12 I got into an argument with my sister over kittens and she slammed our glass door so violently my hand went right through it and I sliced open my wrist. Doctors said 1 mm deeper and I’d have been a goner. I still have the scar",
   "created_utc": 1692222798,
   "score": 251,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhlblj",
   "message": "Twisted my testicles\n\nEdit: why is this being upvoted",
   "created_utc": 1692220819,
   "score": 154,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhthw4",
   "message": "Christmas Day, I dislocated my knee attempting to kick my brother during a sparring match. Needless to say my martial arts career was over.",
   "created_utc": 1692223870,
   "score": 182,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhvetr",
   "message": "Terrible chronic nosebleeds from my CPAP machine's humidifier not being enough moisture for my little bitch of a deviated septum. I don't have a big weight issue but unfortunately between a severely deviated septum and a weird jaw after my wisdom teeth were removed, I have to sleep a very specific way or I have trouble breathing in my sleep. So when I get apnea, I use the CPAP so I can get proper REM.\n\n\nAnyway, one morning I woke up almost drowning in my own blood and after 2 hours of it not clotting and actively getting worse, I drove myself over. They shoved what they referred to as a \"rhino rocket\" up there and inflated it. This was also the height of the lockdown in 2020 so I went hours unseen just bleeding in the ER.",
   "created_utc": 1692224611,
   "score": 167,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhw2x6",
   "message": "Passed out from shitting",
   "created_utc": 1692224875,
   "score": 156,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhdsrh",
   "message": "So I was on a ski trip, I was just standing, but I lost my balance, idk how, I fell on the ground, my leg twisted 180° and before anyone got to me my tibia broke",
   "created_utc": 1692218154,
   "score": 231,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhwex6",
   "message": "Im an RN at a level one trauma hospital. I had been feeling really anxious for a couple days. Im at work in the middle of the night and my chest starts feeling tight and my arms are going numb and I feel dizzy. My co-workers urge me to go the ER, which is packed and smells like BO. Took a nap in the room while I waited and when I woke up I felt fine. \n\nIm 99% sure I just had a panic attack and in hindsight, it makes sense, I had been very anxious. Im an RN and couldn’t recognize my own panic attack. I felt very silly.",
   "created_utc": 1692225007,
   "score": 40,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhquvy",
   "message": "A fish bone was lodged in my throat 😫",
   "created_utc": 1692222856,
   "score": 80,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhsypk",
   "message": "Dislocated my knee just walking around my house. Found out my joints are all fucked up.",
   "created_utc": 1692223660,
   "score": 198,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhtoam",
   "message": "Overdose on Adderall so psychosis.",
   "created_utc": 1692223938,
   "score": 110,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhuaid",
   "message": "When I was a kid, my dad used to take me to the park to practice soccer on days when I didn’t practice bc I was really into it. One day I tripped, he tumbled over me, and screwed up my finger. He was a skater in his younger years, and was used to seeing sprains and dislocated fingers, so he thought it was just a matter of popping it back into place. It was not, it was definitely broken, and he definitely made it worse. My mom still makes fun of him for it 20 years later.",
   "created_utc": 1692224179,
   "score": 126,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhdbpb",
   "message": "I smoked hella pot n was feeling super out of it like this is definitely not the weed... Thought I was tripping out went to the hospital glad I did needed something removed or I was gonna die lol. I was gonna sleep it off cuz I thought my weed was laced lol.",
   "created_utc": 1692217988,
   "score": 53,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhywhd",
   "message": "My husband went because he was in extreme pain and thought he was having a heart attack. Turns out it was wind. He just needed a good fart.",
   "created_utc": 1692226006,
   "score": 248,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhyka9",
   "message": "I got an earplug stuck in my ear. Since this was after hours most urgent care facilities were closed so I felt I had to go to the hospital. \n\nThe initial attempt for them to remove it failed, so after leaving me alone for another hour with this throbbing pain, they returned with a surgical alligator clip thing and it was successful.\n\nThe gross charges were $10k for that or something, which my insurance paid. America's healthcare is f***ed.",
   "created_utc": 1692225870,
   "score": 109,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhyrui",
   "message": "My weiner turned puffy and red for seemingly no reason. Had to fly to a wedding next morning and freaked out. Asked my gf to drive me to hospital. Nurse asked me if I had been eating spicy foods. Yes, I had been eating hot wings, and I must have held my weiner to urinate prior to washing my hands. Nurse gave me a benadryl and told me to chill. I later requested the nurse's notes for my records, they're hilarious.",
   "created_utc": 1692225955,
   "score": 61,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhtupt",
   "message": "I got high. Started to get dizzy and black out. As soon as I told the doc I took an edible, they kicked me out. Despite my pleas that I normally take edibles and nothing like that had happened before",
   "created_utc": 1692224007,
   "score": 10,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwht6zu",
   "message": "When my neck didn't hurt from a car accident but everyone I knew was insisting I go to the hospital and have them check. Everyone in the hospital treated me terribly because they thought I was faking the whole thing for an insurance scam. I had to show a nurse my bruise across my body from the seatbelt and a photo of the car before she believed me, this was after seeing a Dr who had already seen the bruise.",
   "created_utc": 1692223751,
   "score": 74,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwht43i",
   "message": "Dust in the eye 😂",
   "created_utc": 1692223719,
   "score": 33,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhwz4q",
   "message": "When I was 8 I was bored so I got a bottle of Gatorade from my pantry and grabbed a kitchen knife then proceeded to stab it over the sink to see how easily the knife would go through the thicker plastic of the bottle…almost lost my thumb",
   "created_utc": 1692225233,
   "score": 179,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhwzpp",
   "message": "I got a good one. \n\nI used to rent a small apartment and was vacuuming. The cord got tangled around my leg and I ate it. Knocked me out and my roommate found me and took me to the hospital, thinking I was possibly dead. I was fine, albeit concussed but I woke up embarrassed as hell 😂 bought a Roomba after that!",
   "created_utc": 1692225240,
   "score": 83,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhx68i",
   "message": "Not me, but my kid complained of their throat hurting and was absolutely DISTRAUGHT and said they didn’t know why it was hurting… we went to the ER turns out they told the doctor they had eaten some M\u0026amp;Ms (they had snuck and didn’t want to tell me) and turns out the shell of one had just scratched their throat. 🤦🏼‍♀️",
   "created_utc": 1692225312,
   "score": 221,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhd20c",
   "message": "Blocked ear.",
   "created_utc": 1692217893,
   "score": 8,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhq9rx",
   "message": "My sister once ate too many blueberries and got a bad stomach ache, so I had to keep her company overnight in the hospital because kids under 15 have to be accompanied by a guardian.",
   "created_utc": 1692222636,
   "score": 62,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhu0xr",
   "message": "Not me but i had to pick up a mate who swallowed a 50c  piece to win a $2 bet. If you don't know, an Australian 50c is quite large. They had to do an endoscopy to get it out. They let him keep the black corroded coin too.",
   "created_utc": 1692224075,
   "score": 244,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhv91m",
   "message": "Couldn't shit. Been twice for that same reason.",
   "created_utc": 1692224548,
   "score": 22,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhz6mi",
   "message": "A bat landed on my head while i was asleep.   Rabies shots all around!",
   "created_utc": 1692226121,
   "score": 193,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhy0nk",
   "message": "I almost sliced my finger off with a deli slicer almost immediety after telling my trainer that i think cleaning it this way is going to get someone hurt.",
   "created_utc": 1692225648,
   "score": 141,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhyk2c",
   "message": "Pain on my left pelvic side. Had it every now and then but it would get intense. Went to ER and they ran all sorts of tests. Nothing came back indicating why. Finally, months later, it occurred to me that it was ovulation pain. Taught me DRs need more education about women’s health.",
   "created_utc": 1692225868,
   "score": 86,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhzffq",
   "message": "I was a house party, all the bathrooms were full. Went outside, decided I should crawl under the porch to pee. Everything went well until I tripped on the way out and rolled my ankle. Shrugged it off, limped back upstairs and someone said \"Your ankle is broken\". Sure enough, bone stickin out. DD took me to the hospital and got me ice cream on the way home. I miss you, Kyle. You're the best.",
   "created_utc": 1692226219,
   "score": 87,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhiajh",
   "message": "To get a job.",
   "created_utc": 1692219729,
   "score": 14,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhr8oh",
   "message": "Stabbed myself in the eardrum with a bamboo skewer because I'm obviously an idiot \n\nAn idiot who doesn't know that, in the US,  there is a giant difference in price between \"the doctor\" and \"the hospital\"",
   "created_utc": 1692222999,
   "score": 67,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhukua",
   "message": "Thinking I was having a heart attack and I was dying when it was nothing",
   "created_utc": 1692224291,
   "score": 11,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhwpyz",
   "message": "Finished my nursing degree",
   "created_utc": 1692225131,
   "score": 6,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhy0gv",
   "message": "At the tail end of Covid, my inner arm, just below my elbow crease, got swollen and very hot. It lasted a few hours and by night, I was getting worried about blood clots. So after 10pm, I took myself down to emergency to have it checked out. My symptoms started fading about halfway through my 4 hour wait. I started to feel I was fine but I stayed through the ultrasound and Dr exam anyway. As soon as she told me she didn't see anything, I got up and left. I didn't even ask any questions.\n\nTo this day, I will get unexplained arm weakness every now and then. So I wish I would have asked her more. Especially because my fam was all, what did she say? And I flat out just crashed to sleep without responding.\n\nI probably could have gone to urgent care, earlier in the day, for about $3000 cheaper.",
   "created_utc": 1692225646,
   "score": 10,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhvhnv",
   "message": "Severe itchiness from a foam party on a freshly shaven face.\n\nIt was unbearable. I went to the emergency room and prescribed some ointment that thankfully did the job.",
   "created_utc": 1692224642,
   "score": 26,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhwdrw",
   "message": "A piece of popcorn was stuck in the back of my throat",
   "created_utc": 1692224994,
   "score": 40,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhxni6",
   "message": "I got a black Barbie doll head stuck in my nose",
   "created_utc": 1692225503,
   "score": 5,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhxvnu",
   "message": "Ear infection that I thought was an infected jaw or some flare up of TMJ. I was sleeping on ice packs.\n\nI hadn't had an ear infection as far as I could remember. Didn't know what it felt like. \n\nDoctor looked in my ear and then ran out of the room and came back with antibiotics and antiinflammatories for me to take immediately.",
   "created_utc": 1692225592,
   "score": 87,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhybdh",
   "message": "Almost cut my finger off opening a can of dog food",
   "created_utc": 1692225769,
   "score": 13,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhyfwe",
   "message": "Coughed really hard and hit my head on a granite table.  Got a nice head laceration with lots of blood.",
   "created_utc": 1692225821,
   "score": 59,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhyndb",
   "message": "Asthma attack that my inhaler couldn't get under control.  Turned out the hotel had a mold problem and the spores were setting me off.",
   "created_utc": 1692225905,
   "score": 46,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhywwg",
   "message": "Drove a golf ball into my own forehead",
   "created_utc": 1692226010,
   "score": 64,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhcz8g",
   "message": "To avoid going to work",
   "created_utc": 1692217866,
   "score": 13,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhfjqh",
   "message": "I had sepsis and the woman in front of me was there for a lip ulcer. Literally a small ulcer on her lip.",
   "created_utc": 1692218770,
   "score": 4,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhw56k",
   "message": "Went to a normal office visit with my urologist he swapped my catheter port, he missed so after 8 hours in the ER today, they let me go with an appointment for to see the hospital’s urologist to fix the fuck up.",
   "created_utc": 1692224900,
   "score": 4,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhwx6m",
   "message": "when i was younger i desperately wanted to be a doctor (still do) and so i faked a sprained arm so i could see the action of doctors helping hurt people, i was so thrilled and just wanting to do the same. not proud of it, took up an er seat, cost my parents money, and took help and beds from other people who needed them.",
   "created_utc": 1692225211,
   "score": 100,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhxhhb",
   "message": "Though my appendix was rupturing… it was gas. Got scans and EVERYTHING",
   "created_utc": 1692225437,
   "score": 60,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhxl6r",
   "message": "I work here.",
   "created_utc": 1692225477,
   "score": 4,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhybxg",
   "message": "My boss sent me to the ER due to a nosebleed that wouldn't stop.  They cauterized my nasal cavity.\n\nMore recently I cut the tip of my thumb off building a model.",
   "created_utc": 1692225775,
   "score": 50,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhyvp3",
   "message": "Fell through a car wash grate opening",
   "created_utc": 1692225997,
   "score": 4,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhzjoo",
   "message": "I work there, so the stupidest reason that I went to the hospital is everyone in this thread.",
   "created_utc": 1692226267,
   "score": 126,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi1mn1",
   "message": "A palm leaf penetrated my leg as a kid. It went into my calf about an inch. Hurt like hell.",
   "created_utc": 1692227115,
   "score": 43,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi22ha",
   "message": "Years ago…I drink too much brandy, and swear on my life that I am dying. I call 9-1-1 and tell them to pick me up  because I swear I’m dying. After all, my heart is racing like a bitch. \n\nIt is the dead of winter. \n\nI run outside in my shorts and slippers. Blizzard outside. I see the ambulance coming. I wave my hand up 🙋‍♂️.\n\nThey pull over towards me. They open the door. Both paramedics look confused as fuck. \n\n“Uh, we got a call about someone—you? Saying they think they are dying? “\n\n“YEAH I THINK I DRANK TOO MUCH BRO.”\n\n“Uh, we can take your vitals if you want.”\n\nThey take my vitals. I’m not dying.\n\n“You’re not dying. But, ah…you look kinda worried. We can take you to the hospital if you want.”\n\n“YES PLEASE.”\n\nI puke on the way there.\n\nI crash there for the night.\n\nWake up with the best after glow in my life.\n\nStop drinking after that.",
   "created_utc": 1692227297,
   "score": 88,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi28d6",
   "message": "I bumped chests with a guy I was in a play with. He was a friend of mine and he was significantly larger than me. I was playing the part of a large guy and had my clothes padded down to make me look larger. We thought it would be funny to bump chests but he went running towards me and I stopped my ground and he hit me so hard it gave me something called pneumothorax which is when oxygen gets forced out of your lungs and into your blood. I had no idea I had it at first but at the cast party that night I felt a buzzing in my throat as I spoke. I ended up getting rushed to the hospital where they diagnosed it and I had to stay a day with oxygen treatment. My buddy felt bad but we just laughed it off. He was a very well spoken guy, he was like a nice version of Sheldon in big bang theory. After high school he disappeared and I wish I had kept in touch. I'd love to give him an award saying \"to the one person who ever landed me in the hospital\".",
   "created_utc": 1692227364,
   "score": 71,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi39co",
   "message": "Went? I go once or twice a week for being fucking stupid again and locking myself out of the apartment! The staff in the reception must look at me and my dog everytime thinking \"there goes the clown again lel\"\n\nMy wife works at the hospital, I go there to borrow her keys",
   "created_utc": 1692227791,
   "score": 142,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi4x9j",
   "message": "I didn’t wanna go to school so I faked being unconscious for 5 mins.",
   "created_utc": 1692228484,
   "score": 20,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhvtb4",
   "message": "I was born. Stupid parents forgot protection",
   "created_utc": 1692224769,
   "score": 8,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhuniq",
   "message": "A DUI",
   "created_utc": 1692224320,
   "score": 3,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhx4nw",
   "message": "Dehydrated myself by drinking iced coffee instead of water for weeks, which then turned into an anxiety attack because I didn't know what was happening.🤦🏻‍♀️\n\nEdited to include: I did not have a legitimate diagnosis of anxiety until that day (although it came about due to my father passing exactly one month prior to this medical event).",
   "created_utc": 1692225295,
   "score": 25,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhy9kl",
   "message": "I was playing the “choking game” with my sister and stepped back onto a gerber jar and got 6 stitches",
   "created_utc": 1692225748,
   "score": 3,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhyc9v",
   "message": "Body rash I thought was a hyper rare side effect of a medication I had just started taking. Nope, just bad timing. I was allergic to our new brand of laundry soap. \n\nThe reverse is when I went to the hospital after having shortness of breath symptoms I was pretty sure were just the start of influenza. Sike I had a heart rate of 160 at triage",
   "created_utc": 1692225779,
   "score": 3,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhymzk",
   "message": "A soup can stuck on my finger. 🥣",
   "created_utc": 1692225901,
   "score": 3,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhz2r2",
   "message": "A strangers dog bit me but didn’t puncture the important part of skin, it just scratched me really. And I was worried about rabies because the dog was a homeless persons dog. So I went to the ER and the doctor came in. Told me to strip down. Looked at my leg. And sternly told me in doctor language that I am an idiot and charged me like $400.",
   "created_utc": 1692226077,
   "score": 50,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhzw2z",
   "message": "I got too high and drank too many energy drinks when vacationing in the mountains. Thought I was dying, turns out it was just elevation sickness that turned into a panic attack.",
   "created_utc": 1692226404,
   "score": 76,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhzxwr",
   "message": "My parents were holding/managing my medication intake at home after a depressive/suicidal episode, and one day they found the medication was missing. They grilled me and thought I was hiding it to harm myself again, so they took me up to the hospital to commit me.\n\nIt was found out after the fact that my drug addict older sister stole it, but had told them it was me. She even had come with us to the hospital when I was committed so she could berate me for stealing it, knowing I had done nothing.\n\nFamily, amirite?",
   "created_utc": 1692226425,
   "score": 120,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi00bc",
   "message": "i took Viagra and it was up for 2 days",
   "created_utc": 1692226453,
   "score": 3,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi08e2",
   "message": "6th grade, last day before Christmas break. I’m allergic to peanuts and I guess the Christmas cookies I got from the grocery store had traces of them. Forgot why I specifically brought some in, I think maybe I had promised to for class at some point. One of those things where everyone has to bring something and I picked cookies because it’s easy. Anyway the reaction hit about 20 minutes before dismissal and I knew it, figured if I could pretend to be fine long enough to get in my moms car then I could just throw up at home. My allergy isn’t that severe, I vomit and stuff but I’m good after a few hours. Unfortunately one of my classmates looked at my face swelling, told the teacher when I asked him not to, I got sent to the nurses office, threw up there, and immediately felt better. But they had already called the paramedics. These dudes argued with an 11 year old me in the nurse’s office, I told them I was fine and now that I threw up I was feeling better and better. They insisted I had to go to the hospital. They made me pick up my stuff and walk into the ambulance, then strapped me down and rushed me to the hospital where I was already fine, and had to stay for 4 hours or so. That was a fun bill.",
   "created_utc": 1692226544,
   "score": 23,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi0j5o",
   "message": "Managed to get the blunt end of a sewing needle stabbed just under my finger joint when I was 11.",
   "created_utc": 1692226666,
   "score": 22,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi18e1",
   "message": "Because I work there",
   "created_utc": 1692226954,
   "score": 3,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi1oa2",
   "message": "Flesh eating bacteria on my legs. It.was razor burn.",
   "created_utc": 1692227134,
   "score": 66,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi3b99",
   "message": "I was playing with nerf guns with my brother. We liked to pretend we were in the matrix and dodge the darts. I threw my head right into the corner of a chair, and needed stitches right above my eye. My high school graduation was the next day.",
   "created_utc": 1692227813,
   "score": 43,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi3g16",
   "message": "one of my dogs attacked the other and in an effort to break them up, i stuck my hand inside the angry dogs mouth. ended up with 6 stitches in my hand and 2 days off work. \n\ndon’t stick your hand inside an angry dogs mouth. ever.",
   "created_utc": 1692227868,
   "score": 60,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi3q73",
   "message": "I was working as a ticket caller/window cook on a kitchen line with another window cook, he was opening a bag of soup with a knife as I was reaching up to grab an order ticket coming in, he ran right through the bag of soup and just stabbed me, right above the elbow all the way to the bone. I drove myself to the hospital, and the restaurant covered the bill thankfully.",
   "created_utc": 1692227985,
   "score": 42,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi41fv",
   "message": "SSRI meds gave me mania didn’t need the SSRI meds",
   "created_utc": 1692228115,
   "score": 3,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi5qis",
   "message": "To born",
   "created_utc": 1692228823,
   "score": 3,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi5tqf",
   "message": "First weekend at boarding school, glued my eye shut with nail glue (fingernail). The wait at the ER was so long it just opened on its own and we went back to school hahaha",
   "created_utc": 1692228860,
   "score": 37,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi96zo",
   "message": "Anxiety attack.",
   "created_utc": 1692230286,
   "score": 1,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwiavuq",
   "message": "I was like 16 or 17, doing dishes one night when I still lived at home, and I passed out. I also ended up slamming my head on the ground. I woke up to my parents with the paramedics propping me up on our recliner. After I barely responded to any stimuli, they rushed me to the hospital to figure out what was wrong. \n\nI’m getting my shirt cut open, there’s wires being hooked up to me and a catheter gets shoved in, not fun when you can still feel pain but not react. I get intubated on Monday? And wake up Wednesday still in the hospital. Once I woke up, my parents tell me everything. Apparently once I was out at the hospital, I had a massive allergic reaction to the anesthetic they gave me and i broke out in hives. So that took a whole day to fix, and they still had no idea why I passed out. They did x-rays and scans and saw no damage to my head from hitting the ground, but the doctors realized I was severely backed up in my intestines. \n\nSo once I was stable enough for the doctors, you know what they did? Enema. For anyone who hasn’t had the pleasure of getting one, they basically shoot a water solution straight up your butt and ask to hold for 10 minutes before you go. I think I held it for maybe 5 before rushing for the bathroom. To this date, that was one of the longest and most painful bout of anal evacuation I’ve ever had. Somehow I was so backed up that my body couldn’t handle it. Now I poop daily to never have to deal with that level of drama, and embarrassment, again.",
   "created_utc": 1692230998,
   "score": 1,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhsmcb",
   "message": "Punched a cinderblock, doctor didn’t do shit either, could of gone to rite aid, bought an ace bandage and a magazine, head behind the store and score some real painkillers, dude gave me dog advil!!!!🤦🏻‍♂️",
   "created_utc": 1692223528,
   "score": 5,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhur9h",
   "message": "The virtual doctor at the urgent care court not tell the difference between a post viral rash or a Margarita burn. Thankfully it was just a Margarita burn. \n\nDon’t let citrus juice get on your skin in the sunshine, guys.",
   "created_utc": 1692224360,
   "score": 6,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhvvp5",
   "message": "I went there when I was feeling totally normal, better than normal, actually. Everyone was all like \"why are you here?\" Anyway long story short that visit was what got me hooked on catheters.",
   "created_utc": 1692224796,
   "score": 7,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhyd0l",
   "message": "What about asking \"What is the stupidest reason you DIDN'T go to the hospital?\"",
   "created_utc": 1692225787,
   "score": 5,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhdc66",
   "message": "🤭 A paper cut! And it almost took my life (according to me) 😭🤣😅😆",
   "created_utc": 1692217992,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhkxi9",
   "message": "Broke my foot while in catechism",
   "created_utc": 1692220679,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhv4ru",
   "message": "My ex husband over slept and made me go to the hospital so he wouldn’t get trouble at work. I can’t remember the reasoning.",
   "created_utc": 1692224502,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhv7g6",
   "message": "I made a wrong turn.",
   "created_utc": 1692224531,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhvc5e",
   "message": "Ugh, for work.",
   "created_utc": 1692224581,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhvwr1",
   "message": "To work as an underpaid janitor",
   "created_utc": 1692224807,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhw8qn",
   "message": "Took kid in with breathing problems, turns out it was mild croup. We were the healthiest people there that night 🤣",
   "created_utc": 1692224939,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhw9k3",
   "message": "I went to the hospital with a couple of friends once because one of them needed a note for work. I was really high too and just remember trying not to make eye contact with the doctor who was seeing my friend, lmaooooo!!!",
   "created_utc": 1692224948,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhwibc",
   "message": "ask what kind of hospitality..",
   "created_utc": 1692225045,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhwt8e",
   "message": "Breaking my arm from using Heelys.",
   "created_utc": 1692225167,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhy2ge",
   "message": "Dehydration - I purely just wasn’t drinking enough water, twice I went to the hospital for a ridiculously fast heart rate and twice they had me drink water/put on a saline drip",
   "created_utc": 1692225668,
   "score": 22,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhyjhc",
   "message": "To work. Stupidest career choice I had. I’m glad I changed it.",
   "created_utc": 1692225862,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhyx11",
   "message": "Heartburn.",
   "created_utc": 1692226012,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhzbme",
   "message": "Ate glue",
   "created_utc": 1692226176,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhzeli",
   "message": "One time I went for XRays because I thought that I had a fish bone stuck in my throat. there wasnt",
   "created_utc": 1692226210,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhzh14",
   "message": "Thought I was having a heart attack. They did chest x-rays and a few other tests. Asked if I recreationally smoked marijuana, told me to stop getting high, and sent me home with a $2000 hospital bill.",
   "created_utc": 1692226237,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhznsy",
   "message": "went to the ER with dizziness. \n\nturned out it was just severe muscle strain.",
   "created_utc": 1692226313,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhzqep",
   "message": "I hit myself in the head with a bat and gave myself a whopper of a concussion.\n\nI leaned over to pick up a ball off the ground while, accidentally, raising the bat as I leaned. It fell on my head.",
   "created_utc": 1692226341,
   "score": 50,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwhzxz2",
   "message": "Extended my arm to crack my elbow like I always do. Something went a little awry and I passed out. My friend lost their shit and called 911 even though I had gotten up and gone to the bathroom and shaken it off. I was literally fine. Took me a year to pay off the stupid ambulance ride. FYI you are allowed to refuse treatment.",
   "created_utc": 1692226426,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi07uc",
   "message": "Playing turkey bowl touch football with my family. My foot (cleat) got stuck in the mud on a passing route and my body kept going...I had multiple fractures and dislocated my ankle. Required surgery. I played tackle football my whole life and never got hurt anywhere close to this! FML",
   "created_utc": 1692226538,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi0b67",
   "message": "Took a new kind of over the counter medicine that I've never really taken before and got an upset stomach, throwing up and all, decided it's better safe than sorry and stopped by the hospital just to make sure nothing was amiss. \n\n$7,000 for an IV drip and like, a stomach pill. \n\nAmerica.",
   "created_utc": 1692226576,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi0gsj",
   "message": "I took some Alka-Seltzer cold stuff a few years back, not knowing it had (and I was subsequently allergic to) aspirin. Put me in the hospital for 24 hours.\n\n\u0026amp;#x200B;\n\nOh and my last mental breakdown was a pretty stupid reason too lol.",
   "created_utc": 1692226638,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi0kmd",
   "message": "Woke up after a party where I was drinking all night really thirsty. Had no water available only think we had was an energy drink. Drank the energy drink then had to meet my buddy who had my car keys at a Starbucks. I took a venti iced cold brew. Got and thought it would be nice to mellow out with some weed, food, and take a nap. Well the weed put my heart into overdrive. I couldn’t sit or stand because I thought my heart was gonna explode. I was home alone and my roommate wouldn’t be home until the next day. In my panic, I went to the ER. They told me there was nothing abnormal about my heart rate, but they did give me fluids and let me stay in a bed until they discharged me.",
   "created_utc": 1692226683,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi13w7",
   "message": "To avoid family drama ... \"Hmm. This cut on my leg looks infected. Better go to the ER.\"\n\nJust left everyone to their fighting and bridge-burning.",
   "created_utc": 1692226903,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi14j0",
   "message": "\"My insurance has a nurse line and she said I have to go to the ER immediately because the blood wasn't clotting.\" The ER agreed with me that I didn't really need to be there, but it wasn't significantly more expensive than Urgent Care since I just needed surgical medical supplies for closing wounds when all I had was first aid medical supplies for closing wounds (ie not quite stitches, but this mesh that wasn't available at Walmart).\n\nThey used me to train the nursing student though, so I think everyone was okay with this situation.",
   "created_utc": 1692226910,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi15bd",
   "message": "Increasing stabbing pain in leg. In severity and frequency. Stopped as soon as I got to the doctor’s appointment. Never reoccurred.",
   "created_utc": 1692226919,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi18ml",
   "message": "Trying cannabis for the first time and freaking out",
   "created_utc": 1692226957,
   "score": 2,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi5vd2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi25ta",
   "message": "When I was 3, I lied to my mom that I had swallowed a penny. I told her I found the penny on the floor and ate it. We went to Bellevue in NYC, and we were in the waiting room a looooong time.  She was tired from work, hadn't eaten, and after x-ray I had to fess up that I didn't swallow a penny. I don't believe she ever forgave me, and she certainly didn't believe what I said about much of anything, going forward.",
   "created_utc": 1692227336,
   "score": 81,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi4kdl",
   "message": "I was a single mom with my first baby, parents had passed away and I was genuinely alone. The baby projectile vomited so I called an ambulance......... I took my baby to the hospital because he threw up.",
   "created_utc": 1692228335,
   "score": 88,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi2okf",
   "message": "Kayaking in flood water rapids for the first time on a river. I didn't actually screw up, but my brother did. He went ahead of me and when I came around the corner I saw him stuck sideways on some brush that outlined the only path through. I had to try a route way up against the side and a little rock peeking out. Well, it wasn't a little rock, but a boulder. I flipped and was underwater. I put my arm down to prop myself up so I could breathe and at that time the kayak filled with water and went downstream with my body inside, arm stuck on a rock. Ripped my arm off to the point the only thing holding it on was the skin. I had to have a 7 hour surgery to repair everything that was torn.",
   "created_utc": 1692227550,
   "score": 46,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwiay7o",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwk2txm",
   "message": "Once I decided to have a competition with my friend, who could drink 24 bottles of water the fastest. After chugging 18 bottles I felt like I was about to explode. I was sent to the hospital and felt completely terrible",
   "created_utc": 1692268104,
   "score": 81,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi7goh",
   "message": "About 24-years ago, I ate almost a whole quart of Korean kimchi for dinner. It was so peppery, spicy and so good, I just couldn’t stop eating it. \n\nThat night, I experienced the most excruciating stomach pains, much worse than when my appendix burst 10-years ago. It was so bad, I stripped off all my clothes and sat in my boxer briefs on my front porch step writhing in agony holding my now bloated stomach.  \n\nMy wife finally took me to the ER and they put an IV in my arm with some pain killer and admitted me for a 23-hour observation. As the night went on, the pain subsided and I finally started feeling better.\n\nFast forward to the morning and I was feeling much better and pretty much back to normal. As the hospital was preparing to discharge me, the night shift was replaced by the daylight shift and a few nurses came in to check on me followed by the new attending ER doctor, a Korean! 😳\n\nHe was smiling, chuckling and laughing telling me I had suffered from “kimchiitis” and proceeded to lecture me that kimchi is supposed to be a side dish to a meal, and not the main course! I really made his day, and everyone, including my sleep-deprived wife who sat with me the whole night, were laughing,  shaking their heads, and grinning at my stupidity.\n\nTo this day, I still wonder if that Korean ER doctor used my case as one of his funniest ER stories.",
   "created_utc": 1692229550,
   "score": 76,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwiq40h",
   "message": "I’m an er doc.\nAbout once a year I see a very nice young female who comes to the er with three or four family members because her fingers are blue. They have always googled all sorts of fancy and exotic diseases that they are worried about. 100% of the time the patient has brand new blue jeans on.\nWithout saying a word I just grab an alcohol swab and wipe the blue dye off of their hands, and then I do the same thing to their jeans to show them it’s the same color.\nThe collective sigh from the family is always what does it for me.\nNot surprisingly, half the time the patient doesn’t believe me and is angry that “we did nothing.”",
   "created_utc": 1692237395,
   "score": 42,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwiih6s",
   "message": "Once at work I pooped so hard when I stood up I fainted. I woke up in the hospital with a massive goose egg and a dislocated collar bone. I needed a cat scan and physio. All because I pooped too hard.",
   "created_utc": 1692234181,
   "score": 36,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi4jbp",
   "message": "My poop was violently, aggressively, dark red.  For the record, I did *not* know that would happen if you ate a whole jar of pickled beets, and I learned that it is *not always a good idea to say the first things that come to mind!* (Yay ADHD?)",
   "created_utc": 1692228323,
   "score": 31,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwj3gk4",
   "message": "So, I had this in grown hair from shaving my balls. I noticed it in the shower and figured I'd go ahead and pop that.\n\nA few days later, my balls are in extreme pain, I decided that I'd go to a walk in clinic and get checked out. FYI, there is no dignified way to tell someone that you have very sore and very swollen nuts, but I did my best. I go see the doc and show him what's up, he says in an alarmingly concerned tone, \"Oh that is very infected\". He asks what happened and I tell him, he informs me that you should never pop any ingrown hair, but especially in that region, because if it doesn't pop, the infection goes inside. \n\nHe gives me some medication and informs me that I may develop an abscess, and if it does, to come back and he'll drain it.\n\nSo I do the medical regime he prescribed, and it starts to feel mildly better after a couple of days. I get out of the shower and notice that the area has indeed formed an abscess. It looks like a piece of raw chicken skin and I think, I can probably just knock that off and, before I know it, it is off.\n\nBlood. \n\nBut also, no more pain. I'm feeling pretty good about myself, already with a jaunty song in my heart I'm ready to start my day - that is until I see the dime sized hole in my scrotum. \n\nAfter the panic finally subsidies, I realize I can't just put on clothes, as something might get in there. I find a bandage that'll cover it and head to the emergency room.\n\nMuch like telling someone your balls and very sore and swollen, there is no dignified way to tell anyone you have a dime sized hole in your sack. However, fun fact, if you tell someone you have a hole in your scrotum, YOU GO TO THE FRONT OF THE LINE!\n\nSo, I leap frog ahead of a bunch of old ladies to get an ultrasound, all of which are glaring at me. They slather me up and take a look. I asked them if it was twins, they do not laugh.\n\nSo after having my balls handled by no less than 7 people, which is normally a pretty awesome Friday night, I figure I'm patched up enough to go home, but they tell me I have to wait for a urologist. This takes some time and I'm curious as to what they're looking for.\n\nOh. Well, we just want to make sure there are no signs of gangrene or flesh eating disease. Ah. Ok. Uh. Great. \n\nThey check me over, admonish me a few more times for squeezing an in grown hair, and tell me that as long as I take all my meds, I should be alright, which I was. \n\nWorst birthday ever.",
   "created_utc": 1692243567,
   "score": 25,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwideh8",
   "message": "Okay this is a little embarrassing but kind of funny now when I look back on it. \n\nMy kid had just started walking and figuring out how to take things apart. We were sitting on the floor and I  heard a thunk on the floor which turned out to be the remote. The back wasn't on and there was a battery missing. I had my eye on my kid the WHOLE entire time but being a first time mom, my mind started to go crazy and I searched for the battery. I searched high and low through the whole entire area of the living room, I'm talking took of couch cushions, knifed open the bottom of the couch, opened pillows, took apart anything that opened ( boxes, cars, blocks, etc) I could not find this battery anywhere. I had just recently read an article about a family who's kid swallowed one of those small circle batteries without them knowing and the child ended up passing away, so you could imagine the amount of sheer panic that started to rise. I went from the living room, to the dining room, to the kitchen, the whole downstairs! I packed my kiddo up, called the ER and let them know the situation and was on my way like a bat out of hell. I was in such a hurry I went in my house slippers and my mom moomoo because I was so scared my kid swallowed said battery. They immediately pull us back, took vitals and calm me down to get the whole story before putting us in a room to take my kid back to do X-rays. We are in the room for less than 5 minutes when I grabbed a paper-towel to wipe the boob sweat I had dripping from my boobs down my belly (I have huge boobs so the sweating was absolutely disgusting at this point) and out fell the missing battery out of my sports bra.. I felt so fucking stupid, but also so relieved that my kid didn't swallow a battery. It was a triple A battery so I thought the chances were pretty low but not being able to find it made me crazy. Everyone in the ER got a good laugh that day and my partner who was away on a job was extremely relieved but also got a good laugh. It took me a long time to tell anyone what had happened because I felt so dumb lol! The hospital was nice enough to not charge us though, so I'm thankful I didn't have a painful cash reminder of how dumb I felt hahaha.",
   "created_utc": 1692232054,
   "score": 22,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwif734",
   "message": "When I was 10, I wanted to go to my friend's house. My older sister who was watching me at the time wouldn't let me, so I did the reasonable thing and jumped out my second floor window. You wouldn't be surprised to learn I spent most of my childhood grounded.",
   "created_utc": 1692232810,
   "score": 22,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwi49zt",
   "message": "High as fuck playing swords in the forest with sticks, got one through the hand.",
   "created_utc": 1692228213,
   "score": 20,
   "submission_id": "15t13m5"
  },
  {
   "comment_id": "jwjifwk",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15t13m5"
  }
 ]
}