{
 "submission_id": "15tejzd",
 "title": "How did you come out of poverty/being broke?",
 "selftext": "",
 "created_utc": 1692251998,
 "permalink": "/r/AskReddit/comments/15tejzd/how_did_you_come_out_of_povertybeing_broke/",
 "score": 171,
 "url": "https://www.reddit.com/r/AskReddit/comments/15tejzd/how_did_you_come_out_of_povertybeing_broke/",
 "comments": [
  {
   "comment_id": "jwjiw2l",
   "message": "Bruh. If you find out, let me know. I thought that \"as long as you work as hard as you can, you'll have a good life\", but boy was I wrong.",
   "created_utc": 1692253004,
   "score": 37,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjhxe6",
   "message": "Finished grad school, got a decent paying job, but continued to largely live as if I was broke.",
   "created_utc": 1692252311,
   "score": 186,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjk1qc",
   "message": "live like im still paycheck to paycheck",
   "created_utc": 1692253844,
   "score": 43,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjk3yh",
   "message": "We were low middle class - father was a school teacher and mother a home maker…we were not poor….we did not have many comforts taken for granted now - no electricity, no running water and no modern toilets in the house…which was rented…we slept on the floor with some thin reed mats and bed sheets providing some cushion…\n\nWe ate simple food (whether that is nutritious or not), had some simple clothes - a few pairs tailored each year coinciding with the festivals…went bare foot many times (because the foot wear did not last long and could not be replaced as often as needed), went to government schools because they were free…walked to the school and back….and went to government doctor or a semi-qualified private practitioner…when sick…\n\nWe first came to a big city and lived in a rented house that had the normal facilities - electricity, running (tap) water and toilets that could be flushed….I was 14 years by then…it felt good and listening to a radio in the house was real fun…there was no TV at that time - 1962…that came much later….some time in 1978 or 1979 in my case…a black and white TV but that was a deluxe model….with good picture and sound…similarly fridge also came around that time…I was already well employed by then and added these because I got married in 1978 and wanted to keep my wife happy….she came from a well-to-do family and was used to these things…as also dining tables, proper beds, mattresses etc…\n\nHowever, my simple childhood stayed with me and enabled me to live simply even in the midst of fairly good salary….\n\nEven now I can and do lead a simple life though I can afford much more expensive things…my children and their children are more used to better living conditions and will not be able to live like ascetics…",
   "created_utc": 1692253889,
   "score": 70,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjtlo5",
   "message": "Read, learned, exercised, went to night school, got a GED went to university (got a loan for that) learned to live on beans and rice for 6 years got a contract job in my industry worked, studied, learned took every minute of work that came my way. Gained the trust of the middle class people around me, made them believe I wasn't some white trash loser, read learned exercised, saved up $10,000 started my own buisness, struggled for years, failed many times and finally got here. I am 52 and still working 6 days a week 12 hours a day. Sad but true. No easy options for me, unfortunately.",
   "created_utc": 1692261134,
   "score": 28,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjv0my",
   "message": "Being at the right place, at the right time, talking to the right people.\n\nYou can be the most talented person in the world, but if you don't know how to play the social game, and have a lot of luck it sadly isn't going to happen.",
   "created_utc": 1692262254,
   "score": 163,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjk4ex",
   "message": "Taught myself a second language between the ages of 16 and 17, impressed some Rotarians and they whisked me away from the horrors of the trailer park and made me an exchange student. So then instead of being a trash man or at best a truck driver, I became a linguist.\n\nOf course later in life I reverted back to abject poverty but that's a different story.",
   "created_utc": 1692253899,
   "score": 167,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjk26w",
   "message": "I sacrificed time with my family to work extra hours. Yes, it was worth it, but it still hurts when my kids tell me that the only memories they had of me in those times was of me sleeping or being at work.",
   "created_utc": 1692253853,
   "score": 87,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjqxwm",
   "message": "Grew up poor. I am good at learning and my country has affordable education. Getting into university is a matter of getting a diploma from the right level high school, which I did. I then went to university and got a good job. I now pay more in taxes than my education cost the government.\nIt should be that simple anywhere.",
   "created_utc": 1692259042,
   "score": 250,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjtc39",
   "message": "I worked hard, didn't spend much, put money on the side when I could, worked even harder, tried doing many different things to earn money, diversify baby !\n\nThen my mom gave me 100 000€ because she sold her house for way more than what she paid for it in the 80's and had money to spare.\n\nSo I bought a small house in a village where life is cheap, and now I just work part time. Crazy how life is so much easier without mortgage or rent to pay.  \n\n\nPS: if you wonder, the working hard and harder never gave me anything, I was still desperately poor, everything I did either failed or brought such little income it barely paid my bills.",
   "created_utc": 1692260926,
   "score": 47,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjqvvr",
   "message": "My Mum worked 3 jobs to put me through uni, I worked a job at near full time hours. If I wasn’t at uni, I was at work. If I wasn’t at work or uni, I was studying. If I wasn’t doing any of those things I was sleeping. Literally had no social life. \n\nAfter uni I got an entry level job in my field (Marketing) and still worked a second job on top of that so I could make ends meet. Eventually I moved into the Marketing team at big corporate retailer and worked up from there. I didn’t quit my second job until I started making over $80k/year. 3 years later and I now earn $135k/year at the same company and love it. I also own an investment property with my brother and SIL, shares, a motorbike and was just able to purchase a new vehicle in December last year (I have ALWAYS gotten the hand me down cars from family members). \n\nIt was not easy. It was fucking hard. I missed out on so much in my late teens and early 20’s to make sure I could get ahead. There were times that I had to ask Mum and Dad for help here and there which at the same time, they were just getting their own businesses off the ground. \n\nI did all of what they tell you not to do (was first in the office, last to leave. Always said yes to extra work even though there were times I thought I could be taken advantage of etc.) and it paid off big time. I have never been on major overseas holidays (Europe, America etc.) and instead used that money for my down payment on my investment property. I am also open and honest about the fact I wouldn’t not have been able to afford the investment property without my brother and SIL going halves with me and I’m forever grateful for that. \n\nThe sacrifices I made help me sleep at night because I now know I’ll never live paycheck to paycheck ever again.",
   "created_utc": 1692258997,
   "score": 122,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjutu9",
   "message": "Sacrificed comfort and focused on getting the bare minimum of what I need and how to get more money.\n\nI at ramen and bread, slept outside, and took a shower when I could. I got a job at Wal-Mart, then Ross, the clothing store. Found a cheap motel to stay at with the girlfriend and we scrimped and saved.\n\nBut $33 a night on a $50 a day salary eats at you and it was impossible to save. Like it would have been years before I could have afforded just a car to make sure I got to work on time.\n\nSo I moved into my fathers place and could save up for a car. They paid for my TESOL and I used a lifetime of miles from flying between my mother and father to get a ticket to Poland, sold the car and found myself eating potatoes in Polska till i got a job teaching English. Then the gold(PLN) was steady.\n\nMoral of this story is that poverty is a scary fucking thing and its really hard to get out of it without friends and family.  There's no easy way out and the longer you're there the deeper the holes get especially if you start borrowing money.\n\n\nI still like to travel on nothing sometimes though. Hitch-hike, couchsurf, and eat nothing but bread for months.",
   "created_utc": 1692262109,
   "score": 182,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjx0bx",
   "message": "I saved up. Stoped buying weed and booze. Stopped getting books. Stoped paying for Netflix. All I spent money on was food and home “dads house”. My dad waisted all his money my step mom didn’t worked and when she did she worked 2 hours and stole my money. I got done with it. Stoped buying anything but what we couldn’t live without.",
   "created_utc": 1692263819,
   "score": 15,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjic41",
   "message": "I didn't",
   "created_utc": 1692252605,
   "score": 13,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjy0fh",
   "message": "Luck. There was a fair bit of hard work involved, but we’d never have made it without a generous amount of luck.",
   "created_utc": 1692264584,
   "score": 50,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjw73m",
   "message": "I went back to school at 24 to get a degree in cs, got an internship at a big tech company and converted it to a full time offer at the end of the internship. Now I make insane money.\n\nI worked full time with a lot of mandatory over time during the entire period I was in college. It was brutal, but ended up being worth it.",
   "created_utc": 1692263189,
   "score": 40,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk92sj",
   "message": "Taking a loan and going back to school, studying hard, making good grades, getting an industrial degree, and moving 1,000 miles away from everything I know. It was terrifying, the biggest leap of faith I’ve ever taken. It was a calculated risk but I was dirt broke, and had skipped meals for years. Making that decision at 22 changed my life. Now 10 years later I’m happily married, a home owner, and make over 100K a year.",
   "created_utc": 1692271983,
   "score": 33,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk5xd4",
   "message": "I got completely clean. Then got a non-union apprenticeship, then went union",
   "created_utc": 1692270127,
   "score": 19,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk9aco",
   "message": "Learned a trade",
   "created_utc": 1692272100,
   "score": 57,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjqug1",
   "message": "My mom died and I inherited some money",
   "created_utc": 1692258965,
   "score": 33,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjkux9",
   "message": "By not allowing yourself to be content (yet), hustle every night and day until I can provide for myself and my family. Accepting any job (it can make a lot of connections), being humble about your journey, and always looking back at where you came from",
   "created_utc": 1692254435,
   "score": 14,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjr1r4",
   "message": "Just get some money /s",
   "created_utc": 1692259128,
   "score": 2,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjzn35",
   "message": "I replied to a random 21 year old Forex trader who promised me 800% returns on all of my investments…",
   "created_utc": 1692265823,
   "score": 16,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwka3km",
   "message": "After we married, my husband and I bought a small home at the time when it was low interest, we ate cheap and at home, when we had too we cut back on luxuries (Netflix, etc.)We did not go out to bars or night clubs, we paid our bills on time and we didn’t spend money we didn’t have. And we worked our butts off.  Now my husband owns the business we work for we have three homes (two we rent out) and I became a stay at home dad.",
   "created_utc": 1692272549,
   "score": 41,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjkn06",
   "message": "I'll let u know when I get there hahaha #brokeassbitch",
   "created_utc": 1692254275,
   "score": 4,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjq4xd",
   "message": "Got a job as delivery driver for a data processing company. During slow times I talked with the computer operators and programmers, learning how to do those jobs. Earned promotions on those fields.",
   "created_utc": 1692258412,
   "score": 2,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjsiyd",
   "message": "My mom died and I inherited some money",
   "created_utc": 1692260293,
   "score": 2,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjl6y3",
   "message": "Kept getting promoted and living like I was still making minimum wage, eventually meeting a girl who moved into my one bedroom cheap apartment with me and splitting the bills.",
   "created_utc": 1692254687,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjjipn",
   "message": "I used to spend my days partying and clubbing in Asia.  Tons of fun.  \n\nI wasn't getting any younger, so I quit that and moved back to the states.  Learned to weld.  Then an opportunity came along for a tech job, but it required me to go back to Asia to train for 6 months.  So I trained and partied for another 6 months.\n\nNow I'm a field applications engineer in the semiconductor industry in silicone valley. \n\nLife is sweet lol.",
   "created_utc": 1692253456,
   "score": 255,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjikq1",
   "message": "nsfw work (sw)",
   "created_utc": 1692252775,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjna64",
   "message": "Eating supermarket own brand noodles for about 3 months.",
   "created_utc": 1692256225,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjvdu9",
   "message": "I was in some good places where rent was pretty cheap and was able to save up money…. Those places don’t exist now",
   "created_utc": 1692262547,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjydxo",
   "message": "I got a teaching job in China. Despite what a lot of redditors will tell you, it's a good gig.",
   "created_utc": 1692264871,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkecfp",
   "message": "By working my ass off and not being a moaning little bitch and demanding the government give me free handouts",
   "created_utc": 1692274745,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjievw",
   "message": "I got my money up not my funny up \"growl\"",
   "created_utc": 1692252660,
   "score": 0,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjva6u",
   "message": "Wait we can do that?",
   "created_utc": 1692262466,
   "score": 0,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjm2hf",
   "message": "I did 20 years in the military. I finished college \"worthless waste of time\". Then I worked construction. Nothing pulled me out of poverty. I have nothing.",
   "created_utc": 1692255335,
   "score": 0,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjnz6s",
   "message": "Can anyone here give me a brick of hundreds?",
   "created_utc": 1692256746,
   "score": 0,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjoil5",
   "message": "Currently in poverty. Don't know if I'll make it out! 😁",
   "created_utc": 1692257154,
   "score": 0,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjv5hz",
   "message": ". Following",
   "created_utc": 1692262362,
   "score": 0,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjvr1a",
   "message": "You can't, at least not legally.",
   "created_utc": 1692262839,
   "score": 0,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk0bcb",
   "message": "I pulled myself up by my bootstraps! /s",
   "created_utc": 1692266322,
   "score": 0,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk0h51",
   "message": "I started a company.  Had about $70k in cc debt at one point.  No health insurance. Huge negative net worth.  Considered food stamps. Borrowed against house repeatedly.  Credit score very bad. No doc loans at very high rates. \n\nHouse went up in value.  Company succeeded and sold it.  Wife divorced me and took a lot of it. Bought more houses. Etc. \n\nLuck beats skill.",
   "created_utc": 1692266439,
   "score": 0,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk1qmb",
   "message": "i will let u know once i come out of poverty",
   "created_utc": 1692267349,
   "score": 0,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk1rdl",
   "message": "I started helping the Department of Defence blow people up in Afghanistan.",
   "created_utc": 1692267364,
   "score": 0,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk2hqf",
   "message": "Hopefully, when ukraine gets enough of our money.",
   "created_utc": 1692267872,
   "score": 0,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk0tw0",
   "message": "Pulling yourself up by your bootstraps. Obviously \\s",
   "created_utc": 1692266698,
   "score": 255,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjlcxo",
   "message": "\r  \nShe changed her job to a more paid one, began to develop in order to open a business in the future",
   "created_utc": 1692254810,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjrcov",
   "message": "I was brought up in poverty. I went to college and decided that I wanted to have more material goods in my life. I ended up finding some thing I wasn’t good at, sales. So, I stuck with that ended well. TBH socially I did have a hard time for many years fitting in with the upper classes, but eventually I started getting the hang of it",
   "created_utc": 1692259371,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjsc2n",
   "message": "\u0026amp;#x200B;\n\nthis came up in another thread... my response:\n\n\u0026amp;#x200B;\n\n\u0026gt;Grew up in NYC during the crack era...early 80's to 91. Poor first gen immigrant family. By the time I was 12 I had seen 2 shootings and a stabbing.  \n\u0026gt;  \n\u0026gt;Family decided to move to NJ because it was safer. It was by comparison but we were still in the hood. I was always a curious kid and really wanted a computer but we couldn't afford it.  \n\u0026gt;  \n\u0026gt;The projects I lived in had a summer program for the kids to keep them off the streets. They would bus us to a community college and teach us computers. We would clock in like a job and we would get paid like $300 a week.  \n\u0026gt;  \n\u0026gt;I think that really sparked my interest in computers. I graduated high school, but dropped out of college. My first job in tech was doing support for a pos system company. Cut my teeth on that job. Then I moved on to consulting and started my own company.  \n\u0026gt;  \n\u0026gt;Did that for a few years until one of my clients asked me to come work for them. I closed shop and joined him... Until he got arrested for insurance fraud 5 years later.  \n\u0026gt;  \n\u0026gt;After that I applied to one company and got the job right away. I've been here 7 years now and I love it. Work life balance is great and I don't want for money.  \n\u0026gt;  \n\u0026gt;I'd like to think I've come a long way.",
   "created_utc": 1692260142,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjswqf",
   "message": "i chose an \"easy to get\" job (nurse assistant). \n\ni earned enough money to life my life humbly and i got \"richer\" every day (stress-tolerance, competence, friends, stories to tell, social and physical stimulation)\n\n\\- which finally made me \"enough\" of a human to become a nurse and earn serious money with a job that is to my liking.\n\n\"my liking\" was not something to trust to begin with- so \"liking\" was not an indicator of \"good\" for a longer time. \n\nI think that was the most helpful step: focussing on doing what's right and meaningful , instead of \"what i like\", and getting better at it.",
   "created_utc": 1692260593,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwju64l",
   "message": "Well, doing the same job in a different country helped a lot",
   "created_utc": 1692261585,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjubvg",
   "message": "I still spend as close to zero. Having money on stuff you need means not blowing it left right and center. Even if you have a good paying job.",
   "created_utc": 1692261711,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjwe1k",
   "message": "Never grew up with much. Once I started working I kept living by the same standards which was a pretty cheap lifestyle. Most of my money went to savings.",
   "created_utc": 1692263338,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjwqur",
   "message": "1. Hard work\n\n2. Saving every penny you can\n\n3. Rob a bank\n\n4. Take advantage of opportunities as they present themselves \n\n5. Make friends in the right places",
   "created_utc": 1692263618,
   "score": 207,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjxkii",
   "message": "We can do that....are you sure?",
   "created_utc": 1692264248,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjy0o3",
   "message": "Worked as much hours as I could. Bought a car that was great on fuel and easy to pay off. Eat cheaply. Constantly upgrade my skills so I stay marketable. Do free things and try to never use my credit card because I swear my bank makes shit up.",
   "created_utc": 1692264590,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjy82w",
   "message": "Work, save, invest.\n\nTakes some years but you'll get there with constant dedication and discipline.",
   "created_utc": 1692264746,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjy85l",
   "message": "Luck. Boss thought me a nice guy and gave me a decent salary. Had parents who knew that they couldn‘t take the money with them into the afterlife. So they invested it in such a way, that I could profit from, after their deaths.",
   "created_utc": 1692264748,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjyhqv",
   "message": "Worked 2 jobs since 17, lived with my mum till 29, didn’t have kids, didn’t have a relationship, went to uni at 25 still working 2 jobs, live every day like i’m broke.\n\nI’m now working one good job I enjoy, getting married, Travelling about a month each year. I allow myself to spend any money on mum, my wife to be and will admit that I’m now spending money on myself.\n\nNot consumables though! For myself I’m buying nice things that will last a long time. If it’s temporary and doesn’t serve a purpose I can’t justify buying it.",
   "created_utc": 1692264950,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjykl7",
   "message": "Went to university, got my nursing degree, spent a long time in cheap accomodation to save up for a house, got a few promotions at work. I'm now definitionally middle class. Money troubles are nowhere near like what they were. I've made the decision actively to not have children. Those damn things are expensive, so that's saved me a fortune.",
   "created_utc": 1692265011,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjz896",
   "message": "First, I try everything that I can think of doing. I ' m usually in a state of fear and panic. After doing this over and over not only when it comes to money, I've learned to take a different tack. Now, I go to an experience when I was just learning how to swim. The first day was about learning to float. So now, when I'm in a jam where I can't t produce anything good, I think Buoyancy. I literally let go and rely on a sense of Buoyancy to support me and take me where I need to go.",
   "created_utc": 1692265520,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjzb22",
   "message": "50% perseverance and working my way up the corporate ladder. \n\n50% rich Boyfriend who payed for our entertainment so my money could go to paying off debts. \n\nCould have done it without the boyfriend but I would have had to make many more sacrifices so I’m grateful he allowed me to enjoy my life while recovering from poverty.",
   "created_utc": 1692265580,
   "score": 33,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjzda9",
   "message": "University. I'm still paying off my loans but without going and getting qualifications I never would have been able to get the roles I've had (which are only average and still underpaid in my field, but that still feels like a lot when you come from struggle street).\n\nBefore that I was working multiple part-time minimum wage jobs because they were all anyone would hire me for and still living on less than people begging in the streets in the part of the city I lived in. \n\nEven when I started at uni, the loans covered course costs but nothing else, so I couldn't afford to buy paper to take notes on. Instead I used to get scrap paper in the recycling bins by the printers on campus and write around whatever was already on them. \n\nMeanwhile everyone around me was on macbooks, lol.",
   "created_utc": 1692265624,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjzmve",
   "message": "Stock market and cryptocurrency",
   "created_utc": 1692265819,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjzn9l",
   "message": "When I was younger and in low paying jobs I always had a second job. It was exhausting but it did get me set up. Also always lived in shared accommodation (still do at 25)",
   "created_utc": 1692265827,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwjzwpb",
   "message": "Marrying the right person.\n\nEx came from a middle class family and he dragged me up from poverty to the middle class. Even when we were first starting out and broke AF, we didn't FEEL broke AF.\n\nAnd now, almost 30 years later, we're splitting up but he's worried about that (due to my job) I'll end up living in poverty and he doesn't want that for me, so he's willing to give me a place to live, etc so I don't HAVE to live that way again because he knows how devestating it was for me to grow up with such uncertainty.",
   "created_utc": 1692266021,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk02e6",
   "message": "I moved back into my parents place on an agreement that I needed to save money then I'd leave, I had a 5 year plan to pay off my debt and start over. Conveniently I met my wife during those 5 years and it fast tracked my plan to only a year and a half. Afterwards a home was bought, better jobs were had, and a family was started. More hands make less work. I have options now in preparation for pitfalls but I always save aggressively to this day.",
   "created_utc": 1692266137,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk085z",
   "message": "I haven't. I'm still poor",
   "created_utc": 1692266255,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk0es1",
   "message": "I mean I’m less impoverished and less broke? I got on disability. Got tired of trying to work like everyone else and get punished and passed over because of my health issues.\n\nLike, if I’m heading towards homelessness because my health won’t allow me to work 40hrs a week on site then call me disabled I guess. \n\nThe thing is, if more places allowed remote work I could work fine.",
   "created_utc": 1692266391,
   "score": 10,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk0kis",
   "message": "Started to treat my pay as $200 less than what it is.\n\nLike ACTUALLY believe and gaslight yourself that you got paid $1000 when cashing in $1200.\n\nThen after some time, you realize you are not broke anymore.",
   "created_utc": 1692266509,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk12q7",
   "message": "I moved to a new state as soon as I became an adult. I had some help along the way as well or else I would’ve ended up homeless or back in my home city. I got a decent job and worked my way up in a few years to the point I could finally afford everything and be able to save without any issues. I kept living within my means instead of slowly implementing more and more payments like getting a new device every couple years or a new car or spending way too much on hobbies. It’s not like I was making an insane amount of money either but I never let myself constantly try to upgrade to the best thing I could buy at that moment which is what made the biggest difference. Avoid drugs as well they eat up through your money faster than you’d expect.",
   "created_utc": 1692266875,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk16xo",
   "message": "By first focussing on paying my debt asap",
   "created_utc": 1692266960,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk1ay1",
   "message": "Get a second job and that money is only for paying off debts. Learn the difference between needs and wants, and stop doing anything that's not a \"need\".",
   "created_utc": 1692267042,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk1o5v",
   "message": "Got student loans to get an engineering degree, then got a job starting at $100k designing systems for nuclear power plants.",
   "created_utc": 1692267303,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk1ssk",
   "message": "Feed your focus and focus on yourself",
   "created_utc": 1692267392,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk1u80",
   "message": "Learn to do something that not everyone else can do then strive to do that better than anyone else",
   "created_utc": 1692267420,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk2137",
   "message": "You spend, let's say 9h at work total, 8h sleeping, what are you doing in your free time? If you want to have an extraordinary salary, you need to be an extraordinary person. For me, I changed country, learned the language of the country, improved in the previous work, and changed work for a better one. I recomend to watch Jim Rohn, he may help you.",
   "created_utc": 1692267554,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk22k7",
   "message": "I stopped partying all the time and started saving my wages instead I was young and had a legendary time though.",
   "created_utc": 1692267582,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk2xfs",
   "message": "Some combination of hard work, luck, and a willingness to take moderate risks.\n\nAlso, leaving my hometown in Appalachia to move to a city was one of the best decisions I’ve ever made. If the local economy is bad, you will work yourself to death for scraps.",
   "created_utc": 1692268171,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk3023",
   "message": "I quit my job, moved back to my parents. Started new study. Started new job with bigger pay and  working 50h/w. Cut most of my expenses 1nd now building back up",
   "created_utc": 1692268221,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk35lo",
   "message": "I had about £100 disposible incime a month then bills went up and my position was untenable without going into debt to survive so I swallowed pride and moved into shared accommodation from a small bedsit, slashed my bills by half.\n\nThen I gradually worked my way up careerwise whilst still living in a small single room, once I had enough, I moved out into a 1 bed flat, now I'm still in said flat but saving up for a mortgage deposit.",
   "created_utc": 1692268329,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk3f2s",
   "message": "I moved from Greece to Scandinavia. 7 years later I have a house 😁\nI moved from a country of piss poor wages to two that pay properly.",
   "created_utc": 1692268507,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk3jjd",
   "message": "Forex",
   "created_utc": 1692268588,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk3ntf",
   "message": "By the grace of God, my dudes.",
   "created_utc": 1692268668,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk46un",
   "message": "Take three tablespoons of hard work, a teaspoon of determination, a pinch of talent and then whisk it into about a gallon of dumb, blind luck. \n\nSeriously though, your path might look very different from anyone else’s, there’s no guarantees but also no wrong paths. \n\nThe one thing that is probably universal is learning how to manage your finances. It’s much easier to save money once you have money but there are still small things you can do that add up over time.",
   "created_utc": 1692269018,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk47ys",
   "message": "This was my grandfather's story and well makes me cry every time I tell it \n\nMy grandfather grew up in a town in Poland called Kelts. His father was a butcher and ran this butcher shop in the town. He helped his father all the time up until the war   (I'm cutting out the whole Holocaust part for story reasons since this is about how you got out of poverty/ being) \n  So by the end of the war my grandfather moved to Canada with his now wife/ my grandma and well they were looking into finding work well my grandfather's cousins own businesses in Toronto garment factories in the garment district. Well my grandfather went to work for them. Pay was good enough to make money  to purchase a house. Something better that he had in Poland My grandfather for years worked his ass off helping to provide a life for both his daughter and son. In his older years he worked as a tailor in a local laundromat with this really sweet guy. Even in my grandfather's older years, he refused to retire. He tried to keep working in the late 80s early '90s it was just he was too weak to continue so he started running a small tailor shop out of one of his bedrooms to make some extra money . Yep, my grandmother told him to just relax and enjoy retirement since the garment factory gave him benefits. Even had a nice retirement fund and something equivalent to a 401k so my grandparents were living pretty comfortably up in Toronto. They had a nice house and they treated the family pretty well. Sure my grandfather had a temper yet he loved his grandchildren and his family. When they say provide for your family a better future, that's what my grandfather did. Yet my grandfather was also somewhat of a jerk that I heard from my father he put in the will that when my grandmother passed away his children and grandchildren will only get $1,000 and as for the house they want the house sold not kept in the family and any money made from the sell of the house will go to a charity of my grandfather's decision and he chose a Jewish organization that helps young people, which surprisingly was still around in the mid 2010s in Toronto .  \n\nMy grandfather left behind this moral. If you work hard you could try to get some. It doesn't mean you're going to do well. You're maybe that $1,000 was a starting point for everyone for the grandchildren since maybe he wanted us to invest that money or something yet? I burned all the money I got. Same for my cousins. They burn their money on useless crap except one. I think I heard one of my cousins, my dad's oldest nephew invested money for my grandfather into some good tech stocks and made some decent money out of the $1,000 he got not much to live comfortably but enough to kick him off",
   "created_utc": 1692269040,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk4jjt",
   "message": "I grew up with drug addicted/alcoholic parents. I've worked every day since I was 16 and stay far  away from my family.  My wife and kids are my rock and keep me working hard and pushing to be better. Pro tip: leave your small town and never look back. Take control and grab life by the horns.",
   "created_utc": 1692269251,
   "score": 198,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk4nxy",
   "message": "got a bf who's in IT lol",
   "created_utc": 1692269332,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk4xou",
   "message": "Act broke stay rich man. My husband and i are both 21 going on 22. We aint even rich but we not in poverty and its all about spending your money responsibly and not aiming and spending for things you just cant afford. Get roommates, stay at home, save your money. Stop eating out, learn to cook, meal prep. We learned the hard way that its not worth spending and constantly being broke for stuff that dont last. \n\nSacrifice going out and spending time with friends for making money or studying to make your schooling worth it. Stop turning down jobs because they're not what you want right now. Take the job, earn the money. Get your priorities straight.\n\nWe didnt invest, we havent really started a business yet but went and got a short cheap technical degree in a good field and bam here we are, no payments on where we live, no debts on anything besides hospital which is being paid off. Currently saving to hopefully buy a house within the next 2 years.",
   "created_utc": 1692269501,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk502y",
   "message": "In my late twenties I was broke and working shitty jobs pretty much of my own doing.  At one point I went to take $ out of the atm for gas and food money and i guess some yearly expense i forgot about meant all i had left to take out was 8$. \n  I had to walk to and from work and I ate cheez whiz toast for the remainder of that week.  I was a fucking mess..and it was 100%my own fault.   \n\nHad to move into a shitty basement room for a year.. and when i say basement room i mean the room where the furnace is.  Reined in my expenses sucked it up and worked shitty retail jobs.  It sucked being early thirties now folding mens shirts and seeing old schoolmates recognizing me.. their look said it all.. what a loser.  Kept working eventually got enough experience to move onwards and upwards.  \n\nFound a temp agency that got me my first office job.  It sucked and was demeaning but it paid a lot more (for me) and i just wrecked face at it.  I did anything.  Temp job became permanent job.  Alnost paid off my unfinished college debt (o ly thing worse than graduating with student loans is not graduating)\nEventually worked my way into another temp job but paying more and in an industry i wanted.  Excelled and turned a four week temp into 11months.. then got hired on contract.  \nThen permanent govt job.  \n I now make just barely six figures and keep my backstory secret.    Im sure others have had it rougher but what stings is my situation was 100% of my own making.. but it sure sucks seeing the parade of young adults walking into my field and clearly the obly reason they are there is they got a good education from family connections and had zero adversity.  Ah well.  I worked my way back into the game and it took a while.. im fifty now.. \n\nTldr recognize what you can and cant do wirk hard work your way up.  Might take twenty years like me but its worth it.   Take any opportunity nothingbis too demeaning if it pays.  Build up experience as you go and parlay into a better opportunity.  Good luck.",
   "created_utc": 1692269543,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk5f1w",
   "message": "come out? 👀",
   "created_utc": 1692269806,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk5mau",
   "message": "Grew up in a state with strong institutions so I was able to go to a quality state university for basically free, then when I realized that wasn't enough, I qualified for food stamps and Medicaid to sustain my family (which i now had at that point) and me while I went back for a graduate degree and worked full time.\n\nAlso, insane amounts of luck at every turn, which largely boil down to basically the real life equivalent of rolling 20s on CHA checks at key moments.",
   "created_utc": 1692269935,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk5q0h",
   "message": "Oh, this actually seems applicable to me...\n\nI was homeless at 16, drug addict and all that jazz.\n\nOn the street for about 9 months, with nothing to my name except an old moped (which I siphoned fuel from other vehicles to top my bike up). The engine kept me warm at night.\n\nIt took a long time to get into housing. I would go to the council office every single day and ask the status. I did this for months.\n\nI was eventually put into a foyer. Where other delinquents like me were living.\n\nAfter I got a roof over my head, I started looking for education. Since I was receiving dole money, a job wasn't something I was looking for.\n\nI got lucky, and scored a scholarship in music college.\n\nFrom there, it was just on the up. I was 're-housed' to a YMCA... *worst experience of my life*. I was living next door to a kid who was just released from prison, on tag. He would be banging at my door throughout the night trying to get in. He and his cronies also jumped me while I was out nearby, sent me to the hospital. \n\nI do not recommend the YMCA.\n\nAfter which, I was put into shared flat housing. \n\nOnce college started, I managed to share a flat with a college friend. He was working at the local shop, and got me a job. So I was working part time and in college. Earning enough money to get me by (pot noodles for dinner sort of thing).\n\nOnce college finished, I left the city and went to live with some family elsewhere. Now that I had a bit of education, didn't look like a hobo anymore, and had some work experience... I managed to land a full time job.\n\nAnd it just went on from there. The job was shit, my boss was shit, the money was barely minimum wage, but it got me by until I met my (now) wife online, and moved country and started my career from scratch.\n\nNow I'm living comfortably, recently bought a new car outright after saving up. \n\nIt was a long road, getting from there to here. But I wouldn't change it now that I know where I would end up.",
   "created_utc": 1692269999,
   "score": 58,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk5rh1",
   "message": "Never stopped",
   "created_utc": 1692270025,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk5yon",
   "message": "Start a service business. Anything. Got pools around you? By the end of next year you can be living large.",
   "created_utc": 1692270150,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk5yr0",
   "message": "Good scholarship to private Uni, got the first major related job by being able to talk to ppl not necessarily skill. Made a bunch of connections. Those connections got me references and doors opened to other better paying jobs. Never burn bridges. Words are powerful and even when you think no one is listening. Also, a lot of fucking luck.",
   "created_utc": 1692270151,
   "score": 44,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk640e",
   "message": "Married my way out of it. I had no idea her family were doing well because they live so frugally, but when I moved in with them to \"save money\" after marrying her as they put it, I was put in charge of managing everyone's bills and credit cards.\n\nWhen I saw my father and mother in laws bank accounts, I at first thought it was a mistake, but when I raised it with my wife she was like like no that sounds normal. I nearly fainted.\n\nI know for bloody sure that their grandkids are going to want for nothing.",
   "created_utc": 1692270244,
   "score": 65,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk64mi",
   "message": "Don’t buy anything you can’t afford unless you literally can’t do anything else. I work in banking and so many “broke” people have a negative balance incurring overdraft fees while making $700 payments on the 40k truck they bought for Christmas last year. \n\nDon’t carry a credit card balance. If you need emergency funds, get a personal loan instead assuming you haven’t already obliterated your credit.",
   "created_utc": 1692270254,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk65pf",
   "message": "Grew up middle class and without luxuries. Enlisted in the Army. Graduated college. Worked at Chase Bank. Got married and bought a house I could not afford. Wife was frugal like me and hated spending money we did not have. Made our own laundry detergent and baby wipes to spend less. Kept chipping away at debt while climbing the corporate ladder in insurance. Yearly pay raise means I just increase my contributions to investments/savings and not spending. We haven’t lived paycheck to paycheck for years, have several investment accounts, take several family vacations per year, and do not stress about money. We are also the only ones in our group of friends that stayed in their first home and didn’t upgrade so we keep our expenses low, $1,300 mortgage per month including taxes and insurance in a high cost of living area. Being broke sucks and we fixed it with simple math. Spend less than you make and keep making more money.",
   "created_utc": 1692270272,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk67nr",
   "message": "39 now grew up piss poor most of my childhood and paid my parents mortgage since like the age of 21 with my brothers .\n\nYou suffer and work 70-100 hours a week if you need to and save and do whatever it takes .  \n\nI took off 3 days a year from work for probably a 6 year stretch of working 7 days a week \n\nyou will lose friends , miss vacations and some drunk memories  but I assure you taking a vacation at 35 years old with a savings account is far far superior than at 25 and broke . \n\nZero regrets trading in my early 20’s freedom for 40 year old freedom",
   "created_utc": 1692270304,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk6emz",
   "message": "That is rather simple:  \nYou just need to earn more money per payintervall than you spend money in the same time.  See? That is all.",
   "created_utc": 1692270420,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk6i67",
   "message": "I went to university and got into the coop program to work in my field which led to a job offer when I graduated",
   "created_utc": 1692270479,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk6j6q",
   "message": "How do I learn this skill?",
   "created_utc": 1692270497,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk6kw6",
   "message": "I worked two jobs and went to college. And when I graduated I immediately went to grad and worked one FT job and FT grad school. I treated my job hunt like a FT job. Researched companies, interview questions and made notecards on everything I should know.",
   "created_utc": 1692270525,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk7grb",
   "message": "Without knowing your budget, it’s really hard to say. Poverty is caused by a lot of Socio economic factors as well, but I’m going to make the assumption that you are “broke” due to spending habits and not in “poverty” due to historically racist policies, lack of education, etc.\n\nI’m also going to assume that you have a job :-) if you don’t, or are paid in peanuts, you will need to find a job for half decent income.\n\nAs a general rule broke people tend to live like they’re rich and rich people tend to live like they’re broke. \n\nIf you are doing any unnecessary spending, you need to cut that down. This can include unnecessary subscriptions, expensive coffee in the morning, definitely cut out going to restaurants entirely, lower your cell phone plan, etc… you will be amazed at how much money we piss away on nonsense.\n\nMake yourself a budget, and make sure you have a line item for savings. Then you will need to carve up that budget as much as you can and move as much money as you can into savings. Start with building an emergency fund and go from there.\n\nIf you have anything worth selling, go for it. My old Nintendo game collection paid off my student loan. It was heartbreaking, but it was worth it.\n\nLive frugally. Maybe you won’t become a millionaire, but you may be able to start to live a little bit better. I was able to pay off over $60,000 of debt by making these type of lifestyle changes. There are tons of Youtubers that talk about minimalism and living frugally. I recommend you watch as much of that as you can and pick up as many tips as you can.",
   "created_utc": 1692271059,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk7i9b",
   "message": "Which time?  \n\nFound a place to stay, got a job.  Always made a point of having one job that paid, another job that fed me.\n\n60 hours a week on average.\n\nAfter that, it was parents buffering me (place to stay after a breakdown)\n\nPlace to work after the job paying the bills didn't work out  (different parents)\n\nFinally got a good job and really thrived.  Now my epilepsy is catching up.  So here's hoping I don't lose my job",
   "created_utc": 1692271083,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk7jv3",
   "message": "Pardon me?",
   "created_utc": 1692271109,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk7q1p",
   "message": "Started my own business",
   "created_utc": 1692271210,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk7w1l",
   "message": "I got lucky.\n\nI liked computers, and I could study a vocational degree in my country which was free at the time.\n\nThen my family kicked me out so I had to move to a big city to get a low pay, entry, thousand hours job, completely alone. There was 0 opportunities or support for me. I was broke, sharing rooms and flats with... \"interesting\" people.\n\nThen it turns out computers are a field with a lot of workers needed, so in a big city your skills are on demand and I got a better pay progressively.\n\nThen I studied English and that opened international opportunities so I could work in a better field, maybe remotely.\n\nThen I opened my own small company and I don't have to put up with asshole bosses.",
   "created_utc": 1692271305,
   "score": 23,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk7ztv",
   "message": "Have you ever listened to the song Money by Pink Floyd?\n\nSeriously, listen to it.\n\nI started out in manufacturing when I graduated trade school. I got four certifications in IT and telecommunications. I want to go to college someday. I hated that job, but it was easy to get in through a tenp agency. The hours sucked (12 hour night shifts) and the pay sucked (15 an hour, which isn't enough for me to make rent and stufd)I had a disagreement with the supervisor who was a total asshole. I got fired.\n\nI started searching for jobs in other cities nearby. In Northenr Utah, all cities are clustered together and are relatively simple to get to if you take public transportation (which is infinitely cheaper than driving your own car) I got a job in telecommunications and RF for 20 an hour to start. Basically unfucked my situation. The only issue is that it's 45 minutes away from me.\n\nJust get a good job with more pay.\n\nI suggest, if you have a skilled trade, not looking for local jobs. Look at the surrounding towns for small businesses and companies. Be prepared to make the commute every day. Set the bar somewhere in the middle. \n\nEDIT: Before I got this new job, I was about 1500 in the hole. That's a lot for an 18 year old. And scraping by by the skin of my teeth",
   "created_utc": 1692271367,
   "score": 9,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk8295",
   "message": "I don't know. Maybe society needs poor/broke people to step on. It's a good way to get people to volunteer for the military.",
   "created_utc": 1692271406,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk838r",
   "message": "Went heavily into debt to get a degree with a definite career opportunity.  Got a job.  Hated it.  Kept it as the money helped to pay off the massive debt.  Went back to school to retrain, got more debt, got a job I loved, paid off all debt, and now I am a few years away from retiring with a full pension.",
   "created_utc": 1692271422,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk86cl",
   "message": "I sat down and figured out why I was there and worked on that.  I woke up one day $30k in debt, -$600 in the bank and living in a ratty 400 sq ft duplex.  I was like 23-24ish and knew living paycheck to paycheck like this was not what I wanted to do.  I got on a budget, tackled my debt, worked on improving my job skills and turned it around over the course of the next decade.  I worked a metric crap ton of hours in the mean time.",
   "created_utc": 1692271471,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk88lw",
   "message": "Haha you mean how am I not deeper i to poverty? Yeah xD I don’t know either!!!🎉🎉🎉",
   "created_utc": 1692271506,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk8dl3",
   "message": "I am swimming in it now",
   "created_utc": 1692271584,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk8iss",
   "message": "Seems simple enough to me. Live with roommates, don’t spend money unnecessarily, save and invest, and most importantly don’t fall victim to lifestyle inflation. Keep driving your old Civic or Corolla, and when it dies, get another old civic or Corolla. \n\nGet a credit card with good travel rewards and if you put all of your purchases on it you should be able to take free vacations after some time, depending on how much you spend throughout the year. \n\nAnother thing - take advantage of credit card rewards! It blows my mind how many people just ignore them or continue to use their debit cards… if you’re scared you will get reckless then set up auto pay to pay the entire statement balance every month, and you will never pay a dime in interest. I’ve got a Chase Freedom Flex for the 5% back on rotating categories, BOFA Cash Rewards which gives 3% back on Amazon. Citi DoubleCash for 2% on anything not covered by my other cards. 3% on dining from CapitalOne Savor. None of these cards have annual fees, it’s just free money in your pocket if you were going to make that purchase anyways. \n\nAnother thing! Buy things secondhand, especially electronics! Electronics evolve at such a fast rate that the stuff from a year or two ago drops in price so quick! There are crazy deals to be had on Craigslist, Facebook, OfferUp, etc. I am about to buy an M1 MacBook Air, a 2 year old computer that is only 10-20% slower than the newest models for only $750, and that’s not even the base model. The one I’m looking at has double the RAM. Mint condition, only 30 charge cycles on the machine. If I were to buy a new one I would be looking at $1200+ for what is fundamentally the same experience.\n\nSet financial goals for yourself and create a plan. Determine how much you’re willing to allocate for savings and for fun. I still go out and eat with my friends each week and do fun things like take trips, go to concerts, etc. \n\nIf someone as lazy as me who works no more than 30 hours a week waiting tables is able to save thousands every month and still live a pretty comfy life in a high cost of living major metropolitan area then I think anyone can with a little discipline and ingenuity.",
   "created_utc": 1692271669,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk8u5v",
   "message": "Took a while and I had some set backs.\n\nBasically I worked for a retail company, I went to college but I wasn't mature enough at the time. I was a hard worker and I was lucky enough to have people above me that appreciated that and developed me. I became one of the youngest ASMs in my area but then I moved to another state and got stuck. I was good at cleaning problem stores so I got stuck in that role and after a couple years I realized I wasn't going anywhere.\n\nI met my wife during this time and she convinced me to go back to school, I always wanted to be a cop so I enrolled in the academy but this was during the Recession, most places weren't hiring and the ones that were had like 500-800 applicants for 2 or 3 spots. My company invited me back to do Loss Prevention. I quickly was promoted to District Loss Prevention Manager and I was very good at it, like I found a error Coke was using to their advantage and was costing our company $4 million\n\nThen I was laid off, I bounced around job hunting, we got very broke. I ended up working on construction equipment and it pays very good, like good enough that my wife can stay at home with my 3 kids in my 3 bedroom house and still be comfortable, as long as we don't get spend happy",
   "created_utc": 1692271848,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk8udf",
   "message": "Drive and determination",
   "created_utc": 1692271851,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk8w6g",
   "message": "I'm a child of poor immigrants. I just happen to love science and especially mathematics. I obsessively studied it because it was cool. Enrolled in a community college because I wanted to learn more before getting a \"grown up job.\" One thing lead to another and now I'm a faculty at a university.\n\nI think people should choose something interesting and focus on doing it well, learning, and developing as a person for a few years. After a few years, then decide if you want to continue or not. If not, then look for ways to use your new skills to take a step in a different direction.\n\nWorking hard and having a growth mindset is huge. But I have to acknowledge that I was **super lucky** that I just happen to love mathematics. Mathematics is one of those things that everyone needs yet everyone refuses to learn so I have a lot of opportunies.",
   "created_utc": 1692271880,
   "score": 18,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk8zu8",
   "message": "Rehab + time = success (for me, ymmv)",
   "created_utc": 1692271937,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk9008",
   "message": "Hard work, determination, smart saving, getting into the right investments, finding the right person to spend the rest of my life with who supports my ambitions and has similar ones to me.",
   "created_utc": 1692271940,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk913j",
   "message": "I only managed it because I had help from what little family I have. We have always lived frugally and when my grandparents died, I inherited the house (tiny, old-ass \"shack\" but immeasurable character and coziness). That meant no more rent. When the sister of my grandmother died, my dad inherited her house. After putting in most of our savings and all of our free time, we could start renting it out. Whatever we had to do, we did ourselves, that helped to cut costs. \n\nI finished university faster than average so I could start a job earlier. Uni here in germany is very much affordable (not US Style debt for 2 generations), and only buy that, which I REALLY need, I dont splurge on any extras. \n\nBut 95% of the \"getting into a position that is not full-on poverty\" was luck and inheriting a tiny head start from my grandparents.",
   "created_utc": 1692271956,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk9760",
   "message": "I got my first corporate job that paid a \"gainful employment\" salary of $47,000. Moved out into my own apartment and kept on the rise. Life was tough but thst was my big break. Yes, you actually have to keep a budget to make it out of poverty.",
   "created_utc": 1692272051,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk9agh",
   "message": "Honestly? I got married. I was always able to take care of myself, but I never had much in savings in the past. Now I'm a SAHW",
   "created_utc": 1692272102,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk9hpg",
   "message": "Got over my “woe is me” mentality. Took chances. Put my nose to the grindstone. Outworked my competition. Millionaire now. 1998 I was flat broke.",
   "created_utc": 1692272211,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk9lsz",
   "message": "I finally quit the call centre and applied for the job I wanted.",
   "created_utc": 1692272274,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk9mae",
   "message": "Case money. It was the only way out.",
   "created_utc": 1692272281,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk9nih",
   "message": "Got an entry level job at a small business, worked a second job part time, had two more side hustles, did that for years.  Slowly worked my way up at the small business, eventually quit the second job and one of the side hustles.",
   "created_utc": 1692272300,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk9ojv",
   "message": "I ghosted my friends, quit my kitchen job, got a job swinging a sledge hammer, now make 26 hourly moving rail cars around",
   "created_utc": 1692272317,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk9q1b",
   "message": "Believing a little was enough. Finding bounty in things worth nothing. Working hard helped little. My attitude of gratitude for little or nothing changed my life.",
   "created_utc": 1692272340,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk9vbe",
   "message": "I joined the Army for 22 years. \n\nGot out with a degree, commercial airline license, PTSD, half my body rebuilt with titanium, 2 divorces, and alcoholism. \n\nI make good money now though.",
   "created_utc": 1692272422,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk9vqs",
   "message": "Slept in my car for 6 years. Saved enough money for a condo and a nice car.",
   "created_utc": 1692272429,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwk9ybh",
   "message": "Take advice from people you'd aspire to be like and follow it.\n\nCreate a plan and stick to it.\n\nTake on feedback, reflect and improve.\n\nDon't be afraid to take a risk, there's nothing to lose right?",
   "created_utc": 1692272469,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwka137",
   "message": "Cliché but WORK SMART \u0026gt; WORK HARD.\n\nQuite simply, it’s hard to be rich, wealthy or even completely comfortable working for someone. \n\nIf hard work took you out of poverty, cleaners would be millionaires.\n\nBelieve you can do it. Subconsciously, people are scared of breaking out of poverty ie they’re used to being broke, it feels normal. Anyone who isn’t is different, and we naturally are nervous about ‘different’ and don’t believe we can use or enjoy what’s ‘different’ or fit in with ‘different’ people.\n\nThey assume non-broke or ‘rich people’ have a special talent, or are just blessed. No, they do not. They’re as normal as you and I.\n\nDon’t limit yourself.",
   "created_utc": 1692272511,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwka2lx",
   "message": "Reddit is the worst place to ask this. successful people usually don't use reddit lmao",
   "created_utc": 1692272534,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkad2q",
   "message": "I divorced my ex wife.\n\nSadly, I'm not kidding.  She was horrible with money (to the point of us declaring bankruptcy).  When our divorce went through, my credit score jumped up 40-50 points.\n\nPlus, I was no longer financially covering for her (i.e. she bought frivolous things and couldn't afford the electric bill).\n\nHere I am, 14 years after bankruptcy and 8 years after the divorce and, while I'm not raking it in (sadly, I am making the same I was back then), I can make ends meet with being able to put some money away each month (not a huge amount, BTW).\n\nMy wife and I also had a financial situation (she got laid off) so we took a very hard look at our finances.  We got rid of DishTV ($300 a month) and Verizon ($200 a month for 3 lines) and put it all on Spectrum, it's now about $300 a month for internet, TV, home phone, and wireless phones (and they use Verizon's towers) (we were paying about $100 a month for internet and home phone via Spectrum before).  We are spending a bit on streaming services, but we use them quite a bit.\n\nWe almost never go out to eat.  We have 2 freezers and a food saver, so when meat goes on a good sale, I'll buy a bit of it and freeze it.",
   "created_utc": 1692272695,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkadd9",
   "message": "Stockbroking",
   "created_utc": 1692272699,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkagei",
   "message": "Got a job in law enforcement young and lived at home with my parents till I was 25 so I could save up for a home. Married a great man who was in college for IT and now is one of the top people for his company and I am a SAHM.",
   "created_utc": 1692272744,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkahq8",
   "message": "still working on that one, I'm sure I'll figure it out sometime.",
   "created_utc": 1692272764,
   "score": 1,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkcqg4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkqeay",
   "message": "I was homeless, bouncing from shelter to shelter. Hustling running weed and pills for people to scrape together a session at the end of the day.  \n\nOne day my cousin took me with him to a place called Labor-Ready. It's just a place where construction companies etc. pick up a day laborer, and at the end of the day you go back to the office and they cut you a cheque for the day's work.\n\nWell when I got to that jobsite, the other punks I was working with from the agency were lazy and slow and complaining all day, barely doing anything. It pissed me off. We were hired to work.. So I worked my absolute guts out. We were digging mud out of the basement of an abandoned farm house that was being restored.\n\nThe boss came during the day and saw me carrying 2 steel 5 gallon pails filled to the top with mud up the stairs and out the back door constantly. While the other two were barely filling one 2 gallon drywall mud pail.. \n\nHe took me aside and said \"You're not going back to the agency tomorrow, you're hired.\"\n\nFrom there I continued to work my guts out for him and eventually was promoted from laborer to a carpenters apprentice.\n\nI learned a few trades there since they were a general contractor. From there I moved on to other companies and continued learning new trades. \n\nToday I'm a jack of all trades, making good pay. I do everything. Windows and doors, flooring, brick and concrete repair, drywall, mud and tape, tile, siding and aluminum, you name it. I've got my own brand new van, fully kitted out with all the best tools I could possibly need to do any job. And my work is appreciated because I am meticulous and hard working.. \n\nAnd that's how I went from pinching out of weed bags and sleeping at a mission to owning a house and vehicles with a good job.",
   "created_utc": 1692280086,
   "score": 138,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkmrwb",
   "message": "Might sound harsh, but I dropped the group of people I was hanging with.\n\nThey all had no aspirations and drive to do anything or get out of the small town we grew up in.\n\nI knew that if I stayed in that circle of people, I wouldn’t go or do anything with my life. \n\nThat was 8 years ago now. \n\nI got a college degree, have my own house, make $120k a year. Everyone back at home that I left still aren’t doing anything",
   "created_utc": 1692278582,
   "score": 165,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkkygt",
   "message": "As a former banker and Financial Adviser the best advice is have an actual plan. I’ve seen so many people, even ones who make great money, who are always totally broke and can never achieve their goals because they have never taken the time to sit down and formulate a realistic plan to get there. They just have a dream and go through life always assuming “it will happen eventually”. \n\nMy wife and I set a goal to be mostly retired and living on our sailboat by 40. She used to roll her eyes at me when I pulled out my notebook every month or 2 and completely reevaluated every step in getting there. Well I’m sitting here typing this from my boat on the way to the Caribbean at 39.",
   "created_utc": 1692277804,
   "score": 223,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkhj3g",
   "message": "Hard work and a huge dose of luck. I was a rock star at my former job. My former boss got a new job offer, and he asked me to follow him to the new company. I got a ~$15k/year raise doing the exact same job. But that job never would have existed if he hadn’t taken the job he did. He created it for me. 12 years later and he’s long gone but I’m still here, and making just shy of double what I started off at after a few internal role changes.",
   "created_utc": 1692276266,
   "score": 20,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwl7m7h",
   "message": "One phone call.\n\nShort version - I was studying programming and got pretty good at some niche stuff that was in demand.  I was pretty worried/afraid of the unknown but my gf was suddenly pregnant and she hit me with the 'It's now or never to get off your ass' and I took it to heart.\n\nI finally put my resume out and applied to a few jobs.  Got a call a week later.\n\nHere's the cool part, at the time I was making about $25k/yr - the person on the phone offered me $70.  But I'd have to move 6 hours away and be able to start within 7 days.  \n\nI took it.  \n\nI was so excited to be making $70k.\n\nBefore the call ended the recruiter said 'Well I'm going to put you down for $80, I have some wiggle room I left in to negotiate and I also get a little extra the more you make'.  \n\nI said that sounds great.. \n\nThen as she's closing the call she says she's got me down to start in 7 days, at $80hr.. see you then.\n\nThe reality is I took the job happy at $70k, but she meant per hour.  She then upgraded me to $80/hr without me asking, and before the call was done I was making $165k/yr on a job that I had accepted for $70k.",
   "created_utc": 1692286600,
   "score": 21,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkpfd9",
   "message": "Been a computer guy all my life, tried to go to community college for CS, but dropped out cus I was paying my own way and didn't want any loans. But picked up the fundamentals of programming over the years. Pursued other careers for a few years, before realizing none paid what I wanted.\n\nThen had a buddy help get my foot in the door at a programming job. Now make great money, with significant raises coming soon. Also live in a low COL area.  \n\nThe saying \"it's all about who ya know\" has rung true for me most of my life.",
   "created_utc": 1692279690,
   "score": 14,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkjxho",
   "message": "Something that isn't said as much is the lack of financial literacy, at least in the US. The percentage of people who don't understand how to create a proper budget is shocking, and is a direct correlation to howany people either stay broke, or become broke. \n\nThe education system in the US is a complete failure. It does not keep kids engaged, does not keep them interested, does not pay teachers a living wage, and sets everyone up for failure. Financial literacy begins in grade school, and we need to do a better job of teaching good habits.",
   "created_utc": 1692277353,
   "score": 32,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkll3l",
   "message": "Live like you only get half of your paycheck and throw the other half in a saving account you don’t touch",
   "created_utc": 1692278074,
   "score": 8,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkmedr",
   "message": "I always had a pretty good income (150 - 300k) but my ex could outspend any increase I received.  One day, after 24 years of marriage, she informed me she was leaving me and my 3rd child ( a 4 years old).\n\nShe managed the finances and just handed everything over to me….after reconciling everything, and given it was after the 2008 financial crisis, I understood why she left…I was operationally bankrupt.   My net worth was -450 - 500k at 48 years old.   My situation affected my focus on the job and I felt someone breathing down my neck…I was a senior executive and I knew what was about to happen.\n\nI took a new position, before getting fired; commuting 2 hours each way in a job shutting down a company.  My luck changed, I met a new lady who supported my endeavors.  In 8 years, I was out of debt, a decent portfolio and I retired at 56 years old.\n\nThose 8 years were intense, lots of travel and stress but my new wife supported me by understanding what was at stake and not badgering me about never being home…ironically, now I’m always home.   Never give up, disassociate yourself from losers and bad influences, even if they are family.  I wish everyone success",
   "created_utc": 1692278424,
   "score": 17,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkpirm",
   "message": "Keep job hopping until you find something that pays you what your worth.  Believe me though…being broke never leaves your thoughts.\n\nIt’s something my girlfriend has never had to deal with and it’s difficult to get her to understand that in our relationship.  I go home every night and make dinner.  I bring lunch to work everyday.  She eats at restaurants for lunch and fast food for dinner almost every day and she makes 15K less than I do annually.\n\nOnce you’ve been poor and get a taste of freedom, you NEVER want to go back and do everything in your power to stay out of poverty from then on.",
   "created_utc": 1692279728,
   "score": 6,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwl0rxj",
   "message": "I stopped eating avocado toast and started making coffee at home 😁",
   "created_utc": 1692284109,
   "score": 12,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkpx2z",
   "message": "Quit drinking. Turns out it's tough to get out of crippling debt and the cycle of homelessness if you're slowly killing yourself with alcohol. I was suddenly able to hold down a job and be a reliable, dependable, contributing member of society. I've got a fiancée, just bought a house in a decently middle-class suburb of a major city and have hobbies, interests and commitments that I honor. \n\nOutside of overcoming addiction, the biggest learning for me has been not allowing my spending to increase as I make more and more money.",
   "created_utc": 1692279891,
   "score": 6,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkanls",
   "message": "Grew up in poverty, trailer, no power, no food a lot of the time, hoarding food when I got it, watering down milk, etc. \nJoined the USAF, got a B.S., broke my body, went to war, PTSD etc., saw friends die, almost died myself, medically retired 10 years later. Had to reinvent myself when I got out by changing careers since I wasn't qualified to do the job I was doing in the military (very common) nor was I physically able to anyways. 8 years and 5 jobs later, I work for the government making 6 figures. So yeah. That. \n\nSo fuck everyone who say all you have to do is work hard or just get a better job. Everyone I know is still back home besides one (and he's in the USAF Academy).\n\nStill live like I'm broke and still do a lot of the things I did when I was poor. So does my wife. It doesn't leave you, really. No matter how much money you make.",
   "created_utc": 1692272853,
   "score": 19,
   "submission_id": "15tejzd"
  },
  {
   "comment_id": "jwkoe6z",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15tejzd"
  }
 ]
}