{
 "submission_id": "15tpi0i",
 "title": "What is the fastest way you've seen someone get fired?",
 "selftext": "",
 "created_utc": 1692283211,
 "permalink": "/r/AskReddit/comments/15tpi0i/what_is_the_fastest_way_youve_seen_someone_get/",
 "score": 216,
 "url": "https://www.reddit.com/r/AskReddit/comments/15tpi0i/what_is_the_fastest_way_youve_seen_someone_get/",
 "comments": [
  {
   "comment_id": "jwlo8yj",
   "message": "I saw a coworker once make a \"big boobs\" gesture as our boss' wife walked past....with our boss walking right behind her. \n\nHe was packing his shit within 5 minutes.",
   "created_utc": 1692292551,
   "score": 29,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlqa2u",
   "message": "Dude showed up to his first day after taking acid. Told the boss his acid kicked in.",
   "created_utc": 1692293262,
   "score": 113,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlqslg",
   "message": "Got yelled at for being late. Said some insane shit to the boss over it, got sent to talk with HR, threatened HR with his gun, then the police showed up and I never saw him again.\n\nYou'll never guess what career he really wanted, but got 'scammed out of'.",
   "created_utc": 1692293443,
   "score": 63,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlihfj",
   "message": "A colleague let a middle school kid drive the bus. Buh-bye!",
   "created_utc": 1692290498,
   "score": 55,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwl975t",
   "message": "At one job I had, within 10 minutes of being hired, a guy was called into the boss' office. Boss held him for a bit. I can hear the boss yelling at the guy about how they discovered that he immediately started searching the internet for C.P. The police show up and the guy is arrested and hauled away. Turned out he didn't want the job, just a place where he could surf the internet for free for CP. Apparently, he could beat the adult blocking software that was standard on most work networks.",
   "created_utc": 1692287165,
   "score": 67,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlx1tn",
   "message": "Came out from the back and joined us while we were talking about work related stuff, and he had a beer can in his hand. I immediately stopped talking about what I was talking about before and asked him: \"Dude. What the fuck are you doing?\" \n\nHim: \"uh...drinking juice? What does it look like?\"\n\nMy boss: \"That's not a fucking juice dude, that's a seltzer. It's alcohol.\"\n\nHim: \"pfft, ok so?\" *Takes another sip*\n\nHe was 16. He was fired on the spot and had to be dragged out because he was adamant it wasn't a big deal and threatened to stab me with his pocket knife when I tried taking it from him.",
   "created_utc": 1692295647,
   "score": 212,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlk867",
   "message": "The guy responsible for opening the shop on Saturday morning went out and got blitzed on Friday night. We showed up to work to find his car in the lot but the doors locked. He didn't answer his phone. Had to call the owner in to get us inside.\n\nGuy was fast asleep, under his desk. \n\nHe was gone before you could say hangover.",
   "created_utc": 1692291115,
   "score": 129,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwl9qjp",
   "message": "He showed up to work after a weekend meth bender, on a schizophrenic episode telling us that people were after him and us, then wandering around the building with a pipe and a box cutter getting more and more aggravated as more of us “changed”",
   "created_utc": 1692287354,
   "score": 118,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlrv8b",
   "message": "I'm an insurance agent.  I had a client once, young kid who just graduated college.  He and GF and both families went out for a nice meal to celebrate him landing a dream job.  \n\nHe got pulled over on the way home and given a DUI.  Lost the job before he even started...and not to mention my insurance company non-renewed him for getting a DUI.",
   "created_utc": 1692293823,
   "score": 175,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlr9dz",
   "message": "First day on the job, gave another coworker a wet-willy. Shit you not.",
   "created_utc": 1692293609,
   "score": 157,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwl0igk",
   "message": "I did the firing.\nI was sous chef of a large reception hall, meaning serving food to hundreds and hundreds of guests.\n\nOne party had a big seafood display. Shrimp, oysters, crab legs \u0026amp; vodka, all in a giant decorative box of ice.\n\nWhen that portion of dinner service was finished, two new waiters were tasked with returning the big ice box + leftovers to the kitchen and dish pit.\n\n**They dumped the ice back into the ice machine.**\n\nThe contaminated ice. It even had some discarded shells.\n\nI saw it happen. I had to show them the door immediately and have a serious talk with their head waiter. They lasted 2 hours, tops.\n\nThose idiots could've killed someone. \nImagine you have a severe shellfish allergy and the ice in your glass of water is lethal.",
   "created_utc": 1692284011,
   "score": 121,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlpz4l",
   "message": "First day at work for this new dude.\n\nWe pick him up at 07:00AM...  \nHe hops into the car and goes : \"Ahhhh, Jeez...when are we finishing work today? Im beat. Can you guys buy me a pack of cigarettes? Oh, and just so you know, I only eat Meat for lunch...\"\n\nThe boss stopped the car, and told him to get out.  \nIt was like 07:03...",
   "created_utc": 1692293156,
   "score": 165,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwl06o0",
   "message": "Co worker showed up to work drunk. Was told to go home. She mouthed back and started screaming insults at the President of the company. Fired!!",
   "created_utc": 1692283892,
   "score": 110,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwl02bd",
   "message": "he filmed from under the door of the women's bathroom.\nI don t understand how it’s possible to do this",
   "created_utc": 1692283847,
   "score": 21,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwle555",
   "message": "We had a new guy and he lasted for 2 days. Guy was writing a book about government spending and said he was being watched by the FBI. The manager said he was crazy and they got into a shouting match. Manager put up with him and let it slide. On the second day he called another co-worker a racist for not letting him do things his way when they were just trying to show him how the work is done. So he walked out. Manager was like \"Thank god\" and fired his ass.",
   "created_utc": 1692288922,
   "score": 247,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlp095",
   "message": "Worked at a grocery store a few years ago. A new guy was hired and on the second day on the job, he was caught stealing food. \n\nHe would grab items off the shelves and walk to the break room and eat them.",
   "created_utc": 1692292820,
   "score": 213,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwkzc3q",
   "message": "Sleeping with his secretary",
   "created_utc": 1692283579,
   "score": 96,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlu52k",
   "message": "During drop-off hours, our preschool receptionist decided she needed to have coffee asap. Instead of heading down to our staff room and making a pot, she decided to leave our whole school unlocked and left to go down to Biggby Coffee. \n\nThat was a big no no. She was fired as soon as she came back.",
   "created_utc": 1692294628,
   "score": 97,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlw4bp",
   "message": "First day at work, hired by a temp agency.  Me and one other guy, we put stuff in boxes and tape them shut, stack boxes on a pallet.  He can't keep up, can barely use a tape gun and decides its time for break.  Goes to the lunch room and takes a lunch.  It was the bosses lunch, he stole the guys meal his wife made for him.   Boss man came over 15 mins later and wants to know who ate his BBQ, sticky fingers and BBQ on his shirt he denies it.  I just look at him and the Boss and said well I hope it was good man..",
   "created_utc": 1692295320,
   "score": 94,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlh85b",
   "message": "I worked at the head office of a well known retailer.  One day we had a temp on the reception desk and no one realised that the bottle of water on her desk was, well...not water.\n\nAs the day went on the tannoy announcements got worse, just stumbling through names and slurring.  Needless to say everyone thought this was funny, not realising that she was bladdered and not just crap at the job.\n\nCome the end of the day though, she gets into her car and attempts to drive out of the car park, bouncing off cars and eventually coming to a halt on a grass verge.",
   "created_utc": 1692290046,
   "score": 250,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlskbr",
   "message": "I was a police instructor. I was driving down a road to deliver some stuff (mid shift) and I saw headlights in the opposite lane not moving toward me. I slowed down, then noticed it was a marked unit. I stopped next to it and the officer was asleep...in the middle of the road, unit in park, mouth open asleep!",
   "created_utc": 1692294070,
   "score": 241,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlope2",
   "message": "Someone idiot made a racist \"joke\" about a black lady during orientation. HR immediately kicked him out.",
   "created_utc": 1692292713,
   "score": 190,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlxh10",
   "message": "Had a supervisor start selling Amway from his office, hinted at favorable treatment for anyone who would buy.  Reported him to HR--and when they asked if it was true, he pulled out a catalog and tried to sell them something.  Fired on the spot.",
   "created_utc": 1692295799,
   "score": 62,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlqrrj",
   "message": "I had a co-worker who showed up totally high like she made absolutely no sense high.  My boss had to drive her home because she was messed up high and this co-worker was never seen again.",
   "created_utc": 1692293435,
   "score": 118,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwloe0y",
   "message": "First day at work he took one look at his would-be boss and declared \"I won't work under a woman\".  So he was shown the door.",
   "created_utc": 1692292600,
   "score": 129,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwl23f3",
   "message": "being rude to a customer in a call center just as the CEO walked by",
   "created_utc": 1692284595,
   "score": 86,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwllge1",
   "message": "A new guy lasted 2 weeks. He kept coming in with his fat belly hanging out the bottom of his shirt, burping loudly and telling people when he was off for a shit. After being told not to do any of this, he continued to do so. Fired. \n\nAnother guy lasted about the same time he kept being late and then needed time off to look after his dog who had a unrinary obstruction. This was fixed and all better in 1 day. A manager found out he didn't have a dog but a cat. Fired.",
   "created_utc": 1692291554,
   "score": 148,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlnw7u",
   "message": "Racist, sexist and bigoted coworker called another coworker with fetal alcohol syndrome (which did not effect her work, she was an excellent employee) a re****. \n\nManager walked him out the door. He should have never been hired",
   "created_utc": 1692292424,
   "score": 137,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlw0lj",
   "message": "Onboarding employee fell asleep multiple times over her first week in training sessions that were presented in person by a VP who had flown over to the US from the UK.\n\nShe must have been fearless.",
   "created_utc": 1692295282,
   "score": 37,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlq099",
   "message": "I watched a guy at a really high end restraunt bring out a steam ship round roast beef for a huge brunch celebration. He was trying to set it up and dropped it on the floor. We all saw. As did his manager. He set it right back up and started cutting. She ran his ass outta there in minutes",
   "created_utc": 1692293166,
   "score": 68,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlqng6",
   "message": "Manager introduces new co-worker to us and asks one of my colleagues to train him on the machinery we use, which he accepts. 20 minutes in training the new guy picks up a large, metal piece and the trainer shows him the proper way to handle it. The trainer demonstrates by gently grabbing the piece, to which the new guy reacts by violently grabbing the piece away from the trainer then attempted to back-hand smack the trainer... right in front of the manager.\n\nNew guy got hauled off faster than an Amazon van driving on same-day shipping, metaphorically. Our manager was really hard on workplace violence.",
   "created_utc": 1692293392,
   "score": 73,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlvo7s",
   "message": "I saw a new VP of IT being recruited from a very large corporation. She was used to traveling all the time, she joined our company, and a week after traveled to Asia in Business Class without really asking the CIO. He immediately fired her when she came back.",
   "created_utc": 1692295162,
   "score": 34,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlxi17",
   "message": "New guy tried to buy some meth from the owner within two hours of being hired. He asked another employee and he told him the owner was dealing on the side for extra cash. He started at 8 AM and was fired by 10.",
   "created_utc": 1692295809,
   "score": 32,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlzf15",
   "message": "Hitting on the bosses 13 year old son.",
   "created_utc": 1692296493,
   "score": 31,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm0knm",
   "message": "Dude's first day, on a team next to mine gets an assignment, as soon as the lead leaves the area he leans over to another guy and threatens that if he doesn't do his work for him he's going to \"kick his ass after work\". \n\nI got up to the managers, we walked over and escorted him out. He was there all of 2 hours.\n\nOn his way out he's knocking over chairs and screaming that he'll be \"waiting for us in the parking lot\". Fuckin nuts.",
   "created_utc": 1692296907,
   "score": 32,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm1m5x",
   "message": "Had a coworker explain to our supervisor how he found this great loophole for making extra money: if a customer had exact change, he’d just pocket the cash and cancel the order on the register.",
   "created_utc": 1692297283,
   "score": 31,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlnyzd",
   "message": "I did the firing. Boss begs me to give this kid a shot and says they may be \"some scheduling challenges\". Kid is flat out not available until after we are closed for the day and then only for 2 hours a day. The kid told me that so I thanked him for his time and walked him out of the office.",
   "created_utc": 1692292453,
   "score": 62,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwl1hqc",
   "message": "Drinking on the job",
   "created_utc": 1692284373,
   "score": 57,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlxk7w",
   "message": "Half an hour. Working in Arby's, new girl shows up. They run her through how to work the cash register on a few dummy orders. She takes a real order or two and then it gets slow. She asks to duck out for a minute to smoke and never came back.\n\nRegister ended up being $100 short that day.",
   "created_utc": 1692295831,
   "score": 52,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwly7x4",
   "message": "Worked at an ISP back in the 90s and had a guy working late shift. Found out quickly he wasn't answering the phone at all, but just playing video games. He was warned. Next day he walks in to work with a Voodoo2 graphics card to install in his work computer to improve the game playing. Fired before he sat down.",
   "created_utc": 1692296067,
   "score": 25,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlz1q1",
   "message": "Working security at a concert venue. Coworker confiscated a mini bottle of Fireball that someone snuck in, and then he drank it in front of everyone. Instantly went from confiscation (part of the job) to stealing and also drinking on the job.",
   "created_utc": 1692296362,
   "score": 26,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlwaxc",
   "message": "During first day of training orientation the trainer all had us read a paragraph out of their guide book. It was very third grade, but kept us from falling asleep from boredom.\n\nAfter lunch break, one girl was suddenly gone as was our trainer. Two stern faced HR reps were in there and asked us what had happened during the first few hours, and if anyone had felt 'picked on'. \n\nI guess the girl had spun a tale that the trainer had singled her out and made fun of her when she didn't know the answer to a question? \n\nIt was legit bizarre. There were no questions asked. We were just taking turns reading aloud from a boring manual. \n\nAnyway, after the class confirmed that the girl's story had not happened, the trainer was let in and the girl wasn't seen again. \n\nIt was just strange.",
   "created_utc": 1692295385,
   "score": 52,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlw7w3",
   "message": "Co-worker was supposed to be in a meeting with me to discuss the decommissioning of his old ass shitty Linux servers that were poorly documented. We went back and forth on it, he was very guarded. Dude was close to retirement, working remote online in Puerto Rico (American that loved to visit where he eventually moved to). I made the comment that he moved there so he could be a creep and probably had bodies in his basement...the wrong person heard it and I was reprimanded (rightfully so) and came close to destroying my career like an idiot.\n\nBack to the meeting...he was a no show. I was pissed, turns out it was because his home was being raided and he was being detained for having multiple bodies buried under his home (lots of hookers and stuff) 7 in total. I feel like he was fired so fast he wasn't even fired. We just never saw Paul again lol. I did ask for the reprimand to be taken away since I was actually right but that did more harm than good for me but that's a story for a different day. :)",
   "created_utc": 1692295355,
   "score": 88,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlr97v",
   "message": "I work at a local grocery store and one day we had a new hire in the bakery department. Her first day comes around and she no-called and no-showed for her first day…then a few days later comes in and shops like nothing happened 💀",
   "created_utc": 1692293607,
   "score": 43,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlxmvm",
   "message": "New hire showed up, it's a physical job and was described as such. I started to show him how to 'rake a floor' in a malthouse, he said it made his back hurt and he wanted to do something else. Proceeded to show him out to empty the kiln and he said he was too hot and wasn't going to do it. This was 1 hour into the 10 hour shift....boss sent him on his way.",
   "created_utc": 1692295858,
   "score": 23,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm2t22",
   "message": "The office hired this new guy who was obviously a bad fit. We would often give people a chance despite interviewing poorly. We hardly had any issues come up. But this one guy failed the drug test for meth, was obviously high during the interview, obviously hasn't showered in over a week, and had no self awareness whatever... This guy literally walked into a wall while looking right at it. \n\nRegional hired him and gave him to me to work on a relatively dangerous site. I put him through the training, got him licensed, and even drove him to the site just to show him around and get him familiar with security procedures and safety protocols. He didn't retain any of that information and would repeat the same question over and over. \n\nI pick up my truck from the office and pick him up from home because he lived like two blocks from the office and doesn't have a car to get to the work site. That's fine, I don't mind driving people to the site. Keeps me out of the office doing busy work. But during the ride he confessed that he lost his license because of multiple DUIs and he sold his car to buy drugs. I told him to keep the drug stuff at home and only come to me about it if he needs to go to rehab.\n\nThe owners of the business were always willing to work with addicts and tried to get them clean. So our company partnered with a rehab center that had a six month program. I explained this and other resources to help him out. Dude looks at me dead in the eye and says \"I don't want to get clean\". I then told him to just come to work sober and don't allow his usage to interfere with work. He was 100% sober at this time. \n\nWe get to the site and I have him pull out his company I'd which you can to gain access to the site. I drove his ass to the main building where I would show him how to clock in and begin his shift, but he has to take a piss so I stopped at one of the auxiliary buildings and showed him where the restroom was. Ten minutes pass and I figured he was taking a dump. Twenty minutes pass and he's still in there. I go to check on him and found him in the bathroom stall with the door open completely naked and a needle hanging from his arm. He had also masturbated and was covered in his own semen. I call an ambulance because I'm not dealing with that. They figured he was overdosing after he passed out and started vomiting so they took him to the ER.\n\nAs soon as he was carted off to the hospital, I left the job site and headed back to the office to file his termination paperwork. Didn't even have the chance to get him clocked in lol.",
   "created_utc": 1692297708,
   "score": 24,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlxudk",
   "message": "Hired a girl we will call “Crazy Sara”. On her first shift she clogged the toilet in the staff bathroom because she was bulimic.  \nThat’s super awkward because that’s a serious issue. She made it more awkward because she was talking about it so openly. And giggling like she was a woman in a Monistat commercial.  \n\nVery next day she’s eating 2 entrees at 11am. Like a steak dinner and a club sandwich together. I had to go up to her and be like, to, this is awkward as shit. I don’t know how to say this without sounding like a monster, but you literally just told everyone in your outdoor voice that you throw up everything you eat, and here you are having a steak (at this point I gagged a bit, collected myself) dinner AND a sandwhich, and I’m not getting a plumber again. Plus it’s just super fucking awkward for everyone here knowing where that food is going in 10 minutes.  \n\nShe laughed and explained she changed her mind and isn’t bulimic anymore because her new sugar daddy has a “gainer” fetish and wants to make her obese. She said call girls who date gainers make the most money - I looked this up and it’s sadly true. There are some dudes out there paying women a salary to get fat for them. I’m not a psychologist. IDFK.  \n\nSo, we awkwardly resume our shift and after she’s done for the day I notice she sits to have a glass of wine with some guy who is a known womanizer and cokehead. One glass of wine turns into 5. They have taken several\nTrips to the bathroom together.  \n\nThe evening bartender cuts her off. It’s their first time meeting. It’s probably about 6pm at this point. Crazy Sarah tells her to go fuck herself and exclaims “I work here!” It was her 2nd or 3rd day.  The bartender just blinked at her and said “brb” and walked to the back where the owner was. 20 seconds later the owner came out and told her to pack her shit and get out, and on top of that is not welcome back on the property, ever.",
   "created_utc": 1692295932,
   "score": 54,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm02j7",
   "message": "A mate many years ago started a part time job at pizza hut. First customer he took a pizza out to asked for him to be sacked and he was. To be fair to the customer, my mate had a string of cheese all the way from the pizza dish to his chin. He thought no-one would notice one slice of pepperoni missing. He was wrong.",
   "created_utc": 1692296729,
   "score": 17,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlkz5g",
   "message": "Drunk at work, second day.",
   "created_utc": 1692291383,
   "score": 37,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm10n7",
   "message": "Restaurant opening. His first day on the job. Smacked a server’s ass and said “Thanks toots”. \n\nI think he maybe lasted 2 hours that day max. I can’t think of anyone else I fired faster than that.",
   "created_utc": 1692297065,
   "score": 14,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm1x0l",
   "message": "Oh, I have a good one!  Used to work at an Oil \u0026amp; Gas company.  This year oil prices were up, and the competition between new drilling engineers was tough.  These kids all had 4.0's and had previously done 4 internships.  So they were all getting masters for this to be their 5th summer and still have a 4.0.\n\nAnyways, those were the only applicants that were even interviewed, there were so many applicants and salaries were good that year.  So the 15 or so kids that made it were from across the country, work put them all up in a nice town house just down the road from the building, gave them cell phones, they were paid more than me, I am in accounting, should have been an engineer I guess.  Point is these kids had it good.\n\nOut if the 15 or so interns, 8 were highered.  The first week they were highered they went out to the field, company jet took them there.  To meet the ppl they would be working with in person.  This kid asks a feild foreman how long he was worked there? 15 yrs or so was the answer, doesn't matter.  This kid says, man, 15 years and I'm just out of college and am your boss.  Well guess who got fired as soon as they all flew back to the office?\n\nIt gets better.  The kid had canceled his cell phone since he had a new work phone for free.  And his parents were coming in from wherever they lived to visit and celebrate his first week on the job.  I believe this was on friday when they got back from spending a week in the field, his parents were landing that night.  He had to ask to get his phone back so he could tell his parents he didn't work there anymore.  They didn't give it to him.",
   "created_utc": 1692297391,
   "score": 40,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm00hm",
   "message": "In my gym one of my instructors had an argument with a customer. The customer was being a smartass but the instructor (quite a muscular man, like a badly built bodybuilder) waited for him outside where there were no cameras and assaulted the guy, breaking an orbit and knocking him out.  \nHe then proceeded to go back in, intimidate the receptionist into not calling an ambulance and going around the gym telling everyone that they had \"seen nothing\" and that he knew where everyone of them lived or worked.  \nI called him and told him to pack his stuff go home Immediately. Next day he received a letter from our lawyer not to show his face again.",
   "created_utc": 1692296709,
   "score": 12,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwln6e4",
   "message": "Worked in a nursing home. Tried to move a large patient, I'm a small woman and I didn't even budge him. The administrator was standing there, he laughed and pointed out that I couldn't move my patient a single inch. I told him \"I didn't see your monkey suit wearing ass helping.\"                                                   I clocked out and left",
   "created_utc": 1692292169,
   "score": 93,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm7ytu",
   "message": "I was quality assurance for a place that evaluated operations involving explosives.  I was leaving soon, so my replacement was hired (I recommended against his hiring because I'd heard bad things and he seemed shady..... but they hired him anyway).  \n\nSo on his first day, I was tasked with training him on the job.  He was already highly qualified on explosives (more qualified than I was, in fact).  \n\nAnyway, as we're evaluating a couple of guys working on the internals of a live AIM-120 missile.  This clown's CELLPHONE goes off in his pocket.  To even get into the bay we were in, you have to walk past about 4 signs that say to leave all electronic devices outside because even tiny amounts of EM emissions can set off the explosives, especially when the covers are removed/dissassembled.\n\nSo I wrote up my replacement with a Direct Safety Violation and he didn't have a job by the time he got back to the office.  Quality Assurance's reputation was in the crapper for months.  That idiot could have gotten 5 people killed, including himself.",
   "created_utc": 1692299532,
   "score": 10,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlpdgk",
   "message": "Worked in a sales call center about 10 years ago, real braindead work. New guy starts on a Monday morning, after he gets trained up on the basics (which takes about an hour), he gets assigned a desk and sets off to work.\r  \n\r  \n30 minutes later, it looks like little puffs of steam are rising up from his computer monitor. Turns out he was vaping on one of those disposable ecigarettes, the kind that sort of tried to look like real cigarettes. He gets told by the boss that we can't vape indoors, and if he wants to, he'll have to go outside to do it on a smoke break. We were pretty liberal with those, you could basically just go whenever you wanted.\r  \nAbout 30 minutes later again, the same thing happens. He gets caught again, and is told in no uncertain terms that if he wants to keep his job, he'll stop vaping at his desk.\r  \n\r  \nAn hour later, he gets caught hiding beneath his desk, still vaping, and is promptly fired, all before lunch time. Dude could have just gone outside.",
   "created_utc": 1692292946,
   "score": 71,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlurqo",
   "message": "Right out of highschool I got a second job at Walmart, my first day they had me help line the shelves up, they called it zoning. I had maybe been on the clock and hour and they had me doing this I had no idea what I was doing and some Karen looking manage came up and yelled \"What in the fuck are you doing this is all wrong why would you do it this way!\" And swiped stuff off the shelf onto the floor. I respond \"I'm new, I just started a few mins ago, you don't gotta be so uptight about it\" and she got in my face and screamed in my face getting spit on my face \"what the hell did you just tell me??\" So I yelled back at her \"I SAID I FUCKING QUIT\" and just walked out.   Total time of employment : less than 2 hours.",
   "created_utc": 1692294849,
   "score": 42,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlxrp7",
   "message": "I worked at a non profit and they had hired a new admin assistant. The first half of the morning she did some mandatory trainings and then sat with me to do some more in-depth trainings second half of the morning. It was then lunch time and I said we’d continue after lunch. \n\nWhen lunch was coming to an end I saw HR walk her to her desk and walk her out of the building. Turns out she asked our CEO if she could leave early. There was so reason attached just, because. \n\nLasted a total of 4-5 hours",
   "created_utc": 1692295906,
   "score": 7,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm86m5",
   "message": "Me. Within the first two days. \n\nI wasn’t supposed to work efficiently for our clients since we charged by the hour. \n\nOops?",
   "created_utc": 1692299609,
   "score": 7,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm8h1r",
   "message": "I worked it in a high school. We hired a new hs tech. He came to shadow me for a few days. I told him don't fuck with money or kids and you're golden. Two weeks later he was dating a high school senior. Fired on the spot.",
   "created_utc": 1692299711,
   "score": 7,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm5nfs",
   "message": "On the guys first day, watching training videos, CEO walks buy and sees him with feet up and on his phone...gone before 8am.",
   "created_utc": 1692298726,
   "score": 12,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwloqpz",
   "message": "Gets hired.  Email goes out to the whole company \"please welcome this new guy to the office\". Someone googles his name. He's immediately fired. \n\nNow they do a quick Google search before hiring people...",
   "created_utc": 1692292726,
   "score": 55,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwly81i",
   "message": "New person got access to medical records system.  Week 2 - Looked up our boss and bragged about it.  Walked out and gone the second week.",
   "created_utc": 1692296068,
   "score": 6,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm0rns",
   "message": "I worked at a company where this guy had something going on with another girl at the company. Something happened between them and he sent her an email apologizing. Her last name started with an A and he accidentally picked all staff verses her name. The owner was there in 20 mins and canned his ass.",
   "created_utc": 1692296975,
   "score": 7,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm2icz",
   "message": "His interviewer said he shouldn’t be hired but HR hired him anyway due to his experience. He lasted about two weeks. He had an argument with an operations manager over a radio heard by the whole department.",
   "created_utc": 1692297602,
   "score": 6,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm34r1",
   "message": "In 2015, my department hired a Safety Communications Specialist as a contractor. On her start date, her manager walked her around the hallway and introduced her to each of us.\n\nWhen they got to my office, I introduced myself and shook her hand. Now, my first name is ***very*** unorthodox and racially I am ambiguous at best (despite being black). \n\nAfter introductions, the contractor, next to her boss and with a straight face, asked me what my nationality was. In my obviously American voice, I informed her I was an American and left it at that. I wasn't offended at all because I'm used to questions like that. However, I did think it was a bit unprofessional of her to ask such a question in front of her manager and mere minutes after starting her first day.\n\nLater that afternoon, I was in my department director's office chatting. She brought up the contractor casually and I mentioned our interaction. My director didn't say anything much on it, but I can tell you the contractor did not show up the day after or the day after that.",
   "created_utc": 1692297825,
   "score": 5,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm8dav",
   "message": "I was fired for buying nine bags of ice instead of six. I thought we'd need more (catering company). Fired as soon as I got back from the store.",
   "created_utc": 1692299675,
   "score": 6,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlzswa",
   "message": "She went through the interview process and got the job. Her first day she entered the building, saw the dog, turned around and left. Apparently, she was allergic to dogs and the dog wasn't there during the interview process. I guess technically she quit instead of being fired.",
   "created_utc": 1692296632,
   "score": 10,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlzt7d",
   "message": "I fired a woman who showed up late on the first day, in an inappropriate dress, a customer asked her something simple, she replied \"how the fuck am I supposed to know that\".  I gave her a payroll check for 3 hours work and sent her out the door. She was a sweet, intelligent woman when I interviewed her, what happened, I don't know.",
   "created_utc": 1692296635,
   "score": 10,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm3fha",
   "message": "I worked at a movie theater as a teenager. Some suits from corporate office were at the theater doing stuff, including a really beautiful young woman in her early- to mid-twenties, who was in the group wearing a short jacket and a knee-length pencil skirt.\n\n\nWe all had radios, and I was taking tickets near where the suits were hanging out talking to my boss when my radio crackled and I hear, \"Holy shit, guys, did you see the ass on that chick from corporate office?\"\n\n\nShe blushed very red, my manager went very pale, and my coworker got very fired.",
   "created_utc": 1692297932,
   "score": 11,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlrwfu",
   "message": "I used to work at a small business. A new hire made a comment in passing that he didn’t support gay marriage. Somehow he failed to realize that the two women who owned the place were a lesbian couple.",
   "created_utc": 1692293835,
   "score": 27,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlgugu",
   "message": "Started a temp jon and leader came over and addressed 3 people sitting on a couch.  They said they didn't have anything to do, so they were all sent home.",
   "created_utc": 1692289910,
   "score": 6,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlyn73",
   "message": "About a year ago I had an asshole of a coworker get fired within a weak because he was harassing a bunch of people and he made a lot of inappropriate comments to some of my female coworkers.",
   "created_utc": 1692296219,
   "score": 6,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlz3nx",
   "message": "Hired a new dude, he tried to slip a co-worker drugs within 10 minutes of being there. Fired on spot.\n\nGenuinely curious if he just goes from job to job to collect unemployment while growing his drug enterprise. Hate the game and the player I guess?",
   "created_utc": 1692296382,
   "score": 6,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm052z",
   "message": "Was caught stealing money out of the register in the first hour of him even touching the damn thing.\n\nOn a related note, had another co-worker get fired for the same thing within the last two hours of his final shift.\n\n$50 in small bills and loose coins really brings out the worst in some people.",
   "created_utc": 1692296754,
   "score": 6,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm1xmg",
   "message": "Used to work for a Telco and on day one we took a defensive driving course. During the test towards the end of the day, this idiot (who's old man was in management at the company) said \"buckle up\" and drove like an absolute maniac, assuming he was untouchable. The following morning he was escorted out.",
   "created_utc": 1692297397,
   "score": 5,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm2ups",
   "message": "Guy offered the boss cocaine on his second day.",
   "created_utc": 1692297724,
   "score": 4,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm32wc",
   "message": "My boss suspected a co-worker of having a drug problem. He would say like, \"if I find out Nick is an addict he's off the crew\". \n\nWe get news from co-worker that he died of a fentanyl overdose and my boss is like, \"that's it Nick is done here\".",
   "created_utc": 1692297807,
   "score": 6,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm3321",
   "message": "I was on a new team hired for corporate sales. They trained us as a group. We were given the task of creating a presentation with graphs and charts to show how we present to a group and given pointers on how to improve. One guy shows up an hour late, waltzes in and says he’s tired from the drive in and says he needs a coffee before settling in. We are in suit and tie and he’s wearing a dress shirt with a huge eagle on the front and jeans. He comes back a few minutes later and when asked to present he says he didn’t prepare anything, but he’s happy to answer any questions they may have about presentations. We all looked at each other in disbelief. Fired on the spot by the Manager. I heard that they asked him to return his laptop and he stiffed them for months before they sent a repo man to his door to pick it up.",
   "created_utc": 1692297809,
   "score": 6,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwm8mw8",
   "message": "I use to work construction. This new guy showed up for work 2 hours late, his dealer stopped by 5 min later, got coke, and in under 15min he was fired.",
   "created_utc": 1692299768,
   "score": 5,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlpfyd",
   "message": "Was supposed to start in the beginning of January. Was invited to the Christmas party a few week before and got drunk.",
   "created_utc": 1692292970,
   "score": 13,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlsupf",
   "message": "Guy A and guy B worked at same level since a year and when the salary hike letter came, Guy B asked Guy A, how much % increment did he get? \n\nGuy A had received more, Guy B got jealous and confronted HR immediately asking why did he receive less % hike than Guy A. \n\nHR called in Guy A and asked him to pack his shit for sharing his salary. \nGuy B didn’t get more salary but kept the job.",
   "created_utc": 1692294173,
   "score": 13,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwls2ec",
   "message": "So this happened when I worked at Hertz rental car \n\nSo I worked at a small location in Hertz based in a hotel so I had to do a move to the airport ok nothing too hard ^^ . So after pulling the car into the rental return lane. A big commotion happened in the supervisor's office. One of the staff members told me to wait a second because it seems there was a heated argument between the supervisor and what looked like a new hire. I only heard half of the conversation and the way it sounds that this kid was clearly entitled. Thanks to Daddy knowing somebody who got him the job .  So the argument lasted maybe a good three to four minutes and then the kids stormed off and said to me and my co-worker you better go back to wherever you came. That man is a jackass ( He uses more colorful language which i will not put up on here) I walked in to tell him we're here with the vehicle transfers and needed to see what vehicles we could take back to the branch. He looked clearly. Fumed like dude he needed a drink . I just stood there like hey. Is everything okay bro?  He looks at me and says have you ever met somebody so entitled that they think they could control how we operate the car cleaning operation? I said unless it's a small branch I don't think so and well he just says well at least that kid is no longer working here . So he told me where the cars at. Then we headed  back to the branch. Told the manager at our branch a few hours later about what happened. Oddly enough, an incident email was sent out about that same kid stating if he applies to your store. Deny him immediately if somebody calls your branch saying they represent this individual. Do not deep bold letters. Do not engage with them without saying the regional manager will handle you, which he won't  \n\nSo yeah TLDR - An entitled kid thinks he could control the car cleaning station at the airport. Got fired for trying that",
   "created_utc": 1692293893,
   "score": 10,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwltotk",
   "message": "This pilot I know got fired with in the first hour on his very first day for showing up to work with his collar button undone. Unfortunately for him, the CEO of the airline saw him as he exited the elevator before his duty even started and fired him on the spot.",
   "created_utc": 1692294469,
   "score": 11,
   "submission_id": "15tpi0i"
  },
  {
   "comment_id": "jwlzyvm",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15tpi0i"
  }
 ]
}