{
 "submission_id": "15tpxz1",
 "title": "What’s the most disgusting thing you have seen in a restaurant?",
 "selftext": "",
 "created_utc": 1692284229,
 "permalink": "/r/AskReddit/comments/15tpxz1/whats_the_most_disgusting_thing_you_have_seen_in/",
 "score": 190,
 "url": "https://www.reddit.com/r/AskReddit/comments/15tpxz1/whats_the_most_disgusting_thing_you_have_seen_in/",
 "comments": [
  {
   "comment_id": "jwlgtq9",
   "message": "Actual human shit roll out of someone's pants leg. They didn't seem to notice or mind.",
   "created_utc": 1692289903,
   "score": 172,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwll9wv",
   "message": "I was working as a server at a steakhouse. Think something like... about as nice as an Outback. Not that nice, but the servers are wearing ties. \n\nBig party comes in, maybe 8-12 people. They sat down and we're taking drink orders. One lady asked for 2 to-go boxes full of ice. Strange request, but okay. \n\nWe bring them drinks and her 2 to-go boxes full of ice. Come back to the table a few minutes later and the boxes were nowhere to be seen. Until my coworker pointed them out. \n\nShe had taken her shoes and socks off and had her bare feet in the boxes of ice. At the table. In the middle of a full dining room.",
   "created_utc": 1692291489,
   "score": 52,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlnbj4",
   "message": "A woman changing her baby's diaper on one of the tables. Before you throw hate at me, there were changing tables in both bathrooms.",
   "created_utc": 1692292221,
   "score": 70,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwl35p0",
   "message": "A napkin run across a floor. It was really a rat that somehow had a napkin draped over it but it was surreal and super funny to watch. We'd joke about eating at the place that held napkin races any time no one could come up with a place to eat then usually someone would be like \"Naww, let's just hit up _________\".",
   "created_utc": 1692284987,
   "score": 142,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwloto5",
   "message": "In my pest control days. I watched a cook start up a flat top with mouse dropping all over it. He cooked chicken in the shit and served it up to an unsuspecting customer. I called the dept of health on them. It was appalling.",
   "created_utc": 1692292755,
   "score": 20,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlkt5t",
   "message": "The owner was snacking out of the garnish tray for the bartenders. Just snacking on the lemon wedges and sugar sticks meant for the drinks. She was putting her fingers in her mouth and then diving back in for another cherry or orange wedge right there at the bar in front of me and a friend. I looked at her and said, \"What you're doing is fucking disgusting, those go in people's drinks and you're putting your gross fingers in there\". She scoffed and walked away. The bartender came over and thanked me for saying something and explained the staff tells her that all the time, but she doesn't listen because she's the owner.",
   "created_utc": 1692291324,
   "score": 89,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlj8tn",
   "message": "Truly amazing food in Nola. Cockroaches running on the wall (it’s the French quarter, everyone has roaches).  I need to go the bathroom, it’s a closet in the outdoor courtyard. Where apparently the kitchen is as well.",
   "created_utc": 1692290768,
   "score": 92,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwl9s6e",
   "message": "I used to make deliveries to a bunch of places in downtown urban locations...several Jamaican bakeries.  All but one were immaculately clean.  The other one...oh my gods, so gross.  There was always a guy in back chopping chicken into pieces and throwing them into a 5-gal home depot bucket that always had flies buzzing around and landing.  Sometimes pieces would fall on the floor and they'd just pick them up and throw them in the bucket.  Blood and viscera on almost all surfaces. A REALLY scary basement with goats hanging on hooks, also with flies on them.  I would throw up in my mouth almost every time.  Needless to say, I'd never eat the free food they'd offer.",
   "created_utc": 1692287370,
   "score": 237,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlg0rr",
   "message": "A single person bathroom with a backed up toilet full of diarrhea. Management didn't seem to care",
   "created_utc": 1692289613,
   "score": 152,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlk4ro",
   "message": "I guess Starbucks counts as a restaurant, so a couple Christmases ago, I stopped in for some coffee after getting a couple gifts. I immediately see multiple baristas petting a dog I assumed to be their manager's, but they went back to handling the food and drink without washing their hands, so I walked back out.",
   "created_utc": 1692291082,
   "score": 255,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlncz8",
   "message": "Was hired on at a place. My first shift I saw the dessert and shake station was a mess... I started to clean up, I opened lowboy and saw what I thought was someone had dumped like a 5lb bag of oreo crumbles.\n\nWas not oreos.. Was a mound of mold. I think I was the first person to open the lowboy in a minute.\n\nI walked up to owner who was in the dining room and threw my apron at him and said loudly \" you don't pay me enough to kill kids.. your being reported, this place needs shut down.\" And told a Lady with a milkshake to not drink it. And left. \n\nYea that was fuckin horrific.",
   "created_utc": 1692292235,
   "score": 76,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwllagc",
   "message": "Condensation above a buffet turning brown and dripping back down on the food.",
   "created_utc": 1692291494,
   "score": 22,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlp4zt",
   "message": "Drunk guy pissing himself in the middle of Applebee's while grinning and making eye contact with me (10 yrs old at the time).",
   "created_utc": 1692292865,
   "score": 218,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwls6xc",
   "message": "Former Souz chef in university for a seafood and Chophouse. We butchered, but not live animals (so technically cut meat and entrails). We were a really upscale and on the level place. However, our owners also owned a local brewery and restaurant.\n\nOur old fish went to them. Our old everything went for them. They made sausages from old meat and used beer barley and hops. People loved them. Couldn't get enough, watching those people lick their fingers clean was an event.\n\nHowever the worst part was shoveling entrails and carcasses into bags for trash. Not on garbage night. In bear season. Next morning about 100lbs of pig, chicken, fish heads and scales, along with a copious amount of blood and shit was all over the driveway, the roadside, and had been dragged up and down the road, to the neighbours, our back of house.....\n\nWe all, including our $75/hr chef are all in dishwasher black rubber boots and aprons and gloves, masks on, goggles and bandanas, scrubbing the walkway. We looked like a biohazard team cleaning a mass murder scene. So yes, the cops were called and we had a great time explaining everything (they knew it was animal, not human. No one else did tho).  This was dead-end of summer, around 95° out. I still smell it sometimes when passing chicken farms and PTSD is real.",
   "created_utc": 1692293938,
   "score": 41,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwleaf9",
   "message": "I helped a friend re tile a kitchen in a restaurant on Granville Island in Vancouver. A pretty nice place. When we were up to the top of the wall and looked into the ceiling space there was about half an inch of rat feces. This was about ten years ago.",
   "created_utc": 1692288975,
   "score": 225,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlqhzx",
   "message": "In a very posh restaurant a man early 60s smart suit on what looked like a first date. They chatted happily ordered wine and steak the meal was served he cut his steak while chatting looked into her eyes and dipped his steak into her red wine up to his knuckles opened his mouth wide and threw it in picked up a chip and repeatedly duncked that in her drink while she looked on shocked he wiped his fingers on his tie and drank his drink she looked visibly shocked she went to the toilet and snuck out the back and away into the night. he got a call spoke at top note to I assume a friend about how a steak meal guarantees a booty call its on tonight I ate slowly to watch him realise she had left one hour later he got madder and madder screaming into the phone at her number calling her horrid things that lass had a very lucky escape",
   "created_utc": 1692293338,
   "score": 127,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlhfws",
   "message": "Worms squiggling around a toilet in a bathroom. (Indoors)",
   "created_utc": 1692290124,
   "score": 100,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlm87e",
   "message": "Dead cockroach in the salt shaker. I served at the restaurant, and my grandma found it when her and my grandpa came in for lunch. They did not come in for lunch anymore.",
   "created_utc": 1692291828,
   "score": 195,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlv7el",
   "message": "As a waiter: watching the \"chef\"/owner scooping spaghetti out of the steam table with bare hands and plopping it on a plate. We didn't call the resort \"Shithole\" (Chateau) \\[name redacted\\] for nothing.\n\nEdit: Same place. Fermented ketchup exploding onto guests (refillable glass bottles stored in a hot kitchen that were topped off and not emptied, washed, and refilled fresh). Oh, the 80s were a magical time for food health and safety...",
   "created_utc": 1692295000,
   "score": 166,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlvkyu",
   "message": "Working at a restaurant I pulled back the slushie machine because I smelled something off coming from behind. The smell was black mold. I quit on the spot and reported the restaurant to the health authority.",
   "created_utc": 1692295132,
   "score": 200,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwllqvp",
   "message": "Our dog had previously eaten quite a lot of shit he found in the woods (turned out it was human feces), then he puked it out in the middle of a busy restaurant.",
   "created_utc": 1692291656,
   "score": 19,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlnkh5",
   "message": "Watched a kid take a spoonful of cookie dough and eat it then put the spoon back in the container. This was one of those build your own frozen yogurt places with 100 different toppings.",
   "created_utc": 1692292309,
   "score": 126,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwloghw",
   "message": "Buddy ordered a burger. Took two bites then tasted something strange. It was a band aid. A used band aid.",
   "created_utc": 1692292625,
   "score": 183,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlq9rd",
   "message": "Party of 10. White table cloth restaurant. Party leaves. When we approached to clear the table, they had used the corner of one table cloth to wipe their babies shitty ass.",
   "created_utc": 1692293259,
   "score": 174,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlqki3",
   "message": "I worked a single night as a dish rat in a $60 plate restaurant back in the 90s. It was Halloween, so the waitstaff was wearing costumes. \n\nThis one really thin girl, dressed up in a Playboy bunny costume, finished nearly all the food off the plates coming back. She ate everything with her hands, including chocolate mousse. I was shocked and she noticed me staring. Burned into my mind is her turning to me, with a fingerfull of mousse and saying \"You want to try?\"\n\nNot really that gross compared to some of these other ones, but it was my first and only time seeing behind the scenes in a restaurant so it made an impression. Poor waitress was probably starving.",
   "created_utc": 1692293362,
   "score": 60,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlu5fb",
   "message": "Cutting raw and cooked chicken on the same cutting board at the same time. The kitchen is open and you can see what's going on from the dining area. Everything comes pre packaged, they don't have anything fresh. Haven't eaten there ever since",
   "created_utc": 1692294631,
   "score": 87,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwl1bdb",
   "message": "People f******",
   "created_utc": 1692284307,
   "score": 43,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwltbbi",
   "message": "I saw Clarence Thomas in a Chinese food place in Alexandria.",
   "created_utc": 1692294336,
   "score": 141,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwl7fe1",
   "message": "I used to make booze deliveries. I saw a giant puddle of still water in a Wasabi’s kitchen with like a hundred bugs flying around it. People were cooking right next to it. Extra protein I guess?",
   "created_utc": 1692286533,
   "score": 34,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlqad0",
   "message": "People getting it on in the woman’s bathroom. I was 6. And very confused. Nowadays, at almost 18 years old, I am disgusted.",
   "created_utc": 1692293264,
   "score": 27,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlsj9t",
   "message": "Was in a McDonald's once in downstate Virginia. Went in the men's room and walked into a stall only to notice that someone had EXPLOSIVE diarrhea all over the side of the wall.  Looked like someone smeared chunky brown paint everywhere. \n\nWhoever worked there tasked with cleaning that disaster should've quit immediately.",
   "created_utc": 1692294060,
   "score": 33,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlsx8p",
   "message": "I used to work at an Italian restaurant where there was a used tampon sitting around in the back of the kitchen. Of course, no one wanted to touch it so it sat there for the entire time I worked there. They never cleaned the back of the kitchen",
   "created_utc": 1692294198,
   "score": 102,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlo63e",
   "message": "Not in a restaurant, butva food court.\n\nI was having lunch with a friend and I thought I had stepped on her foot, so I playfully pressed harder but she didn't respond.\n\nA woman sitting on a table next to us screamed that there was a rat squirming under my shoe.",
   "created_utc": 1692292523,
   "score": 134,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwli3xo",
   "message": "Some child pooped their pants. Wasn't very hungry after smelling that.",
   "created_utc": 1692290363,
   "score": 40,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlt2ld",
   "message": "I was a high school janitor years back. While cleaning the boys locker room I found a coconut in one of the toilets. But it wasn’t really a coconut, it was a giant poop that could flush. Obviously I called all the other janitors over to see the monstrosity and help decide what to do with it. When Mr Tidy Bowl himself walks over he takes one hand and scoops it up like he’s picking up a softball then just chucks it in my trashcan and goes back to work like we just wasted his time.",
   "created_utc": 1692294251,
   "score": 91,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlu6ff",
   "message": "Worms in a fish. \n\nWorst part, it was my father's restaurant. The guy who was in charge of grilling fishes only worked there for a month and he actually cooked fishes that were too old and badly refrigerated... he saw the worms and still cooked them. \n\nHe was promptly fired XD",
   "created_utc": 1692294641,
   "score": 73,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlouem",
   "message": "The wrist band of a rubber glove. Two bites left of my fish tacos. Bill was comped. Offered free dessert. No thanks. My appetite is gone.",
   "created_utc": 1692292763,
   "score": 37,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlu2b1",
   "message": "A rat ran out from the kitchen and jumped on a table people were eating at. They all screamed, the rat ran along the table on the booth/table trying to find a way out but essentially took the worst route possible.\n\nThis wasn't a high-end place and none of the wait stuff seemed that bothered, they had a similar attitude to if they had brought you the wrong meal. Like apologetic, but it's not a big deal. Which gave the impression this happens all the time and it was just another day for them.\n\nSo we stopped going there.",
   "created_utc": 1692294601,
   "score": 69,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwm13gy",
   "message": "Not a restaurant but a Publix deli. My husband ordered a fresh sandwich and stood by as the lady made it- she went to grab another pack of meat and as she came back, grabbed the dirty ass trash bin with her gloved hands to move it out of her way, then proceeded to continue making hub’s sandwich- without changing her gloves. He told her he didn’t want the sandwich anymore and she just looked annoyed and threw it in the garbage. Hub walked away without ordering anything else. \n\nChanging gloves after touching anything that’s dirty/handled frequently is food safety 101, and the fact she thought she did nothing wrong was baffling. I left a review about it and we haven’t been back to that location since. It’s a shame because they made nice pub subs.",
   "created_utc": 1692297093,
   "score": 39,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwl16ay",
   "message": "Puke",
   "created_utc": 1692284255,
   "score": 16,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlpvow",
   "message": "I suggest you don't read any more of this post if you're eating.\n\nOne time my parents and I were on a trip and stopped at Burger King. I ate my meal then went to the restroom. There was a urinal that was overflowing with vomit. There was an \"Out of order\" sign above the urinal, and someone had written \"Barf Bowl\" on the sign with a sharpee.\n\nI'm glad that I:\n\n1. Had already finished my meal\n2. I didn't puke myself after seeing it",
   "created_utc": 1692293122,
   "score": 28,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlqa7m",
   "message": "Steakhouse I was a server at had the tall tray holders you could put several trays of food on. This one happened to be all steaks. \n\nAs it was being rolled by a kitchen employee from fridge to grill area it toppled over spilling steaks out all over the floor. \n\nSaid employee pulled the steaks from the ground and proceeded to put them back on the tray to cook. Looked at me and said “the grill will kill whatever is on them anyway.”\n\nGodspeed Logan’s Roadhouse. Your brief stay in my town humbled us all.",
   "created_utc": 1692293263,
   "score": 52,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlr5oy",
   "message": "Not me, but I'm friends with a health inspector. He told me that one time he saw a mummified mouse hanging from a drop ceiling in the kitchen. He immediately shut down the kitchen and ceased operations until cleanliness was improved. He won't tell me which restaurant tho.",
   "created_utc": 1692293571,
   "score": 48,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwluy1b",
   "message": "In Thailand our favorite restaurant the waitress laying on her back while the cook combed the Lice nits out of her long black hair! I can never unsee it, lol!",
   "created_utc": 1692294910,
   "score": 49,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlprgw",
   "message": "Someone changing their kids diaper in the booth then leaving it on the table when they left.",
   "created_utc": 1692293082,
   "score": 17,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlkhd2",
   "message": "I ran into an ex girlfriend at Taco Bell once.",
   "created_utc": 1692291208,
   "score": 38,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwl1h6l",
   "message": "An old man eating his food as his runny nose ran into what he was eating.",
   "created_utc": 1692284367,
   "score": 10,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwllez7",
   "message": "One of my friends worked at as a waitress at a chain restaurant. She told me they had a roach infestation and management was doing nothing about it, she advised our friend group not to eat there since they had found some roaches in the food.",
   "created_utc": 1692291540,
   "score": 26,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlp8vp",
   "message": "a guy shaking his meat in the bathroom, he left the door open",
   "created_utc": 1692292902,
   "score": 4,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlqxh7",
   "message": "One of the cooks pissed in the cooler. He was almost blind drunk, and just dropped trou and started pissing.",
   "created_utc": 1692293490,
   "score": 17,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlzque",
   "message": "In-N-Out in SoCal. Saw a man chow down on his double-double, then immediately throw up into his red tray. He just kinda sat there shocked, and nobody else seemed to notice but me. It was surreal honestly.",
   "created_utc": 1692296611,
   "score": 74,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwltyjp",
   "message": "Donald Trump three tables over at Spagos.",
   "created_utc": 1692294565,
   "score": 25,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwl1b6z",
   "message": "I’ve witnessed cutlery, trays and once food be dropped on the ground and not washed/discarded. I am a potwasher. I see and hear everything.",
   "created_utc": 1692284306,
   "score": 9,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwm3m30",
   "message": "A family of rats gallivanting in the premises. They looked well fed too",
   "created_utc": 1692297998,
   "score": 40,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlhgbz",
   "message": "I worked in a restaurant that also functioned as a bar/venue on weekends. A rat ran in through the propped open door one weekend and no one saw it again. Days later I was serving a table and it smelled awful and they were all joking that the other person was farting (thank god they were unaware) and at the end of the shift we found it dead under the bench for that table. The benches were like storage bins where the seats fold up so no one could SEE it but you could for sure smell jt",
   "created_utc": 1692290128,
   "score": 7,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwltmvm",
   "message": "Food wise - Worcestershire sauce flavoured ice cream.  Yep, it tastes as grim as it sounds.\n\nOther things - a turd **on top** of the toilet cistern.  Someone went to the effort of climbing up there to squeeze one out... 😲",
   "created_utc": 1692294450,
   "score": 23,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlu2k0",
   "message": "Two pieces of fried chicken held together by a single piece of hair. We called it dingleberry chicken. Happened like 25 years ago.",
   "created_utc": 1692294603,
   "score": 48,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwm1a0q",
   "message": "Me and my ex went into a McDonald's in Slidell, Louisiana in the mid 90's,  and ordered McRibs- I specifically remember because 2 seconds after I completed my order a lady came running in with a lifeless baby, yelling about how she dropped her baby. I was unconscious for sure. \n\nShe laid the lifeless body of this baby next to us on the counter. The manager was doing cpr. Meanwhile, the crew is serving our food next to all this. The manager did not get the baby breathing before the ambulance took it away. We had lost our appetite after the dead baby thing .It was a weird day.",
   "created_utc": 1692297159,
   "score": 80,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlj9sp",
   "message": "A dead mouse in an empty carafe of coffee - the entire thing had been served before anyone noticed the mouse.",
   "created_utc": 1692290777,
   "score": 8,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwln2io",
   "message": "First time I went to the Philippines, we took an overnight flight. Arrived around breakfast time, so my ex's brothers took us out for a meal in Manila. I'm sitting there jet-lagged, and I look up at the ceiling, and it looks like the design is moving. I figure I must be really out of it, and I look a little closer. It *is* moving. It's a lizard, one of many that were splayed across the ceiling. \n\nBut that wasn't the worst of it. They had built in planters to separate the booths, so I was sitting with a mass of fronds behind my head. I watched bemused as a cat crawled around the planters, and then I sat in disbelief as the cat decided that six inches from my head was the perfect place for a smelly bathroom break.",
   "created_utc": 1692292130,
   "score": 9,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlwqd2",
   "message": "The wage disparity between staff.",
   "created_utc": 1692295535,
   "score": 13,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlpuhx",
   "message": "It was at an all you can eat buffet, where you walk past the food and drop it on your plate (peak luxury, i know), and some guy just coughed and burped right above the food. Didn't even cover his mouth.",
   "created_utc": 1692293111,
   "score": 20,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwm0lyf",
   "message": "Baby getting full diaper changed at the table next to us.  \n\nEating experiences usually don't feature as much feces.",
   "created_utc": 1692296919,
   "score": 3,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwm0xus",
   "message": "Someone clipping toe nails inside McDonald's for everyone to see and yes, the foot was directly on the table ....",
   "created_utc": 1692297037,
   "score": 31,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwmgysn",
   "message": "Was in the restroom and one of the cooks (was wearing an apron) came out of the stall just at the same time as I just finished washing my hands. He came out of the restroom at the same time as me, didn't wash his hands or anything...just after going #2!!! I went right back to my group just as the waitress was bringing the appetizers and said, \"Don't eat any of that! Please get the manager!\" Proceeded to tell the manager and point out the cook and she had the audacity to say \"You sure it was him and not someone else?!\" I replied, \"No Karen, clearly there's another patron here with a kitchen apron on sitting at a table...\"(I looked around dramatically) and said loudly, \"Yup, it was your cook over there that just took a dump and didn't wash his hands...we are NOT eating anything here!\" A few other patrons took note, got up and left and we did too without paying for a single thing!",
   "created_utc": 1692302689,
   "score": 37,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwmc1u0",
   "message": "Someone leave one of those fake bills that’s actually some weird Jesus advertisement as a tip. Fucking gross.",
   "created_utc": 1692300954,
   "score": 18,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwm4vi4",
   "message": "At a certain diner chain that rhymes with Penny’s, you pay your bill at a counter on your way out. While waiting, I noticed what looked like drops of blood. The pattern of the drops looked like a line of morse code, like somebody’s ass should be at an urgent care rather than a diner. I’m looking around from my spot in line, disgusted and highly curious, for wherever this blood is coming from. The trail leads back to a random dude chillin in line with his homies right in front of me. Blood is profusely dripping down his arm from a makeshift saran wrap bandage near his elbow, like he just got tatted or something. There was so much blood, you could probably follow it back to the table he was at.  No one seemed to care when I brought it up to the cashier and manager, and no one was cleaning it. People were stepping in it and tracking it all over. I was like Hellooo… blood here… pathogens.. where we ate!",
   "created_utc": 1692298448,
   "score": 16,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwmc5lp",
   "message": "I've been a chef for two decades  \nIf you regulary go out, or order, if you can imagine it, it's probably happened to something you got served, and you didn't notice a thing when you ate it.  \nIt doesn't matter what 'quality' the food or restaurant was.  \nI never ever fucked with anyone's food, that shit is so far beneath me I can't even see it.",
   "created_utc": 1692300991,
   "score": 11,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlw1zz",
   "message": "I’ve worked at family owned dinners, corporate owned place, and very expensive steak houses. I have seen everything you can imagine. Rats, roaches, alcoholic cooks who haven’t showered in days.",
   "created_utc": 1692295297,
   "score": 13,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlzuqm",
   "message": "One time a family of cockroaches fell from the ceiling right into my plate of food",
   "created_utc": 1692296651,
   "score": 13,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwm08au",
   "message": "Oh there's so much. I spent 18 years in restaurants and have seen all kinds of grossness. Although I think the worst was a dude who was actually the manager at the time busting a nut on someone's pizza between the sauce and cheese.",
   "created_utc": 1692296785,
   "score": 12,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlwwku",
   "message": "Not sure if Domino's classifies, but we went in to pick up our food and the mf behind the counter making pizzas put seasoning(?) on the crust then licked ALL of his fucking fingers, then CONTINUED MAKING THE PIE.\n\nI contacted corporate who apologized and offered me a free pizza like I'd want that nasty shit.",
   "created_utc": 1692295596,
   "score": 10,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlvag7",
   "message": "Not in the restaurant, but ordered from the restaurant. Boss’ wife ordered meatballs on pilaf. One of the meatballs was moving",
   "created_utc": 1692295030,
   "score": 9,
   "submission_id": "15tpxz1"
  },
  {
   "comment_id": "jwlwcja",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15tpxz1"
  }
 ]
}