{
 "submission_id": "15tqyrd",
 "title": "What infamous movie plot hole has an explanation that you're tired of explaining?",
 "selftext": "",
 "created_utc": 1692286512,
 "permalink": "/r/AskReddit/comments/15tqyrd/what_infamous_movie_plot_hole_has_an_explanation/",
 "score": 163,
 "url": "https://www.reddit.com/r/AskReddit/comments/15tqyrd/what_infamous_movie_plot_hole_has_an_explanation/",
 "comments": [
  {
   "comment_id": "jwm0l72",
   "message": "The first rule of fight club, and their growing number of members is because it is meant to teach the members to break rules.",
   "created_utc": 1692296912,
   "score": 184,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwluv38",
   "message": "Everyone always asks why there was a desert in Washington DC in Transformers 2. It has been clearly explained in a ton of discussions of that movie that it was just a really bad movie.",
   "created_utc": 1692294881,
   "score": 192,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwl8y5r",
   "message": "From Independence Day\n\n“How could a virus programmed on Earth computers destroy the computer system of an alien civilisation?”\n\nIn a deleted scene, it’s revealed that technology from the spaceship at Area 51 was harvested and used as the basis for most of Earth’s post WW2 computer technology. Once you know that, the whole thing becomes a lot more believable.",
   "created_utc": 1692287077,
   "score": 202,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwl9gsv",
   "message": "Lord of The Rings.  The Eagles. They are not a Taxi service,  they would be subject to the ring influence too, there are flying Nazgul that could intercept them, there is a big fucking spotlight eye that could shine on them the moment they approach the boarder of Mordor, failing all that, an entire army of Orc could wait at Mount Doom making any approach impossible. Edit: the Eagles are sentient and sapient They are not mindless beasts that just do whatever the rider wants.\nEdit 2. I'm not a Tolkien expert. I'm a dungeon master and have to smack down my players crazy ideas all the time.\nEdit 3: they could be carried part of the way.  Oh? With Sarumon the white and his raven spies everywhere and the ability to targeted blizzard and force the eagles to land in a army of Urukhai. \nThe Eagles are demigods and more susceptible to the rings power. It works in proximity too. Borimir fell under its influence.  Gollum killed his brother only just seeing it.  Heck the council of Elrond almost came to blows being near it.  Galadrial lost her shit for a good minute just being offered it.",
   "created_utc": 1692287258,
   "score": 44,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwll335",
   "message": "Jack and Rose couldn't both fit on the door in *Titanic*. In the movie, they try to both get on the door and it capsizes, because the door isn't buoyant enough with both of them on it. Jack then gets off the door so Rose can get more of herself out of the water. It's in the movie. They try to do it in the movie and it doesn't work. It doesn't matter how much surface area the door had, it's the buoyancy of the door that was the problem.",
   "created_utc": 1692291422,
   "score": 126,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlwqyy",
   "message": "[deleted]",
   "created_utc": 1692295541,
   "score": 89,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlt8c6",
   "message": "Dark Knight Rises - how did Bruce Wayne magically get to Gotham after he escaped the hole?\n\n\n1. In an adjacent scene it's mentioned the bomb will go off in a month, so we can assume that's how long he has to get back to Gotham.\n\n2. Wayne Enterprises has offices around the world. All he needs to do is get to an office, log in, and wire himself money or supplies to get home. He's Batman, he can easily do this without being noticed\n\n3. Batman Begins has a whole sequence of him traveling around the world penniless and nameless. This is a specific skill it's already established he has. \n\nThere are tons of plot holes in that movie, but for some reason people get hung up on the easiest one to explain",
   "created_utc": 1692294308,
   "score": 182,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwluwip",
   "message": "For the people who spend all the Star Wars movies saying, \"why don't they just Jedi Mind trick everyone into doing this or that,\" Obi-Wan is very clear the first time he uses it that it works on the \"weak-minded.\" \n\nI think the way Storm Troupers function throughout the first three films shows they aren't the sharpest tools in the shed and are probably bred/trained/selected to do whatever without question and just be cannon fodder.",
   "created_utc": 1692294895,
   "score": 201,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm8dq7",
   "message": "The flaw in the Death Star's construction. We didn't need Rogue One to explain it was a deliberate sabotage. \n\nSo an exhaust port has a flaw. It is not unreasonable to believe that the flaw was necessitated for efficiency.  Knowing that the flaw was inevitable, the trench leading up to the port was protected with gun towers. \n\nTarkin, along with other officers, fully believed that the Death Star was superior in its construction that small fighters would pose no threat to them. During the rebel assault, an officer pointed out to Tarkin that the rebel attack is exploiting this weakness and offers to prepare a transport for him, to which Tarkin responds, \"Evacuate? In our moment of triumph? I think you overestimate their chances.\" \n\nTo them, the weakness is negligible that there is no chance a rebel fighter would be able to drop torpedos into the port. And they were right. The first fighter to make an attempt failed. Luke was only able to succeed because he used the Force instead of the computer, something no one anticipated because they all believed that the Jedi were extinct.",
   "created_utc": 1692299678,
   "score": 180,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm6d9u",
   "message": "One of  Charles Foster Kane’s servants was outside his bedroom when Kane said “Rosebud.” The door was wide open. The dialogue later confirms that a butler heard Kane’s dying words and reported it to the paper.",
   "created_utc": 1692298977,
   "score": 75,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmdill",
   "message": "Tom Cruise is NOT the Last Samuria, Ken Watanabe is. Cruise is just the POV character. Its not a white-saviour movie, but instead is a white colonialist learning about the value of native cultures and people.",
   "created_utc": 1692301471,
   "score": 45,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlxxff",
   "message": "[removed]",
   "created_utc": 1692295963,
   "score": 91,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlp1cq",
   "message": "Not a plot hole as such, but people complain about creepy emo Peter in Spider-Man 3.\n\nHe is being infected by the suit.  At first he is a bit cocky and women like it.  But as it progresses he gets creepier and evil.\n\nHe is supposed to be emo and creepy and it is supposed to be bad.",
   "created_utc": 1692292830,
   "score": 59,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm8kvm",
   "message": "Two of them.\n\n1. Stephen Spielberg's \"AI\" has an ending that is widely misunderstood. Those creatures at the end are not aliens, but hyper-advanced future robots. As aliens the ending makes even less sense.\n\n2. Star Trek 2: The Wrath of Khan. It's a common Trekkie question about how Khan could possibly recognize Chekov, since the character had not yet joined the cast during Khan's original episode in the first season.\n\nEasy explanation was that the character was there, but met Khan off-screen.",
   "created_utc": 1692299748,
   "score": 185,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlcfq6",
   "message": "In Wreck-It Ralph Felix could not fix vanellope with his hammer\n\nThat's because he lives in a world of a video game. A lot of older video games had damage states/values for entities \n\nHis hammer is not repairing the code or resetting it to its default state It is simply resetting the damage value of that object back to zero\n\nHe couldn't fix vanellope because her damage is not damage she is an entity took It is damaged due to King Candy / turbo intentionally sabotaging her code blocks and most importantly removing the links that connects them to the overall network\n\nThis is why she is able to exist in sugar Rush but not leave\n\n with her code severed the way it was and having those connections destroyed her entity data could not be passed to other devices. It's like she was isolated from an arcade-wide sort of internet as their conscious technically exists separate from their body\n\nTheir conscious exists within a block of code\n\nFelix can't fix that. Despite his mantra of I can fix it he can't\n\nHe doesn't know how to manipulate the code his hammer just resets damage values. And that's why he couldn't fix vanellope.\n\n((Also I think I have a potential explanation to the whole idea of why majority of characters in that universe don't really seem concerned by the whole danger of dying outside of your game but I'll save that for another thread as that one's more of a theory))",
   "created_utc": 1692288306,
   "score": 224,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm4hrw",
   "message": "Maybe not a plot hole per se, but Armageddon. People always parrot the statement “wouldn’t it be easier to train astronauts to drill, rather than teach drillers to be astronauts”. The premise of the movie is ridiculous (and an awesome dumb movie imo) but the movie explains it very clearly.\n\nFirst of all, only part of the team are drillers. There are still astronauts actually flying the shuttles. All the drillers were trained to do was spacewalk and survive while drilling in space. Secondly, the film shows that they did try training astronauts how to drill but they were failing at it. Bruce Willis’s character had created the most advanced drill that was needed to drill the asteroid but it was complicated to use. With the time crunch, Bruce Willis explained that there was not going to be enough time to teach them properly and it would be easier to teach the experienced drillers how to do spacewalks. \n\nAgain, the premise is ridiculous but it is explained pretty clearly. Besides, Payload Specialists are a real thing NASA uses so it’s not that outlandish.",
   "created_utc": 1692298313,
   "score": 112,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm7qvr",
   "message": "Home Alone - it’s very clearly explained how they paid for the trip to Paris and that Kevin’s dad didn’t foot the bill",
   "created_utc": 1692299455,
   "score": 61,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm8y6w",
   "message": "\"how did andy re-attach the poster after he crawled into the tunnel?\"\n\nhe didn't. the poster was only attached at the top, as evidenced by the scene where he is seen digging into the wall under the poster, then looking out when he hears someone coughing, then ducking back under it - the poster is CLEARLY securely attached at the top but freely moving at the bottom, thus allowing andy to lift it/let it fall back down whenever he needed.",
   "created_utc": 1692299876,
   "score": 8,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlv362",
   "message": "Han Solo knows what a parsec is. He was bluffing what he thought was a couple of yokels. The scripts says as much, and there’s a reaction shot.",
   "created_utc": 1692294960,
   "score": 95,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm185t",
   "message": "Superman didn't make the earth spin backwards to turn back time. He flew so fast he traveled back in time, the earth stopping and spinning backwards is from his perspective as it would appear to rotate reverse as he travels back in time.",
   "created_utc": 1692297141,
   "score": 32,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlbt9d",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmc5fh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm87io",
   "message": "The Karate Kid.\n\nBoth Johnny Lawrence and Dutch both score on kicks to the face in the All Valley Karate tournament.\n\n  The crane kick is legal",
   "created_utc": 1692299618,
   "score": 87,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmeaa1",
   "message": "Is there some kind of Mandela Effect going on with the Titanic movie?\n\n\"Why doesn't Rose let Jack get on? They can both fit!\"\n\nJack does try to get on.\n\nIt starts to sink with both of their weight on it.",
   "created_utc": 1692301740,
   "score": 61,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlh5jf",
   "message": "There are no plot holes in \"Signs.\"\n\nNot providing very much information is not the same thing as a plot hole. We aren't given enough information about the aliens to determine their motive for coming to a planet where the atmosphere is deadly to them. But there are numerous potential explanations.",
   "created_utc": 1692290020,
   "score": 80,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm364z",
   "message": "If you watched your child grow up for years, you wouldn’t suddenly say, hey, doesn’t he look like that kid we knew for a week 30 years ago? Especially because there were no pictures of “Calvin Klein”. You’d probably just see the designer and assumed that was who you met.",
   "created_utc": 1692297838,
   "score": 238,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlzj6m",
   "message": "The McFly's briefly meet a guy named Marty in high school. They had no pictures of him. Their youngest son kind of reminds him of the guy. But they don't know about time travel. George trusts his wife. \n\nGeorge never stood up for himself. By punching Biff, he got a confidence boost. This changed the course of his life for the better. Biff never recovered.",
   "created_utc": 1692296535,
   "score": 242,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlrn6j",
   "message": "I’m tired of these threads being filled with answers about big-budget blockbusters, so I’m going to talk about a movie I’ve been thinking about since I was thirteen.\n\nIn Pokémon: Lucario and the Mystery of Mew, everyone always brings up how Sir Aaron got through the Tree of Beginning without getting attacked by its antibody defense system, while Ash and his companions all nearly got killed by them while travelling through the Tree. But there’s a scene that shows Kidd, an adventurer in the group, sending these little drones to take samples from the tree, triggering its defenses. The antibodies only start attacking the humans after this scene. When Sir Aaron went through the tree previously, he likely didn’t trigger the defenses and got through unscathed. \n\nAlso, people think that Lucario should’ve gotten sick from the chocolate bar he eats at one point. But Lucario is a Pokémon, not a dog, so there’s no evidence that chocolate can harm him.",
   "created_utc": 1692293744,
   "score": 210,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm7qbr",
   "message": "Jurassic Park, people are surprised that Lexi would know that Unix system.\n\nWhy would a kid know how 5 or 6 digit cost Unix workstations operate?\n\nWell, maybe most kids won’t, but most kids also don’t have a rich ass grandpa with connections to genetic engineering work. Who knows what she might have been allowed to play with while visiting grandpa at an office or whatever? Not to mention there were some Unix OS in the home market at least in the early 80s, like Xenix.\n\nI’m just saying that while it wasn’t common, it also wasn’t impossible that a kid in the early 90s might have had some Unix experience.\n\nThe line delivery aside I don’t see the problem.\n\nAlso I’ve seen some people assume it was a “Hollywood UI”, but that was legitimately a file browser available on SGI machines at the time, hell, I bought myself an SGI Indy 10 years back just because the thought of owning a computer that used to cost a shit ton of cash amused me, and that file browser was on there.",
   "created_utc": 1692299450,
   "score": 83,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlx3qd",
   "message": "Apparently the exhaust port from Star Wars.  It was so bad they made a whole movie about it!",
   "created_utc": 1692295666,
   "score": 65,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwme694",
   "message": "I'm tired of explaining the concept of buoyancy to people whine about Titanic.",
   "created_utc": 1692301701,
   "score": 1,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlt4zi",
   "message": "Why did the 3 Jedi Masters fall to Palpatine so fast?\n\nOkay so aside from shoddy writing and directing on George's part, they weren't dealing with some ordinary Sith master. They were dealing with the Emperor himself, who could only have been contested in a duel blade for blade against someone like Mace Windu.",
   "created_utc": 1692294275,
   "score": 102,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwll841",
   "message": "The Snitch in Quidditch has an in universe explanation that's actually really cool. The winner of the cup isn't the team that wins the most games it's the team with the most total points. So it's not necessarily the best strategy to catch it right away.\n\nAnd fine that's still clearly designed to be cinematic but it at least makes as much sense as other aspects of wizard culture.",
   "created_utc": 1692291471,
   "score": 213,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm66yz",
   "message": "Taking the eagles to Mordor in Lord of the Rings. You really think the Nazgûl aren’t going to notice a bunch of eagles flying around Minas Morgul? Plus the eagles got their own shit to worry about.",
   "created_utc": 1692298916,
   "score": 38,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmeezx",
   "message": "Signs. They are demons not aliens.",
   "created_utc": 1692301786,
   "score": 1,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlyis3",
   "message": "Armageddon.\n\nThey can't train astronauts to drill because it's impossible to drill into an asteroid. Harry Stamper, however, has made a career out of doing the impossible. \n\nIt doesn't make sense but it does so in context of the movie.",
   "created_utc": 1692296175,
   "score": 43,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlu6yv",
   "message": "That Han Solo doesn't say, \"I love you, too\" to Leia but says, \"I know,\" before he goes into the carbonite. People think he's making a joke or being an out-of-character kind of asshole.\n\nBut really, it's totally consistent with the story. He said that to let Leia know that he knew it all along and there is no need for her to feel regretful for not telling him before. It was more important and a more loving gesture to say that than just parrot back her, \"I love you.\"\n\nEDIT: As someone added here, actually in the script Han was supposed to reply \"I love you,\" but Harrison Ford thought Han should say something else. People treat it like a plot hole, that he makes a joke or something there when he should say, \"I love you,\" but Harrison Ford knew that Han wouldn't say the way it was scripted. So it's the opposite of a plot hole, in a way.",
   "created_utc": 1692294647,
   "score": 182,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlxz58",
   "message": "Jack and Rose could not have both gotten onto the door. They even showed Jack trying to climb up and the whole thing capsizing",
   "created_utc": 1692295980,
   "score": 36,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmf1w7",
   "message": "She's All That.\n\n\"So, he makes a bet that he can make a pretty girl into the hot girl when all it takes is taking off her glasses and fixing her hair and changing her out of overalls and into a red dress?\"\n\nNo.\n\nThe bet was that he could make Laney Boggs into a Prom Queen, over the more popular, but less likeable Taylor Vaughn.\n\nZac explicitly points out that she's \"scary and inaccessible\" - an antisocial artsy chick who shuts herself off from people and hides in her basement to paint. It isn't until he does chores for her to free up her time enough to get her to leave the house and go to the beach and join a party, that she becomes well known enough to be a serious contender for Prom Queen. \n\nAlso, Laney still loses. As it turns out, fixing up her appearance doesn't automatically help her win a popularity contest.",
   "created_utc": 1692302006,
   "score": 160,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwl7kmz",
   "message": "\"Indy didn't need to do anything in Raiders\": He did most of the legwork to find the Arc before Belloq snagged it.",
   "created_utc": 1692286585,
   "score": 97,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmf9ao",
   "message": "Jurassic Park, Hammond cheaping out on hiring Nedry.  (Note, this does get explained in the book, I'm just talking about what was presented on screen).\n\nA lot of people vilify Hammond for \"sparing oodles of expense\" on hiring Dennis Nedry and the dominoes that fell as a result.  If you listen to the dialogue, though...  \n\n\nNedry:  \"You know anybody who can network 8 connection machines and debug 2 million lines of code for what I bid for this job?\"  \n\n\nWHAT. HE. BID.  Hammond opened up the floor for contractors to bid, and Nedry was the one that set his own price.  Hammond just accepted it.  On paper, he was likely looking at someone that was more than competent, highly skilled, and came in with a low bid.  Sounds somewhat reasonable.  \n\n\nDid he spare expense?  Sure.  Does that fly in the face of his claims?  Absolutely.  But so did everything else.  He was a flimflam man that cut corners and rushed deadlines everywhere.  And that was absolutely his undoing.  But Hammond didn't set out to purposefully underpay Nedry, which was Dennis's justification to undergo corporate espionage.  He just said \"you're hired\" when Nedry set his own price.",
   "created_utc": 1692302080,
   "score": 153,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmpo75",
   "message": "How does Sarah Connor know which button to press to crush the Terminator in Terminator(1984)?\n\nBecause she accidentally presses it a few minutes earlier and it set the crusher off, it what lead the Terminator to find them.",
   "created_utc": 1692305751,
   "score": 6,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwn5ipv",
   "message": "Not *exactly* a plot hole, but I hate when people misinterpret the scene in “The Incredibles” where Violet saves Dash from being shot as her intending to take the bullets for him. \n\nYes, Dash says “how are you doing that?” and she responds “I don’t know”, but the “that” he means is *suspending herself in midair inside a spherical force field*, which she’s never done before. She already knew how to make dome-shaped fields big enough to cover Dash; we saw her do that when they were fighting at dinner earlier in the movie. \n\nShe jumped in front of Dash because that was the only way she could get close enough to him in time to protect him, since she had *not* yet learned how to make force fields far away from herself like we see her do when fighting the Underminer in the sequel.",
   "created_utc": 1692311715,
   "score": 79,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwn2t41",
   "message": "FRIENDS. “How did they pay for that apartment on their salary in New York?” \n\nThe very first episode, Monica mentions that her grandma owned the apartment, and she would never be able to afford it otherwise!!",
   "created_utc": 1692310647,
   "score": 178,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmqayl",
   "message": "On watching The Sixth Sense it may seem completely improbable that Bruce Willis' character didn't realize that he was dead. Yet it's explained right there in the movie: ghosts see only what they want to see.",
   "created_utc": 1692305977,
   "score": 220,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmlbqj",
   "message": "I’ve said this for a while now : I’ll defend the movie Home Alone with my life\n\nKevin got left behind because his family was mad at him and obviously didn’t like him that much, he was in his room and there was so much chaos. Also other factors such as we see his passport/ticket being accidentally thrown away, and a neighbor kid snooping through the van accidentally gets counted. \n\nWhy didn’t Kevin call the police? The phone lines were down. We also see Kevin’s mum talking to the police, but they don’t care or take her seriously. Also, it is likely that Kevin didn’t trust the police because the burglar disguised himself as a cop. (Kevin recognized his golden tooth.)\n\nThe thing people bring up that has some validity is how Kevin pulled off the traps and how he had some of the stuff he used. For this it’s just expected to suspend your disbelief because it’s a comedy for kids. But also some things are plausible. I can fully believe that young boys in the 90s had a Michael Jordan cardboard cutout",
   "created_utc": 1692304221,
   "score": 155,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwn19vf",
   "message": "in 2001: A Space Odyssey, HAL the computer doesn't randomly go homicidal - he gets stuck on conflicting directives, which is accurately explained as 'human error.'\n\nSpecifically, HAL is performing a psych exam on the human crew - he fakes a small emergency to see how they'll react. They react by deciding HAL is faulty and should be shut down. HAL cannot reveal the psych test (which would invalidate the data) and cannot allow himself to be shut down (which would jeopardize the mission) - so his solution is to murder the crew.\n\nTBH I like explaining this but people really need to know the film to care lol\n\n--\nEDIT - I get that the book explanation differs and this is just my read. There's a bit where HAL seems to glitch ([the only moment like this](https://youtu.be/56gaBlV97ME)) right before he detects the fault - and that scene follows [this bit](https://youtu.be/r13I-TuDcWI) where HAL seems to be asking Dave his feelings about the mission. HAL is bullshitting and Dave catches his true purpose, \"You're working up your crew psychology report.\" HAL bashfully answers \"of course I am,\" then glitches. One of HAL's functions would be to monitor all aspects of crew life, and psychological observation would be most accurate if concealed. The fault report itself could very well be random - it's just always seemed to me that some loop around this discussion is where things cracked.",
   "created_utc": 1692310047,
   "score": 36,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwn1iou",
   "message": "In Jurassic World, Claire didn’t “outrun” the T-Rex (in heels) … because it wasn’t CHASING her. The dinosaur was conditioned to equate the flare with feeding time so it was patiently following her to an anticipated meal. The situation is similar to how zookeepers can have (limited) interactions with lions and bears.",
   "created_utc": 1692310144,
   "score": 182,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmhx09",
   "message": "In Memento, people always wonder how a guy with short-term memory loss remembers he has memory loss. But he’s conditioned himself to say it, just like Sammy was subjected to conditioning in the flashbacks.",
   "created_utc": 1692303024,
   "score": 16,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm81t6",
   "message": "Stormtroopers purposely missing Luke and Leia and letting them escape so they can find the rebel base.",
   "created_utc": 1692299562,
   "score": 163,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmy2k5",
   "message": "Not a *bad* one, but the DeLorean in *Back To The Future* always  being brought up in conversations as \"ackshyually it was a really crappy car\"\n\nLike.... Yes. That was the joke. Marty even asks Doc incredulously, \"You built a *time machine* out of a ***DeLorean***?\" The car became famous *because* of BTTF. Before then, it was a laughingstock. Horridly underpowered with a shitty European V6 and incredibly fragile transmission, massive QC issues, and John DeLorean himself was a tool.\n\nEDIT: RIP inbox",
   "created_utc": 1692308831,
   "score": 247,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmaw1g",
   "message": "The creatures at the end of the movie A.I are NOT Aliens.  The are the evolution of robots, David!\n\nThat’s why they are so compassionate towards him",
   "created_utc": 1692300548,
   "score": 124,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmh7j2",
   "message": "The Dark Knight Rises: Bruce escapes the prison that's in the middle of nowhere and the \"plot hole\" is how he got back to Gorham fast enough to save the city.\n\nWhen he escapes, you can very clearly see a town in the background that's within walking distance. It can be very easily explained that he made a freaking phone call and flew back.",
   "created_utc": 1692302774,
   "score": 103,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwnavxd",
   "message": "At the ending of Inception when the top is still spinning and we don't see whether it's going to fall or not, the *entire point* of the ending is that DiCaprio *doesn't care* anymore whether or not he's still in the dream. He's decided that the important thing is to live his life with his children, whether it's real or not.",
   "created_utc": 1692313929,
   "score": 250,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmkmkw",
   "message": "I'm not quite sure if this will be clear since I'm not a native English speaker. In Endgame, at least in the reviews, I've always heard that Tony finds the solution to time travel at his first try and how lucky he is. The night he finds the solution, he had told the AI ​​to run one last simulation before stop it for the day. That, added to all the time that he has been without sleep or doing it badly, suggests that he has never stopped looking for a solution and that he did not find it the first day he looked for it.",
   "created_utc": 1692303975,
   "score": 215,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwn7nsx",
   "message": "Top Gun (1986) - Goose's Death.\n\nA lot of people believe that the filmmakers screwed this scene up, stating that the canopy wouldn't have been over the top of the aircraft and therefore Goose wouldn't have died. It's just poor writing and yet another example of Hollywood getting it wrong. \n\nThey're wrong. \n\nThe F-14 Tomcats NATOPS manual states that this is 100% a scenario that can happen, in fact it got put into the NATOPS manual because IT DID HAPPEN. If the F-14 entered into a flat spin and ejection became necessary, the procedure was to manually eject the cockpit canopy and wait several rotations for it to clear or get far enough away to not become an issue. THEN you eject. Others have then stated why was it Maverick who lived and Goose didn't. Well, because Goose ejected first. Why? Because he was the RIO, the back seater ALWAYS ejects first. Why? They have literal rockets shoved in the back part of their seat punching their anus with the acceleration of holy sweet mach Jesus. If Maverick ejects first, Goose gets his goose cooked - well done and in a manner that would make the French cry and riot. If Goose ejects, the electronics get fried and Mavericks seat protects his ass from getting to whole new levels of hot and crispy.\n\nWhat is inaccurate though is the fact he was in a flat spin that somehow decided to engage in 'diplomatic relations' with physics and was drifting out to sea. You get in a flat spin, the only direction your going is down to your grave. Not a little to the left, not a slide to the right, not somewhere over there. DOWN. Unless there was some Hurricane level winds, it ain't happening - and even then I'm not sure. I'm not enough of an armchair 'expert' to figure that shit out. If someone actually does know, feel free to comment about it.\n\nFun Fact: Goose is actually based off of a real person, Lt. David J. “Goose” Lortscher, who died due to ejection accident in an F-14 after colliding with another F-14 off the coast of Puerto Rico.",
   "created_utc": 1692312583,
   "score": 20,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwn7vx3",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmyykc",
   "message": "Toy Story. Buzz stops moving in front of humans but doesn't think he's a toy.\n\nHis delusion is the whole point. It's what drives Woody crazy. He tries explaining it to him. YOU ARE A TOY.",
   "created_utc": 1692309164,
   "score": 165,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwo11nx",
   "message": "I am so late to the party but… *Legally Blonde*\n\n\u0026gt;OMG, a dumb blonde sorority girl studied for the LSAT for a summer and aces it?  Bullshit!\n\nNo. No, the point is that Elle Woods was never a “dumb blonde.” She was always brilliant. Literally the first scene is her interrogating the salesperson and catching them in a lie because she was observant and smart. \n\nRather, Elle was pigeonholed by the circumstances of her looks and her privileged upbringing to pursue a vapid life. While inspired by the wrong reasons, it results in her breaking the mold she was confined in so that she is able  to reach her full potential.",
   "created_utc": 1692325323,
   "score": 33,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwnj4ir",
   "message": "Not a movie, but The Office tv show: ever since it ended, people have had a theory that Toby was the Scranton Strangler.\n\nToby was on the strangler's jury, convicted him, and later visited him in prison, to say he now thinks he may be innocent. During the visit, the strangler *strangled* Toby, leaving him in a neck brace.\n\nThey clearly convicted the right man.",
   "created_utc": 1692317501,
   "score": 54,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmq0l8",
   "message": "Contact\n\nPeople talked about the second machine coming out of nowhere. False. \n\nIt's stated soon after they discover the plans for building it that Japan has bid to take itself out of the consideration for piloting the first machine if they are granted the right to build their own machine instead.\n\nEven Family Guy echoed the false idea in the Misery parody, though FG isn't a news source, it annoyed me that they gave the false idea a platform.",
   "created_utc": 1692305873,
   "score": 138,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmnzlo",
   "message": "People sometimes wonder how Indiana Jones initially remains sceptical of the mystical events happening in the second film, when he just witnessed a magical ark mass killing a bunch of Nazis in the first film. \n\nBut that's because the second film is a prequel.",
   "created_utc": 1692305159,
   "score": 190,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwn1ef0",
   "message": "Katniss, who nearly died in The Hunger Games twice, yet still had sympathy for the children of the Capitol, wasn't acting out of character when she agreed to Coin's idea of one last symbolic Hunger Games with the Capitol children. When Coin suggested the symbolic Hunger Games, that was the moment Katniss made up her mind to assassinate her (but I think she had been considering it long before then). She only agreed so Coin wouldn't suspect anything.",
   "created_utc": 1692310096,
   "score": 77,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmr288",
   "message": "Encanto\n\nBruno in the walls and Dolores knowing.\n\nNot only does she state during the song she can hear him and at the end of the movie says she knew. This whole family broke into song about “We don’t talk about Bruno” at the mention of the man, so she was basically told probably the same when she tried to tell the family.",
   "created_utc": 1692306251,
   "score": 189,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmsu79",
   "message": "The matrix reloaded the scene where Neo is talking to the architect, the screens behind them are not other ones, it is the predictions the machines are making on Neo’s responses, most of the scenes are incorrect in those predictions, except for when Neo must choose between Trinity and all of humanity, the machines nailed that response on all screens.",
   "created_utc": 1692306893,
   "score": 242,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwoeofs",
   "message": "But why male models?",
   "created_utc": 1692332179,
   "score": 52,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwml7yy",
   "message": "[removed]",
   "created_utc": 1692304186,
   "score": 171,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmx5cr",
   "message": "I don't know if you'd call it a plot hole but I have had to explain it to people before.  Jenny didn't think she was in love with Forrest because she thought she was taking advantage of him in the same way her father molested her.  He was mentally challenged.  She knew this.  She had seen it her entire life. She didn't think he was emotionally capable of knowing what real love is.  She didn't want to turn into her father.  Not with the one person who actually treated her like a human being.",
   "created_utc": 1692308484,
   "score": 149,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwo5a71",
   "message": "There was a whole topic on the front page a while back about *The Truman Show* asking about what happens when Truman wants to sleep with his onscreen wife, is that upsetting to her because she’s just an actress, how do they avoid showing it on TV. People offering all kinds of explanations like “he was raised not to know what sex is.” I thought I was going crazy because not only does the movie directly address this (two guys watching the show complain that the camera always cuts away when Truman and his wife go to bed) but it’s an actual plot point in the movie that she’s trying to have a baby with him so that they can start Truman Show Phase 2, and his obsession with a woman they kicked off the show years ago is ruining the director’s plans.",
   "created_utc": 1692327296,
   "score": 4,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwn4xl9",
   "message": "This is a plot hole that I solved for myself.\n\nIn the 1989 Tim Burton Batman movie, the Joker is poisoning the residents of Gotham using parade balloons filled with gas. Batman swoops in with the Batwing and uses a scissor thing on the nose of the Batwing to grab the ropes of the balloons and fly them away from the city.\n\nIt always bothered me that the Batwing would have scissors or a giant claw on the front because it would be a useless tool for fighting bad guys.\n\nIt wasn't until this scene in The Dark Knight more than twenty years later that the claw on the front of the Batwing made sense to me.\n\nhttps://youtu.be/7B0Gh8slES8?t=152\n\nThe claw on the front of the Batwing is for a Skyhook system for extracting Batman or others from troubled spots where the Batwing cannot land. Batman just made use of it to grab the balloons so he could pull them away from Gotham.",
   "created_utc": 1692311484,
   "score": 128,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmfve5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15tqyrd"
  }
 ]
}