{
 "submission_id": "15tqscr",
 "title": "Redditors in the U.S., would your life change if health care was free for everyone, and if so, how?",
 "selftext": "",
 "created_utc": 1692286124,
 "permalink": "/r/AskReddit/comments/15tqscr/redditors_in_the_us_would_your_life_change_if/",
 "score": 170,
 "url": "https://www.reddit.com/r/AskReddit/comments/15tqscr/redditors_in_the_us_would_your_life_change_if/",
 "comments": [
  {
   "comment_id": "jwlmhw4",
   "message": "It’s disheartening how people feel our current system is tenable. Taxes would go up, but you would save money not paying premiums. Also, imagine how much easier it would be to job hunt when you don’t worry about health benefits?",
   "created_utc": 1692291924,
   "score": 80,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm1xsl",
   "message": "Diabetic so yes it would help a lot.",
   "created_utc": 1692297399,
   "score": 148,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwl95kq",
   "message": "Americans would rather pay $12,000/year in insurance premiums than pay $7,000 in taxes.",
   "created_utc": 1692287150,
   "score": 199,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlu4v1",
   "message": "I'd be a lot happier, knowing that healthcare would be much more accessible to everyone in the country.",
   "created_utc": 1692294626,
   "score": 85,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwl76z5",
   "message": "It would save me $800 a month for a start.",
   "created_utc": 1692286451,
   "score": 63,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwli0bo",
   "message": "Everyone really seems to be an expert on this shit, huh?\n\nTaxes this, Canada that, Oh look at me with 'my free healthcare provided to me because I was a responsible adult, worked hard got a real job and career' \n\nFor me at least I could see a doctor. I haven't in 20 years.",
   "created_utc": 1692290327,
   "score": 65,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlvzkd",
   "message": "Yes, Quit my job and start being self employed.   Most people work the jobs they have just for access to health insurance, if there was universal health care it would open up all kinds of opportunities for people.",
   "created_utc": 1692295273,
   "score": 36,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmdojm",
   "message": "Everyone here is talking about how it would raise taxes. I’m not so sure that it would.  \nThe US government spending on healthcare relative to GDP is close to the average OECD country. Private / insurance spending not included.  \nWith benefits of scale and the bargaining power of a national healthcare system, the government spending might actually be less.",
   "created_utc": 1692301530,
   "score": 14,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlrgmr",
   "message": "It would be less expensive. People who can’t get health care are very expensive to society, but unfortunately the cost they incur is not as visible as the (smaller) expense to provide that care so too many people assume it would cost too much.",
   "created_utc": 1692293681,
   "score": 18,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlvovn",
   "message": "I’d feel so much more comfortable going to the doctor and I’d never have the constant worry of unknown medical bills and arguing “is this worth the thousands of dollars to go get checked out”.  Also, wouldn’t worry about moving jobs as much.    I say this as an American, who had universal healthcare and misses it dearly.",
   "created_utc": 1692295169,
   "score": 14,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm02uw",
   "message": "I'd probably have to pay more in taxes (depending on how the tax burden gets split between individuals and corporations) for minimal benefit to myself. However I still think it's a good idea, everyone should have access to the healthcare that they need. The fact that the richest country in the world can't provide that is awful.",
   "created_utc": 1692296732,
   "score": 4,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm3xeo",
   "message": "I think my situation is an example of why it continues as is - because I have exceptional benefits from work and I am used to paying for it. Most people in my situation seem to be of the \"if it ain't broke, don't fix it\" mentality, while many older Americans have Medicare and retirement portfolios, some of which contain pharma and healthcare stocks. \n\nIndustry lobbyists and propagandists have done an excellent job of selling people on ideas of scarcity of service, wait times, providers with no profit incentive not delivering their best standard of care, and mistrust of the government to actually operate a system more efficiently than the private sector. \n\nScared of the unknown, scared of change. Sunk cost fallacy, all these things contribute. I pay chunk out of my paycheck that quietly grows, but its money I never see. I just see the direct deposit number hit my bank every two weeks. Out of sight, out of mind. \n\nThe reality is far different. I have to plan way in advance to see my doctor and she packs patients in like cattle. I might get 15 min with her after an hour wait and there are signs all over the office that say \"if you have any additional medical concerns aside from your scheduled appointment, please make another appointment to see the doctor\" (paraphrasing) Why? Profit incentive, the more patients you see in a day, the more billings to insurance companies. Write a bunch of scrips and on to the next one. \n\nThis is not the only issue we act this way about, but it is one of the most important ones. The time has come - whatever advantages a for profit healthcare model may have had at some point have been destroyed by greed and commoditizing everything. But we have allow this monstrosity to metastasize and people are either too scared to tear it all down or too jaded by the complexity and nuance of it all that they allow themselves to not pay attention to what is really happening.",
   "created_utc": 1692298110,
   "score": 8,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm7hct",
   "message": "I’m currently being sued for a $5k bill from an ambulance ride to a hospital that I was forced into by an involuntary psychiatric hospital stay during covid. I was then sent back in an ambulance after 2 hours in the hospital. None of that was my decision or choice. \n\nIt would be really nice if I didn’t have to pay for things I didn’t want or ask for. It would be nice if I didn’t have to fight with insurance companies to receive medications at an affordable price. I’m often having to deal with insurance that doesn’t think I need the medications that my doctor prescribes. It would be nice to not have to worry about bankrupting my husband because I have a health issue. If I ever get cancer, or if my cirrhosis ever gets worse, we will have to divorce so that it doesn’t ruin him. \n\nI hate our healthcare.",
   "created_utc": 1692299364,
   "score": 15,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwl83at",
   "message": "I imagine I'd be losing money. I have great insurance through both my job, and retiring from the military. I'd just have to pay more taxes. That said, if it genuinely meant other people could get care that they could not before, and the taxes didn't break me, I could get behind the idea.",
   "created_utc": 1692286772,
   "score": 27,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlz22w",
   "message": "My wife would be alive.",
   "created_utc": 1692296366,
   "score": 26,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlu5n9",
   "message": "I don’t work in healthcare, but I wonder what would happen to doctor salaries under this model. If the pay dropped by a lot, I’m guessing the medical school price model would also have to adjust somehow or be subsidized?",
   "created_utc": 1692294633,
   "score": 5,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlmvpf",
   "message": "I could spend more.  Right now, I pay a lot into health insurance, because the CEO of my insurance company gets paid NINE figures per year.  All the top people do.  Get rid of the insurance company, I no longer have to help pay his nine figure salary.  And then... right now, I have to constantly try to accumulate more money, even though I know it will never be enough.  Medical bankruptcy is incredibly common here, so I have to save save save, hoping that if I get sick it'll be enough, knowing that it probably won't because that same insurance company will hang me out to dry.\n\nMy quality of life would skyrocket.  The people who think that socialized medicine would cost them more money than they're currently paying haven't done the math.",
   "created_utc": 1692292062,
   "score": 11,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm0o5a",
   "message": "Even if I paid more in taxes but minus the health insurance premiums (which is not a guarantee), it would be worth it because a) that’s the cost of living in a society, and b) I’d never get stuck with thousands of dollars of medical debt if I had a catastrophic accident, which would tank my credit and ruin my life.",
   "created_utc": 1692296940,
   "score": 3,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm37nc",
   "message": "I’d be great. Not much to explain",
   "created_utc": 1692297854,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm6nmx",
   "message": "It really depends. My wife is a teacher and the main perks of that job are the pension and health insurance. We have great health coverage, everything is free or negligible in terms of price. \n\nI would think the somewhat low salaries would have to go up to compensate for the biggest perk of the job going away. If that happens, I would be fine with it.",
   "created_utc": 1692299081,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm8zdy",
   "message": "I wouldn’t have to worry about my kids not having health insurance.",
   "created_utc": 1692299887,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm98v3",
   "message": "Would save me about $650 a month. Bring it",
   "created_utc": 1692299978,
   "score": 5,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm9na5",
   "message": "I would be able to go to a doctor for the first time in 2 years lol",
   "created_utc": 1692300117,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm9v5j",
   "message": "I’d have a few hundred extra dollars a month. Even if they all went to extra taxes I wouldn’t mind. We should have free health care",
   "created_utc": 1692300191,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmckxd",
   "message": "I used to be an actuary in the health insurance space. I got curious one day and started doing some modeling on costs of universal healthcare vs. what we have now. Overall we’d save a lot of money as a country. I’d also lose my current job but that’s not a big deal, would find a new one. It’s a no brainer to me, we need it.",
   "created_utc": 1692301141,
   "score": 8,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmdimz",
   "message": "Yes it would. So many people need to have their heads examined.",
   "created_utc": 1692301471,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmdjuc",
   "message": "yes, i wouldn’t be thousands of dollars in debt and i would actually be able to save for retirement",
   "created_utc": 1692301483,
   "score": 3,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmfpol",
   "message": "I would open my own business. I've always wanted to have a donut/pizza shop.",
   "created_utc": 1692302240,
   "score": 9,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmhaav",
   "message": "Yes. Absolutely fucking yes. More taxes out of our paychecks for healthcare that actually works? Yes fucking please. \n\nWith health insurance it was $7000 to take our son home from the hospital in 2021. Wtf. Lol should of just had him on the kitchen table. We had to put that on our credit card and then turn around and pay it off. \n\nI had emergency surgery in 2019. It was $12,000 after all said and done. Also my job at the time fired me because I took too much time off after surgery. So that was fun. \n\nPeople in our lives always ask us why we only had one child. This is a huge reason why. US healthcare is a damn joke.",
   "created_utc": 1692302802,
   "score": 6,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwljpng",
   "message": "Sure \n\nI'd only have to work if I wanted to",
   "created_utc": 1692290934,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlu5r0",
   "message": "Yes. It would improve the life of every citizen.",
   "created_utc": 1692294634,
   "score": 3,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlk3nb",
   "message": "Health care would become ridiculously complicated and bureaucratic, just like Medicare, welfare, childcare, the IRS, and other large administrative programs in the US.\n\nIt would also become very political, since all funds must be appropriated through congressional laws (per the Constitution). Non-emergency healthcare would be another one of those things on the table every time the two parties decide to fight over funding. Depending on the party in control, some services like abortion would likely be defunded and others would be tied to work requirements.\n\nI'm not against government-run healthcare conceptually, I'd just rather have a more competent government running it. You're basically trusting your health care to a group with a 19% approval rating.",
   "created_utc": 1692291071,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlyfqe",
   "message": "No it wouldn’t. We already get “free” healthcare from my husbands job. Some family members live in countries with “free” healthcare and they still go through private insurance because it’s better",
   "created_utc": 1692296145,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwl76uh",
   "message": "Seeing as nothing is free:\n\nExtrapolating the VA system which costs ~300B and provides fully free care to only ~5M people means taxpayers would need to come up with an extra ~21T to cover everyone.\n\nSo the ~75M taxpayers would need to shell out an extra 280K per year to the gov't.\n\nNot sure how that would work...",
   "created_utc": 1692286450,
   "score": 253,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwl6vkg",
   "message": "Yes, my taxes would go up.\n\nYou can't make Healthcare free, as much as we may want to.",
   "created_utc": 1692286337,
   "score": 244,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm1k5l",
   "message": "It would give people  mobility and not lock them into what becomes slavery. So yes. Yes it would make the nation better.",
   "created_utc": 1692297262,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm9k1a",
   "message": "Free doesn't exist, but let's not get into semantics...\n\nI pay $400 a month in premiums for a middle-of the-road plan with copays, no deductibles.   That equals about $5k a year for my family of 4, and we have met the deductible a few times in the past decade.  Let's say I've averaged $7k a year is costs.\n\nMy household is right at top 10% of wage earners in the US, so I assume my tax would definitely rise versus present day.  Would it go up the full $7k?  I think so.  More?  My gut says yes, but I'm not really sure.\n\nI don't think my immediate coverage would change.  I could still see my doctor and get the care I need.  I would also probably buy a private plan, as is available in the UK on top of their public option.\n\nMore importantly though, I'm not confident prices in healthcare would actually go down.  When you get down to brass tacks on why healthcare is so expensive, profit can't be ignored, but I honestly don't think it's as bad as we're led to believe.  I think the bulk of healthcare costs, like all industries, comes down to paying employees to work jobs.  \n\nI'm not only limiting it to doctors, nurses, and hospital staff.  The trickle-down effect on the cost of healthcare is huge.  New, fancy machines have to be researched, built, and delivered.  Yes, a profit is made, but most of that cost goes to researcher's, manufacturer's, and logistics' salaries.  Same for medications.  Profit is there, but the same groups of people earn wages that contribute heavily to the end cost of healthcare.\n\nI'd place a bet that healthcare costs wouldn't drop more than 10% before we see a noticeable decrease in quality, technology, and availability of services.  With the profit incentive in US healthcare gone, I think global healthcare would actually take a hit within 10-20 years. \n\nI'm not against a public option, but I don't think it's nearly as simple as certain leaders and politicians want us to believe.",
   "created_utc": 1692300084,
   "score": 3,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlhpny",
   "message": "I'd probably be dead.  Ask any Canadian or UK resident about their \"free\"healthcare.  \n\nIf you call for an ambulance in the UK and tell them you are having a heart attack, [average wait time is 51 minutes](https://www.bhf.org.uk/what-we-do/news-from-the-bhf/news-archive/2022/july/ambulance-waits-for-heart-attacks-and-strokes-on-rise-again).  Sure, I'll be dead, but think of how cheap my healthcare is!\n\nAnd note, in nearly every country that offers free healthcare, there is a VAT that costs about the same as insurance.  It's forced insurance with a disastrous service level.",
   "created_utc": 1692290219,
   "score": 251,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlxcoi",
   "message": "My taxes would go up which means I now have less money to spend.  That would put a pinch on my finances.  The quality of my healthcare would not improve.",
   "created_utc": 1692295756,
   "score": 0,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwl80hd",
   "message": "My taxes would go up substantially, by more than I currently pay for insurance premiums.  They'd **have** to - it literally **couldn't** work any other way and be sustainable.",
   "created_utc": 1692286744,
   "score": 249,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwl6yoa",
   "message": "[deleted]",
   "created_utc": 1692286368,
   "score": 255,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlt1ad",
   "message": "I would save ~$1600/yr on premiums and another $700 on deductible, so it essentially wouldn’t change much. Assuming my taxes remained the same I could probably turn that into another vacation or increased retirement contributions.",
   "created_utc": 1692294238,
   "score": 255,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlxa91",
   "message": "[deleted]",
   "created_utc": 1692295732,
   "score": 253,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwl6r9u",
   "message": "I'd probably make half as much as I do now because they'd tax us further into poverty.",
   "created_utc": 1692286292,
   "score": 244,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm1rjq",
   "message": "lol @ free\n\nIn a perfect world, the United States could fund reliable healthcare for it's citizens. \n\nIt's not a perfect world, and I do not trust the liars and thieves in government to look out for my best interests. They have already fucked up a much smaller pool of clients; Look at the VA. THAT is what will be pushed across the country, not a rose-colored version of healthcare utopia the dreamers dream about.",
   "created_utc": 1692297337,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm1txj",
   "message": "Yes. So many people I know struggle in quiet desperation providing a living while in pain.",
   "created_utc": 1692297360,
   "score": 0,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwma0sr",
   "message": "It would probably be worse for me. My employer already pays for my health insurance and we have one of the best plans you can have. We also have an really low deductible. We have 2 kids, surgeries, check ups, and etc.. and the most we have ever had to pay was 100 bucks. \n\nI also have lung issues and my insurance lets me see the best of the best doctors in the USA. I would not want to loose access to those doctors.",
   "created_utc": 1692300245,
   "score": 3,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmeal4",
   "message": "I’d make less money. I’m lucky enough to have been born into a healthcare family, I work in health care and my insurance is free because of that.",
   "created_utc": 1692301743,
   "score": 0,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmh933",
   "message": "It will increase tax, and make health care garbage",
   "created_utc": 1692302789,
   "score": 0,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlvu4z",
   "message": "My taxes would go up",
   "created_utc": 1692295219,
   "score": 252,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmaf7t",
   "message": "I would pay more in taxes for a lower quality of service, reduced access to qualified specialists,  and longer wait times.",
   "created_utc": 1692300383,
   "score": 0,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmfcks",
   "message": "It wouldn't be free...it would be tax-payer funded, and the only way to pay for it (generate enough tax revenue) would be far higher income taxes...so pretty much anybody working would end up paying far higher taxes to pay for the healthcare of those not working (elderly, children, those in school, etc.)....so for anybody working it would realistically probably be a net loss...so going off of that I would be negatively affected due to having to almost certainly having to pay higher taxes, while only having a pretty moderate income. This whole idea that \"universal healthcare\" is automatically better/cheaper is some pretty over-simplified/basic logic considering there would be a massive amount of economic dead-weight loss generated from the significantly higher marginal income taxes (probably in the 10-20% higher range).",
   "created_utc": 1692302112,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmfgyy",
   "message": "One significant downside would be an almost complete stagnation in experimental medicine and advancement of new medicine and techniques.   Our profit driven mega-corporations arent amazing for the population at large, but they make the products and methods that the rest of the world rips off.\n\nThere is a reason the King or Dubai or whatever flies to Cleveland for heart surgery, not Paris.",
   "created_utc": 1692302155,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwma10x",
   "message": "Nothing is free. Someone is always paying",
   "created_utc": 1692300247,
   "score": 254,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmermk",
   "message": "For me personally, no. Because I know how to keep myself alive and out of the hospital",
   "created_utc": 1692301906,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmfgt0",
   "message": "The amount of taxes that would needed to prop up such a system would be a serious burden on my family. Reddit will never understand this because most of the kids here don't have real world obligations. They don't have a mortgage, or utility bills, or a car note, or anything holding them back. It's easy to think you can prop up utopia when you haven't really experienced life. I'm glad some of you can live this way but eventually you do have to grow up. Down votes are great when you're a kid cruising through life but adults don't have it that easy. Utopia isn't a real place.",
   "created_utc": 1692302153,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlznog",
   "message": "I might actually go see what's wrong with me physically. Maybe even a therapist.",
   "created_utc": 1692296580,
   "score": 3,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm0gir",
   "message": "Yes but, as a generally healthy person, not a whole lot immediately. I hope.",
   "created_utc": 1692296866,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm1dbi",
   "message": "In reality, I personally would get worse treatment and spend more. I'm sure for the majority of Americans this isn't true but for me it would be. I have a HDHP through my employer and go to the doctor as often as I like with very little wait times. I recently got back from the U.K. and all over the news they were talking about waiting over 6 months to get life saving scans. Part of the problem is that our doctors make more here and our residents are lot less healthy(fat).",
   "created_utc": 1692297193,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm1wcv",
   "message": "I could save the money I have taken out of my paycheck for the premiums, for one. I'm already paying for Medicare. I don't care if that tax amount becomes a little larger.\n\nI could get the tendinitis in my ankle treated, so I can walk without hurting, for another.",
   "created_utc": 1692297384,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm4ixf",
   "message": "I guess id have to wait longer at the hospital",
   "created_utc": 1692298324,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm4zf1",
   "message": "I would retire earlier.",
   "created_utc": 1692298487,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm50sb",
   "message": "My pts could be \"compliant\" with meds/treatments bc most of the time it's an affordability issue. Removing the insurance middleman means saving effectively 20-30% of current costs of care. US has the most expensive healthcare model in the world with moderate-to-poor outcomes. We have socialized medical care but only for some ppl: military, ppl who are poor enough, and The Olds. There is zero reason not to expand that to everyone. \n\nAnybody seriously saying that the current model isn't currently in flames and crashing clearly doesn't have any exposure to the reality of the state of our current system. It's not a difficult problem to solve, but an issue of ignorance ans delusion AEB the comments section here. It's sad, and it's why no progress has occurred since the ACA peanuts we were thrown. ACA was a definite improvement, but nothing close to the level of reform necessary to have a functional system.",
   "created_utc": 1692298500,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm5fna",
   "message": "Yes. Ive never been to a doctor after the age of 6 and theres definitely some physical junk and mental health issues that would benefit from me having health coverage.",
   "created_utc": 1692298649,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm5moz",
   "message": "Financially: it would have a minor impact as our family is generally healthy and our rates are reasonable.\n\nMentally: it would be great to be able to job shop without having to factor in insurance plan coverage compatibility with current doctors.\n\nSocially: we'd hear the bitching from the grays (and soon to be's) for 50+ years about how the system isn't perfect from day one and how the government this and that.\n\nLogistically: fantastic. Shared information of my health care would prevent me from filling out the same forms every time I see someone new.\n\nSocietally: I'd love to see people get taken care of when they want/need to be. I worry that it would decrease the overall quality of doctors/nurses as the financial incentive is generally lower in public healthcare compared to private.\n\nMost of all, I'd enjoy watching all the pharmacy benefit mangers shrivel up and die. Those fuckers are the ones negotiating arbitrarily prices for medicines that are dirt cheap to make.",
   "created_utc": 1692298719,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm5yx6",
   "message": "What about Reddit app?",
   "created_utc": 1692298837,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm61w9",
   "message": "I would actually get tested for the genetic disease my dad has. Have always been told not to get tested because it'll count as a pre-existing condition, and it wouldn't actually matter until I'm 50+. \n\nI think the amount in taxes would likely equal the amount I pay for insurance now. Even if it was more I would be okay with it.",
   "created_utc": 1692298866,
   "score": 1,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwm62s1",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmksd8",
   "message": "I would have a completely different job.",
   "created_utc": 1692304032,
   "score": 5,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmkt2a",
   "message": "I'm epileptic and my meds run $2200 for a 30 day supply without insurance. With insurance a 30 day supply fluctuates between $100 and $700. I just lost my job so now I'm without \"affordable\" insurance ($150/month at my last employer) and my meds aren't currently available on GoodRX or similar services. Idk what public insurance will cover and I can't afford private insurance. \n\nI paid $8k out of pocket for a 3 block ambulance ride after a car crash last November. \n\nI tell my friends that they should never call an ambulance for me and they should either drive me themselves or let me perish. Either I'll save a lot of dollary-doos or it won't be my problem anymore. They think it's a joke but I'm 100% serious. \n\nPublic healthcare would lift an enormous weight off my shoulders. Anyone who thinks our current system makes any sense at all is either grossly uninformed or a willful idiot.",
   "created_utc": 1692304039,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmkzcj",
   "message": "So, what's needed to fund a US medical system? \n\n350 million Americans paying 100$ a year could probably go a fairly long way. \n\nIllnesses would be detected faster and be easier (cheaper) to treat because people would actually see a doctor.\n\nThere would a massive public interest incentive to negotiate prices of medicine (just like other countries do). Same for the (completely ridiculous) prices of procedures etc.\n\nYou could still keep your private insurance if you want to pay into the Gold Star Bells \u0026amp; Whistles lane. It would probably still be cheaper than today, given the overall lower cost as explained above.\n\nThe mental health of a population not scared to break a leg and having to sell their house would likely improve.",
   "created_utc": 1692304101,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmm9lr",
   "message": "I'd probably go get my problems checked out way more",
   "created_utc": 1692304555,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmmaf4",
   "message": "I'd be able to get my teeth fixed and smile again.",
   "created_utc": 1692304563,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmo4my",
   "message": "Im in nz and if it was all actually free not $40 for a dr visit  here then yes id go get the free dental work i need and the free dr visits  and free mental health counselling and addiction support",
   "created_utc": 1692305210,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmol0u",
   "message": "so long as it includes dental, hell yeah. my rotten teeth and me could use it. would save me tens of thousands",
   "created_utc": 1692305373,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmp1dn",
   "message": "I would be able to work for higher pay. It indirectly affects how much money I can earn because I have 20 different health conditions and need to be able to go to the hospital as well as doctors/specialists without worrying about the cost. Currently, I'm on Medicaid, which has an income limit of around $19,000 a year. So... I can't make more than that because otherwise I would not be able to get the proper healthcare that I need to survive. If it was free, I could earn so much more money and not have to worry about whether it's literally going to cost me my life or not.",
   "created_utc": 1692305530,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmp87p",
   "message": "I would be much healthier that's for 😃",
   "created_utc": 1692305595,
   "score": 2,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmk34r",
   "message": "Political ad",
   "created_utc": 1692303782,
   "score": 0,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwmm7sn",
   "message": "I just want to note that health care is *complicated* and there's no magic solution.\n\nIf nothing else, keep in mind that \"the rest of the world\" free rides off of a lot of stuff the US does, so just saying \"just do what Europe does\" isn't going to work. If Europe had to pay the *true* cost of medical care and advancement their governments would collapse.\n\nI'm not saying we don't need reform, or there aren't solutions, it's just that it's *complicated*.",
   "created_utc": 1692304537,
   "score": 0,
   "submission_id": "15tqscr"
  },
  {
   "comment_id": "jwlm3n4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15tqscr"
  }
 ]
}