{
 "submission_id": "15tqrbp",
 "title": "What is the thing you feel you're most losing while growing up and oppositely what is a thing you're gaining?",
 "selftext": "",
 "created_utc": 1692286061,
 "permalink": "/r/AskReddit/comments/15tqrbp/what_is_the_thing_you_feel_youre_most_losing/",
 "score": 14,
 "url": "https://www.reddit.com/r/AskReddit/comments/15tqrbp/what_is_the_thing_you_feel_youre_most_losing/",
 "comments": [
  {
   "comment_id": "jwl8sma",
   "message": "I used to enjoy the little things. Like I was 21 and *still* excited over the changing foliage or snow or Halloween candy. I enjoyed holiday music and driving around to run errands.\n\nI'd come across people who seemed rushed and harried and just plain miserable and...I didn't get it.\n\nThen I started working.\n\n8 hours a day chained to a desk.\n\nI no longer enjoy driving. A daily 40 minutes commute (each way) killed that.\n\nI barely give the autumn leaves a passing glance. And winter snow means just one more shitty thing to deal with during the commute. \n\nI'm burned out. I miss winter break. I miss summer break. Being a grown up sucks.\n\nWorking an office job kills the soul.\n\n**EDIT:** Woops, forgot to add a positive. Uh...I'm better with money now.",
   "created_utc": 1692287022,
   "score": 1,
   "submission_id": "15tqrbp"
  },
  {
   "comment_id": "jwl6rcy",
   "message": "Optimism, Confidence",
   "created_utc": 1692286293,
   "score": 1,
   "submission_id": "15tqrbp"
  },
  {
   "comment_id": "jwl66xo",
   "message": "losing the feeling holidays use to give.\nGaining wisdom.",
   "created_utc": 1692286091,
   "score": 2,
   "submission_id": "15tqrbp"
  },
  {
   "comment_id": "jwl677m",
   "message": "opportunity, freedom",
   "created_utc": 1692286093,
   "score": 2,
   "submission_id": "15tqrbp"
  },
  {
   "comment_id": "jwl6q66",
   "message": "losing - hair\n\ngaining - weight",
   "created_utc": 1692286281,
   "score": 2,
   "submission_id": "15tqrbp"
  },
  {
   "comment_id": "jwl7gnb",
   "message": "Freedom",
   "created_utc": 1692286546,
   "score": 1,
   "submission_id": "15tqrbp"
  },
  {
   "comment_id": "jwl7kra",
   "message": "fucks; wisdom",
   "created_utc": 1692286586,
   "score": 1,
   "submission_id": "15tqrbp"
  },
  {
   "comment_id": "jwl85b0",
   "message": "As I age, I'm losing my cynicism about people and the world. It's not as simple as I thought, and everyone has their own shit going on, and you will never really know all of it - not even your spouse.\n\nAnd I am becoming more flexible about things. The older I get, the more I realize so much in life is just small stuff that comes out in the wash.",
   "created_utc": 1692286793,
   "score": 1,
   "submission_id": "15tqrbp"
  },
  {
   "comment_id": "jwl9gm0",
   "message": "I've lost a lot of my creativity I had as a kid, I guess from not using it.   I've gained more of a 'fuck it' attitude about worrying what others might think of me.",
   "created_utc": 1692287256,
   "score": 1,
   "submission_id": "15tqrbp"
  },
  {
   "comment_id": "jwlajwp",
   "message": "Now that I'm well into my thirties I've noticed that I often have to think a couple of seconds longer than I used to in my twenties and teens before I am able to 'find' the specific word I want to use in a sentence. It can be embarrassing to confidently start saying something and then be forced to make some elongated 'uhhhhmmm' noise and try to somehow play it off as an oratorical choice or something before being able to continue. Yesterday it took me like ten seconds to unearth the word 'uncloggers' (it has a technical meaning in my line of work) and the 'uhhhhhhh' my mouth produced as I was frantically thinking was deafening. Something that I *gained -* and which actually surprised me a bit myself - is semen. I've noticed that I am producing greater and greater quantities of semen as I age, though this isn't correlated with an increased sex drive. This development isn't necessarily positive either, as I'm under the impression that this 'new' sperm (2.0) is somewhat discolored - darkened perhaps. I frequently squirt out teacup-sized loads but they sometimes have the hue of wet cement which is mildly unsettling",
   "created_utc": 1692287637,
   "score": 1,
   "submission_id": "15tqrbp"
  },
  {
   "comment_id": "jwld93n",
   "message": "Losing: peace of mind. Gaining: empathy.",
   "created_utc": 1692288601,
   "score": 1,
   "submission_id": "15tqrbp"
  },
  {
   "comment_id": "jwldl3u",
   "message": "I'm losing my capacity to enjoy anything, I don't really have any motivation to keep going like I used to, I have less energy, my libido is pretty much gone, I lost almost all the friends I had. I don't feel like I'm gaining much apart from grey hair and frustration.",
   "created_utc": 1692288722,
   "score": 1,
   "submission_id": "15tqrbp"
  },
  {
   "comment_id": "jwldoiv",
   "message": "Losing time and gaining weight",
   "created_utc": 1692288756,
   "score": 1,
   "submission_id": "15tqrbp"
  },
  {
   "comment_id": "jwleo9t",
   "message": "Losing - friends (move away, lost touch, etc.)\n\nGaining - income (Two promotions in 7 years)",
   "created_utc": 1692289114,
   "score": 1,
   "submission_id": "15tqrbp"
  }
 ]
}