{
 "submission_id": "15tqyrd",
 "title": "What infamous movie plot hole has an explanation that you're tired of explaining?",
 "selftext": "",
 "created_utc": 1692286512,
 "permalink": "/r/AskReddit/comments/15tqyrd/what_infamous_movie_plot_hole_has_an_explanation/",
 "score": 216,
 "url": "https://www.reddit.com/r/AskReddit/comments/15tqyrd/what_infamous_movie_plot_hole_has_an_explanation/",
 "comments": [
  {
   "comment_id": "jwm0l72",
   "message": "The first rule of fight club, and their growing number of members is because it is meant to teach the members to break rules.",
   "created_utc": 1692296912,
   "score": 33,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwluv38",
   "message": "Everyone always asks why there was a desert in Washington DC in Transformers 2. It has been clearly explained in a ton of discussions of that movie that it was just a really bad movie.",
   "created_utc": 1692294881,
   "score": 152,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwl8y5r",
   "message": "From Independence Day\n\n“How could a virus programmed on Earth computers destroy the computer system of an alien civilisation?”\n\nIn a deleted scene, it’s revealed that technology from the spaceship at Area 51 was harvested and used as the basis for most of Earth’s post WW2 computer technology. Once you know that, the whole thing becomes a lot more believable.",
   "created_utc": 1692287077,
   "score": 85,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwl9gsv",
   "message": "Lord of The Rings.  The Eagles. They are not a Taxi service,  they would be subject to the ring influence too, there are flying Nazgul that could intercept them, there is a big fucking spotlight eye that could shine on them the moment they approach the boarder of Mordor, failing all that, an entire army of Orc could wait at Mount Doom making any approach impossible. Edit: the Eagles are sentient. They are not mindless beasts that just do what ever  rider wants.",
   "created_utc": 1692287258,
   "score": 157,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwll335",
   "message": "Jack and Rose couldn't both fit on the door in *Titanic*. In the movie, they try to both get on the door and it capsizes, because the door isn't buoyant enough with both of them on it. Jack then gets off the door so Rose can get more of herself out of the water. It's in the movie. They try to do it in the movie and it doesn't work. It doesn't matter how much surface area the door had, it's the buoyancy of the door that was the problem.",
   "created_utc": 1692291422,
   "score": 70,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlwqyy",
   "message": "OH I HAVE ONE\nJurassic park!!!! So many people constantly talk about how it is so scientifically inaccurate and talk about all the dinosaur issues BUT the movie over and over and over says how they are genetically modified monsters, not real dinosaurs, not accurate at all. Even in the first movie they said dinosaurs likely had feathers but people still talk about how the movie is inaccurate for showing them with scales even tho they addressed it! Then they talk about how the dinosaurs fighting is inaccurate because they existed millions of years apart but the movie already said it was taking DNA and recreating monsters from all over the dinosaur era. I do not get why people constantly act like it is supposed to be a scientific movie about real dinosaurs when in the first trilogies Dr. Grant said \"what hamon did was create theme park monsters not real dinosaurs\"",
   "created_utc": 1692295541,
   "score": 208,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlt8c6",
   "message": "Dark Knight Rises - how did Bruce Wayne magically get to Gotham after he escaped the hole?\n\n\n1. In an adjacent scene it's mentioned the bomb will go off in a month, so we can assume that's how long he has to get back to Gotham.\n\n2. Wayne Enterprises has offices around the world. All he needs to do is get to an office, log in, and wire himself money or supplies to get home. He's Batman, he can easily do this without being noticed\n\n3. Batman Begins has a whole sequence of him traveling around the world penniless and nameless. This is a specific skill it's already established he has. \n\nThere are tons of plot holes in that movie, but for some reason people get hung up on the easiest one to explain",
   "created_utc": 1692294308,
   "score": 202,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwluwip",
   "message": "For the people who spend all the Star Wars movies saying, \"why don't they just Jedi Mind trick everyone into doing this or that,\" Obi-Wan is very clear the first time he uses it that it works on the \"weak-minded.\" \n\nI think the way Storm Troupers function throughout the first three films shows they aren't the sharpest tools in the shed and are probably bred/trained/selected to do whatever without question and just be cannon fodder.",
   "created_utc": 1692294895,
   "score": 59,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm8dq7",
   "message": "The flaw in the Death Star's construction. We didn't need Rogue One to explain it was a deliberate sabotage. \n\nSo an exhaust port has a flaw. It is not unreasonable to believe that the flaw was necessitated for efficiency.  Knowing that the flaw was inevitable, the trench leading up to the port was protected with gun towers. \n\nTarkin, along with other officers, fully believed that the Death Star was superior in its construction that small fighters would pose no threat to them. During the rebel assault, an officer pointed out to Tarkin that the rebel attack is exploiting this weakness and offers to prepare a transport for him, to which Tarkin responds, \"Evacuate? In our moment of triumph? I think you overestimate their chances.\" \n\nTo them, the weakness is negligible that there is no chance a rebel fighter would be able to drop torpedos into the port. And they were right. The first fighter to make an attempt failed. Luke was only able to succeed because he used the Force instead of the computer, something no one anticipated because they all believed that the Jedi were extinct.",
   "created_utc": 1692299678,
   "score": 13,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm6d9u",
   "message": "One of  Charles Foster Kane’s servants was outside his bedroom when Kane said “Rosebud.” The door was wide open. The dialogue later confirms that a butler heard Kane’s dying words and reported it to the paper.",
   "created_utc": 1692298977,
   "score": 139,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmdill",
   "message": "Tom Cruise is NOT the Last Samuria, Ken Watanabe is. Cruise is just the POV character. Its not a white-saviour movie, but instead is a white colonialist learning about the value of native cultures and people.",
   "created_utc": 1692301471,
   "score": 1,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlxxff",
   "message": "Not a film or show but a ton of people make fun of Meatloaf's song \"I'd Do Anything for Love (But I Won't Do That)\" thinking it's oxymoronic. However, the last verse of the song, sung by Lorraine Crosby, states \"I know the territory, I've been around. It'll all turn to dust and we'll all fall down. And sooner or later you'll be screwing around...\" to which Meatloaf responds \"I won't do that.\"\n\nThe thing that Meatloaf will not do for love is cheat on her.\n\nIt's an epic, awesome song that has been lampooned for decades due to the audience's misinterpretation of the lyrics... if they had just hung around 7 more minutes, they would get it--but they won't do that.",
   "created_utc": 1692295963,
   "score": 243,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlp1cq",
   "message": "Not a plot hole as such, but people complain about creepy emo Peter in Spider-Man 3.\n\nHe is being infected by the suit.  At first he is a bit cocky and women like it.  But as it progresses he gets creepier and evil.\n\nHe is supposed to be emo and creepy and it is supposed to be bad.",
   "created_utc": 1692292830,
   "score": 44,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm8kvm",
   "message": "Two of them.\n\n1. Stephen Spielberg's \"AI\" has an ending that is widely misunderstood. Those creatures at the end are not aliens, but hyper-advanced future robots. As aliens the ending makes even less sense.\n\n2. Star Trek 2: The Wrath of Khan. It's a common Trekkie question about how Khan could possibly recognize Chekov, since the character had not yet joined the cast during Khan's original episode in the first season.\n\nEasy explanation was that the character was there, but met Khan off-screen.",
   "created_utc": 1692299748,
   "score": 49,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlcfq6",
   "message": "In Wreck-It Ralph Felix could not fix vanellope with his hammer\n\nThat's because he lives in a world of a video game. A lot of older video games had damage states/values for entities \n\nHis hammer is not repairing the code or resetting it to its default state It is simply resetting the damage value of that object back to zero\n\nHe couldn't fix vanellope because her damage is not damage she is an entity took It is damaged due to King Candy / turbo intentionally sabotaging her code blocks and most importantly removing the links that connects them to the overall network\n\nThis is why she is able to exist in sugar Rush but not leave\n\n with her code severed the way it was and having those connections destroyed her entity data could not be passed to other devices. It's like she was isolated from an arcade-wide sort of internet as their conscious technically exists separate from their body\n\nTheir conscious exists within a block of code\n\nFelix can't fix that. Despite his mantra of I can fix it he can't\n\nHe doesn't know how to manipulate the code his hammer just resets damage values. And that's why he couldn't fix vanellope.\n\n((Also I think I have a potential explanation to the whole idea of why majority of characters in that universe don't really seem concerned by the whole danger of dying outside of your game but I'll save that for another thread as that one's more of a theory))",
   "created_utc": 1692288306,
   "score": 41,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm4hrw",
   "message": "Maybe not a plot hole per se, but Armageddon. People always parrot the statement “wouldn’t it be easier to train astronauts to drill, rather than teach drillers to be astronauts”. The premise of the movie is ridiculous (and an awesome dumb movie imo) but the movie explains it very clearly.\n\nFirst of all, only part of the team are drillers. There are still astronauts actually flying the shuttles. All the drillers were trained to do was spacewalk and survive while drilling in space. Secondly, the film shows that they did try training astronauts how to drill but they were failing at it. Bruce Willis’s character had created the most advanced drill that was needed to drill the asteroid but it was complicated to use. With the time crunch, Bruce Willis explained that there was not going to be enough time to teach them properly and it would be easier to teach the experienced drillers how to do spacewalks. \n\nAgain, the premise is ridiculous but it is explained pretty clearly. Besides, Payload Specialists are a real thing NASA uses so it’s not that outlandish.",
   "created_utc": 1692298313,
   "score": 253,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm7qvr",
   "message": "Home Alone - it’s very clearly explained how they paid for the trip to Paris and that Kevin’s dad didn’t foot the bill",
   "created_utc": 1692299455,
   "score": 83,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm8y6w",
   "message": "\"how did andy re-attach the poster after he crawled into the tunnel?\"\n\nhe didn't. the poster was only attached at the top, as evidenced by the scene where he is seen digging into the wall under the poster, then looking out when he hears someone coughing, then ducking back under it - the poster is CLEARLY securely attached at the top but freely moving at the bottom, thus allowing andy to lift it/let it fall back down whenever he needed.",
   "created_utc": 1692299876,
   "score": 104,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlv362",
   "message": "Han Solo knows what a parsec is. He was bluffing what he thought was a couple of yokels. The scripts says as much, and there’s a reaction shot.",
   "created_utc": 1692294960,
   "score": 84,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm185t",
   "message": "Superman didn't make the earth spin backwards to turn back time. He flew so fast he traveled back in time, the earth stopping and spinning backwards is from his perspective as it would appear to rotate reverse as he travels back in time.",
   "created_utc": 1692297141,
   "score": 32,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlbt9d",
   "message": "*The Dark Tower* movie and why it doesn't follow the book.\n\n\u0026gt;!It doesn't follow the book because the movie is a sequel to the main book series.  After Roland enters the Dark Tower, it sends him back to the beginning once again as this time he is closer to redemption and is given the Horn of Eld by the Tower.  He carries the Horn in the movie.!\u0026lt;\n\nI'm not saying the movie is good because of it, still a dumbed down action movie that would disappoint fans and newcomers would be lost.",
   "created_utc": 1692288081,
   "score": 203,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmc5fh",
   "message": "\"Somehow, Palpatine returned\".\n\nYou heard the man. Somehow!",
   "created_utc": 1692300990,
   "score": 1,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm87io",
   "message": "The Karate Kid.\n\nBoth Johnny Lawrence and Dutch both score on kicks to the face in the All Valley Karate tournament.\n\n  The crane kick is legal",
   "created_utc": 1692299618,
   "score": 25,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmeaa1",
   "message": "Is there some kind of Mandela Effect going on with the Titanic movie?\n\n\"Why doesn't Rose let Jack get on? They can both fit!\"\n\nJack does try to get on.\n\nIt starts to sink with both of their weight on it.",
   "created_utc": 1692301740,
   "score": 1,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlh5jf",
   "message": "There are no plot holes in \"Signs.\"\n\nNot providing very much information is not the same thing as a plot hole. We aren't given enough information about the aliens to determine their motive for coming to a planet where the atmosphere is deadly to them. But there are numerous potential explanations.",
   "created_utc": 1692290020,
   "score": 80,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm364z",
   "message": "If you watched your child grow up for years, you wouldn’t suddenly say, hey, doesn’t he look like that kid we knew for a week 30 years ago? Especially because there were no pictures of “Calvin Klein”. You’d probably just see the designer and assumed that was who you met.",
   "created_utc": 1692297838,
   "score": 119,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlzj6m",
   "message": "The McFly's briefly meet a guy named Marty in high school. They had no pictures of him. Their youngest son kind of reminds him of the guy. But they don't know about time travel. George trusts his wife. \n\nGeorge never stood up for himself. By punching Biff, he got a confidence boost. This changed the course of his life for the better. Biff never recovered.",
   "created_utc": 1692296535,
   "score": 178,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlrn6j",
   "message": "I’m tired of these threads being filled with answers about big-budget blockbusters, so I’m going to talk about a movie I’ve been thinking about since I was thirteen.\n\nIn Pokémon: Lucario and the Mystery of Mew, everyone always brings up how Sir Aaron got through the Tree of Beginning without getting attacked by its antibody defense system, while Ash and his companions all nearly got killed by them while travelling through the Tree. But there’s a scene that shows Kidd, an adventurer in the group, sending these little drones to take samples from the tree, triggering its defenses. The antibodies only start attacking the humans after this scene. When Sir Aaron went through the tree previously, he likely didn’t trigger the defenses and got through unscathed. \n\nAlso, people think that Lucario should’ve gotten sick from the chocolate bar he eats at one point. But Lucario is a Pokémon, not a dog, so there’s no evidence that chocolate can harm him.",
   "created_utc": 1692293744,
   "score": 210,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm7qbr",
   "message": "Jurassic Park, people are surprised that Lexi would know that Unix system.\n\nWhy would a kid know how 5 or 6 digit cost Unix workstations operate?\n\nWell, maybe most kids won’t, but most kids also don’t have a rich ass grandpa with connections to genetic engineering work. Who knows what she might have been allowed to play with while visiting grandpa at an office or whatever? Not to mention there were some Unix OS in the home market at least in the early 80s, like Xenix.\n\nI’m just saying that while it wasn’t common, it also wasn’t impossible that a kid in the early 90s might have had some Unix experience.\n\nThe line delivery aside I don’t see the problem.\n\nAlso I’ve seen some people assume it was a “Hollywood UI”, but that was legitimately a file browser available on SGI machines at the time, hell, I bought myself an SGI Indy 10 years back just because the thought of owning a computer that used to cost a shit ton of cash amused me, and that file browser was on there.",
   "created_utc": 1692299450,
   "score": 51,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlx3qd",
   "message": "Apparently the exhaust port from Star Wars.  It was so bad they made a whole movie about it!",
   "created_utc": 1692295666,
   "score": 65,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwme694",
   "message": "I'm tired of explaining the concept of buoyancy to people whine about Titanic.",
   "created_utc": 1692301701,
   "score": 1,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlt4zi",
   "message": "Why did the 3 Jedi Masters fall to Palpatine so fast?\n\nOkay so aside from shoddy writing and directing on George's part, they weren't dealing with some ordinary Sith master. They were dealing with the Emperor himself, who could only have been contested in a duel blade for blade against someone like Mace Windu.",
   "created_utc": 1692294275,
   "score": 102,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwll841",
   "message": "The Snitch in Quidditch has an in universe explanation that's actually really cool. The winner of the cup isn't the team that wins the most games it's the team with the most total points. So it's not necessarily the best strategy to catch it right away.\n\nAnd fine that's still clearly designed to be cinematic but it at least makes as much sense as other aspects of wizard culture.",
   "created_utc": 1692291471,
   "score": 213,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwm66yz",
   "message": "Taking the eagles to Mordor in Lord of the Rings. You really think the Nazgûl aren’t going to notice a bunch of eagles flying around Minas Morgul? Plus the eagles got their own shit to worry about.",
   "created_utc": 1692298916,
   "score": 38,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmeezx",
   "message": "Signs. They are demons not aliens.",
   "created_utc": 1692301786,
   "score": 1,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlyis3",
   "message": "Armageddon.\n\nThey can't train astronauts to drill because it's impossible to drill into an asteroid. Harry Stamper, however, has made a career out of doing the impossible. \n\nIt doesn't make sense but it does so in context of the movie.",
   "created_utc": 1692296175,
   "score": 43,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlu6yv",
   "message": "That Han Solo doesn't say, \"I love you, too\" to Leia but says, \"I know,\" before he goes into the carbonite. People think he's making a joke or being an out-of-character kind of asshole.\n\nBut really, it's totally consistent with the story. He said that to let Leia know that he knew it all along and there is no need for her to feel regretful for not telling him before. It was more important and a more loving gesture to say that than just parrot back her, \"I love you.\"\n\nEDIT: As someone added here, actually in the script Han was supposed to reply \"I love you,\" but Harrison Ford thought Han should say something else. People treat it like a plot hole, that he makes a joke or something there when he should say, \"I love you,\" but Harrison Ford knew that Han wouldn't say the way it was scripted. So it's the opposite of a plot hole, in a way.",
   "created_utc": 1692294647,
   "score": 182,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwlxz58",
   "message": "Jack and Rose could not have both gotten onto the door. They even showed Jack trying to climb up and the whole thing capsizing",
   "created_utc": 1692295980,
   "score": 36,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmf1w7",
   "message": "She's All That.\n\n\"So, he makes a bet that he can make a pretty girl into the hot girl when all it takes is taking off her glasses and fixing her hair and changing her out of overalls and into a red dress?\"\n\nNo.\n\nThe bet was that he could make Laney Boggs into a Prom Queen, over the more popular, but less likeable Taylor Vaughn.\n\nZac explicitly points out that she's \"scary and inaccessible\" - an antisocial artsy chick who shuts herself off from people and hides in her basement to paint. It isn't until he does chores for her to free up her time enough to get her to leave the house and go to the beach and join a party, that she becomes well known enough to be a serious contender for Prom Queen. \n\nAlso, Laney still loses. As it turns out, fixing up her appearance doesn't automatically help her win a popularity contest.",
   "created_utc": 1692302006,
   "score": 1,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwl7kmz",
   "message": "\"Indy didn't need to do anything in Raiders\": He did most of the legwork to find the Arc before Belloq snagged it.",
   "created_utc": 1692286585,
   "score": 97,
   "submission_id": "15tqyrd"
  },
  {
   "comment_id": "jwmf9ao",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15tqyrd"
  }
 ]
}