{
 "submission_id": "15trgem",
 "title": "54% of Americans between the ages of 16 and 74 read below a 6th grade reading level. Why do you think that is?",
 "selftext": "",
 "created_utc": 1692287626,
 "permalink": "/r/AskReddit/comments/15trgem/54_of_americans_between_the_ages_of_16_and_74/",
 "score": 108,
 "url": "https://www.reddit.com/r/AskReddit/comments/15trgem/54_of_americans_between_the_ages_of_16_and_74/",
 "comments": [
  {
   "comment_id": "jwmanse",
   "message": "16-74 is a huge range. Someone born in 1948 didn’t have an ipad growing up. A lot of them quit elementary school to work on the farm. My grandpa was illiterate. It’s far less common today",
   "created_utc": 1692300467,
   "score": 149,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwlbl23",
   "message": "There is no reason to really read above that.  Newspapers (when we read newspapers ) are only written at that level. Popular novels like [Harry Potter](https://www.goodreads.com/shelf/show/6th-grade-level) are written at a sixth grade level. The average American can do all of their day to day business without needing to read at a higher level. \n\n[6th Grade level standards](https://www.scholastic.com/parents/school-success/school-success-guides/guide-to-6th-grade.html). \n\nWhile education for most people continues after 6th grade they lose those skills if they don't use them and unless they have an interest in literature they don't use them.",
   "created_utc": 1692287999,
   "score": 4,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwlhy4g",
   "message": "13% of the population is of non-English speaking immigrant status, so that accounts for a big chunk of that.\n\nAnother chunk is that reading is seen as undesirable behavior due to rampant anti-intellectualism by a significant segment of the population in the country. To quote the movie Idiocracy, for some \"reading is for f*gs.\"\n\nAnother chunk is the abysmal public education system in many of our over 13,000 school districts. I teach at two universities and can honestly say about 1/3rd of any given class that I teach is functionally illiterate.",
   "created_utc": 1692290304,
   "score": 74,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmyosp",
   "message": "Because 6th grade is where we expect people to be pretty fucking literate. 6th grade reading level isn't sounding out words and rushing to the dictionary for common vocabulary. It's being able to read well enough for standard, day to day stuff.\n\nIt's a bit of a bummer that more people don't go any further, but 6th grade isn't deficient, it's the default setting.",
   "created_utc": 1692309063,
   "score": 26,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwlrgsj",
   "message": "In my family, my parents were both avid readers and I have read a lot. But my brothers thought it was cool to hate reading and thought I was a dork for liking it. So they grow up thinking that, so they never develop those skills. Then when they are an adult, they feel too embarrassed to try bc they feel so behind everyone else. Also they have never had a book speak to their soul, so they don't know how great it can be.",
   "created_utc": 1692293682,
   "score": 40,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmkkxg",
   "message": "The United States has the most immigrants than any other country. With that said, English isn’t some of our first languages. Sometimes when I think in my head in English I combine my home language with English",
   "created_utc": 1692303959,
   "score": 8,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmn1ki",
   "message": "Because reading at a higher level isn't necessary to accomplish most tasks.",
   "created_utc": 1692304826,
   "score": 11,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwn6c0f",
   "message": "Yet on reddit, everyone seems to believe that ‘everyone goes to college.’",
   "created_utc": 1692312040,
   "score": 5,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwo03os",
   "message": "Because 54% of people don’t pack the gear to read at a higher reading level.   \n\nGuess how many Japanese people read at that level…54%",
   "created_utc": 1692324892,
   "score": 5,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwlj5tz",
   "message": "The schools are definitely a part of it but its also how kids are raised. I've never heard tale of a kid who's parents would read to them atleast a few nights a week not reading at several grades higher than their school peers.",
   "created_utc": 1692290738,
   "score": 19,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmnpno",
   "message": "My brother probably cant read above a 6th grade level. He and I are probably about equally intelligent and we went to the same schools, even had some of the same teachers. I was in honors English while he had to do years of after school tutoring, and he still cant read all that well. He is an electrical engineer, and is currently in a supervisory role. I work in material science. I feel like reading at or above a certain grade level isn't a great metric of overall intelligence.",
   "created_utc": 1692305061,
   "score": 10,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnx3i5",
   "message": "Weird everyones saying it’s an age thing. My 4, 90+ year old grandparents are fully literate, even the ones that did poorly in school. Where as my aunt in her 70’s is around a 6th grade reading level. (I only found out after having her read an essay of mine aloud, got an A on it but she struggled to read it) I’m not sure how people like her function. To make matters worse she was a secretary. I honestly think some people are just left behind, especially considering the human brain isn’t fully ready/capable to read before 10 years old.",
   "created_utc": 1692323561,
   "score": 4,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwo3lmu",
   "message": "Because the American education system is unnecessarily politicized and deliberately underfunded.",
   "created_utc": 1692326504,
   "score": 5,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwne2oy",
   "message": "How do you gauge reading level?  Is there an online test I can take?",
   "created_utc": 1692315312,
   "score": 3,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnhpm7",
   "message": "A certain group of people dumb themselves down on purpose! Who knows why, it's passed down generation to generation! For one it's not let me aks you a question it's simply ask.",
   "created_utc": 1692316887,
   "score": 3,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwll9zo",
   "message": "Because America does not value education",
   "created_utc": 1692291490,
   "score": 36,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmg7tt",
   "message": "[deleted]",
   "created_utc": 1692302418,
   "score": 5,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmb55c",
   "message": "Kids learn habits from their parents. If parents don’t read for pleasure then a lot of times their kids won’t read for pleasure. I think there is a pliable period in a young person’s brain where they learn how to visualize what they read, while they read, so it’s like a movie in the persons mind (but almost better in a way).",
   "created_utc": 1692300635,
   "score": 8,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmcke5",
   "message": "Because schools are graded on how many kids pass standardized tests and regular classes. Kids get passed into the next grade regardless of how poor their grades are. Better grade for the school = more funding. I remember a girl in junior year who would absolutely struggle and take 15 minutes to read a short paragraph.",
   "created_utc": 1692301136,
   "score": 7,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwni2vj",
   "message": "I think it's due to schools sometimes forcing kids to read certain books and materials. Let them explore, and find out what they like. I think a lot of kids hate reading is it being forced on them in a negative manner. So that leads to not wanting to learn further.\n\n\nI love reading. I remember when I was in school being forced to read certain books. Some I understood, some I didn't. (At the time.) I remember picking up some books on my own that interested me. My teacher had said I shouldn't read them since I either wouldn't like them, or wouldn't understand them. I didn't care. I read them anyways. So what if I didn't fully understand the story at the time. I was enjoying the act of reading. I felt it was better to get part of a story I actually liked vs nothing from a story I hated.",
   "created_utc": 1692317050,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwno0jl",
   "message": "Poverty and shitty schools",
   "created_utc": 1692319620,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnp2rm",
   "message": "Half the population has below average intelligence, it's sort of a math thing.",
   "created_utc": 1692320076,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnuvzs",
   "message": "Its most likely because those people are getitng dumber.",
   "created_utc": 1692322602,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnwhzq",
   "message": "If one has a learning disability I can understand and empathize with that otherwise it most likely is laziness, embarrassment or willful ignorance, which seems to be more popular lately.",
   "created_utc": 1692323305,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnzhk4",
   "message": "Their parents either couldn't read, weren't educated or didn't sufficiently value reading. If education isn't valued, it's worthless.\n\nEDIT - nothing personal.",
   "created_utc": 1692324611,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwo0xa8",
   "message": "Have you talked to a stranger recently? Do that a couple of times and you'll realize that number's not insane. Without just blanket calling people stupid, you have to consider the value of that literacy to, say, a retired farmer. He may have never learned to read and has no reason to. Pick a smaller range or a specific demographic and you can start getting reasonable answers.",
   "created_utc": 1692325269,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwo1h50",
   "message": "I know that most older people that I work with have awful spelling and grammar and I think that's probably because they didn't get the practice that we did with the internet age. Young people? I have no idea. I got sent to a private very expensive school as a child and I swear I was the only literate one in my class. When we had to read to the class it was fucking painful at times. It took forever to get through chapters and then when it was my turn my crackhead nervous ass would speed read the shit out of it and nobody could understand me. We didn't learn shit in those classes lol.",
   "created_utc": 1692325521,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwo7vvv",
   "message": "Because a large swath of the country is anti-education and thinks to much book learnin' is a bad thing.",
   "created_utc": 1692328577,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwo817z",
   "message": "Have you read any articles recently? I catch grammatical errors regularly. I'm not perfect by any means, but I'm constantly finding misspelled words, words used incorrectly etc. Now again, mistakes will happen, but we have fuckin spell checker and apps like grammarly (or however it's spelled). There's literally ZERO reason why a simple spelling mistake should make it through the drafting process, then slide across an editors desk and gets missed again? Asinine.",
   "created_utc": 1692328651,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwoa05c",
   "message": "A lot of schools got literal their funding gutted.",
   "created_utc": 1692329654,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwoakwr",
   "message": "i'm going to have to google this later but this stat sounds like the shocking stat that only like 40 percent of americans have a bachelor's and fewer have a master's. \n\ni mean there is the root of a lot of current ills in our society, a woefully under-educated populace that is by design.",
   "created_utc": 1692329955,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwouj7w",
   "message": "Numerous factors.\n\nIt's both a willful ignorance to not read and understand language as well as just not developing right mentally to understand language and to read.\n\nBut these days, you can see it in practice because people are responding by what they read in the headlines. Only maybe 2% of the entire comment section, are those who've read the whole thing.",
   "created_utc": 1692342565,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwovctp",
   "message": "TBH, that's the level of a lot of reporters who work for media sources. Every time I spot a grammatical or spelling error in a news article, a little piece of me dies inside.\n\nI'd say it's worse now. Many people don't read anything beyond stuff online, like news articles or essays. And when I went to high school in the late 2010s, hardly anyone really paid attention in English class.",
   "created_utc": 1692343197,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwoxx1a",
   "message": "You need to know median not only an average. Outliers mess up the data.",
   "created_utc": 1692345169,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwoyalx",
   "message": "People don't respect reading.\n\nMy mom is almost certainly one of those statistics.  The whole family reads but her.  She then complains that she can't do well in college courses because she is a slow reader.  She also might have a reading disorder, but who knows no one will check.",
   "created_utc": 1692345468,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmgzml",
   "message": "I know this isn’t the right answer to your question, but if I had to venture a guess, a lot of people are led to believe that reading isn’t cool in early education by their peers- and take that forward through life. I know a few people who are around 30 who say they haven’t read a book since high school. Reading never became a hobby for a lot of people.\nReading is just like any other skill, if you don’t do it often enough you will get worse at it as time goes on.",
   "created_utc": 1692302697,
   "score": 3,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwlbbkt",
   "message": "I think it's because of the decline in reading habits due to the rise of technology and social media.",
   "created_utc": 1692287906,
   "score": 6,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnm0vb",
   "message": "Education being tied to property taxes.\n\nThe general hatred for teachers making money.\n\nThe glorification of being cool and not reading.\n\nI could keep going but I think this is sufficient.",
   "created_utc": 1692318749,
   "score": 4,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwlbe4n",
   "message": "Public skool",
   "created_utc": 1692287931,
   "score": 3,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwme9oz",
   "message": "poor education system",
   "created_utc": 1692301734,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmfitx",
   "message": "Damn I think I can read above that level 😂😭",
   "created_utc": 1692302172,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmmfaz",
   "message": "Because we're a nation of immigrants a good # of us aren't speaking English as our first language, even when we're born and raised here.",
   "created_utc": 1692304610,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmnddf",
   "message": "They don't require reading credits as a graduation requisite anymore, they stopped doing it at my school when I was a freshman in hs",
   "created_utc": 1692304941,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmqtov",
   "message": "Because our schools suck and don't encourage literacy.  We were in Detroit and my wife worked with some people talking about some books they read in school.  Books my wife read at age 10 these people read at age 15.",
   "created_utc": 1692306164,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwncxp0",
   "message": "Because they simply don't need to read any better to live their life.\n\nMany of us took 2+ years of a foreign language in high school, how many of us can hold a conversation in that language now? Not many, because we don't ever end up actually needing it. You've heard of the saying \"use it or lose it\", right?\n\nCombine that with parents not reading to their children, and English classes being about the worst place possible to foster any kind of love for the written word, and here we are today.",
   "created_utc": 1692314810,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwneo89",
   "message": "Honest question: is this a problem? What content, exactly, are you hoping that American adults would be reading that would require a higher reading level?",
   "created_utc": 1692315572,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnnpfj",
   "message": "Poor teaching methods",
   "created_utc": 1692319485,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnz4yd",
   "message": "Decades of disinvestment in our educational system.",
   "created_utc": 1692324455,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwlcl5y",
   "message": "It makes sense when you consider tons of schools only have 50% pass rates on student reading proficiency. It has gotten worse with COVID, I think that something like 68% of 3rd graders are not reading proficiently now. \n\nThat being said I’m curious where this statistic came from since according to things like the literacy project, the average adult reads at a 8th grade proficiency. Not that it’s a vast improvement, but still statistic hear seems wrong. Source?",
   "created_utc": 1692288361,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwm17zd",
   "message": "For the folks ~30 and under, a lot of schools started using weird methods to teach kids how to read that did not include phonics or “sounding out” words. They would teach kids to guess words they didn’t know based on context and pictures and assumed they would “figure it out” if they practiced enough. My school or my friend’s schools didn’t teach that, but so many did because it was a trendy method among teachers. Listen to the podcast Sold a Story, I thought it was really interesting and had no idea that was and continues to be an issue. Fortunately, many states are starting to pass laws banning those methods.",
   "created_utc": 1692297139,
   "score": 2,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwljukb",
   "message": "Education in the US has been underfunded since the 1980’s",
   "created_utc": 1692290982,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmfwyl",
   "message": "Why read word when tiktok do trick?",
   "created_utc": 1692302312,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmy7kf",
   "message": "1) It has become functionally impossible to hold a child back for a grade level. Rather that realizing that Junior needs another year at the same grade level to catch up and let his skills develop, it's feared that holding him back would harm his social development. So he's pushed ahead along with all his peers. His teacher needs to focus on ensuring her other 27-36 students learn the material for the current grade level, so her time to work with Junior individually is limited. If there's more than one Junior in class, then no one is getting sufficient attention and everyone suffers. Without significant support, Junior won't be able to catch up but will be promoted each year regardless of achievement. \n\n2) Junior's parents don't think of it as their job to teach Junior to read. That's what they pay taxes for, after all. Even if they had the inclination to help Junior catch up on his reading skills, if they're lower-middle class (or even middle class nowadays) they may not have the time and resources necessary to help (teaching him themselves, hiring a tutor, \u0026amp;tc). \n\n3) Junior has little opportunity to practice his reading skills outside school. All his entertainment is visual - TV, TikTok, YouTube. He doesn't go to places like reddit because it's too hard to process. And with video-based social media existing, he doesn't have to. \n\n4) Junior's congressional representative doesn't give a fuck that Junior can't read. All he wants is for Junior to learn just enough to become a blue collar worker. He wants to see Junior become a cashier, custodian, construction worker, factory worker, or other semi-skilled labor. And because Junior can't read, he can't hope for a better job with better pay and benefits. He likely won't develop the critical thinking skills necessary to understand why his life is so shitty and will just hate whom he's told to hate - uppity women, migrants, queers, \u0026amp;tc. \n\n5) It's also possible that Junior's clerical leader is suspicious of Western education. Reading too much leads to questions, which leads to loss of faith. Better to keep Junior ignorant; because he's in agreement with the Congresscritter that Junior's better off in a blue collar job where he works way too many hours to question his faith.",
   "created_utc": 1692308884,
   "score": 3,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmrjnw",
   "message": "I personally believe that U. S. Americans are unable to do so because, uh, some people out there in our nation don't have maps and, uh, I believe that our education, like such as in South Africa and, uh, the Iraq, everywhere like such as, and I believe that they should—our education over here in the U. S. should help the U. S., uh, or, should help South Africa and should help the Iraq, and the Asian countries, so we will be able to build up our future, for our children.\n\nThis is not a real comment for those unaware but a real answer for the question “Recent polls have shown a fifth of Americans can't locate the U. S. on a world map.  Why do you think this is?” by Caitlin Upton in her bid for 2007 Miss Teen USA. Good times.",
   "created_utc": 1692306425,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwld62q",
   "message": "American education has become a meat grinder, meant to churn out lowest common denominator shills that do all the lesser desired work of society. Teachers have been de-professionalized, are not compensated nearly well enough and are overworked. Meanwhile home dynamic relies more heavily on outside sources for raising children. The goal is washed down, standardized robots, not real education.",
   "created_utc": 1692288571,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmh1ii",
   "message": "I personally believe that U.S. Americans are unable read well because... some people out there, in our nation, don't have books and I believe that our education, like such as South Africa... and the Iraq, everywhere like such as, and I believe that they should... our education over here in the U.S. should help the U.S. or should help South Africa and should help Iraq and the Asian countries, so we would be able to build up our future... for our children",
   "created_utc": 1692302716,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwn0kzh",
   "message": "“There is a cult of ignorance in the United States, and there has always been. The strain of anti-intellectualism has been a constant thread winding its way through our political and cultural life, nurtured by the false notion that democracy means that 'my ignorance is just as good as your knowledge.”\r  \n― Isaac Asimov",
   "created_utc": 1692309781,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwml2we",
   "message": "Conservatism 100% due to anti intellectualism",
   "created_utc": 1692304136,
   "score": 255,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwldput",
   "message": "Combination of poltiicization of education and demographics.",
   "created_utc": 1692288770,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmvs2p",
   "message": "\"Me fail English?  That's unpossible!\"",
   "created_utc": 1692307974,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwn3il3",
   "message": "Faulty teaching and too much emphasis on \"feeling good about yourself.\"",
   "created_utc": 1692310924,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwn87bz",
   "message": "Our education system cares more about  DEI and Trans athletes.",
   "created_utc": 1692312806,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnm4gs",
   "message": "Republicans defunding education at every level.",
   "created_utc": 1692318792,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwm5ioa",
   "message": "Foe decades, education has been on the decline. Teachers criticizing someone's child are threatened with a lawsuit. Violent parents and children threaten teachers. Funding is cut, education is scoffed as nerdy - athletes and actors are valued. The list goes on.",
   "created_utc": 1692298679,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmm2nu",
   "message": "Hardly anyone young is reading an actual book outside of school",
   "created_utc": 1692304487,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmxp42",
   "message": "Because young adult books are way better.",
   "created_utc": 1692308691,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwn86tc",
   "message": "I think what the misnomer here for many is this is about reading comprehension. \n\nIt's not simply being able to read what's in front of them. \n\nIt's understanding what you read. Which is not just simply understanding the definitions of the words you read either. \n\nI can tell you that most people on reddit that critically reply to my comments don't even understand what I am saying a good chunk of the time. \n\nPeople are too reactionary, people are not taught well enough and tested enough on reading comprehension, and too many don't care what is being said if it's not clear/what they want to hear within a few seconds of reading.\n\nIt's the reading version issues of talking to someone today. It's just that for most, they can get by with broken English, slang, etc so it's a bit easier in the verbal sense than reading sense. But it's education, mindset, instant gratification, and English as a second language issue that affects both (reading/verbal communication).",
   "created_utc": 1692312800,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnajyj",
   "message": "Bot",
   "created_utc": 1692313789,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnei4o",
   "message": "Schools largely don’t teach kids how to read past that level.\n\nIt’s not just bad schools in underserved neighborhoods, either. I took honors English for my first college English class. My classmates were the top of their class kids from fancy wealthy suburban public schools. A lot of them could not read past a 6th grade level and couldn’t write a paragraph that was coherent in any way.",
   "created_utc": 1692315499,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnepow",
   "message": "Can you summarize post this in fewer words? I got bored reading it.",
   "created_utc": 1692315590,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwng8n7",
   "message": "Learning how to read sucks. Schools teach sight words, just about anyone else will try to teach phonics, and too few parents read aloud to their kids. Public Libraries (they don’t exist everywhere anymore) are underutilized. They are a treasure trove of story times, and pre-k activities. Plus, there’s no better reading motivator for a young child than to get their library card. Use your public library and make sure they are funded with your tax dollars. \n\nLet kids read what they are interested in. Don’t go by what AR scores say. If a kid wants to read, they will learn how to read. \n\nNot all kids are developmentally ready to learn to read by pre-k/kindergarten. That’s OK-unless you’re in public school and tied to standardized testing. In other countries, kids don’t read until 7+! In the US we freak out if a 5yr old can’t read.",
   "created_utc": 1692316253,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnxl22",
   "message": "Reaganomics...Republicans want Americans to be stupid.",
   "created_utc": 1692323773,
   "score": 1,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwlv93i",
   "message": "That explains why a guy like Trump can become President of the U.S. ...",
   "created_utc": 1692295016,
   "score": 254,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwm64mt",
   "message": "Because it isn't true.",
   "created_utc": 1692298893,
   "score": 255,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmcud7",
   "message": "I’m not exactly sure all the different reasons that cause this but I’m pretty sure that this has a lot to do with why the Republicans can sell culture wars instead of things it would actually help that group.",
   "created_utc": 1692301233,
   "score": 255,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmbn9u",
   "message": "We are finally reaping the consequences of cutting education for the past 40 years.",
   "created_utc": 1692300811,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwn27mt",
   "message": "Most do not know of the world that exists beyond theirs.",
   "created_utc": 1692310414,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmmko9",
   "message": "Republicans doing everything they can to keep education standards incredibly low.  \n\nOf those 54% that can’t read I’d be willing to major large sums of money the majority vote Republican(against their own best interest of course)",
   "created_utc": 1692304662,
   "score": 254,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmmgkm",
   "message": "Because academic standards are raysys, havent you heard?",
   "created_utc": 1692304622,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmw99b",
   "message": "Because to keep the population uneducated suits the agenda of those in power. That is the reason.",
   "created_utc": 1692308150,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwn5h7u",
   "message": "Poor educational system.",
   "created_utc": 1692311699,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwncli4",
   "message": "Because American education is a joke, largely thanks to decades of sustained attacks by conservatism and religious fundamentalism which know education is a threat to their existence.",
   "created_utc": 1692314662,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwo7o75",
   "message": "Democrats and teachers unions.",
   "created_utc": 1692328471,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmrphp",
   "message": "Add to all of this Religious people who believe that the Bible is the only correct book, but most of the time don't read it themselves...",
   "created_utc": 1692306483,
   "score": 255,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwlopux",
   "message": "All the books are banned",
   "created_utc": 1692292718,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwnld1p",
   "message": "Because right wing religious conservatives have been on a warpath to destroy American public education since the Reagan administration and it gets worse every election cycle.",
   "created_utc": 1692318462,
   "score": 255,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwlistj",
   "message": "Because a 6th grade reading level is an arbitrary metric",
   "created_utc": 1692290610,
   "score": 252,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwlqkh7",
   "message": "I could only read the first word",
   "created_utc": 1692293362,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmstf3",
   "message": "I stopped reading books after the 6th grade",
   "created_utc": 1692306885,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmsu5g",
   "message": "Me failed English?  That's unpossible!",
   "created_utc": 1692306892,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmv3ao",
   "message": "Wut duz dis pos say?",
   "created_utc": 1692307719,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmwk53",
   "message": "They would tell you if they could read the post",
   "created_utc": 1692308263,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmy5u8",
   "message": "I'd be interested to see if the majority of these people are Republicans.",
   "created_utc": 1692308866,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmy5uo",
   "message": "Right wing school districts.",
   "created_utc": 1692308866,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmzftv",
   "message": "Public schools have been underfunded for decades. It's intentional, they intend to ruin the public school system so everyone will have to pay for private school. \n\nIn private school they can teach, or not teach, anything they want..",
   "created_utc": 1692309345,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmzmkv",
   "message": "What does this post say?",
   "created_utc": 1692309417,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwmztm5",
   "message": "4chan",
   "created_utc": 1692309491,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwn0a9b",
   "message": "Because we don’t read no good",
   "created_utc": 1692309666,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwn1b50",
   "message": "NA education LULE",
   "created_utc": 1692310061,
   "score": 0,
   "submission_id": "15trgem"
  },
  {
   "comment_id": "jwn6lyx",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15trgem"
  }
 ]
}