{
 "submission_id": "15tsvwq",
 "title": "People who don't approve of their friend's SO, what's your reason?",
 "selftext": "",
 "created_utc": 1692290924,
 "permalink": "/r/AskReddit/comments/15tsvwq/people_who_dont_approve_of_their_friends_so_whats/",
 "score": 82,
 "url": "https://www.reddit.com/r/AskReddit/comments/15tsvwq/people_who_dont_approve_of_their_friends_so_whats/",
 "comments": [
  {
   "comment_id": "jwlk556",
   "message": "She ran him over with his own car, then stabbed him in the chest with the knife he got her. They're still together.",
   "created_utc": 1692291086,
   "score": 174,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlskjk",
   "message": "I did not approve of my mom and my english teacher because \n\n1. I had been crushing on him for YEARS and \n\n2. Ahem- they were loud.",
   "created_utc": 1692294073,
   "score": 112,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlndr8",
   "message": "Because he is Jewish, she is Muslim, their families dislike each other and they're each waiting for the other one to give in on what faith their children should be raised with. Not enough eye roll emojis in the world really.",
   "created_utc": 1692292243,
   "score": 86,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlmhqq",
   "message": "Because he is a spoiled, entitled, bullying ass. Or at least he was in high school.\n\nOur high school quarterback (lets call him James) was an 80's movie cliche. Good looking, rich, arrogant, did well in school (seemingly without trying). His parents had fertility issues and he was the \"miracle\" baby they unexpectedly had in their early 40s. The point is James was BEYOND SPOILED.\n\nOne of James's buddies, a linebacker on the football team (lets call him Fatass), kept asking my best friend out. She was not allowed to date and she wasn't interested in Fatass so she rejected him...repeatedly. Fatass started harassing my friend. At one point Fatass grabbed my friend's butt in the hallway. She reported him. Fatass ended up suspended from the team for two months (many other girls had reported him before). So James, the quarterback, and several teammates started harassing my friend NONSTOP to avenge Fatass. After a solid miserable quarter of this, Fatass was back on the team and most of the players backed off.\n\nBut James did not. He continued harassing my friend for another month before randomly asking her out. She refused. He said if she went on one date with him he'd leave her alone. She refused. He stepped up the harassment and she finally agreed. I don't know what he did but she agreed to a second date. Now they're attending the same university and living together. She's happy, and I'm glad for that, but it fucking sickens me that this guy got away with this shit AND got his victim to fall for him.",
   "created_utc": 1692291923,
   "score": 57,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmj4nq",
   "message": "My wife’s friends probably think I’m a controlling monster. Any time she doesn’t want to do something or bails at the last minute she uses me as an excuse. It doesn’t particularly bother me, but seeing this thread made me think about how her friends must view me.",
   "created_utc": 1692303449,
   "score": 19,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm0eze",
   "message": "This happened like 8 years ago. She tried to make a move on me. Put her hand down my pants at a party in front of a bunch of people. I instantly backed away. I told him what she did and he got mad at me.  He was my best friend. Even his parents got mad at me for making up a story and they said she would never do something like that. They’re married and have a kid now.",
   "created_utc": 1692296851,
   "score": 37,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlrtee",
   "message": "Controlling and 27-year age gap with not a lot in common.",
   "created_utc": 1692293805,
   "score": 52,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwln2ms",
   "message": "He's a drug dealer, who took her on 'driving dates' in his expensive car, mostly to sell drugs. She is a little sheltered and hadn't really dated but is a wonderful person.\n\nShe was asking whether police might arrest her if they stopped his car during a drug deal, even though she was just 'hanging out'. \n\nWhen I told her I thought that was more red flags as you see at a Chinese embassy, and she should stop seeing him, or at least not get into his car when drug dealing, she said she was really enjoying the driving dates and didn't want to stop, because otherwise, he liked to hang out with her at his place and his ex girlfriend had a key and on multiple occasions had burst into his apartment and gotten into screaming arguments with him that turned physical, all while trying to take her dog back which he'd kept.\n\nI didn't come around to her side of things after that explanation, much to her surprise.",
   "created_utc": 1692292131,
   "score": 27,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmc4y9",
   "message": "My best friend was dating a guy who was (to quote Logan Roy) fathoms below her. He was uneducated, crude, and trashy. \n\nNow, before you go on thinking I sound like a snob, I gave this guy every benefit of the doubt. Maybe he’s kind and has a big heart. Maybe he’s tying to better himself, etc. Nope. He just all around sucked. \n\nHe once walked in to my apartment, lit a cigarette (I don’t smoke) and asked if I had any beer. That was the final straw. I distanced myself from the friendship because this guy was just such a clown I couldn’t deal with him. And my friend didn’t go anywhere without him. \n\nIn the end he cheated on my beautiful, brilliant friend with a 19 year old stripper. We were in our mid 20s and he was older than us. \n\nOur friendship bounced back and she’s now married to the ying to her yang. Her husband is an amazing partner and person and he’s become a genuine friend. \n\nAnd while it feels like that previous relationship was a lifetime ago I still secretly hope that every day he wakes up and steps on a Lego.",
   "created_utc": 1692300985,
   "score": 29,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlox9k",
   "message": "Because he’s a total man child. Treats her like complete garbage. And he’s ugly.",
   "created_utc": 1692292791,
   "score": 35,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlyfxj",
   "message": "The older I get, the less I want to interact with people and be social. I don't enjoy going out and meeting people anymore, I like being alone.",
   "created_utc": 1692296147,
   "score": 12,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlw0p2",
   "message": "Was my SO for 7 years 4 months ago🤣",
   "created_utc": 1692295283,
   "score": 9,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwll7c1",
   "message": "Rule #1: Thou shalt not stick thy dick in crazy.",
   "created_utc": 1692291464,
   "score": 46,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlxu35",
   "message": "He's an angry asshole who manipulated her into marrying him after dating for 6 months (he's military). He had spent the past decade making her entirely reliant on him, refusing to let her keep in touch with any pre-marriage friends negate we all think he's an asshole.  I can't stand him.",
   "created_utc": 1692295929,
   "score": 8,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm55v9",
   "message": "I don’t approve of my friends SO because she wants kids and he does not. She is a lovely person, one of the absolute best, and they love eachother very much, she wants children and he is adamant on not having them, I wish they would break up soon because I know it’s going to be gut wrenching for them and tough for me seeing them go through so much hurt",
   "created_utc": 1692298551,
   "score": 8,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm6pjn",
   "message": "Friend 1: he controls her, dictates what she wears, doesn’t like her talking to male friends.\n\nFriend 2: he’s married to another woman.\n\nFriend 1’s ex: he assaulted someone.\n\nMy friends are idiots with men.",
   "created_utc": 1692299099,
   "score": 5,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmkr3t",
   "message": "Because she berated him in front of us (a group of friends), called him names, slammed doors, and dumped a milkshake on his head. But apparently we're the assholes for calling her abusive. He cut us off after that.",
   "created_utc": 1692304020,
   "score": 7,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlotkr",
   "message": "My reason for not approving of my friend's SO is that I don't feel they are a good match for my friend. I want my friend to be with someone who will support them, respect them, and make them happy.",
   "created_utc": 1692292755,
   "score": 15,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlt2he",
   "message": "He’s an abusive asshole",
   "created_utc": 1692294250,
   "score": 6,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlya2n",
   "message": "One of them intentionally goaded her to make bad decisions while interfering with her mental health (and mine, which had the effect of destroying my marriage and led to me being tortured) and the other completely disregarded her and ultimatumed her to go into a psychiatric hospital while not visiting her there once and then tried to blame me for it. Then he tried to scam me.",
   "created_utc": 1692296088,
   "score": 4,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlu708",
   "message": "She's a fucking head case.",
   "created_utc": 1692294647,
   "score": 5,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwln01u",
   "message": "Because she’s black and everyone over 40 in his family is “a little racist.”",
   "created_utc": 1692292105,
   "score": 9,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmbdn5",
   "message": "she beats him",
   "created_utc": 1692300717,
   "score": 3,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmgyhd",
   "message": "he is my brother. she is too naive to read the red flags.\n\ndw, he is not bad in that way. she can just do so much better!",
   "created_utc": 1692302685,
   "score": 3,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwloil9",
   "message": "I have two close friends who luckily NOW are with great men, but both of them were with awful guys for years, I'll tell you about each of them. I'll call my first friend Lydia and my second Alexia.\n\nWe'll start with Alexia as her story is more tame. Alexia was dating this guy when I met her, which was right after she graduated high school. They were high school sweethearts, so I understand why it took her so long to leave him, but he just sucked. He never did anything too awful, like cheat on her (that we know of) or hit her or anything, but he was just a horrible boyfriend, made it clear that he didn't really want a girlfriend or have time for one, but also didn't want them to break up. The whole thing was so stupid and all of her friends, myself included, did not like him.\n\nLydia's story is a bit more intense, and also more confusing because none of us understand why she liked this guy in the first place. Her ex is a guy I'll call Martin, and he went to high school with us, but they did not date in high school. Martin has never been anything special, he's always been kind of rude, one of those guys who is edgy just to offend people, and he isn't physically attractive, or smart. He played sports, but was never that good, so I really do not understand how he always had pretty girlfriends, considering that he wasn't very nice, he was not good looking, and he had no particularly good qualities, but alas, he did.\n\nSo about a year after Lydia and I and our other mutual friend Becca graduated from high school, Lydia started dating Martin. Becca and I were surprised, for all of the reasons I just mentioned, but figured maybe he was nicer these days. He wasn't. He was still a douche whenever we were around them, and he was just gross, always spitting, chewing tobacco, saying really gross things. But Lydia was obsessed with him and threw herself into the relationship, molding her entire life around him. At a party at his parents' house one time (in which his family, who was just as shitty as him, was giving all of us underage kids booze), Lydia and Martin got really drunk and were kind of \"play fighting\", which culminated in him pushing her down the stairs. They both swore it was an accident and they weren't fighting for real, but that's when Becca and I were like what the fuck... He is worse than we thought.\n\nA year later, we hadn't seen Lydia much and finally the three of us got together for dinner. I wanted to talk to her about potentially leaving him since he was so shitty in so many ways, but at the dinner, she told us she was pregnant. In Martin's defense on this specifically, we are pretty sure to this day that she was purposely not taking her birth control properly, we don't think Martin was trying to get her pregnant. Regardless though, we knew she would be with him for a while.\n\nLooong story short, when their kid was two years old she finally left him because of his constant cheating and mental and physical abuse. They spent a year in court... And then got back together. We tried to be supportive, hoping he had changed, but a year after THAT, they broke up again and a week later he was with someone else. Like I said, NOW Lydia is married to a great guy, but we did not approve of her son's father for the many years she was with him, for very, very good reasons.",
   "created_utc": 1692292646,
   "score": 6,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlq0wp",
   "message": "That’s my mom, bro.",
   "created_utc": 1692293173,
   "score": 6,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm2ohh",
   "message": "Oh boy. *Knuckle crack*\n\n9 years ago I had this roommate who I still consider to be one of my best friends.  When he asked me to move in with him I thought it was gonna be great that we were two single dudes.\n\nWell, two weeks later he starts dating this chick.  She lived a few blocks away from us in the small city we were in, and they went to grad school together but had different majors and the same group of friends.\n\nEvery night he would end up in his room talking to her on the phone.  He'd be apologizing for something.  I don't know what for to be honest.  I also don't know why they couldn't have these conversations in person. Maybe it was me. I could have been in the way as a roommate, either way, whenever he came out of his room after those calls he always seemed beat up.  None of our mutual friends ever saw that besides me.\n\nBefore they got engaged, which happened at the end of grad school, he kind of gave me the feeling that she was pressuring him into it, and he - after several years -  was just along for the ride.  That was the closest I have ever come to telling him that he should break it off.\n\nThey are married now.  They each had their own vehicles, and his was a project car.  When it came time for them to get new, safer cars, she made him sell his to get the new car, then she gave him her old one and she took the new one.\n\nThat was the final straw for me.  I hate that bitch.  She is controlling and whether or not my friend knows it, I think she's ruining his life.  I hope they never have kids.  I pray they divorce.  It will be the best day of my life.",
   "created_utc": 1692297663,
   "score": 4,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm7837",
   "message": "Her toxicity has caused him to ride this roller coaster of life experience, and it’s just infuriating to watch.  She’ll send him from an amazing high to a low which ends up causing him to fall back on horrible crutches he’s worked hard to overcome.\n\nBut right when you think he’s going to see the light and move on, she comes in with some sob story that just melts his heart and brain and he ends up back on the train again.\n\nAnd this happens, like clock work, about every 10-12 months or so.  Most recently it was all I could do to convince him that moving in with her was going to be one of the worst mistakes he could make…he agreed, saw the logic, and even went as far as telling her he was not ready for that.\n\nBAM! She supposedly had a “break in” where her neighbor (who she’s never talked to before mind you) ran the guys off, but she was left feeling terrified and vulnerable.  He moves in a week later to be the hero…and things deteriorate from there.\n\nI barely see the guy anymore, we talk over texts and such, and I know he’s doing some kind of drug to cope with stress and anxiety she causes. I reach out, but he’s impossible to get time with at all, because she keeps their schedule so busy he can’t break free.\n\nAnd when they’re both invited somewhere just to get him out, she’s “not feeling good” or “is just so exhausted”, but won’t let him go on his own without a full on guilt trip.\n\nIt’s mind numbingly frustrating. Saying I don’t approve of her is putting it beyond lightly. She’s a fucking nightmare.",
   "created_utc": 1692299275,
   "score": 2,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm8aij",
   "message": "She is very clearly using him as a babysitter or as someone to keep her kid busy when she doesn’t want to deal with him. Made him cut his hair and stop doing things he enjoyed because it was too “childish” for him.",
   "created_utc": 1692299648,
   "score": 2,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmf5t7",
   "message": "She never works. Sits around smoking weed all day surrounded by her crystals. Already has a kid when she suckered him in, but her roommate and him watch the kid more than her. Talks like the turtle from finding Nemo. Showed he wart asshole on onlyfans as her only source of income (even though she only had like 8 subscribers) because she's too lazy, or \"stressed\" to get an actual job, but her being on online fans almost caused him to get fired because he works for the school district. Never cleans or cooks. Constantly in bed or on the couch. I could keep going, but not trying to write a book",
   "created_utc": 1692302046,
   "score": 2,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmhht9",
   "message": "Not his current SO, but my best friend's GF of many years essentially abandoned him while his mom passed away at home after battling cancer for the second time. The GF basically had lived with them for the last 18 months of my friend's mom's life and wouldn't be with him in the finals days or even the first couple days after. The three of them spent countless days together over this time. This was 2020-2021 and both of them were unemployed because of the service industry being shut down or only \"kind of\" open. No phone calls, FaceTime, etc. Just texting him a couple times over the days that followed. \n\nHe stayed with me and my fiancee for a week where one of us was with him 24/7 because he was a complete wreck. Eventually I had a talk with him and asked him what he thought my fiancee would do if she was in his GF's position and ultimately he realized she wasn't a support system he could count on.",
   "created_utc": 1692302876,
   "score": 2,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmleqw",
   "message": "he beat her repeatedly! Yes I celebrated when they got divorced!",
   "created_utc": 1692304251,
   "score": 2,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmngcp",
   "message": "I found out she was his SO at his birthday party four days after hooking up with her at a bar near my apartment 20 miles away from where he lives. \n\nShe told me a fake name and when I walked in the door she and I had a heart attack and had to have a very serious conversation. \n\nI told him after they broke up a month later because she was banging his brother.",
   "created_utc": 1692304970,
   "score": 2,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmom0h",
   "message": "She was a lying bitch. He eventually found out that hard way.",
   "created_utc": 1692305382,
   "score": 2,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmsb86",
   "message": "In short, cuz he is a dick bag.  Long version, man baby, anger issues and finds no joy in life.",
   "created_utc": 1692306700,
   "score": 2,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmtb6u",
   "message": "Hardcore prolife Christian. We don’t talk anymore",
   "created_utc": 1692307065,
   "score": 2,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlo62l",
   "message": "because, at the time they began dating he was 34 years old and we were 19 and 20 respectively; he tried to sexually assault me but luckily I got away. she told me she felt jealous that he tried to sexually assault me, that she wished it was her instead. then, 2 days later, they began dating. he's a mean drunk and all he does is drink and smoke and do a bunch of drugs.",
   "created_utc": 1692292523,
   "score": 4,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlwpbz",
   "message": "He’s a huge manchild who talks over everyone else and thinks he’s smarter than everyone in the room.",
   "created_utc": 1692295526,
   "score": 3,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm1o5l",
   "message": "My first impression of him was at a concert 20 years ago where he and his friend met up with the two of us. He shit on the opening act (one my friend and I actually really liked) and did not try to talk to me or be friendly. He just sounded pretentious about his mediocre taste in music and movies. I had a casual distaste for him, but he was generally okay to her, so I kept my mouth shut. A couple years into them dating, she cheated on him with said friend and they dated briefly. After friend broke her heart, she got back together with original guy. He proposed less than a year later while we were still in college (my guess was he wanted to “lock it down” ASAP). I told her not to do it, because, based on many things she told me and I had overused, he clearly wasn’t someone who lit her fire. Over a decade of marriage and two kids later, she cheated on him some more, because he, surprise, surprise, is a bump on the log of life and she wants more. The are now divorced. \n\nIt’s truly annoying listening to someone complain about their partner for so many years when you told them they weren’t a good fit from the very beginning.",
   "created_utc": 1692297303,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm5h8z",
   "message": "I don’t like fake - hang tight because it can go deep and I’m only going to explain a little. She clearly has issues with herself, you should be good with yourself before roping someone else in. She can’t find peace with herself or her own friend group, she HAS to tag along because she’s, quite frankly, a fucking loser. She has no goals or ambitions. She’s boring as hell, she cannot even cook and I even offered to take time to teach. She is bad at chores, so much to the point my friend has her over and never goes there and.. the kicker, hired a cleaner one time to get her back on track, which supposedly helped, but he still prefers to not go there. \n\nShe is smart in her own way, but she lacks everything to make it applicable to something other than a very niche interest - she’s a gamer, we all are in fact, but she’s lazy as fuck. She could try and make content - one hell of a speaking voice for voice overs and a nice look. Back to the lack of motivation, ambition etc. she’s just a lazy fuck. We are an active friend group, also physically. She’s not obese, but she clearly lacks self care, but can clean up easily. \n\nSo yeah, money-less, ambition-less, unmotivated, poor excuse of a human. Apparently she has tried to be every major in university because she has been going to school since high school graduation and somehow doesn’t have one single degree and claims to take multiple courses… or had. \n\nThe kicker and main point. She’s fake. Around me and my friend (just the three of us) she’s so different than anyone else. She’s so fake, it’s disturbing. One friend group member pulled me aside and said she was about to rip her because if she has to fake being nice and present, she should go be alone in her own misery. It’s almost condescending how her fakeness is. It’s why it’s pissing people off. \n\nAnyhow, people like her are parasites and hopefully cannot reproduce. I don’t wish ill will on her, but people are wanting to collectively say something to him. I’m trying to stay out of it and wait until he asks me, I try to be really reasonable and people usually come to me if they need logic no emotion because I intentionally take it out in certain situations.",
   "created_utc": 1692298665,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm0eg4",
   "message": "She was the town pump.",
   "created_utc": 1692296846,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmd58k",
   "message": "Because she settled with an insecure man child who can't handle his alcohol and acts like a brat. She's also indicated he's a selfish lover.  He knows I see right through him and hates me. I am polite but try to minimise our interactions.",
   "created_utc": 1692301341,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlxz0s",
   "message": "well... its their choice. i voice my concern ONCE and them i support their relationships.",
   "created_utc": 1692295979,
   "score": 0,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm02tg",
   "message": "He isn’t me. It should be me.",
   "created_utc": 1692296732,
   "score": 0,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmd7t4",
   "message": "I'm jealous (M13). Not so jealous that I'll try to ruin their relationship or that I wish something came between them, but more something like \"Wtf did he do that I couldn't? And what does she mean with 'you're cringe', I'm absolutely not... Okay, maybe that's true, but still.\" Still wish them the best.",
   "created_utc": 1692301365,
   "score": 254,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwlye0a",
   "message": "I'm an introvert and enjoy just being at home.",
   "created_utc": 1692296127,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm1p1y",
   "message": "She basically slathered him in concentrated boringness. He immediately got a corporate job because she thought less of him for not having one, started going to bed at like 7PM and waking up at 6 because she likes mornings, and they now have an enormous dog (even though he’s a cat person) so they can’t go and do anything ever.",
   "created_utc": 1692297312,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm2z8c",
   "message": "I cannot approve anyone's demand to take his relationships with Eva AI virtual gf seriously.",
   "created_utc": 1692297770,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm3lva",
   "message": "My best friends wife is neurotic and acts ridiculous for no reason. I don't like doing things with him if she comes.",
   "created_utc": 1692297996,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwm9wuf",
   "message": "Well I'm more just jealous. He used to be over all the time. Now that he got pussy finally, he barely talks to me or any friends.",
   "created_utc": 1692300207,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmekpc",
   "message": "Beliefs because they tried to eat me.",
   "created_utc": 1692301840,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmexz4",
   "message": "She kinda sucks, like she has never really been a fan of our friend group but we figured it was because she is younger than us and never really came down to hangout while they were dating. Well they were going on a cruise a few years back and we got invited in a way that the rest of the group thinks was just a way to say we were invited but they figured we wouldn't actually go. Well we all said yes and she spent the whole cruise as far from us as possible and we only got to hang out with my friend for a few hours each day...",
   "created_utc": 1692301968,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmkywg",
   "message": "He beat her so bad she lost her hearing temporarily, and I had to be the one to take her to the ER so he could stay home and “watch the kids”. They are still together and so in love though… and his ex is crazy that’s why CPS took his son away for abuse allegations….",
   "created_utc": 1692304097,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmqpt7",
   "message": "They fight like cats and dogs, involved everybody including the police often, files then drop charges on each other and he lies about all her friends hitting on him to get her to dump her friends.",
   "created_utc": 1692306125,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmqywl",
   "message": "She happily exclaims that her bf before my homie used to beat her. Like ma'am that's not a badge of honor, glad you got out of that situation tho.\n\nShe started dating my homie 2 weeks after getting out of the abusive relationship.\n\nShe hooked up with my OTHER homie (he did not live with us) a few days (maybe a week) before she started dating my homie.\n\nShe threw a screaming, crying, hitting fit on our washing machine when OTHER homie told her he was just trying to get his rocks off. This was a party at me and homie's house we threw for the #frat. It was between the party she hooked up with OTHER homie and the party where she and my homie hooked up and started dating)\n\nShe lied to me about going to a summer camp I went to then acted like she'd never heard of the camp when I brought it up again months later.\n\nShe moved herself into the house me and homie (and 5 other dudes) lived in the day after they started dating. (This is the house she threw the fit in)",
   "created_utc": 1692306218,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmrhn6",
   "message": "Which organisation do you work for?",
   "created_utc": 1692306405,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmt8pb",
   "message": "I no longer approve because she became toxic towards him. Eventually she pulled a knife on him and became terribly abusive \u0026amp; hostile.",
   "created_utc": 1692307040,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmuojr",
   "message": "Lost a very good friend because her husband was so controlling. He had to approve every time we spent time together. She'd cancel last minute because he demanded her time. Got old for me.",
   "created_utc": 1692307567,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwmzfnh",
   "message": "She's an abusive asshole.",
   "created_utc": 1692309343,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwn22xy",
   "message": "He treats her like shit.",
   "created_utc": 1692310363,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwn2jyr",
   "message": "This comment section is infested with bots. I've counted 5 individual bots stealing comments.",
   "created_utc": 1692310548,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwn317h",
   "message": "They are like Joe Biden",
   "created_utc": 1692310736,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwn397d",
   "message": "I didn't approve of my friend's S.O. because she was s control freak who slowly but surely pulled him away from his \"old\" friends and even some of his family. Then after they got married, they moved out of state so they'd be closer to HER friends \u0026amp; family.",
   "created_utc": 1692310821,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwn3h6y",
   "message": "He charged her rent for living with him in his mom's basement that he wasn't paying rent to live in.",
   "created_utc": 1692310909,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwn7k1i",
   "message": "Haven’t actually met her because I moved out of state but they flew to where I live so we can vacation together and she would NOT leave him alone we went camping in the mountains of Tennessee where there is no service and she kept yelling at him the rare time we did have service to FaceTime her to make sure he wasn’t out with girls",
   "created_utc": 1692312541,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwn87qm",
   "message": "Bc she would date this dumb motherfucker",
   "created_utc": 1692312811,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwnb74l",
   "message": "He's controling, doesn't accept things that go against his wishes, kicked her out of their apartment, tried to convince her she was crazy, convinced her parents she was crazy and turned them against her, tried to isolate her (and did it successfully since she only had me) from everyone else in her life until she realizes she was wrong to have her own opinion, packed her stuff, drove her to the border and left her there alone in the dark, grabbed her neck, forbid her from seeing her parents after they started supporting her in this conflict, wanted to fight with her dad, she tried to kill herself 2 times because of all this... I could go on and on.\n\nThey got married after all of that, she didn't even tell me there would be a wedding, now we wish each other happy birthday and stuff",
   "created_utc": 1692314060,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwndszx",
   "message": "She’s easy. I don’t have the heart to tell him that I was balls deep in her asshole the night before he introduced her to me. I’ve seen dudes going in and out of their house while he was at sea.",
   "created_utc": 1692315194,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwndwmd",
   "message": "They’re not even together. He uses her. He wants her to be with him just to have her. She’s not allowed to leave his place when he’s out all night. She’ll ask to hang out and I’ll be like, “sure come over have sum drinks or let’s go to a bar” and she’ll be like, “no, he says you have to come here”? Like??? and He’ll talk about me like I’m not there right in front of me. She never says anything. I don’t say anything back to him because it’s really not worth it. It’s laughable. He’s a bum who does drugs and “cheats” on her all night.",
   "created_utc": 1692315239,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwnfeju",
   "message": "he's a selfish, rude and deeply inconsiderate guy who, when we first got introduced to each other at a party told me about a \"weird thing he found on his balls a while ago\" and then ordered my friend, who is his girlfriend, to bring him another beer",
   "created_utc": 1692315891,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwng3vj",
   "message": "She lost custody of her three kids and didn’t fight it. She doesn’t have a drug/alcohol problem. She just didn’t care about them and her ex husband did.\n\nThose of us with children find it hard to get over that when interacting. Conversations awkward AF.",
   "created_utc": 1692316197,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwngh90",
   "message": "One left her on the side of a freeway after an argument. One cheats on her religiously. One dated a married man who, “was going to leave his wife.” \n\nNo wonder I’m still single 🫠",
   "created_utc": 1692316354,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwnh3go",
   "message": "She got a job making six figures and was going to kick my best friend out of their house because he didn't make enough money to be the head of the household. I'd never tell him, but I think their relationship is a codependency one. Hurts me to think about the pain she might cause my friend in the future. There's a whole lot more going on with her, but I don't want to say anything identifiable. Safe to say, she comes across as a very selfish person.  \n\n\nAnother thing that comes to mind is her trying to talk to my best friend while we are in the middle of a conversation. Just zero respect for other people's time and no regard for people's lives outside her own.",
   "created_utc": 1692316619,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwnh3sx",
   "message": "He's a narcissist, controls her, demeans her, and threatened her once.",
   "created_utc": 1692316623,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwniqm5",
   "message": "Just gotta read the room. Saw my buddy trying to wife a chick with 2 kids, 2 different baby daddies \u0026amp; he was on the path to be the 3rd. For some reason, he wanted to play captain \u0026amp; save her. Got a house in her city, paid all the bills, got her 2 different cars, took her kids to and from school, let her keep 100% of her money while she was going to school. Well… as soon as she graduated from college, her degree must’ve told her she can do way better without him. Gave him a note with this on the list \n\n1. You must spend more time with me\n\n2. You must make more money than me\n\n3. Must help out more with my kids\n\n4. No smoking or drinking\n\n5. Stop asking me for sex \n\nMy boy finally woke up \u0026amp; told her he rather be gay than to deal with these demands. Now she’s living in a 2BR apartment paying $1900 a month, crying on IG how she’s a single mother \u0026amp; no one has her back.",
   "created_utc": 1692317333,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwnixhd",
   "message": "She wasn't fun to be around at all and she just leeched off my friend.",
   "created_utc": 1692317417,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwnjx3h",
   "message": "I was a possessive and jealous person. I felt like I was being ignored. I made it his problem and I was in the wrong.\n\nUltimately I was right about her, she was abusive, I don’t take any pride in how it turned out though",
   "created_utc": 1692317842,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwnkdcc",
   "message": "My friends like rich rich the one he’s dating clearly just wants expensive things and her parents are sick of paying for it",
   "created_utc": 1692318036,
   "score": 1,
   "submission_id": "15tsvwq"
  },
  {
   "comment_id": "jwnlkb5",
   "message": "Alexis has a very long terrible track record in her taste in women, so by default, every new girlfriend she gets I just assume cannot be trusted until proven otherwise",
   "created_utc": 1692318549,
   "score": 1,
   "submission_id": "15tsvwq"
  }
 ]
}