{
 "submission_id": "15tx2t7",
 "title": "What is the dumbest thing you did in a class?",
 "selftext": "",
 "created_utc": 1692300432,
 "permalink": "/r/AskReddit/comments/15tx2t7/what_is_the_dumbest_thing_you_did_in_a_class/",
 "score": 35,
 "url": "https://www.reddit.com/r/AskReddit/comments/15tx2t7/what_is_the_dumbest_thing_you_did_in_a_class/",
 "comments": [
  {
   "comment_id": "jwmanid",
   "message": "shoved a knife into an outlet",
   "created_utc": 1692300464,
   "score": 23,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmbegg",
   "message": "confess to my crush",
   "created_utc": 1692300725,
   "score": 15,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmb2or",
   "message": "Burned my initials into the floor by lighting Lynx  deodorant on fire 👀",
   "created_utc": 1692300611,
   "score": 10,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmg7nh",
   "message": "lighting up a firework in class. got me suspended",
   "created_utc": 1692302417,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmev3m",
   "message": "We used to waste time in English with a game where we’d flick pencils up into the ceiling panels to make it “snow”.\n\nYou’ve probably already worked out that the “snow” was asbestos... We were making it rain asbestos. (Not that we knew that at 14ish.)",
   "created_utc": 1692301940,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmgoui",
   "message": "Not me but \n\n8th grade social studies\n\nheard some kids snickering behind me, quietly speaking their language \n\nthen I felt something slightly touch my hair \n\nI turned around quickly and to my surprise one of the classmates was doing a helicopter right behind me \n\nI was shocked to say the least and kinda afraid \n\nI immediately punched his dick and he went down so fast lmao\n\nthose kids started yelling at me \u0026amp; getting mad \n\nthe teacher got involved, I told him what happened \n\nthe poor boy was still on the ground wincing in pain \n\nI felt disgusted and violated or something\n\ngot sent to the office but ye\n\nthat incident kinda scarred me for life lol",
   "created_utc": 1692302589,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwme3cr",
   "message": "I spun around while holding a paint pallette with paints on it, spraying paint on every kid in the class. It was awesome, but my teacher was not a fan at all.",
   "created_utc": 1692301673,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmga4p",
   "message": "Said Mom to my teacher",
   "created_utc": 1692302442,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmib3i",
   "message": "My teacher was talking about an upcoming AP exam in high school and how we’d need a photo ID like a driver’s license when we arrived at the testing place. I raised my hand and asked what we do if we don’t have a driver’s license. She kept rattling off all these IDs I didn’t have. Finally after about a solid minute of back and forth, she went “wait, you have a military ID. Wait, you’re not even taking the test!”",
   "created_utc": 1692303161,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmbw1d",
   "message": "Draw a giant dick across three desks with two of my buddies. Individually, you couldn't tell what the drawing was, but putting the desk side by side, you could tell it was a giant schlong. \n\nLuckily, the teacher thought it was funny and said she was impressed with the teamwork and we didn't get in trouble, but could have been bad.",
   "created_utc": 1692300897,
   "score": 17,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmg1r6",
   "message": "Called the teacher « mom »",
   "created_utc": 1692302359,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmek4u",
   "message": "In front of a whole class I asked out my English teacher, with my broken English",
   "created_utc": 1692301835,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmfaiy",
   "message": "We were dissecting frogs in science, and I decided to cut the frogs tongue out and walk up to my teacher with it in my bare hand and say \"froggy tongues feel funny.\"\nHe glanced down at my hand, turned white and puked all over his desk amd everyone's freshly turned in anatomy tests. Instead of making us retake the test he gave everyone a C and I got Saturday school for a month.",
   "created_utc": 1692302092,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmg7h5",
   "message": "I legitimately thought mustard gas was made from mustard seeds, and when a teacher asked what it was I went on to explain, and he was like that is not correct at all, I was a sophomore in college.",
   "created_utc": 1692302415,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmb3o9",
   "message": "Skipped",
   "created_utc": 1692300620,
   "score": 2,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmbkp0",
   "message": "not pay attention",
   "created_utc": 1692300785,
   "score": 2,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmc0xo",
   "message": "Day dreaming",
   "created_utc": 1692300946,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwme5zf",
   "message": "I got a referral/suspension because I was bored and kept making fart noises in class.\n\nThat was kinda stupid.",
   "created_utc": 1692301698,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwme7qz",
   "message": "Failed a test",
   "created_utc": 1692301716,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmkuo8",
   "message": "One time I raised my hand and once the teacher called on me I burped. She glared at me, how could I be so rude, but then I immediately said \"can I use the restroom?\" way faster than usual and it clicked with her that it was an accident and I was embarrassed so she let me go to the restroom.\n\nThankfully the other kids also thought I was being rude, so they hailed me as cool rather than making fun of me. The teacher was also kind enough to let me get credit for the unabashed burping at the teacher because she knew kids making fun of me would be worse for me.",
   "created_utc": 1692304055,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmdukk",
   "message": "Snarted in 4th grade and didn’t really recover socially for 7 years.",
   "created_utc": 1692301588,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmdwl3",
   "message": "I asked the teacher \"what's your favourite genocide?\"",
   "created_utc": 1692301608,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmejx0",
   "message": "Not paying attention..",
   "created_utc": 1692301833,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmeqkx",
   "message": "In Spanish class, we were asked to describe ourselves with adjectives. I accidentally called myself ugly, and because we weren't allowed to speak English in the class, I was unaware that I did. My Spanish teacher talked to me for like 5 minutes assuring me, in hindsight, that I wasn't actually ugly. It was only towards the end of the class that I looked in the textbook and realized what I had said. I started studying for Spanish more after that.",
   "created_utc": 1692301896,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmdm2v",
   "message": "Fell asleep, and the teacher messed with me.",
   "created_utc": 1692301505,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmdolz",
   "message": "Played uno",
   "created_utc": 1692301530,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmd94m",
   "message": "Potty in pants…it was when I just started going to school..was somehow unable to open the belt😂😂😂",
   "created_utc": 1692301377,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmef6r",
   "message": "Beat up my 80 year old disabled teacher for giving me the wrong color pencil",
   "created_utc": 1692301788,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmd9w2",
   "message": "[deleted]",
   "created_utc": 1692301385,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmasbg",
   "message": "I didn't do anything, \r  \n\r  \nI was about to take a leave that day to skip Geography class, I decided not to skip it , in between our class I saw a Student beating his meat while looking at the teacher, she came there to distribute the grades for the last test, \r  \n\r  \nTurns out , he didn't notice her and jizzed all over her,  And not just a little bit.. ALL OVER HER\r  \n\r  \nHe said he hadn't busted one in weeks\r  \n\r  \n(He got suspended and lost his grades that semester)\r  \n\r  \nBut he let his intrusive thoughts win\r  \n\r  \nThat was 20 years ago, He's Now a Engineer working a job at a multinational",
   "created_utc": 1692300511,
   "score": 245,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmepxg",
   "message": "Not raising my hand as often as I should have",
   "created_utc": 1692301890,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmfb7a",
   "message": "Shit In a kids backpack in class when I was a senior.\n\nHe pissed me off.",
   "created_utc": 1692302098,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmfbn6",
   "message": "Agreed in advance to play a barbarian who only used two handed weapons before rolling a 4 for strength.",
   "created_utc": 1692302103,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmfl8r",
   "message": "Passed around a water bottle full of vodka",
   "created_utc": 1692302196,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmfnts",
   "message": "Early on in grade school, I used to --very stupidly-- hold my pencil horizontally between my legs when I was sitting at my desk.  I was excited that I knew the answer to the question the teacher was asking, and whole body jolted as I raised my hand at lightning speed to answer the question.  Well, in doing so, my thighs squeezed together and I stabbed myself with the pencil.  Some 30+ years later, there's still a black mark on the thigh from where the pencil penetrated my skin.",
   "created_utc": 1692302222,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmfr3l",
   "message": "Tellin a teacher the lesson was over cuz of time and not cuz she wants it",
   "created_utc": 1692302254,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmftxd",
   "message": "Not me but classmates threw teachers book out of window, when she was outside the class. \n\nAlso another of my colleagues set the toilet on fire during the school break lol",
   "created_utc": 1692302282,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmfyvf",
   "message": "4th grade \n\n- asked my classmate what happens after dead, apparently an absolute no go for the teacher. Those fuckers send me to a therapist just cause I didn’t buy the heaven stuff.\n\n5th grade \n\n- drew at the wall.\n\n-read a comic during english class \n\n7th grade \n\n- mispronounced ‘ADAC’.. my class didn’t let me live that down till graduation. \n\n8th grade \n\n- broke my finger during pe and instead of going to the hospital I sat through biology class, even writing with that hand. \n\nAlso worth to mention:\n\nTeacher: studen a is sick, does anyone else feel sick too? \n\nMe: A bit (I was joking) \n\nteacher: you do look pale, let your parent pick you up\n\nmy parents: not home, grandma will take care of you \n\nGrandma: can’t pick you up due to distance\n\nmy teacher: I’ll drive you \n\nAll this because I jokingly said I wasn’t feeling well\n\nKarma: I ended indeed being sick for a week with fever on the same day…",
   "created_utc": 1692302331,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmg719",
   "message": "I mooned another classmate while the teacher’s back was turned.",
   "created_utc": 1692302411,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmg8t9",
   "message": "Someone in class had a balloon that you would use to create a balloon animal and I put it down the front of my pants, then took my text book up to the teachers desk and asked her a question, making sure \"it\" was in view.",
   "created_utc": 1692302428,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmgabx",
   "message": "Put my foot in my mouth and dance. I called it the \"Monkey dance\"\n\nDid it all the way till I was a Junior in High-school",
   "created_utc": 1692302444,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmgg94",
   "message": "smoked a dab cart inside the classroom while teacher was giving presentation",
   "created_utc": 1692302503,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmgsfs",
   "message": "not me but my friend told his crush in class while holding a cucumber \"my first boner was over you\".\n\nme and my friends found out later on when we hopped in a discord call with her and she told us about it and he would never admit he said it up until this recently (4 years later)",
   "created_utc": 1692302625,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmgtft",
   "message": "I've smoked a bowl I'm auto's class. Our teacher would spend the whole period in the shop on days we had actual book work, so we had the classroom to ourselves. I also stabbed a kid in the knee with my pen. He kept kicking my desk on purpose so I fucked up my writing. I told him I was going to stab him if he kept going. He called my bluff and did it again. I said \"maybe you didn't hear me\". He kicked it again so I swung down hard right behind his kneed cap and sunk the tip in.",
   "created_utc": 1692302635,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmguaj",
   "message": "Discussed vocally about two trending artists in my country only for me to get sent out of the lecture room before the lecture ended with a strict warning not to enter his class till the semester ended.",
   "created_utc": 1692302644,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmgzqq",
   "message": "Filled a balloon with methan and oxygen in chemistry class and then lit it. Was not prepared for the boom. Was not prepared for the small fire that it created. Was incredibly lucky i didnt get expelled.",
   "created_utc": 1692302698,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmh2jl",
   "message": "stapled the teachers newspaper together when she was out of the room",
   "created_utc": 1692302725,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmh3cl",
   "message": "My biology teacher in 11th grade had me opening vacuum packed frogs for dissecting and putting them in a bucket of water to rehydrate them in the back of the class.  Why, I don’t remember. But I began calling a diving competitions commentary during class as I tossed them in.",
   "created_utc": 1692302733,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmhfvr",
   "message": "I don't think the statute of limitations has run out, so I'm going to bow out of this thread.",
   "created_utc": 1692302856,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmhgn5",
   "message": "Had a really big sneeze, tapped my mate too the right of me, opened my mouth wide and the poor kid in front of me (he had long hair) copped a full head of phlegm, and he touched it, it still makes me cry laughing till this day",
   "created_utc": 1692302864,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmhkqr",
   "message": "This was in study hall.  The guy next to me fell fast asleep with his head down on his backpack, which was on his desk.  He was wearing a hoodie.  I was a dumbass, so I took the drawstrings of his hoodie and tied them to the leg of his desk.  The bell rang, he attempted to stand up, and all hell broke loose.",
   "created_utc": 1692302904,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmhxz3",
   "message": "Snorted a line",
   "created_utc": 1692303034,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmi31s",
   "message": "Had an old flip-phone when I was in HS. Was sitting in the back of grade 10 math and my phone started vibrating… 911 calling me.\n\nI had been joking around earlier in the class, saying that I’d call 911 because of something obscene a friend said. I had held the 9 key to show them I was starting the call. But I guess the phone had a setting that would actually call EMS if you held 9 long enough.\n\nI dip to the bathroom to speak to the operator and explain things. They tell me they’re sending a cop anyway and to wait in my school’s office. I sit there like a jackass for the rest of the period and nobody showed up.\n\nThe teacher was fuming when I came back, thinking I was cutting class, and my friends at the back of the room had to try their best not to piss themselves laughing.\n\nEdit: also smoked weed out of an apple behind a rock during capture the flag in grade 12 gym. Maybe 15 feet from my teacher. Fun but stupid.",
   "created_utc": 1692303084,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmi3o3",
   "message": "Humped a desk until I \"came\" in 2nd grade (everybody saw and nobody stopped me)",
   "created_utc": 1692303090,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmic4z",
   "message": "A dude in my guitar class stood up and asked if anyone had a charger he can borrow. Me being incredibly bored out of my mind took that opportunity to make the class laugh. I stood up, announced that I have a charger, and proceeded to jokingly undo my pants. Everyone laughed, but the death glare of the guitar teacher had me no longer laughing and I was kicked out of class until the end of the period.",
   "created_utc": 1692303171,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmig1n",
   "message": "Spanked it under the desk",
   "created_utc": 1692303210,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmig8w",
   "message": "Go to class with a Dr. Pepper bottle half-filled with Maker’s Mark.",
   "created_utc": 1692303211,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmil94",
   "message": "Tried to receive a handjob in class",
   "created_utc": 1692303260,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmimgg",
   "message": "Not too dumb, I suppose, but when I was in high school (mid-late 90s), some of the students had HP 48G graphing calculators, which had an infra-red port for transferring data between two of the calculators. Sometimes the teachers would show us a video on a TV, and some students found that there was a program for the HP calculators that could use its infra-red port to control various TVs. Sometimes we (I included) would use it to prank the teacher by turning the TV off/on or adjusting the volume, etc..",
   "created_utc": 1692303272,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmimpa",
   "message": "Take it seriously",
   "created_utc": 1692303274,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwminhu",
   "message": "Trust that fart…..",
   "created_utc": 1692303282,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmioan",
   "message": "Called the teacher Mom",
   "created_utc": 1692303289,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmipns",
   "message": "We had a substitute and he asked the class \"Now where are the notes\" (notes left by the teacher) and I said too loudly \"Up your ass!\" He and the rest of the class heard it and he immediately called me out. I tried to blame my classmate and deflect and say I said something else, but he wasn't having it and sent me to the principal.",
   "created_utc": 1692303302,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmiq6g",
   "message": "Throw my pencil case at the Theacher, it was an accident.",
   "created_utc": 1692303308,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmiz58",
   "message": "Me and my friend brought bb guns to class in first grade. They were the ones that look exactly like real guns. Luckily I went to school in Ukraine for first grade so the teacher took them away and gave them back to us after class. Then I moved to America, and I am glad I never did anything like that in an American school. I probably would have had the cops called on me and got expelled.",
   "created_utc": 1692303395,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmj10d",
   "message": "I was 12. just learned about the feelings my manhood could produce. math class. got a random boner, rubbed the top of my jeans with my thumb until it happened. embarassing to even mention this here, but I was 12 and didn't even need to fantasize anything for it to happen.",
   "created_utc": 1692303414,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmj372",
   "message": "I was acting like I was disassembling a gun, as ya do, with a jell pen, and decided \"it's time for a durability test\" with the ink tube. It burst in my face, and in my effort to go unnoticed while wiping it off, I smeared it all over my face.",
   "created_utc": 1692303435,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmj4yo",
   "message": "Mid 80s High School Junior me in English class was asked for an example of onomatopoeia, words that sound like the sounds they represent.  Think Adam Wests Batman fights.  So I said the first one that came to my mind.  WOP.\n\nMy English teacher was 1st Generation Italian-American.  WOP was a very derogatory term for a lot of Italian immigrants aftr WWII.  Tosay she was not pleased would be an understatement.\n\nSo I had to explain why that was not a wise choice to the rest of my clueless class.  Dad was a WWI vet with a lot of stories....",
   "created_utc": 1692303452,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmj9np",
   "message": "Either flushing a banana down the toilet or eating all of my classmates yogurt during lunch. I was a preadolescent weirdo.",
   "created_utc": 1692303498,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmjht4",
   "message": "Not me, but a friend just started jerking off in class. Like seriously but he managed to not get caught by the teacher and he even managed to nut. That was nasty",
   "created_utc": 1692303575,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmjj7t",
   "message": "Made fun of the principal on here first day when I was in 4th grade.",
   "created_utc": 1692303589,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmjnca",
   "message": "Teacher: (Addressing the class) You need to stop leaving the school grounds at lunchtime to go to the supermarket\n\nTeacher: We know everytime you go and who's going.\n\nMe: Well you didn't notice when I went",
   "created_utc": 1692303628,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmjpxh",
   "message": "I used to love Calvin and Hobbes, I still do but I used to too, and one comic had him flipping a coin the decide an answer on a test. So my dumb ass does it and it makes a hell of a clunk when it hits the desk in a silent room and rolls  halfway across the class. The girl in front of me just turns around and asks what the hell I'm doing. Felt pretty stupid",
   "created_utc": 1692303653,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmjs9u",
   "message": "Pronounced Niger River incorrectly",
   "created_utc": 1692303676,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmk0op",
   "message": "Once I farted loudly and to distracted people from this by pretending my neck is painful.\n\nTeach said necks dont fart",
   "created_utc": 1692303759,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmk1n0",
   "message": "The write up slip says “student rubbed hands together and loudly said that’s what good pussy sounds like”. Mom and dad weren’t to happy about the suspension",
   "created_utc": 1692303768,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmk1wc",
   "message": "We used to spray axe on the desk top and light it on fire. Axe burned quick and there was no damage or injuries ever, but 3 ft tall flames are probably not the best thing to do.",
   "created_utc": 1692303771,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmk6pm",
   "message": "Bought 2 pounds of small packet gummi bears to distribute in class, while pretending to have a sogar throat and cannot talk.\n\nAfter distributing all of them, i scream: SIKE!\n\nMost awkward 30mins",
   "created_utc": 1692303818,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmkgn6",
   "message": "Put an ALKA-SELTZER in my mouth and faked a seizure falling out of my desk to the floor.",
   "created_utc": 1692303918,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmkhbe",
   "message": "Fell asleep, snored so loud that I woke myself up.",
   "created_utc": 1692303924,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmkmya",
   "message": "Not show up for it",
   "created_utc": 1692303979,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmkmzz",
   "message": "Paying attention",
   "created_utc": 1692303980,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmkpky",
   "message": "Let a fart out……. that wasn’t a fart….",
   "created_utc": 1692304006,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmkrms",
   "message": "In science class I picked up a Bunsen burner with my bare fingers and burned them. My science teacher sent me to the front office to get band aids and the receptionist seemed annoyed that I burnt myself.",
   "created_utc": 1692304025,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmkrrp",
   "message": "i had sex in a class but it was an empty class",
   "created_utc": 1692304027,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmksjk",
   "message": "Told the gym teacher if he wanted the track ran he should get his fat ass out there and do it himself.",
   "created_utc": 1692304034,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmktsi",
   "message": "Brand new laptop I “balanced” on a desk in a lecture hall",
   "created_utc": 1692304046,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmkyn1",
   "message": "Started a rumor I saw a ghost in the toilet. Headmaster sent me to the janitor (who had apparently experienced the same thing). It being quite a small school, this rumor spread pretty darn fast. Next thing I know 40% of the children are in absolute fits of tears, with the other 60% refusing to use the toilet.",
   "created_utc": 1692304094,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwml2ry",
   "message": "Set off a fire cracker in my desk.",
   "created_utc": 1692304135,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwml3hz",
   "message": "I’ve sucked on the back of a pen twice, ink shot into my mouth 😀",
   "created_utc": 1692304142,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwml3k5",
   "message": "Don’t know about class, but the dumbest thing I did in school was pour my drink on a hot plate of food in an attempt to cool it off. It was way too hot even after waiting 15 minutes and I panicked thinking I’d never get to eat my lunch before the period ended.\n\nLiterally thought it was a solid idea at the time- granted I was only 7 years old lol",
   "created_utc": 1692304142,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwml4nz",
   "message": "I chopped an apple right in half by placing my finger right on top of it, and then proceeded (in one swift motion) to smash the fuck out of it with my head.",
   "created_utc": 1692304153,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwml4si",
   "message": "Putting a dildo at the top of the school's Christmas tree.",
   "created_utc": 1692304155,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwml753",
   "message": "Senior year, my English teacher was yelling at everyone and being a real asshole. She decided to tell everyone to be quiet and then she would give people detention anytime they talked. I had a roll of pennies in my backpack (collected from my car and locker over the last few weeks at school and was planning on trading it in for quarters) and started taking a few pennies out and flicking them across the room to piss her off. \n\nI flicked a few, she got mad and yelled at everyone. She then gave the entire class detention. I got mad, then I flicked another (closer to her desk) and she got mad, then bent over to grab it....I then threw the entire fucking roll at the blackboard behind her, raining pennies all over the place. The class starts laughing, she started screaming and after a bunch of yelling I admitted to doing it as long as the rest of the class didnt have detention. \n\nI ended up with detention for like....a month. I laugh about it but a part of me was happy that she didnt sit up faster and catch the entire roll of pennies to the face.",
   "created_utc": 1692304178,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmlmx4",
   "message": "Maybe not the dumbest, but something I still think about 25+ years later. \n\nIn 7th grade, we were starting to learn about European history, and I was answering a question in front of the whole class about the upper class and Bourgeois or whatever, and I said \"Aristocats\" instead of aristocrats and everyone started laughing.",
   "created_utc": 1692304331,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmlqrq",
   "message": "My friends and I thought it'd be fun to drop ecstasy at school.\n\nWent to class alone high af trying to chat up everyone sitting next to me.  Teacher had to tell me to be quiet several times. I'm sure he knew I was high as a kite but thank God he was cool and didn't send me to the principals office or something.\n\n\nI'm very thankful to that Teacher for letting that dumb mistake slide",
   "created_utc": 1692304370,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmlrsi",
   "message": "When I was like 9 I sucked on a gel pen and got ink all over my face. \n\nDid x before a math quiz and spent the entire time petting my arm hair and got a 22%. \n\nForgot to turn my ringer off on my phone, but had my headphones in playing music too loud to hear my phone.",
   "created_utc": 1692304380,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmls5f",
   "message": "Someone quoted a poem by Robert frost and I yelled “that’s Jack Frost” and everyone laughed.",
   "created_utc": 1692304384,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmlucg",
   "message": "drew a huge penis on my desk in 7th grade",
   "created_utc": 1692304406,
   "score": 1,
   "submission_id": "15tx2t7"
  },
  {
   "comment_id": "jwmm1k8",
   "message": "Getting a handjob in class almost everyday for the last 2 months of school. That round table in the corner is definitely stained with my dried cum forever.",
   "created_utc": 1692304476,
   "score": 1,
   "submission_id": "15tx2t7"
  }
 ]
}