{
 "submission_id": "15u0nhh",
 "title": "What dark facts about world war 2 people should know about?",
 "selftext": "",
 "created_utc": 1692308337,
 "permalink": "/r/AskReddit/comments/15u0nhh/what_dark_facts_about_world_war_2_people_should/",
 "score": 175,
 "url": "https://www.reddit.com/r/AskReddit/comments/15u0nhh/what_dark_facts_about_world_war_2_people_should/",
 "comments": [
  {
   "comment_id": "jwn4drq",
   "message": "Japan performed horrific scientific experimentation on humans that killed roughly 250k in Manchuria",
   "created_utc": 1692311266,
   "score": 194,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn2phv",
   "message": "There were mass rapes (followed by mass suicides) when the Russian army entered Germany.\n\n**At least 2 million German women are believed to have been raped.**\n\nIt was said “every woman from 8 to 80 years was raped by the Russian army.”",
   "created_utc": 1692310608,
   "score": 232,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn4rwe",
   "message": "First, one of the first international bodies to form a treaty/compact with Nazi Germany, agreeing not to interfere, was the Catholic Church. \n\nSecond, the company Siemens (as well as others) contracted with concentration camp commanders, fired their labor force and used camp prisoners as free labor instead. They profited big time because of it and, at least with Siemens, have never apologized or done anything to undo such a crime. \n\nLast one. Coca Cola formed a contract with Germany to be the sole supplier of sodas and even put swastikas on their coke bottles. This made people in America and Europe super pissed. Did they stop? Well, sort of. They told everyone they stopped and pulled all the coke out of the country. But secretly they simply invented a new brand called Fanta and kept selling it. That's why Fanta to this day is popular in Europe and in the parts of Latin America where many Nazis fled after the war. Take a close look at a can of Fanta and you'll see it's still owned by Coca Cola.",
   "created_utc": 1692311420,
   "score": 240,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn5udp",
   "message": "The shit the Nazis did to Belarus. They piled entire towns into churches and lit them on fire. They wiped out entire populations in hundreds of towns. They would also allow children to leave the church, seemingly sparing them, then they'd mow them down later after hearing their families screaming.",
   "created_utc": 1692311842,
   "score": 62,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn7vzr",
   "message": "Might be obvious to some, but a significant amount of people targeted by the Nazis did not die in the camps. \n\nThe “Holocaust by Bullets” was carried out by paramilitary death squads lead by Heinrich Himmler and operated under the SS. It was known as Einsatzgruppen, murdering primarily civilians, intelligence officers, Soviets, Jews, Romani people, and others throughout the war. Einsatzgruppen was particularly ruthless, often recruiting locals from small towns and forcing prisoners to dig mass graves at the roadside. Prisoners were stripped of their clothes and valuables, before shooting the remaining prisoners.\n\nTo give you an idea of the scale of these atrocities, approximately one third of all Jewish Holocaust victims died as a result of shootings. Einsatzgruppen was the group primarily responsible for these deaths. \n\nDuring the Nuremberg Trials twenty-four senior members of Einsatzgruppen were captured and charged with war crimes and crimes against humanity. The Nuremberg Trials resulted in fourteen death sentences and two life sentences, but only four executions were carried out and the rest were converted to lesser sentences.",
   "created_utc": 1692312677,
   "score": 195,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn3t64",
   "message": "The world’s nations didn’t want their Jews back, they had already moved into their houses \u0026amp; businesses after all.  \n\nThe murder of Jews continued well after WWII ended \u0026amp; Germany fell.  \n\nThis is one of the biggest factors leading to 40% of Israel’s Jews having European ancestry.",
   "created_utc": 1692311039,
   "score": 248,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwne10a",
   "message": "During the Rape of Nanking there was a contest between two Japanese officers to see who could decapitate the most people",
   "created_utc": 1692315291,
   "score": 67,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwncun2",
   "message": "That thing about carrots making you see better in the dark? British propaganda bullshit.",
   "created_utc": 1692314774,
   "score": 124,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwmziyh",
   "message": "England starved about 4-5 million Indians to death during the war because they refused to slow down their exportation of rice despite a low yield year (aka the exact same thing they did to India once before and Ireland with the potato). Churchill was directly involved.",
   "created_utc": 1692309379,
   "score": 208,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwmy8mq",
   "message": "The existence of Unit 731 and a lot of the other atrocities committed by Japan. It's a common answer on Reddit, but outside of our little echo chamber most people are still totally unaware of just how horrific a lot of what Japan did was. A lot of what Japan did during WWII was every bit as bad as what the Nazis did and in some instances one could even argue that what they did was worse.",
   "created_utc": 1692308896,
   "score": 170,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn198f",
   "message": "WW2 are the only reasons we know about the stages of hypothermia",
   "created_utc": 1692310040,
   "score": 133,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn94d7",
   "message": "Despite popular belief, half of WW2 was fought at night.",
   "created_utc": 1692313187,
   "score": 211,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwmxvm1",
   "message": "Croatia made people into Soap and other stuff that even Germany said come the fck down",
   "created_utc": 1692308758,
   "score": 43,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwmzeng",
   "message": "Estimates on just how many lives would have been lost if the Allies had try to take the Japanese homeland were truly staggering.",
   "created_utc": 1692309333,
   "score": 110,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn1pib",
   "message": "The January 31, 1945 sinking of the German ship the *MV Wilhelm Gustloff.* The total casualties are unknown but are estimated at over 9000, making it by far the worst maritime disaster in modern history.",
   "created_utc": 1692310217,
   "score": 204,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn55xw",
   "message": "The experiments that the Nazis did on women.  I won't even go into them on here, but you can look them up.",
   "created_utc": 1692311574,
   "score": 6,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwmzgci",
   "message": "Its not specifically about world war two but it only occured because of thr war. The act of enslaving black people in the US was finally and only criminalized on Demeber 12, 1941 in response to the Japanese bombing of pearl harbor. The entire Japanese propaganda effort was centered around the concept of the Japanese empire \"freeing enslaved and colonized people of color from european imperialists\", completely ignoring that they themselves were brutal imperialists. \n\nWhile the 13th amendment officially abolished the institution of slavery, it had zero provisions in what to actually do with people caught practicing slavery. In many southern states, it was common for white industrialists and land owners to trick illiterate black workers into signing \"labour contracts\" in which they agreed to essentially act as slaves for their employers. These \"labour contracts\" were completely legal and in some southern states, were even supported by municipal or state authorities. In 1900, the department of Justice investigation concluded that an estimated 800,000 black americans were essentially enslaved again. The practice was still alive well into the 1930s. \n\nFast forward to right after the US entry into the war the war propaganda department recommended the official criminalization of enslaving people in order to deprive the Japanese the moral high ground of \"liberating people of colour from slavery argument\". A conclusion that the DOJ and FDR agreed with. The following day, the DOJ would pass a memorandum criminalizing the act. The DOJ would begin prosecuting people who were caught using these now illegal \"labour contracts.\" The last black person would be freed from slavery would be in 1943. \n\nTLDR: If it wasnt for Japan declaring war on America, slavery wouldn't have been declared a federal crime.",
   "created_utc": 1692309351,
   "score": 105,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwmxg17",
   "message": "WW1. Scottish/Irish where sent into battle first to basically bullet catch for the Engl..sorry no we’re all British and equal…",
   "created_utc": 1692308597,
   "score": 23,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwncqr8",
   "message": "The allies fire-bombed german cities with civilan populations even though there were no military targets or installations in them. So even though the germans were the bad guys of world war 2, the allies weren't really good either.",
   "created_utc": 1692314727,
   "score": 4,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn088o",
   "message": "While we focus a lot on the amount of deaths in the holocaust we don't focus too much on what experiments the Nazis actually did, to mostly children. \n\nWhat's worst as as we say it hasn't a lot of science  and medicine we know today comes from those experiments. \n\nHow do we know what temperatures hyperthermia starts? We'll the Nazis tested it on children. Want to know the effect of how quickly some dies from losing a arm? Again the Nazis. And there is much more.",
   "created_utc": 1692309645,
   "score": 21,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwng8q4",
   "message": "Alot of modern tech piggybacked off the nazis (and unit 731 medically)\n\nMany ppl involved in the moon mission were nazis\n\nOur knowledge of hypothermia come from nazis\n\nThe holocaust started with book bannings\n\nThere is a nazi bunker out there thats dangerously radioactive, meaning they were at least experimenting with nukes",
   "created_utc": 1692316254,
   "score": 155,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnjm4t",
   "message": "Something you never hear about is what happened to displaced persons, or DP. Over 40 million people couldn’t go back to where they originally lived. A lot of people were prevented from going back. A lot didn’t want to go back. It’s a fascinating story that doesn’t get much coverage. There is an article on Wikipedia:\n\nhttps://en.m.wikipedia.org/wiki/Displaced_persons_camps_in_post–World_War_II_Europe",
   "created_utc": 1692317712,
   "score": 4,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnlm9n",
   "message": "The number of Nazi officials that came over to work with Allen Dulles and the CIA as the war was ending, thereby avoiding any consequences for their actions.",
   "created_utc": 1692318573,
   "score": 120,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnlz9g",
   "message": "During the winter war, the Finns put up dead Russian soldiers with sticks as a psychological weapon. A type of scarecrow, or i suppose ScareRed (Patent pending)",
   "created_utc": 1692318729,
   "score": 14,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn2g2w",
   "message": "PTSD was prevalent among the returning veterans. More should have been done to help them.",
   "created_utc": 1692310506,
   "score": 5,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwncowy",
   "message": "As many as 15 million Russians were killed.",
   "created_utc": 1692314704,
   "score": 3,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnbxrr",
   "message": "Unit 731.. never forget.!!",
   "created_utc": 1692314378,
   "score": 8,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwneq0h",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwngyn3",
   "message": "Bayer",
   "created_utc": 1692316562,
   "score": 1,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn9jwq",
   "message": "Hitler had only one ball.",
   "created_utc": 1692313368,
   "score": 2,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwmxib1",
   "message": "The Holocaust resulted in the systematic genocide of six million Jews.",
   "created_utc": 1692308621,
   "score": 2,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwmy0yd",
   "message": "That humanity was vile and wicked and killed over 100 million of it's own people in a handful of years.",
   "created_utc": 1692308814,
   "score": 254,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwmxgh2",
   "message": "Many people died",
   "created_utc": 1692308602,
   "score": 249,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwmwv0x",
   "message": "Besides the obvious ones?",
   "created_utc": 1692308377,
   "score": 253,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn3g40",
   "message": "The British bombed German civilians first",
   "created_utc": 1692310897,
   "score": 253,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnh5da",
   "message": "A not insignificant number of concentration camp prisoners were liberated and immediately imprisoned again or sent to labor camps in Siberia. Primarily, members of the LGBTQIA community.",
   "created_utc": 1692316642,
   "score": 1,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnfn7f",
   "message": "World War 2 happened but not for the official reasons stated. If social media were around the public freakout would probably be worse. The same factors leading up to world war are being fabricated or at the most distant naturally being created to do it again however not for the reasons stated instead some folks will fight hard for someone else to tell them what to do which for the topic is having Europe as it currently is with dudes that have the whole religion with titles of kings and all that. That is the real reason which again is the one not stated and looking at Europe in 2023 it sure seems to be the one not officially stated.\n\nRemember there were concentration camps in Europe *and* America during that time. One of many reasons why I think it was more of getting the world wide population to tone down than anything else officially stated. There are more things like that that stand out and make it horrible when you put it on a white board or any sort of stuff to look at. And a few years later Asia would have its own problems too so if you look at it as 20 years from 1940s to 1960s its definitely odd.",
   "created_utc": 1692315995,
   "score": 1,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn6uq8",
   "message": "After the war Eisenhower starved millions of German soldiers to death in POW camps.",
   "created_utc": 1692312253,
   "score": 245,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwn9i8p",
   "message": "Although Turkey did not participate in the second world war, 21 000 Turkish soldiers died.",
   "created_utc": 1692313349,
   "score": 31,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnf4fa",
   "message": "The women who were friendly (hooked up ) with the nazi troops in their occupied countries were treated horrendously after the war and their children were too by their own families /people",
   "created_utc": 1692315771,
   "score": 60,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnglze",
   "message": "Unit 731. \n\nIt made the Nazi concentration camps look like a vacation resort. It was that bad, and one of the reasons the atomic bombs had to be dropped on Japan. It had to stop. It was a crime against humanity in the worst possible way.",
   "created_utc": 1692316410,
   "score": 21,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwngm1v",
   "message": "It’s thanks to the [horrific experiments that happened on prisonniers in Dachau camp](https://dirkdeklein.net/2016/10/01/nazis-nasa-and-dachau/) that we know the limits of pressure, temperature and other environmental factors a human body can sustain.\n\n“Thanks” to this knowledge NASA was able to develop their space suits faster.\n\n\u0026gt; The victims were locked in the chamber, the interior pressure of which was then lowered to a level corresponding to very high altitudes. The pressure could be very quickly altered, allowing Rascher to simulate the conditions which would be experienced by a pilot freefalling from altitude without oxygen.\n\n\u0026gt; Rascher also conducted so-called “freezing experiments” on behalf of the Luftwaffe, in which 300 test subjects were used against their will. These were also conducted at Dachau after the high-altitude experiments had concluded. The purpose was to determine the best way of warming German pilots who had been forced down in the North Sea and suffered hypothermia.\n\n\u0026gt; Rascher experimented with the effects of Polygal, a substance made from beet and apple pectin, which aided blood clotting. He predicted that the preventive use of Polygal tablets would reduce bleeding from gunshot wounds sustained during combat or during surgery. Subjects were given a Polygal tablet, and shot through the neck or chest, or their limbs amputated without anaesthesia.\n\n\u0026gt; Although he had been executed before the American troops liberated Dachau, they did get hold of the notes and the research of experiments, which later became property of NASA.\n\n\u0026gt; Based on Rascher’s “Research” NASA developed their space suits.",
   "created_utc": 1692316411,
   "score": 60,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnh1qm",
   "message": "Some of the most important medical discoveries were made during world War 2 and were the result of torture.",
   "created_utc": 1692316598,
   "score": 27,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnh2at",
   "message": "Germany used prostitutes as bio-weapons.\n\nUnder their rule, any prostitutes who had STIs were imprisoned so they couldn't infect German troops.\n\nAs Germany started to lose ground in occupied Europe, they would release all of the women in hopes of infecting allied troops.\n\nTBH I don't remember if this happened in WW1 or WW2. It could very well have been both.",
   "created_utc": 1692316605,
   "score": 121,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnhjqn",
   "message": "France invaded Germany first. The Saar Offensive, September 7th to October, 17th, 1939.",
   "created_utc": 1692316818,
   "score": 1,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnj6pu",
   "message": "NOW DO VIETNAM.",
   "created_utc": 1692317528,
   "score": 1,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnjfhf",
   "message": "Denazification is a myth.  The guy who led the mob that burned down the synagogue in cologne is the same guy who denied to permit to rebuild it after the war.  Most of the nazis just went back to their old jobs. \n\nIt wasn’t until the students started getting serious in 1968 that the attitude towards Nazis turns to ‘unacceptable’. Nazi drinking songs were sung in bars until then.",
   "created_utc": 1692317633,
   "score": 95,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnk3af",
   "message": "A lot of countries were kinda hesitant to take back their Jewish citizens because those folks had already built lives in their new homes. It's really sad, but even after the war was over and Germany was defeated, Jews were still being persecuted and killed.",
   "created_utc": 1692317916,
   "score": 111,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnka9f",
   "message": "A lot of German soldiers were high on methamphétamine ([pervitin](https://en.m.wikipedia.org/wiki/Drug_policy_of_Nazi_Germany)). Sometimes mixed with cocaine.\n\n\u0026gt; Methamphetamine use is believed to have played a role in the speed of Germany's initial blitzkrieg.[6][7]\n\n\u0026gt; Cocaine, whose effects substantially overlap with those of amphetamine but feature greater euphoria, was later added to the formulation to increase its potency through the multiplicative effects of drug interaction and to reinforce its use by individuals.",
   "created_utc": 1692317999,
   "score": 1,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnkmrk",
   "message": "Adolf Hitler was a big fan of Henry Ford’s work and kept a framed picture of him at his desk",
   "created_utc": 1692318147,
   "score": 73,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnkqy2",
   "message": "A dozen Nazi department heads got together at a chateau to iron out the details of the Holocaust.  It took less than two hours.\n\nA movie was made about it called “Conspiracy”",
   "created_utc": 1692318196,
   "score": 224,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnkyuj",
   "message": "The role of the Catholic church?",
   "created_utc": 1692318292,
   "score": 1,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnl9fp",
   "message": "Firebombing of Tokyo March 9th 1945 was the most destructive bombing raid in human history.",
   "created_utc": 1692318419,
   "score": 63,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnlbyq",
   "message": "The Dirlewanger Brigade, named after its commander Oskar Dirlewanger, consisted of convicted criminals who were not expected to survive their service with the unit.\n\nDuring its operations, the unit participated in the mass murder of civilians and in other war crimes in German-occupied Eastern Europe. It gained a reputation **among Wehrmacht and Waffen-SS officers** for its brutality.\n\nCrimes included the mass rape and murder of 15 Red Cross nurses and the killing of thousands of civilians. After troops entered a makeshift military hospital, they first killed the wounded with bayonets and rifle butts before gang raping the women. The naked bleeding nurses were then taken outside and hanged by their feet and shot in their stomachs.",
   "created_utc": 1692318449,
   "score": 42,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnlfsr",
   "message": "Some factoids about queer people:\n\n1) Some surprisingly progressive policies concerning queer people had been introduced before the Nazis. First in Berlin (and then in a few other German cities) you could get a so-called [\"transvestite pass\"](https://en.wikipedia.org/wiki/Transvestite_pass?wprov=sfla1) which allowed you to wear clothes in public that didn't match your biological sex. But later, during the Nazi regime, these certificates were used as evidence against them.\n\n2) Under Nazi rule gay men were, in the beginning, castrated or sterilized. Many of them had hoped this would be the end of their persecution. Deportations to the concentration camps only followed quite a bit later.\n\n3) Many people nowadays know about the [pink triangle](https://en.wikipedia.org/wiki/Pink_triangle?wprov=sfla1) which marked male, gay prisoners in the concentration camps. However, gay men were often given others triangles on a somewhat arbitrary basis. For example, if you had been convicted of homosexual conduct several times you could get a green triangle for being a \"habitual criminal\" etc. Lesbians did not have a triangle of their own at all and were usually marked with a black triangle (for being \"asocial\").",
   "created_utc": 1692318494,
   "score": 1,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnlnz1",
   "message": "There was a Nazi organisation in the USA [until 1941](https://en.m.wikipedia.org/wiki/German_American_Bund)\n\nBtw there’s an American Nazi party nowadays too.",
   "created_utc": 1692318593,
   "score": 28,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnm5to",
   "message": "Japanese soldiers would bayonet pregnant women",
   "created_utc": 1692318808,
   "score": 52,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnmcp8",
   "message": "German “Operation Barbarossa” led to mass killing of 5.5 million Soviet prisoners by the Nazi’s in 1941-42.\nIn a span of eight months, Nazi's killed 2.8 million Soviet prisoners. They\nused techniques like starvation, exposure to poisonous gases and\nholocausts for this concentrated gendercide. This was part of Hitler's\n\"Operation Barbarossa\" in which more than 5.5 million Soviet prisoners\nwere either exposed to death or sent to Germany for extermination.",
   "created_utc": 1692318892,
   "score": 1,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnq0ci",
   "message": "Japanese officers would test their swords on captured American airmen.  A veteran I knew personally wrote about some friends who went missing after their B-25 was shot down on a strafing mission.  Later, it was revealed they were used as bayonet practice after capture.  When they learned their fate, they asked to be shot instead.   Each man was bayonetted by a member of the Japanese infantry squad, for a total around 25 times.  Other men were beheaded.",
   "created_utc": 1692320481,
   "score": 100,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnta81",
   "message": "The Swiss weren’t “neutral”.  Hitler used Swiss banks to store the gold of dead Jews.",
   "created_utc": 1692321901,
   "score": 122,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnq3xy",
   "message": "The Katyn Massacre. 22000 Poles were executed by the Soviets and buried in mass graves. These were military officers and intelligentsia. The Nazis discovered the mass graves. The Soviets blamed the Nazis all the way up until 1990.",
   "created_utc": 1692320524,
   "score": 119,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnzlkz",
   "message": "The Ustaše. They were Croatian Fascists that worked with the Nazis. They were so brutal that many SS officers were disturbed. While the Nazis used gas chambers and sometimes rifles in their concentration camps, the Ustaše used things like knives, hammers, shovels (both hitting and decapitating), and basically any other objects they could kill people up close. They also threw them down into pits where they'd die. They also often tortured people to death and one camp had a \"scoreboard\" the guards made of how many women and girls they had r*ped. They would also blind people (including children) by gouging out their eyes, castrate men, and would have people mauled to death by dogs. As the war was coming to a close some higher-ups managed to get help from the Catholic Church to escape to Argentina. This was because they had made Catholicism central to their ideology and therefore were pretty friendly with the Catholic Church",
   "created_utc": 1692324662,
   "score": 133,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwo3xnh",
   "message": "[Dr. Gisela Perl](https://www.bbc.com/future/article/20200526-dr-gisella-perl-the-auschwitz-doctor-who-saved-lives), a Hungarian gynecologist, was in Bergen-Belsen camp.\n\nShe performed abortions with her bare hands in order to save their mothers' lives because she knew Dr. Josef Mengele loved to experiment on pregnant women.",
   "created_utc": 1692326664,
   "score": 208,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnqub5",
   "message": "One of the first Wehrmacht soldiers captured on D Day was.... Korean.\n\nYang Kyoung Jong had been drafted into the Imperial Japanese Army to fight the Soviets at Khalkhin Gol.\n\nHe was captured by the Red Army and forced to fight the Germans.\n\nHe was captured by the Wehrmacht and was deployed at Normandy on D Day.\n\nFinally, he was captured by American paratroopers and granted asylum in the US.\n\n\nhttps://en.wikipedia.org/wiki/Yang_Kyoungjong?wprov=sfla1",
   "created_utc": 1692320838,
   "score": 130,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnpqqp",
   "message": "People who survived the Atomic blast at Hiroshima sometimes had burns on their skin that matched the light and dark patterns on their clothing.",
   "created_utc": 1692320367,
   "score": 70,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnxnub",
   "message": "The Germans [routinely killed black colonial POWs](https://www.nationalww2museum.org/war/articles/chasselay-massacre-june-1940) during the 1940 Battle of France. These POWs were French soldiers used to bulk up the French Army because of demographic issues. The Germans felt offended to have fought inferior races.\n\nWhen the Allies returned to France in 1944, the black colonial soldiers [were excluded from the liberation of Paris](http://news.bbc.co.uk/2/hi/europe/7984436.stm). This was by order of SHAEF, or Ike's HQ, or the highest Allied command. The Americans insisted because the US army was segregated and did not want black soldiers to be seen in combat roles. \n The French obliged and also did the same later in the war, since De Gaulle wanted white troops to be seen liberating France. This despite the fact that [about 65% of the Free French Army was non white.](https://www.bbc.com/news/world-europe-53261948) Or at least non European- many Algerians and Tunisians gave valuable service too.\n\nThen in 1959, the French stopped paying these African vets their pensions.",
   "created_utc": 1692323807,
   "score": 116,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwo58qv",
   "message": "Oil is still leaking from the oil bunkers of the USS Arizona at Pearl Harbor to this day.",
   "created_utc": 1692327277,
   "score": 246,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnpt8t",
   "message": "The Lebensborn program. A “breeding“ program created by the nazis, where ”aryan“ women would have children with German men (soldiers), to continue and protect the ”aryan“ values. The offsprings would then be sent to Germany. The Lebensborn program was mostly in Norway (outside of Germany who had 10 facilities) with 9 facilities around the country.\n\n\nhttps://en.m.wikipedia.org/wiki/Lebensborn",
   "created_utc": 1692320396,
   "score": 54,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnsqg8",
   "message": "Not as dark as other people’s comments but Hugo Boss clothing brand is the one who designed all Nazi uniforms . Obviously Hugo Boss still exists",
   "created_utc": 1692321663,
   "score": 8,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwo6d65",
   "message": "One of the Japanese officers, Masanobu Tsuji is known for the countless warcrimes in the south east asia, from death marches to hospital massacres, this fucker escaped the Tokyo trial and became a CIA agent in the US while also having a statue on him in one of the Japanese prefectures\n\nGeneral Homma, who considered himself a humanist and was surprised to hear the facts of death march after the war, was held responsible for his subordinates and was executed while Tsuji was on the run.\n\nCIA files declassified in 2005–2006 show that Tsuji also worked for the CIA as a spy during the Cold War\n\nWarcrimes from this fuck head includes: \n\ninstigated an aggressive border policy, which triggered the Nomonhan Incident\n\nplan the Sook Ching, a systematic massacre of thousands of Malayan Chinese\n\nsought to have all American prisoners killed and encouraged the brutal mistreatment and casual murder of prisoners in the Bataan Death March.\n\nmany captured officials of the Philippines government executed",
   "created_utc": 1692327821,
   "score": 125,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnwtcu",
   "message": "Idk whether to upvote this for knowledge. Or downvote for the nausea I feel reading them",
   "created_utc": 1692323440,
   "score": 11,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwntlrp",
   "message": "https://www.hmd.org.uk/learn-about-the-holocaust-and-genocides/nazi-persecution/disabled-people/\n\nIt all began with the disabled. It's been said that how a society treats the disabled is a reflection of the society's core values.",
   "created_utc": 1692322041,
   "score": 72,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnt7m9",
   "message": "Somehow the Japanese were way worse than the Nazi's. When I first heard this I thought BS. I know they are bad but worse than the Nazi? No way. Turns out their war crimes were way more brutal/gruesome/inhumane/etc.",
   "created_utc": 1692321870,
   "score": 16,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnou21",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwo1rhm",
   "message": "The shit the Japanese were doing in China (not just Nanking) even made SS officers look away in horror.\n\nTo this day the Japanese government refuses to admit it ever happened, and most Japanese people were never taught about it in school. Sino-Japanese relations are still soured by that",
   "created_utc": 1692325652,
   "score": 60,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwo9f3n",
   "message": "2.1 mil people died in India because of Britain's denial of rice policy.",
   "created_utc": 1692329349,
   "score": 25,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnrvoi",
   "message": "http://www.sovlit.net/sonofregiment/\n\nTrue story about a boy who's entire family is slaughtered by the Nazis, little kid manages to escape into the woods. Is found starving days later by Russian soldiers, gets treated well, becomes a beloved part of the corps, a Red Army Officer at age 12, serves in battle by carrying ammunition, uncovers Nazi spy campaigns, dances and sings cute little songs to his fellow soldiers to improve morale, gets blown up, saves a major general who later adopts him into his family. \n\nSurvives the war. Becomes a civil rights lawyer. Is totally badass.",
   "created_utc": 1692321288,
   "score": 107,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnz602",
   "message": "The Nazis were excellent record keepers. We know a lot of what actually happened because they kept great records of all the horrible things they did. But here's the kicker: they *knew* what they were doing was evil. Oftentimes, when Allied armies were getting close to camps, the superior officers would begin to burn the records. They didn't want the Allies to see what fucked-up shit they were doing. They *knew* they were the bad guys. That's rarely taught.",
   "created_utc": 1692324468,
   "score": 75,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwo6zw3",
   "message": "Having been in the Iraqi War, I know for a fact atrocities are committed by both sides. The difference is, the losing side has their stories recorded while the winning side has theirs swept under the rug. There are many instances of US soldiers shooting POWs. It's just the way war is.",
   "created_utc": 1692328132,
   "score": 75,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwnw9ra",
   "message": "United States Senator from Minnesota, Ernest Lundeen collaborated with the nazis and used his office to push nazi propaganda though official channels. An agent from Hitlers government even wrote some of his speeches.",
   "created_utc": 1692323205,
   "score": 22,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwodexp",
   "message": "Canada had Japanese internment and also sent a ship of Jewish refugees back to Europe where a bunch of them died in concentration camps. The latter isn't something that's taught in schools to my knowledge.",
   "created_utc": 1692331484,
   "score": 26,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwoayxf",
   "message": "Guess how long it took for the global population of Jews to return to its pre-WWII number?\n\n\u0026gt;!It still hasn’t!\u0026lt;",
   "created_utc": 1692330162,
   "score": 45,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwo3t1t",
   "message": "American GIs sending home souvenir body parts from the corpses of Japanese soldiers was popular in the early Pacific war. I can't remember if a law was passed to outlaw the practice, or if it was already illegal...but there was a campaign against it in the press.",
   "created_utc": 1692326602,
   "score": 17,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwo0x7b",
   "message": "WW2 is what you get when you follow mindlessly. Propaganda works, belittle and dehumanize the enemy.",
   "created_utc": 1692325268,
   "score": 9,
   "submission_id": "15u0nhh"
  },
  {
   "comment_id": "jwo0pk2",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15u0nhh"
  }
 ]
}