{
 "submission_id": "15u7ufv",
 "title": "Why doesn't Jeff Bezos use 4 billion of his 163 billion to fix Hawaii and redeem his evil reputation?",
 "selftext": "",
 "created_utc": 1692326356,
 "permalink": "/r/AskReddit/comments/15u7ufv/why_doesnt_jeff_bezos_use_4_billion_of_his_163/",
 "score": 137,
 "url": "https://www.reddit.com/r/AskReddit/comments/15u7ufv/why_doesnt_jeff_bezos_use_4_billion_of_his_163/",
 "comments": [
  {
   "comment_id": "jwof32i",
   "message": "As much as I hate to defend Bezos he did donate 100million to the Maui wildfire fund which is an absolute shitload of money",
   "created_utc": 1692332411,
   "score": 18,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoa412",
   "message": "What am I missing about $4 Billion fixing Hawaii?",
   "created_utc": 1692329710,
   "score": 86,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwo7csv",
   "message": "We would all have better luck with his ex Mackenzie Scott or the Gates foundation. \n\nBezos doesn't give a shit",
   "created_utc": 1692328310,
   "score": 218,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoey63",
   "message": "People don't seem to understand where rich people keep their money. They don't just have a couple billion sitting in a bank account or under their bed. It's tied up in stocks and other things they can't just simply pull from.",
   "created_utc": 1692332333,
   "score": 220,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwo5z7a",
   "message": "Because he’s a cunt",
   "created_utc": 1692327630,
   "score": 111,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoecvu",
   "message": "How do so many people not understand how worth works.",
   "created_utc": 1692331996,
   "score": 182,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwo83rk",
   "message": "He would be stupid to have 4 billion in liquidity from a purely economical standpoint.",
   "created_utc": 1692328686,
   "score": 33,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwo70o0",
   "message": "Because the vast majority of his money is tied up in his Amazon shares. And selling off that much of them at once is a long and complicated process that requires approval from the SEC, not to mention how it could devalue his shares, thus meaning a good chunk of the money would simply evaporate.\n\nAnd let's be realistic here, would that actually cause the people who already hate him to change their minds?",
   "created_utc": 1692328142,
   "score": 74,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwogig4",
   "message": "He’s literally donating millions to Maui … it might not be billions, but still ….",
   "created_utc": 1692333217,
   "score": 37,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwopemb",
   "message": "Better question:\nWhy did we build a society where our government is so underfunded and impotent that all we can do is hope that some asshole billionaire will deem people ravaged by a natural disaster worthy of being saved?",
   "created_utc": 1692338849,
   "score": 12,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwohf75",
   "message": "Because he would be hated for not spending 158 billion on everything else wrong with the world.",
   "created_utc": 1692333749,
   "score": 12,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwosi2k",
   "message": "Because the likelihood of him having 4 billion in liquid money is 0%. He already donated 100 million dollars.",
   "created_utc": 1692341051,
   "score": 4,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoh7xh",
   "message": "For the same reason you or the average joe aren't donating $5k or 500 bucks to victims of the earthquake?",
   "created_utc": 1692333630,
   "score": 10,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwo4clu",
   "message": "He is not morally obligated to do anything with his money. 100 million is a shit load of money.",
   "created_utc": 1692326858,
   "score": 27,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwo596c",
   "message": "Jeff Bezos' personal financial decisions are complex and multifaceted. While it might seem like allocating a portion of his wealth could address issues like those in Hawaii, the challenges faced by a region involve intricate social, economic, and environmental factors that require systemic solutions. Large-scale problems often require the involvement of governments, organizations, and institutions to create lasting impact. Bezos and other wealthy individuals often engage in philanthropic efforts, but it's important to understand that addressing complex issues involves more than just financial contributions. It requires collaboration, long-term planning, and addressing underlying systemic factors.\n\nAnd the state and our country can handle this.",
   "created_utc": 1692327282,
   "score": 8,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwo3fx8",
   "message": "Greed",
   "created_utc": 1692326429,
   "score": 18,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwojisp",
   "message": "He doesn't care what random people on Reddit think about him?",
   "created_utc": 1692335019,
   "score": 3,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwol9h1",
   "message": "He's not close enough to death to enter his philantropist stage. Check back in 10 years.",
   "created_utc": 1692336110,
   "score": 3,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwolud7",
   "message": "Why should he?",
   "created_utc": 1692336486,
   "score": 3,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoigvw",
   "message": "He probably doesn’t give a single shit about how people on Reddit feel about him.",
   "created_utc": 1692334372,
   "score": 6,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoq6c1",
   "message": "Average real estate in Maui is $1,000,000. It's not like a bunch of poor 3rd world countrymen are suffering. If Oprah's vacation home burnt down she can buy another.",
   "created_utc": 1692339384,
   "score": 5,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwo3g9s",
   "message": "Because he doesn't care what other people think about him, or about other people in general.",
   "created_utc": 1692326433,
   "score": 16,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwo4bb5",
   "message": "No one is entitled to any of his money. It's not his job to bail out a state in crisis.",
   "created_utc": 1692326841,
   "score": 21,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwojqso",
   "message": "Billionaires don’t have this money in a cash vault or bank account. It’s in assets. Projection. Investments. Constant input for constant output. \n\nThe most common fallacy that Reddit falls for is that people like him can just take a fraction of their reported wealth and dump it on whatever cause of the week. \n\nIt’s the same simple misunderstanding of economics that’s helps explain why he is in the position he is in, and you are not.",
   "created_utc": 1692335157,
   "score": 4,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwomc52",
   "message": "Because, why would he?",
   "created_utc": 1692336808,
   "score": 5,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwohb2r",
   "message": "Because if Bezos had donated more money every time someone thinks he should have donated more money he would have gave away everything when he was a millionaire and never had enough money to do this in the first place.  He will most likely give away most his money to charity at some point so my question for you is why is Hawaii more important than \"insert some very important cause here\"?",
   "created_utc": 1692333682,
   "score": 5,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwokmfv",
   "message": "Because he’s evil",
   "created_utc": 1692335704,
   "score": 2,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwomkt5",
   "message": "does he even have 4 billion in cash?",
   "created_utc": 1692336962,
   "score": 2,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwomv1o",
   "message": "Because he shouldn’t be expected to",
   "created_utc": 1692337145,
   "score": 2,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwonkag",
   "message": "Why doesn't the federal government?",
   "created_utc": 1692337608,
   "score": 2,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwonyxu",
   "message": "Because he doesn’t want to",
   "created_utc": 1692337880,
   "score": 2,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwos18o",
   "message": "why should a private person do something that is a task for the government?",
   "created_utc": 1692340703,
   "score": 2,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoxbhn",
   "message": "First off, most of any billionaires wealth is not instantly available. Jeff Bezos could convert 4 billion of his wealth to be available but it would cost him. The state is constantly trying to obtain peoples wealth. As soon as that money became available Bezos would be liable for taxes in it and fees. 4 billion could easily cost him a lot more than that. Even if used altruistically the state doesn’t care. So billionaires are essentially incentivized to not be altruistic and generous.\n\nBillionaires try to avoid giving their money to governments because, well they earned it, and that money governments obtain from them is often mismanaged and wasted.\n\nBasically imagine your parents sent you $500 for your birthday. And as soon as that money touched your bank account, you got a notification from the government saying you are to pay $250 in taxes plus a $50 fee. So now your are left essentially with just $200. Then they used that money to buy medical supplies, but because of mismanagement, with your $300 they kept, they only managed to by 100 masks and 30 band-aids. \n\nThat is essentially the problem billionaires have.",
   "created_utc": 1692344712,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoozmo",
   "message": "He a white bald headed stingy hoe.",
   "created_utc": 1692338571,
   "score": 3,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwogtm4",
   "message": "Because he doesn't have 4 billion in cash laying around that would be unwise when money market accounts are over 5% return guaranteed. When you read a headline about someone's \"net worth\" it's not JUST cash... It's the value of them as a whole. It includes his massive stake in amazon, stock market investments, real estate, land, watches, etc. You can't just go to the bank and ask for a billion dollars it doesn't really work like that.",
   "created_utc": 1692333397,
   "score": 4,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwommmc",
   "message": "He doesn't care. There isn't a person alive who has the money and also cares enough.",
   "created_utc": 1692336994,
   "score": 4,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwolht4",
   "message": "Why don't you give away a few percent of your net worth to help a random kid on the street that you don't know?\n\nYeah, I didn't think so.",
   "created_utc": 1692336259,
   "score": 3,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwohzef",
   "message": "Lmao are you serious??",
   "created_utc": 1692334083,
   "score": 2,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwok460",
   "message": "He's cash poor.\n\nWhen you take out a loan you put something up for collateral. Bezos puts his stock in his company up for collateral, but if his company continues to grow in value then he can continue to pay back the loan. The banks will often agree because he pays back at a higher rate of interest.\n\nYou would need to convince him to either sell some assets up to $4billion which would reduce his ability to pay back these loans. Or take out a loan of $4billion without gaining any assets out of the transaction.\n\nIf America would sell him the island I'm sure he would snap it up because he would own the land that all the properties would be built on. That would make his $4billion back in a few years and it would be another asset for him to pay back more loans he could take out.",
   "created_utc": 1692335387,
   "score": 2,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoo4kx",
   "message": "Because all billionaires are sociopaths?",
   "created_utc": 1692337984,
   "score": 2,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwopl2i",
   "message": "Because he would have 159 billion after that.",
   "created_utc": 1692338977,
   "score": 2,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwougc4",
   "message": "Because he's evil.",
   "created_utc": 1692342504,
   "score": 2,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwo7tro",
   "message": "lol",
   "created_utc": 1692328548,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwohf9r",
   "message": "Let’s be real, he’s more likely to join the other rich assholes who are going to buy up local properties in exchange for fixing everything.",
   "created_utc": 1692333751,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwohkp1",
   "message": "I don't know much about Jeff Bezos, but anybody can donate right?",
   "created_utc": 1692333841,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwomvjt",
   "message": "He’s spiteful cause he was a dork most of his life and now he doesn’t want anyone else to have fun, except himself.",
   "created_utc": 1692337154,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoaku0",
   "message": "He has an evil reputation from... creating jobs.",
   "created_utc": 1692329954,
   "score": 255,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwofcip",
   "message": "Then how would other rich people be able to buy the land for cheap?",
   "created_utc": 1692332556,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoglnl",
   "message": "You dont get to billionaire status by spending that much all the time on suffering people.",
   "created_utc": 1692333270,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwogxtn",
   "message": "He would be a really crappy evil billionaire if he just went around saving lives",
   "created_utc": 1692333465,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwomdga",
   "message": "Out of the loop, did he break something?",
   "created_utc": 1692336831,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoovpt",
   "message": "Billionaires don’t have that money. They are worth that much money in stocks, investments, property and very little cash",
   "created_utc": 1692338496,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoptme",
   "message": "Because the vast majority of that 163 billion isn't liquid funds.  It's stock value, real estate, and other property.  It's not like he has a checking account with 163 billion in it.",
   "created_utc": 1692339141,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwosy3n",
   "message": "Everyone hear making the point that all his money is “tied up” in stocks don’t realize how easy it is to sell their stocks lol",
   "created_utc": 1692341383,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwotbl7",
   "message": "He's like an evil cartoon.  He is a good person, but his forehead is evil and makes him do bad things",
   "created_utc": 1692341657,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwothkw",
   "message": "He can donate 10 billion and people will still bitch.",
   "created_utc": 1692341783,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwouolf",
   "message": "1. They don't get rich by having a personality that aligns with giving away money.\n2. A country that needs charity has a failed tax system.",
   "created_utc": 1692342679,
   "score": 1,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwo4v9p",
   "message": "A friend once told me this\n\n\"not my monkey, not my circus\"\n\nNo matter how much you hate him he owes nothing to them. now lets talk about why President Joe biden has not been all over Tv talking about how we will help the people of Hawaii rebuild? NOPE lets send billions more to Ukraine.",
   "created_utc": 1692327099,
   "score": 252,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwocdfs",
   "message": "Billionaires don’t become billionaires because they spend money on anything that doesn’t make them more money.",
   "created_utc": 1692330913,
   "score": 0,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwomvvr",
   "message": "I'm not defending him, but why should he?",
   "created_utc": 1692337160,
   "score": 0,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwooz1i",
   "message": "Because he doesn’t care enough to give a shit about what’s you think about him, it is really that simple.",
   "created_utc": 1692338560,
   "score": 0,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwop4vd",
   "message": "Same reason you wall past a homeless person in the street and don't give them money... he's not entitled to do anything, its his money. \n\nI understand people are saying, but he has a mansion there... yes, he has mansions all over the place.",
   "created_utc": 1692338670,
   "score": 0,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwon0bh",
   "message": "Because its his money and he does not have too. If i had 163 billion i wouldnt give a damn what people thought about me granted id donate a lot of money to fix hawaii and then launch a charity to save the animals in hawaii because i love animals.\n\nThe real question is:\n\nWhy dont we the U.S. use our tax payer money to fix it? It is the money the government takes from us to \"improve\" the U.S. and such. These kind of events are what the tax money should be used for. As a country we shouldnt go to individual citizens and hope they donate money to save people, and their state. We should be demanding the government does. They have more than enough.",
   "created_utc": 1692337240,
   "score": 0,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwopm40",
   "message": "Because rich people don't care about us.",
   "created_utc": 1692338997,
   "score": 0,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwourm5",
   "message": "He doesn't have an evil reputation.\n\nAnd he’s not a piggy bank either.",
   "created_utc": 1692342744,
   "score": 0,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwoelf5",
   "message": "Because he's evil?",
   "created_utc": 1692332130,
   "score": 253,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwooy6p",
   "message": "Why should he Jeff bezos has always been doing good stuff unlike your lazy ass complaining about him not doing something get a fucking life asshole",
   "created_utc": 1692338545,
   "score": 254,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwo3qg0",
   "message": "He gave 100 million...sure, it's big, but not so much when you consider his net worth. 4 bill isn't a huge dent, would probably be made up pretty fast too. And, it would be BIG news, probably boost his popularity and business for a couple of years. Sure, I'd still think he's a douchebag, but damn...the gesture might even soften me a bit for a few months...against my will. It would be unprecedented.",
   "created_utc": 1692326568,
   "score": 252,
   "submission_id": "15u7ufv"
  },
  {
   "comment_id": "jwof9cx",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15u7ufv"
  }
 ]
}