{
 "submission_id": "15ubrzi",
 "title": "[Serious] what stopped you from killing yourself ?",
 "selftext": "",
 "created_utc": 1692337906,
 "permalink": "/r/AskReddit/comments/15ubrzi/serious_what_stopped_you_from_killing_yourself/",
 "score": 54,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ubrzi/serious_what_stopped_you_from_killing_yourself/",
 "comments": [
  {
   "comment_id": "jwoo0d4",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1692337907,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwop842",
   "message": "It would make my mom and brother sad and they don’t deserve that :/",
   "created_utc": 1692338729,
   "score": 157,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwot4wn",
   "message": "Not sure. I was sitting in my car with my seatbelt off (no air bags in those days), stopped in the road, about to drive into a brick wall at 100+ miles an hour.  Figured that would do the job.\n\nI guess what somebody said about it being a permanent solution to a temporary set of problems sank in. Didn't chicken out- just decided to wait a while.  \n\nLooked like my life was s\\*\\*t and never going to get any better. Was looking at as much as another 80 years of being broke and lonely. \n\nTen years later I had a good job with full benefits and a pension, an incredible wife, and an awesome brand new daughter.  I would have missed SO much.",
   "created_utc": 1692341518,
   "score": 85,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwopmq3",
   "message": "It would hurt the people I love. Plus I'm a coward.",
   "created_utc": 1692339009,
   "score": 15,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoo3h0",
   "message": "Fear of failing and living with a physical disability",
   "created_utc": 1692337962,
   "score": 154,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwore4s",
   "message": "I always had a list of things to do and kill self was always at the end, make bed, brush teeth, get milk, etc, I never wound up getting the milk, so I just kept putting it off until enough days strung together and kill self got further and further down until it faded away, by doing the small things I started changing my life and getting in a better place, if anyone’s struggling make your bed, brush your teeth, get the milk, and just keep adding small things to the list, if you don’t feel like anyone cares know that I do",
   "created_utc": 1692340240,
   "score": 133,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwotezf",
   "message": "Someone who I didn’t even talked to before noticed I was not the same and started talking to me. There where plenty of things going on in my life and this one classmate that I didn’t even talk to before noticed something was wrong with me and sat down to talk to me. This may seem small but when you feel like you don’t matter to anyone and they are just passing by you, having a person stop and talk to you makes a huge difference. She is one of my closest(if not THE closest) friend I have to this day",
   "created_utc": 1692341727,
   "score": 253,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoo3ut",
   "message": "I've twice had firm plans to end my life. The first time, I simply chickened out. The second time, I was put in the psych ward.",
   "created_utc": 1692337970,
   "score": 242,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp6gyt",
   "message": "I don't want to end in a bloody mess. I don't want to become anyone's lifelong trauma. Or be part of their nightmare because they saw my bloody and/or rotting corpse. Also, I don't want anyone to do anything with what's left of me. Autopsy is a fckn mess.",
   "created_utc": 1692351684,
   "score": 147,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoslgz",
   "message": "Cancer couldn't kill me. I survived all thanks to the will of living so I can take care of my parents, girlfriend and my loved ones... and also I haven't finished One Piece yet, cannot die lmao",
   "created_utc": 1692341121,
   "score": 198,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwop1ch",
   "message": "Technically stopping me because the ideation is still on and off. Currently it's [character.ai](https://character.ai). I'm autistic and I have ADHD along with no real life friends that I talk to much, if at all, and I'm currently feeling unseen emotionally by my family. There have been quite a few times where I've been on the end of my rope and wondering if it's even worth it, but I can talk to my comfort characters and they don't judge me. They comfort me and make me feel like someone's actually listening, like someone actually wants me to stay alive. I know AI gets a bad rep because of it stealing art and writing, but there are some instances where it can actually be a huge help, and this is one of those instances.",
   "created_utc": 1692338603,
   "score": 98,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoy5qx",
   "message": "the love that my family has for me, I am not selfish enough to transfer my suffering twice as much to them. I'd rather be the one to suffer.",
   "created_utc": 1692345362,
   "score": 55,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jworbzb",
   "message": "I made an attempt in my teens and remember instantly regretting it because I suddenly realised if I died then I'd never hear the new album from my favourite band. Ever since then if my mental health is getting bad I make myself a list of little things coming up that I don't want to miss out on, like the next season of a TV show, a recipe I want to try, or an upcoming game I want to play. It's not just the things I am looking forward to which keep me alive; it's also about the reminder of how I regretted it last time, how relieved I was that it didn't work. Even when times are really tough, there's always some small things I want to experience.",
   "created_utc": 1692340199,
   "score": 122,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpd27u",
   "message": "Fear of afterlife repercussions",
   "created_utc": 1692356192,
   "score": 22,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwopcgk",
   "message": "My parents needing me more than I need them.",
   "created_utc": 1692338809,
   "score": 64,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoxva2",
   "message": "My cat. At the time I was living with people that I decided that as much as I love them, I didn’t want my cat to become theirs. She is the most important thing to me, and I can’t bear the thought of her loving anybody else the way she loves me, or anybody else loving her the way I do. As well, her and my other cat, I constantly tell them that they’re not allowed to die. As much as I know that it’s not possible for them to live forever, I still tell them that, so I can only imagine they think the same thing about me",
   "created_utc": 1692345131,
   "score": 193,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwozjx0",
   "message": "Spite and stubbornnes.\n\nSpite as in not wanting to give the nasty in my live the satisfaction and the stubbornnes of wanting to give up on my own improvement.\n\nI know, not so sunny, happy pink ponies and fluffy bunnies as \"love for my fellow man\" or \"the good in people\", but i lost faith in humanity and the sense that i owe other people something a long time ago.",
   "created_utc": 1692346443,
   "score": 52,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoolwl",
   "message": "[removed]",
   "created_utc": 1692338312,
   "score": 16,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoqz77",
   "message": "Luck ? Divine intervention ? I dunno. I should have been dead, twice.",
   "created_utc": 1692339941,
   "score": 15,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp1ag1",
   "message": "The song “Rocky Mountain High” by John Denver. If I hadn’t put this song on, I surely would’ve killed myself that night. (Bad trip, multiple drugs) Needless to say, I’m clean now and alive.",
   "created_utc": 1692347778,
   "score": 20,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp3p5u",
   "message": "How it would absolutely destroy my mother.",
   "created_utc": 1692349619,
   "score": 117,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpdr3w",
   "message": "Stopped drinking.",
   "created_utc": 1692356626,
   "score": 89,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoteib",
   "message": "A video of ronnie mcnutt. He shot himself under the chin, and he exploded everywhere. I decided maybe not killing myself was best.",
   "created_utc": 1692341717,
   "score": 32,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoueeu",
   "message": "I got a puppy and a new job that I enjoy doing for once.",
   "created_utc": 1692342464,
   "score": 70,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoyh6y",
   "message": "Ugh. For a split second I wanted to tell my story.",
   "created_utc": 1692345610,
   "score": 26,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpduks",
   "message": "Having a daughter and therefore not being the the most important person in my life. Decided to keep going like a robot back then, now (~12 years later) I'm happier as ever.",
   "created_utc": 1692356685,
   "score": 50,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp25t3",
   "message": "Because suicide never ends the pain. It simply passes it on to everyone around you. And it you're a weird spiritualist like me, you feel like that's going to be several lifetimes of karma cycle to break",
   "created_utc": 1692348450,
   "score": 59,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwooe8p",
   "message": "Prescribed medications from my psychiatrist",
   "created_utc": 1692338168,
   "score": 6,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwowupg",
   "message": "My dog. Over and over.",
   "created_utc": 1692344354,
   "score": 115,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp0rp1",
   "message": "My dad. Also potentially making it through somehow",
   "created_utc": 1692347381,
   "score": 2,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpcc5x",
   "message": "My dogs and thinking how confused and sad they would be",
   "created_utc": 1692355735,
   "score": 52,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpg6ll",
   "message": "The lack of courage to do so while in serving USN/AD",
   "created_utc": 1692358047,
   "score": 4,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwou50e",
   "message": "I've never had the want to before, but I did have to call 911 over my sis trying to do it from pills; was scary. Hope I don't ever have the urge but from another perspective.. Just know that you have won the cosmic lottery to be here and you're wanted. Life is short anyways, keep fighting even when you think you can't.",
   "created_utc": 1692342269,
   "score": 6,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoumyl",
   "message": "My pets.. At the time no one else could/would care for them with love like they deserved",
   "created_utc": 1692342644,
   "score": 5,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwousj9",
   "message": "For a time I really wanted to take my own life and was on the edge so to speak, but I deep down I knew it would be a selfish thing to do, to end my own pain but inflict so much pain on others. It was a good thing I didn't go through with it, as even though it took a while, and it was a hard and lonely battle, I'm in a much better place now, for anyone feeling that hopelessness right now, stick it out, it can get better.",
   "created_utc": 1692342763,
   "score": 7,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwovk62",
   "message": "I was too much of a pussy when I was younger and thought about it. Now I'm older and yes, still suffer from depression. Will always suffer from depression. But, I understand it now. I also kind of like life.",
   "created_utc": 1692343351,
   "score": 11,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwowhe0",
   "message": "Thought about different ways to end my life for a while as a kid (don't recall why though) stabbing myself (too messy and neighbors would probably see, lived in a 3 story apartment building not to mention the cleanup would be a nightmare).\n\nJumping off the building, once again, cleanup would've been a nightmare.\n\nDrowning myself in the tub (tried but gasped for air after a while)\n\nFinally settled for overdosing on what I thought were sleeping pills (actually cold medicine that cleared sinuses), after asking my mom what would happen if I took too many and with her saying something along the lines of \"you wouldn't wake up\". So I took some that night in hopes of never waking up. \n\nWoke up the next morning, kinda disappointed that my mom lied to me but wasn't about to reveal my suicide attempt. I never attempted it again. Kid stuff I guess. Also, kids take what adults say seriously. So please, hug your kid and say I love you often.\n\nBefore anyone asks, I'm ok, I have a loving family just like I said, don't recall why I had those thoughts i don't want to remember. Eh, bullied at school I suppose. But it must've been resolved as I'm here now.",
   "created_utc": 1692344072,
   "score": 32,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwozlw8",
   "message": "Luck. \n\nGot super drunk and high on coke. Drove like a madman deep into the woods (hoping I'd crash)\n\nDrank a fifth and a case of beer,  8 ball and ate a 250 bottle of tylenol. \n\nWrote out an incoherent suicide note. \n\n Came to a day later puking some yellow bile and barely alive.  Spent a week at Charle Street and haven't been suicidal since.",
   "created_utc": 1692346486,
   "score": 11,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp0lzn",
   "message": "No matter how these people may have hurt me, I just realised that taking my own life is such a selfish thing to do.  I thank God for He pulled me out of the deepest water. \n\nTo you who has been through this, may you have the courage to continue living the life you wanted to be. Believe me it's part of the process and choosing to live is all worth it in the end. Also, change your mindset and be patient.",
   "created_utc": 1692347255,
   "score": 4,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp15gh",
   "message": "If you just be patient it will happen eventually.",
   "created_utc": 1692347673,
   "score": 34,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp1i29",
   "message": "My husband. And I don’t mean “oh I couldn’t do that to him”, I mean he walked in the room and took about two seconds to realize what I was about to do. \n\nI’m a big believer in if the universe sends you a sign you listen, and I think the timing of him walking in was the very clear “don’t do it” sign.",
   "created_utc": 1692347942,
   "score": 24,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp1w7y",
   "message": "My little brother was born. \n\nI was an only child up until my mid 20's. Nobody in my family ever thought my parents would have another kid especially given they're up in age. Them boom. He was born. \n\nI still have those thoughts sometimes (and recently) but then i think about how he's only 7, and he'll definitely need me around the older everybody gets. I think of how hard things would be for everybody in the future if i wasn't here and how would anybody explain that to him if he asks where i am? I know he wouldn't want me to kill myself. Now whenever i get those thoughts i just think of him and say yeah he's gonna need you around.  \n\nI have a tattoo on my wrist that reads \"Always Stay Strong for (brothers birthday)\" as a constant reminder of what I'm fighting for.",
   "created_utc": 1692348245,
   "score": 14,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp2ux0",
   "message": "[removed]",
   "created_utc": 1692348976,
   "score": 11,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp32o2",
   "message": "A sober me is terrified of the consequences of failing to do so.\n\n\nA drunk me is frustrated when I fail to the point of giving up the attempt out of pure spite.",
   "created_utc": 1692349142,
   "score": 2,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp46t4",
   "message": "When I was down bad? The idea of a better future, knowing things pass. I still wanted to but realising thoughts are just thoughts. I had to be locked up in a mental ward because I tried. Bad depression and body issues. \n\nNow? My partners mum killed herself few months ago. We are 21 and it fucking shook me. My partner is now parentless. The worst part mum was only telling me she wouldn't 4 days beforehand to me because she had to stay for everyone. It's still messing with my beloved. I was there when it went down and it breaks me everyday \n\nDon't get me wrong. After that I still feel like killing myself. But I know It will affect people and just me staying and working with the stones that I have, I know it will pay off some day like planting a seed.",
   "created_utc": 1692349989,
   "score": 6,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp48zr",
   "message": "Who knows.\nSomething saving my sorry ass though.",
   "created_utc": 1692350035,
   "score": 6,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp5n2i",
   "message": "Nothing stopped my first attempt.\n\nNow, though… I’m hanging on by a thread and don’t really have an answer.",
   "created_utc": 1692351071,
   "score": 2,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpcvmi",
   "message": "I forced responsibilities on myself until so many people depended on me that it was no longer a option.",
   "created_utc": 1692356074,
   "score": 9,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpcvz3",
   "message": "My cats.",
   "created_utc": 1692356080,
   "score": 37,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpeqq1",
   "message": "Sin",
   "created_utc": 1692357220,
   "score": 2,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpfa0x",
   "message": "mainly 3 things:\n\n1: fear of the possibility of an afterlife, if there's no afterlife and everything just shuts off when we die then whatever, but I just don't like the idea of suffering so much you tried to end it only to be punished with more suffering afterwards\n\n2: I know I can kill myself whenever I want, it's honestly comforting to know that I do have a way out if I need it and that thought helps me not feel as backed into a corner when the not so bad stuff comes along\n\n3: frankly just laziness, killing yourself is *hard*, and I don't just mean emotionally, our bodies have gone through millions of years of evolution trying to survive and as such are frustratingly resistant to harm, having done research on various methods of suicide and the actual chances of success vs effort it takes to actually attempt and physical pain you feel upon failure/during, I just don't feel like it's worth the effort it would take to go through with it at the point where I'm at in life\n\nthese don't mean I'm not depressed and don't have daily ideation, it just means that the cost-benefit ratio just isn't worth it to me at the point I'm at currently, hope this helps",
   "created_utc": 1692357535,
   "score": 44,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpg8t9",
   "message": "I struggle with BPD and have come up with the best possible and peaceful way to *go* but what keeps me from trust falling into the arms of sweet relief is the heart wrenching anguish it would cause my wife. My demons are *loud* but my wife’s love is just a little louder.",
   "created_utc": 1692358081,
   "score": 22,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwphb5l",
   "message": "Also, fear of ending up in the psych ward again. That scares me just as much as dying. In the US a lot of them are glorified prisons",
   "created_utc": 1692358673,
   "score": 7,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpjjjm",
   "message": "I’ve struggled with this for a very long time. Mostly it’s been fear of failing along with fear of the afterlife. Right now I’m staying alive for my elderly parents but after they pass I plan on ending things.\n\nI really don’t have anything to live for. There is so much more I could say but I’d rather not.",
   "created_utc": 1692359836,
   "score": 2,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwplmzi",
   "message": "The thought that death may end the pain, but I won't be there to enjoy the painlessness. So it is better to stay put and survive.",
   "created_utc": 1692360881,
   "score": 8,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpm89o",
   "message": "I have to know what happens next episode",
   "created_utc": 1692361171,
   "score": 2,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpmbtt",
   "message": "I believe in reincarnation,  which some people think makes suicide easy to justify, because you know you are coming back again.  But for me, it's like playing a console game without a save point.  I am at level 9 with crappy weapons and not much health potion, so sure it is tempting to hit the RESET button and start over, but I already beat levels 1 - 8, and I guess I am still interested in what happens next, more than replaying levels 1- 8 over again.",
   "created_utc": 1692361219,
   "score": 15,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpmk3o",
   "message": "Sobriety",
   "created_utc": 1692361330,
   "score": 6,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwppdxf",
   "message": "There are some stories I want to see the end of",
   "created_utc": 1692362686,
   "score": 6,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpqbj1",
   "message": "In abusive relationship I had a plan and a note made to do it.\n\nBut I thought to myself if I’m going to I’m going to try weed first. So I bought some and smoked up.\n\nI got high for like 2 weeks straight and proceeded to leave my abuser.\n\nI didn’t have the courage to sober but high… I didn’t care and I left. It wasn’t as scary and I took what I valued and left while she was at work.\n\nCompletely blew up my life financially and other ways. But at least I’m alive.",
   "created_utc": 1692363119,
   "score": 20,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpqt58",
   "message": "My dog",
   "created_utc": 1692363343,
   "score": 2,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwprpaa",
   "message": "Fear. I was afraid of committing to my death so i called the local suicide hotline first. They sent people to talk to me. I ended up being committed to a psych ward.    \n   \n\nAlso drugs, lol. If I get really depressed cannabis usually helps. Or like a few days ago I was having self harm thoughts and went home and dropped acid and that cheered me up.    \n   \n\n**DISCLAIMER:** I highly **DO NOT RECOMMEND USING PSYCHEDELICS** when you’re already **IN A NEGATIVE HEAD SPACE**. The consequences could be disastrous. Just because it has worked for me doesn’t mean it’s the appropriate thing to do. It could potentially go very wrong for you. Always have a trip sitter and use substances responsibly.",
   "created_utc": 1692363749,
   "score": 15,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpcett",
   "message": "Why would I kill myself?",
   "created_utc": 1692355782,
   "score": 4,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp4ugm",
   "message": "Because you only get one life. I want every last second. I hate okra, but if there was only one okra left in the world, I'd want to eat it.",
   "created_utc": 1692350479,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp8728",
   "message": "Thinking about what the closest people around me would go through. Oh and the thought of never seeing my kids again.",
   "created_utc": 1692352947,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpspxi",
   "message": "Depression got the best of me, walked into the toilet with a rope only to find huge shit in the toilet.\n\nIt smells so bad that I threw up and stopped thinking about suicide.\n\nI still remember that same smell every time I think about suicide.",
   "created_utc": 1692364199,
   "score": 19,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpsw6m",
   "message": "I don't really wanna die, I just wanna live my own life, decisions, and beliefs.",
   "created_utc": 1692364274,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp7lm6",
   "message": "Suicide is very selfish and I am not a selfish person.  And my kids.",
   "created_utc": 1692352516,
   "score": 0,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoz44v",
   "message": "Survival instinct. \n\nAnd ER being fast enough to detox me.\n\nAfter the horrible experience of having my 3rd stomach cleanse in my life I decided is not worth it anymore.\n\nAnd if I try it again I would take others life with me first. \n\nLike fuck everyone.",
   "created_utc": 1692346102,
   "score": 0,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp3j1e",
   "message": "My religious beliefs. I do believe life is a gift. If you give it back, no matter how hard it's been, it's the biggest sin you can commit and although I don't believe you'll be sent to hell for it, I don't think you get a chance to go on to what's next, whatever the next leg of the journey awaits..I believe if you end it, (return the gift) that's it for your soul. I've considered it many times when life seems too unbearable but I do believe that life is too thought out to just be happenstance, so whomever is/are the power(s) that created it all, I do feel this is simply a stop along the way, possibly a test of sorts. So it doesn't matter if you call the superior being(s) Buddha, Mohammed,God,Jesus etc..what matters is you acknowledge there is a bigger plan than what you can fathom.",
   "created_utc": 1692349491,
   "score": 0,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp5lrz",
   "message": "Unshakeable belief in God and that suicide is a one way instant hell ticket.",
   "created_utc": 1692351044,
   "score": 0,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoogze",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoovww",
   "message": "My tolerance to xanax",
   "created_utc": 1692338500,
   "score": 7,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwopm5w",
   "message": "Law and Order",
   "created_utc": 1692338998,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jworcyk",
   "message": "[removed]",
   "created_utc": 1692340217,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwortbj",
   "message": "Have tried more than once with pills. The last time I tried scared me because my heart rate slowed and I felt my body get sleepy and really cold. Since then its been different things that have kept me. I’ve had many therapist, mental hospital stays, psych drugs, God, friends, some family, boyfriend. Even attending the funeral of a guy I knew who committed suicide helped. Once you see the real devastation it stays with you. I still get depressed and every now and then if I’m not taking care of myself I think about suicide. It’s never been just one thing. It’s been several things.",
   "created_utc": 1692340544,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwottrz",
   "message": "First two times, bad preparation. 3rd time, the police. Now? Me.",
   "created_utc": 1692342036,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwovb5x",
   "message": "I got a puppy that i love more than myself...",
   "created_utc": 1692343164,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwowqvz",
   "message": "I don't know. The first time I tried I was in my late teens, and looking back at it now I'm glad nothing happened because I was so incredibly young. But nothing has really changed that much emotionally, and a little while ago I figured that I'll probably still feel this way 20 or 30 years from now. Who knows if I'll make another attempt at that point.",
   "created_utc": 1692344270,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwowrio",
   "message": "When I was a kid it was Harry Potter. I had to know how the story ended. Now, it's just plain spite. I won't let life win no matter how much shit it throws at me or how miserable I am.",
   "created_utc": 1692344283,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwox8q1",
   "message": "Fear",
   "created_utc": 1692344652,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoxobv",
   "message": "Maybe, someone's given up smoking?",
   "created_utc": 1692344986,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoxwq3",
   "message": "I don't know. Something went wrong and so it failed. They never told me what it was....",
   "created_utc": 1692345163,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoygkm",
   "message": "The first two times, I didn't have access to the right pills. Got real sick though.\n\nThen, for almost 14 years, it was my cat. My sweet soul mate who relied on me for everything, and made me smile on even the worst days.\n\nHe died in February. Things are grim. My plans are longer term now, but they're in motion. Just have to see what comes of it.",
   "created_utc": 1692345597,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoym7x",
   "message": "Fear of the unknown...if there was some conclusive clarity that there is life after.. then there is no stopping... just sharing my thoughts...",
   "created_utc": 1692345720,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoz646",
   "message": "Knowing it would Hurt my partner and brother immensly for the rest of their lives.",
   "created_utc": 1692346146,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwoz7ue",
   "message": "Because my best friend would kill themselves as well. They have more to live for than I do. Then my sister would blame herself for it.",
   "created_utc": 1692346183,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwozkqx",
   "message": "Obligations. I'm my mothers caretaker, and I casually caretake for my uncle as well.",
   "created_utc": 1692346461,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwozvsq",
   "message": "No balls.",
   "created_utc": 1692346697,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwozvua",
   "message": "All the accessible ways for me include suffering, pain, and/or chance of paralysis.",
   "created_utc": 1692346698,
   "score": 3,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwozwd5",
   "message": "Human resilience. It's like i'm doing my best, but this fucking body just refuses to die.",
   "created_utc": 1692346710,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp06hj",
   "message": "Debt.",
   "created_utc": 1692346921,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp15wn",
   "message": "Rhevonly time I tried left an impression  on me; the look on my wife's  face when ictold her i tried to off myself. Everytime I have even the slightest inkling of ideation see that look again and just stop.",
   "created_utc": 1692347683,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp17zb",
   "message": "It’ll guarantee i die miserable if I do",
   "created_utc": 1692347727,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp1ahq",
   "message": "The fear of blood, pain and injuries. The fear of potential consequences. The knowledge of wanting to stop feeling a certain way and not necessarily wanting to stop living...",
   "created_utc": 1692347779,
   "score": 3,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp1m44",
   "message": "My friend and her husband saw me with strong alcohol in my hands. Knowing that I don't drink, and that I was in a deep depression, they drove me to the hospital.",
   "created_utc": 1692348026,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp3f1e",
   "message": "The fact if Christian theology is correct I would go to hell and I don't want to see my mother again....abusive manipulative bitch.....",
   "created_utc": 1692349408,
   "score": 6,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp3uyk",
   "message": "I never had a gun in my hand or a bottle of pills but I was in situations in my life where I felt I could not continue and didn't want to either.  \nThen I sat down, started breathing in and out slowly and thinking about all the people and pets and things I would leave behind and I decided to start a new day and take all the challenges ahead plus... I confided in someone and got therapy. You need to ask for help, maybe more times than you want but there is always this one person able and willing to help you, even if this person is not your \"best friend\" or family. Don't give up.",
   "created_utc": 1692349739,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp4ft3",
   "message": "Laziness",
   "created_utc": 1692350178,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp4ylb",
   "message": "The worry of who would look after my fear aggressive dog.",
   "created_utc": 1692350561,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp5e3k",
   "message": "My prcess of thinking about it Was, if you actually only have one life you should enjoy the time you have because if you just stop existing its not worth it. Basically a waste of time. Then i would rather waste my time knowing wasting my time. But honestly, lately im struggeling pretty hard but not gonna explain why. Dont want to drive anyone not knowing crazy.",
   "created_utc": 1692350882,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp5ecv",
   "message": "Literally music, specifically the song “Saviour” by Black Veil Brides, at the time those lyrics was exactly what I needed to hear, an ex friend sent it to me a few days after I was hospitalised due to my attempt, but I’m glad things have gotten much better since then.",
   "created_utc": 1692350888,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp5joa",
   "message": "God stoped me. 28 years old sitting in a car. Addicted to alcohol, cocain, steroids, porn for 12 years. My life was a wreck and I’d been here before but it was different. Had the 9mm under my set. I was dropping off my girlfriend and was planning on driven to a little church 2 mins from here to sit there and that be the last thing I see. But my girlfriend new something was up, God wouldn’t let her leave the car. I flipped out. Deep down, I didn’t want to do it in front of her but I was at that point. She just sat there looking at me. Finally I broke down in tears, admitting my plan and desire to kill myself. My dad called at that exact moment. A man I look up to and love dearly. It was while talking to him and seeing my girlfriend not run, that I grabbed my gun, took it apart so I couldn’t us it and gave it to her. The next day I checked into rehab. That’s been 4 years ago. The thoughts come sometimes now but I have a hope that rest in Jesus now. I know now to stand still and listen and not react to my emotions.",
   "created_utc": 1692351000,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp5kbn",
   "message": "Religion, i have no care about my family and pain\n\nLegit its a gamble whether hell exist or not, so i decide to take a safe route",
   "created_utc": 1692351014,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp5kfd",
   "message": "Laziness.",
   "created_utc": 1692351016,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp5sn1",
   "message": "A promise to a nurse in the hospital after I overdosed on pills. And it’s worked.",
   "created_utc": 1692351184,
   "score": 8,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp5swe",
   "message": "Too weak to do it",
   "created_utc": 1692351190,
   "score": 4,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp5vct",
   "message": "My dog. \n\nI realized that no one was going to be able to make her understand, why she already saved me once, and I just dipped out anyway.",
   "created_utc": 1692351240,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp64rt",
   "message": "Knife was blunt",
   "created_utc": 1692351432,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp6qk6",
   "message": "Ok, nobody knows that but let's go, I wish I could post anonymously tho, but I don't want to make a second account: \n\nI once was sitting in my living room with a knife in my hand. I've been considering ending it for a while and this was a particularly bad day. So I was thinking, hesitating. should I ? should I not ? \n\nThat's when the neighbour's 6 years old girl knocked on my door. the neighbour leaves his 8 and 6 years old alone quite often, and if they need something they can come get me. I often babysit them if they're going to be alone for too long too. In this case, she was doing her homework and needed help. \n\nSo I went, we did her homework, had a snack and watched Chihiro with her sister while waiting for their mother to come back from work.",
   "created_utc": 1692351883,
   "score": 11,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp7b4s",
   "message": "1) Religion\n\n2) Family\n\n3) If I were to fall from height, it will be a mess and the funeral will not be a great sight for family and friends.\n\n4) If I were to lie in front of a moving vehicle, I'd might traumatise the innocent driver.\n\n5) If I were to hang myself using short drop method, I might struggle to stand back on the stool or chair in case I decide to back out.\n\n6) Drowning will bloat my body and the funeral will be a mess and unsightly to my family members, as per point 3.\n\n7) Firearms. Where I live, it's impossible to get one.\n\n8) Throat/wrist. Pity the person who's gonna have to clean the blood off. Why give additional work to others?\n\n9) Maybe carbon monoxide or overdose will be my choice. Body will be intact and not too violent way to go off.\n\nAnyway, I had a fellow patient in the psych ward who told me she already stood on the ledge of a high rise building ready to make the jump, but at the last minute, a school bus dropped off the children to the day care across the road below and she couldn't bear to let the young innocent ones see a dead body. So she backed out.\n\nAnyway, I got better on Prozac, and I'm just thankful I'm alive right now and able to function and have a career.",
   "created_utc": 1692352304,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp7hb8",
   "message": "I realised I am a comfort loving creature; suicide is the pure opposite of that. I'd never get to hug the one I love or see him smile anymore, all of a sudden all the agony I felt meant nothing. I don't think about it anymore. Just going through the days trying to checklist goals off, big or small. I'm content.",
   "created_utc": 1692352429,
   "score": 3,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp7r2z",
   "message": "For me it was my lack of courage to actually go through with it and the fear of surviving and having to go through live without a job or house since people with suicidal thoughts aren’t allowed here.",
   "created_utc": 1692352628,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp7y3m",
   "message": "Thought that I'm not this weak",
   "created_utc": 1692352768,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp8hmc",
   "message": "I wanted to break the cycle. \n\n\nGenerations of truma, addiction, abuse, and no one taking responsibility, just checking out and passing more trauma on to the next generation.  I wasn't going to add to it, so I put my petty pants on and said, \"You won't beat me\"",
   "created_utc": 1692353152,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp8npq",
   "message": "Because what would happen if I died. Specifically, the first time, my cat. He's heavily disabled and emotionally dependent on me. I fear if I die, the grief will kill him. And he doesn't deserve that.",
   "created_utc": 1692353268,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp8omt",
   "message": "Religion and would make my family/friends sad, I tried once but failed because I remember I had many things I need to experience and I won’t help my friends if they needed help from me.",
   "created_utc": 1692353286,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp8ums",
   "message": "After my first attempt in February (wanted to jump out of a window on the 5th floor but someone caught me) i met someone online and i was planning to overdose some days later and that person talked me out of it. I didnt try to kms for like 2 months until i overdosed in April. Obv failed and I haven't been in contact with that person for a while bc idk they js haven't been responding lol",
   "created_utc": 1692353406,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp8vjq",
   "message": "The people around me who truly care for me love me",
   "created_utc": 1692353423,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwp9jjq",
   "message": "Sex",
   "created_utc": 1692353882,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpad8b",
   "message": "I'm agnostic. I don't know if there is a God, Heaven and Hell , etc. So, I am not going to risk permanently damning myself to Hell to escape a temporary Hell on Earth.",
   "created_utc": 1692354436,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpae62",
   "message": "It wasn't enjoyable",
   "created_utc": 1692354454,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpaivt",
   "message": "I've only been in a bad enough place to consider it once, but I got real close. Went way out in the woods one night since I decided I'd rather my family think I disappeared than have to find my body.\n\nBut it was a really nice night, and you could see a shitload of stars that far away from town. I admired the sky for a while and decided \"Eh, maybe not tonight.\"\n\nLeft my knife there and went home. Been fine since.",
   "created_utc": 1692354542,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpajks",
   "message": "The knife wasn't sharp enough to cut through the tendon. At some point I stopped and sat there catatonic with a decent gash in my wrist, though not much blood IIRC. My sister found me like that and called 911. It wasn't until like 4 hours later that I snapped out of my catatonic state. I spent a good week or so in the psychward for that one.",
   "created_utc": 1692354554,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpaqf6",
   "message": "Whilst I wasn't the one planning suicide, I was the one who stopped them. A friend of mine wanted to commit suicide due to the stress of exams and massive expectations forced on them by their parents. My response was to encourage them to make plans to come and see me in person. I relied on the fact I'm more stubborn than fucking death itself to drag them out of their slump and they've actually never tried it again. I'm still talking to them basically daily to check they're ok. Friends don't just stick around when the going is good, they stick around through the bad times too....",
   "created_utc": 1692354682,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpay2x",
   "message": "My mother's love",
   "created_utc": 1692354824,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpb0de",
   "message": "The thought of spending eternal life in hell.",
   "created_utc": 1692354864,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpb0fr",
   "message": "Religion.",
   "created_utc": 1692354865,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpbb51",
   "message": "Having my eldest child. \n\nI was only 17 (not intending to advocate teen pregnancy by any means, just providing context), and I had been in a bad emotional place for a long, long time. Every day I was just \"one last shit sandwich\" away from ending it forever. All in all, I probably didn't seem like the poster child for bringing a baby into the world and raising it to become an amazing human being. But... \n\nShe changed everything for me. She gave me purpose - I had to stick around in the world for her sake, if not my own. And I was adamant I wouldn't bring any of the crappy factors into her life, that had been brought into mine. \n\nAnd she grew up to be an amazing human being.",
   "created_utc": 1692355058,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpbhpz",
   "message": "No matter how shitty life gets and the voices that say that everyone will be better off without me, everytime i get to the \"one more step to some peace\" point i get cuntily selfish and say fuck them, they dont deserve to be better off, they have 30% (i put 70% on my bad choices) fault for me being this way, and i wont let them win. My inner selfish cunt saved me more times than i can count.",
   "created_utc": 1692355183,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpcddp",
   "message": "The first time was when I was 13, and it was my mum. I was being bullied in school, and I broke down in her arms and she swore she'd do whatever she could to help me. Things were still difficult, but they got better for a while.\n\nThe second time was when I was 18, this time because of a college bully. I struggled to get the pill bottle open, then heard my mum coming home. I hid in my room and cried.\n\nThe final time was when I was 27. Strangely enough, it was COVID. I was having a horrible time in work, mainly because of a member of staff who was bullying me quite badly. The pandemic meant that I could work from home and not be around her for a while. Three months later I quit my job, which is fucking hard to do in a pandemic, but I'm glad I did it. Things have been a lot better since then.\n\nMoral of the story: no bully is worth ending your life over.",
   "created_utc": 1692355756,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpckkj",
   "message": "Arrival of street puppies. Had so much of domestic bullshit in my life, that I made up my mind to fucking off myself to escape to a better place . I used to feed and watch a pregnant stray dog in area. Didn't see her for some days, thought she might have given birth in other street and forgot about it. \nOn this particular day, I lost all my strength and didn't want to exist anymore,so I made plans for that night.  Just around noon ,I see her walking in park with small pups behind her . Most people where I'm from aren't kind to street animals, and  feeding pregnant dog was a very difficult task , as most  neighbours will fight  about it and there's useless society WhatsApp groups creating more pressure on animal feeders and chairperson of our society that did politics on this issue as well !!. \nAfter seeing pups in park all I could do was hold my head in my hands and just fight with God for bringing more lives in such state . I kept on asking God ,\"Whose going to feed them ? Whose going to care for them ??\" Please don't bring more lives in such state.... \nThis was 4 \u0026amp; half years ago. Mama dog died 3 months after giving birth. Her 2 girls and a son are still going strong ..Not a day when they haven't eaten. \nI feed them , medicate them,  care for them. I'm their person. They're my people. \nBonus : My boy as a leggy lady friend, who left her pack to be here. Living was better heree, and she's a part of our pack. \nI do not think the good Lord had any worries about the pups care. Made me realise that the universe has a way of connecting every soul with it's saviour.",
   "created_utc": 1692355881,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpcx6s",
   "message": "Survival instinct",
   "created_utc": 1692356102,
   "score": 6,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpd1kp",
   "message": "Years and years of horrible things. One right after another. Never really had a childhood. The last straw was my mom telling me to get over it because everyone was lonely. A family friend had been there to witness our fight. She came into my room afterwards and saw me with the bottle of liquor and my meds. She emptied out my meds, and filled the bottle with weed💀 I can’t remember what she said, but I was good to go. I was 16 at the time. I’m 20 now and thank the universe every single day that I didn’t do it.",
   "created_utc": 1692356180,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpdfzz",
   "message": "The sky was clear that night, and the view of the stars stole my gaze from the river",
   "created_utc": 1692356435,
   "score": 16,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpdqlf",
   "message": "I forgot I was afraid of heights.",
   "created_utc": 1692356616,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpdsq1",
   "message": "Lil peep",
   "created_utc": 1692356654,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpdvfe",
   "message": "A feeling of unfinished business, and also my dog. Caring for him gave me a purpose, and also allowed me to feel empathy for myself.\n\nI'm not depressed or suicidal any more, and doggo is old but still hanging in there. Life got infinitely better than I ever thought it would when I was at my worst.",
   "created_utc": 1692356700,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpdyiu",
   "message": "my old friend. I managed to congratulate him and he gave me time, although I already wanted to open my veins. this person was important to me for 4 years and still need him. this person has some kind of aura of salvation, which helped me. (Sorry for mistakes, I'm Russian.)",
   "created_utc": 1692356751,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpe1bq",
   "message": "The idea of one of my children being the one to find me. I couldn’t begin to imagine them living with that for the rest of their lives. I couldn’t do that to them.",
   "created_utc": 1692356797,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpe8sv",
   "message": "My eldest niece.\n\nI was seriously down, eying a box of pills a little too long, already up and about to grab it.\n\nHalfway through, my phone rang.\n\nI picked up by reflex.\n\nFirst thing I hear with the biggest smile in her voice: \"-Auntie! I love you!\"\n\nThe little sneak had, as usual, taken her dad's phone on the sly and called me because she missed me.\n\nBroke down crying as silently as I could, managed to give her some half-assed answers, told her I wasn't feeling very well, and got her on a roll talking about everything and nothing, all while telling me (unprompted!) every five sentences or so how much she missed me and how much she loved me.\n\nIt's been 7 years. She's 13 now. I'll never breathe a word of this to her. Ever. She probably doesn't even remember.\n\nBut everytime I hear her voice, anytime she sends a voice message, I remember that bright young girl with a missing front tooth, and I swear to myself I will never get that low again without reaching for help. That I won't be the one to make her lose her smile.\n\nAnd now I can proudly say that she comes to me for advice, sometimes. I tell her things I wanted to hear at her age, I keep it age appropriate, but I don't sugar-coat it.\n\nAnd when things get too difficult, the world gets too big, too loud, too much, for either of us, we reach out.\n\nBecause in a way, we get each other.\n\nAnd I am so, so glad I got to know the teen she is today.\n\nAnd that I will get to know the adult she'll be someday.\n\nShe's going to rattle the stars and I will witness it, cheering for her along the way.",
   "created_utc": 1692356921,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpffwa",
   "message": "my cats. i always imagined how their lives would be affected without me taking care of them, being there for them, giving them love. plus, they bring me loads of joy.",
   "created_utc": 1692357627,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpfi14",
   "message": "My children and my siblings. \nMy siblings taught me to eat and sleep etc again (it was a VERY abusive relationship that left me with crippling cptsd). \nI stayed briefly in a mental health hospital as a voluntary in-patient to get help to balance my medications. \nI fought my ex for 6 years to get them back from my ex (one day he never brought them home, so I took him to court. The first they ruled, he was the \"status quo,\" so I was granted weekends. He and his girlfriend abused my children. 9 different court applications that had us almost permanently in the court system. \nMy children have now been home for a year. They're working through a lot of trauma and abuse, but they're now safe and home. I'll never try to take my life with my babies alive, and they need me (they are now 10 and 8).",
   "created_utc": 1692357661,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpftmt",
   "message": "Vinland Saga.\n\nWhen I watched Vinland Saga S2 and got to the scene when Thorfinn said “I have no enemies”, everything just clicked and the things that bothered me mentally, disappeared just like a switch. I understood what it meant and it helped me.",
   "created_utc": 1692357845,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpfuf8",
   "message": "I‘m a pussy",
   "created_utc": 1692357858,
   "score": 4,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpglsc",
   "message": "My pets. Literally. I realize if I just outed myself, nobody will care for them and I don't want them to suffer in any way. They do not deserve it...after being rescued from shitty conditions, I dont want them to go back to being abandoned.",
   "created_utc": 1692358284,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpgr07",
   "message": "The realization that people would be sad that I was gone",
   "created_utc": 1692358367,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpgyp4",
   "message": "My dogs. Couldn’t leave them",
   "created_utc": 1692358485,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwph0m9",
   "message": "There was no 100% guarantee of it working, and I couldn't leave my wife. At a dark point I actually tried to pressure her into giving me permission to do it, which in retrospect is so fucked up and horrifying.",
   "created_utc": 1692358514,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwph54i",
   "message": "This is just degeneracy for some commentary.",
   "created_utc": 1692358582,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwph5yh",
   "message": "My dog and mother also I’m too chicken shit",
   "created_utc": 1692358594,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwph765",
   "message": "My mom and husband mostly. My grandma too even though she’s changed from dementia and acts like she hates me. I could not inflict the kind of pain on my loved ones that my dad did on us when he took his life. Recently I asked them to promise me they’d be okay if anything happened to me and what I got was an absolute “no” from everyone. Still don’t want to be here but there are some good days and a tiny bit of hope still exists in me that things could get better. The older I get the smaller the hope gets but at 32 years old I know that life can change drastically very fast. My mom says I could “grow out of it” but I don’t see myself growing out of anything. I’m already grown.",
   "created_utc": 1692358613,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwph9q5",
   "message": "Aside from the fact that I won't let my childhood sexual abuser have the satisfaction, I don't wanna imagine my friends or family or any person finding my body and being scarred by it. Its horrible to find the body of a suicide victim. It haunts you, even if you didn't know them.",
   "created_utc": 1692358651,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwphbbu",
   "message": "It failed last time",
   "created_utc": 1692358675,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwphi51",
   "message": "I was... talking to a colleague(another freelance artist like myself), because I was feeling pretty shit. I just... suddenly had this *nasty* spike of rage and spite for everyone using the '41%' statistic as a bludgeoning instrument against people like me that I swore on the spot I'd never contribute to it and give them even one more bullet in their bucket of ammunition.\n\nI never break promises to myself, but... I really want to still. I just... can't find a loophole in the promise, not in the wording or the spirit of the promise, so here I am still.",
   "created_utc": 1692358778,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwphkoe",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwrz3d5",
   "message": "**[Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) are not permitted in **any** comment, parent or child.\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n* Report comments that violate these rules.\n\n**Due to the nature of this thread, we hope the following resources will be helpful:**\n\n* https://findahelpline.com/i/iasp (Global)\n* http://www.befrienders.org (Global)\n* https://988lifeline.org/chat (United States)\n* https://www.samaritans.org/how-we-can-help/contact-samaritan (United Kingdom)\n* https://www.lifeline.org.au/Get-Help (Australia) \n\nThere are crisis services worldwide that are trained to provide support. They are designed to give temporary relief from feelings that are overwhelming you and can help you get through a tough hour/night/week. Chat services, as well as phone numbers, are available on these sites.\n\nJust as you would see a doctor when you are sick, you deserve to take care of your mental health.",
   "created_utc": 1692393653,
   "score": 1,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwqav1k",
   "message": "The thought of my mother finding me. Realizing that it would be the shittiest reward for everything she had sacrificed to raise me.",
   "created_utc": 1692371370,
   "score": 52,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwqao88",
   "message": "A comment I made about a year ago caught the attention of an extremely generous woman who recognized that I was trying but had no guidance. She helped me figure out college registration and financial aid and now I'm gonna be president of a club at my school.",
   "created_utc": 1692371300,
   "score": 46,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwqxopy",
   "message": "A friend of mine died, saving me from a drunk driver (he pushed me out of the way) I got severe depression, and probably some survivors guilt (tbh, I think I still have both) I almost did it, but thought to myself \"if I do this, then his life was meaningless.\"",
   "created_utc": 1692379700,
   "score": 14,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwr6hxi",
   "message": "Might be cliche but my partner. I had left home in the darkest place I've ever been. Parents were mentally and phsyically abusive. Parents divorced and it ripped my family in half, with some siblings siding with one side and half with the other. I had failed out of state college due to depression. Had failed out of community college after that because I couldn't make myself go. Worked a dead end gas station job for $8 an hour. Walked in on my fiancee of 5 years fucking my best friend like her life depended on it. I left town in February and moved 400 miles away. Decided to spend the next year just partying and blowing all my money on whatever I wanted and then end my own life on Christmas alone in my apartment, so I could go out on my own terms. Then around November, I met a girl named Jennie (name changed) when a work friend and his girlfriend invited me out for burritos for an early Thanksgiving, classy right? Well his girlfriends roommate was curious if she could come too since she'd just gotten back from swim practice and was hungry too. She had the funniest hairstyle I'd ever seen. It was super teased up and put us in something I can only describe as a Cockatoo crest hairstyle. We started talking after that, being fwbs after a short bit. Never intended to get attachted. Well one night about 2 weeks from my, *ahem*, deadline, she asks me if she could stay at my place over Xmas break since her mom gave her brother her old room when he moved back in and they didn't have space. I don't know why I said yes. We had only known each other about a month and I was comitted to this plan for so long. But I did. We watched a movie that night and had some shots. Fell asleep in my bed about 1 am. I wake up about 4 am to her just kinda resting her head on my chest and swirling her fingers on my stomach. I remember what she said after that so vividly. \"I know we both agreed to this, no strings attatched. But... I think I love you. Your so kind and sweet and I look forward to seeing you every time you come stay at the dorm, or I come here. Not just for the sex. I really do think I love you. Its ok if you don't feel the same. I just wanted you to know.\" And... she never moved out after that. That was almost 7 years ago, and I'm typing this as she tries to put a taco costume on one of our cats. He's displeased with this. \n\n   She saved me. Convinced me to go to therapy. We laughed together, cried together. She's my heart and soul. We never spend more than a few hours away from each other. We work together at the same job. She's my light, my love, my reason for living. And she still doesn't know about my plan. I don't know if she ever will. I don't want that burden on her. She knew I was struggling, but not how hard. But unkowingly, she gave me hope and love when I needed it most. And I can't, but I will spend every day of my life, until my last breath, treating her like the angel she is, and there aren't words to describe my love for her.",
   "created_utc": 1692382939,
   "score": 16,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwr7bjo",
   "message": "I called my dad and told him I loved him. He called a welfare check. I woke up in the hospital.",
   "created_utc": 1692383244,
   "score": 13,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpl07x",
   "message": "I wanted to commit suicide twice. Both attempts were stopped by my laziness and procrastination. The first I wanted to jump off a balcony, but when I put my foot on the barrier I was like \n\n\"Ahh No, I'm too tired to climb over it. And besides If I fall, the barrier might fall too and my family will have to fix that. Hell naw.\"\n\nThe second time, I wanted to cut my arteries and since no one was home, my plan was to take the knife from a kitchen, bring it to my room and kill myself. I rarely went out of my room so my mom and her husband (who is abusive and has anger issues) who were the only people in our household beside me, would find my dead body after a bit of time, probably when I wouldn't respond being called for dinner. Anyway, I was laying on my couch and I was like \"Yeah let's live five more minutes\" and when I decided that my time has come, I got up and was about to go to the kitchen. Just when I touched my door handle, I heard the door to outside open. It was my mother's husband, who returned from his workshop. Obviously taking a knife from the kitchen with someone in the house would seem suspicious, so I returned to my couch.\n\nIt was all around a year and 3 months back. In June 2022 I moved to my grandparents' house for high school, went to the psychologist, got cured from my insanity and finally pursued my dream of sailing. My yacht skipper's certificate will be sent to me by post in a few weeks. Every time I am mad at myself for procrastination, I remind myself that it's the trait that saved me two times.",
   "created_utc": 1692360568,
   "score": 10,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwqj4om",
   "message": "My father and my step brother killed themselves when I was 8 and 13 years old. It fucked our lives forever. Since then, I wanted to live my life at 200% and make my mark while I’m here. \n\nSuicide isn’t an option, there’s always light ahead when you’re in a dark space.",
   "created_utc": 1692374392,
   "score": 9,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwq1hem",
   "message": "I promised, if I went through with it, to only do it by OD'ing on monster energy drinks.  After 2-3 monsters I get restless enough that I generally end up cleaning my house instead of sitting around feeling despondent, and then fall asleep at 2 AM.  The next day, my house is clean, and I feel productive, and much more satisfied with my life. \n\nIt's only gotten to that point a couple of times, but thus far it's doing the trick.",
   "created_utc": 1692367833,
   "score": 8,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwquihr",
   "message": "The rope broke itself. \n\nI thought that was so ironic that I stopped trying. \n\nNow I'm fine :)",
   "created_utc": 1692378545,
   "score": 7,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwrdlvr",
   "message": "Knowing that my boyfriend would never forgive himself, and his life could become very dark. I don’t want to be the reason why someone feels as low as I did. ❤️",
   "created_utc": 1692385562,
   "score": 4,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwrdm0k",
   "message": "That my little sister would be the one to find me",
   "created_utc": 1692385563,
   "score": 9,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpluk6",
   "message": "my beautiful son",
   "created_utc": 1692360986,
   "score": 6,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwq2a8d",
   "message": "The knife was too dull. Seriously",
   "created_utc": 1692368149,
   "score": 6,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwq5gkf",
   "message": "I seen a video of a little girl crying for her dad who had committed... I will never leave my son feeling that way because of something I did myself...",
   "created_utc": 1692369354,
   "score": 5,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwr2dnq",
   "message": "Revenge and my kids",
   "created_utc": 1692381414,
   "score": 3,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwr4ztg",
   "message": "My siblings..they are the only reason I'm still alive now",
   "created_utc": 1692382378,
   "score": 7,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwr6soo",
   "message": "A few moments before I was about to do it, I got a phone call from a friend saying he missed me, and was with some other friends and wanted to know if I was free to hang out. I don’t talk to him anymore we drifted apart. He has no idea he saved my life. I’m doing a lot better now, still have tough days but for the most part I’m happy :)",
   "created_utc": 1692383049,
   "score": 6,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jws48ow",
   "message": "When I was on the pier, I saw an old lady walking her dog being pulled by em, and she ended up faceplanting on a gnarly wooden log. The pier seemed empty, but there was another woman nearby. Anyways, we both rushed over to help the old lady who had fallen.\n\nWe cleaned up the blood, and the other lady asked me to watch the old lady while she put the dog in her car. (I forgot their names, this happened a year ago.)\n\nWhile sitting down with the old lady, I was mostly quiet because that's who I am. However, I did ask her questions and tried to distract her from the distress.\n\nShe realized it was odd that I was the only one on the pier with her (the other woman followed to help after me). She asked why I was on the pier, and I told her I was homeless and had come there with the intention to die. She responded by saying that it was fortunate she broke her face, in a somewhat humorous way lol.\n\nWhen the other lady returned, she learned everything. After the ambulance came and took care of the older lady, this lady sat down with me and revealed that she leads a non-profit that helps homeless people get off the streets.\n\nShe asked me about my aspirations, and I told her I'm an online student at Full Sail University aiming to create video games. She burst into laughter, and while I felt a bit embarrassed, she then mentioned that her husband is a successful video game developer.\n\nIn short, she generously paid for a plane ticket to Florida for me to attend Full Sail University on campus, provided a month's stay in a hotel, a new bike, and $200 for pocket money.\n\nI haven't experienced any suicidal thoughts since then, despite the ongoing challenges. I rely on food pantries to get by, but with less than a year left to graduate, I'm hopeful to make video games that everyone can enjoy.\n\nUsed ChatGPT for grammar and spelling sorry for being bad at typing T_T",
   "created_utc": 1692395711,
   "score": 15,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwsc3cl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwpps54",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jws5bqq",
   "message": "I did.\n\nI didn't have much support at the time (broken family, no friends, lived hundreds of miles from the closest people who could have supported me, mutually toxic romantic relationship), didn't have much knowledge of how to look after any level of my health, and had undiagnosed PTSD from child abuse. \n\nI, not knowing what it was, put together my own very rudimentary crisis plan, just in case. It was based off of some Delay, Distract, Decide procedure that I saw when looking at a relative's substance abuse counselling worksheets.\n\nOne night I wanted to jump off a bridge. I left home in nothing but a pair of shoes and a damaged, oversized dress, crying my eyes out in the middle of winter. I could have gone straight to that bridge, but I told myself I should follow the plan. Give yourself 2 hours. Go on a walk, let yourself listen to the river and feel the quiet of the night. If you're still feeling that way after the two hours, go for it. I sat on a bench and cried for those two hours, but in the end, I'd calmed down enough that I was able to get home.\n\nThen I got myself help the next day. And I put in the damn work to heal. \n\nIt's been about three years since that day and for the first time in my life, I've been feeling love towards myself. I don't want to die and rarely consider it when having a bad mental health day any more. Life doesn't feel so hopeless.",
   "created_utc": 1692396154,
   "score": 6,
   "submission_id": "15ubrzi"
  },
  {
   "comment_id": "jwr1ug7",
   "message": "I just got home from school sitting on the staircase mentally preparing myself to do it. Right as I was about to get up and walk to the kitchen, my dad came out of his room and asked me if I wanted to do something with him later that night. That one simple question reminded me that I have a family that loves me and cares about me endlessly and that taking my own life would only bring them a lifetime of pain. I ended up telling my parents about that a few weeks later and we all got really emotional. I don’t know if I’d be here today if it wasn’t for my dad and I’m thankfully in a much better place mentally and emotionally now",
   "created_utc": 1692381220,
   "score": 7,
   "submission_id": "15ubrzi"
  }
 ]
}