{
 "submission_id": "15uhmih",
 "title": "Men who don’t consider themselves conventionally attractive, what do you think was the reason your girlfriend (or wife) found you attractive?",
 "selftext": "",
 "created_utc": 1692357230,
 "permalink": "/r/AskReddit/comments/15uhmih/men_who_dont_consider_themselves_conventionally/",
 "score": 17,
 "url": "https://www.reddit.com/r/AskReddit/comments/15uhmih/men_who_dont_consider_themselves_conventionally/",
 "comments": [
  {
   "comment_id": "jwpf76u",
   "message": "It’s because I’m funny. My wife is a 10 and I’m a middle age overweight man. But by the gods I can make her laugh and that’s what matters",
   "created_utc": 1692357490,
   "score": 32,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpf15e",
   "message": "I don’t think she finds me attractive, maybe passable if I’m lucky. I think she saw I have everything but attractiveness and realized that’s much better for long term",
   "created_utc": 1692357391,
   "score": 29,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpeunb",
   "message": "I don’t have one. It’s that simple",
   "created_utc": 1692357286,
   "score": 32,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpk26g",
   "message": "Hope it’s ok for me to weigh in as a woman. My boyfriend isn’t conventionally attractive. Not at all ugly or anything, but definitely not what you’d picture when you think of the words hot / hunky / model etc. He’s short, extra skinny, has questionable teeth, and a part of his face is kinda messed up from an accident years ago.\n\nHe has a lot of amazing qualities. He’s really fucking smart, knows a ton about a lot of stuff, has a lot of interesting hobbies and is good at them, super handy, very well spoken, sorta weird in a way that I’m into, and very athletic (though you wouldn’t know by looking at him because again he’s on the shorter side and thin as a rail).\n\nWe met through mutual friends and I didn’t think anything of him the first time we met. But I kept bumping into him at social events, and the more I got to know him, the more I liked him. Now I’m insanely attracted to him and I like him just how he is.",
   "created_utc": 1692360097,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpexm4",
   "message": "If they don't find you handsome they should find you handy, or humorous, or supportive, or patient, or charismatic, or etc.",
   "created_utc": 1692357334,
   "score": 15,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpi3tj",
   "message": "My cat, it was 100% because of my cat🤣🤣🤣",
   "created_utc": 1692359096,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpmkpc",
   "message": "I'm not convinced that she does.  I'm they safe guy.  I'm responsible, caring, and have a good job.  So I think she just matured and decided that I checked enough boxes.  Basically I'm just a bran muffin.   Nothing that you necessarily want, but you feel like you need when you get older.",
   "created_utc": 1692361339,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwphozi",
   "message": "I guess beauty lies in the eye of the beholder. I don't see myself as that attractive, but my girlfriend thinks I'm the best-looking partner she's been with. I obviously tick all the boxes for what she finds attractive, whether I see it or not",
   "created_utc": 1692358879,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpluqi",
   "message": "I think this is going to sound like I'm patting myself on the back, but I'll give my advice anyways. I'm genuinely nice to her, and I remember things she says and act on them regularly. And I don't mean chores or whatever, I mean things like whe we started dating she mentioned she likes flowers but not \"I fucked up\" flowers, so every 2 or 3 months o get her a little bouquet to show her how much I appreciate her..even if we are tight on money I'll get a 25$ one, if we we are doing ok I'll get a nicer one., but NEVER if it could be precieved as \"i messed up\" flowers. I'll show up at her work with a coffee, a couple times a week which makes her feel special as well.  I try cooking new things and when she says she really likes something I'll try sevral versions of that amd add them to the rotation. She has skin problems and when her hands start bothering her I'll do both the cooking and dishes (usually we split it fifty fifty) for a few days so she can heal. \n\n\nJust listen guys. Act on it, nd don't stop being nice, compassionate and loving. Little gestures that never stop can be the difference.",
   "created_utc": 1692360988,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpfi3e",
   "message": "Money",
   "created_utc": 1692357662,
   "score": 3,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpfz3p",
   "message": "I'm rich",
   "created_utc": 1692357931,
   "score": 3,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpkuaw",
   "message": "I'm a nerd who can write and knows mechanical, plumbing, and electrical work. I'm libertarian conservative and kinky. I own my own house and car plus have a steady job.",
   "created_utc": 1692360488,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpf2xm",
   "message": "My sense of humor, my honesty, my overall enjoyable companionship and empathy. Also we share very similar interests and mentalities. So I guess that's that. But hey, best decision I've ever made! I'm very happy with where I'm at right now with my wife. We've come so far and we're still going strong! 🔥🔥",
   "created_utc": 1692357421,
   "score": 5,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwphfno",
   "message": "I listened to her, I took the time to re explain things to her, I never made her feel dumb for any of it. \n\nI didn’t compliment her appearance until after we were dating. So she knew I wasn’t after just that. \n\nWhen she first met me I had just cracked a bunch of jokes and told a large group of people some hard facts they’ll rarely hear in that context. \n\nI’m honest, and pretty funny when I’m in my element.",
   "created_utc": 1692358740,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwphv0c",
   "message": "When we met I (M30-ish) had nice blond hair, well tanned, clean shaven, and 'designer' torn jeans. I was also a 'biker'.\n\nLittle did she know that I'd just had 2 weeks on holiday someplace warm so the hair was sun bleached and skin tanned.\n\nI was clean shaven as I was looking for a job.\n\nThe jeans were just old and worn out like the rest of my clothes.\n\nI was devoid of a motorbike at that exact time but rode, and still ride, cheep old knackerd bikes which I spend all my free time trying to get running.\n\nBy the time she learnt the truth she was already hooked!\n\n20+ years in and I'm still happy I caught a good one, even it is was for the wrong reasons.",
   "created_utc": 1692358968,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpf18o",
   "message": "My wife thinks I'm smart and I'm that I'm really supportive... plus I have a beard that hides most of the ugly",
   "created_utc": 1692357393,
   "score": 2,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwphqfc",
   "message": "If they don't think you're hot, they ought to think you're helpful, funny, supporting, patient, charming, etc.",
   "created_utc": 1692358900,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpjqf1",
   "message": "I was and still am genuinely fascinated by her! She and I are very different people but compliment each other very well. Plus she's always down to adventure and I'll try anything once!",
   "created_utc": 1692359932,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpl35o",
   "message": "She digs my mind.",
   "created_utc": 1692360609,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwplasl",
   "message": "I think she lowered her expectations and noticed that I was the exact opposite of her father.",
   "created_utc": 1692360714,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpljri",
   "message": "It was my sense of humor, which matches very well with hers. We just had a lot of fun on our dates. That and a furry chest.",
   "created_utc": 1692360838,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpltqd",
   "message": "Kindness and being thoughtful\n\nWe met at the hospital,  where most people working are overworked and underappreciated. \n\nI was changing the surgical dressing for a patient i did an amputation on and asked her for help. Made a bit of a mess... and helped change the sheets and reposition the patient afterwards. I didn't think too much of it at the time since i was still new. But later learned that people will take down dressings and make the nurses redress it and flat out ignore others on the care team like our xray teams etc. \n\nShe tells me it's that moment she liked me to start.  And why she jokingly tells me not to be too nice to other people at the hospital for that same reason haha.",
   "created_utc": 1692360974,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwplxpw",
   "message": "I had more money and was better in bed than her (soon to be ex) BF. Those words came from  said BF, seemingly often.  At some point she got curious... and we spent a bit under a decade together.",
   "created_utc": 1692361028,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpmh6y",
   "message": "I made her laugh.",
   "created_utc": 1692361292,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpmhzp",
   "message": "My humor and me being straight forward.",
   "created_utc": 1692361303,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpmli6",
   "message": "We met while I was in Air Force pilot training. Dudes in flight suits have an edge. It might be all the zippers.",
   "created_utc": 1692361349,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpmqv8",
   "message": "We had the same college classes together and I was always able to speak confidently in discussions. I also cracked a lot of jokes. I would walk with her after class and eventually she just asked me out",
   "created_utc": 1692361422,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpn1aw",
   "message": "I honestly do not think she does. I think she was looking for someone to help raise her kids.",
   "created_utc": 1692361562,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpn4ub",
   "message": "Money.",
   "created_utc": 1692361611,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpnotp",
   "message": "Confidence, humor and cash.",
   "created_utc": 1692361880,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwphwez",
   "message": "I am funny 😊",
   "created_utc": 1692358988,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpfbcg",
   "message": "i reckon I am plain ugly lol they have all enjoyed me making them laugh, it works till a handsome dude comes along with Money a nice car or a huge dick, i lose out all the time to these kinds of dudes",
   "created_utc": 1692357555,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpj6jv",
   "message": "He is cute but made me feel super safe the first day I met him. I felt so safe that I crashed and fell asleep. That kind of safe. The safest I have ever felt in my life. He was also not in any sort of hurry to touch me or be sexual. For a moment I even thought that he wasn't attracted to me but I didn't care because in my mind I was like, \"well, I feel so safe and if he is not attracted to me then I'm keeping him as a friend\"",
   "created_utc": 1692359652,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpf77c",
   "message": "I give out really good compliments.",
   "created_utc": 1692357490,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpgl1j",
   "message": "Because I'm a fucking legend obviously.",
   "created_utc": 1692358274,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwph5iz",
   "message": "I don’t know. She has never told me. But she needed glasses when we met and didn’t start wearing glasses until we had been together for long while.",
   "created_utc": 1692358588,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpiyre",
   "message": "Tall.",
   "created_utc": 1692359541,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpjdhm",
   "message": "If I had a girlfriend/wife I would have long since deluded myself into thinking I WAS attractive",
   "created_utc": 1692359750,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpjnmr",
   "message": "You had me in the first half, not gonna lie.",
   "created_utc": 1692359894,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpk8qb",
   "message": "Girls find me attractive only when they are drunk it seems. Of course i would never take advantage of them i'm still a virgin.",
   "created_utc": 1692360191,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpkp0z",
   "message": "because I am busty male",
   "created_utc": 1692360416,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpkpgd",
   "message": "They’ve all had really bad taste.",
   "created_utc": 1692360422,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpl4pr",
   "message": "Confidence",
   "created_utc": 1692360631,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpl6h9",
   "message": "I'm smart and funny. Also she considers me attractive.",
   "created_utc": 1692360655,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwplivb",
   "message": "My EX told me I was intelligent, kind, easy going, somewhat funny and relatively good at \"adult entertaining\"",
   "created_utc": 1692360825,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwplmxe",
   "message": "I ask this girl I'm dating now that very question..",
   "created_utc": 1692360880,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpm2jd",
   "message": "I’m a nerd who gives great dick (her words not mine)",
   "created_utc": 1692361094,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpmj7c",
   "message": "She saw me as a paycheck.",
   "created_utc": 1692361319,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpmwz9",
   "message": "She's weird.",
   "created_utc": 1692361506,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpmzlz",
   "message": "I thinks its cus i have vivid dreams",
   "created_utc": 1692361540,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpn18q",
   "message": "I'm scared to ask my girlfriend this question.  NGL.",
   "created_utc": 1692361562,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpnbm3",
   "message": "She told me:  a short, easy to spell last name, makes reasonable money, common decency.",
   "created_utc": 1692361705,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpng3s",
   "message": "My kindness and my sense of humor.",
   "created_utc": 1692361765,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpng64",
   "message": "My dick and balls. In all seriousness. I'm all shaved and they love it. I'm really skinny and for some that's not attractive but when my clothes come off it catches eyes.",
   "created_utc": 1692361766,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpnkxs",
   "message": "I’m rich",
   "created_utc": 1692361828,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpnx8b",
   "message": "Not conventionally attractive, but I have some ok physical features to make me passable (blue eyes, fit, tall). \n\nOutside of that I am a very easy going person and I pull my weight in the household with chores (i do laundry, trash, and then dishes after she cooks as well as we both do equal parts deep-clean once a month). It takes $0 and 0 effort to be kind and easy going, and it will get you far",
   "created_utc": 1692361993,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpnylm",
   "message": "If they don't find you handsome, they'd better find you handy.",
   "created_utc": 1692362011,
   "score": 1,
   "submission_id": "15uhmih"
  },
  {
   "comment_id": "jwpnzrg",
   "message": "I don’t have one",
   "created_utc": 1692362027,
   "score": 1,
   "submission_id": "15uhmih"
  }
 ]
}