{
 "submission_id": "15uj4um",
 "title": "[Serious] What dark family secret were you let in on once you were old enough?",
 "selftext": "",
 "created_utc": 1692361460,
 "permalink": "/r/AskReddit/comments/15uj4um/serious_what_dark_family_secret_were_you_let_in/",
 "score": 201,
 "url": "https://www.reddit.com/r/AskReddit/comments/15uj4um/serious_what_dark_family_secret_were_you_let_in/",
 "comments": [
  {
   "comment_id": "jwpmtsm",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1692361462,
   "score": 1,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwquomn",
   "message": "My dads first cousin is serial killer Kenneth McDuff. We saw the Americas Most Wanted episode when it aired and were so surprised to hear about a McDuff, not knowing he was a relative.",
   "created_utc": 1692378608,
   "score": 141,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqydq7",
   "message": "My uncle didn't die in a car accident. He killed his mistress and then killed himself by crashing his car with her body in the trunk.",
   "created_utc": 1692379956,
   "score": 231,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqul7d",
   "message": "My mother grew up in the American South. Her brother died in his early 20's and she always told me it was a freak accident. A bullet came through the window killing him. They lived in a rural area so I never questioned it. \n\nOne year, I inherited an old Korean War officer's sword after my grandpa passed. My mom freaked out and told me that it was too dangerous to keep and that we should sell it or get a safe to lock it up in. I thought it was weird so I asked my dad and he got this sad look on his face.\n\nTurns out my mom's brother was brutally murdered with a similar sword in the 80's. He had gotten involved with some drug dealers and they thought he had snitched about one of their big deals that got busted. No idea why they decided to use a sword but it was pretty fucked up to hear about. My mom had to ID the body.\n\nI found this out when I was 16 but she never directly acknowledged it until years later. My mom said he was just trying to make some extra cash by introducing people who partied to the dealers. I'm about his age now and I can see how he just thought he was making a quick buck. Never thinking something like that would get him killed.",
   "created_utc": 1692378573,
   "score": 25,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqkm2o",
   "message": "My great aunt's husband killed his first wife, then killed her. They lived in Puerto Rico and he fled to NYC so my great uncles wouldn't kill him. They found out where he was, came here, killed him, and went home.\n\nEdit: Typo.",
   "created_utc": 1692374934,
   "score": 240,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqs1p0",
   "message": "I always thought my two older brothers got addicted to drugs because of their own decisions and the people they hung out with. It turns out that my dad had been feeding them pills since they were about 10 to \"shut them up.\" Years I held resentment against them for not being good older brothers like they should have only to find out that it was my father who I had praised all those years that was truly evil.\n\nEdit: wow, wasn't expecting all of this lol. Just to address some of the comments: My brother's are doing mostly fine now. Both struggled but eventually found sobriety. Luckily enough family didn't give up on them. We have a pretty good relationship now and none of us hold anything against each other. We realize that none of us are to blame for the sins of our father. Not sure where dad is, no contact for about a decade now. In contrast, mom was and still is an angel. With her showing me who to be and my dad showing me exactly who NOT to be, I think I turned out pretty okay. A lot of the time the cycle just continues but my brother's and I managed to break it. I'm sorry to every one who has gone through something similar, thank you for sharing your stories as well. Hope everyone finds their peace some day. Love you.",
   "created_utc": 1692377642,
   "score": 201,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqg3dc",
   "message": "My grandmother married her second husband entirely for money. Her daughters both like to joke about her intentionally giving him a heart attack. He had heart problems but liked to eat unhealthy food, and the rumor goes she would put extra salt and butter on his food until he finally kicked the bucket.",
   "created_utc": 1692373295,
   "score": 137,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqmweh",
   "message": "Not super dark or super secret, but when I had to do a project on my family tree in elementary school one of the questions was \"When did your family immigrate to America and why?\" For one of my great-grandfathers, my grandma told me \"Life was very hard back in his country, and it was getting dangerous to stay there.\" and for a long time I thought \"Yeah, I can see that. It was probably hard for a teenager living in Poland with WWI right around the corner!\"\n\nAnd I'm sure it was. But it turns out it's even harder and more dangerous when you're a teenager who has slept with a married woman and then accidentally killed her husband when he confronted you. I can see why she didn't want me to put that on my elementary school project.\n\nedit: Wrong World War. I just pulled up his Ellis Island records and he immigrated in 1912 aboard the Carpathia in August.",
   "created_utc": 1692375774,
   "score": 232,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqexvv",
   "message": "My dad secretly had a vasectomy after I was born, after my mom lying to him about taking birth control resulted in my birth.\n\nOur family is GREAT at communication and conflict resolution.",
   "created_utc": 1692372875,
   "score": 15,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqrkg4",
   "message": "Great grandma died from a botched abortion when she got pregnant a seventh time.",
   "created_utc": 1692377471,
   "score": 6,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwpnj7q",
   "message": "Not exactly dark, but I found out my father wrote porn novels under a pen name to make ends meet when I was a baby. I've been trying to find one ever since.",
   "created_utc": 1692361805,
   "score": 195,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwpu6bb",
   "message": "[deleted]",
   "created_utc": 1692364830,
   "score": 49,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqlfke",
   "message": "Growing up I always knew my parents had marital issues; constant fighting, a couple times Dad disappeared for a few days living in his car, issues with drinking. But they stayed together and when I asked why didn't they divorce, they always said they loved each other too much. And in the past few years, things seemed to have gotten better. My parents in fact are now so comfortable in their relationship that they make jokes about all the awful stuff they've done to each other in front of me. \n\nWhat I've managed to put together is:\n\n\\-my parents met when they were 14 and my mother was dating an 18 year old and my dad would relentlessly ask her out until she eventually dumped her boyfriend for my dad\n\n\\-my mother went onto university after college (we're UK) whereas my dad dropped out of college and went straight into work while constantly drinking and partying\n\n\\-it was at one of these parties (while my mum was studying) that he cheated on my mum with someone from their old secondary school so she dumps him\n\n\\-barely a year later my dad realises he doesn't know how to do anything for himself, no one else wants him and he goes crawling back to my mum\n\n\\-she agrees to take him back but ONLY if he marries her (not immediately but *eventually* she said), he agrees and a short year after that (aged 22 now) she's already pressuring him to propose, he fumbles it frankly (were in Paris but forgot the ring and proposed back in the hotel room after they'd visited the eiffel tower that day which was her dream proposal) but she says yes\n\n\\-a month after they're married mum pressures him into having a child that he doesn't want and nine months later I was born, they soon realise how hard having a child is and basically pawn me off on my grandparents for the rest of my childhood\n\n\\-after me there were two more accidental babies and each time my dad threatened to leave her if she didn't abort them, she managed to convince him to stay while keeping my siblings by promising he wouldn't have to raise them (he didn't but neither did she frankly, I did)\n\nAnd that is only what happened before/shortly after I was born, if I carried on into my childhood, we'd be here for years. \n\nWhat they sold to me as the perfect love story (been together since they were 14, proposed in Paris, soon married and had children because of pure love) is in fact a bunch of skewered half truths from a horrible twisted love map of my mother's manipulation and my father disappointing her time and time again.",
   "created_utc": 1692375238,
   "score": 126,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr04uq",
   "message": "WHY THE NEIGHBORS MOVED: ( trigger warning for violent crime) \n\nI was pretty young when this happened so the details won’t be perfect, but the story is otherwise true. \n\nI grew up in a coastal town and we had some neighbors whom I really liked. My parents were friends with them, their kids were roughly my age. Wonderful! We played together all the time.  One day they very suddenly moved. I was a bit confused as there had been no clue that they were going. I remember some police cars and the moving vans weeks later, but that was it.  My mother told me that the kids grandmother had become very ill ( the cops came to tell the family) and they left emergently to care for her and never came back. I was only about 5….. seemed legit. \n\nMany years later, as an adult, and long since moved away from that area… my parents and I were reminiscing over our old home.  I mentioned that I wondered what ever happened to them. That’s when my mom told me the truth. \n\nThe parents had gone out that night on a date and left the kids with a 14 yr old babysitter. When they returned home they found the sitter murdered. Someone had broken into the home and SA’d then killed the sitter.  My mom stated the cops think the sitter pretended to be the only one home to protect the kids.  \n\nWhen the parents got home they checked the kids were safe and set them back to sleep.  The police obviously immediately came. Once the kids were hard asleep the parents picked them up, put blankets over their heads, asked the cops to be silent as they walked them out, and took them out of the house. \n\nThey gave the kids the same story my parents told me.  Gramma was sick and they were going to live with her. Gramma dutifully played along with the ruse for several weeks until the parents could find a new home to live in.  The kids were kept unaware of what had happened just mere feet from them as they didn’t want the kids to be forever terrified of it happening again. Not sure if the kids ever eventually figured out the truth of that one.",
   "created_utc": 1692380598,
   "score": 147,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqxjmo",
   "message": "That my grandma didn't lose her leg to cancer, she lost it because she got injured helping my grandpa fix the roof, and my grandpa was too cheap to have it fixed properly so he told the doctor to cut it off. \nThen he beat the crap out of her for life.",
   "created_utc": 1692379648,
   "score": 255,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqg4ho",
   "message": "I don't know about dark but here goes.\n\nMy great grandfather murdered the mayor of the village he lived in. Why? Because the mayor was sleeping with his mom while his father worked on the field. I think he was 15 or 16 when he did that.",
   "created_utc": 1692373307,
   "score": 201,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwq7gp2",
   "message": "\u0026amp;#x200B;\n\n1. My paternal great grandmother was owned by a wealthy cattle ranch around the turn of the last century on the Mexico Texas border in the 1890's/ 1900's-ish. She didn't leave the ranch until she was 16 when she got pregnant and ran away because the baby belonged to the owner of the ranch and she thought he'd kill her if he found out. It was strange to learn that the old lady that would hold me and sing to me as a kid spent the first decade and a half of her life as property. I wasn't told any of this until after my grandmother (her daughter) passed away. My great grandmother was very ashamed of her past and I think by extension so was my grandmother. Looking at old photos of my grandmother and her older brother, the baby she had at 16, he does look strikingly more European than my grandmother an indigenous Mexican.\n2. My maternal grandfather was a pedophile and harmed my mother and her siblings.  It was a well known secret in the family which is even more disgusting. Growing up I used to spend the night at my dad's parents house all the time but I don't have a single memory of spending the night at my mom's parents house. Never once sat on his lap. Never once did my mom ever allow him to hug us. I never understood why my mom was so cold to him when my father was so close with his own father. I grew up resenting my mom for withholding us from a whole other set of grandparents and wished she would've told us sooner than when she finally did. I would've had more sympathy for her.\n\n/edit, grammar",
   "created_utc": 1692370106,
   "score": 189,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqt6hd",
   "message": "My grandfather didn't pass from a heart attack due to old age, he killed himself.",
   "created_utc": 1692378057,
   "score": 176,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqifau",
   "message": "Found out one of my close relatives was a trigger man for a crime family... was killed at his daughters school functions.",
   "created_utc": 1692374138,
   "score": 96,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqtcn3",
   "message": "I found out when I was in my early 30's that my mom hadn't only had 4 kids, but actually 6 but gave 2 up for adoption before I was born. Also, i was the last baby she had with some rando before she married my stepdad and she had intended to give me up for adoption, as well. \n\nSilver lining? One of the babies she gave up contacted her a few years after I learned about this and now I have an awesome new brother!",
   "created_utc": 1692378120,
   "score": 146,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqvmxn",
   "message": "My uncle molested my mom. I don’t understand how he is still welcome in the family.",
   "created_utc": 1692378956,
   "score": 236,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwpqzli",
   "message": "When I turned 21, my grandfather told me a story about his older brother that I had never heard.  My great-uncle was a big boozer for most of his life.  He passed at 92 and by then had switched from liquor to beer and wine; he also cut down to one pack of cigarettes a day instead of two after he had half a lung removed.\n\nPap and my uncle grew up on a farm in the 30s and 40s.  Mostly the family ran the farm by themselves, but from time to time they would hire drifters on as farm-hands.  In 1950, my uncle and one of the farmhands were out drinking and they were driving back to the farm in my uncle's convertible.  My uncle was the one driving and he misjudged a turn that had a steep bank on the right side.  He ran the car up the embankment, which was steep enough to flip it.   My uncle was throw from the car, but the farmhand he was drinking with was only halfway out of the car when it landed.  Pap said he was severed clean into two pieces.\n\nBecause the farmhand was just a drifter without any family to make much fuss and because the Korean War had just started, my uncle was able to enlist and avoid any criminal charges.  He was in Korea until the end of the war.\n\nThat was the only time I've ever heard that story told and although I would never be someone who has more than a few drinks before getting behind the wheel, it's something that definitely sticks in my mind.  And it's a story I'll tell my own kids when they get their license.",
   "created_utc": 1692363426,
   "score": 89,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqacyk",
   "message": "FINALLY I GOT ONE!\nFrom when I  was aged 6 to 13, my Mom dated a fellow named Murray. We all lived together in an old farmhouse.\n\nMurray was a wonderful father figure to us, but he also had a drinking and driving problem, and after a particularly nasty accident, mom waited until he came home from the hospital and was well enough to take care of himself before leaving.\n\nThe whole time we lived there, my sister and I never went down into the basement, as it was *INFESTED* with spiders.\n\nI always thought it was because of the drinking and driving she left him, but as it turns out that was only part of it. The other being that **he had a massive grow op for weed in the basement**.\nMom stated had the police found out about this, she would have lost custody of us.\n\nMurray has long since passed, but he would have had a giggle that weed is legal here now...",
   "created_utc": 1692371185,
   "score": 61,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqg9xk",
   "message": "My grandpa can’t have kids, but my mother still has three siblings…",
   "created_utc": 1692373362,
   "score": 159,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqnto8",
   "message": "I wasn't let in on it more like I found out about it but my siblings have a different dad than I do, that was common knowledge and not the secret at all. The secret was that their dad actually didn't die in the hospital of a terminal illness, he died of suicide when he threw himself from the window of the hospital he was slowly dying in.",
   "created_utc": 1692376107,
   "score": 179,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwpsogv",
   "message": "My uncle raped his own younger sister for years and nothing was really done about it...",
   "created_utc": 1692364180,
   "score": 45,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqp6b9",
   "message": "My paternal grandmother had an affair with our small town’s mortician in the 1940’s.  She got pregnant and he performed an illegal abortion.  The fetus was buried behind the funeral home he owned where we kids used to sled every winter.  My dad told me this as I was getting ready to take a ride down the hill on the sled when I was 12.\n\nAlso, paternal grandfather had multiple illegitimate children around our small town.  Turns out one of my best friends was also my half cousin.  Father told me when I was 17.\n\nMy father was educated, intelligent, honest and moral.  The fact that his parents were so wild was absolutely shocking to me.",
   "created_utc": 1692376598,
   "score": 88,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqb4r4",
   "message": "My grandpa's (step dads side) first wife tried to murder him, and went to prison for it. Then also, my aunt (moms side), was pimped out by her husband for decades.",
   "created_utc": 1692371470,
   "score": 133,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqtzhy",
   "message": "Husband’s family has a dark secret that still isn’t out to the people who really need to know and I hate that I know. His youngest aunt was “sent away” when she was a teenager and shortly after she returned, the oldest uncle and his wife introduced the family to “their daughter”. Young aunt went on to have 3 more kids who have no clue that their cousin is actually their half sister. What’s even more F’d up is that her “brothers” know the secret!!! I’m dreadful that someone will need a donor or do an ancestry test and all the lies will be exposed. Glad I could get that off my chest. If you’re assuming this is a “good Christian family” you would be correct. It’s all about appearance.",
   "created_utc": 1692378353,
   "score": 62,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqqcbw",
   "message": "My dad’s side of the family has ties with the mafia. Thankfully my mom has long since divorced my dad and they life a decent distance apart. I heard stories of my mom’s parents who lived close by at the time circling the block in their truck late at night soon after the divorce to ensure no one was there to hurt us. I was very young at this point, probably like 3-4 so I really have no memory of this. I do remember one night our garbage can was burned to the ground, and my mom has since told me about death threats soon after the divorce. My mom a couple years ago watched a documentary on prominent mafia families and noted multiple names that were at her wedding.",
   "created_utc": 1692377023,
   "score": 59,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqoqvq",
   "message": "My grandmother raised her nephew after his parents died. I don't know what I thought happened to them, probably just assumed car accident. When I was 14 or 15 I asked my mom what happened and she told me that it was a murder/suicide. Then she told me way more details that I probably shouldn't have been told and told me not to say anything to him because he had blocked it out and didn't remember most of the details. Years later we were talking and in the middle of an unrelated conversation, he said to me, \"I remember everything. It just came to me a few nights ago.\" I didn't know what to say, but then he asked if I knew the story and said I kind of did. He went into detail and it was not fun, but I could tell it was cathartic for him. Next time I talked to my mom I let her know that he remembered and may get the same conversation. That was the last time I heard anything about his parents though",
   "created_utc": 1692376443,
   "score": 149,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqfx01",
   "message": "Three married uncles have a child outside their marriage, 2 were proven, Uncle A - the mom is a family friend and it happens before my uncle was married but was only revealed when I was in college, Uncle B - told straightly by our uncle and it was not 1 but 3 children, Uncle C - not proven because we only saw a picture after he passed",
   "created_utc": 1692373230,
   "score": 206,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwpte8j",
   "message": "An older relative murdered her husband in cold blood. The daughter lied on the witness stand by testifying that her dad beat her mom. He didn’t. The mom was a drunk, and the father was threatening to leave her and take the kids. \n\nB/c the courts believed the lying daughter, the murdering mother kept custody of the kids. The victim’s family cut off my whole side of the family after that including their perjuring granddaughter and her descendants. Now I know why.",
   "created_utc": 1692364493,
   "score": 52,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqol6l",
   "message": "[deleted]",
   "created_utc": 1692376386,
   "score": 231,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr721o",
   "message": "I knew my grandfather was a coal miner, and that he was really involved with the Union, but it wasn't til after he died that I found out just how much of a Union Man he was... if something needed blowing up or someone needed to not be breathing anymore, they called Gramps.\n\nAfter he died, my brother remembers some men coming to visit Gran and giving her a lot of envelopes. She took off for a yearlong vacation in Europe after that.",
   "created_utc": 1692383146,
   "score": 14,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqbdiy",
   "message": "My great uncle was a Nazi\nMy grandmother and their whole family hated the Jews prior to ww2.\n\nEdited.",
   "created_utc": 1692371561,
   "score": 69,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqvmi7",
   "message": "When my father's Dad died the secret was out.\n\nGrampa was an evil man who bootlegged liquor, stole cattle and kidnapped Indian children to sell into slavery.\n\nHe had a very public mistress and coming home from a bender he knocked up his wife (my grandma). In order to save face to his mistress he took the knitting needles to grandma thus infecting her to die of sepsis in territorial New Mexico in 1929.\n\nMy dad was six with younger brother four, left to grow up as virtual orphans. Despised by the aunts and forbidden help from their uncles my dad and his brother grew up in the depression almost starving while their Dad lived it up travelling and committing many crimes that were easy to get away with because it was the great depression.",
   "created_utc": 1692378952,
   "score": 167,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqybaj",
   "message": "My dad left when I was 7 and we were always told that it just didn't work out with my parents. We saw him off and on for about 2 years after he left then never saw him again. He had remarried and she had a kid that became his step son that my brother and I would hang with when we would go to my dad's house, then when I turned 13 my mom finally told me that the step son was actually his son from having an affair with that woman. So that kid was my half brother and I had no clue.",
   "created_utc": 1692379931,
   "score": 247,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqtqf1",
   "message": "My grandpa’s brother died when I was a child. I hardly knew the guy so I wasn’t too interested in the service. I vaguely remember my parents warning me not to stare at some of the men but I figured that was a “good manner” moment. Fast forward to my later teens/early adult and turns out, yup, we were **surrounded by members of the Italian mafia**. Everyone in my family was tense (even the departed’s wife) because they all knew he had *some* connection to them, but didn’t exactly know as he never spoke of it to anyone",
   "created_utc": 1692378261,
   "score": 60,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqwh5f",
   "message": "Just found this one out recently. My uncle was a doctor working in a small town hospital. He was married and had just had a baby boy. While his wife was pregnant or just had the baby he had an affair with two nurses in the hospital and ended up getting one of the nurses pregnant. When he found out of the second kid he took his family and fucked off to New Zealand for 3 years. Upon returning to Canada and the same small town hospital his wife immediately found out about his illegitimate child and divorced him. \n\nMy (illegitimate) cousin stopped coming around to family events and when I talked to him about it last year he told me that my grandparents always blamed him for ruining my uncle’s marriage.",
   "created_utc": 1692379259,
   "score": 94,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqtg7t",
   "message": "My dad took me out for a walk when I was in middle school to tell me that I have a half brother in Japan with a similar name and birthday as me. We have the same dad, different moms. My brother has known about me his whole life, as a sister who lives in the States, but I only found out about his existence on that day.",
   "created_utc": 1692378156,
   "score": 27,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr0ta9",
   "message": "That my biological mother used to give me heroin and valium as a baby and toddler to control me then drop me off at my grandmother's house when she couldn't afford to share so I'd go through withdrawals but no one would no what was wrong. \n\nNeedless to say, I was put up for adoption to get me away from that",
   "created_utc": 1692380847,
   "score": 221,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqtzat",
   "message": "My uncle raped my cousins. \n\nThis happened and he was arrested before I was born. For some absolutely insane, unknown reason to me, he was released from prison when I was 9 and my parents allowed him and his girlfriend to stay with us for 2 weeks while waiting to get the keys to their new place. \n\nI was always told he's been in prison for drugs. \n\nFor the record, my parents believed he was guilty. It wasn't anything like that. Why they would take the risk with a daughter in the home was beyond me. \n\nHe was allowed at family functions despite constantly getting back into drugs, at one point narrowly avoiding having my grandma's car taken. One cousin had nothing to do with him. The other came to family functions for a while, but it was too painful for her and she cut him off. \n\nI found out when my brother let it slip when I was 13. My parents weren't happy. I was horrified they ever let him around us. \n\nI told my brother from a young age, if he ever did anything like that, he was dead to me.",
   "created_utc": 1692378351,
   "score": 49,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqn2b7",
   "message": "Not so much \"dark\" as it was annoying and made me question everything, but I found out my biological dad actually was in my life for a few years.\n\nMy family told me for most of my life that he left \\*before\\* I was born because he was \"a deadbeat that couldn't take responsibility\". In my 20s, I found a photo of him and me. My brother told me everything. The truth is that apparently there was an incident where mom went a little crazy on him and he got arrested and left afterward. From then on, I took everything they said about him with a big grain of salt.\n\nStill never met him, and don't really have a desire to. Just upset me that they lied for so long.",
   "created_utc": 1692375832,
   "score": 110,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqfe79",
   "message": "My father is from small working town in Eastern Ukraine. And most of our lives we've been poor.\n\nBut my mother always praised my father for his ability to know the parfume by smell, and not only that but also he can recognise many famous parfumes my smelling them.\n\nOnce, when i was 20-something years i asked, why is that so? Where he obtained this skill? My father asked me to not ever tell this story to my mother.\n\nAnd here's the story: my father had a close friend who was actualy a secret lover of one of the most famous soviet singers, who officialy had wife. But it reality he was gay and did a lot for gay community in soviet union. He brought a lot of expensive things from abroad, like new music, clothes and parfumes. And a lot of that parfumes has been met at secret parties.\n\nThis gay-friend of my father also gave him all the fresh music releases vynill and he sold it and they shared the profit, unofficially of course. That's why my dad knows release years of most hits from 60s and 70s.\n\nAnd more of that, he told me about special square in Sochi (the place of Olympic games 2014) where gays of ussr met each other and what secret signals they had.\n\nNice",
   "created_utc": 1692373039,
   "score": 52,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqujiw",
   "message": "Ooh ooh! My mom’s uncle was in the mob. He was enforcer for Jimmy Hoffa in Chicago. He would take my mom and her sisters to go get ice cream and pay with $100 Bills. Then he’d go to a bar and they would wait outside while he “went in to talk.” He mysteriously never had a real job but always had money they said…",
   "created_utc": 1692378555,
   "score": 191,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqcths",
   "message": "I had an aunt that I never met, and never knew she existed until very recently. I don't see that side of the family almost ever, because they kicked my grandma out of the family after she married a half black guy. Anyway, this aunt spent the last 30 years of her life in Ancora, an inpatient psychiatric hospital. She lived a perfectly healthy and normal, albeit extremely racist, life until she was in her mid 40s. Then she found out that she was 25% black through some chain of events I still don't fully understand. She. Fucking. Lost. It. She was so full of hate that her brain could not accept this information and it broke her. She would just scream the n-word at people, and didn't really communicate in any other way. Im convinced Dave Chappelle heard this story and made his black white supremacist skit. Bitch stayed there until she died. I know extreme hate like that can fuck with people's brains but I mean... come on",
   "created_utc": 1692372094,
   "score": 133,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqmg0r",
   "message": "That my grandfather was a horribly abusive alcoholic and he died in a fire that started cause he passed out drunk with a lit cigarette.",
   "created_utc": 1692375609,
   "score": 97,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqwt80",
   "message": "My uncle was actually my cousin. He was kidnapped as an infant and when he was returned a year later, my aunt didn't want him back. My grandparents adopted him so he was legally my uncle.",
   "created_utc": 1692379379,
   "score": 12,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr9s4s",
   "message": "When I was very young, my family lived in a townhouse, and against all local bylaws, my mother decided to keep a horse in our backyard. Not only that, but it was an ex-racehorse that came as a package deal: the goat companion that slept in the closet of my nursery. I also later found out she was running a grow-op in the basement.",
   "created_utc": 1692384147,
   "score": 168,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqvw7u",
   "message": "My dad's friend commited suicide by shooting himself in the head in front of my dad and some other friends when he was 15 years old. They were all hanging out at the friend's house having a good time, when he went upstairs, grabbed his father's pistol, and came back down calling everyone's attention. He then put the gun to his head, squeezed the trigger, and collapsed behind a couch. They all thought it was some sort of sick joke at first, until they looked over the couch and saw his body and the blood. \n\nI first heard this story from my mom when I was 18, which explained some of my dad's behavior towards toy guns when I was a kid, but I never brought it up to him. I just hoped that one day he would open up to me about and eventually he did, but we haven't talked about it much since then. \n\nI'm amazed how my dad dad turned out to be such a great man having to experience something awful like that at such a young age, but according to him it's something that never left him either. He still has nightmares about it and get really uneasy in movies and TV shows when they show someone getting shot in the head.",
   "created_utc": 1692379050,
   "score": 179,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqlsdz",
   "message": "My paternal grandmother's family was pretty messed up. My grandfather told me a story about how he and his brother in law got called to get his father in law's body out of a hotel after he drank himself to death. And two of my great aunts were nuns because that was the quickest way to get out of the house as kids.",
   "created_utc": 1692375370,
   "score": 65,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr0tfd",
   "message": "My grandfather had severely scarred legs from burns he got as a kid. Growing up we were told that he was in a fire in an apartment building and sustained the burns while escaping. He died when I was 7, and one of my few memories of him is an image of those scarred legs. Well, when I was 23, my great aunt (his sister), told me that it wasn't a fire. Their father ran a bath with scalding water and put my grandfather in it as a punishment. \n\n\nGreat-grandfather was an abusive alcoholic piece of shit who fucking maimed his son.",
   "created_utc": 1692380848,
   "score": 169,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqrieo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr3mut",
   "message": "My grandpa (15) kidnapped my grandma (14) from a convent. No one even bothered looking for her thereafter cause she was an orphan and didn't even know who her family was. They had 16 children together.",
   "created_utc": 1692381877,
   "score": 218,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwquepw",
   "message": "Dark-ish, but I prefer to see it in a romanticised light: my maternal great grandmother was the chief of a gang of highwaymen (think early 1900's). I would LOVE to know more, but apparently it's a touchy subject for my Nana so I don't push it.",
   "created_utc": 1692378506,
   "score": 15,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqdbvm",
   "message": "My Aunt had an illegitimate daughter her family doesn't know about. She was one of My mother's 8 sisters.",
   "created_utc": 1692372280,
   "score": 200,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqxjlx",
   "message": "Learned last year that my father went in debt to buy the Ps1 for my brother, which, at the time, went through a cardiac surgery. He received it at the hospital and we still have it. Also my father went in debt some more times so that we would have stuff that he never had the opportunity to have. It's a \"dark secret\" just because it was my mom that told me, after a literal decade. Nowadays we are very well financially.",
   "created_utc": 1692379647,
   "score": 158,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqesp4",
   "message": "My grandfather died in the second World War, never having met my father, and his brother married my grandmother.  But secretly my grandmother never loved him.",
   "created_utc": 1692372822,
   "score": 196,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqpmzw",
   "message": "I was told my grandpa (fathers father, died when my dad was 13) was shot and killed by police after robbing a bank, not hit by a drunk driver, by my dad's two older siblings, after my dad died.\n\nI was 35. I don't know who all knows what.",
   "created_utc": 1692376765,
   "score": 44,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqkpc6",
   "message": "One dark, one kind of strange. One of my \"uncles\" (actually mothers cousin's husband-confusing I know) was this really funny guy who laughed all the time. I found out when I was an adult that every relative kept their young daughters' away from him, as he was very inappropriate with them. The strange one - my uncle was married twice. First marriage was annulled. His children (now all very much adults) do not know about this for some reason",
   "created_utc": 1692374967,
   "score": 123,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr0uel",
   "message": "I was told by my aunt (before my parents thought it necessary) that my Dad had cheated on my Mum and slept with a stripper and that I was her daughter and not actually my ‘Mother’s’. \nI found out years later that my Dad wasn’t actually my Dad either - though he thought he was which is why he put his name on my birth certificate and brought me home when my birth mother wanted nothing to do with me. \nFun times.",
   "created_utc": 1692380858,
   "score": 164,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqkxmg",
   "message": "Both my sisters aren't relatives and that my dead father was a pedo",
   "created_utc": 1692375052,
   "score": 187,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqwpso",
   "message": "My wife was molested by her brother and basically everyone except her Dad knew it was going on and did nothing. I wouldn't say this is something I found out when I was old enough but found out after my wife and I had been together awhile when we were dating.",
   "created_utc": 1692379345,
   "score": 92,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr1hkv",
   "message": "Several actually involving my paternal grandfather (Pa).  He was a cattle rancher and long distance truck driver.  Pa was a terrible alcoholic who beat my granny on several occasions my father was the one who would save her.  He took several beatings doing this until he was old enough to stand his own against his drunken father.\n\nHe ran off and married another woman that he had been having an affair with for years.  He had four boys with my granny and four children with the other woman as well.  When granny found out and found him she took him to court and the judge sent him home with her to raise my dad and uncles.  She had to write the child support checks until the youngest turned 18.\n\nHe had several children with other women, only a few we actually knew about.  In his later years he was proud of all the kids he had all over the country.  One of his daughters moved in with him after granny died and a couple of years later they had a daughter.  They were both fully aware that they were father and daughter.",
   "created_utc": 1692381092,
   "score": 31,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwrdfq8",
   "message": "Circa 1994 My dad died(32) on Christmas Day. Instead of his family consoling my now single mother of 2, they decided it would be more appropriate to use their spare key to enter our house and clean out all his belongings while we were picking out a tombstone. All his tools, clothes, pictures (he was a model). \n\nThennnnn grandpa on dads side takes my mom to court while she’s mourning to try to prevent her from using his life insurance to raise us ( sister and I were 5 and 6 at the time). He wanted all the money to be set aside until we were 18. Judge pretty much threw his case out. Needless to say, my mom distanced herself from his side I don’t speak with them either. Found this out when I was like 20.",
   "created_utc": 1692385498,
   "score": 252,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqt6jv",
   "message": "Alledgedly, cause no written proof exists that we know of,\n\nMy Grandfather was on both sides in WW2.\n\nFirst the Nazis likely from 1940-1942 and then the resistance from 1943 or 1944 to 1945.\n\nJoined the Nazis when country was occupied, (we think) he went to the Eastern front, got wounded, got sent home.\n\nThen laid low and joined the resistance, stealing documents, petrol/gas, smuggling weapons etc, this is fairly verified.\n\nWe know about the resistance cause of other members that said he was alright in 44-45. \n\nWhat we also know is that when he died, we found some troublesome images in the basement and some medals he never got rid of. So it is a guess, but from the oldest people we found who knew him, we knew that there was \"always a little bit of talking\" behind my grandfathers back, like yeah, resistance, sure, but wasn't he also ... \u0026lt;silence\u0026gt;.\n\nSo IDK, he rooted for the winning side and swapped team when the war turned.",
   "created_utc": 1692378058,
   "score": 139,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr6w52",
   "message": "My Mom was raped as a teenager and the responsible party mysteriously met an extremely violent and slow end at the hands of the most notorious bike club in the world.  Dark enough?",
   "created_utc": 1692383085,
   "score": 103,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwq8jm6",
   "message": "I wouldn't call it dark, but when I was looking over my Dad's family tree (he's a huge genealogy nerd) I noted his parents were married 6 months before he was born.  The math did add up.  He just laughed and said \"Well, sometimes these things happen!\".  If you learn my Dad is a very conservative Christian it becomes funnier. \n\nMy Grandad had just returned from WW2, he met himself a pretty girl and I'm sure one thing lead to another!",
   "created_utc": 1692370508,
   "score": 224,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqf744",
   "message": "Not dark.  I found out I have a step brother and step sister in another province.\n\nCorrection:  half brother and half sister ❤️",
   "created_utc": 1692372969,
   "score": 88,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqkxi1",
   "message": "My grandfather was an alcoholic who made my mom and uncles uncomfortable to invite anyone to the house. He ended up dying of liver cancer.",
   "created_utc": 1692375050,
   "score": 57,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr39fg",
   "message": "1- My grandfather killed his own son by throwing him on the floor because he was crying (he was just a couple months old)\n\n\n2- My uncle tried to rob a bank and ran away by foot.\n He later on got married and his wife ended up committing suicide, at the time the police thought that my uncle killed her, since he had a criminal past but he didn't (he was at work and there were witnesses)\n\n\n3-I have multiple half siblings (my dad was/is unfaithful)\n\n\n4-my grandfather burnt the house down with his wife and children inside with the intention of them dieing, my grandmother ran away with her, 7 or 8 children i don't recall, and she asked a priest, that she worked for, (i think she cleaned his house ) to give her a space to stay, he ended up giving her a home that a old lady left for the church (and if I'm not mistaken she was paying it little by little)\n\n\n5- my aunts neighbor (who I went to the beach with when I was little) apparently killed his own wife abroad \n\n\n6- There was a rumor that my uncle's kids weren't his",
   "created_utc": 1692381739,
   "score": 184,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr518e",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqrnsw",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqxtyd",
   "message": "That one of my sisters may not actually be my sister. She might be a cousin or my uncle's sister. But no one wants to know and my dad still claims her.",
   "created_utc": 1692379754,
   "score": 97,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqmahz",
   "message": "That my parents didn’t want me, my mom got pregnant by accident. She was so upset and even retired from her job at the age of 38 to be able to take care of the extra new child (me). I have 5 sisters and 1 brother, i am her 7th and last child",
   "created_utc": 1692375555,
   "score": 50,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqymh1",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr1lyp",
   "message": "My great grand-parents got drunk and locked two of my uncle's out of the house late at night in the middle of winter. My great-grandparents wouldn't wake up and my uncles couldn't get in, so they tried to walk to their grandma's house that was like 15 miles away, and one of them froze to death and the other had to have is feet and hands amputated because of frostbite. My great-grandparents lied about what happened and said they snuck out.\n\nIt was in the newspaper and was made out to be this heartbreaking story, about two dumb little kids who snuck out in the middle of the night because they wanted to see their grandma.",
   "created_utc": 1692381136,
   "score": 68,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwrdtpe",
   "message": "This might be a bit too weird for this thread. I am from a country still enshrined in a lot of superstition and religion. My great great grandmother was a crazy woman who practiced witchcraft. One day her husband died unnaturally (iirc he was murdered or something by the village) and granny went mad. She gathered the village folk around and picked up a rock from the ground nearby and declared that the rock will be her curse and the village will suffer for killing her husband, after that she killed herself. \n\nFor multiple generations my family worshipped the rock as a deity and prayed to lift the curse from the village. It ended when my father in his 20s got sick of his family doing stupid shit. Him and his cousins stole the rock overnight from someone's house and threw it near a railway track. And no I wish I was making this shit up but my father, uncles and aunts all told me this story when I grew up.",
   "created_utc": 1692385640,
   "score": 119,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwqxzwp",
   "message": "My grandma was a very bad driver, and apparently, when she was in her 30s, she hit and killed a special needs girl who lived in her neighborhood.",
   "created_utc": 1692379814,
   "score": 90,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwrewi6",
   "message": "My parents had 2 kids before I was born. My mother drowned them in a bathtub during a psychotic episode. Somehow despite this \u0026amp; a prior history of mental illness, she got released \u0026amp; had me a couple years later. They had another child just before I turned 2, but I never laid eyes on her. \n\nNeither of them ever fessed up, though. I only found out about their existence after an aunt died \u0026amp; left me her personal effects. I found birth announcements for these other kids in her mementos. I always thought she meant for me to find them. When I asked my parents, they refused to discuss anything related to these kids.\n\nA few years later, I went back to my hometown \u0026amp; looked up that date in the newspaper morgue. The friend who went with me was floored. I wasn't, really. I'd grown up in fear for my life from her rages.\n\nI broke off contact with them as soon as I could. Not just because of this, though it didn't help. I had a slew of my own traumas growing up. It was a huge mistake to let them try to raise another child.",
   "created_utc": 1692386044,
   "score": 53,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr82wv",
   "message": "When my grandma's gentleman friend was admitted into a care home for his dementia they had a problem in verifying his medical records.  As he deteriorated he lost his Irish accent and would occasionally speak in German. He was a child during WW2.  \nMy Parents reckon he was probably a Jewish escapee",
   "created_utc": 1692383524,
   "score": 254,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr4w43",
   "message": "My parents took me to Disneyland for my 7th birthday. I recall landing, going to the park, having a great first day or two. Then my parents had to step out and take a bunch of phone calls. They sounded very stressed. They kept telling me nothing happened and everything was okay. Eventually we flew home, and surprise!! Took an extra couple days to go to a big Waterpark away from home. \n\nI fondly remembered this birthday and eventually forgot about any of the weirdness. \n\nMaybe 10 years later my parents finally told me what happened. My uncle, my dad's brother, tried to kill himself on my 7th birthday. He shot himself in the stomach with a rifle. He was poor, addicted to drugs, no work, etc. He felt depressed my dad had the life he always wanted, so tried to kill himself. \n\nHe ended up living. My parents took me to the Waterpark so that we didn't have to come home to him leaving the hospital. By not telling me, my parents let me keep my birthday as my day, not the day uncle tried to die. Knowing how a 7 year olds brain works, I probably would've thought I had something to do with it.",
   "created_utc": 1692382340,
   "score": 233,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwrl64b",
   "message": "When i was a kid in the mid 80s my uncle got some serious braces and had to drink liquids only for a whilr\n\n\nOnly when I got older did I learn that he'd actually had his jaw wired after being tortured for information... had a gun put in the mouth and eventually his jaw shattered because he wasn't talking...\n\n\n...He wasn't talking cos he didn't know anything.\n\nThank god northern ireland has moved on from those days.",
   "created_utc": 1692388370,
   "score": 109,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr06hi",
   "message": "My great grandfather died in a house fire. Evidently he was sleeping with a married woman and her husband was mad and locked him in the house and set it on fire.",
   "created_utc": 1692380615,
   "score": 51,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr9m5d",
   "message": "Not that dark nor secret, but when my vietnamese grandpa fought in the war, him and his squad had to eat human flesh (in order to survive I guess). He was disgusted by meat for a very long time after. (Sorry for my english)\n\nEdit : y'all are more replying about the \"srry 4 my english\" than the actual comment 🤣 Thank you for the kind support !",
   "created_utc": 1692384087,
   "score": 153,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr7d84",
   "message": "My great-grandmother was shot dead in the street by an ex boyfriend, in front of my 4 year old Grandma and her two younger brothers. It happened in a really quiet European town and I believe it made the papers. Grandma ended up being sent to live with an aunt and the boys stayed with their father and he remarried a nasty abusive woman. \n\nHearing this story really changed my perspective on Grandma and the boys. The boys both ended up going to prison and having difficult lives, and Grandma was a stern, unemotional woman. I feel like this gave me some understanding as to why",
   "created_utc": 1692383261,
   "score": 55,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr6a0q",
   "message": "I found out I had a sister who had been given up for adoption. The only reason I found out was the person who informed me no longer felt bound to secrecy after my mom died. And the person who told me had \"receipts\" solid enough that I have no reason to doubt them.\n\nIt also explains why mom freaked out when I told her I'd done a 23AndMe test.",
   "created_utc": 1692382857,
   "score": 73,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr7g55",
   "message": "That my grandmother probably trapped my grandfather into marriage by lying about being pregnant. Cost him an appointment to the Naval Academy (midshipmen can't be married) and generally fucked up that side of the family for a generation. She was a pretty good grandma, but apparently a shit wife and mother.",
   "created_utc": 1692383290,
   "score": 222,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr7rqu",
   "message": "My uncle killed himself when I was a kid. I didn't find out why until I was much older. \n\nHe got caught watching his stepdaughter take a shower. She was 15. He shot himself in his office while the family was home.",
   "created_utc": 1692383408,
   "score": 123,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwribvc",
   "message": "Found out my Dad's mom was a lesbian and that my \"Godmother\" who lived with both my Grandfather and Grandmother was actually her lover. They slept in the same bed while my Grandfather had his own room. Growing up I had no idea, but as I got older I pieced it together... But I loved them all and still do (RIP).",
   "created_utc": 1692387323,
   "score": 189,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwrzqn1",
   "message": "A family member walked in on my mother breaking my arm by holding me only by it when I was 2, didn't say anything for fear of \"breaking up a family\" - mother abused me my whole life and even after cutting contact 3 years ago is still trying to ruin my life, this family member told me the story casually and acted as if they'd done me a favour because I \"could've ended up in care\" - had to pull back from all of them now because of the realisation they were all bystanders and let it go on without a word.",
   "created_utc": 1692393905,
   "score": 243,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwry4os",
   "message": "I think this counts. My whole family found out at the same time about the dark secret (I was 25). \n\nMy great grandparents left their spouses for each other. Great grandpa was 37 and great grandma was 19 in Ireland.\nMy GGpa had 7 children. My GGma had 3. They left their spouses and children in the middle of the night to run away together and moved to America. Didn’t say a word and never talked to them again.\nWhen my grandpa, their only child from their new life, would ask them about their past or family, they got really weird and would refuse to say anything. They took the secret to their graves.\nMy grandpa at age 70 wanted an explanation about his heritage, so he signed up for Ancestry and 23andMe. Could you imagine how shocked he was to find out he had 10 siblings. They had been searching their whole lives to find out what happened to their parents. He got to meet them and would travel to visit them twice a year.\nMy grandpa died 4 years ago. At least he got to know his siblings for a bit before he died.\nHappy, sad, and screwed up all at the same time.",
   "created_utc": 1692393274,
   "score": 254,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwrnot6",
   "message": "My grandma and uncle were both diagnosed with cancer in the 90s. My uncle went into remission, grandma died. Almost a decade later, my uncle’s cancer came back in full force. He and his partner of 40 years were hoarders. My mom/his sister didn’t realize this initially because they lived about 2 hours apart. She only knew after her first visit to help take care of him. We all made several trips to help clean up. \n\nOn one of these occasion, uncle’s common law husband mentions he needs to hit up the PO box as they haven’t collected mail in a few days. Mom offers to drive him. When they get back to the house, mom notices a letter from the IRS addressed to grandma. Weird because grandma hasn’t been alive to file taxes in almost 10 years.\n\nTurns out uncle and grandma had a joint bank account. He never notified authorities of her death. She still got direct deposits from grandpa’s government pension- post mortem, because the government didn’t know she was dead. Not only did my uncle illegally receive thousands of dollars of my grandma’s pension, he also had several maxed out credit cards. He knew the cancer coming back was a death sentence and decided to live it up while he was still here.",
   "created_utc": 1692389309,
   "score": 219,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr47jl",
   "message": "I wasn’t let in on it so to speak. My dad is “Polish” and I took a DNA test, turns out I’m 100%… not Polish. I look exactly like my dad. My dad looks nothing like his father.",
   "created_utc": 1692382088,
   "score": 30,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr510m",
   "message": "My older sister is not my full sister - she's my half sister via my mother. My mother was married before and had my sister with her first husband. Her first husband raped my sister from when she was two or three years old. My mother caught him assaulting my sister, but no one believed her and my sister was, from what I was told, fucked up. My mother divorced him and he tried to get custody of my sister so she ran away with my sister, even cutting contact with her own family to keep my sister safe. \n\nA few years later she met my dad, who unofficially adopted my sister, and they had me. I grew up not knowing because my sister thought I might not love her the same if I knew we had different dads - and I think maybe some part of her wanted to forget her step dad isn't really her biological dad. \n\nThe only reason I ever found out - I found out when I was twenty - is because somehow, my sister's biological grandmother found my mother's address and called, I answered the phone and she mistook me for my sister. \n\nThat was... An interesting phone call and afternoon.",
   "created_utc": 1692382391,
   "score": 224,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr9ihx",
   "message": "Not terribly dark, but as an adult my dad told me he used to be a coke addict and quit shortly before I was conceived. \n\nIt’s interesting to look at now because he’s pretty straight edge in his older years, doesn’t even drink beer. Wonderful person though",
   "created_utc": 1692384050,
   "score": 136,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr32ep",
   "message": "My mother got pregnant when she was 17 so her and my dad were going to ask her parents for permission to marry. Instead, they got an ultimatum: get an abortion or be sent away to a home for unwed mothers. My mother got the abortion and married my father two weeks after her 18th birthday. She proceeded to have several miscarriages and stillbirths, almost certainly due to the damage done to her uterus/cervix. My brother was conceived with medical assistance and I was a lucky surprise. My parents are still married 46 years later.",
   "created_utc": 1692381667,
   "score": 21,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jws1vln",
   "message": "Y’all’s stories are WILD! Mine is super tame:\n\nWhen I was in my early 20s, I found an old photo of someone in a family album I didn’t recognize. When I asked my mom about it, she said, “Oh that’s your aunt Gloria.” Then she lowered her voice (even though we were alone) and added, “she’s a *NUDIST*.” Poor aunt Gloria, just wants to be a nudy-lady and everyone acts like she’s a leper.",
   "created_utc": 1692394757,
   "score": 148,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr9vid",
   "message": "I found out when I was about 32 that apparently in 1973 my dad had a daughter he never knew existed. \n\nI found out because he texted that to me while I was working, after finding out about it himself about 1 week earlier. She was in her late 40's by that point, I think. \n\nWhat's sort of tragic is all this time we thought I was my dad's only kid, and he always wanted a dauighter but never got one due to marriages ending. He would have fucking LOVED this girl. his daughter was the result of a one-night stand with a girl he never talked to again, and according to his daughter the mother had a mental breakdown not longer after giving birth and never really had custody of the daughter anyway. \n\nDad never would have had any way to find out, the baby grew up with the mother's parents in another state, and the mother kinda went AWOL.",
   "created_utc": 1692384182,
   "score": 148,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr9weh",
   "message": "Found this out after my grandfather died. Growing up every older guy in the neighborhood would say how tough he was. I mean he was the most intimidating man Id ever met, you would jump if he sneezed. Im not even exaggerating. But Id never seen him actually fight. But everyone, and I mean everyone, women and men, would say he never lost a fight and usually never had to throw more than one punch to knock someone out. Simply put he was a bad motherfucker.\n\nBut growing up he would always preach to me and my cousins to never fight if you could help it. Just walk away. If theyre insulting you just walk away. Its only words. Sticks and stones and all that. Hed drill it into our heads that you never fight unless you have to and never under any circumstances do you throw the first punch. Ever. I was kind of confused. Every older person in our neighborhood would tell me how nobody fucked with \"Blackie\" because of how many people he knocked out, and he would always tell us NOT to fight.\n\nTurns out when he was in his 20s he got into a fight with someone. Apparently the guy kept insulting him and wouldnt leave him alone. Finally he had enough and cracked the guy. Knocked him out with one punch. Problem is when he landed he hit his head on a step. It was lights out for good. Killed him with one punch.\n\nI had never heard this story and confused about how he didnt get locked up. Turns out he did. Got like 15-20 years or something like that. Then WW 2 happened. When I was a kid Id always ask my mom how my grandfather entered the war, was he drafted or volunteered? Shed say oh it was like the movie The Dirty Dozen. Which I had never seen or had any interest in when I was young so I had no idea what that meant. Turns out the Army made him a deal. Go to the front lines in Japan. If you live well expunge your record. If not, oh well. He went. Things made a lot more sense after that.",
   "created_utc": 1692384191,
   "score": 186,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jws1roz",
   "message": "My cousin was hit and killed by an 18 wheeler when she was 6. Dude was on his phone when it happened and they went to court, decided to drop the charges on him, but his company refused to pay them anything for damages caused and whatnot. A few of my uncles (who were a part of Hell’s Angels were buddies with some people on the police force got this dudes address, killed him and then torched the trucking company to the ground. They were never caught.",
   "created_utc": 1692394713,
   "score": 70,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwrzzs3",
   "message": "My grandma had an affair with a catholic priest while she was married and then left her high school sweetheart who she had 5 children with. Then she ended up living with said priest and her kids had to lie and refer to him as an uncle when people asked them about their living situation. \n\nI always thought it was true love; I found and kept letters and notes they wrote each other when he was overseas with the military and it seemed so genuine and I’d always heard so many nice stories (and I suppose it could have been true love.) I was raised to believe that my biological grandfather (my dads real dad) was a monster. I had been under the impression he left my grandma and abandoned his 5 five children. My one aunt died in a drunk driving accident and he couldn’t be bothered to show up. I never met him my entire childhood. I was literally encouraged to actively hate him. They said he remarried and basically started a new family and was controlled by his wife. \n\nThe priest essentially raised my dad and aunts and uncles and they have always revered him. He died before I was old enough to have any memories of him but I’d always looked at him with a positive light. He’d taken my grandma and a couple of the kids to Hawaii, bought my grandma a suburban and the house was in his name. My grandma was even left his military benefits (still unclear on how this was finagled.) He paid for the kids colleges. He had an incredible life. He had pictures with Bob Hope and other celebrities, got to travel a ton of places, etc. \n\nOne day I was curious if he had any relatives alive and if they had ever known about this salacious relationship. Then I googled him and it changed my life forever. \n\nHe (posthumously) was accused in a lawsuit, with a large group of priests, of wrongdoing over an extended period of time. You can guess the nature of the lawsuit. It was on several law websites and I found the lawsuit papers. Surely enough his name was mentioned. Unease began to ensue. \n\nI did more digging and eventually found a 16 page document. This document was specific to him and included a police report and internal Catholic Church investigations into his transgressions among other things. Early into his priesthood he was accused of harboring a runaway 14 year old girl. He had explanations for everything… ofc. Reading the police report was absolutely devastating bc it seemed like the police did no due diligence and nothing came of the report. Then there were pages worth of internal Catholic Church investigations in which I learned he would have young, distastefully dressed girls hanging out in his rectory and was drinking and showing up to events and/or not showing up at all. He once said he had been called by the military and was away from the church, except he lied and had been drinking, gambling and philandering with women. Members of the church and other priests wrote anonymous letters about his conduct and asked for his removal. There were bouts of rehab and probation but he was moved to another church. Some of the same antics occurred. You get the picture. This man my family had told me to revere as a literal god send was in fact NOTHING of the sort. \n\nThen I found a summary of all his transgression over the years that led to his “retirement.” This is when I found out when he took my grandma, dad and his two siblings to get the suburban he physically assaulted my grandma and assaulted kicked my dad and his siblings. I cross referenced all of this information with birth years, where they grew up and lived and the fact my uncle still has the suburban. \n\nI was by myself when I found all of this out and I’ve asked my dad if he’s ever looked him up and he said yes. So he knows of the lawsuit but I haven’t asked if he dug as far as I did to find this 16 page document. I don’t know how to approach this or if it’s even worth bringing up to him. I’m curious how much he knows and if he remembers being assaulted. I’m also extremely disturbed if they knew of his past and chose to lie to me about this man. If they didn’t, then my heart breaks for what they endured with years of lies, abuse and the hurt they felt. It also makes me question my grandmother and he choices and everything she subjected her children to. \n\nMy dad and aunt reconnected with my biological grandfather a few years ago. He eventually came to visit us from across the country. I was in my mid-20s meeting my biological grandfather. I am truly apathetic to him and forming a relationship with him. My moms mom had 2 husbands and those were my grandpas. My grandpas and grandmas have all passed now so I’ve mourned losing all of my grandparents. I do not feel this man is my grandfather and have been at peace with this for a very long time. \n\nHowever, it’s made me realize, my grandma abandoned him. He was the one who came to the church with the suspicion she was having an affair with the priest. At that my heart breaks for him. The priest also did my aunts funeral, so while some piece of me feels I can’t forgive him for not going to his own daughters funeral, I also can’t imagine having to face a priest who my wife ran off with. \n\nI’m so torn that my family pitted me against this man that is my biological grandfather when this priest was clearly a fraud and lacked human decency and morals. It is also clear that my grandma made extremely questionable decisions and (with other unrelated reasons) had tarnished my vision of her. \n\nNeedless to say one of my wild facts has changed significantly from my grandma fell in love with a priest. Truly so conflicting and heartbreaking.",
   "created_utc": 1692394006,
   "score": 146,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr309w",
   "message": "My extremely wealthy uncle was going downhill quick with Alzheimer’s. Before he was too far gone, he apparently made a deal with my aunt that when things got the the point that they would have to send him to a nursing home, she would kill him instead. He wrote all of this in a letter and gave it to the attorney of their estate. When the time came, I don’t know why she chose to shoot him in the back of the head instead of something less violent but she did. It was a pretty big trial with a fair bit of news coverage, and it really blew up when the lawyer testified and brought forward the letter. My aunt served like 2 years I think and was released on parole.",
   "created_utc": 1692381645,
   "score": 114,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr0csq",
   "message": "My mom’s cousin (my second cousin) molested her growing up multiple times. She was apparently getting molested herself by her brother (? I think). Later on that cousin got married to a guy who went on to molest their daughter they had together. Came out later he was keeping a treasure trove of child pornography in the house, with bits of their daughter included in that. He was busted by the police which ended in a shootout in some random business building, made the news and everything. He got shot and died during this whole ordeal. They’re probably the two most fucked up individuals I’ve ever known.",
   "created_utc": 1692380679,
   "score": 105,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwra2is",
   "message": "I was 6 or 7 when my father died. He was a terrible alcoholic but I didn't understand alcohol as a kid. I'm 19 now and my mother has told me he wasn't just an alcoholic, he was a chronic liar, manipultor and abuser. He strangled a dog and killed it infront of my mom cause she was going to leave him. He was addicted to cocaine and when he didn't have any alcohol he'sake my mom go get more or he'd kill another animal. He'd frequently beat the ever living shit out of my mom and when she finally left with him my entire family both on my mom's and father's side talked shit about her for leaving and didn't care about mine or her well-being. Worst part is when suing for custody he actually got weekends and then on Sunday would take me to the super nice churches that's judges and lawyers involved with the case went to.",
   "created_utc": 1692384254,
   "score": 95,
   "submission_id": "15uj4um"
  },
  {
   "comment_id": "jwr1pzv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15uj4um"
  }
 ]
}