{
 "submission_id": "15ujjdu",
 "title": "Is it acceptable to say that you’re “from” a place, if you weren’t born there? Why or why not?",
 "selftext": "",
 "created_utc": 1692362545,
 "permalink": "/r/AskReddit/comments/15ujjdu/is_it_acceptable_to_say_that_youre_from_a_place/",
 "score": 184,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ujjdu/is_it_acceptable_to_say_that_youre_from_a_place/",
 "comments": [
  {
   "comment_id": "jwpq2jm",
   "message": "I was born in place A, moved to place B from age 10-23, place C from 23-43. I mostly say I am from place B because it was my most formative years that I remember, and still have a lot of friends from there. I got depressed when i realized I have lived in place 3 longer than anywhere else.",
   "created_utc": 1692363007,
   "score": 104,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwptwbp",
   "message": "What about Military brats? They sometimes move every 4 years or so, and really aren’t “from” anywhere.",
   "created_utc": 1692364711,
   "score": 18,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwprxp7",
   "message": "My parents moved to the US a little before I was born from their home country. I was born and litteraly six months later we were back in their home country. Even now when I moved back to US as an late teen, since I have been here for a year a would say that I am from my parents country because that was the first languge I learned, where I grew up, made friends... even if I wasn't tehnicaly born there. But give the US a decade I will call it home.",
   "created_utc": 1692363853,
   "score": 13,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwppqnv",
   "message": "A decade in NYC and you are a New Yorker. The same thing probably applies to other destination cities like London, Paris or Hong Kong.",
   "created_utc": 1692362852,
   "score": 27,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwps0qc",
   "message": "Totally fine. I've lived in London for twenty years. I hate where I was born with a passion and would never admit to coming from there. I'm not from another country but a perocial town in the west midlands. I have no attachment to that place anymore and have not been there in fifteen years. I self identify as a Londoner.",
   "created_utc": 1692363891,
   "score": 12,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwprtvr",
   "message": "I suppose if you was born in America and you left when you was two years old to live in England and you are now 30 years old. You would be definitely be more English than American. But wouldn’t it be easier just to say I am a dual citizen",
   "created_utc": 1692363806,
   "score": 8,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwptkzq",
   "message": "If you are currently residing there, you are from there. Plain and simple. I never say I am from the place I was born in, I say I was born there.",
   "created_utc": 1692364574,
   "score": 12,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpqlly",
   "message": "We moved from Chicago to Wisconsin when I was in second grade. When people ask, I say I’m from Wisconsin, but I was born in Chicago.",
   "created_utc": 1692363248,
   "score": 3,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwptxhb",
   "message": "I think being \"from\" somewhere has more to do with where you were raised. My mother was born in Germany to two American parents on an extended holiday. They returned to the US shortly after, where she has spent the last 64 years or so. Obviously, she's not \"from\" Germany, she's from America.\n\nI had a roommate in college who was in a similar situation. Despite being Indian, and he and his whole family living in India, he was actually born in Ireland. He had a T-shirt that said, \"Kiss me, I'm Irish.\" Which was, of course, meant as a joke.",
   "created_utc": 1692364725,
   "score": 3,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq8mvc",
   "message": "Depends on the context. My wife and I have lived in Boston for more than a decade, so when we travel internationally, we tell people we're from Boston, as that is where we live and where we traveled there from. But when people in Boston ask me where I'm from, I tell them where I grew up.",
   "created_utc": 1692370542,
   "score": 3,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpq7wk",
   "message": "People are going to take offense about anything these days. I was born in a certain city and I lived there until I was ten. After that my parents divorced and I moved to a different city.        \n\nI can’t really say that I am “from” either place without someone being offended. I would just say that I live in such and such place currently. I wouldn’t overthink it.",
   "created_utc": 1692363074,
   "score": 6,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpq48g",
   "message": "It depends. If you were born in England but spent the rest of your like in Ireland, you are Irish. You have the passport, the accent, you grew up there you are from there.\n\nIf you grew up most of your time in another country, say you’re born in Pakistan stayed there for 10 years and then moved to England you are from Pakistan.\n\nIt’s whatever you associate as your home.",
   "created_utc": 1692363028,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpss00",
   "message": "Yes. My wife moved to the country we both live in when she was a young child. Her parents used to travel for work. She is \"from\" here. She went to school here, she talks like she is from here. I knew for a few weeks before finding out she was born elsewhere. If anything it's wrong for her to say she is from the country of her birth. She doesn't speak the language or really remember being there.",
   "created_utc": 1692364224,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpu1d8",
   "message": "I've always had a hard time with this one because I was born in Nebraska and lived there til I was 4, then lived in California for 7 years, then Colorado for 10 years before I moved to Oklahoma. \n\nWhen I lived in Colorado, I said I was from California because I spent all of elementary school there and had no memories of Nebraska at all pretty much.\n\nNow I say I'm from Colorado because I finished out the rest of my schooling there and felt more comfortable there.\n\nHowever, now I've lived in Oklahoma for longer than I lived in any of the previous states, but I don't enjoy living here, nor am I comfortable. It doesn't feel like home, it just feels like a place where I have a good job and an affordable cost of living. \n\nBut I guess to answer your question, I've never told anyone that I'm from Nebraska, only that I was born there before moving to California. But I also don't tell anyone I'm from Oklahoma unless it's in the context of me being in another state and I'm asked where I'm visiting from. It's always ever been California or Colorado, the two states I \"grew up\" in.",
   "created_utc": 1692364773,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpufis",
   "message": "My dad was in the military, I don't remember anything from where I was born because we loved before I turned 2. So yeah, can't say I'm from a place I have no memories of.",
   "created_utc": 1692364939,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpvmee",
   "message": "Yeah. \n\nMy friend was born in Hong Kong and lived there for 4 months before his parents came back to the UK having been posted out there. \n\nI think we'd all struggle to call him Chinese.",
   "created_utc": 1692365447,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpwjre",
   "message": "Regionalism is strong in England, I was born and raised in Shropshire, I live in the East Riding now. I consider myself a Salopian (someone from shropshire) I like the East Riding but I always think of myself as Salopian. My children (when I sire some) will be raised in the East Riding and probably consider themselves Yorkshire born and bred.",
   "created_utc": 1692365837,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpwrju",
   "message": "I avoid saying I'm from \"Boston\" because just about everyone from a suburb near the city says it.  I just say \"a town North of Boston.\"",
   "created_utc": 1692365927,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpz5s7",
   "message": "I battle this some times. My father is from Poland, my mother is from the middle east. I am from here. I was born here and live here therefore I am from Ohio. People who've seen my name and skin color assume that I am from there, but I assure you, I am from here.",
   "created_utc": 1692366902,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpzlw4",
   "message": "The place you are \"from\" is the location of your primary residence. Why? Because for a lot of people, it doesn't make any sense to talk about your birth city. Let's say I live in Wyoming but I was born in California, somewhere I wasn't in since I was 1 year old. If I go traveling across the USA and say \"I'm from California\" then I'm going to get all sorts of questions about what it's like in California even though I have no recollection of what it's like.",
   "created_utc": 1692367086,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpzt9z",
   "message": "I was born in Manhattan, raised in Brooklyn, lived in New Jersey for a little, and live on Long Island now.    \n\nI’m “from” NYC.",
   "created_utc": 1692367168,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq1cfq",
   "message": "I struggle with this question a lot. My family and I all immigrated to the US and moved around many different cities/states. I was born in a country in the Middle East, lived there for three years then moved to US city A for one year, then city B for 2-3 years, then city C for 5 years, then city D for 5 years, then I (an adult at 18) moved back to city A and have lived there since (now on 7 years)... I have lived in city A for the longest period of my life, but similarity people here get snarky about actually being \"from here\". I hate going into the long ass spiel about where I'm from so I just tell them I moved around a lot as a kid but prior to City A I lived in city C. I plan to live out my days here so I'm hoping I can eventually one day say \"I moved around a lot as kid/growing up but I've lived in city A majority of my life\". I don't think I would ever be able to say \"I'm from city A\".",
   "created_utc": 1692367778,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq2fnf",
   "message": "I would say so. I was born in one state but only lived there from 0-3 \n\nI moved eventually to State D from ages 10-22 (I moved around a lot) and I spent most of my childhood and early adult in state D so I do say I’m from state D",
   "created_utc": 1692368205,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq3uo8",
   "message": "I’m sure they’re not going to arrest you for it",
   "created_utc": 1692368746,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq511l",
   "message": "While I have Vietnamese origins, I was born and raised in Belgium. So, when I'm asked, I reply: \"Belgium\". But there was this one time when I was in the US, I gave the same reply I usually do but then the person replied back: \"No, seriously where are you from?\". \n\nSo I guess that person was expecting me to tell an Asian country...",
   "created_utc": 1692369191,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq5fuj",
   "message": "I'm a military brat.  I only lived where I was born for a few months and then my father got transferred to another state.  I never lived anywhere for more than two years until my father got out of the military.  We moved to where I am now when I was 16.  Been here ever since.  This is where I say I'm from.",
   "created_utc": 1692369347,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq6fqh",
   "message": "In my experience being a US born hispanic citizen, who lived abroad... People are generally asking 1 or more of 3 questions. Where were you born, as in literally what place did you come from? Where is your culture from, where did you spend your formative years that shaped you mostly into who you are today? Or... where do your genetics come from, you look different? \n\nIm paraphrasing what the thought process is. The way i grew up, I can answer all 3 and have completely different answers so I've thought about this question a lot. Many people ask and it's usually one of those 3 they are curious about.",
   "created_utc": 1692369722,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq6q84",
   "message": "It’s contextual. I grew up in Klaipėda and my experience there formed the biggest part of who I am so when I’m talking about myself I say I’m from there. But I’ve lived almost just as long in a few other places so depending on whats being talked about I’m from there too.",
   "created_utc": 1692369830,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq75pf",
   "message": "I was born in LA but my we moved to Ohio when I was 1 year old. I tell people I am from Ohio.",
   "created_utc": 1692369991,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq7c1q",
   "message": "well, I'm really not from anywhere.  born in LA, not the city, lived there very briefly and moved to where ever my dad's orders took him.  don't talk with a norleans accent, 1 yr here 2 yrs there 4 years here 3 years there etc.  so that's what I say.  heck if I could choose, I'd say I was from Holland lived there 3 years.",
   "created_utc": 1692370057,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq9lck",
   "message": "No. Just say where you’re from..",
   "created_utc": 1692370898,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq9qo6",
   "message": "I usually just answer with where I grew up.",
   "created_utc": 1692370954,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq9rnk",
   "message": "Of course. Depends on the context.\n\nFor most people, it'll be where you grew up. If you were born in Thailand but moved to Milwaukee when you were two, you might tell kids in elementary school that you're originally from Thailand. But if you grow up and move to NYC, you should say you're from Milwaukee when you meet new people. If you live in NYC for a decade and go on vacation to Mexico, you can tell people you meet there that you're from NYC - because they're making small talk and asking where you traveled from, not your whole life history. If they say they're from Milwaukee, you can say oh hey, I grew up in Milwaukee! Just give the information relevant to the conversation - it's not a test and no one's grading you.",
   "created_utc": 1692370964,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqb472",
   "message": "Yes, it is.It doesn't really matter if you were born in Teheran if you then went to London at age 2 and lived there for 25 years - if someone asks you where you're from, London is a perfectly acceptable answer imo.  \nAs is \"I was born in Teheran but I've lived in London ever since\" or \"Originally I'm from X but I live in Y\".\n\nI also depends on the context of being asked I reckon, but for a simple \"Where you're from?\" I think it's perfectly acceptable.  \nDepending on how you look people might ask for that reason, but really, either let them clarify (some will ask out of genuine interest/relevancy, some out of prejudice) or just answer how you want to answer being knowing it's none of their business where you lived for how long.  \n\n\nI've once asked a beautiful girl where she was from (not really intending to go one direction or another) and she responded with \\[City near me\\] and eventually told me her parents are from Jordan and she was born there. I never would have considered either of the of the answers inappropriate and would have just specified if necessary by asking \"Where do you live?\" if I wanted to know where she currently lives, for example.",
   "created_utc": 1692371464,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqb751",
   "message": "Sure. Personally for me though it depends where I'm at. In the town I live in now I tell people I'm from the town that I grew up in. But when I'm in other places, I'll say I'm from the town I live in now. Maybe will clarify that I grew up in town X though if it comes up.",
   "created_utc": 1692371495,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqbtcu",
   "message": "I was born in australia and I lived there for 4 months before I moved and all my family is from South Africa and I’ve lived there for 5 years so I say I’m from South Africa because I am basically 0% Australian",
   "created_utc": 1692371727,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqbwva",
   "message": "Technically you're from any place you've been, specifically where you just were.  So if someone says \"where are you from\" to me, sometimes I answer \"the office upstairs\".",
   "created_utc": 1692371763,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqcqoy",
   "message": "I was born in A. Moved away at 5. Grew up somewhere else entirely. \n\nAm I from A or from B?",
   "created_utc": 1692372066,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqdr7a",
   "message": "i think it means more where you spent your formative years, where you grew up, what influenced you most.",
   "created_utc": 1692372438,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqe779",
   "message": "I was born in Michigan but grew up in Florida, so naturally I say I’m from Vermont.",
   "created_utc": 1692372602,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqeggz",
   "message": "I grew up in one state, moved as a teen to another. Moved to a third at 29 for work. I feel like I am FROM either of the first 2 states. I lived in the third.",
   "created_utc": 1692372695,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqespf",
   "message": "No. And not only that, simply being born in a place doesn't give necessarily give you that privilege either.",
   "created_utc": 1692372822,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqf83l",
   "message": "I never know how to answer that question.... I was born in DE, spent 4 years in the US, a year in France, 20 years in the UK and coming up to 10 years in Spain. I'm half French, half British.  \n\n\nThough my education was British and thus culturally come across British, I don't feel at home in the UK and thus don't feel like I'm from the UK",
   "created_utc": 1692372979,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqfs8t",
   "message": "If someone is asking where you're from it makes the most sense to reply with where you were born or spent your first several years as that's what they're asking. If I asked someone where they were from and they came back with well spent my early teens in NYC. Imma raise an eyebrow not asking where you moved to but where you're actually from.",
   "created_utc": 1692373182,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqg4of",
   "message": "I was born in country A but ethnically and legally I am from country B. I am planning to immigrate to country C soon. I still don't know what to say when someone asks me where I am from.",
   "created_utc": 1692373308,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqgd3p",
   "message": "I moved to where I live now at 18. I wouldn’t tell a local that I’m “from” here, but if I’m traveling and someone asks where I’m from, I’ll often just say where I currently live.",
   "created_utc": 1692373394,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqgea6",
   "message": "I just tell people that asking where I'm from is a loaded question. Born in city A, moved internationally to city B, moved back to domestic city C, then city D, then city E, all before I finished high school. Then I lived in several more places before settling down where I am now for work, except it's not somewhere I want to live long term so I'm aiming for yet _another_ move in the next few years.",
   "created_utc": 1692373406,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqgl9k",
   "message": "What about if you weren’t born there, but grew up there, because there isn’t a maternity hospital in your town/City?",
   "created_utc": 1692373476,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqgssq",
   "message": "I was born in city A and have lived in and around it for 53 years and even though I live 25 miles outside of the city limits, let alone the city itself, I say I'm from city A for two reasons, one, everyone knows it at least to some extent and two, never tell strangers the exact location of your home",
   "created_utc": 1692373552,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqh9lg",
   "message": "I gave up on this. My answer is literally \"it depends\". My parents are immigrants. Both Americans and Mexicans have mixed answers when I tell them my parents are Mexican and I was born in the U.S. depending on their reasoning both Mexicans or Americans have said either \"so you're from México\" or \", so you're from America\"",
   "created_utc": 1692373722,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqhbyw",
   "message": "I would just say I am from X country, and live in / near Y city.\n\nI have lived many places/countries as I was growing up, and different people will mean different things when they say where are you from.",
   "created_utc": 1692373746,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqhfbc",
   "message": "So you’re asking if it’s acceptable to lie? Did you not learn about this when you were a kid then?",
   "created_utc": 1692373778,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqhhem",
   "message": "I like Tyrion Lannister",
   "created_utc": 1692373799,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqhmvn",
   "message": "I use “originally from” and “currently from” depending on the conversation because I’ve moved between states a few times.",
   "created_utc": 1692373853,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqhtun",
   "message": "When I moved to south Wales from England back in 2018 one thing that it took me by surprise was that people would ask me \"Where are you from?\" and they didn't mean \"Where did you grow up?\" they meant \"Where do you live?\" - just a regional difference I guess. I only lived there for about 4 years and I never really got used to it.",
   "created_utc": 1692373922,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqhua1",
   "message": "I was born in place A, but moved to B when I was a little under a year old. I feel like it’s weird to say I’m from A when I remember nothing about it.",
   "created_utc": 1692373926,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqiaj3",
   "message": "Personal choice. You can easily say you are from the place you were born/place you grew up/place you currently live at (if on holiday). Hell if you want you could even say the country your parents are from as that's what people are normally asking for.",
   "created_utc": 1692374091,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqiawr",
   "message": "I have moved 19 different times in my childhood, I've spent a grand total of 6 months where I was born, as a baby.  I have found that if I say I am from where I was born, people ask questions I can't possibly answer (just for casual conversation).  But if I say I am from where I have spent the most time, I can generally have a conversation about that area.",
   "created_utc": 1692374094,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqib6w",
   "message": "Absolutely. Sometimes I am from Coventry. Sometimes I am from Physics. Sometimes I am from Sonemat. Sometimes I am from next door...",
   "created_utc": 1692374097,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqiki5",
   "message": "I was born in A, but my father was born in B. In our culture we're from where our father is born, so I say that I'm from B. I tend to clarify the place I was born though so there's that...\n\nThere are examples such as mine to justify saying that you're from a place without requiring to being born there.\n\nEdit: Better wording",
   "created_utc": 1692374189,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqiu27",
   "message": "Yes. Wasn't born in my town but went 1st through HS graduation. Why would I claim a home town I'm too young to remember?",
   "created_utc": 1692374285,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqix70",
   "message": "Yes, you’re from the place you grew up in, not the place you were born\n\nOr if you moved in adulthood, then if you’ve spent significant time in the new area",
   "created_utc": 1692374317,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqj0b3",
   "message": "\"I've lived a lot of places but I just moved from \\_\\_\\_\\_\\_\\_\\_\\_\\_\"",
   "created_utc": 1692374348,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqjecd",
   "message": "My parents came from place A. Lived there nearly their entire childhood years - My mother's family trace there family back 250 years to the place.  After they married, they moved to place B. In the year they lived there, I was born, and shortly after they returned to place A.\n\nDespite moving away as a child, and living in multiple places including abroad, I consider myself as being from A even though I have lived and worked in place B for a large proportion of my adult life.\n\nPlaces A and B have a fierce rivalry, particularly in football. It is quite fun to say I support A even though I was born in B.",
   "created_utc": 1692374488,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqjfg9",
   "message": "It's situational for me. If I am traveling I say I am from A, where I reside currently or have been for a while... if I am in A, then I usually reply with where I lived previous, B, or where I grew up, C, or where I spent my 20s and met my husband, D. I don't love talking about myself too long so I try to trim details. Some people inquire further \"Wow, A!! Did you grow up there?\"",
   "created_utc": 1692374499,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqjjeq",
   "message": "I feel like it's super simple to answer with \"raised mostly in A; my family is from B but I don't remember living there\"\n\nOr \"I'm A; but my cultural background is B\"\n\nOr \"I'm A but apparently I have roots in B\"\n\nThat last one is for the age old question of claiming a DNA Heritage you don't necessarily ascribe to.  \n\nPersonally.... I'm American, my DNA is a bit of a Heinz57; but MOST of my DNA is Irish and Italian. I can trace both in less then 5 generations. Tho i don't typically claim either necessarily. That'll change in a few years tho since I qualify to apply for multiple citizenships... maybe I can visit and find distant relatives and learn about my roots",
   "created_utc": 1692374539,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwppkn4",
   "message": "It really depends. Normally when someone asks \"where are you from\" they are really asking \"in what place were you a resident immediately prior to being in this place\".\n\nFor example, if someone was born in China, then moved to Australia at age 2, then they went to the US 20 years later for a holiday, if someone in the US asked where they are from, the person would probably reply with \"Australia\" since that is where they were immediately before being in the US.\n\nIf they were asked in Australia, they would probably say \"China\" since that is where they were immediately before that.",
   "created_utc": 1692362774,
   "score": 2,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq6fm4",
   "message": "Personally: My Mom is from a northern US state. She’s lived here for over forty years, but she still says she’s from the state where she was born. I was born in the city where my Mom moved to and where my Dad’s family (his Mother’s and Father’s families both immigrated here in the 1800s from different countries over the pond), so I say I’m from the city where I was born, where my family has lived for over 100 years. I will speak of my familial heritage if someone asks, but I’m part of the evolution and preservation of my city’s culture. I’ve resided in other states, but I would think it insulting to people who are from those states for me to claim that I was from there, just because I lived there for a time and I wouldn’t propose changes to the culture and heritage of those states just because I moved there. If I was born in my Mom’s state and grew up there, but lived here now- I would say I’m from the state where my Mom was from, even though half of my family tree is rooted in where I live now. \n\n\nPreservation of culture, heritage and roots is really important where I’m from. Natives get pissed because transplants move here because they’re in love with those aspects of my city and one of two things inevitably happens. 1.) They move here, adopt the culture and become a part of it, preserve it and thereby further enrich it OR 2.) They move here, adopt the aesthetic aspects of the culture, but don’t preserve the  actual culture and heritage itself, the flow of you will, and it causes a lot of problems. Whole historic neighborhoods have been “taken over” because the locale is kitschy and native residents are displaced due to rising costs that transplants will happily pay, which in and of itself is destructive to the preservation of our heritage and history.",
   "created_utc": 1692369721,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwppz0g",
   "message": "Yes if family is there",
   "created_utc": 1692362961,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpp8av",
   "message": "[deleted]",
   "created_utc": 1692362610,
   "score": 0,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpp7r5",
   "message": "Mhm",
   "created_utc": 1692362603,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwppeiy",
   "message": "Depends. If you’ve lived there for multiple years than it’s yes but if you’ve never lived there it’s a no",
   "created_utc": 1692362694,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwppkdr",
   "message": "Yes. Because humans are capable of understanding nuance and communication that they live somewhere while not having been born there.",
   "created_utc": 1692362771,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpplc1",
   "message": "Depends on how much time you spent there before moving here",
   "created_utc": 1692362783,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpqwcw",
   "message": "“I grew up in New Orleans but I’ve been working here since before you were born. So who’s more from here?”",
   "created_utc": 1692363384,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwpyoe8",
   "message": "I say I am from the capital even though I am from a county on the border, as most people don't know the county",
   "created_utc": 1692366708,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwq7e0t",
   "message": "Who tf gonna stop you? \n\nIf you were born in A then moved to B at age 4 where you still live, you’re from B.",
   "created_utc": 1692370078,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqj0i1",
   "message": "Yes bc my soul belongs to New Orleans. I was simply born in Alabama is all.",
   "created_utc": 1692374350,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqjckq",
   "message": "I have now lived in the place I moved to longer than the place I moved from. I just say I'm from this state and move on with the conversation.",
   "created_utc": 1692374470,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqjx1o",
   "message": "My mother was born in British Columbia and then they immediately left for Ontario. She's never once said she's from British Columbia in her life. \n\nI don't think it matters truly :)",
   "created_utc": 1692374678,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqjxgv",
   "message": "I think it’s ok to say you are from a place. It’s actually different than being born there.",
   "created_utc": 1692374683,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqk1pz",
   "message": "I say I'm from the UK, but I was technically born in Germany. However, my parents and siblings were all born in the UK, and we moved back here when I was 2.",
   "created_utc": 1692374726,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqk5yk",
   "message": "I'd say yes. I'm Canadian, most people only know a handful of cities. Much less the smaller cities, so I just say toronto because it's easier and most people know it lol.",
   "created_utc": 1692374769,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqke1p",
   "message": "I was born in Boston but I moved to California when I was 13.\n\nBecause I grew up out here I just say I'm Californian.\n\nSometimes I'll just say I was born on Bostin but grew up in California.",
   "created_utc": 1692374851,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqkue3",
   "message": "If you have lived in that place longer then the place you were born then yes.",
   "created_utc": 1692375018,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqkxd3",
   "message": "Sure, because sometimes it just doesn't feel right telling someone where you're from. Also if you lived somewhere long enough you can say you're from there. No need to give the whole family history of relocating.",
   "created_utc": 1692375049,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqkyi6",
   "message": "Yes. I accept it.  \n\nNext question.",
   "created_utc": 1692375061,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwql00d",
   "message": "I walked through Compton, so I usually say I’m from there.",
   "created_utc": 1692375076,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqlabr",
   "message": "If you identify with the place, why not.\n\nI was born in Hong Kong. Grew up in Vancouver for most of my life. So I tell people I'm \"from\" both places.\n\nMy sister is on the same boat, except she relocated to California in the 2000s and has now lived there longer than Vancouver. But she will still say she's \"from\" Vancouver as well, but might hesitate to say that about Hong Kong because she feels less of a connection there (which is odd because she lived there longer than I have).\n\nSo really, I think it depends on where you feel that you belong.",
   "created_utc": 1692375184,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqld8o",
   "message": "The location where you were dropped out from your mama’s coochie is meaningless. You are ‘from’ wherever you feel like you belong, which is typically the place you were raised.",
   "created_utc": 1692375213,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqliy5",
   "message": "I know a chick that tells people she was born in NC when she was born/raised in DE.\n\nWhy she does this, I have no idea.",
   "created_utc": 1692375273,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqlkka",
   "message": "Ugh I knew someone in college was “from Texas” aka she was from Ohio and liked the idea of text as because she lived there 8 years… this started my dislike of people who push they are from Texas because no one gives a shit but you. I get being proud of where you are from but ummm she wasn’t from there",
   "created_utc": 1692375290,
   "score": 1,
   "submission_id": "15ujjdu"
  },
  {
   "comment_id": "jwqlocl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ujjdu"
  }
 ]
}