{
 "submission_id": "15ukfzk",
 "title": "Straight people of reddit; have you ever been hit on by a gay person? How did you respond?",
 "selftext": "",
 "created_utc": 1692364886,
 "permalink": "/r/AskReddit/comments/15ukfzk/straight_people_of_reddit_have_you_ever_been_hit/",
 "score": 64,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ukfzk/straight_people_of_reddit_have_you_ever_been_hit/",
 "comments": [
  {
   "comment_id": "jwpueyi",
   "message": "Yep; a few times.\n\nI just said \"I'm flattered, but I'm straight.\" and I was left alone.",
   "created_utc": 1692364932,
   "score": 182,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpv056",
   "message": "yes\n\nextremely flattered and a huge ego boost\n\ni normally respond positively, and have a nice chat.\n\nbut this has only happened a few times.",
   "created_utc": 1692365185,
   "score": 31,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpv13s",
   "message": "I had no clue until someone pointed it out to me later.  I just thought he was friendly",
   "created_utc": 1692365196,
   "score": 51,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2c6r",
   "message": "If I have, I was as oblivious as I am when a straight person hits on me",
   "created_utc": 1692368169,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1fny",
   "message": "\"Wrong team, but glad you appreciate the game\"",
   "created_utc": 1692367814,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpyuad",
   "message": "“Nice” \n\nI was browsing the hookups he had on his phone and said they mostly looked similar to me. \n\nHe said I’m totally his type and to hit him up if my relationship didn’t work out. \n\nI said “nice, will keep it in mind”",
   "created_utc": 1692366773,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpurmk",
   "message": "Oh yea! It definitely made me rethink how I flirt with girls.",
   "created_utc": 1692365084,
   "score": 29,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1h1g",
   "message": "I was pretty confused but not offended.  It was amazing how less scary being hit on by a woman is than being hit on by a man.  Interesting experience.\n\nI tried to be chill about it and certainly wasn't offended.",
   "created_utc": 1692367829,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpyvhx",
   "message": "3 times, yes I counted and keeping score. I'm not offended by it.",
   "created_utc": 1692366787,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpxphe",
   "message": "\"you seem like a cool dude, but I just don't swing that way\" proceed to joke with them",
   "created_utc": 1692366316,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq0z7x",
   "message": "S'd his D just to get him off my back.",
   "created_utc": 1692367631,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpzoo0",
   "message": "A couple of maybes, but one definite was when I was at an LGBT bar with my GF and two lesbian friends of ours. I went over to the bar to order another round. A guy sitting at the bar threw out a pickup line, something about not seeing me around before or some such, and offered to buy me a drink. I smiled, said no thank you, told the bartender my order and went back to my table.\n\nLooking back on it, I found the whole thing flattering. Not much to add. The maybes I mentioned in the first line are the same way - I found them flattering and I don't really get straight guys who fire off when a gay man winks at them or something...",
   "created_utc": 1692367117,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwputwn",
   "message": "Yes.\n\nThat I was flattered, but that women are really my thing. So he introduced me to his friend. We didn’t hit it off, but it was cool.",
   "created_utc": 1692365111,
   "score": 22,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpwr2m",
   "message": "Yep, it’s always flattering when someone finds you attractive. I just hit em with the “thanks man, I’m married though”",
   "created_utc": 1692365921,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq0l65",
   "message": "Openly hit on not sure but definitely flirty. I found it flattering but find most gay men are super respectful when you tell them you're straight. They seem to understand no means no more than hetero folks.",
   "created_utc": 1692367477,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1e1g",
   "message": "I had a gay dude ask me to watch him go take a piss once. Made me very uncomfortable. Dude knew I was straight as well\n\nLiterally just said no\n\n\n\nAbout 20 times\n\nHe would not leave me alone",
   "created_utc": 1692367796,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpw9pr",
   "message": "I politely declined and felt flattered.",
   "created_utc": 1692365721,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq15az",
   "message": "How do you reply? \"you know I'm straight, right?\"",
   "created_utc": 1692367698,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1gw3",
   "message": "Typically it's a \"thanks, but I'm straight\". Sometimes there's liquor involved and shit gets handsy and it's time for a firm shut down, in very clear words. Those suck and typically end in hurt feelings.",
   "created_utc": 1692367827,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq3512",
   "message": "As a guy, getting hit on by gay dudes in college was probably the biggest ego boost in my life. Sometimes you can't tell if a girl is being flirty or friendly, but dudes make it fucking obvious.",
   "created_utc": 1692368476,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq0axi",
   "message": "Like when girls flirt with me, I had no clue.",
   "created_utc": 1692367365,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1mc3",
   "message": "I got messaged by a gay guy on Tinder once. I was very flattered, and he had adorable dogs. I'm not sure why that happened because the profile was set to man seeking woman, but every once in awhile a gay person would pop up when I was scrolling through. I talked to him for a bit, genuinely nice guy and made me feel really good",
   "created_utc": 1692367887,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq0q6x",
   "message": "A mouth is a mouth. Let’s leave it at that.",
   "created_utc": 1692367532,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpytdf",
   "message": "Several times but I was always to stupid to get it. A girl asking me if she could touch me, and me getting confused, because I thought I had an insect or something on myself and she was asking to remove it... or a friend being really obvious and me thinking it was a joke...",
   "created_utc": 1692366764,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpz0o5",
   "message": "Yeah quite a bit a a straight men going to a lot of alternative techno events (a lot of them are organized by queer associations in Europe).\n\nI don't mind, it boost my self-confidence if anything. Most of the time when when I sense that a man is attracted to me (they make it more obvious than women) I will just smile politely but not follow with any amore positive signals, most of the time it's enough. People at parties tend to bedrunk / fucked up thought, and some gay parties are definitely on the wild side, so if a men start flirting / touching me I also wouldn't mind and just say that I'm hetero. \n\nA lot of time it will create a playfull moment with other people (even after I told them i like women) so I like those interractions.",
   "created_utc": 1692366845,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpz5f8",
   "message": "Yes. It felt nice being complimented by the same sex. I told them “Thank you very much but I’m straight” and they were very respectful about it.",
   "created_utc": 1692366898,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpzol3",
   "message": "I probably get hit on by men more than I do women tbh. Doesn't bother me. Can be flattering",
   "created_utc": 1692367116,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpzwbr",
   "message": "A few times, I used to go to an LGBTQ bar to watch friends do burlesque shows and what not. I always just conveyed that I was flattered but I didn't swing that way and wished them a good rest of their night.",
   "created_utc": 1692367203,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq083o",
   "message": "This is going to sound ass backwards, but honestly, it was the ones who tried to be subtle about their flirting that made me feel weird. \n\nI had a gay friend who was pretty chill. One day smoking weed in a car with friends, he's in the front, I'm in the back, he goes to hand me the pipe, and says, \"hey man, you want your d**k sucked?\" I was like ahhh I'm good man. He's just like \"Alright, let me know if you ever do.\"\n\nFrom there, we'd be at parties hanging out, I'd be chilling somewhere and he would just walk by, point at me and ask \"D**k sucked?\" I'd politely decline, he'd shrug and walk away.",
   "created_utc": 1692367334,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq0az1",
   "message": "It has happened at least twice at this point in my life (29). I didn't even notice, but my gf at the time did, and simply did a move to make them know I was with her. Simply felt flattered and moved on. I'm too oblivious to these situations to actually notice.",
   "created_utc": 1692367366,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq3414",
   "message": "Honestly i find it flattering, but i politely decline the same way i would to a woman. “That’s very kind of you, I’m flattered, but I have a girlfriend”",
   "created_utc": 1692368466,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq34kx",
   "message": "A few times. I found it quite flattering. One guy I turned down gave me a job in his shop and it was never mentioned again.",
   "created_utc": 1692368471,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq3o9i",
   "message": "I am oblivious to being hit on by women, and feel I would be similarly oblivious to a gay man's advances.",
   "created_utc": 1692368678,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq4c7h",
   "message": "I welcome all attention",
   "created_utc": 1692368929,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq4mdx",
   "message": "Yes. A few times. The last time she asked me what my name was as we were dancing in a club and I told her and she kissed me. It was nice but I told her I was straight. She was really sweet and said she understood. I felt bad because I thought we were just dancing but I realized that it was more than just dancing for her.",
   "created_utc": 1692369036,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq4vb6",
   "message": "All the time. I'm usually so oblivious that I don't notice until way later.\n\nOne time at the gym this guy asked me to spot him for a few reps on the bench press. He cranked out nine or ten. Was very nice and complimented me on my physique. \n\nTook me a year or so to figure out he was hitting on me",
   "created_utc": 1692369130,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1ct0",
   "message": "One smacked my ass several times. The 2nd time I told him I'd punch him if he does it again. The 3rd time, I kept my promise and he finally stopped.",
   "created_utc": 1692367782,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1l16",
   "message": "Yes; but who doesn't like attention? I'm not into it, but it's nice to hear I'm attractive.",
   "created_utc": 1692367873,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpwo2g",
   "message": "I was walking alone in a west African country back road. A young 20something lad said \"hey hey, you a good looking boy\" which was nice. It was illegal and risky for him to display possible homosexual tendency, so I felt extra flattered and said \"oh thanks mate, very kind!\" and kept walking. I'll take the compliment, thanks.",
   "created_utc": 1692365887,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1ix3",
   "message": "I've been hit on *a lot* by gay guys and, the more times passes, the more guys/girls the ratio. Don't ask me why, I don't know.\n\nI like women only, so I do not answer favourably to men's offers, but I find it quite flattering.\n\nI noticed that many are *very* insistant and sometimes even borderline harrassing. I had a guy make salacious comments, try to touch me, to make me drink and to undress me for several hours straight despite me being very clear with him. However, I do not blame everybody for the behaviour of a few fuckwits.\n\nUsually, these men are very understanding and more friendly than anything else. It's flattering to feel seductive. I like knowing that I can please and I frequently joke about how cursed I am to not be bisexual, because I could have mraow so much more than I did, had I loved guys the way I love ladies.",
   "created_utc": 1692367850,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1jsf",
   "message": "More than once. I say thanks for the attention , but I have a girlfriend.",
   "created_utc": 1692367859,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpzwbh",
   "message": "I was hanging out with this dude in his room, i had no idea he was gay until he started talking about fucking this officer at a local gay club. he told me when i asked him why his but hole felt so lose.",
   "created_utc": 1692367203,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpy8ym",
   "message": "I was at a gay bar a couple nights ago and got a few free drinks and I was very flattered but I had to go up to the guys and and tell them I was straight. They were really nice!",
   "created_utc": 1692366535,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpwrn2",
   "message": "Once in a rave party i go smoke outside. Some dude come to me and be like. You look so clean and tidy. Are you gay? 😁\n\nI take it like compliment and say sorry mate i love womens.",
   "created_utc": 1692365928,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpwiwh",
   "message": "There's magnitude more straight people than gay people.\n\nI'm 41 and never been hit on by straight people.\n\nGuess how many times I've been hit on by gay people.",
   "created_utc": 1692365827,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpushu",
   "message": "I had the opposite a few times. I am transmasc with a not straight sexuality. And I got hit on by straight women and even fucking men",
   "created_utc": 1692365094,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpumqo",
   "message": "[deleted]",
   "created_utc": 1692365026,
   "score": 254,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpznxi",
   "message": "I had another M grab me inappropriately while at a bar and when I confronted him because it was extremely inappropriate he got me thrown out because he told the security guards I was homophobic. Does that count?",
   "created_utc": 1692367109,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpzo86",
   "message": "Same way as when ugly girls hit on me: “I see you more as a friend.”",
   "created_utc": 1692367112,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq18qc",
   "message": "Called him gay and moved on",
   "created_utc": 1692367737,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq38se",
   "message": "The year was 2010 -- a simpler time when you could make jokes without being cancelled.  I was at a gay bar with my gay friends.  Peak ally behavior.  I was hit on by a hot dude.  I told him, \"If I was gay, I would hit it, no homo.\" He laughed.  I laughed.  We fucked one of my friends later that night.",
   "created_utc": 1692368516,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq3fs4",
   "message": "Which straight person HASN’T been hit on by a gay person?",
   "created_utc": 1692368589,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq4s15",
   "message": "i hit him",
   "created_utc": 1692369096,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq0otu",
   "message": "all. the. F'ing. time.  I'm not particularly pretty. I don't know why. \n \nI tell them I'm not gay with a look of disgust on my face. they usually respond with, are you sure?  or ever tried it?  or other disgusting comments.",
   "created_utc": 1692367517,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1maz",
   "message": "I seriously considered throwing him into the cardboard crusher, it was right there, I could of gotten away with it",
   "created_utc": 1692367886,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpugij",
   "message": "Yes, I politely deflected, paid for my lox and walked out of the store.",
   "created_utc": 1692364951,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpvd94",
   "message": "Once, I just politely declined",
   "created_utc": 1692365340,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpvjt4",
   "message": "I just said I like chicks.",
   "created_utc": 1692365417,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpxdaw",
   "message": "A few times when I was younger, told them I was very flattered but also very straight. Mostly the response was well received once was accused of falsely projecting butch persona... umm nope just built like a brick sh*t house with tits who wears cargo pants *shrugs*",
   "created_utc": 1692366176,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpy63f",
   "message": "Yup, I appreciated the attention. But TBH, the dude kept trying to flirt with me like a middle schooler. I had to sit far away from him so he got the message. I have a great milkshake so I get it lol.",
   "created_utc": 1692366503,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpyv0j",
   "message": "A bunch of times. I was actually hit on and sexually assaulted by Kiefer Sutherland. I’m always cool about it.",
   "created_utc": 1692366781,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpyv2a",
   "message": "Yes. It was uncomfortable. I had a middle aged dude stop me on the sidewalk and say \"You are very beautiful!\" while gazing into my eyes. I'm a larger than average masculine looking guy in my 50's. I have never been referred to as \"beautiful\" before and trust me, I am no male model.",
   "created_utc": 1692366782,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpz593",
   "message": "Didn’t know it was happening till after a friend pointed it out. We were at college he was on the football team and I thought the dude was just friendly.",
   "created_utc": 1692366896,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwpzx7z",
   "message": "yes, it was a very good friend. He confessed his feelings towards me, i told him i was not interested and he became very insistant, then agressive, so i gosted him. It was more then 20 years ago and he still send me mails like once or twice a year trying to convince me to meet him, saying he's sorry blablabla",
   "created_utc": 1692367212,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq089r",
   "message": "Person: “are you gay?”\nMe: “No”\nPerson: “oh… well you look gay”",
   "created_utc": 1692367336,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq0bjo",
   "message": "Multiple times in my life. \nApparently I put off a bit of a gay vibe!\nI always just tell them I’m straight and usually they’re really nice about it. Occasionally I get the follow up question of “Are you sure?”.",
   "created_utc": 1692367372,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq0ehq",
   "message": "Told them i only date girls.  Thanks.",
   "created_utc": 1692367404,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq0hbc",
   "message": "Yes. He was a friend of a friend in my teens. He flirted a bit and showed interest while we were drunk at a party. I knew he was gay but not that he had any interest in me. I just told him that I was flattered but that I was straight as can be so I wouldn’t answer his invitations. It was no problem.",
   "created_utc": 1692367435,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq0nwh",
   "message": "Quite a few times, I find it hilarious to be honest and it doesn't bother me at all",
   "created_utc": 1692367507,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq0o61",
   "message": "Few times. \n\nSpend a bit of time in gay bars for various reasons so it's understandable. \n\nTell them I'm straight, had a few try and 'change' me but just told them I wasn't interested. What surprised me was how persistent they were.",
   "created_utc": 1692367510,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq0yly",
   "message": "No thanks but thank you",
   "created_utc": 1692367624,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq10sg",
   "message": "Yes I have been, I thanked them for their interest and said that I was flattered (which I genuinely was), informed them I was straight and kept walking towards the bar.",
   "created_utc": 1692367649,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq14y9",
   "message": "Almost everyone on my “social circle” is gay. I say in air quotes because they are my roomies and my dnd group, we are just acquaintances, rather.",
   "created_utc": 1692367694,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq16y0",
   "message": "Quite often, actually , when I was young. Apparantly my androgynous appearance made women think I am a lesbian and gay a fem gay, lol.  When in fact I am asexual. \n\nI always found it super flattering and would say something like \" thank you so much, that is so sweet, it is just that can´t return the love\", if I was approached me nicely.\n\nIf they were more crude it was  more something like \"Sorry, you´re barking up the wrong tree.\"",
   "created_utc": 1692367717,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq170l",
   "message": "Let them know I’m straight, and they bought me a drink anyway, which I drank",
   "created_utc": 1692367717,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1al3",
   "message": "Flattered but I'm good bud. No worries though",
   "created_utc": 1692367758,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1bkd",
   "message": "Once at the gym and it was super flattering. Let my wife routinely know the options are open as a joke",
   "created_utc": 1692367768,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1cxx",
   "message": "I was in Marie's Crisis, a Broadway singalong bar in nyc.  Best bar on the damn planet.  A gay fella came up and thought he'd be cute and take a sip of my beer and be friendly.\n\nI was like who the ***fuck*** is this guy\n\nThen a friend came and \"rescued\" me back to the group lol.  It was a cash bar and my last 6 bucks!  *My* beer!",
   "created_utc": 1692367784,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1e20",
   "message": "Has happened a bunch. Sometimes it was fine. Other times they pushed more and it was not.",
   "created_utc": 1692367796,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1e2w",
   "message": "Honestly that shit makes my day.  I said thank you but I'm straight, and kept talking and going about my night. I'm even still friends with a few of them.",
   "created_utc": 1692367796,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1ey3",
   "message": "Was at a roller skating rink and a cool gay dude was having a birthday party with all his friends, most if not all of them were also gay. My self-esteem was really high after getting hit on every other lap. Thanked them and was flattered, but also was skating with someone I ended up dating for a few years. She was cool, too. Great time.",
   "created_utc": 1692367806,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1fg5",
   "message": "Multiple times, I just take it as a compliment",
   "created_utc": 1692367812,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1h8z",
   "message": "Was hit on at work by a guy from a neighboring store. Politely told him I wasn't gay, and he left. I felt kind of flattered.",
   "created_utc": 1692367831,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1hgp",
   "message": "Lols…many times. I generally just politely decline and we usually both end up having a laugh about it. A few times I’ve had the annoying and persistent ”well, how do you know you’re not gay if you’ve never tried it?”",
   "created_utc": 1692367834,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1hsn",
   "message": "I was pissed. It was my boss and he thought just because I worked for him he could touch me up. He was mad I liked girls.",
   "created_utc": 1692367837,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1i1r",
   "message": "Many times. I give off gay vibes.\nI've mostly responded the same way I do anyone hitting on me. I don't realize it's happening until later",
   "created_utc": 1692367840,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1im5",
   "message": "First time I didn't realize it until about 3 hours later, this was when I was like 16, we both were.\n\nSecond time, I gave the guy a back rub after I politely declined\n\nThird time, I had to invite him over to show him I did in fact live with my girlfriend.\n\nAll separate people, and prob some other times I forgot, but the other times may all fall into that first time category of didn't even realize it.\n\nBonus 4th time, how could I forget the time my co-worker texted me at 6AM and asked me into a threesome with his husband.  I just left that one at \"I'll think about it\" and it just never came up ever again.",
   "created_utc": 1692367846,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1syt",
   "message": "Yes i take it as a compliment",
   "created_utc": 1692367959,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1t7d",
   "message": "Punch to the face clears that right up",
   "created_utc": 1692367961,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1ugs",
   "message": "We have friends that are a lesbian couple who constantly want to get with me (F), much to the simultaneous joy and dismay of my husband. He even said he'd be happy just watching, lol",
   "created_utc": 1692367975,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1uju",
   "message": "A few times. I take it as a compliment, the way I see it, people say men are more visual with attraction than women, so if a man says I’m hot, I’m hot lol",
   "created_utc": 1692367976,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1ul6",
   "message": "I don't know if he was gay, but a guy stocking shelves at Walmart called my beard Glorious one day. Not being used to receiving random compliments from strangers, I was at a loss for words.",
   "created_utc": 1692367976,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1vue",
   "message": "Flattered, but politely declined. We ended up drinking beers and watching football at the bar the rest of the day. Dude is one of my closest friends going on 15 years now.",
   "created_utc": 1692367990,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1wp8",
   "message": "Yup. Got free drinks and an invitation to meet him in the bathroom. The drinks were nice. The groping under the bar.... eh",
   "created_utc": 1692367999,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1xh7",
   "message": "He wrote to me on FB many years ago and told me I was cute and good liking, asking if we could take a coffee some day. I politely told him that I’m not interested in men. He understood and asked me not to tell anyone about his sexuality, I assured him that I wouldn’t. That’s up to him when he’s ready.",
   "created_utc": 1692368008,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1xxi",
   "message": "A few times but only one made me feel really uncomfortable. Opened a fridge door for me to get what I wanted, held it open for small talk while I got my drink and made some absolutely forward remarks. Really drove home for me how women feel when these things happen to them daily.",
   "created_utc": 1692368013,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq1yj7",
   "message": "Yes.\n\nI politely said,” Thank you I’m flattered, but unfortunately I’m straight.”",
   "created_utc": 1692368020,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq20e6",
   "message": "No but I'm gay and have been hit on by straight people. I just say I'm gay and that's that.",
   "created_utc": 1692368041,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq20ij",
   "message": "Flattered, of course! I still remember her.",
   "created_utc": 1692368043,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq22dg",
   "message": "I have. I just smiled and went along with my day.",
   "created_utc": 1692368063,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq23c8",
   "message": "If I'm ever hit on by literally anyone, gay, straight, guy, girl, young, old. I always take it as a compliment and am very appreciative.",
   "created_utc": 1692368073,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq23s0",
   "message": "Oh yes. I've tried twice to have my ass and groin grabbed on the dance floor. I've also tried sitting beside an older man, when I was an intern, showing him something on the computer, and suddenly his hand was on my thigh - really high up.\n\nI had a gay friend once who wouldn't accept I wasn't gay, and when he was drunk he would sometimes try to kiss me.\n\nOther than that, no.",
   "created_utc": 1692368078,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq241y",
   "message": "yup, had a close friend in school ask me if I was interested. I said nah not into it. we stayed friends, were in each other’s weddings, I took it as a compliment.",
   "created_utc": 1692368081,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq24z2",
   "message": "Yes. Two guys asked me if I wanted to join them into doing speed all night and have fuck. I nicely declined and walked away. I also did not drink the beer the guy brought me, I was suspicious as fuck after that",
   "created_utc": 1692368091,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq27lv",
   "message": "I was flattered, of course.",
   "created_utc": 1692368120,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq284s",
   "message": "Maybe? \n\nApparently I'm a dense idiot who never picks up hints so even if I did id probably not know lmao",
   "created_utc": 1692368126,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2aoh",
   "message": "Ugh, every ducking day in Ft Lauderdale. I assume this is what it’s like being a woman in NYC.",
   "created_utc": 1692368153,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2c24",
   "message": "Many times, and usually I just say \"Aww, thank you!\"or \"I really appreciate that, but I'm straight\" (depending on if the flirting was a compliment or an offer to buy a drink) and then I move on while also feeling better about myself and more confident.",
   "created_utc": 1692368168,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2cmw",
   "message": "A few times. No real issue with it, though one time was pretty aggressive and creepy. \n\nOn another occasion a guy gave me a flower then smiled and walked away, which was weirdly flattering!",
   "created_utc": 1692368174,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2ega",
   "message": "I’ll go to gay bars for an ego boost when im feeling down. When someone does hit on me I respond with “im straight”",
   "created_utc": 1692368193,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2fmd",
   "message": "Yes. Thanked him for the compliment and told him I wasn't interested. He didn't listen though. Eventually stopped.",
   "created_utc": 1692368205,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2fyh",
   "message": "Male here. One time I was walking my dog and a gay guy walked pass us and said, “Both you and your dog are cute!” \n\nI just said, “Thanks!” and continued on with the walk.",
   "created_utc": 1692368208,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2i7k",
   "message": "Yup, he's now my husband",
   "created_utc": 1692368233,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2itz",
   "message": "I just said thank you",
   "created_utc": 1692368239,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2izj",
   "message": "All the time. \n\nStrangers: smile, say thank you/no thank you (depending on what was said lol), just be friendly but not leading them on friendly.\n\nFriends: they're fucking hilarious and always do it in a joking way (even though they're not joking) and I joke around back with them.\n\nWhen I was a teenager it used to bother me and I'd get nasty, as an adult I realized, who cares.",
   "created_utc": 1692368241,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2k77",
   "message": "I can be hit on by all genders, sexuality, people and not notice. I’m oblivious to flirting.",
   "created_utc": 1692368254,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2lt2",
   "message": "Told them I was flattered but also straight and came to this bar with my wife and a few of her gay friends. We had a laugh, he bought me a shot and we went our separate ways.",
   "created_utc": 1692368271,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2mfh",
   "message": "Took note. That mf’s game was legit. If I weren’t straight, I might’ve entertained the advance 😂. I was very flattered though. Gay men are extremely picky and can be flat out ruthless.",
   "created_utc": 1692368278,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2nlr",
   "message": "Did not happen to me, but I have a friend that was hit on while in pub. He went on and bought a guy a drink and thanked him for great compliment :)",
   "created_utc": 1692368291,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2o42",
   "message": "I have the opposite issue. I’m pretty sure I’m the only gay guy at my job, or at least in my department and casually open about it. I’m very friendly to everyone and make dumb pun jokes and dad jokes here and there for a laugh or a giggle. Almost all of the straight guys in the department avoid me or are weird/uncomfortable around me (body language) like I’m hitting on them or something. When did being nice to your fellow human turn into this?",
   "created_utc": 1692368296,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2ol8",
   "message": "Indeed.. just be respectful and politely tell them you’re straight but you appreciate that they find u attractive",
   "created_utc": 1692368301,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2ot5",
   "message": " I either said \"mmm no thanks\" or just left them be and carried on with my day. Back when it was OK to be rude to them.",
   "created_utc": 1692368303,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2p2e",
   "message": "Very uncomfortable",
   "created_utc": 1692368306,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2peg",
   "message": "Yes, like 3 times. I just stayed nice. One dude tried to unzip my pants while I was sleeping. I got mad at that one. Thank god I didn't drink a lot that night.",
   "created_utc": 1692368310,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2pla",
   "message": "I have been hit on by gay men, and honestly I'm flattered when it happens, but I try to make it clear that I'm straight. I have also been sexually assaulted by gay men and I did not respond with kindness. Gay men are still men...",
   "created_utc": 1692368312,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2ps1",
   "message": "Imagine getting hit on by gay Arabs and Old Turkish guys every time I shaved my beard and mustache",
   "created_utc": 1692368314,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2q2j",
   "message": "Yes once and it was very unpleasant as that dude was acting like a rapist and tried to touch me\n0/10 wouldnt recommend\nNothing against gay people tho",
   "created_utc": 1692368317,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2qlm",
   "message": "I accepted the compliment and politely declined the advances",
   "created_utc": 1692368323,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2shh",
   "message": "No thank you, but I appreciate it bro.\n\nOne dude did tried something. I almost broke his neck.",
   "created_utc": 1692368343,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2taf",
   "message": "Sort of. She complimented my hair as I walked by with my DIL and baby grandson. I said thank you and kept going. My DIL had to tell me I’d been hit on because I didn’t know. I felt flattered.",
   "created_utc": 1692368352,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2tqe",
   "message": "My friend hits on me relentlessly everytime I see him. He even said one of my insta photos gives off big “daddy” energy.\n\nAlso, in high school I had a guy tell me he was going to “turn me”.\n\nThe stuff with my friend gives me a confidence boosts. The other thing creeped me out.",
   "created_utc": 1692368357,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2u4h",
   "message": "I’ve had several men offer to suck my dick.  I’ve always turned them down, as they were acquaintances or coworkers and it would have been weird.\n\nBut if a handsome stranger offered, I might give it a go.  Who knows?",
   "created_utc": 1692368361,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2u7v",
   "message": "Yes a few years ago. I just said I appreciate your interest but I'm straight. Thankfully the guy just said ok and walked away.",
   "created_utc": 1692368362,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2ww6",
   "message": "Yes, I have. \n\nEither they leave you alone.\n\nOr they ask \"but have you ever tried it?\" or persistently ask more questions as if they are a salesman advertising themselves for sale when you politely declined.",
   "created_utc": 1692368391,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2xwb",
   "message": "I went to a new bar that opened while I was in college and they had only opened the family bathroom, so there was a really long wait. Talked to the dude ahead of me in line for like 20 minutes, and when I went to the bar after using the bathroom he was there and asked if he could buy me a drink. I said sure and then he asked me if I was gay and if I would like to hook up with him. I said \"sorry, I'm straight\" and he handed me my beer and said \"no worries, good luck tonight\" and walked away. Never saw him again, but I like to think he ended up having a good night.",
   "created_utc": 1692368401,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2ys4",
   "message": "After I got divorced, a guy I went to school with told me that if I started losing weight that without a doubt he was going to fuck me. \n\nI told him I would just have to keep eating cheeseburgers then and we had a good laugh",
   "created_utc": 1692368410,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2zfo",
   "message": "Yes. I said I didn't swing that way. They moved on.",
   "created_utc": 1692368417,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq2zha",
   "message": "I just say thank you",
   "created_utc": 1692368417,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq307n",
   "message": "Yes, pretty frequently. I've been told I have 'bi wife energy'. I usually just laugh and hold up my wedding ring. Not a big deal.",
   "created_utc": 1692368425,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq309w",
   "message": "Yeah. They didn't speak English very well, I think they were Dutch, and asked a female friend of mine what the words were. Then repeated the phrase \"would you like a blowjob\" several times in practice, before loudly calling my name and saying \"wojyld yu lyke ay bljowjyob?\"\n\nI politely declined, but they thought it was hilarious. so for the next 20 minutes or so kept calling out to me\"woyjld yu lyke ay bljowjyob?\" and laughing.   \nThey claimed that they had been on Big Brother, and had come to the UK to avoid the fame and media attention. I've no idea if that's true, but given how pleased he was with his own voice, I can belive it.  \n\n\nHe should have been more discrete...",
   "created_utc": 1692368425,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq30ka",
   "message": "“Thank you, but I’m straight”",
   "created_utc": 1692368429,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq30r6",
   "message": "Sadly, when I was younger, I reacted very poorly, took offense, and said awful things. Still feel awful about it to this day. \n\nI'm completely aloof, though, and have no idea when someone is flirting or hitting on me 99% of the time. It usually dawns on me minutes or hours after the fact. Sometimes, it takes years for me to realize it.",
   "created_utc": 1692368431,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq310r",
   "message": "Yes.\n\nI was a bouncer at a popular bar in my neighborhood when I was in my early 20's. I had a gay guy hit on me once and my response was to simply tell him that I like women. Dude understood and he was chill after that. No big deal.",
   "created_utc": 1692368433,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq32xe",
   "message": "\"Flattered, not interested.\"'",
   "created_utc": 1692368453,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq335a",
   "message": "Like most times I've been hit on by women I didn't realize until someone pointed it out afterwards. I just thought he was being friendly ¯\\\\\\_(ツ)_/¯",
   "created_utc": 1692368455,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq33ot",
   "message": "I went to an all male high school. I lost count",
   "created_utc": 1692368462,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq35a5",
   "message": "Was at a concert with a buddy and at some point a guy put a hand on my chest and said I like your shirt and had like a devious flirty smile, asked if we were gay. I was flattered but said no. Apparently he tried to hold my buddy's hand a couple times leading up to that. I only get hit on a couple times a decade that I know of but first time by a guy so we had a chuckle, didn't mind it.",
   "created_utc": 1692368478,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq35mi",
   "message": "Was on a date with a woman having sone drinks. The waiter left his phone number my beer pad. I smiled and was quite flattered actually, we had a good laugh about it. Not sure if it was a joke or a good will gesture of validation for my date.",
   "created_utc": 1692368482,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq35nu",
   "message": "its always flattering to get hit on no matter who it is.",
   "created_utc": 1692368482,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq35wn",
   "message": "Yes, many times... Any time it has happened I've thanked them, taken it as a compliment but politely declined.\n9 times out of 10 the guy hitting on me has completely understood and had a friendly chat but there's always that 1 that seems to take it as a challenge",
   "created_utc": 1692368485,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq361o",
   "message": "I wish more gay men would hit on me.",
   "created_utc": 1692368487,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq36gv",
   "message": "Not so much hit on, was asked if I was straight or gay by a very flamboyant man, I responded with \"heterosexual\".",
   "created_utc": 1692368491,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq37iw",
   "message": "Yes. I got scared because I was really young then and the person was so aggressive not taking a no for an answer. The person also has a bigger build. It was new to me because I have gay godparents I grew up with and they are not like that.",
   "created_utc": 1692368502,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq37nh",
   "message": "From my teens through college (late '70s, mid '80s). Most were older, chicken hawks. For the most part, I was confused as to why I pinged so many gaydars.",
   "created_utc": 1692368504,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq39tn",
   "message": "Not exactly hit on, but a close friend in high school drama class sniffed to having kind of a crush on me \n\nWe remained friends and gradually forgot about one another’s existence as you do with all high school friends",
   "created_utc": 1692368527,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq3bos",
   "message": "If I was I probably misunderstood it just like anytime I'd been hit on by a woman.",
   "created_utc": 1692368546,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq3cz5",
   "message": "Oh sure. I responded the same way I respond when a straight girl hit on me. By being completely oblivious until several hours later when I went 'oh shit, they were hitting on me'",
   "created_utc": 1692368560,
   "score": 1,
   "submission_id": "15ukfzk"
  },
  {
   "comment_id": "jwq3d4k",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ukfzk"
  }
 ]
}