{
 "submission_id": "15ultaf",
 "title": "What's the most unexpectedly profound piece of advice you've ever received?",
 "selftext": "",
 "created_utc": 1692368206,
 "permalink": "/r/AskReddit/comments/15ultaf/whats_the_most_unexpectedly_profound_piece_of/",
 "score": 3,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ultaf/whats_the_most_unexpectedly_profound_piece_of/",
 "comments": [
  {
   "comment_id": "jwqeu7s",
   "message": "I had a friend who is getting their life together after being abused by their ex and overcoming a drug addiction. I asked him how he was holding it all together and He said to me, “Peace comes in pieces”. \n\nAnd i realized how true that is.",
   "created_utc": 1692372838,
   "score": 54,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqntus",
   "message": "Don't accept criticism from someone you wouldn't go to for advice.",
   "created_utc": 1692376109,
   "score": 15,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqdmp6",
   "message": "Your own expectations of others creates the disappointments.",
   "created_utc": 1692372392,
   "score": 124,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwq9rlt",
   "message": "Regarding romantic relationships: “it shouldn’t be that hard.”\n\nBecame a great measure and anchor for dating and knowing when to get out. Life is hard enough, it shouldn’t be hard to be with your person.",
   "created_utc": 1692370964,
   "score": 208,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwq5epa",
   "message": "If someone you like doesn't like you back, respect that and as hard as it is, let them go.  If you truly care about them as you say you do, realize they said their happiness is without you.  Trying to force a friendship or relationship with someone who doesn't like you back is now only about you, not them",
   "created_utc": 1692369335,
   "score": 103,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqbw2o",
   "message": "If you don't have the time to do it right, you better have the time to do it again.",
   "created_utc": 1692371755,
   "score": 4,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwq42aa",
   "message": "When you have nothing to live for you’ll find something to die for , my sociology professor told me.",
   "created_utc": 1692368826,
   "score": 153,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqmv6d",
   "message": "Warren Buffett had some awesome bits of wisdom yesterday on CNBC\n\nOne of them was \"You can always tell someone to go to hell tomorrow.\" Basically, wait to cool down a bit before reacting to someone.",
   "created_utc": 1692375762,
   "score": 74,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqgyn7",
   "message": "My therapist saw through my bullshit that I had convinced myself of....  I would let relatively minor things fuck up my entire day/week..\n\nIn session one day, I was expressing that my day had sucked and whatnot and he asked me \n\n\"Did you have a bad day, or did you have a bad 5 minutes and then let that ruin an otherwise ok day?\"\n\nObviously it wasn't some Aha! moment that that instantly changed all of my thought processes, but it was something that he and I worked on over months towards letting that question be one of the first things I ask myself when something happens....",
   "created_utc": 1692373611,
   "score": 203,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwq68o6",
   "message": "“The grass is only greener on the other side because it’s covered in bullshit”\n\n“Blood can only flow to the brain or to the penis but not to both at the same time”.",
   "created_utc": 1692369647,
   "score": 62,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqfm0s",
   "message": "Nobody is going to respect you until you start respecting yourself",
   "created_utc": 1692373118,
   "score": 48,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqj1xy",
   "message": "When it comes to buying an expensive possession...\n\nI had been talking about spending $5K on an oscilloscope for my hobby.  My boss asked me \"Are you in love with owning an oscilloscope, or the **idea** of owning an oscilloscope?\"\n\nThat really helped me to better analyze the reasons for my desires to buy something.",
   "created_utc": 1692374364,
   "score": 40,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqo95l",
   "message": "\"It may not be your fault, but it's your responsibility.\"\n\nChanged a lot for me.\n\nand\n\n\"Recovery is not a straight line, like we want it to be. It's up and downs, but the point is that when you're down, you're still higher than you were when you started.\"",
   "created_utc": 1692376264,
   "score": 34,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqdtlp",
   "message": "You can't change someone, you can only change how you react to them.",
   "created_utc": 1692372462,
   "score": 70,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqsrf7",
   "message": "Don't set yourself on fire just to make someone else warm.\n\n\n\nAsked my dad:\nImagine a line in a chalk board and it represents all the things a relationship needs. House chores, income, child care, emotional support, compassion, shelter, safety, everything. If you agree to split everything up 50/50 are you going to be able to do EVERYTHING that you agreed to do ALL the time? No. You won't. Sometimes you can only do 40% of the stuff on the line. Sometimes you can't do any of it (you're sick or something). And even if you ARE able to do EVERYTHING in your half of that line, your partner will have times they can't fulfill all of their obligation. There's always going to be a gap. Therefore you can't think of marriage as a 50/50 even split. You have to always be willing to do 100% so that when life happens there's not a gap.",
   "created_utc": 1692377902,
   "score": 31,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwq9ihs",
   "message": "Never give unsolicited advice.",
   "created_utc": 1692370868,
   "score": 86,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqkeyz",
   "message": "Never forsake kindness for cleverness.",
   "created_utc": 1692374861,
   "score": 26,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwq31fm",
   "message": "If your stressed, make a list of what needs to be done and pee on the fire closest to you.",
   "created_utc": 1692368438,
   "score": 88,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqg4r2",
   "message": "You are mortal and so is everyone you will ever care about. Take the time off. Have the conversation. Express the love. Try the weird food. Pay attention. It'll all be over too soon.",
   "created_utc": 1692373309,
   "score": 45,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqjmrg",
   "message": "Probably \"the only way out is through\". I'm a chronic procrastinator so when something's stressing me out I try to ignore it. But at some point you've got to deal with it.\n\nSame vein as \"you can either spend 10 mins on this now or 2 hours in a week's time\". Stuff gets worse the longer you sit on it.",
   "created_utc": 1692374573,
   "score": 24,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqtnr1",
   "message": "Here's some advice I got from a screenwriter when I spoke about how I struggle with perfectionism and being in constant editor mode, which is to say I can never get the first draft done because I nitpick at my work constantly.\n\n\u0026gt;\"There’s a strong and understandable impulse to fixate on a final product. The final product is easy. It’s already done. It can be watched, looked at, listened to. It can just go off and win its accolades and praise and awards. Because it’s done and lots of time and effort has been put into it and it’s now a unique and perfect thing.  \n\u0026gt;  \n\u0026gt;You’ve gotta let that go.  \n\u0026gt;  \n\u0026gt;Refocus your energy onto the process. You’re hitting a road block because you’re arriving at the real work. You don’t have all the answers for your story. That can be scary, and that’s okay. The road block is that you’re putting pressure on yourself to be able to produce a finished product from the moment you have an idea.  \n\u0026gt;  \n\u0026gt;Allow yourself to be messy. Do yourself the courtesy to have drafts. Don’t write a script. Write a story. Write it in crayon. Sounds silly? Crayon is ridiculous. Try writing your story in purple crayon and you will trick yourself into understanding that this is not the final draft. This is part of the process.  \n\u0026gt;  \n\u0026gt;Finish your outline in your ridiculous purple crayon. There are going to be problems with it. Crayons are hard to write with, they’re illegible sometimes. You’re probably not going to want to write a lot with purple crayon. Maybe just a page or two. That’s a really rough outline that probably only hits the major beats. That’s a good thing. There are also going to be problems with your story. Rewrite the whole thing. This time do it with a blue colored pencil. You’ll have gone through it once before, and you will have ideas on how to make it better.  \n\u0026gt;  \n\u0026gt;Eventually, this thing that is in your head that gets so stuck because of your desire for them to be perfect will be articulated. Reward yourself. Write it on your computer, in that clear and clean black text over white.You’ll know your story. You’ll know the issues with your story. You’ll have done some real work. You’ll end up with something on paper that other people can decode, critique, engage with and collaborate on. It takes a lot of steps to take one step.  \n\u0026gt;  \n\u0026gt;Bust out your purple crayon, dude.\"",
   "created_utc": 1692378234,
   "score": 20,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqvg58",
   "message": "So decades ago in my world travels, a random Australian woman in a seedy bar once told me that “the trick to a successful marriage is that both partners have to secretly believe they got the better end of the deal. Of course, each should do what they can here and there to keep the other deep down believing it.”\n\nI’ve gotten 20 years of a damn good marriage so far out of that unexpectedly profound advice.",
   "created_utc": 1692378889,
   "score": 25,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqnid1",
   "message": "Copying/pasting.\n\n\"unpopular opinion: i don't think your life has\nto have a purpose, or you a grand ambition; i think\nit's okay to just wander through life finding\ninteresting things until you die\" and i for one think\nthat's fucking brilliant”",
   "created_utc": 1692375992,
   "score": 18,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqlxo3",
   "message": "You choose what decisions to make not what consequences you get.",
   "created_utc": 1692375423,
   "score": 16,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqx5la",
   "message": "If you knew how little people though about you, you wouldn’t care half as much about what they think of you. \nCan’t remember who made the quote.",
   "created_utc": 1692379504,
   "score": 15,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqasbc",
   "message": "\"Don't become the thing you hate.\"\n\nHad a manager that used to say that.  I try to live by it.",
   "created_utc": 1692371343,
   "score": 14,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqq2ug",
   "message": "\"After a certain point, love is a choice\". It has made me realize that my relationship is hard work, and that love alone is not enough. So far, 8 years and counting.",
   "created_utc": 1692376926,
   "score": 12,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr15xk",
   "message": "You will be the villain in someone's story. Don't worry about changing that. There is nothing you can do. Just move on.",
   "created_utc": 1692380974,
   "score": 11,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqj3pw",
   "message": "My Dad, several times while I was growing up:  “you got yourself into this mess, you can get yourself out.”",
   "created_utc": 1692374382,
   "score": 10,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwq8iqf",
   "message": "Just keep swimming",
   "created_utc": 1692370499,
   "score": 20,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqa085",
   "message": "Sometimes you peepee sometimes you poopoo. But I’ve never taken a poopoo without also doing a little peepee.",
   "created_utc": 1692371055,
   "score": 20,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqx81u",
   "message": "You don't need permission to take care of yourself.",
   "created_utc": 1692379530,
   "score": 9,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqmmea",
   "message": "don’t compare your film to someone else’s highlight reel. A variation (or derivation?) of big fish small pond / small fish / big pond.",
   "created_utc": 1692375673,
   "score": 16,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqh2c3",
   "message": "\"Well, I just went into it with the attitude that I was not going to let this kick my ass.\" \n\n- A fellow carpenter explaining to me why he was able to drill a difficult hole that I had spent 20 minutes sweating and fighting with. Changed so many aspects of my life. It's all about that attitude.",
   "created_utc": 1692373648,
   "score": 8,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqqu14",
   "message": "you can't stop the waves, but you can learn how to surf\n\nthe best surfer out there is the one having the most fun",
   "created_utc": 1692377204,
   "score": 8,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr44i6",
   "message": "\"When something told me something was wrong in my story, they were generally right. If they told me how to fix it, they were generally wrong.\" -Neil Gaiman. \n\nMade me think a lot about criticism and advice.",
   "created_utc": 1692382057,
   "score": 7,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqjxme",
   "message": "Your ex likes to throw sticks.  Don't chase them.",
   "created_utc": 1692374684,
   "score": 7,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr4ag3",
   "message": "In high school, I confided in a beloved teacher when I discovered my mom was again smoking behind my family's back, something that greatly upset me. She told me a lot, but what really opened my eyes was \"adults are people, too.\"\n\nThat was almost twenty years ago, but it stays with me. It's very hard to transition to an adult relationship with your parents, and we are raised to view certain people in certain positions as \"infallible\" or \"above\" us. It's something I still come back to in my mind, looking at other adults around me.",
   "created_utc": 1692382118,
   "score": 7,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqjiqn",
   "message": "If you want to know the easiest way to do something, ask a fat man. \n\nTold to 10yr old me by my very heavy grandfather.",
   "created_utc": 1692374532,
   "score": 6,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqpazf",
   "message": "\"You do the hokey pokey and you turn yourself around. That's what it's *all* about!\" Unexpectedly great metaphor for making mistakes in life.",
   "created_utc": 1692376644,
   "score": 6,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqr732",
   "message": "Don't eat yellow snow",
   "created_utc": 1692377338,
   "score": 6,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqx535",
   "message": "I asked a Weightlifter (Olympic Weightlifting) acquaintance of mine “how did you get so strong?” and he simply said \n\n“just show up and do the best you can every day”\n\nNow this doesn’t seem like much, but he had a really low IQ and was coached and handled by excellent coaches and when he said this I could see something special about the words come from him. \n\nNow I try to show up and do the best I can every day.\n\nI remember it a dozen years later.",
   "created_utc": 1692379499,
   "score": 5,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwq5lx5",
   "message": "If you're having suicidal thoughts, something needs to die, just not you.",
   "created_utc": 1692369409,
   "score": 19,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqkszu",
   "message": "Critical thinking will save you, faith will lead you wandering to nowhere",
   "created_utc": 1692375004,
   "score": 11,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqghlr",
   "message": "The good you see in others is actually the good that's in you, not them.",
   "created_utc": 1692373439,
   "score": 6,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqh16d",
   "message": "Always remain calm and composed when arguing with someone, especially when they are loud and aggressive.",
   "created_utc": 1692373636,
   "score": 5,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqqb0p",
   "message": "I comment again, because it comes from a joke, but it basically comes down to a group of guys that always offered a kid two bills, and the kid would take the smaller one. Then, the kid tells one of the guys that if he had chosen the big bill right away, the game would have ended immediately. The advice was \"always get the smaller bill and play the long game\".",
   "created_utc": 1692377009,
   "score": 5,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqubjc",
   "message": "When making a decision, think: do I actively want this thing, or am I doing it because I'm afraid of what will happen if I don't? \n\nI made fear-based decisions my entire life, because that's how I was taught to make them, until someone said that to me.",
   "created_utc": 1692378474,
   "score": 5,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr2cm2",
   "message": "I was once told, “you might as well go for your dreams even if it will take a long time. That time is going to pass anyway so why waste it worrying about achieving your goal rather than actually doing it.” Honestly will never be the same.",
   "created_utc": 1692381403,
   "score": 5,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr3m56",
   "message": "A bum on the beach once told me.  \n\n\n\"Never make a decision when your angry, sleepy, or hungry.\"",
   "created_utc": 1692381869,
   "score": 5,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr46f1",
   "message": "If someone offers you a mint or gum, always accept it.  They are either politely telling you that your breath stinks or just being polite.",
   "created_utc": 1692382076,
   "score": 4,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwq7v2o",
   "message": "You either manage ideas or you manage people – or you work for minimum wage.",
   "created_utc": 1692370254,
   "score": 14,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqmxeq",
   "message": "No one who is great at something was always great at it.",
   "created_utc": 1692375784,
   "score": 8,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqa2np",
   "message": "Live your life the way you want.",
   "created_utc": 1692371079,
   "score": 5,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqirpx",
   "message": "Cross you legs on a water slide.\n\nReally, I thought they were joking but it make you go faster. Huh.",
   "created_utc": 1692374262,
   "score": 4,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqlrtv",
   "message": "My dad once asked me, in relation to an argument “do you want to be right, or do you want to be happy?” And decades later I still ask myself that question every time I get heated about something.    \n    \nMost of the time I pick happy.",
   "created_utc": 1692375364,
   "score": 4,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqpyzz",
   "message": "Read it in a book. *Control your controllables.* Honestly it helped me a lot. Control what you can, no matter how small.",
   "created_utc": 1692376887,
   "score": 5,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqwk8k",
   "message": "You'll never make friends if you don't talk to strangers.\n\n\\-Charlie Sill",
   "created_utc": 1692379291,
   "score": 4,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqyof2",
   "message": "\"Someone's illness isn't their fault, but it is their responsibility\". Also, from the same person, \"you can be sick and still be an asshole.\" \n\nMy exhusband got diagnosed with a chronic illness shortly after we got married. He couldn't cope and pushed everyone out including me. For a long time I was excusing his behavior by saying \"...but it's because he's sick\" and blaming myself for thinking I was doing something wrong. \n\nWe had been going to couple's therapy since his diagnosis, and the therapist wasn't very good. My ex was also lying (I later found out) about a bunch of stuff. The whole thing was a disaster. \n\nI was at some social event and ran into a tarot reader of all people- their day job was as a death doula (kind of like a grief counselor) and they also happened to have a chronic illness. I explained my situation and those were the quotes they gave me. It changed my life. I was really struggling with grief and my ex's actions, and in 1 hour that tarot reader gave me better advice and guidance than the years of therapy I'd be in since my ex kicked me out of the house.",
   "created_utc": 1692380066,
   "score": 5,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr2dtm",
   "message": "\"One day you will look in the mirror, and like what you see\"\n\nSaid by my ex, about 30 years ago, which was totally out the blue but has stuck with me ever since.  Still waiting, unfortunately.",
   "created_utc": 1692381416,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr3lr0",
   "message": "Once you let a mother fucker slide, they soon learn to skate.",
   "created_utc": 1692381865,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqdd3f",
   "message": "\"Whoever points out the asshole, becomes the asshole.\"",
   "created_utc": 1692372293,
   "score": 7,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwq2tsu",
   "message": "Embrace uncertainty, for it is the canvas upon which the masterpiece of life is painted.",
   "created_utc": 1692368358,
   "score": 6,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwq9y4t",
   "message": "Study hard or push wheelbarrow",
   "created_utc": 1692371033,
   "score": 8,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwql6fl",
   "message": "Not profound, but helpful. \n“This too shall pass”",
   "created_utc": 1692375143,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqmvqd",
   "message": "Don't sweat the small stuff.",
   "created_utc": 1692375767,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqmzyy",
   "message": "Don’t dig, just wipe… words to live by!",
   "created_utc": 1692375809,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqo6se",
   "message": "No ones going to save you",
   "created_utc": 1692376240,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqp180",
   "message": "\"Just be a good motherfucker.\" Senior Drill Instructor at USMC boot camp.",
   "created_utc": 1692376547,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqscq5",
   "message": "Ask men you find attractive out! The worst they can say is no.",
   "created_utc": 1692377753,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqu0pf",
   "message": "Don’t take criticism from anyone you wouldn’t ask advice.",
   "created_utc": 1692378366,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqvz6v",
   "message": "Not quite \"advice,\" more like \"life wisdom\" from an unexpected place. I was reading some tech support horror stories for commiseration when I was working for a company doing phone-based tech support for cell phones. One of the posters remarked how he worked with someone who had ended up having a tech support related issue with every single piece of equipment he ever used, which often caused him to spend a lot of time and emotional energy working on fixing the problems, while another long-term coworker never had a single issue with the same exact equipment he was issued. They were both competent and experienced professionals in the field, so it wasn't a matter of not understanding the tech, it's that one of them constantly seemed to run into problems that the other didn't.\n\nThere was something I weirdly gleaned from the story about how much control we end up having over our own outcomes. The guy who was constantly frustrated by his equipment wasn't issued worse equipment than the other coworker, which meant that when it came to his ongoing struggles, he was largely the cause of his own frustration. It's a lesson I broadened and made me think of examples of my own \"bad luck\" that were really some innate things I needed to work on myself. The coworker with the constantly malfunctioning equipment might have benefited from working on his patience, discipline, and introspection about why he was constantly having tech issues. The issues were never with the equipment, they were with the way he approached using it and troubleshooting.",
   "created_utc": 1692379080,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqxlxp",
   "message": "It's a bit of a meme thing now but the yolo before yolo was a thing.\n\nThink it was originally from a song somewhere. Maybe?\n\nBut life isn't a practise run. You don't get to reset or restart. You don't have 3 lives. It's one and done.\n\nSimilar vibes and even more gut punching...\n\n### No one is laying on their deathbed wishing they'd spent more time at work....",
   "created_utc": 1692379672,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqywqy",
   "message": "My shrink was an imbecile, and at one point it really sunk in that I was going to have to accept that anyone in a position to have his job was never going to be in a position to understand or empathize with what I am going through. The most clear and comprehensive facts that emerged from therapy is that if you can get away with it, you should feel fine about doing whatever you want.",
   "created_utc": 1692380149,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqzicb",
   "message": "What other people think of you…. Is none of your fucking business.",
   "created_utc": 1692380369,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr00ap",
   "message": "It is better to remain silent and have people wonder if you are a fool, than to open your mouth and prove it",
   "created_utc": 1692380552,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr0vta",
   "message": "If you keep smelling shit maybe it’s on your shoes.",
   "created_utc": 1692380872,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr1zu4",
   "message": "“Don’t let your first thoughts be your last thoughts”. This hits me so hard because it acknowledges the fallibility of our instincts and offers us a counter to them. Without denying the validity of our experiences, it shows us that improving our knowledge of the world. I think that’s very helpful and optimistic.",
   "created_utc": 1692381273,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr29hp",
   "message": "Cheap costs money",
   "created_utc": 1692381371,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr2dqh",
   "message": "Whatever people say or think about you behind your back is none of your business.",
   "created_utc": 1692381415,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr4q0p",
   "message": "Sometimes you just need to belive in yourself. Changed my view on life alot. To be fair it's only cause it came from someone I respected.",
   "created_utc": 1692382277,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr4sah",
   "message": "The world sucks. So Do a little Good when you can",
   "created_utc": 1692382300,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr5k1v",
   "message": "Don’t half ass two things when you need to full ass one thing",
   "created_utc": 1692382588,
   "score": 3,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwq2p0z",
   "message": "Do not waste your youth you only get it once.\n\nAlso don't eat yellow snow.",
   "created_utc": 1692368306,
   "score": 4,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqhhup",
   "message": "If you can't master the littlest things, you will never master the bigger things in life.",
   "created_utc": 1692373803,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqoxwq",
   "message": "Don't be afraid of being afraid.",
   "created_utc": 1692376513,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqp3cw",
   "message": "Don’t let it bother you most of what you’ve worried about has never happened",
   "created_utc": 1692376569,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqwl51",
   "message": "Prior preparation prevents poor performance. The \"5 P's\" to success.",
   "created_utc": 1692379299,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqy53d",
   "message": "“It’s only gay if you swallow”",
   "created_utc": 1692379866,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqzk83",
   "message": "Be happy on purpose.",
   "created_utc": 1692380388,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr14a2",
   "message": "The respect of those who you respect is worth more than the applause of the multitudes.",
   "created_utc": 1692380958,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr14m7",
   "message": "You know you did the right thing when it costs you the most.",
   "created_utc": 1692380962,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr1sy8",
   "message": "Seek duty, not glory.",
   "created_utc": 1692381205,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr285c",
   "message": "There is no growth in comfort",
   "created_utc": 1692381358,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr3n8g",
   "message": "Marriage is a 50:50 partnership that works best when you internalize that it will be 60% giving and 40% taking",
   "created_utc": 1692381881,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr48n4",
   "message": "Other people's opinion of you is none of your business.",
   "created_utc": 1692382099,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr4s3d",
   "message": "Never wear just your socks out in the rain.",
   "created_utc": 1692382298,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr58n0",
   "message": "Don't live to work. Work to live.",
   "created_utc": 1692382468,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr5dhx",
   "message": "If you're happy and you know it and you really want to show it, clap your hands.",
   "created_utc": 1692382520,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwr5i7o",
   "message": "Fake it until you make it",
   "created_utc": 1692382569,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwrbr2g",
   "message": "The best advice I've ever received was to never take advice from a stranger on the internet",
   "created_utc": 1692384874,
   "score": 2,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwrikjj",
   "message": "It isnt about having enough time, it's about having the right priorities.",
   "created_utc": 1692387411,
   "score": 1,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwrj7bo",
   "message": "Expectations are useless and lead only to resentment.",
   "created_utc": 1692387646,
   "score": 1,
   "submission_id": "15ultaf"
  },
  {
   "comment_id": "jwqj8td",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ultaf"
  }
 ]
}