{
 "submission_id": "15ula1v",
 "title": "What’s something that people find offensive that you don’t understand why?",
 "selftext": "",
 "created_utc": 1692366956,
 "permalink": "/r/AskReddit/comments/15ula1v/whats_something_that_people_find_offensive_that/",
 "score": 28,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ula1v/whats_something_that_people_find_offensive_that/",
 "comments": [
  {
   "comment_id": "jwqc6zn",
   "message": "Asking someone’s age.",
   "created_utc": 1692371866,
   "score": 35,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqjxd8",
   "message": "I've had multiple people and websites tell me that \"Jew\" is a slur and I can't say it. Literally no Jewish person will ever tell you this. It's just weird virtue signaling from non-Jewish white people that accidentally erases a whole damn religion.",
   "created_utc": 1692374682,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqk63s",
   "message": "Apparently we're supposed to censor the words 'rape' and 'suicide' with asterisks now? Or replace them with cutesy euphemisms like, \"Deleting yourself\".\n\nFuck that.",
   "created_utc": 1692374770,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwpzd7u",
   "message": "Nudity",
   "created_utc": 1692366986,
   "score": 47,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwpzh50",
   "message": "When I say that I don't want to have kids cause I don't want the responsibility. People called me selfish and immature more than once for that.",
   "created_utc": 1692367031,
   "score": 58,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwq6r9z",
   "message": "Wearing a hat in a restaurant",
   "created_utc": 1692369842,
   "score": 17,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwq16wr",
   "message": "Indifference. like If I want to not pressure you with unnecessary communication, why am I offensive?  \n\n\nI don't have problems with that, but almost nobody gets it when I just don't text you If I feel no necessity. I'm not asking how's it going because I just sincerely don't always need that, and I don't want to pretend. I'm not selfish and I'm not cold, most of the time I just don't need it.",
   "created_utc": 1692367716,
   "score": 11,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqh2rs",
   "message": "My choice of not marrying yet and focusing on my goals. I don't even have an s.o.",
   "created_utc": 1692373653,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqhk0j",
   "message": "Anything that is harmless to other people and often even to the person themselves: curse words, people wearing things that \"belongs to the opposite gender\", men wearing dresses or make up, who people love, tattoos, piercings, people's weight or lack thereof, whether women wear bras.\n\nIt's all so incredibly sad. We're living in wonderful times when anything should be possible and here we are still dealing with people who are outraged by things like this. Utterly utterly stupid and sad.",
   "created_utc": 1692373824,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqds7z",
   "message": "Not shaking hands.... \n\nI don't, and if I do, I will purell immediately and in front of the persons hand I shook.",
   "created_utc": 1692372448,
   "score": 7,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwq1jjh",
   "message": "curse words on television",
   "created_utc": 1692367856,
   "score": 15,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqb054",
   "message": "The word 'fat' when describing a person's body when it's used as an adjective only and not as an insult. As long as the term is being used in the descriptive sense and not being used as an insult, it is in no way offensive. \n\nFor example, if you're making fun of someone for being fat, then you'd be using it as an insult - this is actual fat shaming and should not be condoned, which is why in that context it would be offensive.\n\nBut if you're describing someone clinically, it is not offensive. For example, I was asked to describe my uncle to someone who had to find him without having met him before. I would describe him as tall, fat stomach, wearing a long sleeved striped shirt and short white hair. In this case, it's a descriptive term only. \n\nFat shaming should never be considered okay, but using the word descriptively is not fat shaming. It's not an inherently offensive word and we should not pretend it is, it's a word where context is everything.",
   "created_utc": 1692371423,
   "score": 17,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwpzj7z",
   "message": "The “N” word.. as i don’t see why being called a “necromancer” is so bad 🙄",
   "created_utc": 1692367055,
   "score": 8,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwql3bh",
   "message": "Showing an interest or appreciation for a culture by experiencing it or even becoming experts in it.\n\n\u0026amp;#x200B;\n\nLike, I don't see how if you're not Japanese it's offensive to put on a kimono, or if you're not black you can't wear certain hair styles if you like them.  There's a difference between cultural appropriation, i.e. taking from a culture for your own personal gain without appreciating it or giving back to it, and simply showing interest or appreciation.",
   "created_utc": 1692375111,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqmwjz",
   "message": "Honesty",
   "created_utc": 1692375775,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqgwf6",
   "message": "One restaurant uses the word Bro in their emails and promotions. I’m female and it’s like they’re assuming their customers are mostly male. I’m not talking about Hooters either.",
   "created_utc": 1692373588,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwq3prv",
   "message": "[deleted]",
   "created_utc": 1692368694,
   "score": 2,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqmiw6",
   "message": "People who think tantrums gets them whatever they want.",
   "created_utc": 1692375638,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqnqtf",
   "message": "\"Don't speak ill of the dead\"\n\nWhy the hell not? They're dead. They don't care, and they were probably a jerk anyway.",
   "created_utc": 1692376079,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqeydc",
   "message": "farting. especially if I don’t aim it at you.",
   "created_utc": 1692372880,
   "score": 3,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwql7ds",
   "message": "Books about transgender people or gay couples aimed at children.",
   "created_utc": 1692375153,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqmzef",
   "message": "Being told to control their kids.",
   "created_utc": 1692375804,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqjib1",
   "message": "Religion. If I choose to practice your religion or nothing at all. It's my choice, don't be upset. This is still America right?",
   "created_utc": 1692374527,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwq1sl0",
   "message": "Everything",
   "created_utc": 1692367955,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqimwb",
   "message": "Farting.",
   "created_utc": 1692374213,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqltib",
   "message": "When I say that I prefer girls without penis. What’s the problem? That’s my personal preference, why should I be called names",
   "created_utc": 1692375381,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwq2es5",
   "message": "When some women are offended by the term girls, and even more by term female. I don't get it, the equivalent wouldn't offend me or any guy I know, it seems like they fantasized a story behind these terms no one even thinks about, and are now just repeating it. \nShould I call you maam? wtf",
   "created_utc": 1692368196,
   "score": 254,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqlx7r",
   "message": "When someone insults black skinned people and everybody's like: \"You can't do that!\" I mean has nobody seen Star Trek where Uhura responds to Lincoln saying the n-word: \"those are just words.\"\n\nIt begs the question: Are we really insulting those people?",
   "created_utc": 1692375419,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqjw7f",
   "message": "When someone interrupts people who talk nonstop for 20 minutes to, roughly, 50 years.",
   "created_utc": 1692374670,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqma41",
   "message": "People that get offended by anything deserve to be offended.",
   "created_utc": 1692375551,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqmagp",
   "message": "the N word, they come from Nigeria they should embrace it not be offended by it",
   "created_utc": 1692375554,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqmi11",
   "message": "Other people's lives. Why do people get about other people's lives and how they live it. There seems to be constant demonstrations against other people based on seemingly anything. It includes sexuality, race, religion, what books you read, your political views, the way you look, your diet, your fitness, and so on and so on.\n\nIf it doesn't directly impact your life why get offended?",
   "created_utc": 1692375629,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqmkml",
   "message": "When people are not ok with black jokes but will laugh their asses off at an Asian joke.",
   "created_utc": 1692375655,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqmwv4",
   "message": "Having a difference of opinion.",
   "created_utc": 1692375778,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqmywz",
   "message": "I literally find almost nothing offensive.  Except people who are easily offended. They offend me ;-)",
   "created_utc": 1692375799,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqn1zu",
   "message": "Not liking dogs.",
   "created_utc": 1692375830,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqn7ic",
   "message": "Anything taboo. Why cannot we not discuss something just because its taboo? I guess it is hard for me to understand since nothing offends me.",
   "created_utc": 1692375884,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqnrdk",
   "message": "Mothers that breastfeed in public",
   "created_utc": 1692376084,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqnxuf",
   "message": "Deciding not to go to college",
   "created_utc": 1692376149,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqnzye",
   "message": "Racial jokes",
   "created_utc": 1692376171,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqo1g9",
   "message": "When I say something like \"No Thank You\".",
   "created_utc": 1692376185,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqo46l",
   "message": "Talking rude without any reason.",
   "created_utc": 1692376214,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqoa7p",
   "message": "Saying that you don't want to attend an event. The standard response to being invited to something you don't want to do is to lie and say you have other plans. I find this so frustrating, that when I invite people to things, I refuse to specify a date or time. They have to tell me that they don't want to come, there is no other way to tell me you're not coming.",
   "created_utc": 1692376274,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqobfw",
   "message": "not talking just because we are sitting next to each other. it is perceived as rude while i see no problem with keeping quiet. i don’t understand the need to add the small talk to fill the silence",
   "created_utc": 1692376287,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqoegk",
   "message": "Advice ..help lol",
   "created_utc": 1692376318,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqohnh",
   "message": "If you don't know someone, taking offense because you don't think they \"look the part\" of whatever they are representing, so you assume they have no right to it. For example, a white-looking kid in dreds, or with some item associated with a particular culture. But not your culture.  Perhaps it is \"cultural appropriation\" by your own internal definition, or perhaps their heritage isn't what you think it is. Either way, it's None of your *Explicative Deleted* business. So....why are you accosting strangers when you have no stake in the game except some appropriated moral outrage on behalf of a people or culture that you personally have no stake in?",
   "created_utc": 1692376350,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqok1y",
   "message": "saying “no”",
   "created_utc": 1692376375,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqon5n",
   "message": "Getting asked for an ID while buying alcohol. It's not the cashier's fault, they're just following the law.",
   "created_utc": 1692376405,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqou9y",
   "message": "Being offended by someone who is uncomfortable with a post op trans person. The trans person was so unable to accept their discomfort they had to change genders, then they expect other people to do what they could not and jusy accept them for who they are.",
   "created_utc": 1692376477,
   "score": 1,
   "submission_id": "15ula1v"
  },
  {
   "comment_id": "jwqounu",
   "message": "Jokes",
   "created_utc": 1692376481,
   "score": 1,
   "submission_id": "15ula1v"
  }
 ]
}