{
 "submission_id": "15umtrc",
 "title": "What is the stupidest thing your mom and dad fought about when you were younger?",
 "selftext": "",
 "created_utc": 1692370621,
 "permalink": "/r/AskReddit/comments/15umtrc/what_is_the_stupidest_thing_your_mom_and_dad/",
 "score": 39,
 "url": "https://www.reddit.com/r/AskReddit/comments/15umtrc/what_is_the_stupidest_thing_your_mom_and_dad/",
 "comments": [
  {
   "comment_id": "jwrtw8h",
   "message": "After I was born and brought home, my dad started an argument because he was convinced I wasn't his baby. Why? Because I didn't look like him at all, I was like a few days old. Basically I was the reason why they kept fighting for many years, when I was still a kid he left. Noe he only keeps in touch with my older sister who looks like the female version of him. Fair enough, she looks 100% like him and I look 100% like my mom.",
   "created_utc": 1692391648,
   "score": 135,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwrjjn8",
   "message": "Mine would fight over what we would get to eat at drive throughs.  4 Kids, and each of us wanted something different.  My mom would always try to let us order what we want.  My dad would just yell into the speaker \"6 Whoppers!  No Cheese!.\"  \n\n\nThis happened a lot.",
   "created_utc": 1692387772,
   "score": 207,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwruv1m",
   "message": "We were on holidays in Spain, first morning there and my mum sent my dad to the shop to get breakfast and lunch. He came back with a stupid looking hat, 6 beers, a pack of cigarettes and a can of pea soup.\n\nAll I remember is the door slamming as my mum dragged me out and we didn't see him until the next morning.",
   "created_utc": 1692392013,
   "score": 87,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwrsw4g",
   "message": "The spelling of the word “balloon”. They both agreed a word couldn’t have two double letters in a row and were arguing about whether it had two L’s or two O’s. \n\nThey were professional bookkeepers…",
   "created_utc": 1692391263,
   "score": 164,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jws10qb",
   "message": "My dad was furious at my mom for cheating on him…she was raped. I didn’t understand what he was getting at as he only said, “I can’t be with a cheater” but man if present me could go back in time and verbally smack him down... They are good now and still married and he understands you can’t blame the victim.",
   "created_utc": 1692394416,
   "score": 52,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwrvq9c",
   "message": "My dad didn't want to learn how to do my hair (I'm black) \n\nHe got me a perm and I had to shave my hair off and had a buzzcut in middleschool",
   "created_utc": 1692392345,
   "score": 47,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwro478",
   "message": "Crack.",
   "created_utc": 1692389467,
   "score": 39,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsddic",
   "message": "One weekend my father painted some walls in the basement and missed a tiny spot (genuinely tiny—a speck on a textured wall that required climbing onto a stepladder and a flashlight to point out). My mother demanded to know how my father could live with the knowledge that he'd missed a spot. \"Quite comfortably, I think,\" was his reply. There was yelling.",
   "created_utc": 1692399588,
   "score": 37,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jws5gf1",
   "message": "One day my mom and dad fought real bad, because I was playing Crash Team Racing with my father on my PS1, it was already late and my mom wanted me to go to sleep, but my father said it was friday night and we should have fun together for a little bit longer. This fight lead to their divorce. I can still remember some words they said to each other, no bad words, just very hurtful things about each other that I know they regret saying those things, but still is the main topic of my therapy. Very stupid and very sad actually.",
   "created_utc": 1692396209,
   "score": 21,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwrt5pj",
   "message": "Who is sitting on the remote.",
   "created_utc": 1692391365,
   "score": 19,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jws9gxk",
   "message": "I got a D in math in freshman year of high school I was 14. \nMy first failing grade\nMy mom had an existential meltdown I never experienced before, literally kicking and screaming like a child at the realization that her son is just an average joe enjoying his life through high school and not a straight A student and starting screaming and crying over it. I was too young to even consider it abuse but yeah my mom was a narcissistic perfectionist and I just assumed all parents/kids get raised with these standards. My dad started screaming at her that it’s my life and I can do what I want because I was literally a kid and it’s freshman math for gods sake. \nMy dad almost left my mom that night and took me with him he thought that was the most disgusting display of a toxic person.\n\nSo, I guess my report card.",
   "created_utc": 1692397908,
   "score": 41,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwrrvu9",
   "message": "Cheating",
   "created_utc": 1692390881,
   "score": 16,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwscqrb",
   "message": "Lmao a chess board\n\nMy dad went to take out the recycling and he saw that someone had left a ratty, shitty old chessboard on top of the bin, and he decided he was gonna bring it home.\n\nWhen my mom saw it she lost. Her. Fucking. Mind. She flew off the handle completely, they were red faced and screaming at each other for a whole night, and they decided they were gonna get divorced over it (eventually they both calmed down and are still together now, like 12 years later)\n\nAs a kid I didn’t understand what she was freaking out about. It was only a chessboard, it wasn’t like a huge piece of furniture, what’s the big deal? As an adult though, looking around at all the useless shit my dad is holding onto cluttering the apartment, I think somebody would have to turn a firehouse on me if he walked through the door with one more useless thing that he pulled out of the trash",
   "created_utc": 1692399311,
   "score": 15,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwrzwc0",
   "message": "A Netflix account.\n\nWhen I was about 8, me and my brother were shoveling our driveway (it was the middle of winter) while my dad was busy getting drunk as hell right next to us. My mother has my other brother and was trying to login to the Netflix account on our TV, but couldn't figure out the password. Anyways, we all head inside because the driveway was done, and my dad sees her trying to login to the Netflix account and asks what she's doing. She politely explains what was going on, and for some reason he just got mad as hell and started shouting at her and how she's an idiot because \"Netflix doesn't need a password to login with\" (I have no clue either) she tries to deescalate the situation, and it got pretty physical. After that, she called the police because he almost killed her. They show up, he goes to jail, and some stuff happens. They're still together and doing much much better. They both got some counseling, went to therapy, and they're both actively trying to avoid alcohol. Unfortunately that last part isn't working out so well. But they're not fighting anymore at least",
   "created_utc": 1692393967,
   "score": 14,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwrrx89",
   "message": "If ghost were real",
   "created_utc": 1692390896,
   "score": 30,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwrt9ts",
   "message": "how bald I was gunna be",
   "created_utc": 1692391410,
   "score": 11,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwrrq9w",
   "message": "Salt in water",
   "created_utc": 1692390824,
   "score": 11,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jws5q92",
   "message": "My dad once got it in his head that my mother viewed me as her boyfriend and was getting sex from me because she wouldn't have sex with him when I was like 8.\n\nLead to a massive argument due to the bizarreness of the claim and I remember my dad running up and down the street kicking all the trash cans over because my mother bolted out of the house to call the police.\n\nWeird times.",
   "created_utc": 1692396325,
   "score": 21,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsc9v9",
   "message": "$20 (I’m sure there were even dumber things but this one stood out to me). I don’t even remember why or how it started, but I was like 8 at the time and pretty sick of hearing them arguing all the time. So, I grabbed $20 of my own allowance/Christmas money and offered it up to end the argument\n\nInstead, they refused my money, said something along the lines of “that’s really sweet, but you don’t need to do that”, and got all embarrassed for a few seconds\n\nThen, they started arguing about who’s fault it was that their 8-year-old just offered them $20 to quit arguing\n\nGood times lol\n\n(Edit: Formatting/grammar)",
   "created_utc": 1692399109,
   "score": 8,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwryb54",
   "message": "They literally fought over the word \"mighty\".\nWe were.playing Scrabble at that time ang my mom put mighty on the board and my dad said that the spellimg is imcorrect but my mom really knows her thing and yeah they started to fight over it.\nThey fought to the point that my mom was crying and my dad is throwin things at the living room (idk maybe their argument branched out ig)",
   "created_utc": 1692393345,
   "score": 6,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jws9wc0",
   "message": "One time we realized a random house in our neighbourhood had our last name on the door.  We had no idea who lived there, yet my mom was insistent on finding out \"just in case we own a stake in that house\".  My dad thought she was being ridiculous.\n\nShe's an otherwise intelligent woman, and this was one of her dumber moments.",
   "created_utc": 1692398092,
   "score": 7,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwshxcy",
   "message": "We were in a car outside the house getting ready to leave and my dad exploded and started yelling how stupid it is that my mom opened a can of Coke in the car when we had a liter bottle of it inside the house because buying a liter bottle of Coke was a few cents cheaper than a can of Coke when computed according to the volume of liquid per dollar and it was a waste of money to do that. We were not poor at that time.",
   "created_utc": 1692401582,
   "score": 6,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jws3x7o",
   "message": "They’ve argued over which way you wipe your ass Up or Down.",
   "created_utc": 1692395582,
   "score": 5,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsdll8",
   "message": "I remember they came home from the mall one day and having a fight about a chair. I mean, like a singular kitchen chair. Apparently my mom wanted the chair but my dad said we don't need another chair, and there was the stupidest fight. My mom was really big into furniture, and admired random pieces of furniture and other things. I think this stemmed from having grown up rather poor, and in post WWII Germany, where her house was bombed and pretty much everything her family owned was destroyed. She'd sometimes quizz me on the origins of things we had at the house to make sure I knew how much this or that thing was worth, though I never shared her obsession with all this stuff.",
   "created_utc": 1692399686,
   "score": 6,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsh4md",
   "message": "Back when I was a little kid, my parents would collect coins. Most of the time, my mom would show a 'cool/rare' coin to my dad, and she would say what was 'cool/rare' about it. When my dad would see the coin, he would start telling her that the coin wasn't 'cool/rare'. And then, they'd start arguing about it, and my dad would say stuff like, \"it's not my fault your eyes suck!\"",
   "created_utc": 1692401231,
   "score": 6,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsa1mr",
   "message": "Literally fucking everything. My mom loooooved arguing and starting fights just to bring up old shit and to bring my dad down to her level. Pettiness and being pathetic was her comfort zone.",
   "created_utc": 1692398155,
   "score": 4,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jws8zke",
   "message": "My dad used to get high and then video record himself dressing up in stretchy club dresses and (badly) doing his makeup. So one day my mom gave me one of the dresses saying she “found it” and I should try it on. So I did and she said it looked so cute and I should go show my dad lmao\n\nThey fought for hours about it. Surprised he didn’t commit a murder suicide that day tbh",
   "created_utc": 1692397702,
   "score": 8,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jws9elt",
   "message": "Making a pb and j wrong. Dad made me a pb and j; Mom felt the technique was off; Fought for 3 days; Still haven't recovered. Still to the day dont understand what made it different from any other pb and j. Damn",
   "created_utc": 1692397881,
   "score": 4,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsh3ji",
   "message": "My Dad smoked cigarettes and my mom did not before they got married they would fight about the cost of my dad's cigarettes cutting into their wedding money. His cigarettes were about $1 or $1.50 😂 that same brand of cigarettes is over $10 today. Thankfully my dad quit smoking over 20 years ago.",
   "created_utc": 1692401217,
   "score": 4,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsm3dl",
   "message": "I once had a knockdown, drag out fight with my wife about who pulled the rope out of my bathrobe…\n\nFortunately I realized I was being insane and started working on why those kinds of arguments kept happening…",
   "created_utc": 1692403432,
   "score": 5,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jws8wlp",
   "message": "Couldn't tell you.   I cannot remember a single time my parents fought.  I'm not saying they didn't, I'm positive they did.  Just never in front of me and my sister. And I'm sure that was intentional.",
   "created_utc": 1692397668,
   "score": 6,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwrt7v8",
   "message": "How much my iPhone cost.",
   "created_utc": 1692391388,
   "score": 3,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jws5d9q",
   "message": "Who to ask between the two for something.",
   "created_utc": 1692396172,
   "score": 3,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsaaau",
   "message": "I and my younger brother had to get changed on my mother’s doorstep,because my father insisted that he’d never see those clothes again",
   "created_utc": 1692398257,
   "score": 3,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsryim",
   "message": "Oh so many, how to choose… the most recent I can think of was when my mom and step mom went to Costco. My mom was going to buy some clothes and my step mom asked her if she was going to get rid of any of the clothes she already had (a bit dickish, but to be fair my mom is a bit of a hoarder). My mom didn’t buy the clothes. Instead, they had a screaming fight in Costco, and when they got home my mom threw all of *her own* clothes out on the lawn. 30 years of domestic bliss /s.",
   "created_utc": 1692406071,
   "score": 3,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwstxwp",
   "message": "About my dad not liking my mom's food because he find it \"tasteless\" (he used to smoke two packs a day, no wonder why he couldn't taste anything)",
   "created_utc": 1692406955,
   "score": 3,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jws8b84",
   "message": "!y folks argued once about what engine to put into her '39 Anglia Gasser Drag Car..  Mom wanted a 392 Hemi \u0026amp; Dad wanted a Big Block Chevy.  Needless to say it was powered by a 392 Hemi.  My folks were cooler than I ever will be.",
   "created_utc": 1692397416,
   "score": 5,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwrzfbr",
   "message": "The milkman",
   "created_utc": 1692393782,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jws8dgl",
   "message": "tissue paper.",
   "created_utc": 1692397442,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsgqrs",
   "message": "My dad wanted bread on the table when we sat down to eat.  I remember a lot of yelling about this.",
   "created_utc": 1692401064,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsh4yu",
   "message": "Me",
   "created_utc": 1692401235,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwshcch",
   "message": "My dad being right when he was clearly wrong. 🙄 Narcissistic asshole…",
   "created_utc": 1692401327,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsjm8j",
   "message": "Nothing that I can recall. For better or for worse, my mom was pretty subordinate. It was definitely my Dad's household, but not in like a douchey or abusive way -- she just deferred/relied on him for most everything.",
   "created_utc": 1692402327,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsksak",
   "message": "I really don’t know which one is the most stupid reason so far because every reason of theirs is stupid in my eyes",
   "created_utc": 1692402848,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwstm2y",
   "message": "Same things they fight for now. Mostly accusing the other of whatever they're doing. Something like nagging someone about \"always be nagging\" and always criticizing the other for \"always having something to criticize\".",
   "created_utc": 1692406809,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsu6f5",
   "message": "About whether or not I should be grounded for failing a pop quiz on material we didn't cover (the teacher gave us the wrong quiz and decided to fail us anyways because we \"should have known the material\" even though it was seven or eight chapters away from what we had studied).\n\nwe were not grounded and my mom went in to talk to the teacher, along with every other parent.",
   "created_utc": 1692407063,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsv2cu",
   "message": "When my parents were getting divorced they woke me up arguing over who got the special edition Star Wars VHS tapes.",
   "created_utc": 1692407462,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsx44q",
   "message": "In the months preceding their divorce my parents fought about all the things but the number 1 chart topper was on my 8th birthday they got into a heated argument about who got to take me to get my haircut before the party and presents.\n\nThey started yanking me back and forth like children fighting over a toy and this grew so violent that my mom's grip gave out and my dad inadvertently tugged me full speed and head first...\n\n....Into the corner of the washing machine.\n\nKnocked me out cold and I missed my own party being rushed to the hospital for medical attention (I was driven by a neighbor parent so as to avoid any further debacle on which parent got to drive me)",
   "created_utc": 1692408395,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsy1mt",
   "message": "Laundry",
   "created_utc": 1692408835,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsyhpi",
   "message": "My dad wanted to take me and my siblings to Disney world when we were younger. My mom agreed but said we were not flying there and we have to drive. I live in New Jersey and it would take two days to drive down to Florida. Even at eight years old, I didn’t agree with driving down there. Anyway my dad said no as it wasn’t fair to us kids to be in a car for two days. And it doesn’t make any sense to drive down to Florida when you can take a plane and you’ll be there in two hours. My mom screamed that she was not flying and either we drive down to Florida or we don’t go at all. Long story short we never went. It was a family argument for years.",
   "created_utc": 1692409040,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwt1c07",
   "message": "Hell, every damn thing.",
   "created_utc": 1692410369,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwt4odd",
   "message": "I was about 10, In my bed and then heard my mum and dad SCREAMING at eachother downstairs. I cried. Later, I found out it started when my mum claimed that my dad liked Donald Trump. Come on mum…",
   "created_utc": 1692411975,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwt6s4i",
   "message": "I once made a little display track for my model trains. Just a thin, straight thing about 1m logn with a little bridge and such.    \nApparently it really pissed my step dad off. This idiot flipped his shit because apparently trains go around and around in circles, not back and forth.  \n\nIt started a shouting match with my mother about that. I'm sure there were other underlying issues I had no concept of at that age... But that doesn't make it any less stupid.",
   "created_utc": 1692413007,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwt8jaq",
   "message": "A chainsaw. My dad used to own a high-end, gas and oil powered chainsaw. He loved using it to the point that it drove my mom crazy. Mom gave dad an ultimatum: get rid of it, or she would get a divorce. Thankfully, my parents did not get a divorce.",
   "created_utc": 1692413882,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtp4o6",
   "message": "My parents were arguing about something typical. \n\nThen my dad drank from a cup on the counter and made an eww reaction. \n\nMom: \"what did you drink?\"\nDad: \"turpentine.\"\nMom: \"WHY DID YOU DRINK TURPENTINE?\"\nDad: \"YOU CONFUSED ME DO MUCH YOU MADE ME DRINK THE TURPENTINE.\"\n\nThe argument continued for another half an hour about whose fault it was that my Dad drank turpentine.",
   "created_utc": 1692423674,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtwqmk",
   "message": "Money tbh. It got worse as I graduated high school. My dad working all these hours but only such money was going towards bills. Didn’t make sense, until I caught my dad on his phone cheating. Texting multiple women. Also sending money to women but in reality, we found out he was getting scammed for money. \n\nLittle back story: \nForgot my phone in a friends car. I asked to borrow his, found it odd that he was hovering as I was waiting for a response. He eventually went out to the garage I was responding back to my friend who found it. A notification popped up from one of those texting apps saying Hey Babe I’m sorry.. obviously I got super furious and snooped. If I didn’t snoop I never would have found out he was already in an online relationship. Not including the other messages of him failing with other women. Sending money to who he thought was women but you can obviously tell by the profile and pictures that it was a fake. This was during the time there was a huge scandal for people being scammed out of money in like 2017/2018.",
   "created_utc": 1692429245,
   "score": 2,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jws64q8",
   "message": "my math homework",
   "created_utc": 1692396492,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtkjje",
   "message": "My father was extremely abusive to me and my mom. \n\nOne night he offered to help mom make dinner. She said no thanks and he got violent",
   "created_utc": 1692420661,
   "score": 0,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtpakr",
   "message": "If I was technically a God or not",
   "created_utc": 1692423788,
   "score": 0,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtpqlv",
   "message": "Why I was jerking it in the back of my car",
   "created_utc": 1692424096,
   "score": 0,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsflzi",
   "message": "They once had a fight about how much funds to spend on christmas as my mum really wanted a special christmas especially since it was my older sisters last christmas before she left home and my dad wanted to make cut backs as money was tight which is stupid af LOL",
   "created_utc": 1692400572,
   "score": 254,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsfv47",
   "message": "Money all the way....",
   "created_utc": 1692400682,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwshlxw",
   "message": "Who’s better at being shitty.",
   "created_utc": 1692401444,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwshmww",
   "message": "Bc I was scared of them",
   "created_utc": 1692401456,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsifxx",
   "message": "My parents yelled at me in 4th grade because I didn’t wanna join book club and I didn’t tell them about book club and they found out about book club at the end of the year.They made me take book club the next year.",
   "created_utc": 1692401804,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsnu5u",
   "message": "My older brother getting caught having sex with his girlfriend, in college in fact! Mom was horrified and wanted my Dad to pull him out of college and have him move back home because his Catholic college was still allowing him to be corrupted by loose women (this was 1969, loose women was the norm...). Dad said \"How do you think your mother felt when she caught us with me on my knees between your legs and your dress over your head?\" That was the first time I even realized that my parents must have had sex, at least 4 times (there were 4 of us kids). Even though I was too young to understand the full relevance of that, I had a new respect for my Dad. Later on when I figured out what must have been going on, I had a new image of Mom too...",
   "created_utc": 1692404217,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsomnr",
   "message": "The next door neighbor who always gardened in her bikini 👙",
   "created_utc": 1692404571,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsp2ns",
   "message": "If they should have a pool slide when putting in a pool.",
   "created_utc": 1692404771,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsrcod",
   "message": "I recall mom telling dad, “ you hit him now, my arms are tired “.",
   "created_utc": 1692405800,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwssrtt",
   "message": "If I way gay or not",
   "created_utc": 1692406435,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwssxqy",
   "message": "Money, my sister and I were always terrified they were going to get divorced",
   "created_utc": 1692406508,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwstkvh",
   "message": "My mom would always start a fight with my dad whenever he decided to splurge on me and my siblings, even if the money was extra after all the necessities were paid off. Arguing about how they need to focus on their finances. \n\nThat’s a reasonable thing to be upset about but we all acknowledge she was a hypocrite because she never say a damn thing about finances when he splurged on her, even if it was money we couldn’t afford to spend.",
   "created_utc": 1692406794,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsvjfn",
   "message": "One day he almost sliced my mom's throat fir not holding the chicken meat properly",
   "created_utc": 1692407677,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsw7qx",
   "message": "me",
   "created_utc": 1692407986,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwswcjw",
   "message": "Me",
   "created_utc": 1692408045,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwsy25y",
   "message": "Me.\n\nTurned out I wasn't as stupid as they thought",
   "created_utc": 1692408842,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwt2mth",
   "message": "Wasn't old enough to get to experience whatever hellscape arguments they had before they divorced. Knowing them both I'm sure it was an absolute shitfest.",
   "created_utc": 1692410992,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwt6nga",
   "message": "Basically every time we go somewhere new as a road trip.\n\nThey'd always fight about directions.",
   "created_utc": 1692412944,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwt7jrb",
   "message": "nice try fbi I keep my trauma for myself",
   "created_utc": 1692413384,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwt7tej",
   "message": "My mom and her boyfriend fought over who opened a new ranch bottle when one was already opened. A lot of extra pettiness and slammed doors",
   "created_utc": 1692413517,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwt8nge",
   "message": "When I was in college, my parents replaced their boat trailer. The new one was significantly wider than the old one. The first time they tried to back it into the garage, I thought they were going to get a divorce. After about an hour, I realized that the new trailer had a wheel that could be lowered on the tongue, which the old one did not have. We put that down, unhitched, and easily pushed it into the garage. I'm still convinced it saved their marriage.",
   "created_utc": 1692413942,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwt9h4y",
   "message": "Back then, like ~30yrs ago: Who would be driving and who would be riding shotgun.. to McDonald’s.. that was just 2mi away. \n\nThis was in a 3rd world country so 2mi drive would be considered a “long drive.”",
   "created_utc": 1692414367,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtasge",
   "message": "Having another kid.",
   "created_utc": 1692415062,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtb0c2",
   "message": "Who was more poor growing up. \n\nMy dad lived in our city, in a house his family built in the late 60s.  My grandpa was a blue collar man that had jobs in road construction and later warehouse work. Grandma was a teacher, but had some medical problems so became a librarian also worked at some various bookstores. \n\nMy moms parents lived in a school bus in the middle of farm land for the first few years of my moms life, with no running water besides a well. This was 1971-974 ish. Then they inherited my grandpas parents house that my grandpa grew up in. They were farmers, commonly lived on commodity food or their hobby farm animals. The house is old. Even visiting today there is no air conditioning and upstairs there is no heat (this is the midwest). They are most definitely better off than they were when my mom was young. \n\nAnyways my dad is convinced my moms family is secretly well off and lived in poverty for fun. According to him he had it wayyy harder growing up because all of the neighbors had better stuff than them.",
   "created_utc": 1692415176,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtbt0y",
   "message": "My mom bought my dads mom a Greyhound bus ticket (she refused to fly) to come visit us.  The argument was over wether or not it was a one way ticket or round trip.",
   "created_utc": 1692415602,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtc21w",
   "message": "Custody",
   "created_utc": 1692415737,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtd44h",
   "message": "My mom and my paternal grandmother fought over where I got my dimples from",
   "created_utc": 1692416311,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtdk4t",
   "message": "My mom and second step dad sat down to have a hypothetical fun conversation of what they'd do if they hit the lottery. It resulted in a week long major nonstop fight. At one point my mom threw a fabergé egg type thing through the sliding glass window, a few holes were punched in the walls and the door to my bedroom was destroyed with a hammer. The police came out one night which only made the situation worse. Not sure how but it all stopped just as suddenly as it started as if none of it ever happened.",
   "created_utc": 1692416558,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtfkdi",
   "message": "Mom letting my brother \u0026amp; I open an Xmas oresent early.... \n\nI hate Xmas...",
   "created_utc": 1692417694,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtgog5",
   "message": "Pie.",
   "created_utc": 1692418341,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtguw5",
   "message": "My parents fought a lot. \nBut the most stupid fight was about not wanting to spend time with each other. \nMy mother is very closed-off person. Sometimes she shuts off and every social interaction is exhausting for her. My father doesn't understand this and sometimes uses it as a weapon to say that she doesn't take care of me because we don't talk much.",
   "created_utc": 1692418445,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtkigk",
   "message": "Overcooked scrambled eggs",
   "created_utc": 1692420643,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtlmzq",
   "message": "After my grandfather died my father left his workplace because after one week of taking a leave to mourn, he came back to a messy workspace. The tools he left we're gone. Anyway fast forward 3 months he still doesn't have a job that earns as much, I can barely move because mother had us circ*msiz3d (I have a younger brother). My mother went cleaning each rooms then asked my father why his cabinets are messy. My father said \"Why didn't you clean it like you would if I was giving you as much money as before?\" My mom is tired of work at the time so they fought. After that I'm amazed that my mother would sleep on the couch instead.",
   "created_utc": 1692421351,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtm5nc",
   "message": "They would fight about what kind of house we would buy if we won the lottery.",
   "created_utc": 1692421681,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtogsk",
   "message": "Who could punch harder.\n\nDad always won...",
   "created_utc": 1692423220,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtp768",
   "message": "My dead would play on Unreal Tournament tournaments and sometimes yell late at night because the game emotions ran high.\n\nMy mom is an enraged monster if you wake her up suddenly, they nearly got divorced over it",
   "created_utc": 1692423720,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtpofz",
   "message": "Dad and step mom discussing whether or not to put me and my brother in child welfare to save money for a house. I was 9 years old and brother was 6 at the time.",
   "created_utc": 1692424054,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtqh13",
   "message": "My dad cut down a tree and my mom was mad because she wanted him to cut down a different tree.\n\nTrivial, but it was the only time I ever saw them fight.",
   "created_utc": 1692424607,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwts9zp",
   "message": "They argued And almost split up over a Tony hawk ps2 game from blockbuster on a Friday night, it was pre owned \u0026amp; my dad was all for getting it me and my mum for some reason blew up and caused a scene in blockbuster. \n\nMan they must've had issues behind the scenes",
   "created_utc": 1692425887,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtv7rr",
   "message": "If the jar of pickles was expired or not. It was and my dad had a very bad night",
   "created_utc": 1692428071,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtxrk4",
   "message": "Me",
   "created_utc": 1692430049,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwty73v",
   "message": "Terminator Time Travel.",
   "created_utc": 1692430398,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwtzfg3",
   "message": "Just when I was younger?\nWell, it's basically \"No u\" all the way, mostly fueled by misunderstanding, reflection of internal issues on the surface and referring to some past events for keeping the convo adrift",
   "created_utc": 1692431385,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwu3bm6",
   "message": "Who was better in math in elementary school. Like once a week. Who the fuck cares so stupid",
   "created_utc": 1692434532,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwu7yhu",
   "message": "They wanted to write a pros and cons list over something and started arguing over whether they should list the pros first or the cons.",
   "created_utc": 1692438219,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwua0j6",
   "message": "Whether or not to get a denim couch. \n\nMom wanted the couch, dad didn’t want the couch. So they compromised and got the couch",
   "created_utc": 1692439830,
   "score": 1,
   "submission_id": "15umtrc"
  },
  {
   "comment_id": "jwubon2",
   "message": "Probably my existence. They fought over whether I was a mistake or not, but they eventually came to realize that I am perfect.",
   "created_utc": 1692441130,
   "score": 1,
   "submission_id": "15umtrc"
  }
 ]
}