{
 "submission_id": "15uq4vc",
 "title": "What’s the nicest compliment you’ve ever received?",
 "selftext": "",
 "created_utc": 1692378187,
 "permalink": "/r/AskReddit/comments/15uq4vc/whats_the_nicest_compliment_youve_ever_received/",
 "score": 43,
 "url": "https://www.reddit.com/r/AskReddit/comments/15uq4vc/whats_the_nicest_compliment_youve_ever_received/",
 "comments": [
  {
   "comment_id": "jwr1srh",
   "message": "My dad and I were talking about the issues some of my friends have with their parents and he said \"they need to be more like you, I mean you basically have the perfect personality.\"\n\nHe said it really casually too. It wasn't meant to be a meaningful moment. \n\nBut it's embarrassing how much that meant to me.",
   "created_utc": 1692381203,
   "score": 18,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr639v",
   "message": "\"You're the best daddy ever!\" - my, at the time, 4 year old.\n\nIf you knew the type of father I grew up with, you'd know how much I live to earn that compliment every single day.",
   "created_utc": 1692382788,
   "score": 17,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwraw9g",
   "message": "I was called a Bad ass by the lead detective on something I was going through. It was about six months after my son and I were ran over by a car. I had always told everyone what happened and they’d always kind of roll their eyes and shrug me off when I’d say I remember everything and go into great detail about it. \n\nHe stated that he had watched all of the videos so many times he had them permanently stuck in his head, but with all angles they couldn’t tell if my son touched the car at all during the impact. I kept telling him that I took all impact and the kid was injured from impact on the road. (He suffered a TBI, amongst other things, but is a happy and healthy kid now!!!)\n\nWhen he called to tell me that the dna was in from the front of the car and that I was right. Only my dna was on the car. That I’m a bad ass super woman for reacting as quickly as I did because my son wouldn’t be alive if it weren’t for my grabbing him and spinning him away so quickly. \n\nNot only did he say it so casually and naturally, but he validated everything I had always told everyone. He made me feel a little less insane. He also made me feel like the best mom on earth. I was very happy my husband and sister were with me when I got that call because I cried so hard. 🥹",
   "created_utc": 1692384560,
   "score": 8,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqvn6e",
   "message": "“You are a good person who deserves good things and a better partner, one day, you will find someone who makes you happy.” From my exes mom, hearing her tell me that even after her son and I broke up was really nice",
   "created_utc": 1692378958,
   "score": 24,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqy5jf",
   "message": "A friend, a very successful person, and all-around gem of a person who I always looked as a younger brother, at his wedding said to me :\"You are the reason I am the man I am today\".\n\nI almost broke into tears.",
   "created_utc": 1692379871,
   "score": 22,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr673n",
   "message": "\"I've never seen kindness come so naturally to someone\".",
   "created_utc": 1692382827,
   "score": 5,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqw6c3",
   "message": "About a decade ago I (44M) was in a gas station in northern Wisconsin in September. It was only around 50 degrees F but I was wearing shorts because I had a long drive ahead and I find them more comfortable.  Anyway, the older lady working the counter looks me up and down and says \"if I had your legs, I'd wear shorts too\". Totally made my day.",
   "created_utc": 1692379151,
   "score": 16,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr97b2",
   "message": "2 women talking to me in a pub asked if I was single I replied no. 1 said If you were my man I wouldn't let you out the house her friend replied I wouldn't let you outta my bed. I'm normal looking nothing special but that made me feel great. Nice confidence boost.",
   "created_utc": 1692383936,
   "score": 5,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwra278",
   "message": "My grandson told me the other week that he's always telling his mates about me (in a flattering way). I thought at the time it was the nicest thing anyone had ever said to me.",
   "created_utc": 1692384251,
   "score": 5,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr03eh",
   "message": "My roommate in medical school complimented the way my bulge looked in my favorite pair of sweatpants. We're both straight guys.",
   "created_utc": 1692380583,
   "score": 4,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqtqwt",
   "message": "When the first thing someone says after they taste something you made isn't a word.\n\nBut like in a good sense lol",
   "created_utc": 1692378266,
   "score": 9,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr1jjc",
   "message": "There was a girl who told me I was the most confident guy she had ever met. I had struggled with social anxiety issues for years, and that statement would have been so laughable just a few years back. It was such a big statement on how well I had done to get my brain in order.",
   "created_utc": 1692381111,
   "score": 5,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqtqte",
   "message": "A young man told me I had very symmetrical ears.😅",
   "created_utc": 1692378265,
   "score": 7,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwreh4y",
   "message": "In Italy it's common that young kids (6 to 13) go to a summer camp where teens and older guys and girls teach them some kind of creative activity or sport, and all play together in the free time, and on the last day there's a big party where teams show to parents what they have learned and do some kind of performance (dancing, singing, theater etc) and they get points. At the end one of the teams wins and all get different prizes.\n\nSo, back when I was 15 I was the leader of the blue team and there was this girl in my team who was like 6 or 7 that I often helped and played with because she was the sweetest. The last day our team did the best performances (all while playing \"Blue\" by Eiffel65) and we won. Later that night during the afterparty for all the kids she comes to me and says she has a present, but to only open it when I would be home, so I did.\n\nIt was a thank you card handmade by her that said \"thank you for playing with me\", with a bracelet attached. It made my day and week and month.\n\nFlash forward 7 years, my mom met her mom (they were old friends) and she asked about me, university, etc usual things. My mom asked about her daughter and she said that she also wanted to be one of those teens at the same summer camp, and she wanted to do it because of me, because she loved how much I listened and cared for her and her friends, I taught a lot of things and I was the big brother she never had. She wanted to do the same things I did for her, for all the new kids. And I don't know what to say, I'm speechless and I still don't believe it, it's been about a month now and I'm not over it yet.\n\nI know it's not really a compliment but I thought it would fit here anyway :)",
   "created_utc": 1692385882,
   "score": 3,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrfnkq",
   "message": "“I can spend all day with you without looking at my phone” - just hits differently nowadays",
   "created_utc": 1692386326,
   "score": 3,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrhgpe",
   "message": "A relative's kid (who I don't see often) named their imaginary friend after me.\r  \n\r  \nTo think I made an impression like that is pretty cool!",
   "created_utc": 1692386998,
   "score": 3,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqtqua",
   "message": "I once had someone tell me that they love having me as a friend because despite all I've been through, I'm endlessly kind. Best bro compliment I've ever gotten.",
   "created_utc": 1692378266,
   "score": 6,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqtq8w",
   "message": "It was from a really drunk friend. She told me I had been the most supportive person in her life that year. Really felt good. She's sober and doing better now.",
   "created_utc": 1692378260,
   "score": 6,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr6g2w",
   "message": "\"if I really am all the amazing things that you say I am, then I deserve you\".",
   "created_utc": 1692382919,
   "score": 5,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr0egy",
   "message": "I was told last night by a nurse that I have beautiful eardrums.",
   "created_utc": 1692380696,
   "score": 2,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr6btj",
   "message": "Two guys walked by when I was walking down the street. They checked me out, and said \"Green eyes, huh?\" I was a LOT younger then BTW. I was flattered they noticed my eye color. A lot of people don't.",
   "created_utc": 1692382876,
   "score": 2,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr8cz4",
   "message": "That's the nicest compliment i've ever recieved.",
   "created_utc": 1692383629,
   "score": 2,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrih4l",
   "message": "Walking past some 16-18 year olds at the gym and after I passed them, \"That dude looked like a pro wrestler!\"\n\nAwwww staaahhhpp, my heart",
   "created_utc": 1692387377,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrlue0",
   "message": "\"you're capable of good things so do good things\"",
   "created_utc": 1692388619,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqtzr6",
   "message": "Guessing my age, they think I'm like 10 years younger. That's good and bad at the same time.",
   "created_utc": 1692378356,
   "score": 3,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqu8w8",
   "message": "I was going into a restaurant as two women were coming out and one of them said that I had nice legs and the other lady agreed. I'm a guy and don't get many compliments so that made me feel good all day.",
   "created_utc": 1692378448,
   "score": 3,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqw0a9",
   "message": "“nice cock bro”.",
   "created_utc": 1692379091,
   "score": 2,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr6qrc",
   "message": "You have such nice eyelashes, so thick, in three rows, like shark's teeth. Lol",
   "created_utc": 1692383029,
   "score": 3,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrcwlx",
   "message": "Honestly, it was when a prostitute told me to stop paying women to have sex and told me to talk to girls and get some normally. \n\nI met this woman. I was very shy and nervous. When we were done, she would try to talk to me. Then she starts tickling me to try to get me to lighten up. Eventually we just start having a normal conversation. She asks me why I was so shy and nervous. I just told her that I don't have much experience with women. And then she keeps asking me why and the whole time she's genuinely smiling and laughing. She complimented me. Told me I was cute. She kept telling me that I could get laid easy in her country because the women are friendly, that they love American accents, and that I was considered \"exotic\" because I was tanned and a minority, apparently a lot of European women like men with tan/dark skin. And she kept telling me to just talk to women normally and that I could get girls the normal way. She kept encouraging me to get women the normal way instead of having to resort to paying. She was telling me most of the men she saw were older men, but she was telling me since I was so young, that I should just try talking to women. \n\nThe sex was great. Was she being genuine with the compliments? Honestly I think so, but it probably was because I payed. However I do believe that she genuinely meant it when she told me to stop resorting to paying women for sex and to try to pursue it the normal way.",
   "created_utc": 1692385301,
   "score": 2,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqtwg9",
   "message": "My mother's friend died. She was crying and I sang her... She said that \"I love you\"... It was nicest because I've never received an \"I love you\" before...",
   "created_utc": 1692378322,
   "score": 2,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqtxvy",
   "message": "That I look like Megan Thee Stallion when I’m shitface drunk",
   "created_utc": 1692378337,
   "score": 2,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqxyxa",
   "message": "Had a woman tell me my d\\*ck was like magic. That was a good one to hear.",
   "created_utc": 1692379804,
   "score": 2,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr2g0r",
   "message": "I can’t remember any exact words right now, but the best compliments, for me, are when I find out that someone said something nice about me and I wasn’t even there. “Compliments behind my back” I call them.",
   "created_utc": 1692381438,
   "score": 2,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr758v",
   "message": "\"You're so hot\". I'm a male.",
   "created_utc": 1692383180,
   "score": 2,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr8a8w",
   "message": "A really hot girl told me that girls would fuck me because of my southern accent.",
   "created_utc": 1692383600,
   "score": 2,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqulv9",
   "message": "I never received one 😂😂",
   "created_utc": 1692378580,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqv6tr",
   "message": "That’s it’s easy for me to get any job.",
   "created_utc": 1692378793,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqvy4o",
   "message": "Your name is very endearing",
   "created_utc": 1692379070,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqy62t",
   "message": "[deleted]",
   "created_utc": 1692379876,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr1gx8",
   "message": "That my ass is fat lol don't know if I'm the only woman that gets insulted when boyfriend says get ur little ass here 🤣",
   "created_utc": 1692381085,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqtlj0",
   "message": "False",
   "created_utc": 1692378211,
   "score": 255,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqz8x6",
   "message": "My mom told me I'm a nice young man :)",
   "created_utc": 1692380274,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwqzp0a",
   "message": "Nice belt.",
   "created_utc": 1692380436,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr05gx",
   "message": "Someone just told me about 20 min ago that I look like Kim Kardashian lol I definitely definitely don’t see it but it was a nice compliment.",
   "created_utc": 1692380605,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr104m",
   "message": "\"Wow you really ARE resourceful\".",
   "created_utc": 1692380916,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr3t39",
   "message": "That I have a nice voice.\n\nAs someone who grew up with older siblings and cousins who made fun of them for being annoying when talking, hearing that compliment (said over 10 years ago!) made me feel better about myself. \n\nThank you, Yosef, for your kindness and patience.",
   "created_utc": 1692381941,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr5gy1",
   "message": "A customer review from my old job. Its still on the website. \n\nHe has a strange sence of humour but is very approachable.",
   "created_utc": 1692382556,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwr8srj",
   "message": "A substantial raise at work.  Nothing else comes close.",
   "created_utc": 1692383788,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrbanz",
   "message": "Two different women have told me I have a nice smile and that'll always stick with me",
   "created_utc": 1692384707,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrc42g",
   "message": "im Pretty",
   "created_utc": 1692385010,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwreje9",
   "message": "My ex GF told me she admired how kind I am despite all that has gone wrong in my life. It's a good compliment on it's own but coming from her it was super special and I give that high for days",
   "created_utc": 1692385906,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwreqj6",
   "message": "Pick one I cant decide\n\nYou're a dictator\nI love everything about you",
   "created_utc": 1692385982,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrfepp",
   "message": "\"Your braids look like octopus tentacles. \" \n\nI don't know why, but that made me really happy.",
   "created_utc": 1692386232,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrffru",
   "message": "*You have the eyelashes of a calf (baby cow).*\n~Girl from my class, who later dated my 2 years older brother\n\nAfter that she once come up to me and said if I have a dick like my brother I can be proud of myself. She was an odd one.",
   "created_utc": 1692386244,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrgkl1",
   "message": "An elderly couple of British tourists asked me for directions and as i was explaining the lady was glaring at me really intensely and i thought to myself „lady you stopped me in my tracks, i‘m doing you a favor, why are you looking at me all pissed??“ \n\nAnd as i was done she made a baby step forward closer to me and said „you have the most beautiful eyes!“ so i guess she was just distracted and looking focused on my eyes :D it was very sweet because i feel pretty ugly and done get compliments often and i try to remind myself to not assume what someone is thinking/feeling because of that",
   "created_utc": 1692386666,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrhojs",
   "message": "Wife told me I'm manlier and sexier than Edward Norton when he defended his house in American History X",
   "created_utc": 1692387081,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrhvnb",
   "message": "When I was 14 a girl told me I looked hot in a white T shirt. I'm no 42 and still wear one everday.",
   "created_utc": 1692387154,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwriteo",
   "message": "A woman I had never met told me I have a light about me, something that glows from within. It's all I want in life",
   "created_utc": 1692387502,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrjl5q",
   "message": "I don't mind that your fat and ugly, I love you anyway",
   "created_utc": 1692387788,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrjqd8",
   "message": "I once walked through my living room while my sister had friends over. Just after I'd left the room, one of my sisters friends exclaimed, \"Oh my lord, *THAT* is what a man looks like.\" And my sisters' friends all concurred.",
   "created_utc": 1692387842,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrl1qq",
   "message": "That if I were an animal I’d be a capybara",
   "created_utc": 1692388326,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrlnnc",
   "message": "I was about 14 yrs old, talking to my best friends mom. Idk what the context of the conversation was, but she made a comment in response to something I had said… basically saying that I always seemed to find the good in a situation/look on the bright side. I never realized I did that until then. I’m 28 now and I still think about it",
   "created_utc": 1692388550,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrm9mo",
   "message": "I picked up some extra work for a colleague because I knew she was getting swamped with work for a bit. I later found out she was asked about it during her performance review, specifically if she had checked if I hadn't made any mistakes. Apparently she had answered something like \"I didn't need to check, because I know if [ConstableBlimeyChips] did it, it was done right.\"",
   "created_utc": 1692388778,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrmv33",
   "message": "I like your shirt",
   "created_utc": 1692388999,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrmz5k",
   "message": "I once was at my local gas station /market \u0026amp; I saw a boy and his father on their dirt bikes and the dad went inside to get gas and I made some conversation with the boy about him and his dads dirt bikes and he said they both built them and that he does a lot of stuff with his dad (me and my dad were never close really in any way and still aren’t to this day) I finished pumping my gas and the dad came back out and I said to him “you’re a good dad , you’re son was telling me about your dirt bikes and stuff “ and he said “thank you , and you’re a good son” when I drove away I started crying I don’t know why , but the best compliment I ever got",
   "created_utc": 1692389042,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrn0os",
   "message": "6yo told 35yo me I was a kid. I just had a big persons body.",
   "created_utc": 1692389058,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwroa85",
   "message": "A girl I met at a party told me that I have a contaigous smile and that one stayed with me for some reason",
   "created_utc": 1692389529,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrovrb",
   "message": "\"-I like your smile. The sun must be jealous, it's so radiant.\"\n\nNot a gross pick up line, but a charming compliment from a sweet old lady while we were in front of a shop, waiting for the opening. She also complimented my bag (a T.A.R.D.I.S. one gifted to me by a friend), and told me I had very pretty eyes, like the forest.\n\nIt all started when I complimented her hand-knitted sweater, which was a rainbow patchwork of crazy colors. And her glasses, not very common: she had heart-shaped glasses.\n\nShe made this (at the time) 19 year-old very happy, I was smiling for the entire week!\n\nWherever this lovely lady is today, hope she's smiling as much as she makes other people smile.",
   "created_utc": 1692389753,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrp6pz",
   "message": "It’s weird how you’re such a funny person but you’re depressed.",
   "created_utc": 1692389866,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrpi5f",
   "message": "I mean idk if it was a compliment but one NYE some chick grabbed my junk at the bar and said Nice and gave me her snap. I was kinda smitten",
   "created_utc": 1692389985,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrpr5c",
   "message": "After several very frustrating weeks trying to make positive change at a new job, one of my co-workers, who had been there several years, pulled me aside and told me: \"You're too good for this place.\" Up until then I thought that the problem was me, but it turns out that the agency was a complete craphole and was closed within six months after I left.",
   "created_utc": 1692390078,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrqx81",
   "message": "“I always forget that you can’t read”\nThis is something that my friends sometimes says when they want to show me something, it’s just incredibly nice to know that, my dyslexia is such a little part of who I am that, my friends just forget that it’s even there.",
   "created_utc": 1692390513,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrrf6i",
   "message": "\"You have a sophisticated voice\"\n\nThey never elaborated on what exactly was meant, which makes sense cause I have a shit voice.",
   "created_utc": 1692390705,
   "score": 1,
   "submission_id": "15uq4vc"
  },
  {
   "comment_id": "jwrrkhx",
   "message": "Someone told me: you got this and listen to the haters as they will end up fueling you up \n\nThey said that right before my basketball game were I scored 38 points 3 rebounds 8 assists 2 steals in a 73-60 win",
   "created_utc": 1692390762,
   "score": 1,
   "submission_id": "15uq4vc"
  }
 ]
}