{
 "submission_id": "15uu4lg",
 "title": "People who aggressively keep trying to open a bathroom door that is clearly locked, how else has your mental impairment affected your life?",
 "selftext": "",
 "created_utc": 1692387545,
 "permalink": "/r/AskReddit/comments/15uu4lg/people_who_aggressively_keep_trying_to_open_a/",
 "score": 156,
 "url": "https://www.reddit.com/r/AskReddit/comments/15uu4lg/people_who_aggressively_keep_trying_to_open_a/",
 "comments": [
  {
   "comment_id": "jwrj7jn",
   "message": "I like to stop my car several feet from the line when the light turns red, or 10 feet over the line so that way everyone can see me! Sometimes I stop and then crawl forward and stop and repeat. Sometimes I like to bring items from Walmart and try to get refund at Target and claim that they hate me",
   "created_utc": 1692387648,
   "score": 65,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwrr8mk",
   "message": "OP is on the toilet freaking out",
   "created_utc": 1692390635,
   "score": 47,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwroe0l",
   "message": "So I had a secret poop spot at my previous university (lpt: check the basements of buildings) that was apparently used frequently by one other person. Every single time after trying the door and finding it locked and therefore occupied, they would then knock on the door. For three years I wondered what this individual hoped to accomplish by knocking on a locked single occupancy restroom door.  Did they think we would become pooping buddies? I never got to ask them because those knocks were the only interactions we ever had.",
   "created_utc": 1692389569,
   "score": 35,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwrkdwc",
   "message": "Sometimes I say something dead serious and people think it’s a joke and then I think back on it and realize that I’m stupid.",
   "created_utc": 1692388086,
   "score": 20,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwsuijy",
   "message": "I hold in my farts until the elevator door closes",
   "created_utc": 1692407215,
   "score": 17,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwrt6v4",
   "message": "Gimme some credit, I saved y'all probably a full .25 seconds by honking right when the light turned green.",
   "created_utc": 1692391377,
   "score": 11,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jws5biu",
   "message": "I like to drive 10 miles under the speed limit just until the road widens to two lanes. Then, I speed up because that's the only time I notice the other cars behind me and I can't have them thinking I'm not capable of driving the speed limit.",
   "created_utc": 1692396151,
   "score": 24,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwrsvgw",
   "message": "If you continue knocking after you hear the toilet flush and can't wait the one minute it takes for me to wash and dry my hands, I will *deliberately* slow down and draw out the process as long as possible until either I'm satisfied, or you have pooped yourself.\n\nBonus points if you start knocking within 15 seconds after I've locked the door. There is no way any vaguely attentive person *didn't* see me enter the bathroom within that short amount of time.",
   "created_utc": 1692391256,
   "score": 9,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwrjc45",
   "message": "I pull when the door clearly says “Push”.",
   "created_utc": 1692387695,
   "score": 19,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwrkzea",
   "message": "Or people who pull on the door of a building that has a big sign saying CLOSED",
   "created_utc": 1692388302,
   "score": 8,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwt43wv",
   "message": "I had that happen today. \n\nThere was a kid taking a piss, there was the stall I was blowing up and the one next to it with the door WIDE open, so wide that you could clearly see as soon as you walk into the bathroom that it Un occupied. The dude that came in still tried my door as if he couldn't me grunting as a dropped depth charges and the door would magically be unlocked.",
   "created_utc": 1692411699,
   "score": 7,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwsvhho",
   "message": "I clap at the end of movies and when the aero plane lands!!!",
   "created_utc": 1692407652,
   "score": 8,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwt5vue",
   "message": "Putting food deliveries directly in front of outward swinging door.",
   "created_utc": 1692412567,
   "score": 5,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jws0jn9",
   "message": "only thing I hate more than these: people doing a very loud \"Ugh!\" sound, when seeing a locked toilet door. Yeah, I don't feel rushed AT ALL. Thanks for the non verbal comment on my audacity to use the only available facility.  \n(\"Ugh!\" people also tend to aggressively keep trying to open a bathroom door)",
   "created_utc": 1692394224,
   "score": 4,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwsqnr7",
   "message": "Excessively i bet. Cause they also don't know how to read a menu and expect employees to do that for them as well.",
   "created_utc": 1692405486,
   "score": 3,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jws6nrm",
   "message": "Probably quite significantly. Imagine being them.",
   "created_utc": 1692396712,
   "score": 3,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwt5zgx",
   "message": "I hate when there are 7 stalls on either side of a room, 14 total. I’m in number 5 on the right. And someone decides they have to go in the #4 or #6 stall RIGHT NEXT TO ME!! Dudette, there are 11 other stalls to choose from!!!",
   "created_utc": 1692412615,
   "score": 3,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwrlvie",
   "message": "F them",
   "created_utc": 1692388631,
   "score": 2,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jws7z81",
   "message": "when shit is at the gate the gate is but an obstacle to be knocked down",
   "created_utc": 1692397275,
   "score": 2,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwsqur9",
   "message": " Could be about to vomit?  But I know what you mean you refereeing to people who have no Bathroom\nEtiquette.   That could be part of a class in elementary a short version of what to do and what to do when. You grow up. It would take a day.",
   "created_utc": 1692405575,
   "score": 2,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwss53t",
   "message": "Lol",
   "created_utc": 1692406153,
   "score": 2,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwt6f46",
   "message": "i gotta poo :(",
   "created_utc": 1692412830,
   "score": 2,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwtj8n0",
   "message": "Ahahahahahahaha",
   "created_utc": 1692419858,
   "score": 2,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwu2bj7",
   "message": "One time while meeting my brother and sister in-law for the first time. I was trying to look at their newborn while my sister in-law was breastfeeding. Didn't know that she was, she kept turning while I was trying to get a look at the baby. I thought what's the problem here and as I was thinking that it dawned on me what was happening. Everyone including myself busted into laughter. I awkwardly said well that's one way to get to know each other. We all still make fun of me to this day and it's well deserved. 😬 My bad Vicky lol.",
   "created_utc": 1692433721,
   "score": 2,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwu6tr9",
   "message": "My family used to do this all the time.  They hear the vent going off and they can see there is light in there.  I just don’t answer.",
   "created_utc": 1692437317,
   "score": 2,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwrj99b",
   "message": "person in their will shit faster",
   "created_utc": 1692387666,
   "score": 1,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwssyyo",
   "message": "Could be a different person. How has being a short sighted dipshit impacted your view?",
   "created_utc": 1692406524,
   "score": 251,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwt6ld8",
   "message": "What",
   "created_utc": 1692412916,
   "score": 1,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwtcf17",
   "message": "Sometimes, you have to accept your fate and crap your pants.",
   "created_utc": 1692415932,
   "score": 1,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwtdx44",
   "message": "Use the doors labeled enter/exit to do the opposite.",
   "created_utc": 1692416760,
   "score": 1,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwtnonp",
   "message": "This is great! This an opportunity to try out the battering ram I picked up at the police auction.",
   "created_utc": 1692422683,
   "score": 1,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwtp7pc",
   "message": "I did it once at work cause I was tired and needed to finish cleaning the bathroom. Thankfully my coworker found it funny but still",
   "created_utc": 1692423731,
   "score": 1,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwtqdq7",
   "message": "I forget things mid-sentence and trail off...woah is that a squirrel?!",
   "created_utc": 1692424544,
   "score": 1,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwtskad",
   "message": "I need to know if it’s locked because someone is in there or because the business locked it to prevent folks from using it. If I can get you to respond or make any sort of noise, I’ll know what I’m dealing with.",
   "created_utc": 1692426090,
   "score": 1,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwtsruy",
   "message": "I was at a South Florida laundromat thar has one gender neutral restroom. So I'm using it \u0026amp; someone tries the handle. It's securely locked. Not believing a human could actually be inside, the person keeps trying. I said nothing, because I wanted to see how far this nut would go to get inside a locked bathroom. She didn't give up. She started shaking the door. Then violently, shaking twisting \u0026amp; kicking the door. She broke the handle off \u0026amp; got the door open. By that time I was finished. It was a middle aged no habla Ingles lady. So great, now the only bathroom in the laundromat has a broken handle \u0026amp; there's no way to close the door. Congratulations, you won!",
   "created_utc": 1692426242,
   "score": 1,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwtyucz",
   "message": "It’s all good and just a distraction so you don’t notice the recording devices.",
   "created_utc": 1692430913,
   "score": 1,
   "submission_id": "15uu4lg"
  },
  {
   "comment_id": "jwu1vws",
   "message": "They don't have much of a problem because they get plenty of support.",
   "created_utc": 1692433371,
   "score": 1,
   "submission_id": "15uu4lg"
  }
 ]
}