{
 "submission_id": "15uu3ft",
 "title": "What inspired you to pursue your current career?",
 "selftext": "",
 "created_utc": 1692387465,
 "permalink": "/r/AskReddit/comments/15uu3ft/what_inspired_you_to_pursue_your_current_career/",
 "score": 26,
 "url": "https://www.reddit.com/r/AskReddit/comments/15uu3ft/what_inspired_you_to_pursue_your_current_career/",
 "comments": [
  {
   "comment_id": "jwrisvv",
   "message": "Bills needed to be paid",
   "created_utc": 1692387496,
   "score": 20,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrl72v",
   "message": "Always liked math and physics then I got into fluid mechanics and one thing lead to another…\n\nThough, I was always lied to and told pure maths didn’t lead to much of a career so I did engineering instead",
   "created_utc": 1692388379,
   "score": 7,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrj5j9",
   "message": "Did not know what to choose so i chose an easy path",
   "created_utc": 1692387628,
   "score": 4,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrlbwp",
   "message": "Chef - My German grandma taught me how to cook, so it just came easy to me.",
   "created_utc": 1692388428,
   "score": 4,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrlgsu",
   "message": "Engineer - I’m a fucking nerd",
   "created_utc": 1692388479,
   "score": 4,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrndz8",
   "message": "A need for food and shelter.",
   "created_utc": 1692389197,
   "score": 3,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrngky",
   "message": "I was always good at anything involving computers, and while I wouldn't say I was *proficient* with writing code I was at least a little experienced. Found out my kid was on the way, so it was an easy career to jump into.\n\nCompletely ruined the hobby for me, though. I used to fuck around with mods and whatnot as a kid - but no mas. It's a struggle to get the motivation to develop *anything* off-hours, and I actually find it slightly irritating when friends \u0026amp; family ask me to help with their computer issues. I still do it, but I don't like it anymore.",
   "created_utc": 1692389225,
   "score": 3,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrt1cj",
   "message": "I thought I wanted to make it a career and now, I just want to be able to pay my bills, have a good work/life balance and be happy.\n\nWhen I first got hired (Department Manager) I thought I may try to work up to either Specialist (District Manager) or Store Manager.\n\nI left the company for a month to pursue another job, which was hell and I was able to get my old position and salary back. But in that time I realized I didn't *want* the extra responsibility OR stress that would come with those positions. There are plenty of Department Managers in the company I work for that have been there for years and I still get bonuses and yearly raises, regardless of what Management position I'm in (Yes, they'd be higher in a higher position)\n\nBut like I said, my happiness and work/life balance have become more important than advancing. I'm happy where I'm at so though I initially wanted to try to move up and make it my \"career\" I'm fine now",
   "created_utc": 1692391319,
   "score": 3,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrv376",
   "message": "I successfully achieved my goal of becoming a full-time industry artist. And that was what inspired me to pursue a completely different career path.\n\nSee, it took about two weeks before I lost all passion for the thing I loved doing my whole life. It was a really harsh, quite sad realization to make. Man, I thought I worked hard finding that art job before, but just thinking about spending another week in that place...I learned what a desperate job hunt *really* felt like.\n\nGot a job as a videogame QA tester. At first, my feeling was \"hey at least this is something different.\" And after a month or so, I didn't really hate it that much. I actually...kinda enjoyed it. Especially the people I worked with. They made coming to work great. Over time, I found that I was actually pretty good at the job. I didn't have to exert myself too hard to get good productive metrics to make the boss happy.\n\nAnd that's what inspired me to pursue a job in videogame QA management, and later internal productivity tools for software development. I was just, ya know...*good* at it. Had absolutely no idea the job would click like it did, but that's just kinda how it happened. Went to school for art, didn't like math, didn't feel a desire to learn coding during my education, and yet that career path made me realize I actually liked math. It made me realize I had an inherent knack for programming. Who knew? I went into a job I had zero previous ambition towards, zero intent to do for more than a few months, and kicked off a completely different life path from it.\n\nI still do art. Quite a bit, actually. But I do freelance art in my spare time; enough to pay the utilities and keep my skills sharp, but significantly reigned in so my passion can remain a passion.\n\nI guess if there's a lesson here. Have dreams, have ambitions, and work to make those dreams happen. But also keep an open mind, because dreams are still...well, *dreams.* Not reality. The reality of a dream job can really suck sometimes, so don't be afraid to try other things if the dream becomes a nightmare.",
   "created_utc": 1692392100,
   "score": 3,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwryuol",
   "message": "Pursue? No. Continue? Money. \n\nNever wanted to be an IT Business Analyst but that's just something I migrated towards about 10-ish years ago. I'm not terribly good at it (could be better) but it's something that helps me buy all my fancy toys and a place to live. \n\nI wanted to be a movie star (like everyone else). Sadly that dream has not come to fruition.",
   "created_utc": 1692393558,
   "score": 3,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrkxyt",
   "message": "I was reading a science magazine while taking a shit and it predicted biomedical engineers would be one of the highest demand degrees of the next 20 years. It's been pretty cool, ngl.",
   "created_utc": 1692388289,
   "score": 4,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrisfr",
   "message": "My neighbours\n\nThey decided my career when they felt bored",
   "created_utc": 1692387492,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrl0n4",
   "message": "They actually contacted me after I applied",
   "created_utc": 1692388315,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrl6j9",
   "message": "Manager of a restaurant: I considered a promotion to be a good thing. 18 years later, here I am, and oh no.",
   "created_utc": 1692388374,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrlwsu",
   "message": "Elementary/Primary School Teacher- because I get to make displays and have 6 week guaranteed holiday a year",
   "created_utc": 1692388645,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrm845",
   "message": "I worked as a CNA/med aide in an assisted living facility. I love it so much, I poured my heart and soul into that job and what ultimately drove me to pursue nursing. After working in the ER during Covid….. it’s not the same. I’m burned out.",
   "created_utc": 1692388762,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrmmwm",
   "message": "Paramedic- wanted to help people and have an exciting job. Didn't realize there is absolutely NO money in it. I make $15/hour working 24 hour shifts.",
   "created_utc": 1692388915,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwro42e",
   "message": "It all started with me wanting to not waste time when commuting to work, so I signed up for a part time masters degree course at the university. This lead to a hole chain of random events that lead me to my current career path, working towards a ph.d. in engineering",
   "created_utc": 1692389466,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwroouf",
   "message": "I like money and I work well under pressure. I've learned, however, that I don't work if I don't have BOTH so... Crisis management.",
   "created_utc": 1692389682,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrpe24",
   "message": "Covid killed my dream job. Needed work.",
   "created_utc": 1692389942,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrssth",
   "message": "Royalty. Doing fuck all. Collecting money from the state",
   "created_utc": 1692391228,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrte5i",
   "message": "Quite literally nothing. So a complete lack of agency.",
   "created_utc": 1692391456,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrtni9",
   "message": "Always wanted to write for visual media.\n\nStill do, but I hate my current 9-5 job even if I'm doing just that.",
   "created_utc": 1692391555,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrxyh5",
   "message": "As university's registration was getting closer I was still hesitating between physic, computer science or geography, so I went into a [geomatic program](https://en.m.wikipedia.org/wiki/Geomatics) that mixed some of each.",
   "created_utc": 1692393207,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jws00tl",
   "message": "Would you believe Chris-Chan, at least in part? I've been following him for a while now, and after he got arrested, I got interested in his case, and the legal process of his case. There were other things too, but that's a portion of the reason I decided to go back to school and become a paralegal.",
   "created_utc": 1692394017,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jws0bpq",
   "message": "My current career was down to my husband and his goals and dreams so I supported him in order to pursue it and now it's part of our current business.",
   "created_utc": 1692394138,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jws0cer",
   "message": "I was already a pilot, so picking up an aviation business degree and going into aviation management was just a logical answer unless I wanted to start from scratch.",
   "created_utc": 1692394145,
   "score": 2,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrklof",
   "message": "Harley-Davidson and KTM dirt bikes and #1 answer is…. Vagina",
   "created_utc": 1692388165,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrl56l",
   "message": "No Shit, the Apprentice, thanks Trump....",
   "created_utc": 1692388361,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrmzht",
   "message": "Back to the future 2. Specifically Doc fueling his car with garbage.",
   "created_utc": 1692389046,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrp37l",
   "message": "Money.",
   "created_utc": 1692389830,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrrivv",
   "message": "Failing at what I really wanted to do.",
   "created_utc": 1692390745,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrti46",
   "message": "The opportunity to claw my way out of answering phones.\n\n'This job would be great if it wasn't for the fucking customers.' Iykyk.",
   "created_utc": 1692391497,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrw479",
   "message": "I am retired, but my father was in ww2, and always going to the legion with him and talking with vets inspired me to make the military my career.  I was in 1984 until 2012.",
   "created_utc": 1692392493,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jwrwnd9",
   "message": "I was struggling to get a job and so asked my Dad to try to get me a position where he was working. Forty years later and I'm still there, a seasoned professional of unskilled labour.",
   "created_utc": 1692392698,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jws1ez9",
   "message": "Compulsion to express",
   "created_utc": 1692394573,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jws33op",
   "message": "Oh I called my supervisor the f word and made like a tree and fuckn quit",
   "created_utc": 1692395253,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jws3vx4",
   "message": "Money",
   "created_utc": 1692395568,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jws54wx",
   "message": "I stumbled across programming as a child in 1994 and it just sort of continued.",
   "created_utc": 1692396075,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jws6a4z",
   "message": "I involved heavily in competitive programming back in high school. That naturally led me to picking comouter science as my major in college and a career as a software engineer.",
   "created_utc": 1692396554,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jws6qcl",
   "message": "Single dad raising two kids.  OG\u0026amp;C pays but you live at the plant. \n\nIT lets me work from home.",
   "created_utc": 1692396742,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jws6tqc",
   "message": "Money",
   "created_utc": 1692396782,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jws77kb",
   "message": "I'm a musician as a hobbyist, but unfortunately I don't have the \"go-getter\" personality required for one to pursue music (or any other artistic field) full time.\n\nInstead, I have a mechanical engineering degree and I work doing MEP design stuff. I was drawn to this industry because I'm interested in optimizing room acoustics and noise control. Sometimes, every now and then, I get the opportunity to simulate ductwork noise, which is always really cool.\n\nAnd then I use that fat engineering salary to buy a bunch of equipment (I've bought a new keyboard, marimba, and a vibraphone in the past 1.5y).",
   "created_utc": 1692396946,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jws7bnf",
   "message": "I needed a job. I gained experience in an aspect of that job. Now that I had experience in that aspect I put it on a resume. With that aspect on my resume I became trapped into taking jobs relating to that aspect. Thus I am here in a field I have no interest or passion for, but now possess the experience and knowledge that is only valuable for a few job titles.",
   "created_utc": 1692396995,
   "score": 1,
   "submission_id": "15uu3ft"
  },
  {
   "comment_id": "jws7mqq",
   "message": "Dropped out of high school because I was tired of teachers treating me terribly.\n\nWent back, worked hard. Became a teacher who doesn't treat his students terribly.",
   "created_utc": 1692397129,
   "score": 1,
   "submission_id": "15uu3ft"
  }
 ]
}