{
 "submission_id": "15uuryh",
 "title": "How did it feel to live life without smart phones?",
 "selftext": "",
 "created_utc": 1692389103,
 "permalink": "/r/AskReddit/comments/15uuryh/how_did_it_feel_to_live_life_without_smart_phones/",
 "score": 148,
 "url": "https://www.reddit.com/r/AskReddit/comments/15uuryh/how_did_it_feel_to_live_life_without_smart_phones/",
 "comments": [
  {
   "comment_id": "jwrp32y",
   "message": "I'm 65 years old.  I feel very fortunate to have grown up without smart phones and social media apps. \n\nI think I felt much more freedom for not having instant access to everyone and everything. \n\n\nNot saying it's ALL bad. It's not.  I don't have to keep encyclopedias around anymore. \n😀  and emojis are fun.",
   "created_utc": 1692389829,
   "score": 5,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrtrem",
   "message": "Ignorance was bliss in hindsight",
   "created_utc": 1692391596,
   "score": 185,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrvqnf",
   "message": "I had an attention span back then...  \n\n\nNow? Not so much.   \n\n\nAnd not being inundated with a 24 hour cycle of an information stream is nice too.",
   "created_utc": 1692392349,
   "score": 173,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwro8is",
   "message": "It was peaceful.   \nif you were getting bullied in school, you had your total peace once you walked/drove home. And no way to let them bully you further.",
   "created_utc": 1692389511,
   "score": 213,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwro9vi",
   "message": "ALOT more bathroom graffiti if I recall correctly",
   "created_utc": 1692389526,
   "score": 14,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrz1h2",
   "message": "It was a fun time to be a kid",
   "created_utc": 1692393632,
   "score": 63,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrn925",
   "message": "It was wonderful.",
   "created_utc": 1692389147,
   "score": 58,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws4l0c",
   "message": "A lot less anxiety",
   "created_utc": 1692395850,
   "score": 52,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwruvfi",
   "message": "The ability to be unreachable was amazing. We didn't know what we had until it was gone.",
   "created_utc": 1692392017,
   "score": 232,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrnjn6",
   "message": "It was fine, since we had no idea what we were missing.",
   "created_utc": 1692389256,
   "score": 171,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwu7d8v",
   "message": "life without smartphones felt like a simpler time. We chatted on landlines, hung out more with undivided attention, and finding info required a bit of a treasure hunt. It was like a slower dance with the world around us.",
   "created_utc": 1692437747,
   "score": 34,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrw7h7",
   "message": "It was great, I didn't have a clue what was going on in the world, just what was in front of my face. Ignorance really is bliss.",
   "created_utc": 1692392529,
   "score": 34,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws3yek",
   "message": "There were so many more genuine experiences. If you wanted a new album or a video game, you’d have to go to the mall. Maybe you’d see a friend, maybe you’d meet someone, or you’d see something funny. It was an experience. It wasn’t a tap on a screen for instant results. \n\nIf you wanted information on something you’d go to the library or ask a teacher. \n\nIf you wanted to hang with the boys, you’d have to track them down somehow. \n\nIf you wanted to get somewhere new, you’re busting out the map. \n\nEverything was slower, more deliberate, and everything was so much better.",
   "created_utc": 1692395595,
   "score": 35,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrzamf",
   "message": "A lot more natural. A lot more of living in the moment.",
   "created_utc": 1692393731,
   "score": 27,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrpn3g",
   "message": "It felt good and the library was a familiar place",
   "created_utc": 1692390037,
   "score": 19,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrr7d6",
   "message": "It was different. We had to call home and see if the person we wanted to talk to was there. When we met someone we had many more things to talk about since we couldn't just text to say \"I just saw a pidgeon eating ice creal lol\" because text were expensive. If someone wasn't there at the time we said we would meet, you got 15 minutes MAX then we are going. When I went outside my mom didn't know I was ok until I came back home.",
   "created_utc": 1692390622,
   "score": 57,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrnvf3",
   "message": "It was fucking fantastic.   People didn't spend all their time arguing about global issues that are completely irrelevant to them.  The internet was enjoyable because the only people using it were people willing to sit at a computer instead of zoomer tweens.",
   "created_utc": 1692389377,
   "score": 129,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsdt7f",
   "message": "Honestly a lot more peaceful. I felt more connected to the real world and the moment. Now I just stare at a flashlight that tells me bad news 24/7 and wonder why I have anxiety 😒",
   "created_utc": 1692399780,
   "score": 16,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrtbpv",
   "message": "Parts of it were great. People didn’t run you off the road texting and driving, or watching porn as they speed down the road. Annoying relatives from 3 states away wouldn’t call bothering you with there crappy lives as long distance calls were expensive.",
   "created_utc": 1692391430,
   "score": 16,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrocl4",
   "message": "Both good and bad, people talked to each other more instead of head down staring at a screen, but no instant access to useful information no matter where you were",
   "created_utc": 1692389554,
   "score": 11,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws587g",
   "message": "When you look at old movies and TV shows ... That.\n\nSeinfeld is about what happens when people don't have smartphones.",
   "created_utc": 1692396113,
   "score": 27,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt0rvd",
   "message": "It was alright, news moved slower, people talked to each other more, people were generally more polite and less up their own asses.",
   "created_utc": 1692410105,
   "score": 10,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrvqth",
   "message": "It was awesome.  People actually talked to each other.  And friends somehow still managed to meet up at large gatherings.  Case in point: Summerfest in Milwaukee.  Whenever I went we picked a place, usually under the Miller Jazz Oasis, to meet at a certain time and it worked every time.  No texting back and forth trying to connect with someone.  I think half the population would have a nervous breakdown in smart phone suddenly disappeared.",
   "created_utc": 1692392351,
   "score": 21,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrwv3v",
   "message": "I loved it, but at the same time I love my smart phone. I just don’t think they are a good idea for anyone under 18, maybe even 21.",
   "created_utc": 1692392780,
   "score": 20,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrzmsv",
   "message": "Peaceful",
   "created_utc": 1692393864,
   "score": 10,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsc56i",
   "message": "People were present back then",
   "created_utc": 1692399054,
   "score": 9,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwtg0sn",
   "message": "Although I realize they are very convenient, I think I was happier before owning one.  You are more engaged and available to others in your life.  We are all becoming zombies just staring into our phones all the time.",
   "created_utc": 1692417957,
   "score": 9,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrpq78",
   "message": "It was a nightmare for me.  I have pretty severe ADHD that comes with some awful memory problems.  My smartphone is like an external brain that fits comfortably in my pocket.  It remembers all of the things that I need to remember and would forget without it.",
   "created_utc": 1692390069,
   "score": 22,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwro3a5",
   "message": "It was pretty nice, when I first got a phone I honestly didn’t even want the thing but I was forced to have it because all of the sudden everyone wants to make sure I’m safe when I’m doing whatever. Now I’m pretty used to having it but if I didn’t have it and you gave me a land line again it wouldn’t bother me any",
   "created_utc": 1692389459,
   "score": 8,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrwy0s",
   "message": "I suppose these things evolve into something less novel and more healthy over time, but what stood out to me was being in some public areas before/after smart phones.   The biggest difference being that people are *not* paying attention to their surroundings nearly as much.  I felt like an alien to be one of the few people looking around and not at a phone.  \n\n\nWith that said all of the advances that are coming along with smart phones appears to have a strangely isolating effect -- despite the fact we are more connected than ever.    That should change as it becomes easier and more the norm to leverage long distance communication to arrange in person events (which people do all the time now but still doesn't feel as normalized for me)",
   "created_utc": 1692392811,
   "score": 7,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt803k",
   "message": "It was extremely hard to get specific information on non-mainstream topics you were interested in. \n\nRecord stores were awesome now they have all but been taken away from us.\n\nWe used printed maps or relied on directions to get around.\n\nWe had to listen to radio shows when they were being broadcast live.\n\nIf you wanted an obscure book you had to trawl bookstores and hope you could find it or place a delivery order through one.",
   "created_utc": 1692413610,
   "score": 7,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt9dqm",
   "message": "They made us do math on paper. They told us you won’t always have a calculator.",
   "created_utc": 1692414319,
   "score": 7,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrnr6e",
   "message": "Less convenient, but had more in person social interaction.",
   "created_utc": 1692389334,
   "score": 12,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwru2cv",
   "message": "It was much better. I wasted so much less time. The phone is too much of a temptation for me.",
   "created_utc": 1692391712,
   "score": 12,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrwnqo",
   "message": "When I didn't want to talk to people, I could just unplug my phone from the wall. But by the same token, I used to dream of having a pocket computer that could tell me what the weather would be like, give me driving directions, and tell me if a store I wanted to go to was open that day and till how late.",
   "created_utc": 1692392702,
   "score": 7,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrz7fj",
   "message": "You had to have everyone's phone numbers memorized. Not unusual having 30 phone numbers memorized. change to use the pay phone. Had to walk, bike or drive to pay phone. Not everyone had a phone. Had to go to their house to see the if home or where they were. If long distance you couldn't call unless you had the money on you or expensive to call from home.",
   "created_utc": 1692393697,
   "score": 6,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws6fln",
   "message": "You made plans with friends and you kept plans with friends. There was no last minute cancellation.",
   "created_utc": 1692396617,
   "score": 7,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwszqsa",
   "message": "We used archaic instant messaging programs and websites to communicate with each other.\n\nWe used to send papers with notes if we wanted to \"chat\" during class.\n\nWe would have to wait and get home to Google something.\n\nIf someone had a camera it was a huge deal, it was surreal to be able to film or take pictures with high definition.\n\nWe would invite eachother to play videogames together, in the same living room. \n\nYou had fun playing snake and Tetris. \n\nWe used to pay for each individual message and sometimes we would run out of minutes to speak. \n\nWe had to write down instructions to get to somewhere because we didn't have maps in our ancient phones.\n\nYou used to pay for cool ringtones or funny audios.",
   "created_utc": 1692409626,
   "score": 6,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwtf7bx",
   "message": "I'm 47. I am very glad there were no smartphones and social media when I was growing up. One landline for the whole family. I actually would walk down the street and knock on my friend's door when I wanted to talk to him haha",
   "created_utc": 1692417488,
   "score": 6,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrnadf",
   "message": "First phone was a razor in high school. There was no instant drama because no one had social media in school. Now it’s instant…",
   "created_utc": 1692389161,
   "score": 17,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrnswv",
   "message": "better than it has been with 'em.",
   "created_utc": 1692389352,
   "score": 16,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrxre1",
   "message": "Amazing.",
   "created_utc": 1692393128,
   "score": 5,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrxrel",
   "message": "Fabulous!!!!",
   "created_utc": 1692393128,
   "score": 5,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsa3dq",
   "message": "More tv. More outdoors.",
   "created_utc": 1692398176,
   "score": 4,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsmqn2",
   "message": "Flip phone era was the best. People could reach you but it wasn’t relentless",
   "created_utc": 1692403722,
   "score": 5,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsnzn3",
   "message": "Freedom!",
   "created_utc": 1692404285,
   "score": 5,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsrf1u",
   "message": "Personally even at 35y/o now i preferred pre-smartphone era. \n\nDon't get me wrong smartphones are fine, but peoples tendencies to be glued to them is a bigger issue.",
   "created_utc": 1692405830,
   "score": 4,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt1w7f",
   "message": "It was better.  Ignorance is bliss and the less I knew bout other peoples dumb lives the happier I was with my own",
   "created_utc": 1692410638,
   "score": 5,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt2414",
   "message": "So much freedom. And having to prove you can take care of yourself. Still remember waking up Saturday and Sunday mornings and telling my parents I am off to play with friends. They would give me a few quarters if I needed to make a call just in case. And then coming back before dark. And that was what you did.",
   "created_utc": 1692410742,
   "score": 5,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt8kij",
   "message": "It was a peaceful life. Summers felt like they were something special. Winters felt cozy",
   "created_utc": 1692413900,
   "score": 6,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt9e44",
   "message": "If I showed up before dark, my mom thought something was wrong. I would be like, \"Hi mom, I need a drink.\" She would pour a big glass of sun tea, and off on my bike I would go. We did all kinds of shit that would get on video these days. Probably woulda went viral on quite a few, but thank God we didn't have social media. We just had friends and good times. We robbed a pizza guy once (stole pizza out of his car), then hid the pizza when he drove through the apartments looking for us. When we came back, the dog had eaten the pizza. I broke my leg playing football, and while we waited for the ambulance, nobody filmed it.",
   "created_utc": 1692414324,
   "score": 5,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt9hcz",
   "message": "Popcorn. \n\nMaps. \n\nBoom boxes. \n\nXerox copies. \n\nReading paper books/magazines/newspapers in the bathroom. \n\nAnswering machines.",
   "created_utc": 1692414370,
   "score": 4,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt9sui",
   "message": "Imagine not knowing where people are at any given moment",
   "created_utc": 1692414539,
   "score": 5,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt9w20",
   "message": "During my youth, me and my brother would play outside with the neighborhood kids until dinner was ready. When not outside, we would play with action figures and use the TV guide to see what's on television.",
   "created_utc": 1692414586,
   "score": 4,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrqsxs",
   "message": "It was called Freedom, no electronic leash on you.",
   "created_utc": 1692390469,
   "score": 9,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrnoku",
   "message": "Once I experienced it I can not live without it.",
   "created_utc": 1692389307,
   "score": 4,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt5e32",
   "message": "It felt normal, because it's what we knew.",
   "created_utc": 1692412327,
   "score": 5,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt7vq4",
   "message": "I honestly miss the days my friends would physically knock on my door to ask me to go outside and chill.\n\nI miss seeing my friends at my door...\n\nOr when they'd call my home phone, my mom would answer, and then pass it to me.\n\nNo more. 😮‍💨",
   "created_utc": 1692413549,
   "score": 4,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt86n2",
   "message": "Well obviously you didn't miss it, because you didn't know it. The thing, smart phones were.grest when they first came out. It's social media that has messed everything up.",
   "created_utc": 1692413703,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt89cx",
   "message": "Well, prank calls were a lot more fun before caller ID, that’s all I’m saying.\n\nAnd nobody had a phone in their pocket when my 16-year old self did something stupid.",
   "created_utc": 1692413741,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt8bwb",
   "message": "It was freedom. Less drama. More socialization and conversation in real life. People weren't worried about everything as they might now, and many people were better for it.\n\nBut I'd be more bored right now. 🤔",
   "created_utc": 1692413778,
   "score": 4,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt8mhn",
   "message": "Smart phones AND the internet. Our world was so much smaller. Really you lived locally, knew about what you read in the local newspaper or what you might watch on the national news in the evening. That was it.  You called people on a landline. And there was usually one phone near the kitchen with a cord that would stretch about 30 feet. It was unimaginable to us to spend hours a day looking at the stupidest shit from stupid people that had no effect on our lives. We lived OUR lives and didn't give a fuck about other people's life unless it was our family or close friends. And life was good.",
   "created_utc": 1692413928,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt8sgt",
   "message": "We used to think, jeez it's amazing what people will do for money. Now it's, jeez it's amazing what people will do for likes.",
   "created_utc": 1692414014,
   "score": 4,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt9thf",
   "message": "Got more rest. Wasn’t up scrolling or doing it in the morning.",
   "created_utc": 1692414549,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwtar2l",
   "message": "Imagine being able to go somewhere and not have everyone freak out if they didn't get a response from you instantly. Like you would just tell people I will be back at 5 and until 5 o'clock hit you were on a separate island from them.",
   "created_utc": 1692415042,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrq9l0",
   "message": "Before they existed it was just normal everyday life. If I had to go back now after having one for so long? No thank you. Lol",
   "created_utc": 1692390269,
   "score": 7,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrtezv",
   "message": "I quit smartphones a few years ago and I love it as it is very liberating.\n\nIf anyone wishes to quit smartphones then I definitely recommend it.",
   "created_utc": 1692391465,
   "score": 6,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrxd2y",
   "message": "It was neither better or worse. Just different. There was a lot less FOMO. Trends lasted longer. People consumed the same media giving a collective set of things to talk about, but people had less small communities to turn to. Overall, the changes aren’t as profound as people like to believe.",
   "created_utc": 1692392974,
   "score": 6,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsn445",
   "message": "Pain in the ass. I was the kid with a million questions that my parents couldn't answer. Getting answers meant going to the local library, which was tiny, or going to the county library, which was too far away to walk/bike (and there were no buses). And a library with a paper card catalog is only a useful as your reference skills.\n\nI also routinely wanted to know about music I had heard on the radio. To do this, you either had to wait for the announcer or write to the station for the playlist.\n\nBeing able to Google stuff, or search a website, or do an image search, or a \"what's that song search\" have made my life way better.",
   "created_utc": 1692403893,
   "score": 7,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwruvy2",
   "message": "Quality of life was so much better…",
   "created_utc": 1692392023,
   "score": 6,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrwjnf",
   "message": "I was able to be a stupid teen without worring that it would be all over in 10 minutes. I passed by my friends houses and hung out with them. Got lost a few times and found some amazing things.",
   "created_utc": 1692392659,
   "score": 5,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws00xu",
   "message": "I was a kid when mobile phones (not smartphones) were becoming a thing - everyone who had a phone used it all the time to text each other. When the phones spread to virtually everyone, everyone did that (in my age group). It was no different than smartphones of today, just a lot less convenient. Of course, there was no social media back then yet, but being engaged with your phone 24/7 was definitely a thing. \n\nAnd I disagree that a life without a smartphone was better. That's stupid. Of course it wasn't. Having a powerful personal computer on you with instant access to any person in the world, any information, any video is stuff not even science fiction back in the day envisioned. I remember dreaming about everyone having personal communicators attached to your arm like an oversized smartwatch - we have that now. Only better. \n\nWild.",
   "created_utc": 1692394018,
   "score": 7,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwryset",
   "message": "I’m 23 so I’ve never lived before cell phones but I never seriously got a phone until 17. I remember always being more creative before getting one. I’d always write ideas and draw fantasy maps in a notebook during school. When I did get one I was hooked sadly, though it didn’t kill my creativity, it killed my need for notebooks.",
   "created_utc": 1692393533,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws0ndl",
   "message": "It's just fine.\n\nI've never owned a smartphone.",
   "created_utc": 1692394265,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws4ewo",
   "message": "Turns out that having all the world's information at the tip of your fingers at any given moment doesnt mean people aren't still dumb as shit.",
   "created_utc": 1692395780,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws50p4",
   "message": "Amazing! I could get away with so much more stupid/ embarrassing/ stupid stuff and not have anyone who wasn’t there know about it. A simpler time where people minded their business and actually made plans and kept them. A lot less flakey. Less shit talking too! It used to be say that to my face now it’s just type a text or ghost \n\nI loved being unreachable! Now the electronic leash of connectivity is choking me to death!",
   "created_utc": 1692396028,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws5czv",
   "message": "Less distractions, you had to watch tv or do something for entertainment. Do your chores, do your job. You needed a watch, a mp3 and your cell, also a phone book/ planner to write in, a notepad, and a calculator if u went to work (it’s all in a phone now lol) Print Mapquest or a GPS you bought at Best Buy for where to go and hope it worked. \nPeople talked to each other locally about the recent movie or tv show. You had to hear the radio for music (call them to request a song! And you wouldn’t get off the car until the whole song finished. ) and you would record it on your recorder or buy the physical CD. (A whole CD for one track you liked.) you would write the lyrics down. The news had serious and then a funny segment or lifestyle cooking segment. I think it’s bleak or hyperactive, it seems desperate now. But maybe I’m just not used to their formula now. No YouTube, so we saw cinemas or rented or tv was our media.(there’s a lot of garbage that aired looking back.) Magazines or newspapers to kill time or see what was trendy. People would read 5 magazines in one sitting. You could copy what you saw on a tv star, or see what your classmates are wearing or coworkers what to wear or buy. They were your original influencers lol. Photo albums or share photos with a instant kodak camera. Or digital. You can text some people a pixelated pic. Friendships had to be in person, no FaceTime or group calls. No just liking their pics and texting. No online sharing or pics. No likes no subtweets no disses. All the beef and rumors was in person, or how someone acted towards you. They would have to harrass you in person, then spamming your socials or texts. Being a fan was really like a novel, you could never meet them. nowadays more celebs are more in contact with their fans. I feel like beauty standards got really high after Instagram. People back then had smaller lips, and less fillers. But maybe I’m tripping. It was really less stimulated and quiet and it’s better now, but that’s how life was back then. I think people did more dumb things because of lack of knowledge or boredom back then, now it’s still like that but I guess some things are inexcusable. we still are human after everything.",
   "created_utc": 1692396169,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws5gyc",
   "message": "It was cool to have friends. You’d all find things and share them and tell each other about stuff.\n\nYour friend got to a level in a game or saw a movie you hadn’t seen, everyone would gather and talk about it then you’d go home and try. It was the only way to see it you couldn’t watch a let’s play or a stream or YouTube. You’d hear rumors and stuff and get to track them down yourself and the world had secrets and spoilers that mattered. \n\nYou’d find some cool game and go around for weeks showing each other. \n\nYour friend would have a rare movie on hard copy and you’d go over and see it. \n\nThings like that brought people together. Now it’s “I saw ____” “oh me too”, or going out to lunch with your friends and they are on their phone and stuff.\n\nFor the past few years I’ve dropped out of all social media except (arguably) Reddit. I play board games with friends and refuse to play games online unless it’s the only way we can hang. It’s been nice.",
   "created_utc": 1692396215,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws9ca6",
   "message": "You’d arrange to meet your friend in town at 1pm and when they hadn’t arrived at 1.10pm you’d just go home.\n\nThen at 5pm they’d call to ask where you were and they arrived at 1.12pm.",
   "created_utc": 1692397854,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsawfy",
   "message": "Sometimes, finding your friends on a Friday or Saturday night was an adventure.",
   "created_utc": 1692398523,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsgfpo",
   "message": "If I said way easier but a little more difficult, would that make sense?",
   "created_utc": 1692400932,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt0p6b",
   "message": "Much better, I had to call my gf and say I love you",
   "created_utc": 1692410070,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt0w6w",
   "message": "I was 29 when they appeared. Thoughts were longer and clearer. If they ever went away, I could adjust back to that life, since I remember it.",
   "created_utc": 1692410160,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt33wi",
   "message": "There was a better sense of community and friendship from everyone. Do you guys remember printing out mapquest? Idk the world felt nicer then.",
   "created_utc": 1692411218,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt7kd0",
   "message": "I use to talk on the phone a lot at night.",
   "created_utc": 1692413392,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt7lzf",
   "message": "People didn’t really start abusing their phones til about 2017. Before that even tho smartphones were around nobody had their face in them all day. Most people vibed better and had more of a connection to each other because we depended on each other to have fun. Honestly life was so much better. Smartphones aren’t bad but the social media platforms on them fucked up the human experience a little bit. A lot of people’s entire personality is their phone smh",
   "created_utc": 1692413414,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt815u",
   "message": "The convinces of smart phones are nice at times  but I had a lot less anxiety without one. Like knowing people expect me to respond to them immediately if they text or call just sucks. My mom will ONLY video call and it kills my battery because every time it’s a multi-hour call until my battery dies. There is also some stress to the possibility of losing or damaging something that cost the same as a laptop and it’s something I carry with me everywhere. At times I really miss the landline I had as a kid or my old flip phone. In short the responsibility of having a smart phone brings more stress and anxiety than most people realize and I miss not having that a lot of times.",
   "created_utc": 1692413625,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt9cmr",
   "message": "I felt exposed and in more dangerous situations that I do now. Kids didn't start getting Nokia cells until my senior year of high school. Having 911 at my fingertips could have changed the events of my life. \n\nI am so happy that today most people have a device that can not only calculate tips, but possibly save a life.",
   "created_utc": 1692414303,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt9cxz",
   "message": "I could focus on stuff better, was bored more often, actually did things. \n\nI'm 29, was a teen during real smartphones coming out. First real smart phone was a no name tough phone. Though I'd count the ipod touch, \n\nNokia 3310 as a kid, various gimmicky flip phones/sliding ones, razor, 1/2 touch screen pressure sensitive phone with shitty internet and shitty games, bad ui, tough phone, s3, S6, s9, s10+, s21 ultra.",
   "created_utc": 1692414307,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt9sx4",
   "message": "Felt less insecure emotionally, physically and financially.",
   "created_utc": 1692414540,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwtdeiq",
   "message": "Much more in the moment.",
   "created_utc": 1692416471,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwtewek",
   "message": "Honestly it was nice (in hindsight) media sources were in a few places like Tv and eventually I got a modem and then there was the lighter version of the internet with bbs’ and stuff like that. Things just moved slower than they do now.",
   "created_utc": 1692417316,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwtf5ab",
   "message": "Driving in an unfamiliar city was more stressful without GPS and things like Google Maps to help you navigate.  All you had were hand-written notes and a paper map to get you where you were going before we had this tech.",
   "created_utc": 1692417455,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwtf90v",
   "message": "I'm 29 and when smartphones started being a thingI was on uni.\n\nEven with previous phones, things were a lot more analog. You are away from home and have shit to do for half an hour? Unless the place has some magazines to browse or people to talk, hope you like looking at nothing and having conversations with yourself.\n\nMental health was waaaaaaaaaay better.",
   "created_utc": 1692417515,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrw9u2",
   "message": "You can live a life without smartphones now. I do.",
   "created_utc": 1692392553,
   "score": 3,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrxs4j",
   "message": "Boring. If you needed the answer to anything, it wouldn’t get answered until you found someone that knew.",
   "created_utc": 1692393136,
   "score": 4,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrzdhp",
   "message": "I live my life no different. My smartphone is still just a phone to me. I don't whip it out and browse whatever when I have a minute to pass, I still enjoy just taking a seat and letting moments pass by in quiet meditation.\n\nBut as for everyone else, it's a myriad of emotions. I feel anger and frustration at people who absolutely insist to be looking at phone screens while driving (completely oblivious or ambivalent to how much they're weaving between lanes). I feel sad for people experiencing every event vicariously through their camera app, instead of just putting the damn screen down and watching a concert with their naked eyes. I feel frustrated seeing groups of friends sitting at a table, each one growing up literally unable to have a conversation, because every social outing is spent just looking at their phones and swapping memes over Discord.\n\nI feel worst for small children, who have been victimized by social media algorithms to become addicted to streaming media. I'm too damn young to be sounding this damn old. But, *sigh*, BACK IN MY DAY. We had commercials. We had something that literally broke up the viewing experience, severed our immersion from TV. Not for an annoying skippable 5-seconds, but for 3-4 minutes, twice or thrice every episode. And every TV network synchronized their commercial breaks, so you couldn't just change the channel, you had to sit down and watch Sally Struthers list every damn associate degree program at International Correspondence School. \n\n\"Do you want to make more money? Of course! We all do!\"\n\nSure I'm a victim of media as well, in that I can still recite the entire advertising script to some obscure diploma mill that aired in 1993. But these commercials were an opportunity for parents to intervene and tell us to get off the TV. What, were we going to put up a fight so we could sing along to the \"Crossfire!\" commercial?\n\nBut seeing small children on phones, watching never-ending streams of uninterrupted content, with zero breaks in between...it's so hard getting them to put the screen down. I remember throwing a tantrum every now and then when told to turn off the TV because Captain Planet had just ended, and actual GOOD cartoons were about to start. But seeing this battle twice a day? And parents saying \"okay one more episode\" to kids using a platform where \"episodes\" don't exist?\n\nYeah, I know, preaching to the choir here. Everyone knows how much this is messing kids up. We don't need ANOTHER myriad of studies stating the obvious. But as much as I hear people proposing the...well, admittedly simple and logical solution of not giving kids access to a phone as an entertainment device, I beg to differ.\n\nBring back commercials. That's it. You want streaming media for kids, don't do the whole \"commercials are bad for kids, kids content should be commercial free\" mindset. Yeah, sounds great on paper ten years ago, but look what we have now. Uninterrupted unending content. \"Unending\" is not a good thing for kids. Kids need an \"end\" to something to put it down, lest ye unleash their wrath. It doesn't need to be the commercials I grew up with, Lord knows it was probably a bad idea [encouraging eight year olds to see Robocop.](https://www.youtube.com/watch?v=Bb_voFQioow) But stuff like on PBS, little mini-cutaways about animals, or space, or reminders to go outside and play. Anything. Just something that tells kids it's okay to put the phone down, take a break, no reason to scream and cry about returning to reality.",
   "created_utc": 1692393762,
   "score": 4,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwry5rd",
   "message": "As someone who lived more than half his life prior to the mass public accessibility to smartphones, it didn't matter you didn't have something you can't comprehend to be possible to exist (kind of like we don't really care we don't have mass public accessibility to flying cars right now despite being a dream since the 1950s). However now it would be hard to part from my smartphone.",
   "created_utc": 1692393286,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwrzyla",
   "message": "How do you think it was before electricity? People did just fine.  \n\nHow do you think it was before automobiles? People did just fine.  \n\nHow do you think it was before television? People did just fine.  \n\nHow do you think it was before the Internet? People did just fine.  \n\nHow was it before smart phones? People did just fine.  \n\nAnd as with every advancement in technology, it gets adapted into every aspect of life, and people who don't like change bitch and moan about it",
   "created_utc": 1692393992,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws06wx",
   "message": "Honestly everything was different.  Things have been moving at record speed since the industrial revolution and the internet just threw that into an even higher gear.",
   "created_utc": 1692394085,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws0tf0",
   "message": "Well, let me see:\n- You had to know where you were going and map out your trip ahead of time. Or you had to rely on your memory of roads and landmarks. There was no Maps app to help guide you, so you had to be purposeful and pick a good route.\n\n- If you didn’t know something, you didn’t know it or you relied on friends. You couldn’t just look up whatever you were talking about, and oddly enough it was a lot harder to find someone purposefully trying to mislead you with some crazy story or “fact.” People still got stuff wrong, but it was a bit more innocent.\n\n- By that same token, if you wanted to know something, you had to talk to stranger and ask. I used to be a small town reporter and I thought about how easy a smartphone made my job sometimes, but nothing beats asking someone who knows instead of Googling it. You had to know how to trust the right people.\n\n- You did……I have no idea in the bathroom. Honestly I can’t remember. I guess you were just bored 🤣\n\n- If you got a phone alert, you knew it was important because it was a friend or family member contacting you. Notifications weren’t a thing. \n\nThat’s all I can remember off the top of my head.",
   "created_utc": 1692394333,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws1f50",
   "message": "Same as it feels now without the tech we we can't live without in 30 years time.",
   "created_utc": 1692394575,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws1uey",
   "message": "Normal, to be fair. Back then it was normal.",
   "created_utc": 1692394743,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws28qx",
   "message": "It was better. The joy of being able to log off the internet was better. Now I almost feel obligated to log onto Instagram and reddit when I'm just sitting around bored. Back then you'd either call a friend or go somewhere. Having an endless amount of info and entertainment at your fingertips is cool but nowadays that's all we do. Suck up info and entertainment from our phones. It's AWESOME for instant gratification but when I look back at the last week, I didn't do anything.... no bike rides with friends, no basketball in the driveway, no fishing, no playing catch, no hanging out on the porch either a couple beers. We used to do that stuff one day after the next. Now we're content with watching Netflix and scrolling through reels.",
   "created_utc": 1692394903,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws2fll",
   "message": "It was to be truly free. No one knew where you were unless you told them in advance. No one could reach you, unless near a phone and they knew where you were (e.g. home).  Sure, access to the internet is phenomenal, along with carrying a pocket-sized super computer. But somehow these devices have made societal changes where we’re now expected to be available 24/7. People get so upset when you don’t immediately respond to their non-urgent inquiry.  The era of instant gratification.",
   "created_utc": 1692394981,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws5xjv",
   "message": "I brought my game boy along a lot or those small novels you can fit in your back pocket.",
   "created_utc": 1692396410,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws7ibx",
   "message": "Similar to how it feels to live without time travel.",
   "created_utc": 1692397076,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws7nps",
   "message": "I remember being early teens, My friends and I had tree huts and secret hideouts that we would meet each other at and bring snacks to share. No screens and no instant dopamine hits from tiktok so everything just felt.. slower back then. \n\nThere was computer games but they only got used on rainy days. Water gun fights, backyard cricket, dbz on the trampoline. We just used our body much more and screen time was watching cartoons after school for an hour or sitting through the news at dinner time.\n\nThere was less information at your finger tips but also less misinformation so people had to engage and use logic with one another. These days it's a \"Be correct even if you are wrong\" thing online and more reacting rather than thinking and digesting what you are seeing.\n\nIt was simple. I believe life would be more content and healthier for many of us back then compared to today. We are social creatures but we like to seek, hunt, gather and play and it should be somewhat challenging. Smart phones make this less challenging and therefore less rewarding.",
   "created_utc": 1692397141,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws7r31",
   "message": "Try it yourself. Go for a trip over the weekend, leave your phone at home if you're not expecting important calls. That's what it was like in the 90s early 2000s. We didn't get modern smartphones until 2006-09, I miss my BlackBerry Pearl. But you either just go or you wrote it out on paper with printouts from MapQuest lol. The point is you use the time to really see what's around you and take that in.",
   "created_utc": 1692397181,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws7sxf",
   "message": "At the time of course the 80s and 90s felt super high tech, fast paced, 24\\\\7 information, etc etc.... it all seems so quaint now",
   "created_utc": 1692397203,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jws7u8y",
   "message": "I’m going to say mobile phones made life much much easier. No more waiting at home by the phone for an important call. Yards yadda. Smart phones changed our lives. And not always for the better.",
   "created_utc": 1692397218,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsad3z",
   "message": "I did a lot of reading. Playing outside.",
   "created_utc": 1692398291,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsar48",
   "message": "Peace at its peak",
   "created_utc": 1692398458,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsavdu",
   "message": "Creative and social",
   "created_utc": 1692398510,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsc4t6",
   "message": "It felt pretty good.\nThere was less pressure in high school. I can just imagine mean girls posting pics of themselves and leaving out one girl to be mean. Look at what an amazing time we had and we didn’t invite you!\n\nSo glad smart phones weren’t a thing until university.",
   "created_utc": 1692399050,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsco9v",
   "message": "I think most people were actually more social before smart phones (and social media). We couldn’t just scroll on our phones, so we interacted with each other much more. And kids played outside instead of playing on their phones. Parents talked to their children more, and vice versa. It was nice.",
   "created_utc": 1692399280,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsdgf9",
   "message": "Times were different. There were pay phones everywhere. There were call boxes every mile or so on the freeway. I had all the important numbers memorized, including the local pizza place. You could dial 411 and get any number you didn’t already have. Without navigation in my car it was way more of a pain in the ass going someplace new and unfamiliar, but other than that it was fine. Especially after pagers came out. A pager and roll of quarters and I could probably get by as well as I do now",
   "created_utc": 1692399624,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsewgq",
   "message": "A LOT less ADHD like.\n\nYou could just do something and not need to view your phone constantly.\n\nYou'd sit as a bus station and just look around... for several minutes!",
   "created_utc": 1692400261,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsewny",
   "message": "When you stepped out of the house with your friends….you were free.  You were all free.  Til check in",
   "created_utc": 1692400264,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsf3eh",
   "message": "Less lonely. You had to actually talk to people and hang out with people. There wasn't this constant distraction sitting in your pocket that distracted you from living your life. You didn't have a barrage of people on social media living their perfect lives to compare yourself to. That one small mistake you made in school was forgotten about in a week rather than immortalized on the internet. Workplaces had far less expectation for you to be constantly available.\n\nAs much good as smartphones bring, the balance we have them is absolutely fucked.",
   "created_utc": 1692400346,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsfq2w",
   "message": "There's two different ways of looking at it. The good way and the bad way.",
   "created_utc": 1692400621,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsg8fd",
   "message": "Strangers were much more able to hold a conversation. People were more down to earth. Most of them at least. Having a nice dinner without the other(s) having to take a series of fucking pictures first.\n\nWithout Mobile Phones at all people also were more scheduled. You said you will be there at that time, you had to be there at the time. No synching via phone. But you could do that with your good old Nokia 3310. So not really a Smartphone thing that one.",
   "created_utc": 1692400845,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsg95h",
   "message": "social media and smartphones probably helped increased the suicide rates and also cause more depression.\n\nsome people envy or get depressed looking at others' feeds.\n\nmore bullying is prominent because of social media\n\nback in the day we just played outside with our pogs, pokemons, bikes, baseball, football, basketball, mortal kombat, street fighter, WWF ETC",
   "created_utc": 1692400854,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsgzyk",
   "message": "Quiet. I'm making an effort lately to leave my phone behind. Being so reachable has made my life hell.",
   "created_utc": 1692401174,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwshuzu",
   "message": "It was simple, you went out with a plan in the morning and if no one had coordinated with you then you did whatever. Always seem to have someone calling or texting these days and sometimes it would be nice to get away from it. I understand I can simply go airplane mode or ignore it but not having smart phones gave me an excuse to be unavailable. The friends I had back then where much closer since we would usually spend the day together uninterrupted.",
   "created_utc": 1692401552,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwsqlwq",
   "message": "People took way shorter poops",
   "created_utc": 1692405463,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt03el",
   "message": "Fucking great",
   "created_utc": 1692409787,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt52dt",
   "message": "31 here. There A lot more calls. Very little text…for information like movie theater times, you hit Zero and the operator would transfer you to said theater…For web information, like weather for tomorrow, you would text CHACHA  and they would text you back with the weather details. It was not a hindrance at all. I miss it\n\nAnd for people over 30, the phone would never go inside the pocket. You had to have in a holster on your belt and show it off like a Revolver. So people knew you were packing…A mobile Phone",
   "created_utc": 1692412167,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt53kt",
   "message": "I’m in my 30s, so I was the last real generation to experience high school without smart phones, I graduated just before iPhones really became ubiquitous. \n\nIt was fun, very analog, even for the late 2000’s, and I feel like all of my friends were very present when we hung out, unlike some teen groups I see today just glued to their phones.\n\nThings felt more organic and spontaneous. Word of mouth was all we had to know if a restaurant was worth trying or a spot worth checking out.",
   "created_utc": 1692412183,
   "score": 2,
   "submission_id": "15uuryh"
  },
  {
   "comment_id": "jwt5y5m",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15uuryh"
  }
 ]
}