{
 "submission_id": "15uxftv",
 "title": "What was your worst experience at a doctor's office?",
 "selftext": "",
 "created_utc": 1692395333,
 "permalink": "/r/AskReddit/comments/15uxftv/what_was_your_worst_experience_at_a_doctors_office/",
 "score": 213,
 "url": "https://www.reddit.com/r/AskReddit/comments/15uxftv/what_was_your_worst_experience_at_a_doctors_office/",
 "comments": [
  {
   "comment_id": "jwsdbau",
   "message": "Was 17, had an infected ingrown toe nail. My pediatrician tried cutting and digging it out with what looked like pliers and bracing his leg against the table. After fucking around for a bit he realized he wasn’t going to get it. No numbing gel or anything. Hurt like a mofo. Scheduled an appointment with a podiatrist, he numbed it, had it removed in about two minutes and told me to never see that dr. Again.",
   "created_utc": 1692399561,
   "score": 73,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsg8up",
   "message": "**Friday Morning**\n\nMe: My stomach is really hurting, I can't stand up straight it hurts so bad, I feel like I'm going to puke and/or shit my pants and the pants of everyone in a 4 yard radius.\n\nfour hours later\n\nDr: here's a prescription for ibuprofen, take some pepto. peace out.\n\n**Sunday Morning**\n\nMe: My stomach is still hurting really bad, I haven't slept at all since Thursday, I haven't eaten at all, yet I still feel like I'm going to be spraying from both ends.\n\ntwo hours later\n\nDr: cool lets get an scan done.\n\nan hour later\n\nDr: yeah, looks like your appendix is about to burst, you will need surgery immediately\n\n2 hours later:\n\nDr: the surgeon will be coming in an a few hours\n\n3 hours later:\n\nDr: yeah, the surgeon will be coming in Tomorrow afternoon\n\n1 hour later\n\nMe: I just left this other hospital because my appendix is about to burst and they can't help until tomorrow\n\n45 minutes later\n\nBetter Dr: ok, we got your scan results let cut you open\n\n2 hours, 1 surgery  and $84,000 dollars later\n\nnurse: your insurance will cover most of this but for some reason even though our hospital is covered your anesthesiologist isn't so another $3,000 will need to come out of pocket.\n\n6 months, dozens of phone calls, hours and hours on hold, and calling one insurance agent a cunt later\n\ninsurance: turns out you were covered, we just filed the claim wrong.",
   "created_utc": 1692400850,
   "score": 44,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsaga2",
   "message": "The ENT doctor removed a skin cancer from my nose, leaving an ugly scar. Turns out he excised the wrong area and I went to a different doctor to actually remove the cancer.",
   "created_utc": 1692398328,
   "score": 127,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jws7e1n",
   "message": "I thought I had a broken nose. The doc was showing me, on a heavy glass x-ray plate, that my nose was not broken. But as I was looking up, he dropped the plate on my nose and broke it.",
   "created_utc": 1692397024,
   "score": 233,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsakxo",
   "message": "Laid on my side with my back to the door for a prostate exam. Heard people walk by talking while a finger was in my butt and realized the door was open.",
   "created_utc": 1692398384,
   "score": 246,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsd2ha",
   "message": "When I got the news I had stage 4 cancer 🫠 after being told by a Dr. That I was “too young for cancer” (I’m 29)",
   "created_utc": 1692399454,
   "score": 63,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jws95nn",
   "message": "I was getting a bone density scan for some odd reason, and the doc came in a while later and told me I had Osteoporosis. This was not why I was there in the first place and was completely surprised. I asked him if I could see the chart, and it was for a 70 year old woman. I was a 30 something man, and he had the wrong chart! Turns out I did not have any issues at all, well, bone density related…",
   "created_utc": 1692397776,
   "score": 215,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwseujh",
   "message": "I went to a clinic to see a doctor about a fever and body aches and informed him I was allergic to NSAIDs.. he said he'd give me something and it was not an NSAID\n\nWent home, swallowed the pill, immediate allergic reaction starts.. rushed to the A\u0026amp;E of a hospital where they pumped me full of drugs to stop the allergic reaction.. and the doc there asked me why I took the NSAID\n\nI think the A\u0026amp;E doc reported the clinic doctor because he was never seen again",
   "created_utc": 1692400237,
   "score": 144,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwslrod",
   "message": "It took me 13 years to find out my gall bladder was dead. I went to my doctor repeatedly, then another, then another. Seven different doctors. I had excruciating pain that never moved, always flared when I ate. It would last for hours. If I felt the pain coming on, it would stick around for about 6-9 hours before it abated. Solid 10 on the pain scale. If I ate anything other than toast the next day, it would come back. Impossible to sit, stand, move, lie down, exist. \n\nWent to the ER a few times. They’d give me ultrasound after ultrasound—and because they saw NO GALL STONES they always wrote it off.\n\n\nYou’re probably constipated.\n\nYou’re just overweight. \n\n\nAfter begging for a referral to another specialist, they gave me a full body MRI and several hours of testing (a HIDA scan—this was the test that caught it!) to watch the minute-by-minute function of my organs. Turns out my gallbladder had 93% non-function. Just a mostly dead organ. They had me scheduled for surgery the next week. I had it out and it was life changing. \n\n\nIt was only AFTER having it out that I realized how fucking common the surgery is, and how any doctor who’d given me even vague consideration might have realized a gall bladder can malfunction WITHOUT stones. \n\n\nI did not know how to advocate for myself because I kept being dismissed. I wish I’d been more assertive, because I suffered A LOT.\n\n(EDITED to include info that the HIDA scan was what ultimately caught it.)",
   "created_utc": 1692403286,
   "score": 69,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jws8twg",
   "message": "If an emergency room counts:\n\nWalked in with chest pains and severe pain area around left shoulder blade. Here, fill this out. Wait over here. Walk back here. Go back to waiting room. Walk back here again. \n\nDoctor walks up, first time I saw him, hands me discharge papers. “Follow up with your doctor in a few days.”\n\nWife drove me 40 miles to another hospital. They freak. Rush me to the cath lab. In the Nick of Time. \n\nHad 200% blockage of coronary LAD. Also known as the widow maker heart attack.",
   "created_utc": 1692397635,
   "score": 56,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jws6fxu",
   "message": "I have two:\n\n1. I was taken back to an examination room and got really thirsty, while waiting for the dermatologist. I went to the front to ask for water. On my way back I walked into the wrong room and saw the doctor and another patient. He was holding the guy’s dick. I said “I am SO SORRY” and the guy mumbled “it’s ok” as I raced off. I still feel awful. I mentioned, to my bf, that I didn’t realize dermatologists inspect dicks and he was like **“contrary to popular belief, scientists have found that dicks are in fact covered in skin.”**\n\n2. According to my mom, some friend of a friend went to the gyno and gave a urine sample only to find there was no tp; so she pulled a tissue out of her purse and used that instead. When she got on the table for her checkup the doctor peeled a US priority stamp from her labia and gave her a curious look. It had come from her purse.",
   "created_utc": 1692396621,
   "score": 61,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwscv1i",
   "message": "My family practitioner referred me to the therapist connected to their office. Before our session, I made sure to ask about patient confidentiality. The therapist assured me that it was all private, locked behind a different level of access, so only she would be able to see this part of my records. I was struggling a lot with my mental health at the time and really needed the help, so I was brutally honest about what I was going through during the session.\n\nAt my next appointment with my FP, the nurse doing my pre-assessment started going down the list of all the very private things I had told the therapist, asking me for updates for the record. There was no extra layer of privacy, the therapist had simply entered it into my patient notes that the entire office staff could see.\n\nI ended up walking out. Never went back to that office.",
   "created_utc": 1692399362,
   "score": 141,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsil9b",
   "message": "I had a whole list of symptoms pointing to type 1 diabetes, I was sent for a blood test, the results showed I was diabetic, and then my doctor didn’t refer me for treatment, I was left untreated for an extra 10 days before action was taken - which absolutely could have killed me, I was given the option to sue after everything was eventually sorted",
   "created_utc": 1692401869,
   "score": 37,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwseeor",
   "message": "At a hospital. \n\nA little context. I am white. My wife is African-American. \n\nWe were checking in for the birth of our child. It was after normal business hours so we were checking in through the emergency room. A woman (white) was there in front of us. She had a bad accident and cut off a toe. Me and my wife were waiting patiently next to each other because the woman was definitely the priority. They check her in and we walk up to check-in. They ask my wife some questions and take her back for vitals before we are to go to maternity. \n\nA few minutes later a nurse indicates that they are done and I can join my wife. I start to walk to her when a security guard (late fifties white male) stops me and yells at me. He puts his hand on his firearm. He then insists I join my wife. I step forward towards my wife and he grabs the handle again and orders me into a room. I step into it where I see the woman with her toe cut off. He steps in and continues to yell at me (and the woman) for not listening to him. He berated her for having an 'idiot' for a husband. It took another security guard and a nurse to stop his shouting and tell him my wife was the African-American woman.\n\nHe didn't finish his shift before he was terminated but it didn't make the experience any less bad.",
   "created_utc": 1692400043,
   "score": 143,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwslloa",
   "message": "Not me, but a close friend:\n\nShe was having debilitating migraines, to the point she couldn’t work or function. She waited nearly a month to see a neurologist. Upon a brief examination, he said:\n\n“You don’t have anything wrong with you. Just exercise and try not having headaches.”\n\nThree months later, he finally relented and did an MRI. She had massive lesions on her brain. She was diagnosed with MS. The smug bastard was somehow irritated she had a positive diagnosis. Her health wasn’t as important as his ego.",
   "created_utc": 1692403213,
   "score": 102,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsb5og",
   "message": "I had a brown recluse bite under my nose, and it began to open up. I went to the urgent care, the doctor told me to lay down and prepare myself. Now, I work in healthcare so I already knew this wouldn’t feel good because he told me he was going to scrape out what was going on, pack it and send me on my way. He comes in, doesn’t give me any warning and shoves a needle in my face with lidocaine, doesn’t wait for it to localize, and began to scrape out the wound. I gave birth NATURALLY and would rather do that again than have to go through that horror ever again. I was in shock, just uncontrollably shaking after from the pain.",
   "created_utc": 1692398633,
   "score": 163,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsj0mz",
   "message": "Went to the dermatologist to have a mole on my back removed and biopsied.  I was laying on my stomach and the dr was on one side of me and his assistant on the other.  They're talking like they haven't caught up in months and I feel like an afterthought and am getting annoyed.  Is this my time or theirs?\n\nThen I feel this searing pain immediately followed by a warm liquid falling down my side and I hear the doctor say, \"Oops.\"  You never want to hear a doctor say oops.  I was fully pissed at this point and said, \"Would you mind paying attention to what you're doing when you have a scalpel in your hand?\"\n\nI ended up needing like 5 stitches and I have an inch long scar there now.\n\nWhen I went back into the changing room they initially put me in to get dressed, I was basically topless when I noticed a window washer hanging outside the window just looking in.\n\nPissed turned into outraged and after I got dressed, went out in the waiting room and unloaded on the staff in front of a room full of people waiting to be seen, leaving nothing out.\n\nI hope at least a few of them decided to cancel their appointments.  I never went back, that's for sure.",
   "created_utc": 1692402059,
   "score": 83,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsh2zk",
   "message": "I had pinched my syatic nerve pushing carts at work. He accused me of having very kinky sex while my gf was in the room. I told him it was at work, and he assured me he would not judge me if it was from sex. He then gave me OxyContin and told me when ever I needed a refill I should call him and he’d make sure I had plenty. Very weird.\n\nThe other is super mild but he kept farting. Like the whole time he’d fart every few minutes.",
   "created_utc": 1692401210,
   "score": 167,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsmx9z",
   "message": "I told my pediatrician at 15 I was having chest spasms and anxiety and wanted to see a therapist. My mom was in room. He told me stop googling things I’m fine and teenagers don’t have anxiety because there’s nothing to worry about. I never went back to him ever and didn’t see another doctor until I turned 19 to be committed in a psych ward. Turns out anxiety was real and interving at 15 possibly could have prevented many many things from happening. 🙃🙃",
   "created_utc": 1692403807,
   "score": 27,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsaz4x",
   "message": "I was in my early 20's and very naive. I began having gyn problems and started seeing a gynecologist at the county hospital. I knew his exams were weird and I hated them because he would be doing things that didn't seem necessary. One day I was in the exam room waiting to see him when I heard the lady in the next room yelling at him to \"stop rubbing my clit you fucking pervert!\" This was back in 1984, Dr.'s examined you without a nurse in the room. I ran out and never went back.",
   "created_utc": 1692398555,
   "score": 240,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsf39w",
   "message": "Was sent to a rhumetologist for test and medicine for lupus. The doctor told me they had medicine to help but she wasn’t going to give it to me because I was in the “prime birthing age range”",
   "created_utc": 1692400344,
   "score": 122,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwskg4v",
   "message": "Went to dr for 9 am appointment.  11 rolls around still waiting.  Pharmacy reps come in with pizza.  Now it’s noon. I go up to tell them I have to leave. Receptionist wants to charge me $25.  Said dr was very busy that morning.  I said “Not too busy to have pizza with pharmacy reps”. Everyone else waiting collectively gasped. \nI did not get billed. And I never went back.",
   "created_utc": 1692402696,
   "score": 127,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsbsjt",
   "message": "Months after a breast lump removal my breast was still numb. I had the surgeon recheck it for the reason why. He said he didn’t cut any nerves, flicked my nipple and said “You’re fine.”",
   "created_utc": 1692398905,
   "score": 92,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsc1rp",
   "message": "Probably the 4th time they told me I had Cancer. Sorry to be a bummer, but that's my answer.",
   "created_utc": 1692399014,
   "score": 17,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsl38p",
   "message": "My new doctor looked up my pharmacy report before my visit, as is custom. I lived with my terminally Ill brother, whose name was James and mine Jamie, so we had the same address phone number and initials and similar names. When they ran my pharmacy report as they normally do, my brother’s many medications showed up on my list. The doctor yelled at me, called me a drug seeker and kicked me out of the office while I cried and pleaded with him to listen to me and that those medications were my brothers and not mine. He said that is not possible and that couldn’t happen. I ended up calling the board of pharmacy, who informed me that yes, closely named relatives who live together could show up on the same report, and the name doesn’t show but a patient number does, and if the doctor looks closely he will see 2 different numbers. The board member called the doctor and said he had to search by my SS# to get a more thorough search. Upon doing this, he realized his mistake and profusely apologized and my visit was free. He had no idea that 2 people could show up on the same report if they have similar details, and now he tells this story at all his conferences so other doctors don’t make the same mistake. Most of them had no idea that could happen either! Well, they do now!",
   "created_utc": 1692402983,
   "score": 121,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsk6a7",
   "message": "Dealing with my daughter’s illness and having doctors downplay it, ignore her pain and tell me it was all in her head. Until she died from her “imaginary” illness. I find it very difficult to deal with doctors anymore after witnessing the widespread incompetence and shitty behavior.",
   "created_utc": 1692402575,
   "score": 78,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsqcau",
   "message": "Woke up in the ER tied to a bed screaming my husbands name. I had no memory of how I got there or why. Kidney infection went septic. I didn’t even know I had a kidney infection.\n\nI seriously almost died.",
   "created_utc": 1692405342,
   "score": 149,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsisau",
   "message": "I had a non-emergency emergency out of network (it was later found out that I have PCOS and one of the cysts had popped, 10/10 do not recommend) so I managed to get back into my health insurance network area and a doctor's office was closer than an ER.\n\nWent to said doctor and he was convinced that I was either faking it for attention or faking it to obtain some pain meds. During his examination he kept pushing on my lower torso/uterus area and every time I screamed in pain he'd tell me to stop being dramatic and that if I didn't stop flexing that area then he'd have to push harder. I wasn't flexing that area but he insisted that I was.\n\nI kind of zoned in and out of the rest of the exam but I remember realizing I was completely screwed when he was literally hopping up and down to be able to feel what was going on. Eventually he proclaimed that I probably just have an upset stomach due to being fat and that he'd draw blood if it got my mom to stop \"enabling\" me. His nurse couldn't get a vein after multiple attempts in both arms. When a different nurse tried multiple times she finally went \"Oh, you're really dehydrated\" to which the doctor then chastised me for drinking too much soda which likely caused the dehydration.\n\nMy mom was frantic and kept my doctor up to date with everything that was happening. My doctor told her to just take me and leave and try to hold out until we reached the closest ER. As we were leaving the doctor told us that he had already called ahead to multiple nearby ERs in our plan to let them know that I was just trying to get pain meds and to not give them to me.\n\nEventually my pain started subsiding and we drove to my regular doctor. She was beyond pissed and ended up helping us file a shit ton of paperwork to complain to the medical board about what happened. My doctor's biggest push to my mom about why she should file an official complaint and negligence claim was because\n\n1. He didn't know what was wrong and if someone complains of pain somewhere you shouldn't be pushing so hard that you're jumping up and down to dig in because you could be making things WAY worse.\n\n2. Due to the pain being caused by a cyst popping there was a good chance that digging his fingers into my lower torso could have caused more to pop\n\n3. If a patient comes in screaming and crying saying they're in pain, you shouldn't automatically dismiss it, especially when they continue showing signs of pain when you touch the area they're complaining about.",
   "created_utc": 1692401956,
   "score": 244,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsbh9d",
   "message": "My pediatrician told me that the reason I wasn’t doing well in school was because I spent too much time shaving my nether regions 🙃",
   "created_utc": 1692398769,
   "score": 146,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsehqe",
   "message": "My wife was told that her retina episode needed to be watched very carefully by a specialist. First, exams every month for 6 months, than every 2 months, and then 3. Finally 2.5 years later she was having her vision prescription update when the doctor noticed a laser treatment and asked why. Turns out, after visiting 2 more doctors for opinions that there was zero danger from the episode and that the laser procedure was done on nothing. Nowhere near where her retina thing was. Just a guy stealing money from insurance companies and patients. And he's the most arrogant ass ever.",
   "created_utc": 1692400079,
   "score": 168,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsm9ed",
   "message": "Hands down, my IUD insertion. No warning. No numbing. Just spread on a table and an evil lady shoving a barb up in my cervix. \nSwear to God I screamed at the top of my lungs, threw up, then blacked out for 2 mins. Then spent the next hour in the fetal position in the bathroom crying and throwing up. THEN drove myself home in the fetal position shaking from the pain. Fuck that lady doctor!",
   "created_utc": 1692403506,
   "score": 14,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsns9m",
   "message": "If we're only talking about experiences at an office or clinc...that would be when I got my cancer diagnosis.  It was the week before Christmas, I was only 23 at the time and my wife and I had only been married for six months.\n\nIt's been almost 23 years since my last treatment and I'm doing okay (knock on wood) but yeah, that was one truly shitty time in my life.",
   "created_utc": 1692404193,
   "score": 203,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsgqv1",
   "message": "Accidentally farted while getting ultrasound on my testicle. Apologized profusely. Tech (female) was a total professional and said “Happens, it’s ok. I know you are in considerable pain.”\n\nTesticle was swollen to size of a lemon.",
   "created_utc": 1692401065,
   "score": 240,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsejkl",
   "message": "Tuesday. \nWent to my urologist just to ask questions, literally just questions. \nSo I have a catheter right now, he said hey let’s change that, like uh okay, this man used no anesthesia at all, he yanked the old one out, then shoved the new one in, I started screaming cause no anesthesia again, he shoved this thing in me that felt like a multi pronged fishing hook all through my nether regions. He said yeah it’s in there let’s inflate it, the pain was so intense I blacked out. So the next day the bag had less than an ounce, went back, then they said oh you got to go to the ER. 9 hours later they booked me with the original guy that put the last one in, had to go into surgery because the badly placed one was floating in my body distending and expanding my body. They got that one out new one in with no issues this guy used anesthesia. My private area is sore as a mofo because of that failed replacement.",
   "created_utc": 1692400102,
   "score": 243,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwscro4",
   "message": "When I wanted a hysterectomy because my life was literally in danger due to anemia and non-stop bleeding and was told no, because my husband might want kids. I am not nor have I ever been married, I was in my 40s and I didn't want kids in the first place, but after explaining all this, was still told no. Because I might meet a man and he might want to knock me up at over 40, and I did not get a say, apparently. \n\nI went to Mexico and they yoinked that thing out for me.\n\nI came back and met with a completely different doctor for follow-up, and when he learned I'd had a hysterectomy without my future husband's consent, he told me he wouldn't treat me and to see PP for any future care because 'they're used to dealing with whores.'\n\nThis was six years ago, if you're wondering. 2017. I have no reason to think anything has changed and quite a few reasons to think it's getting worse.",
   "created_utc": 1692399322,
   "score": 65,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsmq31",
   "message": "I brought my daughter in for her shots (she was 6 at the time, I think?) and the nurse was lovely until she asked about the health history of my daughter's bio father, which I wasn't sure of (big mistake with the guy, but great reward on my end bc she's amazing) and this Nurse Ratchet turned into some kind of demon and made the experience much more painful than it should have been. My poor kid still talks about the Nasty Nurse and she's 12 now. She hasn't forgotten.",
   "created_utc": 1692403715,
   "score": 221,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsepph",
   "message": "This was a ripple effect. One doctor (from a religious office that my parents sent me to) prescribed me medication for my migraines. \nAnother doctor, about two years later, prescribed me birth control. \nNeither doctor told me that for every 50 mg of this headache medication you took, it lowered the effectiveness of your birth control by 25%. I was taking 200 mg.\nFirst doctor didn’t tell me because I was 19 and unmarried, therefore “shouldn’t be having sex”. The next one didn’t tell me because it was a Planned Parenthood, they were extremely overworked, and there were protesters outside, so everyone was a bit on edge. \n\nSuffice to say I have a 7 year old now. \n\nThankfully, I have an amazing partner who’s got my back through everything. And we roll with the punches. But I wonder a lot how much different my life would’ve been if that first doctor would’ve been forthcoming with information.",
   "created_utc": 1692400178,
   "score": 138,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jws3xsu",
   "message": "A doctor once told me that I didn’t need antidepressants, that I needed to find Jesus and I would be fine.",
   "created_utc": 1692395589,
   "score": 84,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsauke",
   "message": "Doc forgot to remove the speculum. I had to call him back as he was leaving the room to get him to remove it. He acted as though I was wasting his time.",
   "created_utc": 1692398500,
   "score": 80,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsdyg3",
   "message": "Another patient vomited on me.",
   "created_utc": 1692399843,
   "score": 116,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsgsfy",
   "message": "I saw a psychologist after my brother's suicide because I was an absolute mess. He'd been living with us and I found him. The psychologist proceeded to chastise me during the session because I never finished college.\n\nIt totally soured me on therapy and I waited a lot longer than I should have to see one for other mental health issues I have.",
   "created_utc": 1692401084,
   "score": 138,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsdoag",
   "message": "Drove 2 hours, caught in some traffic, 2 minutes late....they cancelled the appointment and charged me 25 bucks, but I can guarantee if I was on time I would've sat there for at least a half hour before they called me in anyways",
   "created_utc": 1692399719,
   "score": 57,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsebzh",
   "message": "Went to go get blood drawn before surgery\n\nGot stuck 13 times in my hands, wrist and elbow, still couldn’t draw a drop\n\nMy mom, who came with me because this was 2 HOURS out of the way, “can I try”\n\nShe got it on the first try\n\n(For context my mom used to be a phlebotomist)",
   "created_utc": 1692400009,
   "score": 170,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsbc2n",
   "message": "I coughed up a lot of blood and passed out in the bathroom because I couldn’t breathe. I had pneumonia and ended up staying in hospital for a long time.",
   "created_utc": 1692398708,
   "score": 82,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsh5ij",
   "message": "I was 17 and got a really aggressive UTI out of nowhere. I was BARELY sexually active at that point, I think I’d maybe had sex twice. The little douchebag doctor yelled at me for like 45 minutes saying I can never be too sure my partner isn’t cheating on me while I cried and that I shouldn’t be so slutty. I left without medicine and drove directly to another urgent care where they diagnosed me and I recovered in a few days. It was horrible.",
   "created_utc": 1692401242,
   "score": 148,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsg7sz",
   "message": "I have torn cartilage in my shoulder and the third time I went to the doctor about it he immediately stopped caring once I said it didn't hurt that bad even though it hurt every day. Just said to come back if it gets worse. It did but very progressively so I didn't think about it for months. Went to a fourth doctor who actually diagnosed the issue and pushed me to surgery. I opted for physical therapy instead and it seems to be the right choice. 4 orthopedists to diagnose it, and only one physical therapist to fix it. The single worst experience was being flat out ignored by the third doctor which lead to me further damaging myself. If I just started PT back then, I'd probably be in better shape.",
   "created_utc": 1692400838,
   "score": 152,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsddkq",
   "message": "The time one told me to go to church and pray to get better and when I told her I didn’t really believe in that she started yelling at me that we were made n God’s image. I still can’t believe that happened.",
   "created_utc": 1692399589,
   "score": 129,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsinco",
   "message": "Took 7 tries for the anesthesiologist to place my epidural during labor (I have a bit of a crooked spine). He even muttered “son of a bitch” after the 5th failure. And the nurse that was working with him told me he was the “epidural whisperer”. 7 jabs into my spine was not fun.",
   "created_utc": 1692401894,
   "score": 154,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwshvzw",
   "message": "I was mistaken for a dead kid.. I was right across the hall from the kid that passed away, somehow the staff got our paperwork mixed up and went to inform my parents that I had “died”.! one of the many fuck ups that hospital has made.  shit got so bad they had to replace board members, staff and even changed the name of the hospital.",
   "created_utc": 1692401565,
   "score": 67,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsizfo",
   "message": "I've severe chronic pain for the last 11yrs but I also have a very high pain threshold. I was weaning off my meds so we could possibly begin looking at starting a family.\n\nEverything was going OK, I was in more pain but I was managing it when one night I woke up screaming. I couldn't put my leg on the ground. I went to the ER and I spent 3hrs sitting outside the front door in a wheelchair vomiting and shaking in pain before they let me in and without any xrays told me I had a pulled hamstring and told me to take ibuprofen. \n\nI went to my own doctor 2 days later when the pain was no better and I hadn't slept more than 10mins at a time and her exact words were \"how do you expect to have a baby if you cant handle a few sleepless nights\".  I left there so disheartened and felt like I was over reacting. Weeks later, after l spending most days screaming in pain and thinking I was overreacting, I started loosing bladder control and went to see my pain Specialist who is amazing. She had me in an MRI that day and I was operated on by my neurosurgeon the day after. I was diagnosed with Cauda equina syndrome. He said had I waited any longer that I could've have ended up with a permanent wheelchair and urinary catheter.\n\nHe rang both the ER and my Dr in front of me and yelled at them. I realise I'm lucky I have two Specialists who have my best interests at heart but I never felt so gaslit in my life.",
   "created_utc": 1692402044,
   "score": 116,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwslyze",
   "message": "I had a doctor tell me that I, as an autistic adult, shouldn't be in charge of my own medical decisions and that I definitely shouldn't be going to appointments by myself. I was in my mid-twenties, an honor student in college, and generally pretty damn functional.\n\nMy brother, who was waiting out in the parking lot, nearly came inside to fight him.",
   "created_utc": 1692403376,
   "score": 212,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsexww",
   "message": "It’s a long story but a sports injury surgeon who ordered a contrast MRI which hurt like absolute hell. Worse than what was going on. He used this MRI and decided there was nothing wrong with me. Had me doing physical therapy on it for like 2 months and I only got worse. \n\nHe couldn’t figure anything out so referred me to hand specialist in the same office. Within the first visit, she used the EXACT SAME disc with the MRI he had done, and already figured out what was wrong. I had complete sever of one of my ligaments. \n\nShe not only could see this and showed me on the image itself, but that the VERY LAST sentence, which was on the last  page by itself, literally said that it was a complete sever/tear of said ligament. She showed me the report. He both didn’t read the imagine properly and couldn’t be bothered to read the entire report.\n\nUnfortunately I can’t pursue anything legally because I didn’t have any lasting disability. Despite all the pain and suffering and lost work time for over a year.",
   "created_utc": 1692400279,
   "score": 186,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsh9yp",
   "message": "I was having a pap smear from a DO that was at least 450lbs, and as he did my exam he told his nurse that once a bigger lady was having one and the table somehow failed and she fell crotch first right into his face. I was overweight at the time, and I just couldn't believe he'd bring up something so nonchalant like that. The nurse looked horrified.",
   "created_utc": 1692401297,
   "score": 170,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jws7itx",
   "message": "I was getting constant ear infections. I went to different doctors, who gave me antibiotics. They worked for a few days and then stopped. So I visited an allergist on my own, the only one in town. He was a grumpy old guy who arrived late, looked in my ear, and said \"I don't see any inflammation. I don't think there's anything wrong with your ears. Maybe it's a brain tumor or MS. Or it could be hyperthyroidism - your eyes are kind of bulgy. But maybe that's just the way you look.\"\n\nLong story shorter, it was an infection. He just didn't see it. I decided to eliminate foods on my own, to see if I was allergic to any of them. I eliminated milk from my diet, and poof, the infections went away. I haven't had an ear or sinus infection in over 25 years. \n\nIt takes a real leap of faith for me to see a doctor. For the most part, I either don't trust them or feel like I'm not getting the whole story.",
   "created_utc": 1692397082,
   "score": 4,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsm78t",
   "message": "Was sick with flu like symptoms and sore throat around the time swine flu was briefly a thing. Finally after over a week I went to a clinic to get checked out to rule that out and was told I had strep. The doctor said it was so obvious they weren’t even going to “waste a swab”. Gives me a script for amoxicillin and sends me on my way. \n\nNext day I’m pissing blood and go back to the doc. She exams me again, gets a urine sample, and comes back about an hour later telling me she has already called ahead to the Emergency Room at the hospital and told them I was coming because I’m in “End Stage Renal Failure”. Have a year old baby at home and I’m thinking my life is over and my kid is going to grow up without a dad. \n\nGet to the ER and the doc there looks at me and kind of skeptically raises an eyebrow, says he wants to draw blood and run some tests while they give me an IV bag. \n\nHe comes back in about 30 minutes telling me I have mono, the blood in urine was just from the associated liver infection from the virus / broken down blood cells that were being expelled in my urine (or something along those lines). Discharges me and says I’ll be fine.\n\nIt’s been like 14 years so I think he was probably right. Thanks ER doc, you were great! But I guess the original clinic doc that misdiagnosed me twice was the subject of that classic joke, “what do you call someone who graduates last in medical school?”",
   "created_utc": 1692403480,
   "score": 75,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jws6yhb",
   "message": "A psychiatrist once told (teenage) me my problem was “boys and I should become a lesbian”\n\nJokes on her I AM a lesbian and still just as mentally ill",
   "created_utc": 1692396838,
   "score": 19,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jws9tg7",
   "message": "In the early 80's, at about 12-13, I had a tooth repaired that got broken and the guy smoked cigarettes WHILE operating.  When they finally took the protective cover off the tooth, it smelled like I had been smoking myself.",
   "created_utc": 1692398057,
   "score": 159,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsahz5",
   "message": "Had a doctor tell me that a birth deformity I have was “really ugly”",
   "created_utc": 1692398348,
   "score": 121,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jws6bze",
   "message": "Had a Nexplanon implant removed, an iud placed and an endometrial biopsy done at the same time. I was not told honestly how fucking bad the iud and biopsy would suck. It was garbage.",
   "created_utc": 1692396576,
   "score": 137,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwslr1m",
   "message": "At 23, I went for a gyno visit due to a sexual health matter (not an STI) and the nurse practitioner, who had a giant cross hanging on the wall, told me I was probably having the issue due to guilt from being unmarried and sexually active. I was outraged, but hadn’t grown the backbone yet to tell her off. Looking back, I should have reported her to the medical board.",
   "created_utc": 1692403278,
   "score": 155,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsb32h",
   "message": "Telling my mom i no longer wanted her in the room for the “turn and cough”",
   "created_utc": 1692398601,
   "score": 28,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jws94uo",
   "message": "I was diagnosed with chronic bronchitis as a kid. Every winter, I typically have a bout of it. A few years ago, I had all the classic symptoms, called my doctor's office, and got an appointment with the new NP. She told me that I wouldn't have a cough if I lost weight. At the time, I was at the top of my weight chart, but not obese.",
   "created_utc": 1692397766,
   "score": 142,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsf18r",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwscbvk",
   "message": "My father always says his worst experience at the hospital was his circumcision. He didn’t walk for a year. \n\nMe being the fella I am, didn’t take a little off the top until, as an adult, my foreskin forgot how to stretch. It became medically necessary to be cirque du soleil as an adult. \n\nIt’s cool, kinda weird. Been almost ten years now. I still can bust nuts, but just like weird, cause I was an adult.",
   "created_utc": 1692399133,
   "score": 48,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwscuer",
   "message": "Well at least a physicians.. when they misdiagnosed my appendicitis as a ‘pulled muscle’. God damn a pulled muscle doesn’t feel like a bayonet to the belly you fucks.",
   "created_utc": 1692399354,
   "score": 44,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwse340",
   "message": "The doctor told me to come into the office to get my mammogram results. I already knew I had it from the imaging office, who told me I had DCIS. It’s not great to have DCIS, but if you’re going to have breast cancer, that’s the kind you want.\n\nI get to the office, and my doctor had been called away on an emergency. So her P.A. gave me the results, and told me I had invasive B.C. And holy shit, that’s not what you want to hear. I was quite shaken. The next day, the doctor called me and told me her P.A. was wrong - my cancer type was D.C.I.S.",
   "created_utc": 1692399900,
   "score": 43,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsg17j",
   "message": "Went to the ER for a sharp pain in my nutsack and they treated me horribly. Didn't believe me thought I was faking the pain. Everytime I asked a question or complained about the pain they were straight up assholes cussing at me and and literally pushing me around. Come to find out 8 hrs later they discovered I had a hernia. They wanted to keep me and I told them to fuck off and went to another hospital. This was in the Florida panhandle a notoriously horrible hospital.",
   "created_utc": 1692400758,
   "score": 98,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwskph3",
   "message": "Breast exam by a medical oncologist.  She left purple grab mark bruises on my breast.  It hurt like hell.  And she didn’t even find the cancer that was in there.",
   "created_utc": 1692402812,
   "score": 18,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsld17",
   "message": "Came in to an emergency room with horrible fever and vomiting. Doctors said its my appendix and that I need an urgent appendectomy. As this hospital was not the best my town provides, I decided to do the “urgent surgery” in a better hospital and rushed there.\nTurns out it was a bad bacterial infection. Almost got my appendix removed for no reason.",
   "created_utc": 1692403105,
   "score": 126,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsoybz",
   "message": "1. My IUD insertion was the most painful time of my life and they gave me... motrin... and then I drove home sobbing and cramping.\n\n2. It's happened twice where my doctor has brushed off my concerns so now I just brush off all my concerns as well because I'm scared to go to the doctors.",
   "created_utc": 1692404717,
   "score": 86,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsr8cz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsyjbp",
   "message": "Told her I had a lump in my neck. She couldn’t feel it. Said don’t worry, it’s nothing. Sent me home. \n\nA year later it got bigger. Went to a different dr. Cat scan.  Biopsy. Cancer. Had it for a year before I got diagnosed because of her. \n\nTreatment starts soon.",
   "created_utc": 1692409061,
   "score": 101,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwslz5k",
   "message": "Not as bad as some others but once I broke my wrist, went to the ER. They took an x-ray and put a cast on it. The doctor then told me to take the x ray to my family doctor for a follow-up.\n\nI booked the followup and went in. I already knew that my family doctor was kinda useless, but I was just following instructions. \n\nWaiting in the exam room, my doctor bursts in looking pissy and annoyed to be there. She rudely asks what I want, and I explain that I had a CD with my x ray and was told to bring it with me to have a follow-up done with her.\n\nShe huffs at me and goes \"well do you see equipment in here to examine an x ray? That CD is useless to me. I have no idea why you're here\"\n\nI get out of there as fast as possible and go home. Popped the CD into my PC and clicked the exe on the disc. X-ray comes up immediately 🤦‍♂️",
   "created_utc": 1692403378,
   "score": 123,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwslzcr",
   "message": "Carried in by friends with skateboard in hand.  Dislocated left shoulder, broke left wrist, and also sprained my left foot.  I told the doctor I just fell in a kidney pool at a skate park. \n\nThis stupid bastard looked me right in the eyes and told me he had been a doctor for over forty years and that my foot was not sprained in the slightest but that I had gout.  \n\nGtfoh ya old jabroni.",
   "created_utc": 1692403381,
   "score": 94,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwszmd9",
   "message": "I was booked in for a Pap smear and my regular dr wasn’t available on the day so the offered to fit me in with another dr in the practice. What could go wrong? \n\nAfter the Pap smear which was unpleasant as usual, the dr(mid50s, very strict headmistress type) followed up with “I like to do a manual exam” I said ‘No’ but she then told me that “it was compulsory part of her care standards.” \n \nI felt like I could not refuse. So the dr gave me a manual exam, and pushed on my stomach from the outside while her whole hand was in my vagina. When I complained that she was hurting me I was told that “this is nothing compared to childbirth and I had a lot to learn.” When she removed her hand she told me off for coming to get a Pap smear when I was on my period - (which I wasn’t I had timed the appointment specifically) she had made me bleed. \n\nI was in shock of what had happened and paid the bill and went home in a haze. I took two ibuprofen and went to bed. For more than a week I was in pain and walked hunched with a hot water bottles on my stomach. \n\n\nWhen I next saw my usual dr, I told her what happened, and how I was unwell afterwards, and was told that ‘ah yes, some drs do things differently, but you are ok now and you have had your Pap smear, and the results are fine.’ \n\nAfter that appointment I changed drs practices.",
   "created_utc": 1692409568,
   "score": 115,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwt0at7",
   "message": "i was experiencing an onset of gastritis while waiting in line to board a flight. i went to the bathroom, i sat down on the toilet, and then started profusely sweating while feeling vomit rising in my throat. i was in there all through boarding and went to the desk to have them call me an ambulance.\n\nthey called a cop instead, who took my license and *then* called an ambulance. he clearly thought i was drugged out and not sick. i got the ambulance and they, too, thought i was drugged out. all of them, cop included, started making fun of me and throwing accusations. ambulance takes me to the hospital, but the tech in back with me was on his phone and ignoring my pleas to turn off the AC.\n\nthey check me in the hospital, immediately tell the docs what they think, and the staff completely ignores me. they wheeled me into a corner and left me there feeling like my stomach was eating itself. the doc, at one point, came up to me—he was listening to me wailing because it was so painful—and asked, “why are you acting like this?” he refused to let me talk.\n\nmy partner and mother came by once i could get ahold of them, and the nurse comes out to tell them that i’m clearly on drugs and trying to scam for “more” opiates. i had a bad heroin problem and have been 4 years sober. so, this news made my partner walk out while my mother was catatonic thinking i’d relapsed.\n\nluckily, *one* doctor believed me, drew blood, and came out shortly after the nurse and corrected her by telling everyone i was, in fact, experiencing gastric distress (with no trace of illicit substances in my blood). the nurse gave no shit, said whatever, and walked back like nothing happened. my mother was able to get my partner back in the room and had the doctor repeat what she said.\n\nknowing this was going nowhere, while also feeling like a scumbag degenerate, i pulled out my own IV, grabbed my clothes, changed, and walked out with my mother and partner. they drove the doctor my mother and father use, who took all of 5 minutes to see me, diagnose me, and write me a script (though, i don’t think there’s a med for what i had, it was *something* that helped).\n\nso, in a matter of 4 hours, i had a cop and entire crew of airport staff think i was high as fuck; the same cop convince EMS i was high and not worth their attention; the same EMS relay to the ER i was a drug scammer, which convinced them, without any evidence, to ignore me cries for help; and a nurse nearly destroy my very serious 4-year-long partnership while simultaneously destroying my family. \n\nya, that was the worst hospital experience, superseding the time i had an illness of the kidney that less than 1% of people are known to have, which required extensive surgery at 9-years-old and months-long recovery. spoiler, i lost my kidney. still not as bad, though.",
   "created_utc": 1692409883,
   "score": 38,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwt0utq",
   "message": "I hate going to the doctor. I used to do Muay Thai before COVID and one night I took a kick to the pads in my hand and the kick hit to the side instead of on center, spinning the pad around and wrenching my wrist. The next morning it looked like I had a purple and black ping pong ball shoved under my skin so off to the doc I went. He didn’t even X-ray me, just bent me all around while I gasped and drew air in through my teeth (I have a very high pain tolerance, I didn’t even scream during my drug free childbirths). Then he chastised me for doing martial arts because I didn’t need them to be the first at the school pickup line. To this day I’m pretty sure I did some damage because the joint likes to pop out of place at random and aches. \n\nAnother doc, well I don’t want to go too into details. I was assaulted during a pap exam by a female NP who refused to do the breast exam I’d scheduled after finding a lump. Instead she said I needed a pap and assaulted me, it felt like she was stabbing my cervix with the sample brushes; it was more painful than having my IUD inserted. I’d never felt so violated. \n\nI went home and was cramping so badly for days, almost contraction like in sensation and I bled like a stuck pig. I had such extreme pain I couldn’t use tampons. I was in my late 30s and had never had an experience afterwards like that. My husband finally convinced me to file a complaint with the office. They brought me in immediately. Got my breast exam and lump confirmed. One cancer free biopsy result later and about six weeks of no sex I felt better and the doc was no longer practicing at their office.",
   "created_utc": 1692410143,
   "score": 37,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsg248",
   "message": "I had been having chronic migraines for probably 7 years at this point and couldn’t for the life of me get a doctor to listen to me about wanting medication.  Saw another doctor, gave her the backstory to which she replied with something along the lines of “Well you’re about to turn 25 soon, you’re starting to get up there in age and need to start planning for a family soon. You shouldn’t be on any medications while pregnant, so just think about staying more hydrated and stress free for a while.”\n\nI did not continue seeing that doctor.\n\nEdit for context: I do not want children, and when expressed she said I would change my mind and need to start working on it soon. Again, because I was “old”.",
   "created_utc": 1692400770,
   "score": 106,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsn3hc",
   "message": "I went to a lot of doctors appointments as a teenager (13-14) for my scoliosis back brace. At one of the appointments I complained of having severe back pain that made exercising difficult, my doctor turned to face me (and my dad) and with a straight face he said “You should try pole dancing”. \n\nI know that it is a valid form of exercise that genuinely does improve core strength but that did not stop 13 y/o me from turning bright red. I think that was more embarrassing then when a doctor pointed at my abdominal X-ray before saying “Well you’re literally full of shit”.",
   "created_utc": 1692403885,
   "score": 59,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsn8rz",
   "message": "I was forty- two years old and kept waking up in the middle of the night with intense pain in my right side. Usually lasted 2-3 hours at a time. I tried hot baths, pain relievers, walking around the house, nothing helped. After a few nights my son insisted I go to the ER. Got a shot of morphine and the pain immediately went away. Got sent for a scan and told to see my doctor in the morning.\n Went to the doc and had a chat with him, he reviewed the ER report and told me he was going to call right now and  add me to the surgical list that day. He stepped outside he room and I heard him on the phone saying he had a 42 YO F with end stage cancer to add to the surgical schedule that day. I freaked! He stepped back inside and I asked him why didn't he tell me I had end stage cancer. He jerked and said it was the patient in the next room. I was relieved for me, but I sure hope she didn't hear that phone call. Got the last surgery of the night and removed my gall bladder. I ended up fine and hope the patient in the next examining room did too.",
   "created_utc": 1692403951,
   "score": 46,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsxaq7",
   "message": "My diagnosis. I was 13 and struggling a lot against suicide at the time. I started to scare the other kids in my middle school with how much I cried in the bathroom, so I was referred for psychiatric evaluation. I was taken into a side room by the psychiatrist away from my mom, where he asked me about my struggles. I was honest and talked about attempts at my life.\n\nHe proceeded to scream at me for it. Top of lungs yell. I’ve blacked out all the words. He left me alone to cry and breakdown and went to speak to my mother. After that I came out of the hospital with a shiny new autism diagnosis.\n\nI hated him and that experience so much I am pursuing a career in psychological evaluation. I want to make diagnosis a positive first step to getting help, and for diagnosis to come as a relief. Healthcare shouldn’t involve screaming at children.\n\nIt also came out later he was beating his wife and children, so that tracks.",
   "created_utc": 1692408480,
   "score": 87,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsxpoz",
   "message": "5 years ago my wife and I changed doctors at her request. I went for my initial visit after work so we could get to know one another and was taken to an empty room and told she was terribly behind (30 minutes or so) and would meet with me as soon as she could. I’m reading a book on my phone and lost track of time (about 1 1/2 hours).It’s really quiet out there so I get up to go see what’s going on. Everyone forgot about me and they were heading out the door.",
   "created_utc": 1692408678,
   "score": 82,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwt061s",
   "message": "I went to see an eye doctor because I broke my glasses and didn’t have a backup pair (I always donate my old pairs to charity). We did the exam then went out to look at glasses. Because I didn’t buy a pair of glasses he refused to give me my prescription “until the insurance payment cleared.” I waited a full week calling every two days - still would not release the prescription. I called my insurance company and they canceled payment to him and let me schedule an appointment with a different eye doctor. Just insane.",
   "created_utc": 1692409822,
   "score": 52,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwt5j8e",
   "message": "Actual conversation:\n\nMe: I’m here about this cancer diag..\n\nMD: You need to lose weight\n\nMe: Yes, I know but this lab report says o have cancer\n\nMD: Let’s get some weight off you and see if that doesn’t help.  I want you on a diet and running three miles a day.  (Exits)\n\nMe: ….but cancer…\n\nMe:",
   "created_utc": 1692412397,
   "score": 39,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwt6x71",
   "message": "I had been sick for a while and had been gaining about 20 pounds a month. I had seen multiple doctors and they just told me I was just eating more than I thought which was ridiculous. I went to a doctor for a skin issue and the new doctor walked in the room and looked at me from across the room and said “let’s get you to the emergency room” after about five seconds. \n\nI had end stage cirrhosis of the liver. That kind of sucked. I had a liver transplant 362 days ago and only in the last month have I started to feel like I am getting back to normal. \n\nDid you know you can get so sick your hair turns gray and then get better and the gray hair goes away? It’s weird honestly.",
   "created_utc": 1692413076,
   "score": 66,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsi048",
   "message": "I knew I had shingles. All the doctor talked about was my weight and tests I wasn’t up to date on. \n\nI had to convince him I had shingles and not poison ivy so I could get some acyclovir. Never went back.",
   "created_utc": 1692401614,
   "score": 39,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwt2fwv",
   "message": "I took my 90 year old grandma to the podiatrist and for whatever reason the 40 something male nurse thought it was important to point out that I was overweight (22F). I was a 6ft tall former D1 basketball athlete and despite not being the same size as I was at 18, nothing I did or said warranted this comment. WHY DID THIS MAN EVEN DISCUSS ME AT MY GRANDMAS APPOINTMENT. He was overweight! God, fuck that guy.",
   "created_utc": 1692410899,
   "score": 50,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwt5luf",
   "message": "I think the most dehumanizing is going to a doctor who divided the patients by insurance. I had an appointment at 9am and waited til almost noon because I had medicaid.",
   "created_utc": 1692412433,
   "score": 45,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwskhl6",
   "message": "Just today, I have urine retention and had to get a sonogram. As you know, your bladder needs to be full when getting a sonogram but the longer I wait, the harder it is to go. After about 20 minutes of them doing the sonogram and pushing on my full bladder, I was able to go to the bathroom. I couldn’t pee.\n15 minutes of trying and crying and they had to ask me to hurry because there were other patients.\nI left the office crying in front of doctors and patients, in pain, and still had to pee only for them to confusingly look at me and tell me they saw nothing wrong and have no idea why I even have this issue.",
   "created_utc": 1692402715,
   "score": 43,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwskq82",
   "message": "Most embarrassing:\n\n I had a heart ultrasound done. Im 5'9 and I was 260 pounds at the time. When the doctor got the results back they said the pictures were blurry because there was a lot of interference. \n\nThe doctor said \"we usually don't get this problem with men. We usually see this in women with big breasts. Come back in a year or two after you lost some weight and we will do another one.\"",
   "created_utc": 1692402822,
   "score": 41,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwsok01",
   "message": "I don’t know if this will get traction, but as a gay man in a conservative place I had sex for the first time with someone that claimed they hadn’t had sex. I was seventeen, he was older. We were together for two years and never used protection. When we broke up he admitted that I wasn’t his first and in fact there had been many. Sometimes when we were together. I was involved with an LGBT group at that time that encouraged STI testing. I never thought I needed it but I went to planned parenthood because they offered cheap testing for gay people as well. That clinic took my blood, did their swabs, all of it. I was told I would get a phone call with my results if I gave them an identifying code. They called. I gave the code. The woman on the phone said, I found your results, but I need an appointment now. I asked why and she said only a doctor can give your results now. I made an appointment that was two weeks later. I went to that appointment and I was told I needed to check in and normally a nurse could give my results but my situation requires a doctor. So I cried in the waiting room. I assumed after all of these hoops that I had jumped through, it must be awful news. I got called back. The first nurse in the room looked at my chart and said she needed to find the doctor. I was fully just sobbing at this point. Finally the doctor they were all talking about walked in and said I’m disease free but I should question my lifestyle so this wouldn’t happen again. They also kicked me the fuck out. I had to walk back through the clinic crying. I sat in my car crying with relief and anger. \n\nAt least in my time, planned parenthood was as bad as right wing bullshit because I was a faggot. It really felt like they dragged everything out and implied things just to make me afraid to be gay. \n\nAlso, my best friend slept with a ton of men, got pregnant and planned parenthood helped her \n\nI get that this was a local chapter or something, but this was a huge college town before being gay was okay. Our only cheap clinic was planned parenthood.\n\nThere are other ways to support women and gay men.",
   "created_utc": 1692404539,
   "score": 41,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwt4bdh",
   "message": "I have lots of bad experiences with doctors offices.\n\nI specialise in intellectual disability and mental health, both are things that general doctors and nurses know little about. I'm also a psychologist, however I work very closely with many of my clients as my company also provide general support services and occasionally I will need to assist a client to attend a GP visit. When I do, 90% of the time they presume I am a lowly undereducated support worker.\n\nI have had a flying doctor in a rural/remote hospital tell me that because the patient who had just had a heart attack had no family and an obvious disability, once in the air they would just \"let him go\". I've never had to suppress white hot rage like that before, but I managed to deal with her respectfully and keep the patient alive.\n\nTook my sister, who has a severe intellectual disability, (but does not \"present\" as disabled) to a GP, and the GP refused to allow me into the room with them. I tried to explain (sister at the time was nearly non-verbal and didn't know what she was there for anyway) but he was condescending and dismissive, absolutely certain of himself and that I was meddling. \nAfter quite firmly being shut down, I said okay then, and took a seat in the waiting room.\nAbout 2 minutes later he popped his head out looking a little less certain of himself and asked if I wanted to come in. I replied that I was sure he had it well in hand, he'd be alright without me no doubt.\n5 minutes later he popped back out and asked me to please come in. Complete attitude change. I went in and my sister had taken everything off his desk and put it in her bag, and was happily dancing to herself and playing with his container of tongue depressors.\nHe looked at me and almost apologetically said \" I think she may have a disability of some sort\". I told him that was very astute of him, emptied my sisters bag of his desk things, grabbed my sister and left to find another doctor.\n\nHad a GP, and then 2 different ER doctors tell me a client was fine, despite being yellow and constantly vomiting. I pulled Ryan's Rule and forced them to test, client had a ruptured gallbladder.\n\nBriefly had an aboriginal client with mild mental health issues (nothing too serious) stumble and collapse in the gutter, doctors and nurses all said he was drunk (patient was known to us to not be a drinker) and sent him home. Dead of a brain aneurysm 45 minutes later (and autopsy revealed no drugs or alcohol for the record)\n\nClient (single dad to 4 kids) has severe abdominal pain, and vomiting for 2 days, dehydrated and cannot walk. So sick he can't get out of bed. His kids actually walked to our office to get help, call an ambulance and get him to the hospital, where they turn him away for drug seeking behaviour - and report him to Children's Services.\nChildren's services arrive a couple of hours later, enter the home where he has been returned (and yes it was a mess, dude wasn't doing any housekeeping due to being bedridden) and Children's services took one look at him and went \" oh, this dude is sick as hell\" and called another ambulance. Children's services put the kids with us while he was in hospital.\nHe gets to hospital a second time, and they turn him away *again* for drug seeking behaviour. He is sent home.\nSo I go pick him up, take him to the hospital a third tine where they try to argue the problem is mental health, the symptoms are psychosomatic. I argue they are a hospital, do their darned jobs. I kicked up enough of a stink that they finally scanned his abdomin and found some mesh from an old surgery had come loose and was fucking up his gut.\n\nHad several GPs tell schizophrenic patients they could safely stop taking their medication.\n\nHealthcare for people with intellectual disabilities and/or mental health issues really need strong advocates because they are so often dismissed by regular medical personnel. Especially if they have a \"dual diagnosis\", because all too often a GP will ignore a mental health problem in favour of the disability or vice versa (they dont need medication for this, they're just disabled\" or \"intellectual disability? No, this behaviour is because they're obviously on drugs/have a mental illness\")\n\nI have more stories but this is already too long.",
   "created_utc": 1692411799,
   "score": 38,
   "submission_id": "15uxftv"
  },
  {
   "comment_id": "jwt0lfs",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15uxftv"
  }
 ]
}