{
 "submission_id": "15uycfc",
 "title": "How do you know that you’re in love?",
 "selftext": "",
 "created_utc": 1692397472,
 "permalink": "/r/AskReddit/comments/15uycfc/how_do_you_know_that_youre_in_love/",
 "score": 57,
 "url": "https://www.reddit.com/r/AskReddit/comments/15uycfc/how_do_you_know_that_youre_in_love/",
 "comments": [
  {
   "comment_id": "jwsgpqh",
   "message": "There a lot of little things, but the biggest thing for me was doing something fun or vacationing somewhere or even trying a new food and immediately thinking \"I wish I could share this with them.\"",
   "created_utc": 1692401052,
   "score": 52,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsit2v",
   "message": "When I don’t get butterflies in my gut.\n\nThe thought of that person simply makes me smile to myself, even when they’re not in the room. You feel warm all over even on the coldest night, you feel safe and completely free to be authentic with them.",
   "created_utc": 1692401965,
   "score": 23,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsig4m",
   "message": "You feel safe",
   "created_utc": 1692401806,
   "score": 12,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jws9bv4",
   "message": "If you have to ask yourself that question than you probably already know the answer.",
   "created_utc": 1692397849,
   "score": 27,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsrjuh",
   "message": "You want them in a way that has very little to do with sex.",
   "created_utc": 1692405889,
   "score": 11,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwss467",
   "message": "What is love?",
   "created_utc": 1692406142,
   "score": 9,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsbitx",
   "message": "When what makes them happy trumps what makes you happy.",
   "created_utc": 1692398788,
   "score": 19,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsoobr",
   "message": "When you fall for someone, they cross your mind constantly. Even if they’re not around, you’re replaying conversations or wondering what they’re up to. When you read a book or see a movie without them, you wonder what they think. You may even want to call them just to hear the sound of their voice.",
   "created_utc": 1692404591,
   "score": 18,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsgbqr",
   "message": "\"Ya just know.\"",
   "created_utc": 1692400885,
   "score": 8,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsoisj",
   "message": "They add positivity to my life in a way that no one else around me does. I'd rather spend time with them than be away from them. I enjoy watching them do even the most mundane things. Their arms around me will be one of my places of comfort and safety.",
   "created_utc": 1692404524,
   "score": 10,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsp2ae",
   "message": "If you’re really in love, then can see your significant other as a real human being with real human flaws not as a god or a goddess. You’re comfortable admitting that they can be a bit selfish or isn’t the world’s greatest listener, yet you adore them anyway",
   "created_utc": 1692404767,
   "score": 6,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwt036s",
   "message": "When they get sick and you don't even think about getting sick before taking care off them. \n\nWhen they are puking and stand by their side and over them a wet towel and the puke doesn't disgust you because you are just worried about them. \n\nWhen they are the only prison that can calm you down and make you that fucking mad at them same time. \n\nWhen you can't think of anyone else that you would rather be growing older and falling apart beside.",
   "created_utc": 1692409784,
   "score": 6,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsmqf2",
   "message": "They get a haircut or dress differently and u still like them",
   "created_utc": 1692403720,
   "score": 5,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsq5oa",
   "message": "When you're away from the person and you miss them and want to rush right to them.",
   "created_utc": 1692405261,
   "score": 6,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwszypg",
   "message": "would you sacrifice your life for theirs",
   "created_utc": 1692409727,
   "score": 6,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsgw9v",
   "message": "From Tumblr, \"if the person you like gets a haircut and they're ugly, it's a crush\"",
   "created_utc": 1692401130,
   "score": 9,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsge00",
   "message": "When you want to eat your partner’s ass without reciprocation",
   "created_utc": 1692400912,
   "score": 9,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsibk2",
   "message": "When you still want to spend your entire life with them after the honeymoon butterfly phase is over",
   "created_utc": 1692401751,
   "score": 3,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsud74",
   "message": "If they’re the first person you would call if you got a promotion, got fired, won the lottery, got robbed, or even found a new flavor of ice cream …basically when they’re the person you go to for life’s big or small moments",
   "created_utc": 1692407147,
   "score": 3,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsy97a",
   "message": "When you can't get them out of your head",
   "created_utc": 1692408933,
   "score": 3,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsgvoy",
   "message": "That when things go bad at work you can calm yourself because you know you have a treasure at home. Nothing else seems to matter beyond her and your dreams you want to achieve. A good wife puts you ahead of 99% of the world and even billionaires, you’ve got something no amount of luck or wealth can afford. In that sense I’m always winning, I have support. You don’t fear failure, it’s just a learning opportunity, you trust her judgment and wisdom it’s not a one sided relationship it’s a mutual respect and adoration. Everyday you want to find ways to make her life easier, appreciating everything she does, never wanting to fall into a routine just spontaneous. It feels like your still dating in that “honeymoon phase” everyday, always complimenting and showing her off. I’m so proud of what I have and I protect that because it makes life worth living and work worth working. Many a sad man works to no destination. Handle her with grace, love her in such a way that nobody else could compare and nobody else would invest the way you invest your time and affections. When that’s reciprocated you have the recipe for a true life, not a half life of small momentary pleasures. I have a wife men would kill for and I know that, and I treat her as such. Remember that your words have power, what you say will manifest, don’t speak badly of her to anyone not even in jest. Words are like cooking, you can add but you can never take back. Protect that initial base of love and respect and you will never have lingering arguments or pains. Many relationships fail the first few months they just don’t see it until it festers for years or less.",
   "created_utc": 1692401123,
   "score": 4,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsgzw1",
   "message": "The sick test. If you imagine (or have the unfortunate reality) your SO being violently ill out of both ends, and you still feel the same for them, you might be on the path of love.",
   "created_utc": 1692401173,
   "score": 5,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwt0apw",
   "message": "When you tingle all over when you see them",
   "created_utc": 1692409882,
   "score": 2,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwt0upt",
   "message": "You will know. It's not a feeling that could be accurately described. \n\nIt will be like walking around on a cloud. Everything will seem sunny and you will honestly feel high and euphoric.  Also you will not be able to stop thinking about the person. The world could be falling apart around you but it wouldn't matter and you might not notice or care. \n\nYour mind will be laser focused on the person and you day will centre around the anticipation of seeing or talking to them.\n\nIn the beginning it is the greatest feeling on Earth.",
   "created_utc": 1692410141,
   "score": 2,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwt1jvm",
   "message": "they simultaneously make you feel like the best person and make you want to be better all at the same time",
   "created_utc": 1692410474,
   "score": 2,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsgfqw",
   "message": "When I feel that sooner or later something bad will happen ;)",
   "created_utc": 1692400932,
   "score": 4,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsmmg1",
   "message": "When you stop thinking about fucking her.",
   "created_utc": 1692403669,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsk35q",
   "message": "You wanna sit by her",
   "created_utc": 1692402537,
   "score": 0,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsl8us",
   "message": "When you care about someone else more than you care about yourself.",
   "created_utc": 1692403053,
   "score": 0,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsvb8y",
   "message": "My only love is my business .",
   "created_utc": 1692407573,
   "score": 0,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwswoym",
   "message": "Your IQ drops",
   "created_utc": 1692408199,
   "score": 0,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsjkc3",
   "message": "That question can't be answered by reddit, you'll have to read philosophy books subject. I suggest reading Jiddu Krishnamurti's book Freedom from the Known which includes some topics about what love is, and the entire message is about making the world a better place for all beings. The audiobook is available here [https://www.youtube.com/watch?v=Os9qKMCN3Kc\u0026amp;list=PLYT3Of\\_Fx4pI9cA17bkJGtCk4xCHo\\_vey](https://www.youtube.com/watch?v=Os9qKMCN3Kc\u0026amp;list=PLYT3Of_Fx4pI9cA17bkJGtCk4xCHo_vey) and is public domain.\n\nEros, is ultimately selfish, and is the love for the earthly desires, it is about sex, it is about ego, you want someone, you don't want their best, you want their beauty, or you want their protection, regardless, that is not love, that is some kind of mutual self-fulfilment. I am actually not sure whether real love truly exists, it's a fleeting concept for me.\n\nIt is this thing with duty, we raise our children to become something, not to grow into what they already are. Parents have been conditioned from the get-go to be somebody, and not themselves, they should fit a certain narrative they themselves aren't participants in creating. It's a big masquerade where people contest with each other about who is the best advertisement for a successful, happy person or family. Money, fame and power is that which is the ideal today. Before it was love. 🤔",
   "created_utc": 1692402304,
   "score": 254,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsl9wj",
   "message": "I can't tell you but it lasts forever. \n\nIt's just something you feel together.",
   "created_utc": 1692403066,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsr5sl",
   "message": "When you keep hearing the song from back to the Future part one from the scene where Marty is playing your guitar in hopes to get his parents to have their first kiss after the events of Biff. Trying to do something inappropriate to his mom. Yes, I am talking about the scene when Marty is playing Earth. Angel, then they have their first kiss. So yeah I hear that song in my head every time I'm in love thinking about it now. I actually heard it in my head a few hours ago",
   "created_utc": 1692405714,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwstl52",
   "message": "When you start making bad decisions while still being happy.",
   "created_utc": 1692406797,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsurap",
   "message": "When I can give her my phone without having an internal panic attack",
   "created_utc": 1692407323,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsuyr4",
   "message": "I don't. aroace gang B)",
   "created_utc": 1692407416,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsvio0",
   "message": "I thought I was in love a lot, growing up. I'd feel in love with people after talking to them for a day. I fell in love with everybody; I loved every girl I met and half the boys.\n\nBut as I got older, and got hurt, and hurt people, I realized that love isn't that tingly feeling, or acting like an idiot, or wanting to be around someone all the time.\n\nLove is a quiet trust, it is affection built out of familiarity. Love is really, really, really knowing someone -- and wanting a life that has them in it, not because of what they can do, but because of what they are.",
   "created_utc": 1692407667,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwsw4nt",
   "message": "You'll feel it in your pants.",
   "created_utc": 1692407947,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwswgva",
   "message": "They could stab you in the back and you will forgive them.",
   "created_utc": 1692408098,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwt1tqz",
   "message": "How do you know when you're hungry?\n\nHow do you know when you're sad?\n\nHow do you know when you're warm?\n\n\n\nYou just feel it 🥰",
   "created_utc": 1692410605,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwt3qtd",
   "message": "Love is not a feeling.  It's continuously putting another person before yourself.  It's something that you do and work at every single day, even when things become difficult.",
   "created_utc": 1692411522,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwt3xja",
   "message": "Attraction + consider them trustworthy + respect their way of life + shared values + fun to hang around\n\nWhen these persist w/o the butterflies or hormone shit, you’ve got a partner",
   "created_utc": 1692411614,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwt46wm",
   "message": "When you got horny and you think you have chance with that someone",
   "created_utc": 1692411739,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwt5eyr",
   "message": "Idk ima go on a rant here so im still in school and there is this girl in my class and she is legit perfect 10/10 greatness and i have been like best friends with her for like a year and sometimes i lose sleep thinking about her and it drives me crazy like when she gives me one compliment it doesn’t make my day and makes my week and motivates to push harder in classes and stuff like i know its a one way deal and everytime i think of her i get a feeling of happiness and then realize that I’ll never get what i want to happen so i spend the rest of my day in sadness i want to ask her to do smth with me but she has rejected so many people and im afraid that it could be worse than no. I feel that love is a passion and a commitment to integrity and kindness towards somebody that you admire beyond an understandable level.",
   "created_utc": 1692412339,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwt6e97",
   "message": "You prioritize their feelings",
   "created_utc": 1692412818,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwt7hg9",
   "message": "After being married for decades then not, I'm pretty sure I don't know the actual answer to this question.",
   "created_utc": 1692413353,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwt91hz",
   "message": "If you have to ask, you are not.",
   "created_utc": 1692414145,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwt9kqy",
   "message": "when i want to start a family and literally plans my entire life with them\n\nand probably some intense feelings like heart goes rapid, feeling really happy around them",
   "created_utc": 1692414420,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwtaw11",
   "message": "Every thing about that person feels simultaneously brand new and exciting and familiar and comfortable.",
   "created_utc": 1692415114,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwtb4n7",
   "message": "When you want to share all the moments with them, good or bad, when something happens to you and the first person you want to tell is them, when it physically aches to leave eachother no matter how much time you’ve spent together, when you’re happiest with them, true love isn’t just fireworks, it’s calm and peaceful, at least that’s how I know, 6 years together and he’s still my very best friend",
   "created_utc": 1692415239,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwtcuy8",
   "message": "When it hurts to see them with someone else. \nLess depressing, but you always wanna be around them.",
   "created_utc": 1692416171,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwtfcdy",
   "message": "When you keep thinking about them every single moment that you are awake",
   "created_utc": 1692417568,
   "score": 1,
   "submission_id": "15uycfc"
  },
  {
   "comment_id": "jwtipmw",
   "message": "If you no longer see them as perfect and you recognize they are flawed, and yet you still feel the same honeymoon period infatuation about them, then you're probably in love with them.",
   "created_utc": 1692419544,
   "score": 1,
   "submission_id": "15uycfc"
  }
 ]
}