{
 "submission_id": "15v1ux6",
 "title": "[Serious] What would you do if the zombie apocalypse happened?",
 "selftext": "",
 "created_utc": 1692406524,
 "permalink": "/r/AskReddit/comments/15v1ux6/serious_what_would_you_do_if_the_zombie/",
 "score": 174,
 "url": "https://www.reddit.com/r/AskReddit/comments/15v1ux6/serious_what_would_you_do_if_the_zombie/",
 "comments": [
  {
   "comment_id": "jwssz1v",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1692406525,
   "score": 1,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwst9w1",
   "message": "If it's slow zombies I'd just keep moving, preferably through woodland, foraging for food along the way. If it's fast zombies, I guess I'd just fucking die.",
   "created_utc": 1692406658,
   "score": 130,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwst8ee",
   "message": "Probably just fortify my house and just wait it out for the military to deal with it. I don’t live in a major city and I live pretty far in the sticks so I should be fine for a while. All the general survival stuff so checklist.\n\n\u0026gt;1. Fill all containers with as much water as I can. Charge all my stuff, start setting up personal rationing.\n\n\u0026gt;2. Load my firearms and set up defenses.\n\n\u0026gt;3. Contact any close friends or family, but keep it limited to 5-10 people max.\n\n\u0026gt;4. Watch the news keep informed identify what kind of zombies were working with.\n\n\u0026gt;5. Print out a bunch of survival stuff and articles about edible plants in my area, as well as a PDF on how to properly repair things.\n\n\u0026gt;6. Take apart my furniture, if it’s not needed it’s now a barricade. \n\n\u0026gt;7. Watch time, keep a good perimeter around my house and cycle who’s keeping watch.\n\n\u0026gt;8. Makeshift gear, I already own a set of riot gear but I should probably keep it bite proof in the uncovered parts.\n\n\u0026gt;9. Wait for rescue, I can probably hold out for 2 months at most, if no rescue do a bit of scavenging.\n\n\u0026gt;10. Workout.\n\nI just need to hold out for military assistance, and if things go to shit, in the words of the random NCR soldier, “if the legion breaks through our defenses I got one bullet I’m saving just for me.”\n\nOther than surviving I also have a checklist for infection type so I know how to react. You gotta identify what we’re working with.\n\n\u0026gt;1. Is there variation, this one is the easiest to spot especially if there’s news coverage, are the infected capable of running or thinking, this changes my strategy greatly as smart and running zombies means I’ll likely need to be ready to constantly move.\n\n\u0026gt;2. Intelligence, even if there is variation what about the general infected how smart are they, will they fall for simple traps or barricades, do they follow mob mentality, will they attack each other? \n\n\u0026gt;3. Type of infection, is it airborne? If so I’ll have to wear my gas mask often when going outside or just in general, is it like the walking dead where anybody dies turns, this changes how I deal with my fallen comrades. When it comes to bites what are the carriers, if a mosquito bites a fresh zombie then bites me will I get infected. Is it an STD? Is it viral, bacterial, or fungal, maybe even a prion? These are all things I gotta be wary of, if it’s bacterial I may be able to temporarily cure myself with antibiotics. How long is the infection period? If it’s caused by alien means as in from extraterrestrial pathogens or magic there’s nothing I can really do.\n\n\u0026gt;4. Durability, are these walking skeletons I can push over and be done with or are these fuckin world war Z or resident evil level terminator fuckers that I gotta pop like 6 times in the head.\n\n\u0026gt;5. Place of origin, this will tell you alot about the disease as often if it’s fungal or bacterial it will have a preferred climate meaning that if it originates somewhere more hot and dry, I should get somewhere more moist and colder or even hotter, plus this may effect the decay rate.\n\n\u0026gt;6. Decay rate, are these zombies rotting or are they like the infected from 22 days later which are still human? \n\n\u0026gt;7. Behaviors, are they more active during the day or at night, are they aggressive or more passive, so they actively hunt or is it more of a wandering shamble? Do they know how to use doors and interact with the environment around them? Can they use tools.\n\n\u0026gt;8. Population, how many are likely in my area, what is the infection rate? Are there immune people in the population if so what is the confirmed percentage or known amount. Is there a way to wait the disease out after all in the walking dead it’s explained “the bites don’t kill you the fever does” will anti-fever medication eliminate this problem?\n\n\u0026gt;9. Government intervention, what has the government done so far to slow the disease or disaster? Have they contained it to an area?\n\n\u0026gt;10. If passive why? Most of us think of zombies as actively hunting and deadly but if they are generally passive why? I wouldn’t get close but I would observe passive infected to see what becomes of them.\n\n\nReading this comments I’m getting a lot of questions so I’ll answer them here.\n\n\u0026gt;1. Why workout won’t you use more calories? Remember you aren’t trying to bulk up you are trying to build endurance, this will allow you to keep running. Better to outpace a zombies than fight them, plus saving on calories doesn’t do you much good if you get bit because you couldn’t run fast enough.\n\n\u0026gt;2. Why do you own riot gear? On the onset of the 2020-2022 riots when going down town it became a pain to avoid the protests so I jokingly wore a riot helmet I got for airsoft years ago then I found a full set on sale for cheap. For a link here https://havengear.com/\n\n\u0026gt;3. What if the military fails? This plan is for onset but if things really go to shit, it moves from waiting to preservation, as I stated prior 5-10 people from the start, organize into a general base of operations and start farming.\n\n\u0026gt;4. Why 5-10 people max? 11+ is too many people as there is increased chance of disagreements and with no laws you never know what people will do, plus that’s more mouths to feed, 1-4 is too little if you are holding down a location, 1-4 is good for scouting or scavenging as you want to be able to constantly move easier but for a base of operation a general rule is 2 on guard, 2 working, 4 resting, 1 keeping inventory, and 1 managing. \n\n\u0026gt;5. What about hostile people? Kill on sight, unless it’s women or children because I still have some morals it’s gonna have to be a sorry for you, and randoms will end up becoming threats later as you never know if they show up and you let them go and they bring reinforcements, as for women and children I morally cannot kill them without reason or them attacking first.\n\nHowever I acknowledge this plan is for if military intervention is still an option, if it isn’t and things have really gone to shit.\n\n\u0026gt;1. Double down barricades are clear the area around my house, reduce the amount of cover on the perimeter of my house. If people come to raid well better for me they have no cover.\n\n\u0026gt;2. Farming, time to plant some potatoes, better than nothing, we need something and potatoes are pretty easy to grow shit sometimes they just grow in my cabinets when I leave them there too long.\n\n\u0026gt;3. Weapons, well ammo is going to become hard to obtain so we’re conserving bullets for human targets, zombies will have to be dealt with simple spears or bows, as those we can make more ammo for, bonus if we have a crossbow. \n\n\u0026gt;4. Figure out what attracts zombies, is it sound well we’re gonna need to figure out how to keep things quieter.\n\n\u0026gt;5. Boredom, I guess were breaking out my old Nintendo DS lite that shit never dies. Also monopoly. \n\n\u0026gt;6. Scavenging, as I said prior 1-4 people best, so we’re putting a middle of 3 people, a main scavenger, a front gunner, and a rear watch. Pick your 2nd and 5rd best shooter, the 1st and 3rd should be back at the home base case of a situation.",
   "created_utc": 1692406639,
   "score": 21,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwstnet",
   "message": "depends on the zombies",
   "created_utc": 1692406824,
   "score": 9,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsyv3d",
   "message": "Evidently buy shitloads of toilet paper.",
   "created_utc": 1692409211,
   "score": 125,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsu3nd",
   "message": "Literally kill myself.\n\nEdit: I am not about to get et.",
   "created_utc": 1692407027,
   "score": 107,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsuybq",
   "message": "Head on over to the Winchester and wait for it all to blow over.",
   "created_utc": 1692407411,
   "score": 89,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsty3g",
   "message": "probably die.",
   "created_utc": 1692406957,
   "score": 28,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwstaad",
   "message": "I’d go full zom 100 life is BS I’m already over life on it’s fuckery.",
   "created_utc": 1692406663,
   "score": 98,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsugge",
   "message": "Die.",
   "created_utc": 1692407188,
   "score": 43,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwswpbg",
   "message": "Get the fuck down because the sheer amount of idiots running around shooting anything that moves would probably do more than anything the zombies could.",
   "created_utc": 1692408204,
   "score": 163,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwszc6z",
   "message": "Die. I'm fat, don't do cardio, and likely taste amazing on account of the diabetes making me extra sweet.",
   "created_utc": 1692409434,
   "score": 136,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwst6h3",
   "message": "I have a pretty solid plan. Biggest part to it is waiting it out till winter. Zombies would absolutely freeze",
   "created_utc": 1692406615,
   "score": 178,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsvvxp",
   "message": "Stay inside until they all start exploding from decomposing gas (like a week or two)",
   "created_utc": 1692407836,
   "score": 151,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwt9mh9",
   "message": "I would die.  Mainly due to Rule 1. From zombieland...and not having it.",
   "created_utc": 1692414445,
   "score": 35,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsumx1",
   "message": "depends on the zombies i guess. but i'd probably stay where i'm at for a while. plenty of food, water, and weapons/ammo available but eventually i'd have to move. but when it came down to it, i'd give myself sudden onset lead poisoning.",
   "created_utc": 1692407269,
   "score": 35,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsywez",
   "message": "Find a redneck.",
   "created_utc": 1692409227,
   "score": 76,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsxq2y",
   "message": "The zombies have to gain enough numbers to actually be a threat. \n\nAnd that means the zombies have to get a kill ratio greater than 1.1:1 in order to have the zombie horde grow. If humans kill more zombies than are made, then this isn't a threat. \n\nBiggest threat to zombies: Organized shield walls with boar spears and rifles.   \nThese troops are kitted out head to toe in anti-riot armor and face masks, with shields. The second rank uses boar spears and rifles. Because the shield wall is organized the zombies will have a kill ratio that is very against them. \n\nNext biggest threat to zombies: Tanks and tracked armored vehicles. I don't care about the guns on these vehicles. Take the tank and drive through the zombie horde. I don't care if the zombies are packed thousands deep. The tank is not going to notice. It will crush all of the zombies in its path, turn around and crush another cluster of them when it drives home.",
   "created_utc": 1692408683,
   "score": 102,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwst9pg",
   "message": "Depends where I was when it first happened. If I was at home, I’d stay there because it’s in the country next to a farm with plenty of access to resources and I’ve got barely any neighbours. \n\nIf I was in a city or a town, I’d try to make it back home but realistically probably die lol.",
   "created_utc": 1692406655,
   "score": 28,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwt4rgr",
   "message": "I know this is the “boring answer”, but I’d just off myself. You know the person in the zombie movie who convinces the leader to let some strange party into the encampment? The “Give them a chance! They look nice!” even though one of them is foaming at the mouth and the others look like they’d shoot you in a heartbeat. That’s me. I know that I am going to see a random schmuck, he’s going to introduce himself as “Orphan slaughterer Steve”, and be I’ll be like “haha! That’s such a wacky nickname! Come inside!” And then everyone in my party is going to get killed in their sleep. I would rather not live in a zombie infested world in the first place, and I would also prefer not taking others down with me, so I will solve that problem by simply not being alive to create it.",
   "created_utc": 1692412018,
   "score": 69,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsvwb5",
   "message": "Die. Why the fuck would I want to spend my time worrying and trying to fight for my life and kill zombies? It seems much more reasonable to just enjoy being alive as long as I can and then embrace becoming a zombie when the time comes.",
   "created_utc": 1692407840,
   "score": 36,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsxa09",
   "message": "Cocaine",
   "created_utc": 1692408471,
   "score": 21,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwstu03",
   "message": "Personally, if my sibling survives, I’d take them, get down to the coast and steal a boat, finding all the important shit along the way. If they didn’t, I’d kill myself- not willing to risk the men.",
   "created_utc": 1692406906,
   "score": 41,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsuf1l",
   "message": "Taste delicious.",
   "created_utc": 1692407170,
   "score": 13,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsvffv",
   "message": "Eat some people.",
   "created_utc": 1692407626,
   "score": 13,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsxcps",
   "message": "I'm fuckin a zombie.",
   "created_utc": 1692408506,
   "score": 35,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwtjnu2",
   "message": "1. Trust no one. Everybody is in survival mode and would do anything to survive.\n\n2. Be discreet, people would tend to fend off people by brandishing their arsenal but on the contrary it would just attract more attention from a bigger and well equipped group. \n\n3. Stay away from groups of people. You wouldn't know the state of mind of each individual. They are vulnerable and capable of making stupid (as they are in very high stress environment) decisions that would endanger everyone. \n\n4. Wait it out, train physically and mentally. The cause of death of the living wouldn't be through zombies anymore, its going to be suicide. Lack of hope and resilience is what is going to kill them.",
   "created_utc": 1692420117,
   "score": 18,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsw8d3",
   "message": "Grab my bugout bag, head to my family cottage then up north where it's freezing cold.",
   "created_utc": 1692407994,
   "score": 15,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwszzx0",
   "message": "Die a bit sooner.  I have congestive heart failure and 2/3rds of my heart is dead scar tissue, so I'm probably not going to be around much longer either way.  I'd be very interested to observe the progress of a zombie apocalypse, but with the probable lack of internet or cable, and my own inability to move much, I wouldn't get to see much of it.  I just now realized I do not own any kind of radio.  \n\nI would mostly worry about my cat.  Humans in general can go ahead and eat each other, that's not much different than how we treat each other now, but I would worry about kitties, especially mine.  He's orange and not especially bright and never goes outside.",
   "created_utc": 1692409742,
   "score": 21,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsv9zf",
   "message": "Oh wow, just did a \"one shot\" with a friend that was essentially this situation. I ended up holding up, waiting for rescue, contacting few people while also preserving. People get unpredictable so I'm concerned with me and mine. Even some of the closest neighbors will worry about just their own",
   "created_utc": 1692407557,
   "score": 11,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsx9ky",
   "message": "Definitely not grab my ar15, definitely not grab my stacks of ammo. Potentially go to the metal fab shop a mile away and use my imaginary welder I might have bought at harbor freight. Construct a Kill doser out of my Chevy Suburban. All hypothetical of course.",
   "created_utc": 1692408466,
   "score": 10,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsy0dj",
   "message": "I would raid every home and then when it ended I would sell the furniture back to people for like triple the price",
   "created_utc": 1692408818,
   "score": 21,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwtjvx7",
   "message": "Wear Ned Kelly armour and attach swords to my arms before allowing myself to be infected, so I can become a boss Zombie.",
   "created_utc": 1692420255,
   "score": 19,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwt9hrp",
   "message": "Go skydiving one last time",
   "created_utc": 1692414376,
   "score": 8,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwt9l13",
   "message": "Go to an island zombies can't even swim",
   "created_utc": 1692414424,
   "score": 6,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwszvo2",
   "message": "Move to Vegas assuming the infection didn’t start in America, if it starts elsewhere and takes more then 10-15 days for it to reach America like how Covid took less then a month but we got news before we started reporting infections then what would essentially happen is the frigid desert and sweltering day of the desert would demolish any walker tryna get to Vegas",
   "created_utc": 1692409688,
   "score": 6,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwt8imd",
   "message": "If it's like world war z then I'm taking myself out but if it's slow moving zombies like in the first season of the walking dead then I'm gonna take myself out still",
   "created_utc": 1692413873,
   "score": 11,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwt9f9a",
   "message": "I live in the woods so the zombie population would be low hopefully, band together with my neighbors to defend ourselves and share resources and knowledge, avoid high population areas by hunting for food and getting water from the river, wait until the winter for all the zombies to freeze.",
   "created_utc": 1692414340,
   "score": 7,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwstdn8",
   "message": "Load up my campervan full of long life food/MRE's, water purification tablets and such, then head off somewhere remote for a couple of months while you all kill each other over the last packets of ramen at the local grocery store.",
   "created_utc": 1692406705,
   "score": 10,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwstvau",
   "message": "I always felt that living in an apartment was beneficial to avoiding zombies. So chill in the crib until food runs out then attempt to scavenge",
   "created_utc": 1692406922,
   "score": 10,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsw6jx",
   "message": "Move to an island. Assuming I actually want to live. Might just kill myself too if civilization had fallen and I was all alone.",
   "created_utc": 1692407971,
   "score": 14,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsygxp",
   "message": "I’d hide amongst trump supporters. No brains to eat, so zombies would steer away.",
   "created_utc": 1692409030,
   "score": 29,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsv6yf",
   "message": "Probably die because I have arthritis in my knees too bad to run and I'll eventually run out of bullets. Can't see myself going full Shawn of the Dead with a bat and surviving for long.",
   "created_utc": 1692407519,
   "score": 6,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsx1lx",
   "message": "I would rob a pharmacy. The rest I wouldn’t care",
   "created_utc": 1692408363,
   "score": 13,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwt6c8y",
   "message": "Step 1: stay where you are and barricade yourself. People are more dangerous than zombies. Especially scared and stupid people. Avoid people best you can. Do not go to stores or places you think you will be safe. Other people have the same idea and will flock to those locations. Your current location is best. \n\nStep 2: gather as much supplies in your location as you can and get to the roof or higher floors. Fill as many containers as you can with water. City water won't last long and water is the biggest factor for how long you can stay where you are.\n\nStep 3: when things start getting quiet, slowly explore your surrounding are for more supplies to bring back to your shelter. You want minimal movement and to stay in one familiar spot as long as you can.\n\nStep 4: when you have exhausted all supplies, head towards the nearest military base. Movies always show them being ineffective but in reality they are well armed, well trained, and have a defined chain of command. It is your best chance to find other people safely",
   "created_utc": 1692412791,
   "score": 13,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwt96xk",
   "message": "Hope a nuke hits at some point.",
   "created_utc": 1692414223,
   "score": 3,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwtk8yx",
   "message": "Probably black tar heroin.",
   "created_utc": 1692420482,
   "score": 3,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwtof5u",
   "message": "Steal a yacht and load it with supplies. Living just anchored off shore so I can come back into town for supplies as needed but could sleep in peace",
   "created_utc": 1692423188,
   "score": 7,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwtqnn8",
   "message": "I’d finally get a day off of work.",
   "created_utc": 1692424733,
   "score": 7,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwszryn",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwt05oa",
   "message": "Kill my neighbors, immediately, before they eat all their food.\n\nBooby trap their houses so I am surrounded with a deadly maze.",
   "created_utc": 1692409817,
   "score": 6,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwu4qju",
   "message": "Get my hands on makeup kit, disguise myself as zombie and just blend in. Ill catch up with their speed soon after knowing how fast they are. Slow, medium, fast, whatever. Ill catch up.",
   "created_utc": 1692435668,
   "score": 7,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwsyrlb",
   "message": "Have you gone out in public lately? The zombie apocalypse is already here.",
   "created_utc": 1692409166,
   "score": 6,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwt9dff",
   "message": "I would just kill myself. Nothing much is worth living for as is so a zombie apocalypse would definitely push me over the edge",
   "created_utc": 1692414314,
   "score": 4,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwtpqaf",
   "message": "All I can say is that blades don’t need reloading so I’m securing a sword STAT.",
   "created_utc": 1692424090,
   "score": 3,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwtwh2z",
   "message": "Dying and I'm making sure it's to zombies. I don't trust people in an apocalypse, whether my body is dead or alive.",
   "created_utc": 1692429040,
   "score": 5,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwu0o3d",
   "message": "Zombies are only the immediate danger. The real danger is the second word there, apocalypse. Society collapsing means many things will soon become unavailable or, to use a term from Snowpiercer, extinct. You need to not spend your first days to months 100% securing a safe zone, when 75% will do with the ability to react to failure.  \n  \nWhat you really need to do is secure resources and if possible people that can't be replaced and will vanish quickly. Do you have live yeast in the house? What documents have you downloaded? Can you make sodium bicarbonate? A new battery? The ability to produce is a priority over resources; the cans arent going anywhere. If you can't produce, find someone who can, and nab them. This has the added benefit of securing human resources.  \n  \nDo you know anyone who is going to be on the radio? Constructing a communication network will be easiest while all the existing networks are still active. Having a crank ham radio will be super useless unless you know someone else will be listening in on your band and frequency at your time, otherwise you'll all be turning your radios on at different half hour intervals to talk to dead air. Forget hearing word from the other coast, you'll be alone.  \nThe basic gist is examine your life and list the things in it you need to live without difficulty that takes a running society to produce. Save those first, immediately. Keep them viable. Hope whatever you missed, someone else didn't. Make special effort to maintain communication for this purpose. Also don't flee to the country. The frontier was killing humans who knew what they were doing out there before even scary stories existed.",
   "created_utc": 1692432383,
   "score": 5,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwu8zo1",
   "message": "Kill myself, doesn't matter what type of zombie is. I don't want to deal with that shit",
   "created_utc": 1692439035,
   "score": 4,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwu95lg",
   "message": "Probably die. As would most people. Everyone on here assuming you’d be in the small portion of survivors, why?\n\nAlso, how many of you have knowledge in medicine, food/water procurement and processing, building maintenance and repair, small unit tactics (you’re not going to be a lone wanderer a-la-Fallout).\n\nMost all of, if not all of us, would die. That’s what we’d do if the zombie apocalypse came.",
   "created_utc": 1692439165,
   "score": 3,
   "submission_id": "15v1ux6"
  },
  {
   "comment_id": "jwub5h1",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15v1ux6"
  }
 ]
}