{
 "submission_id": "15vbiv9",
 "title": "What’s the weirdest thing someone’s ever asked you to do in the bed?",
 "selftext": "",
 "created_utc": 1692437299,
 "permalink": "/r/AskReddit/comments/15vbiv9/whats_the_weirdest_thing_someones_ever_asked_you/",
 "score": 41,
 "url": "https://www.reddit.com/r/AskReddit/comments/15vbiv9/whats_the_weirdest_thing_someones_ever_asked_you/",
 "comments": [
  {
   "comment_id": "jwupz2u",
   "message": "This didn’t happen to me personally but a girl I was dating told me about her ex boyfriend who had a “pie” fetish. Basically he got really horny from hitting her in the face with a pie and having sex right after. \n\nHe even had rules though. Like it needed to be a whipped cream pie and it needed to be a surprise or it didn’t get him as hot. So at the end stages of their relationship he’s popping out of nowhere with a pie to the face. She said it got to the point she was always looking around for pie lol.",
   "created_utc": 1692449763,
   "score": 0,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwukr87",
   "message": "I can do a very accurate voice if the gingerbread cookie from Shrek and once my ex gf found out that’s the only voice I was allowed to have sex in…. It was funny the first time until I realized she genuinely got off from it. Kinda creeped me oht",
   "created_utc": 1692447021,
   "score": 195,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwun6o6",
   "message": "She wanted to call me daddy\n\nWell dad\n\nWell her fathers name",
   "created_utc": 1692448330,
   "score": 202,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuji89",
   "message": "Some chick wanted me to\nPunch her in the side of her head as we fucked. I said noooooo",
   "created_utc": 1692446314,
   "score": 32,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuyzhf",
   "message": "I feel like someone with multiple weird kinks is scrolling around just jerking his/her shit off",
   "created_utc": 1692453914,
   "score": 75,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwurshs",
   "message": "I once had a girl get up in the middle of a long session and run to the fridge. I hear the door open and close quickly and she runs back to the bedroom and throws herself on the bed. As she lays down she looks at me and says, “Fuck me real quick. I put ice cubes in my vagina.”",
   "created_utc": 1692450644,
   "score": 60,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuyv84",
   "message": "This whole experience is just wild for me and sometimes I think it was just a dream.\n\nMy ex wanted to give me head while I was taking a shit. She knew I have Crohn's and a lot of other bowel related issues. \n\nShe wanted to anyway (her fantasy for some reason) and it turned into fucking while shitting but then it turned into a regular thing. I just got my first apartment moving out of my fathers and she would stay often. It was really an adventure because I could almost never shit without cumming when she was around.\n\nSometimes this would offset bowel movement pain and help and sometimes the other way making it feel worse.\n\nWe broke 2 toilets and the first one the landlord replaced and the second I did. \n\nI vividly remember one time I was having a severe flare up with my Crohn's and I told her I was in too much pain. Needless to say I never came harder in my life while in that much pain. It is what I imagine a heart attack while cumming would feel like but only the heart attack is in your anus.\n\n\nI swear still to this day I get hard almost every time sitting on the toilet. My wife now is pretty wild but, she even says that's a crazy story.",
   "created_utc": 1692453864,
   "score": 12,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwulst9",
   "message": "We were on our first spend the night together with a girl I was dating, as I was starting to fall asleep she inquired if I would be okay with her dry humping me while I slept.",
   "created_utc": 1692447599,
   "score": 122,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwu8fv7",
   "message": "Once had a gf who asked me to punch her",
   "created_utc": 1692438598,
   "score": 94,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuw9xr",
   "message": "My ex wanted me to bully him like Disney channel bully. He asked me to fuck him while I dunked his head in the toilet",
   "created_utc": 1692452741,
   "score": 68,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwupxwi",
   "message": "Dress up like Velma from Scooby Doo and crawl around looking for my glasses.",
   "created_utc": 1692449747,
   "score": 74,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwubuop",
   "message": "Wear a motorcycle crash helmet.",
   "created_utc": 1692441264,
   "score": 241,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwug8of",
   "message": "I feel like I've probably asked for the weirdest thing I've done sexually. As for a partner asking me, she didn't ask exactly, but my ex could squirt a lot during a sexual session, and she had a thing for her own squirt and once I gathered some in my mouth and spit it into her mouth and it drove her wild. She said it was her favorite thing that any guy had ever done with her before. It was incredibly hot and became a fun little treat she got occasionally.",
   "created_utc": 1692444288,
   "score": 69,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwupyg0",
   "message": "She wanted me to take the condom off and bust inside her after the first time we met. When i refused she started telling me to pee on her, fist her, shit on her, beat the shit out of her. She would try getting me to do all those through out I ended up not being able to keep it up and just told her to leave",
   "created_utc": 1692449755,
   "score": 160,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwu7cs4",
   "message": "Guy on grindr wanted me to shit in his high-heeled rubber boots and then stuff them with mud while he was wearing them, so it'd be extra squishy. I'm a pretty kinky person, but that was a hard nope.",
   "created_utc": 1692437737,
   "score": 79,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwu7j8y",
   "message": "someone wanted to lick my nose. like suck on the nostrils.",
   "created_utc": 1692437876,
   "score": 88,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuddio",
   "message": "I once had a date from tinder ask me if he could record us fucking. Initially I was like oh sure, kinky. But then he followed it up with “so I can show my parents I actually had sex.” I was like uhhhh yeah, gotta go. 😅",
   "created_utc": 1692442378,
   "score": 42,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwu8mnc",
   "message": "Call her by her sisters name and degrade her.",
   "created_utc": 1692438748,
   "score": 249,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvimp2",
   "message": "Technically not in bed, but in the shower: wanted me to pee in her. Not on her, but in her. It was surprisingly hard to do, but I found out it basically instantly made her cum without any other stimulation, so I got semi-decent at it.",
   "created_utc": 1692461825,
   "score": 66,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuslg4",
   "message": "Spit in her mouth, then make a loop of my belt and choke her with it while I fucked her ass.",
   "created_utc": 1692451033,
   "score": 159,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuwd9b",
   "message": "He wanted me to call my mum and speak to her on the phone while he had sex with me",
   "created_utc": 1692452784,
   "score": 108,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwudo7r",
   "message": "Step on her head during doggy",
   "created_utc": 1692442585,
   "score": 197,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuq32l",
   "message": "One girl wanted me to take a knife and \"gently\" cut her during the sex (i wish i was joking) she was into BDSM but didn't expect this shit , obviously i said no to that.So she told me to slap her with my belt.",
   "created_utc": 1692449819,
   "score": 171,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwu9m73",
   "message": "Shout out to the fairly normal/vanilla people in this comments thread exploring light ass and toy play for the first time- and the gentle souls not roasting them for it. Sometimes I love Reddit.\n\n(Also some of these responses are wild and did not disappoint lol)",
   "created_utc": 1692439525,
   "score": 67,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwufmyt",
   "message": "Met a girl who wanted me to bang her whilst degrading/humiliating her black bf in a racially abusive way. Now, i know some people are into stuff like that and i don't want to kink shame anyone but fuck that noise.",
   "created_utc": 1692443906,
   "score": 168,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuswlm",
   "message": "A woman I was chatting to on a dating site asked me to fulfill her fantasy.\n\nShe wanted me to drive over to her house one night, find my way to her bedroom and eat her pussy whilst she was asleep (or pretended to be) and absolutely nothing more.\n\nShe came (squirter too - that was a shock, I was unprepared) and left with a raging stiffy and blue balls. \n\nBut it was fun. Met her the next day as the relief teacher for my daughter's class at school.",
   "created_utc": 1692451182,
   "score": 252,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuhuft",
   "message": "She wanted me to pee in her mouth.",
   "created_utc": 1692445317,
   "score": 69,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwup0de",
   "message": "Someone put half my foot in her mouth. Another always pushed porn on her phone in my face while she gave me a BJ. Not necessarily strange but like….why?",
   "created_utc": 1692449279,
   "score": 235,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwupax4",
   "message": "He wanted to lick my eyeballs. And put his dick in my eyes. Nope. 😭",
   "created_utc": 1692449428,
   "score": 134,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuc452",
   "message": "A girl I met online told me she had a burp fetish. I thought she was trolling me at first because she wanted me to burp in voice recordings I sent her. I kinda just went along with it and then I realized she actually wanted to meet, I chose a public place for precautions because it all felt weird, I mean almost all our conversations were about burping.. but hey i thought she was cute and I hadn’t had women attention for awhile. We started hooking up and her routine was having me drink cups of highly carbonated sodas before sex and you can fill in the rest.. after awhile it felt fucked and it made me feel even degraded at a point so that ship sank",
   "created_utc": 1692441453,
   "score": 64,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwu9yx9",
   "message": "I was on top riding him when I knew that if I didn't leave now I wasn't going to make it to the bathroom in time.  \n\"I'll be right back,\" I said, starting to ease off of him.  \nHe smiled wryly and gently pushed me back down on his cock.  \n\"You're not going anywhere until I cum.\"  \n\"I have to pee,\" I urgently shout-whispered, \"do you want pee on your dick?\" My fault was in thinking this was obviously rhetorical.  \nAs an answer, all gentleness disappeared as he quickly looped his arms across my back, hands pulling down on my shoulders. Still smiling widely, he began thrusting, deeply, forcefully, methodically. \"What the fuck is going on here,\" I thought to myself. Barely holding on to control, I weakly asked, \"Are you sure?\"  \n\"I want your piss all over me.\"  \n\"What the hell,\" I thought again, \"I've got it, he wants it, why not?\"  \nOn the next thrust, his dick hit what could have only been my pee release valve. The first little dribble came out and he went wild, quickening his pace and manically hitting the spot over and over again while the full stream flowed out. I felt amazing relief, like that moment when you are peeing in a dream right before you wake up and realize you wet the bed, only I was peeing all over an actual person and I wasn't going to have to clean it up because it wasn't my room.  \nHe came like crazy.  \nHe really liked pee sex and we did it a couple more times after that. When I was upset with him, he would offer it up as a sort of apology. \"C'mon, I've been a real big prick. Just take a piss on me and you'll feel much better!\" He was a total headcase, but really experimental in bed. I'm not with him anymore and my life is much better for it, but sometimes I kind of miss getting weird.",
   "created_utc": 1692439797,
   "score": 208,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwu6ygg",
   "message": "My ex girlfriend said her hottest fantasy is to f\\*\\*\\* me with a dildo. We tried and it was very hot. Then it was my turn to anal her.",
   "created_utc": 1692437418,
   "score": 183,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvho7w",
   "message": "Nothing too weird, just to smack her hard in the face, spit in her eyes and threaten to burn her house down.  The the thing is she was the first woman I had sex with and I thought all women were in to that. The next person I slept with was pretty pissed off.",
   "created_utc": 1692461443,
   "score": 18,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuvfyj",
   "message": "My ex has a fart and feet fetish but the fart fetish was what really made it weird as he would beg and get upset every time I wouldn't tell him I was going to fart. He also would incorporate it into sex constantly as well as with his feet fetish to the point where it wasn't fun for me because everything was catered to him.",
   "created_utc": 1692452368,
   "score": 125,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvdyau",
   "message": "My ex wanted me to fuck her while we were swimming in the lake at her parents cottage, in the middle of the day.\n\nI’m not an exhibitionist, but didn’t mind trying per se…but this was the early 90’d before “shrinkage” entered the mainstream lexicon.  Needless to say, the cold water made getting and staying hard enough to enter her a challenge.\n\nOn the bright side I got to try and shoot pool with a rope, so that’s nice.",
   "created_utc": 1692459983,
   "score": 119,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvoknv",
   "message": "I was seeing a girl who did a fairly accurate impression of Bobby Hill, and I do a good Hank Hill. So we would do dirty talk as Hank and Bobby.",
   "created_utc": 1692464079,
   "score": 149,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwud12e",
   "message": "To pick a lot candle and drop all the burning wax on top of her whilst on missionary position and after that fist her both holes at the same time. Was a bit too much at the time",
   "created_utc": 1692442141,
   "score": 24,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwu9lft",
   "message": "To try sex on her period, I was afraid it would make her cramps worse and she was wondering if it would make them better",
   "created_utc": 1692439510,
   "score": 180,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwusijq",
   "message": "Choking and being mean and saying mean shit to them, I could never do it, absolutely not my thing, zero interest in that shit",
   "created_utc": 1692450995,
   "score": 59,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jww10nf",
   "message": "She didn't ask, per say, but she had a full on conversation with my dick, with me supplying the voice for my cock.  \nI had her so enthralled that she did not look at me during the conversation, but was looking directly at my penis the whole time, as if she truly believed it was speaking to her.  \n\n\nShe ended the conversation with the line, \"I'm not going to lose a discussion with a dick, cause you cant talk while you are in my mouth.\"  \n\n\nI kept my mouth closed and said, \"Wanna BET?!\"  She laughed so hard she almost peed herself.  After going to the bathroom, she asked my penis to marry her, and then she asked me, too.",
   "created_utc": 1692468689,
   "score": 81,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwu7zkz",
   "message": "Lmao easy. Put my hands on her neck and told me to choke he.then moved my hand to her ass and pushed my finger in. Then asked me \"where are your fingers\". Lol.",
   "created_utc": 1692438244,
   "score": 201,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwulsiu",
   "message": "Well not that weird but mid-way through sex, as he was pounding, he asked me whats my body count.",
   "created_utc": 1692447594,
   "score": 155,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwumiub",
   "message": "Well, for starters they actually wanted me there.",
   "created_utc": 1692447985,
   "score": 185,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuwv37",
   "message": "Punch her in the face. And, No.",
   "created_utc": 1692453010,
   "score": 42,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwv7mja",
   "message": "Girl asked me to cover her mouth and nose with a pillow to muffle noises.",
   "created_utc": 1692457480,
   "score": 57,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwv4kzt",
   "message": "So I'm Swedish but my English is on basically a first language level and my accent is very slight; few people have been able to guess where I'm from when they meet me. I slept with an English-speaking guy a couple of years ago and he wanted me to like... speak bad English on purpose with an obvious Swedish accent in bed. I genuinely tried but couldn't stop laughing so I think we just stopped and I sucked him off instead so that I could shut up. We did not see each other again as he felt I'd laughed at *him*.",
   "created_utc": 1692456254,
   "score": 83,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvprdv",
   "message": "I was with a girl who was actually into the porn trope of being lightly spanked. As in literally bending over my lap and wanting some good stinging whacks across the bottom.\n\nI wasn't into that myself but her reaction showed she wasn't lying, it was definitely a fun time after.",
   "created_utc": 1692464512,
   "score": 60,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwu8bmr",
   "message": "She asked if she could take a shit on me, saying it's one of her fetishes. Dude, seriously, it grossed the fuck outta me. Then, a few months down the line, caught her cheating with this another guy. Even after I was nice enough to forgive her the first time. So I was just like, \"Nah, I'm outta here, no way I am putting up with that.\"",
   "created_utc": 1692438508,
   "score": 148,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwu9hlt",
   "message": "I had a guy who wanted me to wear nylons so he could rip them open. I know it's a fetish, and I am not judging. But it's definitely the most unique thing that has been requested of me. We never did it.",
   "created_utc": 1692439428,
   "score": 250,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuo3w3",
   "message": "\"Spit in my mouth then tell me its my fault\"",
   "created_utc": 1692448816,
   "score": 53,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwutknf",
   "message": "I had an ex ask if I wanted to try shitting on her. I did not oblige.",
   "created_utc": 1692451500,
   "score": 42,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwv1wo0",
   "message": "After a long vacation with my family, I went back to her place and she was already in heat so we started as soon as I walked in. After removing all my clothes I forgot to remove the socks, which apparently was such a great experience for her that she won't have sex without me having my socks on.... It's not that big of a deal, just a little weird...",
   "created_utc": 1692455155,
   "score": 22,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwv33d6",
   "message": "This older guy I met on sniffies with a pretty huge dick came around to my place a few times to just sit back on my couch while I sucked him off. He wanted me to basically alternate between sucking/deepthroating him and chewing on/biting his dick. Like, to the point I knew I would not enjoy it if somebody was that rough with my junk but the feel of my teeth clenching his shaft made him so hard. I loved getting to have my way with all that meat but I really wished he wasn't into the teeth, it just felt super weird to me",
   "created_utc": 1692455647,
   "score": 35,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvbbvv",
   "message": "Change a diaper she put on and shit in.",
   "created_utc": 1692458929,
   "score": 47,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvkgkc",
   "message": "I hooked up with a girl once who was into pain. We had met that night at a party and she took me home to her place to bang. Midway through our “exercise” she got this weird look on her face, leaned up and bit me on the shoulder. HARD. It hurt. Instinctively I kind slapped her ear. She smiled and sighed and started fucking harder. I’m not sure how weird masochism is, but it was a first for me.",
   "created_utc": 1692462524,
   "score": 49,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuwn87",
   "message": "Can my sister watch and participate ? \n\nThey were beautiful women and I'm a basic man... so guess my answer",
   "created_utc": 1692452912,
   "score": 102,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuoqcb",
   "message": "She wondered if I wouldn't mind fucking her gay twin brother. Was pretty weird thing to ask post-sex as we smoked a joint. 🤣",
   "created_utc": 1692449134,
   "score": 65,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvhx0q",
   "message": "This was not a request, per se, but I had been on a few dates with a woman and we wound up back at her place, ostensibly to hook up for the first time. So we get into it, move to her bed, clothes come off, and then I casually ask her what she’s into. And she goes DEEP into her kink list. For a woman who seemed relatively modest, I was a bit surprised- she was into sex clubs, rope play, impact play. All of which IMO are totally fine! Not really my thing, but no judgment from me.\n\n\nI was more curious than aroused at this point, so I was like “how far have you gone with this?” She told me the hottest thing that had ever happened to her was that she went to a sex club, got flogged, and then had a man break a phone book over her back. “Couldn’t walk right for a week.” Again, no shame to that, but I told her straight up I just do not have the level of aggression needed to do that.\n\n\nThe evening ended with me telling her I was pretty sure we were not going to have much sexual chemistry, but that I liked her personally and would be content to be her friend…. She did not take me up on the offer.",
   "created_utc": 1692461542,
   "score": 87,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvprlv",
   "message": "My ex wanted me to act like a farmers help seducing her the maid. I mean it ain’t weird like piss in my eye while singing sweet home Alabama but I was not into that but I like sex so I had to be all like: “so been tough in the house today? Yeah I’ve been out in the fields. Building a fence. Sure it was sweaty.” It felt weird my friends. But I delivered a decent performance.",
   "created_utc": 1692464514,
   "score": 69,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwupzci",
   "message": "My wife can squirt. Squirt is mostly piss. She really only does is from being fingered. I like being down there and really want her to squirt on my face. Well it doesn't come out like it does in porn. It doesn't blow a hole in the ceiling going Mach 5. It sort of just gushes out real slow. Obviously my face would have to be RIGHT there at the exact time. I've been close but it has zero range. I was getting really frustrated I guess? with the lack of squirt on my face so I asked if she would just pee on me. She said no and after I thought about it I doubt I'd be in to it. She's never asked me to do anything weirder than to tie her up. She's pretty vanilla and I'm the weird one.",
   "created_utc": 1692449766,
   "score": 115,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvrzli",
   "message": "An old boss of mine was in town for a conference and invited me over to her hotel room. She and I used to fool around back when she was my boss in DC and before she had moved to NYC.\n\nA little backstory: I wasn’t attracted to her at all when we first met so I had told her I liked to be fisted to hopefully scare her off and stop perusing me. Instead, she said she’d always wanted to do that to a guy. Me, being a huge fan of a good fisting, said “fuck it” and a months long fling began. I would come into work after a morning enema and she would pull me into the managers office and pound my ass. We would go into the stock room or into some other secluded area, or even stay late. It was the most sexually fulfilled I’ve ever been in my life. She got really into it and would buy me butt plugs and make me wear them throughout the workday, only she was allowed to remove them, and then she’d always pound me hard before sucking me off.  She also never asked me to reciprocate but I did many times. Anyway, we went our separate ways when I got promoted and we both moved to other locations.\n\nWe hadn’t seen each other for a year or longer when she called me and invited me to the hotel I mentioned in the first paragraph.\n\nI wasn’t expecting any action so I did not prepare (enema). I figured maybe we would go grab food and catch up. If things got physical we could always take time for me to clean out. I was wrong, when she opened the hotel door she was already putting on a glove and smiling deviously. I told her I hadn’t cleaned out yet and she said she didn’t care. She threw me down on the bed and removed my shoes, pants, and underwear. I told her this could get messy and she said she didn’t care. Laid a few towels down and made me lay down on them.\n\nShe proceeded to fist fuck me deep and hard and, as I predicted, it was disgustingly messy. I’m not going to get into details, I’m sure you can imagine. But she went at it for a good half hour before sucking me off and telling me to go shower. She threw the towels in the trash and we went to TGI Fridays like nothing disgusting had just happened.\n\nWe went our separate ways again, she went back home to NYC. She got married a few years later and we never hooked up again. I missed her intensity and dedication to the art of fisting, but the last shitty session may have ruined everything between us.",
   "created_utc": 1692465348,
   "score": 14,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwv03c3",
   "message": "Someone once asked me to “fuck their pussy” \n\nBut they did not have a pussy.",
   "created_utc": 1692454394,
   "score": 73,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvc2gz",
   "message": "A few girls have asked me to tie them up, one asked me to 🔪 her.. hard pass every time",
   "created_utc": 1692459221,
   "score": 14,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuubzb",
   "message": "Step on his balls while wearing high heels",
   "created_utc": 1692451856,
   "score": 51,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwu98qn",
   "message": "Every person has some weird fantasies. I can't really rank them but since I also call myself \"the Indiana Jones of sex\" because I like exploring various fetishes here are some fetishes I acted upon:\n\n- cucking another guy (honestly was one of the most awkward experiences because I couldn't really get off from the thought that he actually asked me to do it)\n\n- being tied and cucked by another guy while my partner and the other person role-played a rape scene in front of me\n\n- using a girl as a human toilet",
   "created_utc": 1692439233,
   "score": 131,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuee0c",
   "message": "She asked me to piss in her mouth, while face fucking...i never kink shame anyone, but that shocked me",
   "created_utc": 1692443076,
   "score": 58,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvr7f5",
   "message": "I hooked up with this famous tennis player one time and man…. He asked me to take my abs and put them on his and he wanted me to… breath my abs into his. We did this for like an hour and the entire time the guy was rock hard. Only after that did we actually start fucking lmao. He found other peoples abs so hot that he actually loved feeling them on his own. He was *really* hot though so I just went along with it. 🤣",
   "created_utc": 1692465056,
   "score": 11,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwv9ewy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwuob1e",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvdssh",
   "message": "I slept with a woman who, whilst eating her out like a normal person would, asked me to and i quote \"gnaw on my clit! Chew on my pussy!\"",
   "created_utc": 1692459924,
   "score": 21,
   "submission_id": "15vbiv9"
  },
  {
   "comment_id": "jwvza79",
   "message": "This is back when I was my leanest, shreddiest physique.\n\nI was hooking up with a pole dance instructor, and one time I came, but she wasn't finished yet. So she asked me to kneel between her legs and flex and pose while she masturbated.\n\n100% IRL objectification, and it was wonderful. I went through several different bodybuilding poses naked, she touched herself and got off. A good time was had by all :)",
   "created_utc": 1692468064,
   "score": 17,
   "submission_id": "15vbiv9"
  }
 ]
}