{
 "submission_id": "15vipud",
 "title": "Do you have any scars, if so, what from?",
 "selftext": "",
 "created_utc": 1692457717,
 "permalink": "/r/AskReddit/comments/15vipud/do_you_have_any_scars_if_so_what_from/",
 "score": 250,
 "url": "https://www.reddit.com/r/AskReddit/comments/15vipud/do_you_have_any_scars_if_so_what_from/",
 "comments": [
  {
   "comment_id": "jwv9gqu",
   "message": "I have a 3/4,\" almost perfectly straight scar at the base of my left index finger, just in front of the knuckle. It's still very visible today and I'm nearly 50 years old.\n\nThat was from the first five minutes with my first pocketknife when I was eight years old.",
   "created_utc": 1692458213,
   "score": 6,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvhhnh",
   "message": "I twisted the head off of my sister's baby doll.\n\nshe hit me in the head with a garden hoe.\n\n11 stitches",
   "created_utc": 1692461371,
   "score": 33,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwveyem",
   "message": "I have one on my forehead about an inch long horizontal, I was a c-section baby doctor got too close and got me with the scalpel.",
   "created_utc": 1692460370,
   "score": 172,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvbmnl",
   "message": "I have many but my favorite one is the one my sister gave me from smashing a glass cup in my face. I got 32 stitches from it and it’s a reminder every time I look in the mirror of how much I miss her. She passed away after giving birth to my nephew. \n\nI think about her all the time.",
   "created_utc": 1692459047,
   "score": 111,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvbvbu",
   "message": "Many. \n\nOn my thigh from cutting it open while playing as a kid,\n\nBelly from appendix, and gallbladder surgery.\n\nKnee from surgery.\n\nHand/arm from my kitty.  \n\nFace from being a “picker” and suffering from pimples even as an adult. \n\nUpper arm from birth control.",
   "created_utc": 1692459141,
   "score": 132,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwv8bq3",
   "message": "wanna know how I got these scars?",
   "created_utc": 1692457760,
   "score": 235,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvftng",
   "message": "I have a scar (covered by my hair, but there) that stretches from ear to ear in a jagged line across the top of my head. On July 4th, 2000 I was at Venice Beach in Florida when I hit my head against a pier with a nail sticking out. The nail grabbed my scalp and pulled it back, effectively almost scalping me. Being a head wound, blood loss was insane, and I was afraid that I was going to die (I was just 13 at the time, so it was even more terrifying). To this day, I can still feel the scar. I would love to find somebody that was there that day (not in my family) to get their account of how it went down. I have mine and a few family members' accounts, but, a stranger's account would be really interesting to hear. Maybe I should make a post just for that?\r  \n\r  \nHere is a photo of my head 2 weeks after the accident. I had to wear a bandage turban for close to a month afterwards, and started class at a new school that fall with a strange haircut and visible scar.\r  \n\r  \ntl;dr almost scalped 38 stitches and 8 staples.",
   "created_utc": 1692460702,
   "score": 51,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvhlmy",
   "message": "I got alot from selfharm, some from random accidents and some from fights",
   "created_utc": 1692461414,
   "score": 214,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvvbww",
   "message": "I have an epic papercut scar.",
   "created_utc": 1692466605,
   "score": 44,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvg28v",
   "message": "I have one on my foot from a misstep while changing a Zamboni blade.",
   "created_utc": 1692460800,
   "score": 41,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jww7kir",
   "message": "I have a big ol' scar along my right forearm from defending against a knife attack.\n\nWhen I was young I was really abused and my aunt locked me in a closet for roughly 2 weeks. Eventually I broke out and made a run for it, and as I was turning the corner to the kitchen and toward the door, her son (he was like 19 at the time, I was 13) was unloading the dishwasher. He was holding a knife already and when he saw me, he slashed at me. I shielded it with my arm and tore out of the house and down the street. Eventually passed out on the road side and some random guy picked me up while I was unconscious. He was a firefighter and I was really lucky. Drove me to the hospital.",
   "created_utc": 1692470989,
   "score": 64,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvpa7h",
   "message": "Heart surgery. 3 scars  Two surgeries \n \n\nBegin bit. 1 scar\n \n\nBegin stabbed. 1 scar\n\n\nBiopsy. scar 1",
   "created_utc": 1692464336,
   "score": 30,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvoyld",
   "message": "Sledding head first into a barbed wire fence.",
   "created_utc": 1692464221,
   "score": 25,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvqos7",
   "message": "Mostly my arms, I look like a cutter but I'm just a dog groomer.   from excited dogs. Dogs not wanting their nails done and they try to claw away.  Or anti bath/water dogs.",
   "created_utc": 1692464863,
   "score": 29,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvqvy2",
   "message": "I had a fuck ton on my legs due to *falling down the stairs when I was 8* and *tripping over a metal grid thing*",
   "created_utc": 1692464939,
   "score": 29,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvq41s",
   "message": "I probably don’t need to explain the ones on my wrist",
   "created_utc": 1692464644,
   "score": 95,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvsglo",
   "message": "One giant scar down my chest due to having open heart surgery as a 2 year old.",
   "created_utc": 1692465532,
   "score": 19,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvstn1",
   "message": "Acne",
   "created_utc": 1692465668,
   "score": 20,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvsvs9",
   "message": "Having 14 titanium plates placed against my shattered ribs after a wreck",
   "created_utc": 1692465689,
   "score": 23,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvknyt",
   "message": "Now there's this game I played as a teenager called 'Bloody Knuckles'.\n\nYou and your opponent sit across a table from each other and using a coin, fling it to the other persons knuckles. The aim is to outlast the other, i have many scars from such games but I was UNDEFEATED!",
   "created_utc": 1692462605,
   "score": 19,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvtwju",
   "message": "Got run over by a chariot",
   "created_utc": 1692466075,
   "score": 33,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvj2zt",
   "message": "Bigass scar across my tongue, deep enough to lodge my top teeth into it.\n\nWhen I was ~4-5yo I was jumping around on the couch, fell and smashed my jaw on the coffee table.  Almost bit my tongue clear off.",
   "created_utc": 1692461997,
   "score": 15,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvf393",
   "message": "I have a few from my surly Siamese-mix. He has no qualms about using violence to get his way.",
   "created_utc": 1692460421,
   "score": 14,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvp0m2",
   "message": "I have on my eyebrow. It's long faded and since hairs don't grow there, people sometimes think I shaved a line into it to be super edgy and fashionable or whatever. The truth is that I tried to climb a book shelf when I was a very young kid and the whole thing fell over on top of me 🤷",
   "created_utc": 1692464241,
   "score": 14,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvkfud",
   "message": "My emergency appendectomy scar looks like a took an axe to the guts.",
   "created_utc": 1692462517,
   "score": 13,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwv8zjx",
   "message": "A perfect tiger 3 claw mark scar on my shoulder, it wouldn’t technically be wrong to say I was  clawed by a tiger, I’ll leave it at that.",
   "created_utc": 1692458023,
   "score": 22,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwve8wl",
   "message": "I have a scar running across my knee from my dog when he was a puppy. He was super hyper and jumped up and hugged my leg but didn't grip very well, so he slid back down and both his dewclaws dragged down my leg, creating two really long cuts running across each other. One of them started bleeding and that's the one that scarred. I actually really like that scar tbh.",
   "created_utc": 1692460098,
   "score": 27,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvjdc9",
   "message": "A lot from skateboarding. One from jumping over a fence with spike at the top of it…. One caught my wrist and sliced through it like butter.",
   "created_utc": 1692462105,
   "score": 11,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvalbx",
   "message": "Yes. Naruto running.",
   "created_utc": 1692458646,
   "score": 28,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvsim4",
   "message": "SELF\nHARM",
   "created_utc": 1692465554,
   "score": 52,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvb6uc",
   "message": "Are you including mental scars?",
   "created_utc": 1692458875,
   "score": 42,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvt0n2",
   "message": "52 yo male, former military, former cop, oilfield worker and industrial maintenance mechanic here. I have literally been, shot, stabbed, burned, electrocuted,  and hit by cars on 3 separate occasions. So, ya I have a few scars.",
   "created_utc": 1692465739,
   "score": 13,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvbglk",
   "message": "Got one on my right ear from a kid biting me in a fight when I was younger. Have a faint gash scar across my outer right eye from getting hit with a wooden bat.",
   "created_utc": 1692458981,
   "score": 6,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvj0ng",
   "message": "One on the side of my head from falling off a skateboard and splitting it open.  7 stitches.\n\nOne on my eyebrow from a headbutt, 8 stitches.\n\nOne under my lip, a work accident led to me putting my lower teeth through my lip, needed 16 stitches for this one.\n\nI have anywhere from 10 - 20 more on my arms, hands and legs, some with stories, some I forgot how I got.",
   "created_utc": 1692461972,
   "score": 7,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvjq2q",
   "message": "One on my left wrist that runs alongside my artery, I fell through a window when I was 7.\n\nTwo on my left index finger, both times cut with a utility knife (one at 11, one at 14)\n\nOne on my left elbow (got hit by a car while cycling at 15)\n\nOne on my left heel (stepped into a piece of glass at 13)\n\nOne on my neck, two on my back (from having moles removed at 21, 26 and 30)\n\nAlmost forgot, my right ring finger is deformed cause I almost lost the tip once (it got smushed between a door at 3)\n\nEdit: forgot the last one",
   "created_utc": 1692462241,
   "score": 7,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvlgu1",
   "message": "I walked semi-boldly through the office I worked in and caught my left hand on a filing cabinet. TWENTY YEARS ON I still have the scar on my middle knuckle. Seriously. Could it be less cool.",
   "created_utc": 1692462915,
   "score": 6,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvxnu4",
   "message": "Just got a cyst cut out of my ass so I have a 6 inch slice down my left butt cheek",
   "created_utc": 1692467468,
   "score": 7,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvhtfv",
   "message": "I either have no scars or I'm totally covered in scars, it could go either way",
   "created_utc": 1692461502,
   "score": 5,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jww7d2l",
   "message": "3. 1 from when I was 2, me and my parents were watching a movie. Me being 2 I got bored and I stood on the end of a sofa and fell and sliced my eyelid open on a mantelpiece. Got taken in an ambulance and since it was late I fell asleep in the ambulance and I woke up the next day in a minor A\u0026amp;E building. I woke up on my birthday 💀. I woke up on my 3rd birthday in an minor A\u0026amp;E building with a stitched eyelid. \n\n2nd was whilst 3 (again 💀) I fell on some stairs. These stairs are CONCRETE! And I fell on the corner and sliced the space between my lip and my nose open. Then went back to the same minor A\u0026amp;E building to get it glued. And since then, the only other scar I’ve got was I was riding a bike when I was 7 and I hit a stone and fell off and that same stone (sharp asf) ran right along my leg as I fell and those are my only scars (also if you read all this you’re a legend 🫡)",
   "created_utc": 1692470916,
   "score": 6,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwdkr0",
   "message": "Both my eyebrows had stitches from different incidents. One when I was in highschool, we went ice skating and a friend of mine pushed me and it opened wide open. \n\nThe other one, when I was in Erasmus in NL, we went to Cologne for a festival for 2 days. We drank the whole time, dehydrated, walked around and slept very little. When I came back to dorm a friend of mine invited me over to his dorm. After a couple of joints, I felt sick and got up to go to toilet. While passing through corridor, eyes darkened and passed out. Woke up to some Russian students talking around me. My left ear was all hot because of the blood. I couldn't remember my whole weekend. It was very bizarre not to be able to remember recent memories. Slept like that and went to hospital in the morning for stitches. I couldn't close that eye for a whole month, slept one eye open.",
   "created_utc": 1692473211,
   "score": 6,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwdo14",
   "message": "The toilet",
   "created_utc": 1692473245,
   "score": 7,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwdsa7",
   "message": "One from the nape of my neck down to my tailbone for back surgery.  I forget about it until I hear someone say “What the hell happened!?”",
   "created_utc": 1692473293,
   "score": 6,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvikjl",
   "message": "I just got a double mastectomy so now I have a couple scars straight across my pecs.",
   "created_utc": 1692461803,
   "score": 14,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvi0d0",
   "message": "Quite a few 🫣\n\nGallbladder surgery (4)-\nPrecancerous skin lesions surgeries (3)-\nToe stitches from an accident-\nPast with SH-\nDog bite-\nKnees from falls (clumsy)-\nParrot bites (I have 6 parrots and worked at a bird store training and raising them)-\nAnt bites I scratched the shit out of-\nBack of heels from blisters from shoes",
   "created_utc": 1692461581,
   "score": 5,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvikq6",
   "message": "Until a year ago I had one or two and they were very minor. After badly breaking my leg at Christmas and needing a pin to fix the bone as well as a muscle flap to cover the bone I have quite a few. Biggest is about twelve inches long from my groin almost down to my knee where they took the donor muscle to make the flap. Then I have the scars around the flap. Another inch and a half long one above my knee where they made the incision to insert the pin into my tibia and a few smaller ones down either side of my calf where they fitted a temporary external frame for a few days before I had the permanent fixation...",
   "created_utc": 1692461805,
   "score": 5,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvjzb2",
   "message": "Got one on my abdomen from hernia repair (back in ye olden times when they actually opened you up vs laparoscopic so it's a couple inches wide).\n\nGot one on my knee from correcting an osteo chondroma.\n\nGot one on my left wrist from when I was home drinking with friends and the hookah charcoal fell off onto my wrist and then just sat there (didn't roll off).  \n\nI think that's it...",
   "created_utc": 1692462340,
   "score": 4,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvlw8c",
   "message": "I have 11 scars on my stomach, from various surgeries, the longest one is about 4 inches next to my left hip.",
   "created_utc": 1692463079,
   "score": 5,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwapyf",
   "message": "From years of self hate.",
   "created_utc": 1692472140,
   "score": 6,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwdgx3",
   "message": "Unfortunately self harm 🫠",
   "created_utc": 1692473170,
   "score": 5,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvc1vj",
   "message": "I have a few. I liked to fall a lot when the party really started. I'm pretty clumsy.",
   "created_utc": 1692459214,
   "score": 4,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvju6k",
   "message": "I had an incident where my dog and another were barking and growling at one another and out of my naivety I went to pull one back to calm them down and threw my arm straight into its mouth, a nice shiny scar is my reward for my stupidity.",
   "created_utc": 1692462284,
   "score": 4,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvp9xm",
   "message": "Once I was driving home, no seatbelt on. Flipped my car a few times but luckily my only injury was that I split an eyebrow open",
   "created_utc": 1692464334,
   "score": 4,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvq1xt",
   "message": "Being burned, shot, stabbed.\n\nStabbed in elementary school\n\nFamily member through boiling liquid on me\n\nTook a load of bird shot to the face because of one of my dad's drunk hunting buddy",
   "created_utc": 1692464621,
   "score": 4,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jww76ir",
   "message": "I fucked up my ankles by shaving my legs too aggressively... Also have the same kind of scar on my fingers bc I was grating my cheese too aggressively... Andddd a scar on my knee bc I sat on some scissors as a baby (':",
   "created_utc": 1692470853,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jww7r8i",
   "message": "I tried to pick up my helmet from the ground while I was in the military, my rifle was hanging from my back and as I bent down to get my helmet, the gun swings right into the corner of my eye leaving me with a little less eyebrows",
   "created_utc": 1692471053,
   "score": 4,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwdgx6",
   "message": "I have one on the bottom of my chin. When I was about three I ran full speed down a hill and smack dab into a boulder at the bottom and split my chin open. My dad secured it with butterfly bandages, which the doctor said saved me from needing stitches. \n\nI also have a slight burn scar on my elbow, from bumping it on a fry basket fresh out of the oil when I worked at McDonald's. It's faded a lot now.",
   "created_utc": 1692473170,
   "score": 4,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwdme6",
   "message": "I have a small on on my left hand from about six years ago. I was a stupid kid who thought it’d be fun to try pogo sticking for the first time. Mind you I have had this pogo stick for four years and never once used it. I got it out of the box and started testing it out. I could get a few jumps in but I wasn’t very stable. My dad called me into the garage while I was practicing so that I could help him move something. I brought my pogo stick with me and asked if I could show him what I learned. The garage was just a glorified shed, which was covered head to toe with our stuff. I walked about three feet into the garage, hopped on my pogo stick, missed one of the footholds, and flew three feet to the right. I tried to use my left hand to catch myself, but instead i missed and fell to the ground. I got up and felt a sharp sting on the backside of my hand. When I had tried to catch myself I had scraped my hand on some old wood that had caught itself in my hand. I had a thin but sharp piece of wood lodged in my hand.  My dad got it out fairly quick, and I was back laughing a few moments later, but the place ended up scaring and lets just say I have no idea where that pogo stick went afterwards. Which is probably a good thing.",
   "created_utc": 1692473228,
   "score": 4,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvdmay",
   "message": "I literally have hundreds of scars in my legs and fingers at all times,  no idea where they come from",
   "created_utc": 1692459854,
   "score": 6,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvf4kw",
   "message": "2 dog bites, one on my cheek and one on my left hand, multiple cuts on fingers from knives and tools, palm and wrist of right hand from crushing a glass in my hand, right forearm from broken glass, toes on left foot from a motorcycle accident, J shape on my left ankle from surgery for a fracture, straight line up my right foot and 6 little incisions from surgery to address multiple fractures, a small circle on my right lower leg from a bad spider bite, a weird patch inside my right elbow from a bad scrape as a kid, both shins from a bad scrape on dirty metal that got infected, and several little spots where I've had moles removed.",
   "created_utc": 1692460435,
   "score": 4,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvj6a1",
   "message": "Left ankle - fix the tendon so my foot faced forwards not sideways \u0026amp; metal ornament tip spearing into ankle as a kid (long story)\n\nLeft Knee - Kneecap removal\n\nRight knee - Arthroscopy \u0026amp; partial kneecap removal (just over 5 weeks ago)\n\nLeft hip -  removal of bone from hip to fill a gap in upper jaw\n\nAppendix removal\n\nnumerous inside mouth to fix Cleft lip and Palate \u0026amp; one on top lip.",
   "created_utc": 1692462031,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvjv1q",
   "message": "I have a huge back Scar from the time I got a Surgery. I also got to Scar-dots from the same thing in my Left wrist. Some light scars on both of my fore arms becuase I passed though some wires (2 times). Lastly, I have a scar in my right thomb because when I was a kid I was opening a can of Dog Food and instead of opening the can, I opened my thumb :D",
   "created_utc": 1692462294,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvltci",
   "message": "Scar from a razor scooter on my ankle",
   "created_utc": 1692463047,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvmk5g",
   "message": "Hidradenitis suppartiva gave me most of my scars, and my breast reduction",
   "created_utc": 1692463334,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvn5va",
   "message": "_melanoma skin cancer removal_",
   "created_utc": 1692463561,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvo6gl",
   "message": "\"Farewell and adieu, to you Spanish ladies  \nFarewell and adieu, to you ladies of Spain\"",
   "created_utc": 1692463937,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvpnew",
   "message": "Many:\n\nDog bite in face\n\nPlastic vcr Case thrown at my face\n\nFalling off trampoline onto a tractor claw on my head\n\nNail going thru my lip",
   "created_utc": 1692464472,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvs94a",
   "message": "I have many but most memorable is when I was riding my bike and went past a fence that had a long screw sticking out and it sliced my leg open at the knee",
   "created_utc": 1692465452,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwdf14",
   "message": "I have a tiny one on my little finger from a time I bought canned dog food to feed a stray and managed to cut myself opening it. It's so fucking stupid.",
   "created_utc": 1692473149,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwdixt",
   "message": "one under my lower lip from when I was 5 (24 now) fell on the playground and pressure cut it open. needed a few stitches. And then a cluster on my knee when I fell down a hill as a teen and skidded along some gravel. Got a few rocks embedded in my right knee (and have a few small ones on my arms from the same incident) that left some scars but I'm super pale so they're not super noticeable unless I get a tan.",
   "created_utc": 1692473192,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwdn46",
   "message": "Lots, on chest, minimally intrusive heart valve surgery (x2), colorectal cancer surgery, chemotherapy port scar on left of chest.  Not on the beach much now where I’d go without a t-shirt.  76 yo.",
   "created_utc": 1692473236,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwdpbr",
   "message": "Men",
   "created_utc": 1692473260,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwdrls",
   "message": "Both elbows: multiple bike accidents\nRight knee: straight scar down the center from knee surgery\nRight ankle: scar from where a sora group set entered me in another bike wreck\nFingers: couple of lighter ones from random cuts that will fade\nBack of the head: jumped into a coffee table with my head as a kid",
   "created_utc": 1692473286,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwds1o",
   "message": "I was at my aunt's house when I was maybe 10 I think. I had just eaten a hamburger and went outside to the front of the house where my aunt was talking to a neighbor. I stuck my index finger through the slot in her wood fence to pet her pet lab on the nose. It proceeded to aggressively bite my finger. I started screaming and my aunt looked over, turned away, and kept talking for a good 10 - 15 seconds before casually saying \"Excuse me Rhonda\" and coming to help. The dog bit my finger down to the bone. So yeah. That's where I got that scar and learned to not stick my finger through fences.",
   "created_utc": 1692473291,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwwkaps",
   "message": "As someone who used to self harm, gonna sit this one out",
   "created_utc": 1692475699,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvsbdq",
   "message": "Does stretch marks count?🙃",
   "created_utc": 1692465477,
   "score": 3,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvcyc7",
   "message": "Bunches. I consistently find myself in the wrong place at the wrong time.",
   "created_utc": 1692459583,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvgdxr",
   "message": "Yup Burns",
   "created_utc": 1692460930,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvgpcj",
   "message": "An elongated patch on the elbow",
   "created_utc": 1692461058,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvkflw",
   "message": "Left Shin from taking a bike pedal to it left wrist where a piece of wire i was tensioning brought off and went up my arm hole in hole up abput 10cm",
   "created_utc": 1692462515,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvnfzt",
   "message": "Surgical scar across the bottom of my neck (thyroid surgery), hysterectomy scar. 2” scar on my lower arm from taking blueberry muffins out of the oven.",
   "created_utc": 1692463664,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvnurd",
   "message": "Self harm, a burn,a chainsaw accident and surgery",
   "created_utc": 1692463818,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvnx1v",
   "message": "I have one on my palm left from when my dog bit me 3 years ago",
   "created_utc": 1692463841,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvo8sf",
   "message": "All but one are from heart surgeries. Open heart, pacemaker and one on my left thumb from when I almost cut it off with a steak knife.",
   "created_utc": 1692463960,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvp920",
   "message": "Birth",
   "created_utc": 1692464324,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvpdbi",
   "message": "Most are self-harm, but I have a huge one under my chin from where I had a baseball sized mass (it tested positive for MRSA when they sent it to be tested) removed that was attached to my jaw and underside of my tongue.",
   "created_utc": 1692464369,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvpq7i",
   "message": "Scars from cancer biopsies and my port scar, but before all that, I almost got the tip of my middle finger chopped off from a razor scooter.",
   "created_utc": 1692464499,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvpqiy",
   "message": "Yes 1 from a dog 1 for surgery",
   "created_utc": 1692464503,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvptkw",
   "message": "Fell in a shower, eye brow scar \n\nPlayed with knives. Knee scar\n\nFell on a mirror, elbow scar\n\nGot an iron pressed on my arm, burn scar",
   "created_utc": 1692464535,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvpw0x",
   "message": "• One on my forehead from being pushed off a tall chair in a pub by my brother when I was 5 (he was 6, and we were allowed in because my mum who worked there at the time got permission to bring us in for the day)\n\n•One on my elbow from 3 and ½ years ago from tripping over a fuckin discarded hot wheels car of all things while walking to the shops.\n\n• Three in my stomach from an appendectomy I received almost 2 years ago (one below my bellybutton, one just off the left side of it, and one just above my groin)\n\n• One on my foot I got literally last week by dropping a knife on it (thank god it was dull af, I was not in the mood to go to the ER that day)\n\n• A few on my face from acne",
   "created_utc": 1692464559,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvq0jq",
   "message": "I have a scar above my right eye, it was my first time shooting, and the gun had a scope, you can figure out the rest",
   "created_utc": 1692464607,
   "score": 2,
   "submission_id": "15vipud"
  },
  {
   "comment_id": "jwvq9em",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15vipud"
  }
 ]
}