{
 "submission_id": "15vkjem",
 "title": "Those who have had a s/o or family member die, what shocking fact did you lean about them AFTER they passed?",
 "selftext": "",
 "created_utc": 1692462147,
 "permalink": "/r/AskReddit/comments/15vkjem/those_who_have_had_a_so_or_family_member_die_what/",
 "score": 161,
 "url": "https://www.reddit.com/r/AskReddit/comments/15vkjem/those_who_have_had_a_so_or_family_member_die_what/",
 "comments": [
  {
   "comment_id": "jwvjqu3",
   "message": "The orange juice that grandma had every morning had vodka in it. I had no idea she was an alcoholic. She really didn’t seem to have many negative effects from it— outwardly at least.",
   "created_utc": 1692462250,
   "score": 153,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwvmxf9",
   "message": "My dad recently passed away and we learned he donated his time to help hundreds of people in need with their plumbing issues. He was a plumbing contractor. After his passing we met countless strangers telling us how much they loved my dad and how much he helped them when they were in need. My dad was a quiet legend in his community and we had no idea. Hearing from all these people really helped with the healing.",
   "created_utc": 1692463472,
   "score": 68,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwvpo3g",
   "message": "This isn't exactly the sort of answer I think you're looking for, but my aunt hid from our entire family that she had stage iv lung cancer that had spread to her bones until literally a week before she died. Like even her husband and children didn't know until right before the end. She didn't want to burden people with her problems and wanted to live a \"normal\" life as long as possible. On the one hand I think it's pretty badass. But on the other hand having all that come to you in a week sounds more traumatic than slowly watching them die over a couple years. I respect her decision though. It's going to be painful for those around you either way. Nice to preserve normal life as long as possible I guess. Still had to be pretty brutal for her husband and kids when they found \"Oh btw your wife/mom is about to die.\"",
   "created_utc": 1692464478,
   "score": 101,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwwmfus",
   "message": "Going through boxes in her closet I discovered police and court paperwork that my aunt Ruthie was arrested, prosecuted and fined several times for prostitution in the ‘40s and ‘50s.",
   "created_utc": 1692476462,
   "score": 93,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwvugon",
   "message": "My grandfather had extramarital children that he never acknowledged or provided for. In hindsight, it wasn't all that surprising because he was a crappy person in all sorts of ways.",
   "created_utc": 1692466283,
   "score": 68,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwx0x08",
   "message": "not terribly shocking i suppose, but my grandfather had a dick piercing.",
   "created_utc": 1692481898,
   "score": 61,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jww3fjm",
   "message": "My dad’s twin dropped dead at work 2010. It was only after his post-mortem that we found out he had a heart/blood condition that is genetic. My dad was checked and cleared so I wasn’t checked. My cousin (twin’s son) was checked and does have it. \n\nAs a result he stopped drinking, smoking and dropped 70lb. So although my uncle died, his death may have given my cousin many more years of life.",
   "created_utc": 1692469542,
   "score": 140,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwvvvye",
   "message": "My old nana had Christmas present for grandkids wrapped in her cupboard in January I am sure she knew she would not see xmas the presents are still treasured to this day",
   "created_utc": 1692466811,
   "score": 82,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwvwql8",
   "message": "That he really liked meth.",
   "created_utc": 1692467126,
   "score": 31,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jww029o",
   "message": "My great-uncle, someone I loved and looked up to, forced taking care of my great-grandma upon my grandma. He didn't even help monetarily when she finally had to go to the nursing home. If fact, he was pretty shitty to my grandma in general. I had no idea.",
   "created_utc": 1692468342,
   "score": 28,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwwzqwx",
   "message": "My grandfather was gay.",
   "created_utc": 1692481417,
   "score": 32,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwvjnzw",
   "message": "My mother kind of hated me",
   "created_utc": 1692462217,
   "score": 25,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwwoxbi",
   "message": "That my mom was sexually abused her whole upbringing by her step dad. I had kinda' already figured it out, but it was still a shock.",
   "created_utc": 1692477361,
   "score": 26,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwx4cvx",
   "message": "After Grandad died, we found two barrels of cyanide stored in one of his sheds.  They were rusting apart.  I'm sure he'd used them on his farm, which he sold in the 1950s, and decided they were worth keeping around.  The specialist team that came to remove them said if they'd ruptured it would have killed us all.",
   "created_utc": 1692483286,
   "score": 32,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwx6bh4",
   "message": "My Dad died when I was 10. I'm now much older. But recently while digging for some information in the towns newspaper archives I found dozens of arrest records for my Dad when he was a teen/young adult. Mostly for drunk driving and fighting. \n\n\nIt's crazy to me because he was probably the sweetest, most gentle, passive man I've ever known. Granted I was his daughter and very young. He let me put those little wiggly butterfly clips in his hair and would read me poems and Shakespeare. Crazy to think of him as this troubled angry young man.",
   "created_utc": 1692484085,
   "score": 28,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwx5ydj",
   "message": "Dad died in 2007 at age 86.\n\nI just found out a year ago I have a half brother somewhere.",
   "created_utc": 1692483935,
   "score": 20,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwx7txg",
   "message": "My father Fred died then we found out his actual name was Edward and he just went by Fred.",
   "created_utc": 1692484731,
   "score": 22,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwwozps",
   "message": "when my gran grandpa died we found out that he was hiding few millions under bed. thank you for a nixe house",
   "created_utc": 1692477383,
   "score": 27,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwwc6ko",
   "message": "more depressing than shocking but it was shocking to me cuz i couldn't understand why his own siblings could treat him like that but whtever. \n\na few days after my grandad died, i learnt more about him and his siblings. i knew he had siblings, but i didn't know a whole lot. from what i heard from my mother and nanna a few days after he passed away was that his siblings essentially treated him like shit. they were never really nice to him. they even moved to spain without him. they didn't ask him or anything, they just left without him.",
   "created_utc": 1692472679,
   "score": 18,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwwwvj0",
   "message": "For my grandfather's senior prank, he and his friends came to the school at night and threw a ton of tires onto the flag pole. Deciding that wasn't enough, they got into their car and carved \"79\" (I think) in front of the school.",
   "created_utc": 1692480240,
   "score": 11,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxc4nb",
   "message": "My grandma had a daughter with another man in her previous marriage, before marriage to my grandpa. The previous man and she divorced. So she gave the baby to her mom (my great grandma) to raise as my grandma’s sister when she married my grandpa. \n\nSo my great aunt is actually my half aunt. I didn’t find out until my grandma died of colon cancer because it was “just something we don’t talk about.”",
   "created_utc": 1692486565,
   "score": 7,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxd0ok",
   "message": "My step grandfather died a couple years back and had atleast 7 different bank accounts with alot of savings. Turns out he had been getting crazy amounts of money from his \"normal\" office job and was a landlord of flats a town over. He did it so when he died, my grandmother would have lots of money to live comfortably as I think he knew he was going to die before her.\n\nI didn't know him well but I knew that he was a good person. And I miss him.",
   "created_utc": 1692486946,
   "score": 10,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwwyvfz",
   "message": "My dad passed away last year and when my sisters and I were cleaning out his house in Vegas we found a box of letters from a woman in jail. She had been dating my dad off and on prior to her being arrested. We did a little digging because he never told us what happened with her. \nShe apparently was married to a man in IL who was very abusive to her. They had 3 kids together. One of the children had passed away and she never told my dad why/how. After we did some digging we found out how she got to Vegas. The child passed away from what she told police later on from choking on food. Instead of calling the police they hid the child’s body in an abandoned shed and ran away to Vegas where her then husband forced her into sex work/dancing. The police eventually found the child’s body and she was arrested and taken back to IL. \nMy dad even after finding this out continued to speak with her, send her money and even went to IL to visit her in jail. \nShe’s apparently out now, reached out to me on Facebook when he passed away about how much she loved my dad. I didn’t respond.",
   "created_utc": 1692481050,
   "score": 29,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwwnk9x",
   "message": "My aunt put my dad in jail for alleged rape, for some reason the judges believed her, before she died of cancer, she said that my dad  never touched her, but since she hated him, she wanted to hurt him, she was a radical feminist, after that my dad was released.",
   "created_utc": 1692476871,
   "score": 11,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwwzcop",
   "message": "My mom kept it a secret from my dad that i was severely bullied throughout my childhood. I just thought he didn't care.",
   "created_utc": 1692481252,
   "score": 11,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwx4vk9",
   "message": "About 15 years after my great grandma passed away, my grandmother (her daughter) got a phone call from a woman who said she was her younger half sister. So apparently my great grandmother had a child in secret. And put that child up for adoption. The aged difference between my grandmother and her half sister was about 15 years. So how my great grandmother hid her pregnancy is a mystery to us all.",
   "created_utc": 1692483500,
   "score": 10,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwvyz64",
   "message": "my grand aunt passed not to long ago. she lived in Puerto Rico, but our flight was cancelled so we couldn't make it to her funeral. she was basically skin and bones. you could VISUALLY see her bones. she died of sickness and i didnt learn that until a day after she had passed.",
   "created_utc": 1692467951,
   "score": 5,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxi9x7",
   "message": "My father had at least other 6 child with different women.\n\nThe \"legal\" ones were my late sister and me. He died without a will, so we needed to go tocourt for our fair share. my mother and I found the hard way: \"\nWe learned that only are we not alone, but we are hopelessly, hilariously outgunned\"\n\nWe kept her apartament and nothing else.",
   "created_utc": 1692489129,
   "score": 6,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxiw44",
   "message": "My grandma had a bunch of tar-baby ornaments and Mein Kampf hidden in the back of her closet",
   "created_utc": 1692489392,
   "score": 11,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwx7yyz",
   "message": "Found out after my dad died that he had a ton of notes written in code. My mom said she has tried so many times to figure out what it says. He very much had a dark side so I’m assuming it was something he would never want anyone to know.",
   "created_utc": 1692484792,
   "score": 5,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxh256",
   "message": "BOTH of my grandmothers had affairs one one had a whole child she gave up for adoption. One made it seem like my aunt was this other guy’s kid and apparently the rest of the family was convinced that was true (despite her looking. Like a mini me of my grandfather) and they treated her like shit for it. I refuse to speak to almost all of them now because that is vile behavior.",
   "created_utc": 1692488617,
   "score": 6,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxjay3",
   "message": "One member in my family portrayed as a good man faithful and loyal worked in another country well he had a family in different countries which shocked everyone when the other wife and kids ended up at the funeral",
   "created_utc": 1692489566,
   "score": 3,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxb0xv",
   "message": "From 87 - 88 I would walk from my house to wait for the bus to take me to school.  An elderly uncle would sit on his veranda and I would often talk to him.  After he passed away I found out he practiced a rare martial art.  Could no one have told me ?",
   "created_utc": 1692486087,
   "score": 2,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxivn3",
   "message": "It is not a lean fact but it is a sad one I just can’t cope with ….I think everyone of us has that unconscious feeling that he wants his mom to be proud.. every thing we do  just to make our mothers proud from a drawing in the school to build a family.. my shocking fact that since I was 8 yrs old nothing in my life matters because I have no mom to make her proud…….",
   "created_utc": 1692489386,
   "score": 6,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwvmmtg",
   "message": "11 - Finding out surprising things about our loved ones after they're gone is a reminder to cherish the time we have with them while they're still here.",
   "created_utc": 1692463361,
   "score": 243,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwwqxs4",
   "message": "[deleted]",
   "created_utc": 1692478099,
   "score": 255,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxjxoe",
   "message": "My father passed away 11 years ago and as of the past 5 years I've been learning more about how much of a bad influence he really was.\n\nMany instances I've been told that he was unfaithful and that he was depressed.\n\nHe was a bad influence. He allowed my sister to go to bonfires with him and get trunk when she was 15.\n\nMy father was an alcoholic just like the rest of my family and he died due to drunk driving. Now drama ensued... They bought his old house. Tore it down and put a new one up. But within the first year my family (uncles,cousins, aunt's, disten realities) took everything. I was 4 when he died and do not remember him. And I know my family left nothing for us and in the end threw out what they didn't want. Leaving me and my 3 other siblings with basicly nothing... Don't we love family?",
   "created_utc": 1692489830,
   "score": 5,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxlrnc",
   "message": "When my childhood sweetheart died before we graduated high school i found out she had a child after a family member assaulted her. They didnt tell people that the child was hers so no one would have looked differently at her. Her parents raised the child as their own cause we was still young and such. It was like the day after her burial that i found out about it all. It devastated me that i didnt know about it before.\n\nBefore anyone asks how i didnt know imma go ahead and clear that up. During the time that it happend i was living out of state due to family situation.",
   "created_utc": 1692490611,
   "score": 1,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxmwzt",
   "message": "My paternal grandfather was a birdwatcher, and shared lots of interests with me. I didn't know him well, but now I sort of wish I had.",
   "created_utc": 1692491101,
   "score": 5,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxpqwx",
   "message": "That my mom was having an affair with a married man whose wife she was friends with. So out of character for who I believed my very Catholic mother to be. Even more shocking was the photographic evidence on her computer. Not enough eye bleach in the world for that!",
   "created_utc": 1692492307,
   "score": 4,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxszhd",
   "message": "My grandfather died not long ago and it turned out that he had a secret second family that he was monetarily supporting. He was always a nice guy, but he seemed to always like the ladies. Grandma was kind of OK with it because he would go to the strip club weekly and drop a bunch of money. She thought that he was just “blowing off some steam” while looking at some exotic dancers. He always came home at the end of the night and things were good. \n\nAs it turned out, he was going to the strip club, withdrawing three or four hundred dollars each week. He hung out for a little bit, paid his favorite dancer $20, then would take the rest of the cash to his second family for his weekly support. That apparently went on for years.",
   "created_utc": 1692493678,
   "score": 5,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxxxji",
   "message": "Yesterday I learned that my sweet, loving, and calm great grandfather, who used to tell me stories about faries and sprites living in the woods and who took me out to find them was apparently extremely xenophobic.\n\nHe would loudly proclaim that \"THEY don't belong here\" when he went in a restaurant and spotted immigrants.\n\nOh, and I found out decades later that my grandfather, who was the most amazing and beloved person, had breakfast with the German president (not chancellor) for his charity work was in the Hitlerjugend back then. He even cried when they announced Hitler's death but hated everything to do with them upon being informed by the allies about the atrocities the Nazis committed soon after.\nAccording to my mother he was a very understanding bailiff until he figured out the person he was interviewing was a neo nazi, then he'd end any discussion and just start marking valuables.",
   "created_utc": 1692495880,
   "score": 1,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxrn27",
   "message": "She was EXACTLY the bitch I suspected her of being, despite everyone actively not talking about it.",
   "created_utc": 1692493100,
   "score": 0,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxt3o1",
   "message": "My grandparents did cocaine. My grandfather is still alive though...",
   "created_utc": 1692493730,
   "score": 1,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxwfdf",
   "message": "I think my story is too dark for this post.",
   "created_utc": 1692495213,
   "score": 1,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxwoea",
   "message": "That pretty much everyone was jealous of my dad.  From his siblings to his friends.  Everyone wanted what he had.  It's kind of sad.",
   "created_utc": 1692495323,
   "score": 1,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwxwolj",
   "message": "That my one brother had an ongoing affair with our other brothers wife.",
   "created_utc": 1692495325,
   "score": 1,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwy0t4k",
   "message": "That my grandmother was pretty much penniless by the time she died. She’d been the victim of scam artists and telemarketers for years. In her last years she gave really odd Christmas gifts that turned out to be scam prizes that she got for sending money ‘for shipping and customs’. When we emptied out her apartment it was full of junk prizes.",
   "created_utc": 1692497145,
   "score": 1,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwy0w40",
   "message": "My step-grandpa passed away in 2018. Learned this year that he once tried to choke my dad after arguing.",
   "created_utc": 1692497182,
   "score": 1,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwy3pha",
   "message": "Pretty much all my life my father was estranged from his family. Until I was an adult I didn't know how many siblings he had or what their names were. He didn't talk about it much but vaguely alluded to some kind of conflict over money.\n\nIt was so bad that he made my mother promise that, when he died, his brothers would not be invited to the funeral.\n\nWhen he passed, and my mother contacted them to let them know, the first thing they asked her was 'do you know why he hasn't spoken to us in 40 years?'\n\nTHEY DIDN'T KNOW EITHER.\n\nWhatever the reason for cutting them off, my father kept it completely to himself. And whatever it was, it died with him.\n\nI have a bad habit of nursing hurts and keeping my feelings to myself. But that shit fucking terrified me. Since he's died, I've been trying to be more open.",
   "created_utc": 1692498498,
   "score": 1,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwy3xmd",
   "message": "I learned my grandma's secret after she died. One that would destroy my abusive father's sense of identity and self worth. \n\nFor context, my father is a grandiose narcissist who's entire identity is being the decendant of and carrying the last name of an obscure historical figure in my region.\n\n Turns out dear old abusive dad is secretly an affair baby.  Father isnt a decendant of the famous guy at all because grandpa isnt his bio dad. Grandpa and father are big cheaters but no one suspects grandma stepped out too. \n\n\nNow...do i share the poetic justice of an abusive cheater being an affair baby? \nDownside = well-connected abuser who knows where i live. The plus side is obvious and deliciously petty. Peace in my life wins so far but id love to share the news far and wide.",
   "created_utc": 1692498609,
   "score": 1,
   "submission_id": "15vkjem"
  },
  {
   "comment_id": "jwy3ylp",
   "message": "When my Grandpa died, my Mormon Mom and her sisters found a stack of Playboys in his basement. They were furious and even spoke about his ‘porn addiction’ at his funeral. They then wrote his life story and included his ‘porn problem’ as a chapter.     This was never a problem when he was alive or anything that anybody knew about   It still makes me angry to think about. He was a World War II veteran that was wounded in battle.  I feel like he should have been given more respect in death.",
   "created_utc": 1692498623,
   "score": 1,
   "submission_id": "15vkjem"
  }
 ]
}