{
 "submission_id": "15vpwnj",
 "title": "What isn't taught in sex ed, but should be?",
 "selftext": "",
 "created_utc": 1692475016,
 "permalink": "/r/AskReddit/comments/15vpwnj/what_isnt_taught_in_sex_ed_but_should_be/",
 "score": 164,
 "url": "https://www.reddit.com/r/AskReddit/comments/15vpwnj/what_isnt_taught_in_sex_ed_but_should_be/",
 "comments": [
  {
   "comment_id": "jwx4e3w",
   "message": "Obviously consent and practical birth control should be but also stop using those old videos from the 1970s. We spent more time laughing at the hideous clothing and out of date slang than on actual learning.",
   "created_utc": 1692483302,
   "score": 44,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx17ff",
   "message": "For EVERYONE to WASH their DAMN ASS",
   "created_utc": 1692482014,
   "score": 162,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxc647",
   "message": "Information on miscarriages. The fact they are so common and what to look for and how to handle. So many don’t even know they are going through one. You should know you are prone to infections and need to watch just how long you are bleeding for. It’s not a day or two and averages 2-3 weeks for most women. It can be traumatic trying to figure out what is going on without even a baseline of information.",
   "created_utc": 1692486583,
   "score": 189,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxh29l",
   "message": "the severity of sending/posting/receiving nudes when you/the other party are underage. the internet is forever. teens will be stupid, some will be malicious. practice safe sex in person all you want but ***please*** don't take nudes if you are not 18.",
   "created_utc": 1692488618,
   "score": 132,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwwr5wv",
   "message": "Porn isn't real",
   "created_utc": 1692478184,
   "score": 204,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwwuy1p",
   "message": "I think more options for birth control. I remember going over condoms and the pill but not much detail into IUDs, implants and shots. There's so much more out there now besides a pill and condom",
   "created_utc": 1692479518,
   "score": 222,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxajpt",
   "message": "1) condoms are not a shield for every std\n\n2) how to tell if a condom has been expired",
   "created_utc": 1692485880,
   "score": 159,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwwz052",
   "message": "The opposite sex should also have to watch the same videos to have more information on reproduction and how the human body works. It’s astounding how many guys don’t know anything about periods.",
   "created_utc": 1692481106,
   "score": 27,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxed46",
   "message": "Dude I was taught that girls never want to, ever. Only boys actually want to do it.",
   "created_utc": 1692487507,
   "score": 167,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx0lk7",
   "message": "The hole is lower than you expect",
   "created_utc": 1692481768,
   "score": 135,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx36nq",
   "message": "Porn is not an accurate representation of sex",
   "created_utc": 1692482816,
   "score": 205,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx84gl",
   "message": "That people have different sex drives.  You should try and find a person who closely matches yours.  You will be way more happy and we can end the joke of “what food kills a woman’s sex drive?  Wedding cake.”  Just my .02",
   "created_utc": 1692484857,
   "score": 215,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx5voa",
   "message": "That jackhammering shit that his shown in what feels like every other porn rarely happens unless you have a girl that like it.",
   "created_utc": 1692483906,
   "score": 241,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx75wf",
   "message": "Depends on the sex ed. Ours was awful. Two 15-minute sessions, one of which involved a condom and a banana (though they didn't actually put the condom on the banana), and the other where we boys had to wait outside in the rain while the girls were told about periods. Until I actually saw one I assumed the vagina was front-mounted.",
   "created_utc": 1692484446,
   "score": 79,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx9jzf",
   "message": "I'm a college anatomy teacher. Half of my class (of all females and moms) are always shocked to learn that pee doesn't come from inside your vagina (I remind them of catheters during birth). \n\nThe second shocker each semester is that \"not having sex during ovulation\" only works if you track your cycle and have regular periods.",
   "created_utc": 1692485466,
   "score": 84,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxiwk8",
   "message": "All the different ways sexual assault looks. I didn’t realize I’d been assaulted until a year after because rape is only portrayed and talked about in one way , violent, aggressive and usually by strangers. A lot of people can be saved by just understanding when they’re assaulted",
   "created_utc": 1692489397,
   "score": 121,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwwizyn",
   "message": "No = no\n\nDon't try to reproduce something you saw in a porn without informing yourself about it first, you can hurt your partner / hurt you pretty bad",
   "created_utc": 1692475243,
   "score": 15,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx6okq",
   "message": "CONSENT. CONSENT. CONSENT. \n\n\nTo every student, and taught that it applies to all parties. \n\n\nSomething like this- \n\n\nIf you don’t want to do something your partner asks for, you do not have to. Ever. You are never obligated to preform a sexual act you don’t want. To be forced or coerced into it is assault\n\n\nThis applies to the other party (or parties) as well. Just as you are allowed to say no, so are they. They are never obligated to preform a sexual act for you that they do not want to. To be forced or coerced into it is assault. \n\n\nWhen consent is taught, I feel we often leave out that YOU are allowed to say no too. At least what I’ve seen, it’s often taught (to men) as “if your girlfriend says no that means no”. But it’s important they’re told that it applies to them, too.\n\nRegardless of gender you can say no.",
   "created_utc": 1692484241,
   "score": 110,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxh9zh",
   "message": "Relationship stuff. Abuse red flags. How to communicate. How to set boundaries. How to end a relationship.",
   "created_utc": 1692488709,
   "score": 82,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxe2ti",
   "message": "Always have a cleanup rag nearby.",
   "created_utc": 1692487386,
   "score": 239,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx0icr",
   "message": "The psychology of relationships.",
   "created_utc": 1692481733,
   "score": 185,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxcf1a",
   "message": "That some people take medication that make them struggle getting aroused.",
   "created_utc": 1692486692,
   "score": 181,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxv724",
   "message": "What precum is",
   "created_utc": 1692494659,
   "score": 149,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx98ph",
   "message": "That sex doesn’t always necessarily mean penetration",
   "created_utc": 1692485337,
   "score": 253,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxav8e",
   "message": "In my experience, they don’t talk about very much to do with the penis and male reproductive system aside from how it works specifically when making babies. They need to talk more about how to clean a penis and stuff. Phimosis too, and just a lot of other stuff. \n\nAlso things related to same-sex relationships, they’re also ignored a lot.",
   "created_utc": 1692486019,
   "score": 160,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx8chv",
   "message": "That it's ok to want to have sex. My sex ed in high school was taught by a psychologist by degree that worked primarily as a forensic medical photographer for the state. Her work dealt with lots of domestic violence and rape victims. So sex ed was really heavy on the how to preserve evidence if you're raped. Good information to have, but it just overwhelmingly felt like the focus was rape and not that, hey, maybe you want to participate in sex.",
   "created_utc": 1692484953,
   "score": 138,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxju45",
   "message": "Your fingernails need to be trimmed smooth.",
   "created_utc": 1692489790,
   "score": 83,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxld8o",
   "message": "As a married man,, I think more boys need to be taught the ins and outs of periods. Too long have men joked about and minimized PMS as a \"write-off\" to explain any woman's negatively perceived mood. Its condescending and ignorant. I've even had guy friends swear that they would never buy feminine products for their female significant others. \n\nI was ashamed at how little I knew about the ins and outs of womens' cycles until after I got married. There is a stigma against it and I am sick of it. Men look at other men buying pads or tampons like they are insane. Why? It's a fucking biological norm.\n\n(And I know its underhanded, but there is a selfish benefit to men knowing about periods. If you are prepared for your girlfriend's period by knowing which products, schedule, etc., you become \"Boyfriend God\" to the average girl. Most females don't have that kind of support from men, and that would set you MILES ahead of most of your competition.)",
   "created_utc": 1692490443,
   "score": 188,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwwk0m0",
   "message": "Consent and rules on that, always ask, even if you did it before with them, ask them, everything except yes is no and the moment you hear no or stop, you stop, doesn’t matter if they consented, no means stop immediately\n\nAlso pleasure, sex isn’t just to make babies, it’s fun and nice and an act of love and should be enjoyed",
   "created_utc": 1692475603,
   "score": 162,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx7twa",
   "message": "It seems like every day some 16 year old kid jumps on Reddit to explain that him and his girlfriend \"fooled around\" and his penis was only in her for five seconds. Then they're completely mind blown in the comments when they learn pre-cum can get women pregnant.\n\nHonestly I don't know what they should teach more of in sex ed, but these kids need to SHOW up for it.",
   "created_utc": 1692484731,
   "score": 101,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxrzgc",
   "message": "PEE AFTER HAVING SEX",
   "created_utc": 1692493247,
   "score": 81,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxf9bd",
   "message": "The basics of navigating relationships, including early red flags for abusive behavior.",
   "created_utc": 1692487875,
   "score": 57,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxns5c",
   "message": "The schedule of child support payments from ages 0-18. Adjusted for inflation, of course.",
   "created_utc": 1692491478,
   "score": 49,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxf0b2",
   "message": "Literally everything about sex. Safe sex obviously. But also anal, porn and expectations, the consequences of filming it, etc\n\nThere should probably be a class dedicated to real world things. Some classes on sex, personal finance, professionalism in the workplace, etc.",
   "created_utc": 1692487771,
   "score": 67,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxgb3b",
   "message": "All the different ways to orgasm (both for reproductive and recreational purposes).\n\nAlso consent.",
   "created_utc": 1692488302,
   "score": 49,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxgue3",
   "message": "How to make sex pleasurable for both parties, no matter the gender.\n\nAlso, I was taught that abortions decrease your ability to conceive in the future. So factually correct information would be nice.",
   "created_utc": 1692488525,
   "score": 75,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxqyqu",
   "message": "Pre-cum is still viable cum.  Ya know that silly bit from Scrubs where JD didn't even really put it in she still got knocked up?  Yeah, that can happen.  Shitty way to lose your virginity, to say the least.",
   "created_utc": 1692492816,
   "score": 78,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx0ds1",
   "message": "You can get a women pregnant by just rubbing your dick on her pussy, because sometimes you drop precum and that contains sperm so by rubbing it on her you can get her pregnant",
   "created_utc": 1692481681,
   "score": 61,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxqs6x",
   "message": "The realities of pregnancy, the post partum period, menopause, erectile dysfunction, breastfeeding, menstruation.\n\nNon penetrative sex is still sexual intercourse.\n\nVasectomies, prostate cancer.\n\nSex and mental health.\n\nIf you're a single dad, and have a daughter, would your sex ed class be useful? Mine would not have been.",
   "created_utc": 1692492739,
   "score": 37,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxipbk",
   "message": " I think there should be a unit dedicated to the media in terms of sex. Whether that be porn, songs, movies, etc. so much of it is unrealistic, and there are also a lot of good representations as well. I think it’s important for teens to see themselves depicted in accurate ways on screen and also understand what is plainly an exaggeration or untrue",
   "created_utc": 1692489312,
   "score": 19,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx7cjx",
   "message": "Masturbation is healthy and normal",
   "created_utc": 1692484524,
   "score": 60,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwwu9z9",
   "message": "Female pleasure.",
   "created_utc": 1692479276,
   "score": 73,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxkku2",
   "message": "The expenses of having a child",
   "created_utc": 1692490102,
   "score": 20,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxtyyp",
   "message": "The importance of foreplay",
   "created_utc": 1692494114,
   "score": 20,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx44cl",
   "message": "That you can breakup with someone for any reason at all. Even if you would rather just be alone.",
   "created_utc": 1692483192,
   "score": 37,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxex5s",
   "message": "It has been ages since I had to go through the unit, but they really need to emphasize the concept of consent. What is consent, what is and what is not consent, what appears to be consent but really is not consent, state law as it pertains to consent to engage in consensual sex.",
   "created_utc": 1692487736,
   "score": 12,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwwinm2",
   "message": "Rape is bad",
   "created_utc": 1692475120,
   "score": 69,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxhykq",
   "message": "A decent percentage of boys will have gynecomastia when they go through puberty. I thought I had breast cancer when I was a child.",
   "created_utc": 1692488997,
   "score": 13,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxoepp",
   "message": "Cheating is disgusting, betraying someone's trust is wrong.",
   "created_utc": 1692491741,
   "score": 14,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxs8nl",
   "message": "How to do your taxes...",
   "created_utc": 1692493357,
   "score": 13,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxt267",
   "message": "That habits and kinks don’t just go away when you get married…so be careful what you allow yourself to become accustomed to and make sure you find someone sexually compatible.",
   "created_utc": 1692493712,
   "score": 15,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwy3z96",
   "message": "How to get a girlfriend. Seriously, this is what I thought back in high school listening to the lessons about condoms and stds.",
   "created_utc": 1692498632,
   "score": 7,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx9660",
   "message": "Micro penises. I did not know about them until the leaked photos of Colt from 90 day Fiance happened",
   "created_utc": 1692485307,
   "score": 18,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwy3jkd",
   "message": "That porn can cause addiction and it’s unwise to watch even though the teachers know like 98 percent of kids will.",
   "created_utc": 1692498417,
   "score": 6,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxf6pm",
   "message": "I've seen a few people commenting about consent and I'm gonna second that one. You'd really be surprised how connected it is to education. I used to be one of those people who thought people were born rapists and it's just a psychopathy thing but that's really not the case. My ex for example, who I must state clearly is absolutely NOT a rapist, once asked me what the problem would be with him having sex with me while I was asleep, because he genuinely didn't understand that that would be rape, and I had to explain it to him. As far as I'm aware I don't think he ever had ill intentions, he was just dangerously uneducated on the subject.",
   "created_utc": 1692487844,
   "score": 25,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxg1ok",
   "message": "Porn is not a realistic depiction of sex.",
   "created_utc": 1692488195,
   "score": 18,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxtavf",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxu396",
   "message": "Safety around activities/kinks that can be dangerous \n\nSomething that could help is a list of safe, trustworthy resources to learn about non-typical areas of sex that interest them. With porn, teens are obviously finding all these potential kinks/fantasies they possibly like. Some being dangerous or harmful if you don't know what you're doing; since all the talk about safety is solely on contraception/STIs it can be overlooked easily",
   "created_utc": 1692494166,
   "score": 13,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxbt1y",
   "message": "Hygiene.",
   "created_utc": 1692486426,
   "score": 7,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxc08o",
   "message": "A good sex life with your partner is important for you both, and communication is key to achieving that. Talking with your partner about your sex life should not be taboo.",
   "created_utc": 1692486511,
   "score": 11,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxc3l4",
   "message": "Communication is the only way to have safe, consensual and good sex.",
   "created_utc": 1692486553,
   "score": 9,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxeczg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxgng1",
   "message": "Teen pregnancy and how it’s not a good idea. Also, the costs of raising children if they were to be kept.",
   "created_utc": 1692488444,
   "score": 9,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxi39p",
   "message": "In the US in many areas, sex ed is barely even a thing. Pretty much all they teach is the clinical biological explanation of reproduction at a cellular level, and then the rest is just abstinence and STD fear",
   "created_utc": 1692489052,
   "score": 11,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxqrtl",
   "message": "Body noises and all the different smells",
   "created_utc": 1692492735,
   "score": 10,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwy5tun",
   "message": "That periods aren't meant to be heavy, or cause extreme pain. Endometriosis is a thing. \n\nOh and to pee after sex.",
   "created_utc": 1692499550,
   "score": 15,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwwqwdc",
   "message": "Origins of Sex Ed",
   "created_utc": 1692478084,
   "score": 12,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxyy1g",
   "message": "PEE AFTER SEX",
   "created_utc": 1692496330,
   "score": 15,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxir0x",
   "message": "that periods and menstruation are 👏🏻not👏🏻 a👏🏻choice. a scary amount of men (and even some *women*) genuinely, seriously believe that periods and menstruation are choices, and that women can just “hold it in” like it’s pee. there’s a guy on TikTok who believes that discharge and menstruation are choices and women and people who menstruate can just “hold it in” like it’s pee💀he said “no nut November for men. how about no discharge December and no menstruation March for women?” he was not kidding. he was 💯 serious. and this is not just him or a small minority. a lot of men do think that",
   "created_utc": 1692489331,
   "score": 18,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwx99nm",
   "message": "basic hygiene. glad i had internet access to learn",
   "created_utc": 1692485348,
   "score": 4,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxeich",
   "message": "Lol my first time before taking sex Ed I legit though we were going to have to have sex with the teacher.",
   "created_utc": 1692487566,
   "score": 2,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxlm2q",
   "message": "That young women between 18-22 can grow germ cell tumors at random and have a 2% chance of being cancerous. \n\nI am that unlucky 2% and I didn’t even know I could just grow a god damn baby size tumor at random because I was within the age group. \n\nMy mom had cancer at 32 (breast cancer) and my aunt died from ovarian cancer, I’ve been tested for the brca genes and everything was negative and bam baby sized tumor growing on my ovary. \n\nWe should really talk about it more honestly, how you can just grow stuff on your reproductive organs pretty casually.",
   "created_utc": 1692490546,
   "score": 10,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxrok4",
   "message": "What child support is 😂😂😂. The cost of children. Over 18 years. Idk for some odd reason I cared more about money and myself when I was a teenager. So was cautious and always used protection never risked it. 33 and I haven't had a kid yet. Last handful of years I've stopped having intercourse in the us usually only when im traveling abroad. I travel alot so it's not to much to wait till I'm out of the USA.",
   "created_utc": 1692493117,
   "score": 4,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxrov7",
   "message": "Hygiene",
   "created_utc": 1692493121,
   "score": 3,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxst76",
   "message": "We *need* to talk more about periods; what is considered typical and what is abnormal. I know too many that suffer through terrible cramps and unpredictable periods because they’re convinced it’s normal. If you’re in the fetal position because of your cramps, it’s not normal! Don’t listen to doctors who dismiss it as just “painful periods,” get a second opinion from someone who knows and also *experiences* periods themselves. I’ve had multiple friends be diagnosed with PCOS and other conditions only once they’ve gone 15+ years suffering through their periods. Seriously, we need to talk more about this stuff in sex ed.",
   "created_utc": 1692493602,
   "score": 4,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxthdj",
   "message": "Information about intimate partner violence, consent, and the ways things can go wrong, eg. endometriosis, testicular torsion.",
   "created_utc": 1692493899,
   "score": 4,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwy1n99",
   "message": "Things that are factually accurate. Only [17 states](https://www.dakotanewsnow.com/2022/10/03/comprehensive-sex-education-matters-heres-what-data-shows/) in the US have to teach sex ed that is medically accurate.",
   "created_utc": 1692497525,
   "score": 11,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwy6kmr",
   "message": "That males having sex with females should go down on them first before anything and make them cum from oral before you ever get your dick out. This is the number one way women will say you're good in bed.\n\nAlso, technique. There was an old 80s HBO comedy special with a bunch of comedians and one (can't remember who) said to literally lick the alphabet on a woman's pussy, that she would go crazy from the variation, so I did this and thought I was doing good, the women definitely didn't mind getting eaten out.\n\nAnd then in my mid-later 20s I'm licking the alphabet on this woman and thinking I'm killing it. And she just stops me and just asks where I learned to lick like I'm doing. And I'm just like \"uh, am I doing it wrong?\" and tell her about the comedy routine that up to this point is all I really \nknow about cunnilingus.\n\nAnd she tells me \"imagine I'm sucking you or jacking you off, wouldn't you want a nice steady motion instead of weird off and on staccato beat?\"\n\nAnd right then I learned a good steady licking technique is what most girls want, especially up and down the clit, and it has worked well for me since then.",
   "created_utc": 1692499909,
   "score": 4,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwy86nr",
   "message": "Pee is stored in the balls",
   "created_utc": 1692500706,
   "score": 5,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwxosv8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwyd1rp",
   "message": "That being curious and exploring sexuality is normal and not a black and white thing.",
   "created_utc": 1692503183,
   "score": 10,
   "submission_id": "15vpwnj"
  },
  {
   "comment_id": "jwyot4q",
   "message": "Porn isn’t real 🤦🏻‍♀️",
   "created_utc": 1692510088,
   "score": 5,
   "submission_id": "15vpwnj"
  }
 ]
}