{
 "submission_id": "15vsfmm",
 "title": "[Serious] Are you against or for the death penalty? Why/why not?",
 "selftext": "",
 "created_utc": 1692481059,
 "permalink": "/r/AskReddit/comments/15vsfmm/serious_are_you_against_or_for_the_death_penalty/",
 "score": 83,
 "url": "https://www.reddit.com/r/AskReddit/comments/15vsfmm/serious_are_you_against_or_for_the_death_penalty/",
 "comments": [
  {
   "comment_id": "jwwywcf",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1692481060,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx1rfa",
   "message": "I used to be a proponent of the death  penalty.  That was until I did research on the Innocence Project.  There is far too much chance of executing an innocent person.  Even one  person executed for a crime they didn't commit is too many.",
   "created_utc": 1692482241,
   "score": 125,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwwzbn6",
   "message": "Against. The system regularly imprisons innocent people.",
   "created_utc": 1692481239,
   "score": 53,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx3i9q",
   "message": "I have no sympathy for murderers, but as the justice system is run by humans, it can make mistakes as humans and the death penalty is irreversible. There have been far too many innocent people executed.\n\nI also think sociologically if a government views ending a life as an acceptable  punishment, then the governed populace will view ending a life as an acceptable punishment.\n\nSo while I don't care if someone is locked up for their entire life, I'd rather our government not end their life.",
   "created_utc": 1692482944,
   "score": 34,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx4x3b",
   "message": "Against. it regresses society and the people who are for are always thinking emotionally and not logically. Death penalty should always be something logical, and benefit of society. If an logical argument is raised that benefits the advancement of society with no other alternatives? fine. But the moment there is an emotional argument for it then down right no",
   "created_utc": 1692483517,
   "score": 27,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx7my4",
   "message": "Against, my main reason being because false convictions happen\n\nFor me, no amount of just executions is worth even one innocent person being wrongfully executed",
   "created_utc": 1692484649,
   "score": 8,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx8mbe",
   "message": "Against.\n\nBecause it's too easy to create false evidence against somebody, then execute him, and when it's discovered, well... too late !   Also, it provides an easy, *legal* mean to silence somebody.\n\nI *could* agree with death sentence instead of perpetual imprisonment (either on request from the convict, or when there is \"indisputable\" proof - like 5000 witnesses, the crime live-broadcast on TV, etc.)  - but, then again, there are deepfakes, there are errors (like, someone looking like the suspect), there might be pressions on the convict to ask for that (in order for no \"accident\" to befall his family), etc...\n\nSo, in doubt, better not.",
   "created_utc": 1692485072,
   "score": 7,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx6b5b",
   "message": "No, there's always the risk that an innocent person has been convicted, and there's no way to regulate its use to people who are definitely guilty without backsliding into people who are \"almost certainly\" guilty, and so on. \n\nI'll grant that I probably should be against it for moral reasons...but I'm not *that* good of a person.",
   "created_utc": 1692484081,
   "score": 7,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx2zf2",
   "message": "Absolutely not under any circumstances. \n\nWe do not rape rapists, we do not torture torturers, killing killers is a similarly disproportionate punishment. \n\nAlso it costs so fucking much compared to life in prison sentences. \n\nAlso death penalty isn't even the go-to sentencing for murder and black people killing one white person are executed 14x more than white people killing one black person. \n\nAlso the US justice system is corrupt as fuck and favors suppression of evidence of guilt over evidence of innocence so the people being executed aren't the people committing the worst crimes it's just the people who are the least able to defend themselves.\n\nAlso America is the only developed country that still uses the death penalty because it's fucking barbaric.\n\nAlso it doesn't deter people from committing capital crimes at all, there isn't a single recorded year where murder rates in states with the death penalty are lower than states without it.\n\nThere's lots of research to be done on this topic but it absolutely should be abolished.",
   "created_utc": 1692482733,
   "score": 23,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx4skt",
   "message": "Against it.  There are too many people that have been proven innocent that were on death row, its super expensive, i dont think the government should be in the business of killing its own citizens, and there is no consistency in the nature of the crime that results in people being sentenced to death",
   "created_utc": 1692483465,
   "score": 16,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx7r36",
   "message": "Against. Besides all the good responses here already about the unfair system and chance of mistakes: I don't think the justice system should be in the business of killing people.",
   "created_utc": 1692484697,
   "score": 6,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx93wz",
   "message": "I'm against it for many reasons. It takes a lot of tax payer money to house a death row inmate (10x the cost and the average amount of time being incarcerated is 19 years. So cost 190 years of housing a regular inmate). We still make mistakes convicting people which is the biggest reason I'm against it. How we make it into a show is weird as hell.\n\nBut I'm ultimately for it cause some pieces of shits need to be put down like the piece of trash they are.",
   "created_utc": 1692485280,
   "score": 2,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwwz8c1",
   "message": "Against, fuck that shit, not worth it. Theres always the chance that someone innocent gets executed, and theres no point in doing it outside of revenge, which is stupid.",
   "created_utc": 1692481201,
   "score": 26,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx7gzi",
   "message": "Against. A government does not have the right to execute it’s citizens.",
   "created_utc": 1692484576,
   "score": 10,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxc39t",
   "message": "I don't believe in the death penalty unless verified video evidence, but with AI, I'm unsure. Personally, I knew two brothers who did, I think, 38 years for killing a cop. Freed because the innocence project finally got them to test the DNA that was never tested because it was before the technology.  3 million bucks for 38 years false imprisonment.",
   "created_utc": 1692486549,
   "score": 3,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxcu0s",
   "message": "Against. Far too easy to execute someone innocent. It even happened once in Texas (Carlos DeLuna). We might as well send them to prison for life instead, that way if someone’s found innocent they can still be released.",
   "created_utc": 1692486871,
   "score": 3,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxzg6s",
   "message": "If it’s wrong to kill people, then it should always be wrong.  We are the government, so we kill people when we execute them. I don’t want to kill people.\n\nThat said, there are many crimes that I hear about and think, “Damn, that person deserves to die.”",
   "created_utc": 1692496551,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxije0",
   "message": "In favour. In cases that are 101%, no mystery, psycho killer with multiple victims cases.",
   "created_utc": 1692489241,
   "score": 10,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxh0m3",
   "message": "Assumed innocent until proven guilty is absolutely a lie.",
   "created_utc": 1692488599,
   "score": 6,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwwzn3p",
   "message": "Against. No matter the person nor the crime, there's no excuse to kill someone, outside of self defence. It's not justice, its stooping down to the level of criminals and justifying it with a corrupt and sadistic form of justice. Plus, there may be a chance of rehabilitation that is not even considered or attempted, that would be the more ethical choice, to help them (while still condemning and punishing their actions) instead of killing them",
   "created_utc": 1692481372,
   "score": 10,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx0v1k",
   "message": "Yes,  I don't believe we have the right to choose weather someone lives or dies, despite the fact that that person likely did. Two wrongs do not make a right.",
   "created_utc": 1692481876,
   "score": 7,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx13bj",
   "message": "I'm against it.\n\nI honestly don't care about the murderers themselves. But when an execution is performed, we're *all* complicit (or active) in putting that person to death. The person who pulls the lever, the judge and jury who sentence him to death, the people who sit by and don't do anything. That makes us all co-murderers. And that destroys our souls. I look around me and see all the death and destruction in the US, and most people are just shrugging it off. We have become numb to violence, and capital punishment is just one of the reasons.",
   "created_utc": 1692481968,
   "score": 4,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx1sil",
   "message": "I kind of support it in extreme and clear cases, but to be honest, the movie The Green Mile, kind of made me rethink a lot of things.",
   "created_utc": 1692482252,
   "score": 2,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxd07d",
   "message": "Against..... To many innocent have been sentenced to death.",
   "created_utc": 1692486941,
   "score": 2,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx7db6",
   "message": "Against. Putting someone to death implies that you're absolutely certain they deserve it, because it can't be taken back. And absolute certainty is impossible.",
   "created_utc": 1692484533,
   "score": 5,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx0hea",
   "message": "Against. No one is irredeemable.",
   "created_utc": 1692481721,
   "score": 4,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx028n",
   "message": "Yes , pro death penalty for cold blooded killers and Child molesters",
   "created_utc": 1692481549,
   "score": 3,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxayf2",
   "message": "Against, too many innocent people are later freed after DNA or prosecution misconduct or police misconduct is uncovered.\n\nLife in prison is fine even with rock solid evidence.",
   "created_utc": 1692486057,
   "score": 2,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxkllg",
   "message": "I am for it under the right circumstances especially if it is a crime involving a child. The other part of me wants to say I’m against it so they have to live with their decisions for the rest of their life.",
   "created_utc": 1692490111,
   "score": 2,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx4dcz",
   "message": "Yes I am. \n\nThe problem is people who can't prosecute fairly or correctly. I'm reminded of that black boy who was executed without a fair trial. Also there's those families of victims who don't seek the death penalty for the convicted. \n\nI would like to reserve the death penalty for those who are truly evil and helpless, but our current system is; corrupt, racist, incompetent.",
   "created_utc": 1692483293,
   "score": 3,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxelr5",
   "message": "Only for pedophiles. I would've rather died than have what was done to me. I genuinely wish every day that they experience horrific suffering.",
   "created_utc": 1692487605,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwwz15l",
   "message": "Sometimes, it's the right answer.",
   "created_utc": 1692481118,
   "score": 0,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx0isv",
   "message": "For those where the evidence is just undisputable, yes. Bonus Opinion: Inmates convicted to life in prison should have the option to choose execution. If I was condemned to life in prison then I'd rather die then fester in prison.",
   "created_utc": 1692481738,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx9fqq",
   "message": "I'm for it in theory, some people just prove themselves unable to stay in our society.\n\nIn practice, it's too flawed though.",
   "created_utc": 1692485418,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxae0x",
   "message": "Im all for it, if there is no doubt that person committed that crime.",
   "created_utc": 1692485812,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx8z1n",
   "message": "The question of the death penalty treads the delicate terrain of morality and justice. While some argue for its deterrent effect, others emphasize the risks of irreversible errors. For me, the heart of the matter lies in the potential loss of a life, and the broader societal message it sends about our values and capacity for compassion.",
   "created_utc": 1692485222,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxf444",
   "message": "I don't like the possibility of the state being able to kill political opponents",
   "created_utc": 1692487815,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx0u66",
   "message": "I am for the death penalty for violent crimes. You wanna hurt someone else, why should you get to continue to live the life that you denied someone else?",
   "created_utc": 1692481866,
   "score": 0,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx26b2",
   "message": "Only for those with life sentences. If they’re never going to be a part of society again then there’s not much point wasting money and resources keeping them alive for decades.",
   "created_utc": 1692482407,
   "score": 0,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwwzy5p",
   "message": "Only for those we are 1000% sure are guilty. Also, I'm for death penalty for violent felons who are serving life in prison but have broken out, because obviously prison can't hold them. \n\nOther than that, no.",
   "created_utc": 1692481501,
   "score": 0,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx3w3a",
   "message": "I'm against it, but I'm also against the leniency in sentencing and would prefer the death penalty over life with parole sentences we see in the UK. Give them life in a cell, or a bullet to the dome, it's the only form of justice for 1st degree murder and its sick to think of your sibling/parent/child's killer being out in 12-15 years",
   "created_utc": 1692483099,
   "score": 0,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx8kge",
   "message": "If it means less criminals and we actually get rid of killers and rapists, sure go ahead and kill them, i'm not gonna be arrested for that kind of thing i'm not a son of a bitch like them.",
   "created_utc": 1692485049,
   "score": 255,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwwzsda",
   "message": "Only for violent or sexual crimes. Sex offenders have up to a 40% chance of recidivism within 20 years of release. If it’s just shy of a coin toss for a person to ruin another life, why take the risk.",
   "created_utc": 1692481435,
   "score": 252,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx9u8x",
   "message": "I'm against it, but not really.\n\nI have this feeling it's an easy way out, it's not a punishment. I feel we could benefit from human testing on live subjects, and what better pool to choose from than death row inmates.\n \nI also do want what the family feels is right, and if they want death- than so be it",
   "created_utc": 1692485583,
   "score": 0,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxchdq",
   "message": "I am for it. I understand the argument for the chance a person innocent of the crime they are being put to death for. I believe that the previous record of a person should also be taken into consideration when the death penalty is given and there are serious doubts about the conviction. If their record is full of violent crimes, well, then I think you gotta pay the piper. \n\nI also think the victim's family has the right to have someone commuted from the death penalty to life in prison\n\nBased on how the death penalty is handled now, I think it would be better to just get rid of it.",
   "created_utc": 1692486719,
   "score": 0,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxcmz5",
   "message": "Depends on the crime. I'm totally for the death penalty if the crime was against a child.",
   "created_utc": 1692486786,
   "score": 0,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxcooo",
   "message": "I'm for it in theory. You intentionally take a life, your life ends as punishment. That makes sense.\n\nBut I'm against it IRL. They get it wrong. Last I checked it was 4% of executions, they get wrong. You can't get that life back. Then what?\n\nDo we then execute the judge, jury, prosecutor for their actions resulting in the death of an innocent person? I think that would be equally fair, in a completely unfair situation.\n\nThere's no perfecting the process of death penalty, so just don't do it.",
   "created_utc": 1692486806,
   "score": 0,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxcvim",
   "message": "I'm very much for the death penalty. Some crimes are unforgivable, and some people pose such a danger to society that the only way to keep us safe from them is the ol' bullet.",
   "created_utc": 1692486889,
   "score": 0,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxd0g7",
   "message": "Absolutely for it. There are evil, sick, violent people in this world that need to be erased from it.",
   "created_utc": 1692486944,
   "score": 0,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxfp04",
   "message": "For severe crimes.",
   "created_utc": 1692488056,
   "score": 0,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwwzm9l",
   "message": "On a purely secular scale, it cleanses the gene pool.",
   "created_utc": 1692481362,
   "score": 252,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwwzncc",
   "message": "For if we have absolute proof of the suspect committing the crime.\nFor serious crime of course.",
   "created_utc": 1692481376,
   "score": 254,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx3y1z",
   "message": "For , certain crimes don’t deserve to be free ever again or to be housed and fed for the rest of their life",
   "created_utc": 1692483122,
   "score": 255,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx4l9f",
   "message": "Pro death for violent crimes.",
   "created_utc": 1692483383,
   "score": 254,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx4z6n",
   "message": "for. it reduces the amount of convicts in prisons and can act as a better deterrent.",
   "created_utc": 1692483541,
   "score": 254,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx7w5q",
   "message": "For some people just deserve to die",
   "created_utc": 1692484758,
   "score": 253,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx8dst",
   "message": "💯 for it. I don't think we use it as much as we should to be honest.",
   "created_utc": 1692484969,
   "score": 254,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx8ot6",
   "message": "For. In the case of obvious crimes caught on camera. Because that way those crimes can be truly punished in a timely manner.",
   "created_utc": 1692485101,
   "score": 254,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx1t79",
   "message": "I'm for it providing it's paedophiles, women beaters, child abusers and rapists that get put to death",
   "created_utc": 1692482260,
   "score": 255,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwwzp8a",
   "message": "I believe that if you willingly take a life, your life shall be taken. Im not clued up about this sort of thing so I don't know how to gauge the severity of crimes but I'm certain on my opinion that if you take a life your life shall be taken",
   "created_utc": 1692481398,
   "score": 250,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwx8sfg",
   "message": "Against, but only because the system isn't good enough to not execute innocent people.  The innocent people freed from death row by DNA evidence proves this.\n\nIf we had a perfect system (likely impossible) I personally would have no problem with the state putting murderers to death.",
   "created_utc": 1692485144,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxbe9g",
   "message": "For reference, I am a politically independent Christian, and so a good deal of my opinion directly draws from the Bible.\n\nI would say that I am against the death penalty, under the condition that the person in question is being prosecuted in a country with a sound prison system, both in that the system does not overly cruelly punish convicts and in that the prison is still a reasonably punishing environment that cannot be escaped to a reasonable standard. I believe that the standard for the value of every human life should be upheld. If we allow the death penalty to become too normalized, killing someone will eventually be seen as a reasonable way to end crime. But the thing is, ending crime is not the only point of the justice system; there should always be an element of helping convicts see the error of their ways and turn from it, all while keeping dangerous people away from common life for safety purposes. I think overall that the death penalty is too close to eugenics (i.e., this person is bad, just kill him so we don't have to deal with him), and I think we can all agree that eugenics was not a very morally upright movement. \n\nAnd as far as my religion goes, the main Bible passage I would reference to back up my opinion is the woman at the well. Jesus encounters a woman at a well, and talks with her, identifying the fact that she lives a sinful life of fornication. In Jewish law, she would have to be put to death by stoning. However, Jesus simply forgives her, and urges her to turn from her ways. The way I see it, Jesus sees the inherent human value of this woman and uses an approach of life, rather than one of death.",
   "created_utc": 1692486249,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxbvy7",
   "message": "With the current problems regarding innocent people being arrested for serious crimes they didn't commit, definitely against. I'd be for it if we had a way of making sure the person was guilty and if they committed a super serious crime, but with how  many innocent people get arrested it's a big no.",
   "created_utc": 1692486459,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxdhby",
   "message": "All other things would make me for it apart from the fact that we have found out people were innocent after they were executed. \n\nHad they been on a life term instead, they could’ve possibly attained the freedom they deserved. \n\nI know keeping people alive is more “costly” or whatever but then a lot of people die before their execution date or they don’t even get one for like 10 years.",
   "created_utc": 1692487139,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxdtqu",
   "message": "I am against someone being killed that doesn't deserve it. Considering the accuracy rating of the US judicial system, I'd have to vote against it.  \n\n\nThere are obviously cut and dry cases with full confessions, as far as I care, take them out back and shoot them in the head, bury them in an unmarked grave. The problem is every other case, and all of the innocent people rotting in prison too.",
   "created_utc": 1692487282,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxe3we",
   "message": "I’m against it mainly because the American justice system is largely rigged against the poor and people can and do get convicted of crimes they did not commit. If there is even a chance that we could execute an innocent man we should not be doing it. There are many cases where it is thought that a innocent person was executed, but they cannot definitively prove it in any case I’ve seen.",
   "created_utc": 1692487398,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxe3zj",
   "message": "Yes and no.  I cant seem to reason with myself.  I see both sides of the arguement and it bothers me tht I cant come to a conclusion.\n\nIs there a word for this?",
   "created_utc": 1692487399,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxeoe1",
   "message": "Because justice is not perfect and it is the one verdict you can never reverse. Even people who have pled guilty or even signed full confessions often have a story that is much more complicated.",
   "created_utc": 1692487636,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxf2a3",
   "message": "An actual life sentence with no prospect of freedom Is a much worse punishment then death, also gives more chance for those who are innocent to be free.\n\nBetter yet do what one of the Norwich countries do, might be Norway but I can't remember, their prison focuses more on rehabilitation, education and preparing inmates for the working world and it works, they have by far the lowest re-offending rates",
   "created_utc": 1692487794,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxfq79",
   "message": "Against. About the worst authority one can give the government is the authority to kill a person \"legally\". \n\nPersonally, I think we should move to an exile program for heinous and repeat offenders. Max 5 year prison sentences stateside and some sort of 3 strikes rule and you get dropped off on some deserted island in the Pacific sufficiently far from neighboring land, with the rest of the offenders that year. \n\nIf an exile does manage to somehow make it back stateside, and is charged with another felony, they get taken back to the island with that years shipment. If they manage to not get charged with any more felonies, good for them, they're rehabilitated. \n\nIf they manage to escape and flee somewhere else, good for them. Not our problem anymore and they get to decide whether they want to test their luck based on some other countries laws. \n\nPrison costs go down, because we stop holding people forever. The exiles get what they want, which is to live outside the law. And there's a clear expectation that you will shape up, or ship out, so I imagine the amount of repeat offenders would go down knowing they would have to go live mad max style with a bunch of other criminals.",
   "created_utc": 1692488069,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxfrgx",
   "message": "Not how it’s implemented currently. \n\nThe higher someone’s position of responsibility, the higher the punishment. If someone like a government official orders a massacre, well…\n\nThere’s also people who have caused suffering on such a world wide scale, maybe the death penalty is too nice.",
   "created_utc": 1692488083,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxfybd",
   "message": "I support it in principle - some people are evil, like that guy who intentionally ran over and killed 6 people and was defiant in court. But, I also don't trust law enforcement and the justice system to be fair and impartial about it. I'm sort of torn, which I suppose means I should err on the side of caution and be against the death penalty.",
   "created_utc": 1692488159,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxg0j0",
   "message": "No. It is better to not kill the guilty than to kill one innocent person by mistake.",
   "created_utc": 1692488183,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxgee9",
   "message": "Against. Hundreds of people have been set free from death rows around the US because they have been found to be innocent of the charge that sent them there. And the US has more than likely executed innocent people , as the criminal justice system here is very third world and unbalanced because of the wealth gap. The death penalty is not a deterrent, it’s biblical inspired state sponsored revenge murder. Please don’t confuse this with sympathy.",
   "created_utc": 1692488340,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxgzxx",
   "message": "Against. Pretty simple. There is a non-zero chance an innocent person could be put to death. For that reason, and that reason alone, I am against it.",
   "created_utc": 1692488591,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxh0h4",
   "message": "Idk for some it’s a blessing for others it’s a curse but I think it should be optional for prisoners like if I had a life sentence i would want to die, life in prison seems like hell I’m very spiritual and do not fear death !",
   "created_utc": 1692488598,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxh8gu",
   "message": "While I agreed that some people's actions should void their right to life, there is no system that is 100% accurate, meaning that innocent people have been wrongly committed and thus murdered by the system.",
   "created_utc": 1692488692,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxidzi",
   "message": "Against: no judicial system is 100%. So even if there's a chance of 1 innocent dying, then it's too much of a risk.\n\nHowever with some technology now days, the chances of a 100% verdict is getting closer, and there are some crimes that I wish death upon the perpetrator. Albeit a slow and painful one...\n\nOne that note, those who commit such crimes are usually well known inside prison before they get in. So their days are numbered by the time the gavel falls from the judge.",
   "created_utc": 1692489177,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxit0b",
   "message": "hmm its tough because the real monsters out there I don't think we should feed and house the rest of their lives... but we also lock up way too many innocent people.",
   "created_utc": 1692489355,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxjrr1",
   "message": "I am only for it when there is no doubt what so ever the person did it. Now that’s mostly for child predators and rapist in general. Drunk driving and kill some one? Suffer in a 10x10 cell the rest of your life reflecting on what you did.",
   "created_utc": 1692489763,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxk1jd",
   "message": "I used to be against and be for life imprisonment; but with the amount of people getting out when they are supposed to have a life sentence only to re-offend puts me in the 'for' camp.\n\nThe last person given the death penalty in my state in 1960 had it commuted when the death penalty was outlawed while he was on death row - and given a life sentence instead.  \nHe was let out in 2010 as he was a 70 year old man; and he killed again.",
   "created_utc": 1692489876,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxk3zt",
   "message": "For it 1000% and for the innocent people who have died because of the justice systems negligence I am sorry but we need to have the death penalty Always",
   "created_utc": 1692489905,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxkdju",
   "message": "quite frankly, I don't know. I want prison to be a rehabilitation facility. one where people get the services they need to deal with the impulses or emotions that led to the crime they were convicted of. one where, by the end of their sentence, the community welcomes them back into the fold. by that logic, I don't agree with the death penalty. they can't rehabilitate if they're dead.\n\nhowever this idea doesn't play well with the people who refuse to change. the threat of a repeat offender, especially for particularly heinous crimes, is enough to want to never release these people ever again. however, because of my ideal for prisons, I don't particularly agree with life imprisonment either. so the logic in my head turns right back around to the death penalty. the reason behind that logic being, if we don't intend to let them out, there's no reason to continue their existence.\n\nand of course, then there's the possibility of convicting innocents, which continues the loop of waffling back and forth about this.",
   "created_utc": 1692490016,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxki4q",
   "message": "The basis of American- and Enlightenment- justice in general is that it is preferable for the guilty to go free than to have the innocent be punished. \n\nCombined with the fact that it is impossible to resurrect the improperly executed, this means that the death penalty should be abolished",
   "created_utc": 1692490070,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxktkn",
   "message": "The first time the u.s. government executed an innocent person should have been the last time they were allowed to execute anyone at all. But to prop up this system most Americans don't even agree with we must accept the betrayed souls who everyone was \"sure\" did it. Those who carried their innocence to the grave, murdered by a state that simply sees it as the cost of doing business. I say, no more. Not one more.",
   "created_utc": 1692490206,
   "score": 1,
   "submission_id": "15vsfmm"
  },
  {
   "comment_id": "jwxkyon",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15vsfmm"
  }
 ]
}