{
 "submission_id": "15vtzgx",
 "title": "Who is the scariest person you have ever met?",
 "selftext": "",
 "created_utc": 1692484978,
 "permalink": "/r/AskReddit/comments/15vtzgx/who_is_the_scariest_person_you_have_ever_met/",
 "score": 135,
 "url": "https://www.reddit.com/r/AskReddit/comments/15vtzgx/who_is_the_scariest_person_you_have_ever_met/",
 "comments": [
  {
   "comment_id": "jwxdplo",
   "message": "Got a DUI back in 09.  Was taken to the Placer country drunk tank.  Guy with tattoos all over his face approaches me.  I think I'm for sure getting raped.  Nope, he wanted to offer me his roll of toilet paper for a pillow.  He introduced himself as the \"Sac City Psycho\". He told me he would watch over me to make sure nobody fucked with me, cause he could tell I did not have much experience in jail.  Now looking back on it, I guess for a few hours there, I was his bitch.  \n\nSuper nice guy tho, 10/10 would be his bitch again",
   "created_utc": 1692487234,
   "score": 224,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxe7ae",
   "message": "I was at a bar and this guy walks in and immediately it felt like I was on alert. My spine turned to ice when I saw his eyes look at me, they were almost sunken into his face, as if he was peeking our from behind a portrait. He moved like a cat stalking prey.\n\nOver time he made his way over to me and made polite conversation, but his words felt disjointed, almost like he was translating them before speaking them. There was nothing aggressive or insulting about anything he was doing. In fact, he was quite polite. but everything about this guy was setting off every nerve I had. He was even smiling through most of it, but it felt as if his lips were stapled back.",
   "created_utc": 1692487439,
   "score": 66,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxct5k",
   "message": "A former client. Not big enough to be truly scary but some day….\n\nHe did enough damage as it was. Beat two staff literally half to death. Broke another one’s nose for asking him to not pull their hair. So many concussions. Thousands of dollars in damages to both company property and staff’s: televisions, windows, doors, gaming systems, windshields, glasses, phones, teeth, bones… Literally every escalation every single day ended up being an attempted murder. We could, on a good day, expect 2-4 or them per shift. Sometimes lasting hours. \n\nThey got mad at us if we called the police to help us. They didn’t want him to “look bad” in the community. We weren’t officially forbidden from personally pressing charges but it was not encouraged. Everyone did everything to make sure he never faced any consequences. For the two staff he pulverized, he had to draw a picture to say he was sorry (he was almost 14). He finished the picture, looked the staff with him in the eye and said, “I’m not sorry. I’m glad I did it. I wish I’d hurt them worse. I wish I’d killed them.”\n\nIt was my job to work with him. When he wasn’t in a rage, he had his decent moments. In one calm conversation, we were playing Legos or something, I asked him if he’d like to talk about some ways to avoid hurting people when he gets angry.\n\nThe kid looks me dead in the eye and said, “no. I don’t want to stop hurting people. I like hurting people.”\n\nI asked him why.\n\nHe shrugged, “I just like it. It’s fun.” I believed him.",
   "created_utc": 1692486861,
   "score": 46,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwx94x9",
   "message": "A traumatized former child soldier from the Syrian Civil War. She casually told me about some of her experiences from the war and how she feels.\n\nApparently, she began to enjoy shooting at the enemy and the idea of killing people. She said that she \"took advantage\" of a civilian once. She had pictures on their social media of people that their militia supposedly killed. One time, she talked about how much she disliked how taboo cannibalism and necrophilia are. One time, she claimed that she tried necrophilia. \n\nShe seemingly had no empathy for anyone. I don't know how much of what she said is true, but she scares the shit out of me.",
   "created_utc": 1692485292,
   "score": 25,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwx9srw",
   "message": "My father is the only person I was ever actually scared of",
   "created_utc": 1692485566,
   "score": 13,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwx93dn",
   "message": "I live in New Mexico and met \"Big Dragon\" from beyond scared straight. He does outreach like that with troubled kids. I was working as a teacher at YDDC, they brought him down. Dudes no joke. I shook his hand and you could just tell, the only reason he was not killing people was he didn't want to, because if he did, the guards would have not been able to do anything about it.",
   "created_utc": 1692485273,
   "score": 28,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxa2d5",
   "message": "My mother-in-law says hold my beer.",
   "created_utc": 1692485679,
   "score": 10,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxhn4x",
   "message": "He wasn't scary when I met him, but I got very afraid along the way. My first boyfriend had become abusive near the end, and started stalking me after I broke up with him. \n\nI'll spare everyone the details, as I have a literal 10 cm thick dossier about it, since it took over 4 year for him to fully stop it. The last time I heard from him was 19 years ago, but in recent years I have noticed it affected me a lot more than I thought at the time.\n\nSo no big scary stranger, but someone i used to really love. But if I'm put in ia similar situation, for instance if someone just shows up at my home, I feel that same panic I felt a lot back then.",
   "created_utc": 1692488862,
   "score": 10,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxn9sc",
   "message": "I moved furniture when I was younger, and one time I moved a PPCLI Airborne guy. He was nice enough, but also, something about him was really unsettling. I used to hang with a pretty bad crowd, and some of them had done some bad things, but nobody I had ever been around made me as unsettled as this guy did. I can't really explain it.. he just had like this aura of predation, I guess. It felt like he was looking at you as if you were an insect. I don't know how else to explain it.",
   "created_utc": 1692491255,
   "score": 11,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxfcw3",
   "message": "When I was pretty young I was hanging out with an older friend, and I found out one of her close friends from school became a high ranking member of a cartel. He got cancer and was allowed to sort of \"retire\" from the cartel to spend the lasts few years with his family. I met him at a party of hers and we smoked a joint together. He was very polite but I had no intention of spending more time around him!",
   "created_utc": 1692487915,
   "score": 9,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxbfud",
   "message": "That guy on meth who broke into my house through the back door and left running through the front door once he saw my husband. Apparently he'd escaped, handcuffed, from the back of a patrol car and was trying doors to find a way to hide from the cops. It took four policemen to finally catch him; they had to tackle him to the ground.",
   "created_utc": 1692486267,
   "score": 7,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxbr0w",
   "message": "There was this hyper violent, super effeminate kid named Renault that I went to high school with. He had Goldust vibes, but like a more aggressive, more extroverted version. The rumor was he beat the shit out of a group of kids with a baseball bat just for talking shit to one of his friends. People vouched for the story, too. That kid scared the shit out of me.",
   "created_utc": 1692486400,
   "score": 6,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxmhh4",
   "message": "I've been debating on saying this for a really long time but I suppose since news on her died down, I can finally say it. I used to be best friends with Kayla Bourque.",
   "created_utc": 1692490916,
   "score": 5,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxrybx",
   "message": "My cousin. Hes a high ranked memeber in a pretty well known 1% motorcycle club. Dude stands maybe 5\"7 and Average build. No visible tats and super soft spoken. \n\nEverything about him says he should be a banker not a biker. I have never seen him even raise his voice once but that dude scares the absolute shit out of me. He gives off strong psycho energy.",
   "created_utc": 1692493233,
   "score": 4,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxmjbh",
   "message": "Scariest person i saw was my brother, but i'm probably the only person he doesn't want to hurt, he wouldn't probably hurt his daughter or my little sister, he did hurt me on accident but only ever on accident, we had a close call once when he took coke and thought i stole some of his drug money because i told his son that we will use his money if an emergency happen once but of course we don't steal, not even dirty money and we would give back when we can, not like it ever happenned and i said that if his son wanted lunch money because he didn't even give lunch money to him and his 3 siblings.\n\nOutside of who i mentionned he did hurt his boys and he did hurt my Dad and Mom and my big sister, he's scary because he's unstable and i know he really doesn't mean to hurt anyone but feel like he has to, he's currently in prison as usual but i don't really hate him considering what he had lived but it certainly doesn't pardon everything.",
   "created_utc": 1692490938,
   "score": 5,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxojrg",
   "message": "One of those fly-by-night traveling evangelical preacher types. His eyes were absolutely dead but people thought he had charisma. He was very Trumplike in a way - always using hyperbole and calling people he didn’t like by simple nicknames. This guy started a mini cult, took a bunch of money, and bolted. It was absolutely frightening the way this guy could command the room. I only watched him preach once, at my girlfriend’s church, but pretty every time he talked, it became a sermon. You can imagine the things he’d preach about… America first, Capitalism best, god ONLY,  everybody else hellbound. The way he so quickly took over those people’s lives was terrifying..",
   "created_utc": 1692491799,
   "score": 5,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxgz6s",
   "message": "TL;DR cop cuffs me and whispers in my ear like jason\n\n\n\nwhen i was around 15 my mother called the cops on me (different story)  \n4 officers come and throw me on the ground and put me in cuffs, the biggest of the 4 was a man who drug me up and began to make threats that you do not say to a timid 15 year old. Threats of physical and bodily violence because of what my lying manipulative mother told these officers, I was locked in jail and they did exactly what they said they would\n\n\n\nIf anyone wants more context I will give it, this is gonna get buried tho\n\n\nEdit one: since so many have asked, here’s the context, when I was 15 and living home with my mother, she’d constantly try to kick me out (never succeed at all because it’s illegal and she could have went to jail for child neglect) well this particular night I was accused of hitting a kid across the street and breaking his nose, which is relatively common in those days with me but this once I didn’t do it! Eel she called the cops on me and the other parents tried to press charges, when the cops get to my home my mother spouts lies about how I’ve repeatedly hit her (I have never) and how I’m extremely disrespectful and mean to her (which i was not). The cops believed her and turned on me, throwing me in the car with cuffs on and booking me in jail for 3 weekends before I was sent to juvenile justice court and found guilty of assault, anyways on that first night in the county jail the arresting officers came\nin and said i was being transported (which was a lie) and they took me in a holding cell where i was cuffed to a table and beat down by two big grown men, needless to say they made the promises come true that night and in fact i did never forget that night (no they were never charged and no i didnt get a chance to tell my mom because my dad was given custody and i moved back with him to chicago)",
   "created_utc": 1692488582,
   "score": 4,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxlacw",
   "message": "This (now ex)boyfriend of a friend of mine, he was already on probation with a five year sentence if violated\n\nAt first he was just pretentious, thinks that because he read such and such meant he had some classical or cultural superiority, and he’s able to recite “V-for Vendetta” by heart. Once questioned what brain damage I had because I didn’t eat beef\n\nAnd before the break up, his girlfriend’s arm got broken, but she claims it was accident\n\nLater, he head butted another friend of mine at the local coffee shop in our college town, my friend had a nosebleed so severe the staff had to power hose the blood off the porch. This ass home got a lifetime ban from the coffee shop and eventually almost every bar on Main Street \n\nMy friend had every right to report this physical assault but chose not to, which would violate his probation, because he feared that in five years this fucker will track him down for revenge \n\nA few months later, he sent threatening violent texts to another friend of mine\n\nThen one night at a bar just down the block where I lived, me and a few friends spotted he was on a date. But by the looks of it, the woman he was with clearly had something slipped in her drink and had to alert the staff to not let her out their sight for just in case\n\nEventually he moved out of town, and then I hear he got arrested for physical battery up state. So I go online and see his mug shot, Jesus Christ this fucker looks like he was doing meth",
   "created_utc": 1692490409,
   "score": 2,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxo9jg",
   "message": "Many years ago in high school I was introduced to a group of people, among them a boy that was dating a friend of a friend. He turned to look at me and it was like looking at someone who wasn't actually there. His eyes were just emotionless and dead, like looking at a bad painting of a doll's eyes. The only feeling I got from him was he was sizing me up, to see what he could get from me, and he'd have no problem hurting me to get it. I immediately wanted to leave. \n\nAfter my friend and I got back into the car I told her that guy was bad news and her friend needed to break up with him. She asked me why and I just said I didn't know, there was just something wrong with him. A week later she did indeed dump him (he started freaking her out somehow, I don't know the details), and I never hear a thing about that guy again. I would not be surprised to find out he was in prison though. This happened decades ago and I've never forgotten it.",
   "created_utc": 1692491681,
   "score": 2,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxrbyt",
   "message": "I got arrested for public intoxication in the late mid/late 90's and was put in a cell with a random guy because the drunk tank was full. About ten minutes later, I was woken up and hastily moved to an adjoining cell. I visited with the guy in the first cell I was in for the few hours I was there. When I was bailed out, I bumped knuckles with Gary, guy in other cell, and left.\n\nI later found out he was Gary Klapas, and he was being held on 1st degree murder and dismemberment of a body of a college student. \n\nI also found out that later in the day, after I left, he beat the next guy who was put in his cell nearly to death.",
   "created_utc": 1692492970,
   "score": 2,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxrh67",
   "message": "https://www.oregonlive.com/portland/2015/11/southeast_portland_man_accused_8.html",
   "created_utc": 1692493030,
   "score": 2,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxu0ch",
   "message": "My freshman year algebra teacher. Everyone else in school said he was genuinely a great guy. I believe them, but I personally had a bad year with him. My ADHD mess weren't really working that year, so I never paid attention in his class, so he kept calling me out for it in front of the class. In general, he was also just really scary-looking. He had weird proportions. Large, neanderthal-ish head, arms too long, generally huge. Not his fault, just creeper out my tiny, baby sensibilities.",
   "created_utc": 1692494129,
   "score": 2,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxusum",
   "message": "I don’t know about scariest but a few weeks ago this kid that couldn’t have been more than 10 was bullying my 4 year old son. I told him to stop. He continued. I told him to stop again. He continued. Right in front of me. So I pick my son up and as I walk away with him he yells “you’re ugly and your dad is too!” Later I decided that kid might have been an actual psychopath. Kid had a weird vibe. Sucks for him but someday someones gonna punch him in the face and hes totally going to deserve it.",
   "created_utc": 1692494484,
   "score": 3,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxvdyl",
   "message": "Myself",
   "created_utc": 1692494742,
   "score": 2,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxdf34",
   "message": "A guy followed me home at night while I was listening to music, I only heard his footsteps when I was about to turn the corner. Scared me shitless. He was an inch away from me and wearing all black and when I noticed him he kept going but turned back to ask for my insta and name. Now I laugh about it because he was about 4 inches shorter than me",
   "created_utc": 1692487113,
   "score": 4,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxhuto",
   "message": "In my old school, I knew this kid that had little to no conscience.\n\nHere are a list of notable things that he did:\n\n* He had a whole manifesto on why he despised god\n \n* Said the N-Word (Hard R) close to 100 times in less then 5 minutes\n\n* Said just about every slur in the dictionary\n\n* Modeled guns, hand grenades, weapons and a bunch of other weird shit almost every single day in my art class\n\n* Stabbed a kid with a pencil because he was black\n\n* Made even the school counselor turn against him\n\n* Flashed himself to me\n\nHe was only there for 1 year because at the last day the entire school decided they had enough of him (BTW this school was like 90% POC in an extremely liberal county and he was a pale ass white kid) so this whole ass mob of like 30 people beat the absolute SHIT out of him.  \n\nIt’s even scarier because I don’t know where he is or what he’s doing now and I was one of his worst enemies.  Like, he was sending literal death threats to me.  \n\nI’ve also met a mentally ill person who’s killed and disposed of their own children but honestly that’s a story for another time.  I’m way too creeped out rn.",
   "created_utc": 1692488953,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxhhde",
   "message": "Met him on a bus in town, do not know him , but gave me a feeling of my hated nemesis. Like he was going to be the one who kills me. What a weird feeling..z weirdly enough, haven’t seen him a few years ago, and since not seeing him I feel somewhat normal…",
   "created_utc": 1692488794,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxpdeq",
   "message": "Myself",
   "created_utc": 1692492149,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwx8mhf",
   "message": " I once met a dude who thought pineapple on pizza was a good idea. Now that's some terrifying taste buds right there.",
   "created_utc": 1692485074,
   "score": 253,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxi1hf",
   "message": "Me",
   "created_utc": 1692489032,
   "score": 255,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxirow",
   "message": "myself",
   "created_utc": 1692489339,
   "score": 255,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxghje",
   "message": "One of the kids who bullied me in school. She was thin as hell sure but she bragged about how she would go too far in her martial arts classes and physically harm other kids. She brought pepper spray to school a couple of times too. Also owned a butterfly knife. Teachers seemed to love her too for some reason. The past year of school was spent constantly watching my back so I wouldn't get murked or some shit\n\nComing up at number 2 is probably my mom, I'm not gonna get into that one though",
   "created_utc": 1692488374,
   "score": 0,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxnmn3",
   "message": "I suppose the first homosexual who raped me.",
   "created_utc": 1692491411,
   "score": 0,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxft1o",
   "message": "Some other person. Not me.",
   "created_utc": 1692488100,
   "score": 255,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxm0lr",
   "message": "My stepbrother who was 2 years older than me.  Life became hell once he moved into my childhiid home.   Couldn't be alone in the house with him or  I'd be assaulted.  Was very happy when he joined the Navy at 17.  I wasn't unhappy when I heard that he got MS.",
   "created_utc": 1692490718,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxm2t3",
   "message": "All Porn Stars online",
   "created_utc": 1692490745,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxqla4",
   "message": "Gerald Gallegos. Serial killer.",
   "created_utc": 1692492660,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxsip6",
   "message": "Met two serial killers in hospital, one who killed a multitude of sex workers and another that murdered her kids.",
   "created_utc": 1692493476,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxtyqv",
   "message": "Did an internship at a jail, met a dude awaiting trial on a triple homicide, guy just had that vibe around him that just made you feel uncomfortable. Just being in his presence you could feel the air change around you and everyone in that room felt and respected it.",
   "created_utc": 1692494111,
   "score": 2,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxtz2m",
   "message": "Sr Denise OP",
   "created_utc": 1692494115,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxu01k",
   "message": "Debt collector for the mongrel mob. All I can say is I'm glad I didn't owe him money.",
   "created_utc": 1692494126,
   "score": 2,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxunsv",
   "message": "I wasn’t scared of him but I met Chris Benoit once.",
   "created_utc": 1692494424,
   "score": 2,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxv1br",
   "message": "A guy that ended up having his own episode of the TV show \"I Almost Got Away With It\"",
   "created_utc": 1692494588,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxvhp8",
   "message": "I once as a medical student was doing a rotation in the state mental prison.  We had to basic physical on this guy.  There was a chair in the middle of the room, bolted to the floor.  He had cuffs on his wrists and feet secured to the chair.  9 guards were in the room surrounding us, not more than 5 feet from the chair in a circle.  He was off, just not there and didn't want to cooperate.  He looked at me, saw my coat and said \"that guy is from the university, I want to talk to him.\". Still don't know what he had done but after a few months of the rotation no one else had that degree of security for medical visits.  No one else was even close.",
   "created_utc": 1692494790,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxvvuh",
   "message": "One of the people I grew up calling an uncle was actually a hit man for the mafia. I loved him to death and never would have imagined it, but everyone who knew him and his reputation was terrified of him. I only learned of what he did after he disappeared, I miss him he was always really good and kind to me and my siblings, but damn learning what he did was terrifying",
   "created_utc": 1692494965,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxweao",
   "message": "A murderer who stabbed his *known* victim 70+ times. I can't explain the feeling I felt while being around him frequently, but my mind/body knew he was going to kill someone soon. A true psychopath to the point a TV documentary episode was made.",
   "created_utc": 1692495199,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxwfa5",
   "message": "I once fired a guy and a few months later he bombed a church",
   "created_utc": 1692495212,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxwoub",
   "message": "Was a a total dive bar with super cheap beer. Was having fun until some of the patrons started comparing hand guns.",
   "created_utc": 1692495328,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxx6zo",
   "message": "John Gotti",
   "created_utc": 1692495554,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxxoiq",
   "message": "To me, my dang mom",
   "created_utc": 1692495769,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxxwdz",
   "message": "My dad",
   "created_utc": 1692495865,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxxzvd",
   "message": "My Dad.",
   "created_utc": 1692495910,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwxytw7",
   "message": "my mother.",
   "created_utc": 1692496278,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwy26lr",
   "message": "Psychopath kid that sat next to me in 7th grade.  It was a long table with chairs, not desks, so literally inches away.  Thankfully, this was the 80’s when teachers literally did not give a shit, so the guy was able to torture me all year.  I think the teacher was afraid of the kid.  Thankfully it didn’t scar me or give me PTSD, because I was told to “man up”",
   "created_utc": 1692497774,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwy271s",
   "message": "Was hanging out and drinking with a friend of mine when he said a guy we knew wanted to come over. I said no because he gives off mass shooter vibes but my friend invited him anyway.\n\nWe were all hanging out and having a good time and my friend drunkenly mentioned what I had said about the guy. I shot my friend a \"why the fuck would you say that\" look, expecting the guy to be offended. Instead, he smiled and asked, \"how many bodies you think I could get?\"",
   "created_utc": 1692497780,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwy2z22",
   "message": "Marine Gunnery Sgt. I. D. Jenkins. He was my drill instructor when I was in ROTC. He was only about 5’9”, and he didn’t weight 170 lbs. soaking wet. But we all knew that if he wanted to, he could kill all of us with in a matter of minutes.",
   "created_utc": 1692498142,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwy31oh",
   "message": "My older step brother.\n\n\n\nHe grew up to be a skin head. Has \"white pride\" on his calves. Antichrist symbol on his hand he got done while in prison. He's buff AF, loved to fight, loved to talk shit, was openly racist to people minding their own business.\n\n\nI watched him beat the ever living fuck out of a few people.\n\n\nOnce at a party a van rolled up to jump one of the guys there. They literally said, \"go get Ryker\" as he was in the house. He came out with a single-hand hatchet and kept 5 guys at bay until they left... All on his own.",
   "created_utc": 1692498178,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwy38s6",
   "message": "Myself. I pretty much look like a vampire (high cheek bones, pasty white skin, icy blue eyes, full lips, long blond hair, and a slightly up turned nose), and the most twisted parts of my mind scare me because despite everything that's wrong with this world, I've somehow managed to keep my sanity.",
   "created_utc": 1692498273,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwy3l6w",
   "message": "My grandpa's 2nd wife Angie. She was a hateful woman. I don't believe in people being 100% anything but she was pure evil. Had a collection of porcelain dolls in a corner of their house when I was very young and she would always try to talk to me *through* them. One time I touched a Pillsbury dough boy figure on her shelf and she swatted my hand with a metal ruler. Eventually she pretty much overdosed my grandpa on morphine and he died. She was in her 70s when I was a young kid, I'm 30 now. I heard from my aunt that she's still alive somewhere near where she lived with my grandpa (which makes me believe she is some kind of hag witch) and that she's committed insurance fraud like, a lot.",
   "created_utc": 1692498439,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwy3sxl",
   "message": "my mom",
   "created_utc": 1692498545,
   "score": 1,
   "submission_id": "15vtzgx"
  },
  {
   "comment_id": "jwy4c36",
   "message": "John Wayne Gacy",
   "created_utc": 1692498811,
   "score": 1,
   "submission_id": "15vtzgx"
  }
 ]
}