{
 "submission_id": "15vttgd",
 "title": "What meal traumatized you as a child ?",
 "selftext": "",
 "created_utc": 1692484563,
 "permalink": "/r/AskReddit/comments/15vttgd/what_meal_traumatized_you_as_a_child/",
 "score": 139,
 "url": "https://www.reddit.com/r/AskReddit/comments/15vttgd/what_meal_traumatized_you_as_a_child/",
 "comments": [
  {
   "comment_id": "jwxe9yg",
   "message": "Liver and onions",
   "created_utc": 1692487471,
   "score": 105,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwx7pdp",
   "message": "Boiled elbow macaroni (no sauce, no butter- just macaroni) and freezer burned green beans. \n\nNot from any fault of the meal, but because that was the absolute last of the food in the house, and there wouldn't be any more until Mom got paid again.",
   "created_utc": 1692484678,
   "score": 60,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxftmu",
   "message": "in the 1990's. boiled brussel sprouts, mushy, bitter awful.\n\nthen something magic happened, A dutch plant breeder spent 10 years making them not suck; now Brussel sprouts (especially cut in half and baked with a bit of olive oil and pepper) are my favorite food.",
   "created_utc": 1692488107,
   "score": 77,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxayz9",
   "message": "My aunt \u0026amp; uncle were babysitting us kids and served us spaghetti noodles with canned cream corn on top",
   "created_utc": 1692486064,
   "score": 34,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwy1038",
   "message": "Waldorf salad - my family's particular version is chopped apples, bananas, walnuts, smothered in mayonnaise. \n\nTo this day, the smell of mayonnaise (or anything containing it) makes me gag",
   "created_utc": 1692497232,
   "score": 32,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxp82q",
   "message": "I hate Cornflakes, when they go all soggy they used to make me gip and almost throw up.\n\nOne day there wasn't enough Weetabix left for breakfast so my Dad mixed Weetabix and cornflakes in a bowl and put it in front of me and kept shouting at me for not eating it, saying I wasn't allowed to go outside to play if I didn't eat it all. It had been snowing so I really wanted to go. I was like 3.  I've not had Cornflakes since.",
   "created_utc": 1692492087,
   "score": 22,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxwg9f",
   "message": "I grew up with two working parents, so dinners were usually quick and easy. One of their favorites was that Chicken Tonight chicken cacciatore that was popular in the early 90’s. I *despised* that meal and we had it at least once a week if not more. It was always with canned green beans and boxed mashed potatoes. Every week. For years. I have never been so grateful for a product to be discontinued in my life.",
   "created_utc": 1692495224,
   "score": 18,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxvfqr",
   "message": "my dad always had a problem with me being fat so he cooked this soup containing water, vegetable broth, canned tomatoes and cabbage turnip. If I tell you this shit was ass I mean it. I ate that 3 times a day and you best believe I put all the salt in there and it still felt like committing a war crime eating it.",
   "created_utc": 1692494765,
   "score": 18,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxn2cn",
   "message": "The steak my mom made. I've always hated steak but I especially hated hers. It was so tough, the only way I could eat it was by drenching it in ketchup to hide the taste. The texture was unavoidable no matter what. One day I had enough. She put it in my plate and I refused to eat it. She made me sit at the table until I ate it, but I refused. I sat at that table for 3 hours refusing to eat the steak. Eventually she brought me a book about vegetarianism (I had been thinking about going vegetarian for a while) and she said the only way she'd let me leave the table was if I made all of my own vegetarian meals for a whole week.\n\nI've now been vegetarian for 20 years and I love it.",
   "created_utc": 1692491165,
   "score": 57,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxzhtg",
   "message": "Fish cakes. I refused to eat them cause I didn’t like them but I had to sit at the table till my food was gone. One night when I was about 8, my stepdad grabbed the fish cake off my plate and shoved it into my mouth, holding me so I couldn’t escape and held his hand over my mouth so I couldn’t spit it out. Won’t eat anything fish related to this day. I don’t talk to my mom or him either.",
   "created_utc": 1692496571,
   "score": 14,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxac24",
   "message": "Camel fat, my grandma made me eat it she is a big believer in not wasting anything, I’m very grateful for it  and I’m down to eating it again but something I’m not down to eat ever again is hot blended banana I thought it was tea with milk",
   "created_utc": 1692485791,
   "score": 12,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxndnm",
   "message": "My moms pancakes. They were always raw in the middle. 🤮",
   "created_utc": 1692491300,
   "score": 11,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwx9fwp",
   "message": "German pancakes. My mother called it \"Dutch Baby\". I was never quite traumatized but I would always feel slightly bad for the babies, and wonder how she acquired them.",
   "created_utc": 1692485420,
   "score": 32,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxvgkl",
   "message": "Baked chicken and white rice, I grew up very poor in the 80s and early 90s and this was the cheapest meals my parents could make. I had this at least once a week of not twice week. It's so bland and I ate it so much it made me gag.",
   "created_utc": 1692494776,
   "score": 11,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwy7y8r",
   "message": "Microwaved Frozen Lima Beans in BBQ sauce. My mom would get furious that we would refuse to eat it. Just awful.",
   "created_utc": 1692500589,
   "score": 10,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwx7n0j",
   "message": "Beef tongue",
   "created_utc": 1692484650,
   "score": 20,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwy75w0",
   "message": "Hoghead cheese. My great grandmother would make it whenever we slaughtered a hog. I would get a slice of hoghead cheese and bread for lunch for weeks after.",
   "created_utc": 1692500196,
   "score": 9,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyk4q1",
   "message": "Coming home from school to my mom cooking liver and onions. HOW IS THE BODY’S TOXIN CLEANER EDIBLE?!?!",
   "created_utc": 1692507185,
   "score": 10,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxmuhn",
   "message": "Canned spinach or canned asparagus with sliced hard boiled eggs. \n\nFresh spinach and asparagus are so much better.",
   "created_utc": 1692491071,
   "score": 8,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwy7w5x",
   "message": "Canned hominy",
   "created_utc": 1692500561,
   "score": 7,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyfwr7",
   "message": "Boiled chicken and crinkle fries on a pan. My mom made this at least once a week. There were 14 kids and my parents. We ate like we were in a prison. 😆 The chicken had no seasoning and the crinkle fries were mushy. I refuse to make food without seasoning. If anything, I over season to compensate for the lack I had as a kid! 🤪",
   "created_utc": 1692504721,
   "score": 8,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwy0nr1",
   "message": "Being forced to eat overcooked vegetables without any kind of seasoning. \n\nMy mother is from the generation that believes salt will make you fat, and she doesn’t like anything spicy. Black pepper is spicy to her, for context.",
   "created_utc": 1692497078,
   "score": 7,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxnm4p",
   "message": "Stuffed green bell peppers, the horror.",
   "created_utc": 1692491404,
   "score": 12,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxcycr",
   "message": "Roast gander. I knew that gander personally. My folks moved to a croft when I was 16 \u0026amp; still in school. We adopted a bunch of farm animals \u0026amp; loved them, hugging them \u0026amp; stuff from babyhood. We had four \"geese\" who turned out to be one goose \u0026amp; three ganders. My folks killed one of the ganders \u0026amp; served him up for dinner. I since became vegetarian.",
   "created_utc": 1692486921,
   "score": 5,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxlpkx",
   "message": "“Chicken nugget casserole.” Leftover chicken nuggets mixed with green beans, rice, and tomato sauce. I refused to touch it and sat at the table for hours until my father gave up",
   "created_utc": 1692490586,
   "score": 6,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxm5x3",
   "message": "Two I can think of. Baked salted cod. I could smell it cooking aaaalllll day and the anticipatory dread was…something. The other was orange flavored beets. My mom used to cook all kind of disgusting “healthy” foods she wouldn’t eat herself but forced us to eat. We couldn’t leave the table until we ate it, so we spent many a night painting our lips red with the beet juice, hoping we could be excused without eating it.",
   "created_utc": 1692490780,
   "score": 6,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxvdvp",
   "message": "When mom cooked “steak” it was London broil and she cooked it to the point were it sounded like you were sawing through a piece of wood. The all time worst was when she made spinach soufflé. I was maybe 6 or 7, at the time and no matter what it wasn’t going down. I wasn’t leaving the table until I finished it. Tried to feed it to the dog and he noped outta there. She went to the bathroom I threw it in the garbage. She went thru the garbage saw it and then gave me a whole new piece. Sat at the table for 4 hours and she finally gave up. I went to bed. I came down the next morning and asked what’s for breakfast?  She saved it and tried to feed it to me again. Went to school w/out eating breakfast that day. Was grateful for the school lunch hockey puck hamburger.",
   "created_utc": 1692494741,
   "score": 6,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxygdg",
   "message": "Deep-fried eggplant. I still won't eat eggplant in any form.",
   "created_utc": 1692496112,
   "score": 5,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwx97ac",
   "message": "Okra",
   "created_utc": 1692485321,
   "score": 15,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxh8k4",
   "message": "My preschool teacher would force feed me mushy apples. If i refused i’d have to swallow vinegar as a form of punishment.",
   "created_utc": 1692488693,
   "score": 6,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxtqsd",
   "message": "Tripe and Onions. My caregiver growing up would make this weekly for her husband and the smell would linger right through their house ughhhhh",
   "created_utc": 1692494013,
   "score": 4,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxypw3",
   "message": "Stuffed bell peppers. The texture is horrible.",
   "created_utc": 1692496230,
   "score": 4,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxfb9h",
   "message": "Menudo. \n\nLove Hispanic foods, but.....",
   "created_utc": 1692487896,
   "score": 11,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxdsuo",
   "message": "Nothing really that my parents made, but I had a friend who invited over for dinner, and the whole family meal was just buttered noodles\n\nTo be fair, I've eaten plenty of struggle meals that would probably gross other people out",
   "created_utc": 1692487272,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxftx0",
   "message": "Chicken Liver. They were my mom's favorite, and she assumed they would be mine.",
   "created_utc": 1692488110,
   "score": 4,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwy0iyp",
   "message": "My mom tried to make this fancy salad. It was a square of orange jello with shredded carrots in it, placed on top of a leaf of lettuce. To make it even more “fancy,” she placed a dollop of mayonnaise on top. No one ate her fancy jello salad concoction at her fancy dinner party. We all had a good laugh though.",
   "created_utc": 1692497021,
   "score": 4,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwy26nz",
   "message": "Squirrel stew.  Liver mush.  Liver and onions.  Frog legs.",
   "created_utc": 1692497775,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyhaqq",
   "message": "Dry ass pork chop. That feeling when you can’t chew it enough to be able to get it down. 🤮",
   "created_utc": 1692505520,
   "score": 4,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyjumm",
   "message": "Generic fish sticks. It's been 40 years, and I still won't eat ANY fish",
   "created_utc": 1692507017,
   "score": 4,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwym9xj",
   "message": "Kidney pie....my father was a nephrologist",
   "created_utc": 1692508485,
   "score": 4,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwymhud",
   "message": "I spent the night at a friend’s house and in the morning for breakfast they handed me a plate of scrambled eggs absolutely drowning in ketchup. It was truly terrible.",
   "created_utc": 1692508620,
   "score": 4,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwypk2u",
   "message": "I came in here thinking I would bond with others over eating my dinner as a child and then being informed it was my pet cow 😭😭 then realized maybe my childhood was different than most??",
   "created_utc": 1692510584,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyqo4w",
   "message": "Beef Stroganoff. \n\nOne summer, when I was about 7 or 8, we were all sitting at the table eating dinner. Mom asked my Pops to click the ceiling spinner on because, California summer + just cooked a meal for six in an old un-air conditioned house = hot as piss. \n\nHe did as she'd asked. It started to spin. I've got a big ass mouthful of creamy, delicious s-noff in my gobber. The fan speeds up to full speed. \n\nSide bar: We lived in a very old house smack dab in the middle of a GIANT grape vineyard owned by a fairly large winery. They owned all the surrounding land except for our long driveway and the plot we lived on. So there were lots of bugs, snakes, and spiders around growing up. It wasn't unusual to find a snake in your sock drawer (this happened to one of my sisters, like, 3 times in one year) or a large spider in the sink. \n\nAnnnnyway, the fan speeds up, and as I'm chewing a huge, Armor-shelled roach plops straight onto my plate. I'd seen normal roaches before, Ma had to bomb our house at the beginning of every picking season. A normal little roach this was not. It was King Roach. I promptly projectile vomited all over my plate, the bread and butter board behind my plate, and almost to my sisters husband's plate across the table. \n\nCue chaos. Ma is screaming, sisters, Pops and BIL are laughing like loons, and the babies and myself are crying like it's the end of the world. \n\nI can't stand the smell now. Can't bear to even look at it. It always makes my body go :gag sound: now and that was 30 years ago.",
   "created_utc": 1692511329,
   "score": 5,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxtk2v",
   "message": "Tuna fish casserole",
   "created_utc": 1692493931,
   "score": 6,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwx8omr",
   "message": "Fish. Fish gives me the barf.",
   "created_utc": 1692485099,
   "score": 8,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxf7ok",
   "message": "Barbecue chicken pizza. After a couple bites, I vomited all over the place and I cannot stand barbecue sauce anymore. I haven’t had it purposefully since that day. The smell makes me gag and gets really close to vomiting, and I don’t vomit easily. I want to like chick fil a sauce cause everyone talks about how amazing it is, but I hate it because of the hint of barbecue sauce it has. Fucked up chicken for me for a few years too. I think about it every month or so. I believe that is the only time I’ve ever thrown up in my life without having some kind of illness. I remember it pretty well considering I was 3 years old when it happened",
   "created_utc": 1692487856,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxgtj6",
   "message": "Shepherd's pie. My mother makes the worse I've ever tried. She knows I hate it (even thrown up on more than one occasion) and still makes it. Since I am poor, I can't eat much else.",
   "created_utc": 1692488515,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxho2y",
   "message": "Boiled brussel sprouts. Any type of organ meats like fried liver, heart, kidney.",
   "created_utc": 1692488874,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxoy7u",
   "message": "Horse meat, weird smell and bad taste (back when I was a child). not sure they still sell horse meat here 25 years later.",
   "created_utc": 1692491970,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxr7m5",
   "message": "Lobster.  \n\nI was about 6 years old, we were at my Uncle's place, and he had a guest come in from the Maritimes with about a dozen lobsters. I was horrified.  \n\n\"You're eating ***bugs***!!\" They tried to get me to taste it, no way.  \n\nNow I love the stuff, but back then, it was really traumatic.",
   "created_utc": 1692492918,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxrj3v",
   "message": "Pickled Pig feet",
   "created_utc": 1692493051,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxxz8b",
   "message": "It's pretty tame compared to most of these answers, but mine was Campbell's Alphabet Soup with flour mixed in. I was about 12 and my 19 year old sister was babysitting. All she had to do was mix 1 can soup with 1 can water, but apparently she thought the soup looked too thin so she added some flour. So I ate Alphabet Soup with little clumps of flour in it. Yuck.",
   "created_utc": 1692495901,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwy2eo4",
   "message": "salmon patties. traumatized me forever.",
   "created_utc": 1692497879,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwy9mu9",
   "message": "Tongue and head cheese. 🤢",
   "created_utc": 1692501436,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyft4w",
   "message": "Oyster stew… my dad loves it and made me eat it when I was a kid. Threw it up and haven’t had it since.",
   "created_utc": 1692504666,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyfuso",
   "message": "Beets! \n\nI still hate them today",
   "created_utc": 1692504691,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwym4ar",
   "message": "Liver and peas",
   "created_utc": 1692508389,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwymdnw",
   "message": "I stayed the night with a friend in like 3rd grade. Her mom made meatloaf for dinner and I had never had it before. The mom left these entire full bay leaves in the meatloaf. I took one bite with a huge bite of bay leaf and I couldn’t do it. The mom actually got so mad and upset that I got in trouble for wasting food. I never ate meatloaf again.",
   "created_utc": 1692508548,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwymgem",
   "message": "Salmon in a can",
   "created_utc": 1692508595,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyoyys",
   "message": "I remember being a kid and my aunt made us spaghetti but instead of tomato sauce she used ketchup. I guess there was a flu going around but before I knew it that was coming back up noodle chunks and all. To this day I'm not a big spaghetti fan",
   "created_utc": 1692510195,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyptc2",
   "message": "Brussel sprouts. I had an evil stepmother and she would boil Brussel sprouts with no seasoning. For some reason she referred to them as “smurfs”? To this day I won’t touch them even though people have told me they can taste good when prepared properly.",
   "created_utc": 1692510750,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyq4q8",
   "message": "Lobster loaf. My uncle used to live in Maine and sent us some lobsters. My mother took her recipe for salmon loaf that normally used canned salmon and substituted leftover lobster meat. Horrific.",
   "created_utc": 1692510962,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyr59m",
   "message": "Coleslaw",
   "created_utc": 1692511654,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyvxb8",
   "message": "Chicken liver 😩😩😩",
   "created_utc": 1692515086,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyjzgi",
   "message": "SPAM",
   "created_utc": 1692507098,
   "score": 5,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxw2t6",
   "message": "Kielbasa and sauerkraut. \n\nSauerkraut is pure evil.",
   "created_utc": 1692495053,
   "score": 4,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxb511",
   "message": "Rice with apple and cinnamon. I don't know how they made it but we had it all the time in elementary school and it was worse quality than you can even imagine. Now I cannot even look at it",
   "created_utc": 1692486136,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxnmpe",
   "message": "Russian Xmas Eve Dinner",
   "created_utc": 1692491411,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxqj8l",
   "message": "Tuna casserole, Brussel sprouts, and pinto beans with spinach in them. All of these eww.",
   "created_utc": 1692492638,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxs9ee",
   "message": "Chocolate.\n\nIt was a ball of chocolate filled with some sweet cream inside. What was my surprise when i bite the chocolate cover, and inside was moldy. Yeah. Very traumatizing. I didnt come to eat, but i still remember that nasty taste.",
   "created_utc": 1692493366,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxsbrh",
   "message": "Chunky meat loaf",
   "created_utc": 1692493394,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxugdl",
   "message": "Liver and bacon casserole!",
   "created_utc": 1692494332,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxw7xy",
   "message": "boiled carrots are the worst",
   "created_utc": 1692495120,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyeybg",
   "message": "Lima beans",
   "created_utc": 1692504191,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwym4z6",
   "message": "Liver and onions, corn flakes, and canned beets (the last cause I was force fed it by my late godmother as a punishment from my mom).",
   "created_utc": 1692508400,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyqayx",
   "message": "Goat tounge, eyes and head curry. I was chewing on a piece of the tongue and ended up also biting my own tongue",
   "created_utc": 1692511078,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwytonu",
   "message": "Sheep brain",
   "created_utc": 1692513437,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwz00jz",
   "message": "Anything cooked by my mother,, the only person I know who created a meal  of boiled chicken, white cabbage and potatoes unseasoned and all the same colour.",
   "created_utc": 1692518240,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyak8d",
   "message": "My mom would make a thin broth soup out of a head of cabbage or a bunch of green beans, potatoes, and a can of corned beef.  It was ok the first day but she would keep it and serve it again and again until it was gone.  But the meat and potatoes were gone the first day and all was left was broth with a film of fat on top.  It was bad.   But pretty much everything she cooked was bad.  The only spices allowed were salt and poultry seasoning.   No garlic.  No onions.  No pepper or anything even remotely spicy.    \n\nHer chili had no heat at all and the sauce was based on ketchup.  So basically ketchup, water, red kidney beans, and ground beef.",
   "created_utc": 1692501896,
   "score": 3,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwx7mad",
   "message": "Dry unseasoned chicken breast",
   "created_utc": 1692484641,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxkej5",
   "message": "liver with onions my grandfather traumatized me with the fact that it was human liver and it was also disgusting",
   "created_utc": 1692490028,
   "score": 2,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyrmih",
   "message": "Family couldnt cook onions properly to save their live. I still despise onion in general.",
   "created_utc": 1692511982,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwyqrgt",
   "message": "Who gets traumatized by FOOD??",
   "created_utc": 1692511393,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxyw9o",
   "message": "rice cakes with peanut butter",
   "created_utc": 1692496308,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxlkby",
   "message": "Nothing.  I have never been traumatized by a meal.  Is this really a thing?",
   "created_utc": 1692490527,
   "score": 0,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxjgg6",
   "message": "\"you know what you did wrong\"\n\n\"no i don't pleas tell me\"\n\n\"you know what you did wrong\"\n\n\"NO I DON'T WHY AM I IN TROUBLE?\" \n\n\"you know what you did wrong\"",
   "created_utc": 1692489631,
   "score": 255,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwx90xf",
   "message": "Corned beef",
   "created_utc": 1692485245,
   "score": 0,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxxbok",
   "message": "My best friends house growing up spent the night. His Stepdad found out his mom met someone on world of Warcraft and was screwing around on him their was yelling screaming kids crying broken dishes I just remember starring and my tacos not knowing wtf to say to my friend",
   "created_utc": 1692495611,
   "score": 0,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxnswz",
   "message": "Semen. I was forced to have that \"meal\" by a homosexual.",
   "created_utc": 1692491486,
   "score": 248,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxa7la",
   "message": "Black eyed peas \u0026amp; green Lima beans",
   "created_utc": 1692485740,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxi3ey",
   "message": "Mac and cheese, pasta and shitty cheese powder. Traumatized me til 18-19 yrs old. Hated pasta upto then.",
   "created_utc": 1692489054,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxkiq7",
   "message": "Liver, yuck!  Still traumatizes me.",
   "created_utc": 1692490077,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxnmt6",
   "message": "My mother tricked my little brother and I by mixing turnips with mashed potatoes. Man, it was disgusting, and neither of us was picky eaters.",
   "created_utc": 1692491413,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxnp02",
   "message": "So my grandfather and his girlfriend babysat my brother and I for a weekend while my parents were away. I had to have been 7 at the most. They decided to get get Boston Market for dinner. Included in this Boston Market meal was corn. I hate vegetables. Always have, always will. And I told them I didn't like the corn and really did not want to eat it. They were not having it and told me to eat up. I had a few bites and ended up throwing up onto my plate. They never babysat us again.",
   "created_utc": 1692491440,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxoepj",
   "message": "Beef Stroganoff.  Choked on it, luckily my dad moved fast but I couldn't eat it after that.",
   "created_utc": 1692491741,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxofuv",
   "message": "beef tongue disguised as beef tips",
   "created_utc": 1692491755,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxogq0",
   "message": "Chittlins and hog maws 🤢 I can’t roll with my southern side of the family.",
   "created_utc": 1692491764,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxokot",
   "message": "Pasta bake",
   "created_utc": 1692491811,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxp0m3",
   "message": "Squid",
   "created_utc": 1692491999,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxpemv",
   "message": "My mum used to try and hide cauliflower in our food by mashing it with potato, so we'd think it was just mashed potato.\n\nThen she started mixing spinach into mashed potato.\n\nI don't know what she was thinking.",
   "created_utc": 1692492164,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxpg0d",
   "message": "Every meal. Mh Father ruled the dinner table with an iron fist. Dreaded every time we forced around the table.",
   "created_utc": 1692492181,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxpiw0",
   "message": "Liver.\n\nFML.",
   "created_utc": 1692492213,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxptha",
   "message": "Liver, onions,  butter or Lima beans",
   "created_utc": 1692492337,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxpzkm",
   "message": "Hot dogs and beans",
   "created_utc": 1692492407,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxq2pm",
   "message": "Perogies with some sort of sauce I couldn't eat.  Not because of perogies \"they are probably pretty good\" but because I was 6 and my step-dad screamed and yelled and tried to force me to eat them. 35 years later and I have still never bought them.",
   "created_utc": 1692492444,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxqh6v",
   "message": "Quiche was just…awful.",
   "created_utc": 1692492615,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxszgp",
   "message": "Mashed yams with marshmallow topping. Looked awesome as a kid. Got a spoonful and gagged.",
   "created_utc": 1692493678,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxtt1y",
   "message": "Cow tongue",
   "created_utc": 1692494042,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxu9p5",
   "message": "Fucking coleslaw, it always looked like a good seafood salad, I fucking love good seafood salad, but no at parties my parents would bring me to it was always coleslaw that was too sweet and I didn't like it.",
   "created_utc": 1692494247,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxugt2",
   "message": "Liver n onions. I'll never understand.",
   "created_utc": 1692494337,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxumsi",
   "message": "Boiled cauliflower with bread crumbs. Cringe.",
   "created_utc": 1692494411,
   "score": 1,
   "submission_id": "15vttgd"
  },
  {
   "comment_id": "jwxv1i1",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15vttgd"
  }
 ]
}