{
 "submission_id": "15vu10n",
 "title": "People who are no longer best friends with someone: What happened?",
 "selftext": "",
 "created_utc": 1692485086,
 "permalink": "/r/AskReddit/comments/15vu10n/people_who_are_no_longer_best_friends_with/",
 "score": 109,
 "url": "https://www.reddit.com/r/AskReddit/comments/15vu10n/people_who_are_no_longer_best_friends_with/",
 "comments": [
  {
   "comment_id": "jwx9nn1",
   "message": "I was in a group of friends who started bullying a person I knew out of nowhere. I told them I was not okay with that.\n\nThey soon started hanging out without inviting me.\n\nI am still very glad I did what I did.\n\nEdit: typos.",
   "created_utc": 1692485507,
   "score": 119,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxb090",
   "message": "After more than 20 years of being besties, she just ghosted me.  After a year of not hearing from her, despite reaching out,  I asked her husband if she was okay.  He was confused because she claimed to be talking to me all the time.  Whatever.  It hurt for a while, but she honestly brought very little to my life in hindsight.",
   "created_utc": 1692486079,
   "score": 174,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxbiqx",
   "message": "He cheated on his wife and left her and their two kids.",
   "created_utc": 1692486302,
   "score": 244,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxefwo",
   "message": "Meth happened.",
   "created_utc": 1692487539,
   "score": 41,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxfgoa",
   "message": "She just stopped talking to me in covid. I was in her wedding and we had been roommates. But then she told me weekends were for her husband, which actually meant weekends were only for other couples. A mutual friend got married and didn’t invite me to the wedding, and we never spoke again",
   "created_utc": 1692487958,
   "score": 254,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwx9iz4",
   "message": "I put them on a  pedestal , I didn't think they could do anything wrong  even when they where mean to me I just viewed it as them being them (If someone else would of said what they did to me I wouldn't have taken it), I also was just unintentionally rude when we where friends (in a I can't read the room way) and they ended it with me due ti my actions and  I took it badly at first thinking I could fix the relationship but as we grew apart I realized what I was doing to them and our other friends , i had a ignorant attuide and a inability to think before I speak and ending things has helped me to work on these issuies , I try and think before I speak and i am much more socially conscious now. I still miss them but I know we can't be friends again and I'm slowly becoming ok with that",
   "created_utc": 1692485455,
   "score": 189,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwx9pu2",
   "message": "After high school ended, he became too busy. I invited him over every weekend, each time he said that he come, but didn't show up. After a year of him not coming, I stopped inviting him.",
   "created_utc": 1692485531,
   "score": 230,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxasp3",
   "message": "Ghosted.",
   "created_utc": 1692485988,
   "score": 83,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxez7t",
   "message": "I became addicted to a substance and put myself first,I do regret treating them the way I did. As it wasn’t fair on them to not stop.but at the same time I will never forgive them for leaving me to deal with my problems by myself at my lowest point.",
   "created_utc": 1692487759,
   "score": 4,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxf9nn",
   "message": "He became addicted to cocaine after his father died. It warped his personality, and he was constantly angry and bitter. He was unpredictable, and genuinely scared me because it felt that it would be very easy for him to do something that would ruin his life in an instant. Also refused any help offered. The only thing I could do was move on.",
   "created_utc": 1692487879,
   "score": 117,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxfowt",
   "message": "We just grew apart and no longer had the same interests.",
   "created_utc": 1692488055,
   "score": 0,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxguv5",
   "message": "My best friend was cheating on her boyfriend (who was also my friend). I told her she had to stop, tell him, or break up with him. She continued to cheat. One day he asked me if she was seeing someone else, and I couldn’t lie. Years after that we hung out a few times, but obviously it was never the same. Don’t remember that last time we spoke now.",
   "created_utc": 1692488531,
   "score": 109,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwx8v6n",
   "message": "They became homophobic, started misgendering our trans friend on purpose, and was overall very hateful and homophobic for no reason.",
   "created_utc": 1692485176,
   "score": 11,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwx918p",
   "message": "Was back in high school, after the graduation, we tried to keep contact, but we eventually stopped talking to each other",
   "created_utc": 1692485248,
   "score": 32,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxcuw0",
   "message": "Was in a group of 4 (including me) and they kicked a girl out because she talked bad on an online friend who knew more about our life than his, stayed friends with both but the remaining group members where talking behind my back and nitpicking on every small thing. They attempted to break us off by telling me that one of the group members and her where dating but I found it stupid and kept talking to them both until they told me to choose. Chose the girl that they kicked out, now im in a better group that actually hangs out and doesnt talk shit behind everyones back",
   "created_utc": 1692486881,
   "score": 52,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxesx6",
   "message": "Would “bust my balls” in front of attractive women to make himself look better. I was always confused because there was 0% chance of competition. There’s a point where it gets old and you never look back.",
   "created_utc": 1692487688,
   "score": 180,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwx9zvs",
   "message": "I came out as bisexual and she accused me of having a crush on her (i didn’t) but she said i made her feel uncomfortable.",
   "created_utc": 1692485649,
   "score": 113,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxa49l",
   "message": "She talked about me to people she knew online. She was also bossy af. She then made ME out to be the bad guy.",
   "created_utc": 1692485701,
   "score": 2,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxccir",
   "message": "One of my old BFFs thought drinking and driving was a competition. No thanks.",
   "created_utc": 1692486661,
   "score": 158,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxg3d6",
   "message": "There was this one girl who I helped through her highs and lows and she was hated by everyone. One day she asked me to guess who were her favorite people. She gave me two tries and then when she said it some other random girl who she just became friends with. The girl bullied her like a month ago instead of me then I gave her a second chance. Bitch was crazy one night we had a sleepover and she started hitting me. I confronted her the next day and said she could not remember. She said “if” she did that she blamed it on having caffeine that day and the drink she blamed it on did not even have caffeine in it. She also bullied one of my friends of 3 years I told her to stop never did. That year I found out why people hated her\n\n(Edit: her best friend left her before I decided to talk to her and start to become best friends with her and her ex best friend and me were friends and she told me to be careful)",
   "created_utc": 1692488214,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxgjng",
   "message": "I confidedin them my feelings of unaliving myself. The next day, they handed my a blade and a screw.\nI slit myself and that sent me down into a spiral of continually worse problems.",
   "created_utc": 1692488399,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxgzg9",
   "message": "We just grew apart. I think I reached out to her once to ask how she was doing and didn’t really get a response, so I just kind of decided that was that.",
   "created_utc": 1692488585,
   "score": 247,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxiauc",
   "message": "Trump happened.",
   "created_utc": 1692489140,
   "score": 109,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxilc9",
   "message": "He tried to sleep with my wife. Knew him for 30+ yrs when he tried to sleep with my wife.",
   "created_utc": 1692489266,
   "score": 211,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxjpea",
   "message": "My friend let me know they had a major grudge about a small incident that occurred *years* earlier, which they never mentioned to me before.  \n\nThen they told me that they didn't like my partner, or the fact that they exist.  It was worded very aggressively.\n\nIt was just bizarre.  I told them I was sorry and that I didn't want to know them anymore.",
   "created_utc": 1692489736,
   "score": 130,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxjr4f",
   "message": "I got sick of the constant lies.\nHell of a nice bloke, he just lied about everything",
   "created_utc": 1692489755,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxkfmd",
   "message": "He had an emotional affair with my wife and then died a few years later. I stayed with her shitty ass longer than I should have lol",
   "created_utc": 1692490040,
   "score": 49,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxku78",
   "message": "Lied about sleeping with my girlfriend.\nI wouldn’t have cared if he/they were honest.\nBut they lied.",
   "created_utc": 1692490213,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxlrf5",
   "message": "We used to be next door neighbors, and then I moved and meeting each other was much harder. Eventually just grew apart, no hard feelings and I'm sure he's doing pretty good",
   "created_utc": 1692490608,
   "score": 147,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxlw9w",
   "message": "She started seeing my very recent ex while I was still very upset about the breakup, she lied to me about it (“we’re just friends”) and then refused to talk to me about it when they were clearly and openly not just friends.  I spoke with him (the ex) about it and he apologized for the way things happened. \nShe didn’t and still hasn’t, years later. Good riddance.",
   "created_utc": 1692490666,
   "score": 59,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxm08d",
   "message": "They started drinking. They started being physically abusive to his girl,wouldn’t respond to me for months.\nHe’s been my best friend since 1992",
   "created_utc": 1692490714,
   "score": 14,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxm63u",
   "message": "After grade school and going into high school he found his own group of people and he slowly stopped talking to me and now we’re completely estranged. 11 years of friendship down the drain because he found better friends or something",
   "created_utc": 1692490782,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxm85e",
   "message": "I lost 100 pounds. She didn't, and \"accused\" me of deliberately changing. Well, yeah ...",
   "created_utc": 1692490807,
   "score": 126,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxmean",
   "message": "Over 10 years of friendship. We travelled together, worked together, he was the best man at my wedding. We were best friends, the kind of friend you could call any time of day or night and he’d be there to help. I was there for him through difficult times and vice versa. Then he met his now wife…\n\nSuddenly any gatherings at my house they couldn’t attend because she was always sick from “something she ate”…\n\nShe was from a wealthy family, the kind that literally owns a small island, and lived in an affluent neighbourhood. It’s not like I was poor or lived in a bad neighbourhood but by comparison, I’m sure the very thought of her being in my part of town made her sick. \n\nAnyway, I moved overseas, received a save the date for their wedding but the invitation never showed up. He reached out asking if I was coming and was shocked I hadn’t got the invitation as he wanted me there but it was too late to make arrangements and a long way to travel.\n\nI received an email from him while he was on his honeymoon telling me how jealous he was of me and my career and new life overseas.\n\nI travelled back to see family and friends a little while later and tried to make arrangements to see him but he was “too busy”… I was literally in the same building as him visiting old colleagues. \n\nI’m convinced his wife is the reason my invitation got lost in the mail and that it all came out on the honeymoon and now he can’t look me in the face.",
   "created_utc": 1692490878,
   "score": 64,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxn9mp",
   "message": "I’m in the middle of being ghosted by my best friend of the last 18 yrs. She doesn’t call me nor return my calls. (Early June was the last we have communicated) She swears she’s not mad at me but “this is her way of dealing with shit she’s going thru.” We know each others secrets and have never ever gone but a few days without communicating..she’s not opening up to what these problems are and she always has told me everything. This is the same emotions as when my family members have died. I’m actually devastated as I don’t have many friends these days. 😢",
   "created_utc": 1692491253,
   "score": 129,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwx8u1a",
   "message": "She met a guy she’s now married to and he made her cut ties with me",
   "created_utc": 1692485163,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxm4di",
   "message": "He put politics above friendship. End of story.",
   "created_utc": 1692490762,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwx9xvd",
   "message": "We were in high schoo and had been friends since like 6th grade, he was out of town, I hung out with his girlfriend one night because we were neighbors. and well yea. He and I were not friends anymore after that.  \n\nBut I been with her for almost 30 years now, so it was a good trade.",
   "created_utc": 1692485625,
   "score": 253,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxbqlu",
   "message": "BF in elementary but she got snotty and decided wasn't good enough to be her bf.  Besides everything was a competition to her, not worth it.",
   "created_utc": 1692486395,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxc81v",
   "message": "In college I was good friends, probably best friends, with a guy I met freshman year. He had a long-term gf who was a year younger. She ended up at the same school. After about another year together, they split. I had recently broken up with my girlfriend and they were pretty toxic toward the end. A month or so later she showed up at a party at our house and long story short we slept together. At first he was cool with it, then he wasn’t, probably never really was. After a weird period we reconciled. He ended up with another girl and I got back with my ex. Welp, my old girlfriend and his new one didn’t get along. There was drama, he graduated and moved and we didn’t speak for like 8 years. We’re good now, but we’re def not besties anymore.",
   "created_utc": 1692486607,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxdxbf",
   "message": "I was high he was drunk And we were texting and I guess I told him he should \"talk to himself\" and he got mad and doesn't talk to me.",
   "created_utc": 1692487323,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxdy38",
   "message": "She was mad at me for something then proceeded to ask her Twitter followers to stalk, harass and send me death threats. Then got mad when I told her she’s a horrible person and didn’t know why I called her that",
   "created_utc": 1692487331,
   "score": 168,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxdyd6",
   "message": "My bf was from hs.  After marriage things changed a bit, but we still spent time together.  Once after a girls weekend she told me she was using me as a cover to cheat. She had cheated before and I disapproved, but pulling me into it pretty much finished it.  We text once or twice a year now and that's it.",
   "created_utc": 1692487335,
   "score": 19,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxewz3",
   "message": "He killed my grandmother and burnt her house to the ground with my dog still inside.  I never spoke to him again.",
   "created_utc": 1692487734,
   "score": 57,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxfex3",
   "message": "He endangered my family.",
   "created_utc": 1692487938,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxfsqj",
   "message": "Best buddies with a guy. Had some of the best times of my life with him. Went to a party we met this chick they started dating. As soon as we moved from our apartment we never talked again. \n\nThey are married now\n\nUse to really be pissed about this but it happens all the time. Sucks cause we were so tight",
   "created_utc": 1692488097,
   "score": 37,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxgh0d",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxh2nf",
   "message": "She was mutual friends with my ex. My ex and I broke up due to a mental illness that I was tired of dealing with, which no one really knew about it. So when I left her, she lied to everyone we knew and said I cheated (didn’t happen) so she could save face. My best friend was so quick to believe her. I started dating again a few months later and my best friend accused me of cheating with my current partner (didn’t even know her at the time of breakup).  We haven’t talked in almost a year. Really sad but obviously you’re not my “best friend” if you’re so quick to question my character.",
   "created_utc": 1692488623,
   "score": 9,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxh3dd",
   "message": "Looooong time ago when i was a teenager, was dependent on a substance, took too much and had a blackout. She had forgotten my birthday and I had a blackout and rage called her multiple times. Forgot she was at work (she had a very professional job) and I don’t even remember what I said or did. We never had contact again. I regret this every single day of my life. My heart breaks every time I think about it. I was just cleaning out the garage and found all the letters she had written to me our entire friendship- I had saved every single one. I wish she could just let me apologize and explain where I was at in that moment but I 100% respect her not being able to do that.",
   "created_utc": 1692488632,
   "score": 193,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxhmqd",
   "message": "My depression",
   "created_utc": 1692488858,
   "score": 13,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxhqzd",
   "message": "We were best friends all through primary school and high school. After high school she begun lying all the time. Small lies at first and then lying about seeing different guys. She started hanging out with a new group of friends who went out and took drugs. I didn’t live that lifestyle and couldn’t deal with the lies all the time, so I cut ties. That was 15 years ago. I still think about her a lot, but our lives are completely different now.",
   "created_utc": 1692488907,
   "score": 25,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxhttc",
   "message": "E did lat er but e blew me off for  cople years before tha because he got into heroin.",
   "created_utc": 1692488941,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxhzqs",
   "message": "Life happened. Over time we texted and talked less and now we don't really talk at all.",
   "created_utc": 1692489011,
   "score": 36,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxifet",
   "message": "wish I knew, most of them just stop talking to me one day and never respond again. have yet to have a friendship that lasts longer than 6-8 years.",
   "created_utc": 1692489194,
   "score": 44,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxj56j",
   "message": "Never was a great friend, bit fun to hang out with. Then he got a toxic girlfriend. We were roommates for awhile and living with her was hell. They decided to get their own place, and I came to realize how miserable I was living with them. Getting away from it showed me how bad it was. So I made a decision, I didn't want anything to do with his girlfriend. Unfortunately since they were dating, cutting her out meant cutting him out. \n\nI've moved on, met new people and things are starting to pick up.",
   "created_utc": 1692489498,
   "score": 255,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxj5a8",
   "message": "She was unvaccinated and refused to take a covid test before seeing me. My mother was terminally ill and severely immuno-compromised, so I was absolutely trying to minimise the risk of getting covid so I could still see my Mum.\n\n\nShe refused to take a test, twice, despite kind and calm requests and explanations, on the basis that she \"didn't want to get a sinus infection.\" (This was in the time of nasal swabs, not mouth swabs, for covid tests. You know, those nasal swabs that are sterile and can't cause infection.)\n\n\nI'm 100% sure that it wasn't about a sinus infection. It was about control. She had been annoyed because I hadn't validated her anti-vax stance in the past.\n\n\nSimilarly, I know she wanted more validation for her religious views, which she'd acquired in her 30s and which I didn't share. I'd told her that I was happy her faith made her happy, but I think she wanted me to truly share her beliefs. I'd also said that her sister's bisexuality was \"fine with me\" when she'd stated that a wedding of 2 women was \"not what God wants.\"\n\n\nI think all of those different views just threatened the way she saw the world, and how she saw herself.\n\n\nHer last texts thanked me for \"sharing my views\" re covid and it's potential to kill my Mum, then became pseudo-concerned when I didn't reply. I read the whole situation as \"I want to say whatever I want to you, but I want to still feel like a nice person, so please reply and give me that validation.\"\n\nI didn't reply to her, but I still ask myself whether the mature thing to do would have been to clearly reply and state that I didn't want to stay in contact. It's taken me until now (over a year later) to see through the pain and formulate what I might have said.\n\nWe'd been friends since the first days of high school. 20+ years. In essence we just aquired very different views from each other as adults, but I can't pretend her attitude towards my Mum, and towards the horrible journey my family had to take, wasn't devastating.\n\nLife is a bloody painful journey at times, that's for sure.",
   "created_utc": 1692489499,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxj753",
   "message": "He had a disorder where he stopped mentally aging and was stuck acting like a 2nd grader",
   "created_utc": 1692489521,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxjcsk",
   "message": "So he kicked a guy, because another guy jokingly said something along the lines \"i hope your parents die from cancer\" he did apology later, it was in the heat of the moment, he kept getting killed by him on accident in a video game, so what he did is ghost the other guy because his friend said that, not that my initial friend's Dad did die months ago but he actually wanted him dead, proceed to kick one of his close friends because he argued around that, another friend quit his discord group and create a new one, we talk about him being dishonest because we know it wasn't the reason he kick the first guy, my \"friend\" ask me about their discords and leak everything, i said no knowing i talked a load of shit on his ass because he's an ass and i cut communication.\n\nCourse there is more layers to the story, My ex-friend was ammoral, racist and many other things.",
   "created_utc": 1692489588,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxjcv0",
   "message": "Former best friend was actually a narcissistic cunt, became my boss. Had me working 29 days a month.\n\nBullied me for making me quite, I couldn't afford to.\n\nHe fired me because \"I was burnt out and taking bad choices\"\n\nNever talked to him anymore",
   "created_utc": 1692489589,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxjig6",
   "message": "We went to colleges across the country and never reconnected like we used to :/",
   "created_utc": 1692489654,
   "score": 8,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxjm3f",
   "message": "Best friends from 9th grade to 25. Then he got married to a very toxic woman and moved to Alaska from Southern California. Slowly lost touch. We’ve started to reconnect in the last few years.",
   "created_utc": 1692489697,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxjmhm",
   "message": "- Can't be myself\n- really toxic people in general",
   "created_utc": 1692489702,
   "score": 13,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxjtji",
   "message": "When I realized the friendship was toxic. Whenever I would hang out with her, I would feel drained. I became her therapist.",
   "created_utc": 1692489784,
   "score": 157,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxjwxc",
   "message": "I was going through a divorce and my father died. Decided partying and alcohol was my new coping mechanism. They went along for a bit. I moved to another country to get rehab and they moved off to Washington and got married. I got right but I never heard from them again and they have a child now. \n\nI miss them still, near daily, 10 years later. Was my best bud. I was a shitty friend.",
   "created_utc": 1692489821,
   "score": 19,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxk1xp",
   "message": "This is a long one but I hope someone will hear me out because I have some doozies.\n Best friend one:\n We were friends for four years. I made her many free corsets and things over that time, because my love language was gifting and she was extremely helpful towards perfecting my craft. We met a few times, she was sweet and mostly normal. I would do little things by accident that would upset her a lot, like checking in that she was having a nice birthday when I came to visit her. Or accidentally talking over someone (I’m hearing impaired and nuerodivergent) when I got excited about a book. \n One day she told me she told me she was suicidal and disappeared for a few months. It left me sick with worry. I didn’t know if she was okay or in the hospital or what. She said I crossed her boundaries by checking in on her. \n She came back saying that she had Dissociative Identity Disorder and flipped out at me as an empathy less alter so she would not have to consider my feelings in the conversation. She laughed at me and said horrible things, told me my corsets were to control her body. \n Obviously we don’t talk anymore.\n Best Friend 2:\n They were warm and sweet online, we always had endless things to talk about. We related about so many things. They love bombed me, hard. When I went to visit them, they were cold and distant. Treated me like furniture. I cleaned their entire living room and front room (disgusting, covered in trash, it’s all I could manage), and cleaned rabbit and cat shit every day I was there. Helped tame their foster cat. They later said I was a bad house guest because I asked them to boil an egg for me.\n At one point I was so miserable on the trip (meanwhile on the verge of divorce) that I cried about being suicidal while they messaged the new person they were love bombing (a mutual corsetry friend).They sent me some of the texts by mistake, and they were making fun of me for being suicidal. The falling out was brutal.\n Friend 3:\n I made this friend online and joined her discord server. We were close besties almost right away. We watched all of Steven universe and shera together (over text), and she was very outspokenly affectionate and positive and sweet. She was dating a guy I became friends with, and they eventually broke up. Much later on, when my divorce was filed, we caught feelings and started talking about her moving down here. I was in a vulnerable place and I got swooped into the attention and distraction hard and fast. She broke up with me pretty quickly, I got way too upset, and she blocked me. Completely fair. But I started to notice that her photos were inconsistent, her hair color and length would change from ‘recent’ picture to picture, and she wouldn’t voice or video call anyone even her ex after two years. Also her photos said Facebook on them when she didn’t have a Facebook. Her ex and I put our dumb heads together and fit the pieces and caught her in some outright lies too. \n She had gone through a pattern of getting close to people and losing them when she didn’t get the attention she wanted. More people than just us. She would string them along (me and him both in many ways, her saying we’d pick up where we left off in a couple of months for example) She got confronted, refused to send a picture, and was outed as a catfish and permabanned from her own server.\n A few things have happened since then, mostly a message blaming me for being alone. But she should be. \n I’m doing fine now. Just another one gone.",
   "created_utc": 1692489881,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxk3qr",
   "message": "I loved my little friend group. We would hang out at school and at the park. They were always there for me, to help me, but I realised, they were all fake. Backstabbing me, saying rude things about me.",
   "created_utc": 1692489902,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxk46w",
   "message": "We became friends in uni. We were almost always together, went on trips together etc. She had to commute to our uni town so I let her stay over at my place more times than I can count. She helped me when I needed her and I did the same for her. But every summer when we would go back to our hometowns she would drop out of the earth. It happened three times and every time I confronted her about it, but tried to make sure I was nice about it.. Then, the last summer I was supposed to move to the town she lived in (capital of our country,more job opportunities). She was supposed to help me with the move and you guessed it she ghosted me. Then summer ended and I decided to move to another country where my mother was, to continue my studies and also have a better future. We met one last time, and she pretended like everything was ok. She kept asking all those questions about how I was doing and I couldn't stop resenting her for how fake her interest seemed. Called her out on it, she got mad, I stood my ground.\n I moved abroad two weeks later. She never even texted to ask how I was doing even when she found out my cat (who by the way I adored to death) died.\n Sometimes even when you think a person is here to stay, they most probably are a lesson in disguise. My aunt always said there are two kind of people. Those who hurt and those who get hurt. I guess this time I was meant to get hurt.",
   "created_utc": 1692489907,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxk729",
   "message": "Don’t bang a girl I’ve been chasing for the better part of a decade. There are 4 billion other women",
   "created_utc": 1692489940,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxke0e",
   "message": "He was my ex. He told me we don't have any chemistry at all as friends. I created a subreddit to deal with the emotional fallout, r/lostafriend.",
   "created_utc": 1692490022,
   "score": 153,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxkken",
   "message": "I used to have six best friends, my closest friends, and I fired every dang one of them.  In each case it was some form of betrayal.  These are guys who I did lots for and would do anything for.  For me, betrayal is unforgivable.  Turned my back on them forever and don't regret it one bit.\n\nThere for a couple years I was rather fond of saying I didn't have any friends, which I didn't.  Acquaintances, neighbors, coworkers, of course, but they don't count as friends by my definition.  \n\nBut now I have two besties, unfortunately both live clear across the country.",
   "created_utc": 1692490097,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxko96",
   "message": "She rescued me from an abusive marriage and we were roommates for four years. Got along famously. Then asked her to pay more in rent (we were splitting 50/50) because she had the master bedroom plus another bedroom for her daughter in a three bedroom house and all went to hell. \n\nSuch a small thing to throw away many years of friendship, but I guess that was my sign.",
   "created_utc": 1692490142,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxkxrl",
   "message": "She cheated on her boyfriend (a very close friend of mine too), broke up with him on his birthday (after he gave her lots of beautiful presents for her graduation), and started a relationship with the lover. \nThen, she cheated also on this other guy, and started a relationship with the lover, her current boyfriend (until the next one, I suppose!)\n\nShe “asked” me for some advice, in both situations I told her to break up first with the boyfriend and then try to think about it with a little bit of emotional distance, but nevermind she decided to follow her “instinct”.\n\nI decided to follow my integrity, I couldn’t stand anymore a friend like her in my life. I just felt very disappointed.\n\nThat happened in the last 5 years, we are in our late 20s.\n\nEDIT: now that I opened my memory closet, I remember another red flag of her. \n\nDuring the early days of Instagram, her profile was plenty of my photos, made by me with my camera, that I only uploaded on Facebook because I wasn’t using Instagram. When I created my profile on IG, I discovered it. I confronted her and she told me that she wanted to “impress” people and said “look at the bright side, they have lots of likes!”\n\nEDIT 2: another resurfaced memory! \nOne of the last times we hung out together, she bragged about her money and her job, clearly in order to make me jealous. Not an elegant move.",
   "created_utc": 1692490257,
   "score": 115,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxl51f",
   "message": "I moved away.\n\nTried to get back into contact with him a few years later and the guy just turned into a massive asshole. Misogynistic, homophobic, racist, the works. We were a trio. Me, him, and a redhead named Lucas. Lucas was so sweet, and I think that the other guy was such an asshole that Lucas was just too scared to separate himself from the other guy or something.",
   "created_utc": 1692490346,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxl5pg",
   "message": "She found Jesus, then lost her mind. In that order.",
   "created_utc": 1692490354,
   "score": 103,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxl60r",
   "message": "I kept the diagnosis of my illness private, which she said she could never forgive me for, then ghosted me.",
   "created_utc": 1692490358,
   "score": 11,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxlhnw",
   "message": "She got married and cut all contact with me. \n\n20 year friendship tossed aside like a used napkin.",
   "created_utc": 1692490496,
   "score": 237,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxli1e",
   "message": "When i stopped people pleasing and set boundries.",
   "created_utc": 1692490500,
   "score": 57,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxljjq",
   "message": "They F@cked me.\n\nThey F@cked me right in the ASS.",
   "created_utc": 1692490518,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxlk5i",
   "message": "We'd been best friends for 40+ years. I was always the one to run to rescue/help her, even when her husband was holding her and the damn baby at gunpoint.\n\nBut she was also very critical and a bit of a snob, like her mom. She would tell me to throw out my shirt because it was too worn out, get a pedicure because my feet look like crap, wear a different lipstick because the color looked horrible on me, etc.\n\nSo one day I just decided that I needed to talk to her about how she treats me, and asked her to meet me at a restaurant near her house. I was SO NERVOUS and upset that I was already crying before I got to the restaurant. \n\nI explained that she really needs to keep her opinions to herself, be more subtle with her comments (offer to pay for pedicures for both of us), or ask if she could give me advice on something, anything was better than what she had been doing.\n\nWe left the restaurant after she apologized, gave me a hug, and we went put separate ways. She called me a couple days later and said I was \"too negative\", never heard from her again.",
   "created_utc": 1692490525,
   "score": 179,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxllcj",
   "message": "My best friend from middle school literally stopped talking to me after eight grade graduation. We went to separate schools. She promised me that we would call/text each other every day after school like we used to in middle school. I called and texted her every day for months, and she did not answer me. She only answered me twice. Throughout all of freshman year I literally called and texted her over 100 times. She did not answer me. Here I was in a new school, was not making any friends, and was alone. This ‘friend’ was not there when I needed her the most. So when sophomore year started I gave up. I made some new friends, and when I had a sweet 16 I didn’t invite her. She found out and went ballistic. Called me a bitch and said it wasn’t right as we have been friends for so long. I messaged her and asked why she was so upset and she said it wasn’t fair that she wasn’t invited to my sweet 16. Meanwhile this girl ignored over 100 calls and texts from me. I told her the reason why I did not invite her was because she never answered any of my calls or texts. And she claimed that she didn’t have time. Like do you really think I’m that stupid? We stopped talking permanently after that. But it pisses me off that she got mad that she wasn’t invited even though she was the one who stopped talking to me.",
   "created_utc": 1692490538,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxm19g",
   "message": "I stopped paying.",
   "created_utc": 1692490726,
   "score": 17,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxm5zc",
   "message": "Actual nazi. Like swastika graffiting, sieg heiling, learned German nazi.",
   "created_utc": 1692490781,
   "score": 54,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxmfhu",
   "message": "Got older. My wife’s friends husbands are now my friends.",
   "created_utc": 1692490891,
   "score": 62,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxmj6k",
   "message": "Grew older and just fell out of touch. Friends for about 6 years and as soon it was time to go to high school it’s like we didn’t even know each other. People would always say, once you get into high school you’ll loose all your old friends but I refused to believe that until it actually happened. And I was too young back then to have a phone so I couldn’t keep in touch with them like other friends normally would but yh. We kind of “forgot” about each other. But there was no hard feelings, they did reach out to me a few years ago and that was about it. We are now living two very different and separate lives and I do occasionally think about how they’re doing and how close we used to be but I don’t think they do the same. All is good tho.",
   "created_utc": 1692490936,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxmnob",
   "message": "The last time I saw one of my best friends was HS graduation. He moved to FL right after. Never heard from him again.\n\nAnother, I went into business with him. That will kill it faster than anything else. Have not seen him in over 20 years. Seen his wife around a couple of times since then though.",
   "created_utc": 1692490989,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxmqgb",
   "message": "I fell in love with her. We've known each other since grade 5. We were very close. But once we got into high school, I started to develop feelings for her. Little by little my feelings for stronger and stronger, to the point where I just had to tell her. Once I did, she broke my heart, then we drifted apart.",
   "created_utc": 1692491022,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxmu2h",
   "message": "Pre-paid cellphone plan. It's 18 years ago at this point, but my then best friend pocket dialed me, while my phone was laying on the desk in the classroom. I was in a different part of the school working on a project. Some of the guys in class answered the phone but didn't or forgot to hang up when they realized no one was on the other end.\n\nThe call ended up lasting ln g enough that his rough 25 dollars on the phone plan was used up. He ended up calling me the day after, calling me all names under the sun and where I could go to fuck myself. I had no fucking idea what he was on about, and when he explained that his phone plan had been emptied I offered to just pay it back. Got told to fuck off. Never talked to him since. I even met him at a train station a few years later, smiled and waived at him. He literally turned around and walked away, waiting for the next train instead of taking the same train as me. \n\nI guess our friendship was only worth 25 dollars to him.",
   "created_utc": 1692491066,
   "score": 94,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxmw5j",
   "message": "Friends from middle school but when we got too our 20s just started growing apart. Both settled down had kids and moved to different areas. Still keep in touch some but it’s not the same just different people now but if we really needed each other I know he’d be there.",
   "created_utc": 1692491091,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxmwwj",
   "message": "She slept with my then boyfriend. The most boring tragedy of my life.",
   "created_utc": 1692491100,
   "score": 75,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxn3m3",
   "message": "Covid",
   "created_utc": 1692491180,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxn5qw",
   "message": "One of them, I dated and broke up with their sibling.\n\nThe other, they kept talking about how one of my friends was looking at me *that way* and implying I should pursue it. On the night before my wedding.\n\nAnother, they were not my best friend and them saying I was their best friend alarmed me. (Maybe that one doesn't count?)\n\nYet another, I was not their best friend but considered them mine (knowing they didn't see me that way), but when I got really sick I lost touch with everyone I knew. I still feel a little sad and guilty about that one, but I was not in good shape at all.",
   "created_utc": 1692491207,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxn77q",
   "message": "It involved a giant knife being stuck in my back. Twice. Trust no one.",
   "created_utc": 1692491224,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxn8fy",
   "message": "I got kicked out of our living arrangement, they accused me of being an alcoholic, and never did me the courtesy of talking to me man to man and never told me that they had an issue with me.",
   "created_utc": 1692491238,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxncgt",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxndr8",
   "message": "He married an addict trumper and became really distant.",
   "created_utc": 1692491301,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxne36",
   "message": "Best I can figure, she got divorced, I didn't.  She got new bf, and that was the end of it.  Last time I saw her, we ran into each other 7 years ago.  We both cried.  She said it was all her, she's sorry.  I said lets get together for coffee or lunch. She said text me.  I did.  She wrote back let me check my schedule. That was the last I heard from her.",
   "created_utc": 1692491305,
   "score": 140,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxnfdu",
   "message": "She turned out to be super fucking racist. I just had no idea because she’d never had the opportunity to show it until she moved to a city with brown people. I was horrified and I honestly have no idea who or where she is anymore and I do not care at all.",
   "created_utc": 1692491321,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxnjeo",
   "message": "She is bisexual who developed feelings for me and I am straight. Ended up distancing herself when I got a boyfriend.",
   "created_utc": 1692491371,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxnm5i",
   "message": "Grew apart,moved away, realized I didn’t like someone as much as I thought.",
   "created_utc": 1692491404,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxnu7x",
   "message": "Ah I’ve had a few. Simplest way is I got tired of their bull shit.",
   "created_utc": 1692491502,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxnvgf",
   "message": "I had a friend--Blindsey--and we played a lot of league of legends and other videogames with each other for a number of years and grown quite close after meeting on IMVU.\n\nI got into a relationship and disappeared but we kept some talking going sometimes. She got married later which was wonderful, very nice guy.\n\nWell one Thanksgiving I sent her a message saying, \"Happy Thanksgiving, love you\" and her husband saw this and threw a fit. They slept separately for a week and it ruined the thanksgiving that year. She blocked me everywhere but not before telling me what had happened and why she has to do this.\n\nI understand but I'm hurt. There was never a romantic relationship between us and saying, \"I love you\" was kind of a normal platonic thing between us. Oh well. I appreciate the time we had before and I love those memories. I miss my friend but we've probably changed so much since that we couldn't be friends today. Miss you Blindsey, hope you're well.",
   "created_utc": 1692491517,
   "score": 29,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxnw7e",
   "message": "My \"best friend\" shot me with a B.B gun in the face.",
   "created_utc": 1692491526,
   "score": 33,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxnx0e",
   "message": "A difference in political ideology. She occasionally texts and I respond, but I don’t see her nor care if I ever see her again. I do feel a little bad about it because I know it hurts her, but I’m done with people who side with bigots and cruelty.",
   "created_utc": 1692491536,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxnx9i",
   "message": "My friend group started becoming hyper-critical of me after COVID. I was going through a depressive episode at the time, and kept getting pushed into sharing personal details about my views on life, only to be criticized for them.\n\nI'd get shamed for things like being uncomfortable with learning to drive and having difficulty finding work. My friends would then talk about how much my situation was hurting them, and that they didn't want to be around me anymore. I wasn't particularly whiny, just a bit down.\n\nThe breaking point is when I was given the ultimatum to either leave my family behind (which they said was toxic), or to choose them. I was very confused as to why, so we met up to talk, and I got cut off they day after.\n\nI still have trouble sticking my neck out to make friends. I never want to go through this again.",
   "created_utc": 1692491539,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxnxyt",
   "message": "She didn’t have the capacity to be consistent and reliable. Major red flag. Had no problem ending that friendship.",
   "created_utc": 1692491548,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxnyze",
   "message": "I cut a friend off when he told me he went to the bar with covid. His second time having covid.",
   "created_utc": 1692491560,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxnz26",
   "message": "We just went our different ways. I was more into performing and he was more into subculture and finding himself. He ended up going through a gay phase but now he's married with a wife all the way in Alaska. Whatever you're doing, I miss you Best Bro; never going to forget you  man!",
   "created_utc": 1692491561,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxo7xe",
   "message": "Gave me an ultimatum of moving in with them into a 1 bedroom studio apartment vs moving into a 4 bedroom house with another close friend for $500 less rent. He decided that me choosing the latter was me “abandoning” him and he cut all contact after that.",
   "created_utc": 1692491663,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxo8b2",
   "message": "It was my mistake in thinking this person was my best friend for about two years but I slowly found out that he was my best friend, I wasn't his.  Delusions can be very sneaky but only if you want them to be.  I did but I caught on eventually.  Its on me, not him.",
   "created_utc": 1692491667,
   "score": 1,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxqstt",
   "message": "The hardest part when a longtime friend stops talking to you entirely is when you don't know why. \n\nYou assume that it may be that a mutual friend said something about you that isn't true but you'll live the rest of your life not ever knowing why.",
   "created_utc": 1692492746,
   "score": 212,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxqi55",
   "message": "She was an insufferable narcissist and I was too young to understand",
   "created_utc": 1692492626,
   "score": 137,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxpmmu",
   "message": "She was toxic and abusive to me for years but I made excuses every time. The last straw was when she was incredibly cruel to one of my other best friends who was actively dying of cancer and then painted herself as the injured party. I put up with being treated like shit for 20 years, but to treat a dying woman like that? I was immediately done.",
   "created_utc": 1692492257,
   "score": 115,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxouqv",
   "message": "Just got tired of being ignored when I would try to make plans to get together or hangout. I'm not going to beg someone to be my friend.  Friends for over 15 years and now haven't spoken to each other in over 3 years.",
   "created_utc": 1692491929,
   "score": 128,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxonvi",
   "message": "She was abusive, mean spirited, and just all around terrible to me.  She turned our friend group against me and spread rumors about me. She would put me down in front of other people. She was jealous when I hung out with others. Etc etc. We lived together during my junior year of college. After I moved out we never spoke again.",
   "created_utc": 1692491847,
   "score": 47,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxpap2",
   "message": "I'm not completely sure. Our mothers have been besties since elementary school, and they had us a month apart; while we were night and day, personality-wise, and probably should have been the complete opposite, we were besties, too, closer than sisters, from birth until we were 25. She had gotten married a few years before, moved a couple hours away and had her first baby, so naturally, our dynamic had shifted some, but I was still under the impression that we were as close as ever the night she called and told me that her life had changed, she no longer had time or energy for a friendship like ours, and that she pretty much just didn't want me in her life, anymore. There was no falling out, we hadn't had a fight since we were teenagers, there was nothing that I could pinpoint (then or now) that led to her decision, but it broke my heart and I grieved the loss for years after.",
   "created_utc": 1692492117,
   "score": 82,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxp180",
   "message": "Kind of just snapped into place that she was a terrible person one day. \n\nWe went out for coffee and she screamed at the barista for messing up the drink she ordered off the \"secret\" Starbucks menu. She was all excited because she'd slept with my best friends roommates boyfriend. Was furious over me \"choosing sides\" because we (me, my best friend, and her roommate) went out to a bar without her.",
   "created_utc": 1692492006,
   "score": 55,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxsij3",
   "message": "People change. Some for the better. Some for the worse.",
   "created_utc": 1692493474,
   "score": 32,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxt1hd",
   "message": "I was in a horrific auto accident, coma for a week, ICU for a month. The person who was my closest friend never came to see me, when I finally got home, wheelchair bound, when he came over his first question was what kind of drugs did they give me. It was supposed to be a joke but I told him that we’re done being friends and not to come back to my house ever again. That was 7 years ago.",
   "created_utc": 1692493703,
   "score": 79,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxw31r",
   "message": "My best mate came over one day and said he bought tickets to a concert for us.\nI said I was broke and there was no way I could afford it. It was only $80, but at the time it wasn't happening.\nHe said don't worry, I've got it.\nWe went to the concert and a couple of days later he called me and said his wife said I have to give him the money for the ticket, which I admittedly had but was already scheduled for car rego.\nI couldn't pay and she said he couldn't see me anymore, so he didn't.",
   "created_utc": 1692495056,
   "score": 38,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwy3b3i",
   "message": "she snuck around for a whole summer keeping the secret that she was fucking and had a relationship with my dying father. she was of age but he was in his last months of life, not in his right mind. hard to look past, she still reaches out every now in then trying to reconnect but it’s just too damn weird",
   "created_utc": 1692498304,
   "score": 48,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwy4idd",
   "message": "I had a good friendship with my friend, we'll call him J. He was like my brother, i was like his sister. We spent tons of times together and even lived with each other for 2 short stints. Then he just started drifting away. He'd come over and just go to sleep on the couch. Wake up eventually, and leave. Things would also happen like we'd get together on Halloween to watch movies; He'd disappear 20 minutes in, then not see if we were still there until like the end.\n\nI needed help with rent, and he was getting evicted. He only lived like  2 blocks away so we agreed he could move in for a bit, against my better judgement. He had been so unreliable in the past times he lived with me, so i doubted this time would be any different.\n\nI was at a friend's place one night and he texts me to acuse me randomly of replacing him with new friends. I told him, *\"J, i didn't replace you. I've gained additional new friends. We invite you to everything and you either say no, say yes then don't show, or say yes and then cancel last minute. It's been like this like 3 years now.\"*\n\nHe then started threatening suicide on a daily basis. It got to be too much and i was almost at the end of my rope. \n\nHe was still living with me during this. He was starting to spend all his apartment time in the bathtub. Like, I'd get up in the early AM for work and He'd be in there. He'd have to get out so i can get ready. He'd get dressed and say he's going to the gym and leaves. I leave for work. I get to work and it turns out it's one of the rare times it gets cancelled. I get back home and he's already back in the bath. Nowhere near enough time to go to the gym\n\nNow, I'm a girl who enjoys my baths. Sometimes I'll soak for 4 hours. But he was wanting to do nothing but be a merman. \n\nThen, the incident.\n\nI woke up at like 2 or 3AM and felt it. The type of urgency where i have about 30 seconds to reach the toilet to pee. I go out there and the door is shut with the light on. I can hear him snoring in the bath. I knew there was no time. I'd have to go into the kitchen and pop up to use the sink. Gross, i know, but the sink was empty and i didn't know what else to do. The kitchen was right beside the bathtub. Like, a 2 foot gap separated them. I turned and made it 2 steps into the kitchen and i pissed myself. I just stood there, mortified and furious. I cleaned up best i can in the kitchen, go change, and clean again.\n\nThen i pound on the door. *\"J! Wake up and get out here NOW\"*. He came out and insisted he wasn't sleeping. I called him out on it and told him i could hear him snoring. Rest of the details are irrelevant for the night. The next day, i told him that it hasn't been working at all and he needs to move out immediately. I told him i can't handle the stress and being i just got out of the hospital for mental health issues, it wasn't a good thing to be around. \n\nI've always been on good terms with his family. I think sometimes they'd secretly hope we'd get together so their son isn't single and alone. I don't know what he told them but his family showed up a day later. About 10 of them. They were like an assembly line going in and out from his room to the outside. Probably took less than 10 minutes and he was out. But, none of his family would even look at me. I just sat there on the couch stunned.\n\nAfter they were gone, i thought long and hard about things. I was going to tell him i think we needed space so we could both cool down and think about things. But, i also wasn't in the mood to verbally talk at that moment, and i didn't want to put it off. I loaded up Facebook (i still had it at the time) to reach out to him, only to find out he had unfriended me. I thought to myself, *\"I guess he made the choice for us\"*, and i blocked him on everything. \n\nI moved to the other side of town but sometimes I'd see him out walking someones dogs. I would feel some remorse and want to reach out but thought better of it. I ended up moving to another state because of feeling a need for a life reset. That was 2019. October or November 2022, i got a text from an unknown number. Turned out to be J using Whatsapp. He wanted to say hi. I debated on whether or not i should message him back. I sat on it for a few days and finally responded. I kept it light and not too personable. I didn't give too many details of my life, but we ended up talking about Falllout 76 a lot.\n\nHe would steer every conversation to his health problems. He had issues in the past, but it appears that in the 3 years we didn't talk, more issues mounted and the original ones got worse. I'm pretty sure most of them were diabetes related. He wasn't even a big guy. Just bad luck. Convos would start randomly and not last long moving forward. I think we were both tentatively gauging if the damage could be repaired. \n\nAfter a period of not hearing from him, he messaged me in March to wish me Happy Birthday. I thanked him and asked him a question and never heard back. I didn't think anything of it. May rolls around and i wake up one day to a text from my mom. \n\n*\"J's brother was in here earlier. He says J died a month ago in his sleep\"*\n\nI was stunned. Way too young. I looked up his obituary online, and he had passed 1 week exactly from our last text. That explains why i never heard back. I reached out to a lot of mutual friends to tell them the news. Almost none of them knew. They were shocked. No one had kept in touch because a lot of them only hung out if i was there. I was the glue and i had moved states. They were all friends, but i was always the one to get people together.\n\nSo in the months or so of learning this, i still think about it several times a week. I think about how we'll never get to finish repairing the bridge that was burned. I think about how he'll never get to finish reading A Song of Fire and Ice (but realistically, i think we're all in that boat). The guy loved his chess and martial arts. I don't really feel a sense of regret. I just feel disappointed we can't ever return to the way we were. \n\nIt's really made me think about things on a daily basis. Reach out to people to check in on them. You don't have to rely on Facebook or anything like that to keep in touch. The world worked without social media for keeping in touch, it still can. If you've had a squabble with someone and when thinking about it, it's senseless, reach out and squash that beef. You never know when that chance will disappear. We could all die tomorrow to massive heat and tsunamis. When it happens, would any of us really dwell on something like *\"Yeah I'm glad i didn't patch things up with Steve. That guy a bitch\"*. No, we're going to think about what could have been, and thats when regret may come in that you didn't keep in touch.\n\nI love you all, please take care of yourselves and each other.",
   "created_utc": 1692498894,
   "score": 105,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxpbr6",
   "message": "Sometimes it was something, sometimes it was nothing. Life is a looooong river, and not everyone is meant to float the whole way with you.",
   "created_utc": 1692492130,
   "score": 55,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxsgyu",
   "message": "They died",
   "created_utc": 1692493456,
   "score": 33,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxoszz",
   "message": "I found we were constantly competing but that it was me initiating the competition. He was just reacting to it.  I realized I wasn’t a very good friend to him, likely never was, so I just pulled away.  He’s doing very well.",
   "created_utc": 1692491908,
   "score": 34,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxs9xu",
   "message": "Hey boyfriend sent me a dick pic. She knows and is still with him.",
   "created_utc": 1692493374,
   "score": 25,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxuih1",
   "message": "Just straight up lies. Big and small. I can’t associate myself with someone that tells a lie.",
   "created_utc": 1692494357,
   "score": 16,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwy0qqd",
   "message": "I had too many dives into depression and all that comes with them for my bff to handle any longer, and this was all before we hit 35. My life is awesome now: great career, good relationships, contentment. But I sure wish he was still here to share it all with him. Our mutual friends never seem to know where he is or how he is doing, and I don't know if that is manufactured or authentic. I sure hope wherever he is that he is living it up because he was a once in a lifetime dude.",
   "created_utc": 1692497115,
   "score": 26,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwy0g07",
   "message": "They took a dump in my bathroom and missed the toilet. That was enough for me.",
   "created_utc": 1692496988,
   "score": 26,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwy5tpt",
   "message": "The asshole got cancer and died on me.",
   "created_utc": 1692499548,
   "score": 58,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxqvnk",
   "message": "Went through quite a bit together but I started to realize it was rather one-sided on multiple levels for a long while, and then I would only hear from them when they needed something. I just faded on it.",
   "created_utc": 1692492780,
   "score": 22,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxurya",
   "message": "I got sober.",
   "created_utc": 1692494473,
   "score": 23,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxqxfb",
   "message": "They started making rude an inappropriate comments, made it into a me problem by calling me too sensitive. The whole thing just got exhausting really. I was always the one that was there for her, but it was rarely returned.\n\nIt's funny though, how someone who prides themself on their own self awareness can't figure out that when they have conflict with their boss, coworkers, most of their friends, most of their family, that they might be contributing to the problem?",
   "created_utc": 1692492800,
   "score": 17,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxtfob",
   "message": "I found out through one of their friends she thought wouldnt share. She had slept with my past 3 boyfriends and I was in the same house sleeping one of those times",
   "created_utc": 1692493879,
   "score": 19,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwyfij0",
   "message": "She promised me that she would pay me back if I bought the tickets for a girls trip that she was desperate to go on. We had everything planned. I did all the work of looking and researching because that’s enjoyable to me and she hates it. She has 3 kids and they’re all smaller than mine - so I told her that I didn’t mind the planning as long as when it was done we would just go and enjoy ourselves since it had been 2 years since COVID. \n\nI bought the tickets and wanted to use my new Amex plat for the hotel bonus points. Keep in mind she makes more money than me - 250K per year and her husband makes $150K. So money was not the issue. Multiple times we discussed the trip, her going on the trip, and that our husbands would hang out with the kids together while we were gone for 5 days over a long weekend + Monday \u0026amp; Tuesday. \n\nWhen it was time to pay me back she went dark. Refused to answer my texts. Ghosted me for weeks. Mind you, I’ve known her for 4+ years and she was always kinda flakey when it came to texting. So her flakiness was not entirely new- but this is not the way you treat people period. \n\nI finally sent a Venmo request for the portion of the trip that was hers along with the message “please pay me back for your portion of the trip since you will not respond to text messages or calls.” \n\nShe then proceeded to gaslight me and tried to tell me via text that she never agreed to go and that I was just misremembering (KIM, our husbands had a weekend planned out with the kids for when we were going to be away, so obviously, I wasn’t “making this up”.) \n\nAfter that I sent her a farewell and fuck you message and didn’t look back. \n\nI took my other best friend on the trip instead. She couldn’t pay me for half - but she paid for the meals and taxis instead. It was super nice and I’m glad this cunt is out of my life.",
   "created_utc": 1692504501,
   "score": 39,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxobpt",
   "message": "He became a gaslighting narcissist who attempted to use me any way possible for his own personal gain on the pettiest levels imaginable. It reached a point I would instantly become in a bad mood when he came around, because I had to put my defenses up, or else he would walk all over me. Just to make himself feel superior, for whatever reason. He wasn’t always like that, but grew that way over time. He would even somehow find a way to make my friends, my joy, and my achievements, HIS. Like, it’s honestly amazing someone is capable of that level of manipulation, it’s actually impressive.",
   "created_utc": 1692491707,
   "score": 37,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwy0btw",
   "message": "Friends for 45 years. Lost her shit over a miscommunication and started SCREAMING at my kids. \nHad to let her know- we've been friends most our lives, but they ARE my life.  She left that night.\nShe honestly hasn't really been there for me over the years, anyway. It really wasn't a choice.",
   "created_utc": 1692496940,
   "score": 16,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwy2xal",
   "message": "She divorced me.",
   "created_utc": 1692498119,
   "score": 13,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwy8ltn",
   "message": "She went deep MAGA during Covid and showed her super racist side, which I didn’t know existed. She was my bestest friend. She pulled her kids out of public school and put them in Catholic school to “protect their innocence.” She became president of the Moms for Liberty in my area. She screamed at local school board meetings over mask mandates and wrote ridiculously incoherent emails to the superintendent on a regular basis. She got addicted to Xanax during all of this. Oh and did I mention, she was a nurse? It was awful to witness the mental decline and there was nothing I could do to stop it. I mourned her as if she had died. Because really in a lot of ways, she did.",
   "created_utc": 1692500914,
   "score": 35,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxrmrb",
   "message": "We met at work, got pretty close and would hang out a lot. Found out she had a drinking problem and I would every now and then pick her up and get her out of a shitty situation. Last one she was hammered, tried coming on to me and I refused but still helped her out of where she was anyways. She tried to accuse me of taking advantage of her and all that and told our boss. Luckily I was also quite close with the boss and she was aware of the drunk girl’s behavior and told her to cut the bs and demoted her.",
   "created_utc": 1692493096,
   "score": 8,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxst52",
   "message": "We grew apart. Became interested in different things and found new friend groups.",
   "created_utc": 1692493602,
   "score": 8,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxt74p",
   "message": "He fucked my ex in my living room like a week after we broke up",
   "created_utc": 1692493773,
   "score": 11,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwy3bee",
   "message": "No idea. After years of agreeing to disagree on religion and politics, she sent me the platonic version of a Dear John email, saying she felt we're too far apart.\n\nI can't help but note that it came only a few weeks after I came out as non-binary.",
   "created_utc": 1692498308,
   "score": 16,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwy3k6n",
   "message": "Having your best friend of 20yrs that you did everything for her. There for her through cancer when her boyfriend of many years dipped out. Letting her stay with me in my home w/ her son when said boyfriend split because she lost her house, never making her pay rent or anything so she could save to get back on her feet. Then when I needed her when my marriage fell apart she did everything in her power to make my life a living hell. My dad had to buy my house to keep from losing it because when ex left finding he had not been paying mortgage. Then the power got turned off so my dad since the house now was in his name put the power in his name so I didn't have to cough everything at that time owed \u0026amp; the new $300 dep they now required. So she knew all this because I talk to her about anything she actually called the power company telling them I still lived there \u0026amp; my dad had just put the power in his name to keep me from paying. I went through a tough depression she called my doctor \u0026amp; alot of my family members telling them I was suicidal which I was not at all. She call animal control saying my dogs I was neglecting and while I was at work they came to my house and took my dogs from my yard and left me a note. All which was a lie because 3 days later they left a note on my door again saying that the dogs where healthy and that I could come at anytime to get my dogs. So like I said she looked for anything and everything she could try to hurt me for no reason. We did not speak again for 8 years until one day she showed up at my job to tell me her cancer had returned and it was terminal. She told me she was sorry and she didn't know she did what she did but that she was jealous of me. I accept the apology and decided to be  present in her life for the last year of her life, but things where not the same \u0026amp; was very guarded around her.",
   "created_utc": 1692498425,
   "score": 12,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwy5hrx",
   "message": "She was facing a lot of professional, personal, and financial difficulties due to some really poor decision making on her end. I was thriving, and she was never happy for my success. When I finally got a job promotion I’d worked really hard for, her reaction was one of anger and jealousy, and I decided I no longer needed that energy in my life anymore. \n\nFriends should always celebrate each others victories.",
   "created_utc": 1692499381,
   "score": 18,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwyggbb",
   "message": "I still love her and see her as my sister, but she's been no contact with me ever since.\n\nI was supposed to attend her wedding and host the reception after. This happened during the pandemic (no longer at the height, but still not at the tailend either), and in our country, there was a nationwide ban on a gathering of more than a certain number of people. When we were talking about the details of the event, I was shocked to see her guest list. It was way above the limit of a gathering allowed at the time (I can no longer remember what the limit was but it was at least twice to four times as many people). She assured me that everything has been taken care of and that they chose an open area as the venue. I said ok, and offered support where I can give it.\n\nA couple of weeks before the wedding, she sent me her program, which involved two intermission numbers, three separate dances, multiple slideshow presentations, multiple segments for personal messages, a special segment for her birthday, and many other things I can no longer remember. All in all, it will take maybe 4 to 6 hours at best to go through everything.\n\nI told her that I understood her desire to make her wedding special, but that because we're still in the middle of a pandemic, we'll have to make some changes to make it shorter as her guests include the elderly (many of whom were at the time unvaccinated) and children.\n\nI trimmed it down, making sure not to remove anything. Just reorganize them to save time (like having the multiple slideshow presentations and messages be while everyone else was eating because in her program, that, too, was a separate section, or combining all the dances into one big segment).\n\nShe wasn't happy with this and disinvited me + blocked me on social media. Later on, I found out that because of the restrictions I mentioned, they had problems with the original venue and had it moved to a smaller, less open space and that only a few of the guests stayed after the ceremony, I assume because it was still once again, during the pandemic.",
   "created_utc": 1692505035,
   "score": 10,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwyb3sx",
   "message": "My best friend (well used to be best friend)...we met when we were both 7. She had just moved to my town and from that very first day...we were inseparable. \nFast forward 35 yrs later. My oldest son passed away and after his funeral, she and I spoke maybe a handful of times on the phone and then after that...nothing. \nThat was a little over 6 yrs ago and if I had to say, or give a reason as to why we don't speak to one another anymore...I guess I'd say it goes back to my son's death. She stopped calling me. A lot of people distanced themselves from me. At first I just wrote it off to people not knowing what to say to me or not knowing how to be around me during the initial grief, but as weeks turned into months....turned into years, I really struggled with loneliness and just wanting our friendship back. I'm sure (and most that grieve the loss of a child can relate) it wasn't just her avoiding a friendship with me but I probably distanced myself quite a bit as well. \nIt hurts not having that one friend that you used to call and tell everything to and I'm sure the day will come when we may run into each other. But until then...I just miss the old times I guess.",
   "created_utc": 1692502176,
   "score": 14,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxonaf",
   "message": "Life",
   "created_utc": 1692491841,
   "score": 10,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwxq2oh",
   "message": "She told me she had cancer and her parents were abusing her. Found out everything was a lie.",
   "created_utc": 1692492444,
   "score": 10,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwygdh5",
   "message": "I'm not sure... and that's the problem. To keep it short, my best friend of 20 years ghosted me. I messaged her twice, just reaching out and nothing. Messaged her again just to let her know my mom had passed, still nothing. I'm not angry, just hurt.",
   "created_utc": 1692504991,
   "score": 10,
   "submission_id": "15vu10n"
  },
  {
   "comment_id": "jwy4vry",
   "message": "Had two learn I am not a free therapist....",
   "created_utc": 1692499077,
   "score": 13,
   "submission_id": "15vu10n"
  }
 ]
}