{
 "submission_id": "15vymoy",
 "title": "[Serious] What do you think happens after you die?",
 "selftext": "",
 "created_utc": 1692497451,
 "permalink": "/r/AskReddit/comments/15vymoy/serious_what_do_you_think_happens_after_you_die/",
 "score": 50,
 "url": "https://www.reddit.com/r/AskReddit/comments/15vymoy/serious_what_do_you_think_happens_after_you_die/",
 "comments": [
  {
   "comment_id": "jwy1hjm",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1692497451,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy1psr",
   "message": "The same thing that happened to you before you were born.",
   "created_utc": 1692497558,
   "score": 157,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy7eaf",
   "message": "I think we become part of the stars. \n\nOur essence returns to the universe, like a wave rejoining the ocean.",
   "created_utc": 1692500313,
   "score": 36,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy4ojw",
   "message": "Nothing.\n\nI've gone under general anesthesia before. To me it was like having my \"switch\" flick off, instantly back on, and suddenly I'm somewhere else in another hospital bed with zero awareness of the passage of time.\n\nI imagine it's just that my switch doesn't come back on.",
   "created_utc": 1692498979,
   "score": 79,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy64cr",
   "message": "Sounds like a problem for dead-me.",
   "created_utc": 1692499689,
   "score": 43,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyaxbz",
   "message": "At some point in the very, very far future, the pattern of atoms that made me conscious will repeat itself. I'm not sure how it would happen, but I feel like it's a non-zero chance, which is good enough for me.",
   "created_utc": 1692502082,
   "score": 13,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy1p3y",
   "message": "your body goes to the morgue",
   "created_utc": 1692497549,
   "score": 16,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy33wy",
   "message": "Died brought back\nTheres nothing there everything goes black\nYou dont even know you died 40 doctots come in next day one says your a miracle \nAnother says last time i saw you you were dead",
   "created_utc": 1692498207,
   "score": 31,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy1v15",
   "message": "I think we cease to exist in any form and our loved ones miss us.",
   "created_utc": 1692497625,
   "score": 22,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy1mjz",
   "message": "I honestly think it's nothingness after we die, and it's scary.",
   "created_utc": 1692497517,
   "score": 40,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy1occ",
   "message": "Your “soul”/energy return to the collective consciousness to be redistributed via the multiverse",
   "created_utc": 1692497539,
   "score": 32,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwycvqg",
   "message": "Obviously no one living knows for sure, but here's what I like to believe.\n\nYou reawaken instantaneously at the moment of death as another conscious being somewhere in the universe. Perhaps only milliseconds have passed, perhaps millions of years, perhaps all of existence has gone through multiple cycles of death and rebirth in the time you were gone. But since you weren't there for it it passes as if it were nothing.",
   "created_utc": 1692503101,
   "score": 13,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyatcv",
   "message": "I choose to believe a version of what someone shared with my husband in college.\n\nHe volunteered for his 4 years of college at a local nursing home, hanging out and playing cribbage with a retired Lutheran minister (we are Catholic and he attended a Jesuit college). They often had philosophical discussions, and this question came up.\n\nHe shared that he believed that when a person dies, the road to heaven is a walk in the woods. He believed that everyone took this path; if someone led a good and honorable life, their walk would be a gentle, sloping stroll through beautiful scenery on the most perfect, sunny day. If they had much to atone for, their path would be long, treacherous and fraught with obstacles. However, he believed that when he finished his walk, St Peter would greet him, flanked by the greatest orators in history singing God’s glory.\n\nMy husband and I aren’t particularly religious, but there’s something very comforting to me about a final walk in the woods. It makes me want to strive for a walk that is as beautiful as possible.\n\nOn the other hand, my brother and I just recently made a pact to haunt each other and then when we are both gone, we will haunt our enemies. So there’s also that.",
   "created_utc": 1692502024,
   "score": 16,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy1lom",
   "message": "Nothing.   extinguish.",
   "created_utc": 1692497505,
   "score": 17,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy7weh",
   "message": "I hope for something.  Dunno what.  But something.",
   "created_utc": 1692500564,
   "score": 6,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy1mtq",
   "message": "The same thing that happened before I was concieved.",
   "created_utc": 1692497520,
   "score": 12,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy3qei",
   "message": "I'd like to think that our consciousness moves onto a new life, even if not our memories or soul from this one. I can hardly fathom the idea that everything just stops when you die. Like, that's just flat out hard to wrap my head around.",
   "created_utc": 1692498510,
   "score": 11,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy6q42",
   "message": "You reincarnate",
   "created_utc": 1692499981,
   "score": 5,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy8bj1",
   "message": "I think there's another plane of existence where we are all the same and we often come here(or some other planet with life) for one reason or another.  Maybe it's because we can't experience emotions over there? Maybe it's just to experience something different?  Maybe to grow and learn?  Could be many different reasons but we keep coming back.  U can stay out of this place longer if ur good, but eventually, u gotta come back but maybe you could also choose to come back sooner.  Maybe if u are bad enough, then u gotta come back immediately.  Even if there is nothing after, I still think it's better to believe there is something.  So I'm good with whatever makes the most sense and isn't only 1 road to doom and gloom.",
   "created_utc": 1692500773,
   "score": 6,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyapa6",
   "message": "Y’all really need to do DMT",
   "created_utc": 1692501967,
   "score": 7,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwydnn1",
   "message": "\"Those who love you will miss you\" -keanu reeves",
   "created_utc": 1692503496,
   "score": 9,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy6fk6",
   "message": "Back to the universe and its collective consciousness. no science to it as science has trouble explaining consciousness but it seem just as far fetched as some religious beliefs.",
   "created_utc": 1692499840,
   "score": 3,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy6t8m",
   "message": "The pure, unadulterated joy of non-existence.",
   "created_utc": 1692500024,
   "score": 7,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy21lg",
   "message": "There is no after",
   "created_utc": 1692497709,
   "score": 10,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy3xyz",
   "message": "I believe once we pass on from the life we're living, we're soon given the chance to live another life in this world or another.",
   "created_utc": 1692498614,
   "score": 5,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy6ly0",
   "message": "I’ve had an experience of holding someone when they died and an energy travelled up my arms through my shoulders through my head and snapped when it left the top of my head. I’ve had a couple of experiences different to this that occurred at a death of loved ones. I’m not in the slightest bit religious (actually it’s shortsightedness irritates me) but I have absolutely no doubt whatsoever our consciousness goes back “home”.",
   "created_utc": 1692499926,
   "score": 8,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyc1n1",
   "message": "The worms crawl in and the worms crawl out, the worms play pinochle on your snout",
   "created_utc": 1692502666,
   "score": 7,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy56wm",
   "message": "Honestly, I don’t know what to think. It could be lights out, it could be a new life. This world could all be a simulation. We don’t know and anyone who does obviously can’t tell us otherwise.",
   "created_utc": 1692499228,
   "score": 6,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy5air",
   "message": "What do I think happens nothing. I believe you will understand what is happening as much as you understand prior to being conceived. If I’m wrong I’m ok with that. Until there is something that makes more sense to me that’s where I stand.",
   "created_utc": 1692499278,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy7ajq",
   "message": "The obvious answer. The cryonics chamber.",
   "created_utc": 1692500261,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy7l58",
   "message": "we wake up in the grimdark",
   "created_utc": 1692500409,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwycxoe",
   "message": "Doesn't matter. Either something happens or it doesn't.",
   "created_utc": 1692503127,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyeng4",
   "message": "Jesus reminds you of all the times you touched yourself at night.",
   "created_utc": 1692504025,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyht22",
   "message": "No one alive currently knows",
   "created_utc": 1692505821,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy3xm6",
   "message": "Absolutely nothing.\n\nAnd I am OK with that.",
   "created_utc": 1692498609,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy64cx",
   "message": "Absolutely nothing. If you're lucky maybe a few people will miss you.",
   "created_utc": 1692499689,
   "score": 3,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy7lw4",
   "message": "I think it’s different for everybody. I think whatever you believe happens is what will happen to you.",
   "created_utc": 1692500419,
   "score": 3,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy2km7",
   "message": "Aside from the physical decay of your body, I think your soul goes wherever you believe it to go. Faith is powerful because people *choose* to believe in it; I think that faith is rewarded. The people we love and leave behind will mourn, and our memory lives on.",
   "created_utc": 1692497955,
   "score": 5,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwydkwi",
   "message": "If you ask this question on Reddit and put a [Serious] tag on it, 99% of everyone will say nothing. That, and imagine if anyone at all said I think we go to Heaven or Hell, Purgatory, Sovengarde, Reincarnation, etc. They’d get downvoted straight to the bottom and called a dumbass. When in reality, no one can prove or disprove. All I’m saying is, Reddit’s demographic is largely anti-religion, so it’s kind of a mute question, at least here",
   "created_utc": 1692503456,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy2sy1",
   "message": "Lights out.  Just like when your under sedation. \n\nIt’s amazing how many brilliant people have so much fear and rely on faint and hope even while knowing it’s bullshit",
   "created_utc": 1692498064,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyozhp",
   "message": "I personally believe I will be reincarnated, but my main belief is that it depends on your own beliefs. There's proof of reincarnation. Kids solving their past lives murders, that sort of stuff. There's also proof (though less definitive than reincarnation) of heaven. People have died and said they'd gone somewhere. So I believe that what happens to you depends solely on your own beliefs, and if you believe nothing happens and you stop existing, maybe it randomly picks one of all beliefs.",
   "created_utc": 1692510204,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy2hjc",
   "message": "I like to describe it like a television.\n\nYou turn off the TV and it goes black right? Its just hitting the power button. \n\nIt’s like that..it’s just..nothing \n\nWhich doesn’t seem so bad to be honest - I won’t know either way :)",
   "created_utc": 1692497914,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy4snu",
   "message": "Nothingness for all eternity.",
   "created_utc": 1692499036,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy6mch",
   "message": "Decomposition.\n\nThe I that is me is a process running on the meat that is my body.  Dying is the word we use to say that process has stopped. There's no more me for things to happen to.",
   "created_utc": 1692499931,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyhf3l",
   "message": "The thing is, I believe (don’t know for sure) that most of Reddit is agnostic/atheist in general. \n\nSooo, don’t expect to get many answers besides “nothing”. \n\nEven if someone does answer something that lies in the realm of metaphysics, it will most likely be downvoted….",
   "created_utc": 1692505593,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy7eys",
   "message": "I have Faith in Jesus Christ, so read The Holy Bible.\nMy worst fear is that this pain has been for nothing, then I'm dirt again.",
   "created_utc": 1692500322,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy3kgs",
   "message": "Well in what I believe we all go to heaven\n\nAnd then wait of the thousand years to start. \n\nThen judgement day. \n\nAnd if you pass it, you get to live with your father in heaven forever.",
   "created_utc": 1692498429,
   "score": 255,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy23w6",
   "message": "If you've accepted Jesus into your life, then you go to Heaven. If you haven't, then you go to Hell",
   "created_utc": 1692497738,
   "score": 249,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy9aw1",
   "message": "There is actually a fair amount of evidence that our consciousness not only survives death, but is fundamental to the universe. We are finding our way there both scientifically through the study of consciousness, physics and cosomology and spiritually/psychologically through the study of near death experiences. If you go to r/nde you can hear the anecdotal evidence directly from people who have experienced it as well as discussions by the large community interested in this question.",
   "created_utc": 1692501268,
   "score": 255,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy5ogx",
   "message": "The conscience part of you that fears death goes away. Then what we use in the context of nothing usually applies after. Meaning you’re not aware at all of being dead. No pain. No emotion. No conscience. Think back to your earliest memory…then nothing.",
   "created_utc": 1692499477,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy67lg",
   "message": "Belongings shared by family.",
   "created_utc": 1692499733,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy6mnx",
   "message": "Same as before you were born; you simply don’t exist.",
   "created_utc": 1692499936,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy6x9m",
   "message": "I will tell you you don't get 77 virgins or what ever the fuck number it is!",
   "created_utc": 1692500078,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy720j",
   "message": "Life goes on without me, and that's fine. Right now I feel like I'm just a pair of arms and legs for someone else.\n\n\"Go get this, go carry that, do the dishes, take the trash, cut the grass... Blah blah blah...\"",
   "created_utc": 1692500144,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy7hwb",
   "message": "Your loved ones miss you for a while. Then the memories of you disappear.",
   "created_utc": 1692500362,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy7jlz",
   "message": "go somewhere else",
   "created_utc": 1692500387,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy7np6",
   "message": "Your body decomposes and your molecules return to join the great cycle of life? I actually find that comforting tbh. I hope I’ll be a tree next.",
   "created_utc": 1692500443,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy8410",
   "message": "Nothing. You close your eyes and gone. Same as when you sleep but you don't dream or wake up.",
   "created_utc": 1692500670,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy88sq",
   "message": "you decay",
   "created_utc": 1692500736,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy8x09",
   "message": "Nothing. Well, except your body rots and some people are sad.",
   "created_utc": 1692501070,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy93hc",
   "message": "We either go to another world/realm/life or we get reincarnated/recycled and brought back here or....nothing.",
   "created_utc": 1692501160,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy9aot",
   "message": "It’s all a big nothing!!!",
   "created_utc": 1692501266,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwy9tat",
   "message": "We stop existing",
   "created_utc": 1692501525,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwya400",
   "message": "Honestly no idea but I have this recurring fear of what if when I die it's like darkness just my mind in darkness can't move speak trapped in my own brain and it's just my life's regrets and worst memories playing over and over in that dark space and dear lawd I don't want to die",
   "created_utc": 1692501671,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyac4y",
   "message": "It's one of life's great mysteries; beliefs vary, but no one truly knows.",
   "created_utc": 1692501784,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyaehc",
   "message": "We move on to something we can not yet define. I don't think we just end, though.",
   "created_utc": 1692501817,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyankq",
   "message": "We shit our pants.",
   "created_utc": 1692501942,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyax0u",
   "message": "Just like when you shut down a computer and the lights go off, except you can't turn it back on.",
   "created_utc": 1692502078,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyb4ju",
   "message": "I'd like to think our energy lingers in limbo until its eventually put back onto earth in a new vessel for new experiences and lessons.\nI started thinking this way when I started connecting with certain people way too easily to the point that it almost felt like I'd already known them for a lifetime.\n \nBut.... if we're speaking technical- I know someone who died for 8 mins and when asked what happened she said \"Nothing. It was really bright for a second then Black.\" 🤷🏼‍♀️ I guess I'm good with either",
   "created_utc": 1692502187,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwybh3c",
   "message": "It doesn't matter what you think. you'll never know untill it happens",
   "created_utc": 1692502369,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwybkzy",
   "message": "Those that love us miss us.  Other then that it is a mystery.",
   "created_utc": 1692502426,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwybumr",
   "message": "Afterlife",
   "created_utc": 1692502566,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwybx6d",
   "message": "This is a fear of mine that has been giving me so much anxiety lately.. I’m not scared of when I die. It happens, it’s a part of life and i accept that. It’s where do we go, that scares me. Will I ever get to see my loved ones ever again? They say dogs won’t goto heaven. You’re telling me I will never see my dog ever again after he’s passed? It’s breaks my heart. Do we become new people??? Do we goto Heaven??? Eternity. I wouldn’t want to spend eternity in Hell, that’s for sure. I feel empathy so much for every little thing that goes on in this stupid world. I fear a lot. There has got to be so good reason for why I was born with empathy, but have yet to figure it out.",
   "created_utc": 1692502602,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyclou",
   "message": "I'll be an inconvenience.",
   "created_utc": 1692502957,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwycyuf",
   "message": "God gives me a high five and drops me in hell, or shit just goes black.",
   "created_utc": 1692503143,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwydm5u",
   "message": "If you are lucky, people show up to your funeral to pay their respects and your heirs take good care of their new assets.\n\nThat is all. You don’t exist anymore.",
   "created_utc": 1692503474,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwye6pt",
   "message": "The computer restarts your process somewhere else in the simulation.\n\nToo many times I've had weird mental experiences where I am outside of \"now\". No drugs. No trauma. Just my mind wanders and I can sense the utter lack of \"realness\" to our daily life. \n\nIt's a simulation of some sort.  I don't know if it's like a computer program or an ultimate being like \"God\", but there is something external that operates our consciousness.",
   "created_utc": 1692503777,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwye8nu",
   "message": "Microbes have a feast. We stop existing. The universe doesn't notice.",
   "created_utc": 1692503806,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyeqlj",
   "message": "Many more will be born and die, until everything is dead.  Even the universe has a life span, whether it's heat death or a big crunch.",
   "created_utc": 1692504072,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyesaf",
   "message": "People who love you, will miss you",
   "created_utc": 1692504098,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyev8s",
   "message": "Hopefully nothing",
   "created_utc": 1692504142,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyfazv",
   "message": "There only difference with pre- and post-existence is memory and stories. We know what happened before because people who there were tell us stories, and others relayed or recorded stores from earlier. We  have no idea what will happen afterward.",
   "created_utc": 1692504386,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyg8w3",
   "message": "Heaven, Hell, or stuck in limbo.",
   "created_utc": 1692504918,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyg9r6",
   "message": "I truly and sincerely believe that when we die, that is it.  We stop breathing and turn cold.  There is no afterlife or reincarnation or karma or anything like that. \n\nOne and done.",
   "created_utc": 1692504932,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyge0l",
   "message": "Don’t know and don’t care. If it’s something other than nothing I hope it’s at least entertaining. If not at least entertaining then I’ve won the worst lottery ever by coming into existence at all.",
   "created_utc": 1692504999,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwygi5b",
   "message": "Wiped clean, born again. Makes me wonder the previous life was death the same year I was born.",
   "created_utc": 1692505064,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwygo4i",
   "message": "Hard to say physically your hippocampus stops so what ever you experience doesn’t get recorded. So what ever it is you will only know when it happens but can’t recall if they do bring you back.",
   "created_utc": 1692505158,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyhacc",
   "message": "Rein car nation",
   "created_utc": 1692505513,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyigvb",
   "message": "Like a flame, your consciousness is extinguished. That's it. Nothing else. Black. The great sleep. This is probably a very bleak take. I don't believe any religious explanation about what happens. I'll be quite surprised if there is something that does happen after death.",
   "created_utc": 1692506204,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyimsx",
   "message": "We were once non existent before then all of a sudden were in this amazing  reality who’s to say there’s nothing  when your die",
   "created_utc": 1692506297,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyiuq0",
   "message": "Hopefully someone, somewhere cries a little. Otherwise nothing.",
   "created_utc": 1692506423,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyizkw",
   "message": "Same as before yoh were born",
   "created_utc": 1692506500,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyjelz",
   "message": "Decomposition",
   "created_utc": 1692506749,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyk4cd",
   "message": "That's what I fear. The possibility that we'd just see nothing. Hear nothing, feel nothing. As if it was almost like the ending to the Undertale genocide route. Just absolutely nothing but pure black darkness.",
   "created_utc": 1692507179,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwylelo",
   "message": "Hopefully we reincarnate into another being somewhere else. It’s just so odd to me that we just randomly spawned into this temporary being going through this temporary life…and for what? Theirs gotta be an answer.",
   "created_utc": 1692507966,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwylox6",
   "message": "I believe that that part of us, which most will call our soul and is immortal, departs from our dead body and rejoins the cloud (?) of all other souls not currently inhabiting a body. It's not billions of souls together but one homogenous entity. I envision it as what many indigenous cultures would call the great spirit.",
   "created_utc": 1692508144,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwym6hp",
   "message": "I won’t know until it happens. That being said I hope that after whatever time they need, the people I care about remember me with fondness.",
   "created_utc": 1692508426,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwymqar",
   "message": "Ok, I have a pet theory, it's not about after you die exactly, but when you die \u0026amp; it kind of ties in. It'll need a little background first, bear with me.\n\nOk, so you know how when you dream, your sense of time can be wildly distorted? Like a week's worth of events in an 8 hour dream, or even a days worth in a short nap? Or much shorter? Like 30 minutes worth of action in an 8 hour night? Keep this in mind for a little later.\n\nI think we all have probably also seen videos of prey animals being attacked and eaten alive, like a lion killing a gazelle and starting to feast while it's alive, and how that animal gets a kind of glazed look in its eyes at some point \u0026amp; just surrenders, almost peacefully?\n\nI think, as a protective mechanism, near the point of death the mind goes into this kind of state, where things are dreamy and time is completely distorted.\n\nThis might mean that when we are dying, time dilates and stretches out before us like a long road. It might mean that when we die, we live, in our minds at least, an infinite amount of time in those last few real seconds. \n\nIf this is true, it would mean that you never actually perceive your own death. And in that sense, you don't really die.\n\nOf course, empirically I know what happens to the organic matter of the body after life ceases, etc. but as someone who is not a believer in heaven or some other kind of afterlife, that thought has brought me a little comfort, thinking that my loved ones, when they passed away, actually lived forever on their own little realm of distorted perception - and didn't really know death.\n\nJust a theory. Thoughts?",
   "created_utc": 1692508767,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwymrtp",
   "message": "I really hope it’s just nothing. I really despise the idea of paradise or eternal torment. I just want to rest",
   "created_utc": 1692508793,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyn3pu",
   "message": "I think you are just there. Like a long nap. The most relaxing one ever. I feel like you for a sec before you die the pain goes. That’s the closest thing to heaven I think is real.",
   "created_utc": 1692508998,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwynuht",
   "message": "Nothing. Just cease existing.",
   "created_utc": 1692509472,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwynzxh",
   "message": "You die! You review your history in a flash as your dying. Good or bad it's all there all the choices you ever made. Your given the universal knowledge and have to determine how to be beyond this. Your shell rots away and that thing you call a soul returns to the universe as a form of energy. What shape it takes later is unknown.",
   "created_utc": 1692509568,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyopsa",
   "message": "I think nothing is on the otherside. That's why life is so precious and we need to enjoy every second of it. Life is an amazing thing not to be taken for granted.",
   "created_utc": 1692510028,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyou61",
   "message": "I think we have to turn into some kind of energy. Lately I’ve been making bad decisions with my life and a few months ago my dead grandmother appeared in my dream and I tried talking to her but she just ignored me. I wondered why I would dream of her for the first time since her death about 7 years ago and turns out it was her birthday.",
   "created_utc": 1692510107,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyp0v1",
   "message": "Your body becomes plant food or just disintegrates in the coffin.",
   "created_utc": 1692510229,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwypboc",
   "message": "reincarnation",
   "created_utc": 1692510428,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwypp4m",
   "message": "the ones who loves us will miss us",
   "created_utc": 1692510674,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwypqfn",
   "message": "Shrek gives you anal in his underground hideout on Mars.",
   "created_utc": 1692510698,
   "score": 3,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwypvyj",
   "message": "Likely nothing. Just gone. Possibly forever, assuming the universe is destined for a slow settling into heat death and all that was and will be will eventually evaporate into radiation. \n\nI want there to be something after. Some promise that my consciousness will get put into a new preferably less fragile vessel to experience existence for as long as I wish. But the reality is that until i die i wont know for sure and chances are if the nature of consciousness is bound entirely to my brain then I am about as permanent as my pile of flesh. \n\nIf I'm lucky and live to see a technological revolution that enables the average person to upload their mind into a sort of artificial brain to sustain the same strain of consciousness I have currently going I would hope to be able to be put into a more death resistant form, but even that only serves to delay the inevitable. Perhaps I'll do so and find that being conscious gets really old after a few human lifespans, but deep down I always will have that fear that I will die yearning to be healthy and alive to see the rest of existence out. \n\nI could die tomorrow, from a completely random accident, or I could die in a million years once I've done and felt everything a human mind is capable of doing and feeling, either way I am destined for death and I truly fear that I will simply stop existing and be erased. \n\nIf dying is like what was before, maybe it wont be so bad. After all there isn't any me to feel sad about being dead, and infinity will continue without me just as billions of years before did. Maybe in some inconceivable amount of time something we dont fully understand about the universe will happen and it will all be remade, maybe its always been that way and the universe has been in a cycle of creation evolution and decay in a way that makes any notion of a before illogical. \n\nMaybe I'll die and in an instant open my eyes as something new and not the same. Will that be me? Or will it just be a completely random replica of me that lives an entirely different experience. Perhaps both? Maybe I'll spent times as myself and times as other things with I being more of a label an outside observer could apply. Am I everything and nothing at the same time? Is the universe both me and am I it? We could all be the same consciousness copied over and over, subject to different life evolutions which in turn make a new mind and set of memories. At that point is I even a reasonable concept to apply to such a thing? That's just existence at that point. \n\nUltimately I am alive right now, and for all I can tell this is a one shot go at it and when i die it's over. Hoping for an after just distracts from what i should be doing now, and I usually stop focusing on what might be after and simply try to enjoy now. Still, I will be afraid of death, it's a natural biological countermeasure to ensure my genes get a chance to pass on. \n\nTLDR: I have no idea.",
   "created_utc": 1692510797,
   "score": 3,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyq2k5",
   "message": "You know when you go to sleep and it just pitch black and the next second your awake after 8 hours of really good sleep. \n\nI think death is the pitch black part of sleep but perminantly.",
   "created_utc": 1692510922,
   "score": 2,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyqimi",
   "message": "Your soul Returns to The collective consciousness of the universe, Is ready to be returned to a new vessel after many many years",
   "created_utc": 1692511224,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyqxsz",
   "message": "That you’re reborn as the person you loved.",
   "created_utc": 1692511512,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyqzs2",
   "message": "Honestly, no fracking clue. I was raised Christian but with my belief system changing as radically as it has lately, maybe there’s nothing? Maybe there’s an afterlife? Maybe reincarnation, since there have been (supposed) records of this happening. Maybe following the universe’s theoretical of its Big Bang and Big Crunch cycles we experience the same life over and over or maybe there’s just slight variations of it, and there’s billions of years between each lifetime. It’s a big blob of bunched-up questions that I am usually not awake enough to read into.",
   "created_utc": 1692511550,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyr7ny",
   "message": "I believe that when we die, we will face God and be judged for our actions while we were alive. Morality is everywhere; there is clearly right and wrong, good and evil. We see it even in our own law systems, and the consciences that we have. We want to help those who are suffering, and also see how wrong and sin breaks people apart and harms the world. \n\nAnd just as a criminal in our law system doesn't get pardoned simply for how much good they have done, we will not get a pass from God because we think we have \"balanced the scales\". And we all have done wrong (Rom. 3:23). The only way to heaven is for atonement through the blood of Jesus, who paid our debt so we could be free from our otherwise justly received punishment, which is hell.  The best explanation is theism, not atheism for our problems, and Christianity among all other religions has the most evidence and coherency behind it. The Bible says Jesus is the only way (John 14:6). There is not many paths, but one. \n\nI hope all reading this will see that while we try to love and do good as human beings, there is undeniably much harm and suffering in the world. God says that you are valued despite the brokenness that all of us have. Please turn to Jesus because He loves you.",
   "created_utc": 1692511699,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyr9ya",
   "message": "worm food",
   "created_utc": 1692511743,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyrmf0",
   "message": "You  either see the religion you believe in or just straight up black either that or you might even reincarnate is what I would think",
   "created_utc": 1692511980,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyrq3u",
   "message": "There’s a site called NDERF that has multitudes of submissions where people describe their near death experiences \u0026amp; what they experienced on the other side before being brought back",
   "created_utc": 1692512053,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyru6g",
   "message": "On good days I believe in a kind of Choose-Your-Own-Adventure version of reincarnation.  Like in a roleplaying game where you get to pick your stats, but instead it's things like the circumstances of your birth, the kind of struggles you want to grapple with, what you want to accomplish, etc, and see how it goes.  You get to pick a few major milestones of your life of your life but without the details, like 'I think I want to be disabled this time to see how much harder it is to do X' or whatever.  Of course you forget all of this as soon as you're born and you just have to make a go of it like everyone else, but at the end you get to remember all of it, even the things your meat-brain forgot, and integrate it with the lessons you've learned from your previous lives before starting again.  This time I was the weird/funny guy with a lot of medical issues but an insatiable desire to learn, maybe next time I'll be a pretty normal mother of two, the time after that an extreme sports athlete, who knows?  \n\n\nOn bad days.. I remember thinking when I was a kid that blind people can't see nothing, they must see blackness because that's what I see when I close my eyes.  Then one day I realized that I don't see blackness behind my head or beneath my feet or other places where I don't have eyes.  On bad days I think death might be a little bit like that.",
   "created_utc": 1692512131,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyry5s",
   "message": "I feel like we restart the same life we just led. We just have no recollection of living it previously. We do this an infinite number of times, forever. We just make slightly different choices each time.",
   "created_utc": 1692512209,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwysb7h",
   "message": "I died once. Nothing happens. It’s black nothingness.",
   "created_utc": 1692512464,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyso7r",
   "message": "Gonna be honest I believe that there’s a heaven, Hell, and Purgatory.\n\nKinda like a mixture of the TV shows “The Good Place” and “Lucifer”, I feel that your afterlife is judged first by how many points ya rack up good, and bad. A 50/50 split winds up in a purgatory where nothing good or bad happens to you for all eternity\n\nHell is the metaphorical “F-Minus” grade where ya done fucked up and wind up in Satan’s playground for all millennia. Heaven kinda self explanatory, whatever you deemed as your personal paradise in the living world becomes a majority of what your afterlife turns into.\n\nBut I say it’s also kind of like “Lucifer” in a sense because I feel your hell / purgatory isn’t supposed to be the end all be all, that you wind up in hell due to your living world guilt and you need to repent for all sins, then and only then do ya send yourself up to Heaven. Purgatory similar albeit you don’t suffer as much so merely just sorta repent and go up. Heaven is final destination no matter what.\n\nI reference these shows for baseline but I have believed in this system since I was 6-7, looooooong before these shows were made or ever on my radar.",
   "created_utc": 1692512714,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwysqqv",
   "message": "Probably the same as before you were born. Nothing. Comforting yet terrifying",
   "created_utc": 1692512764,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwysv9u",
   "message": "r/nde",
   "created_utc": 1692512855,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyszmy",
   "message": "I’m Christian, so you know what that means. BUT! I did use to think that once we died, we just…ceased to be ig? Idk, think of it as going to sleep, not having any dreams, and then waking up again. That feeling of no time passing. That’s the best I can describe it.\n\nAnd thinking that way, just made me not really want to go on struggling in life ya know? Now, we really don’t have factual evidence that God is real (unless we do and I’m just a moron haha), but that’s where my personal faith comes in. Faith is believing something could be it could happen. That’s why I’ve chose to believe in God, just gives me a sense of ease knowing things will get better and my struggles aren’t in vain.\n\nP.S. Not trynna convert anyone haha, just my opinion on death. It is fascinating to see everyone’s answers",
   "created_utc": 1692512942,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyttbw",
   "message": "Cessation of consciousness. We are lucky to be alive but we are also cursed that we have to face our mortality eventually and just disappear.",
   "created_utc": 1692513531,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwytx8k",
   "message": "You get to the death land with dead people. And darkness, nothing no noise no nothing you won't feel nothing.",
   "created_utc": 1692513611,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyudd2",
   "message": "Energy is only borrowed. It will return to the earth \u0026amp; universe",
   "created_utc": 1692513935,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyudir",
   "message": "I’ve been wondering this lately",
   "created_utc": 1692513938,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwyueud",
   "message": "Everything you are is in your brain. When the brain dies, you cease to exist. You don’t perceive nothingness. You don’t perceive time. You don’t perceive anything, because you no longer exist.\n\nYour body remains and people who knew you will deal with the loss of you, and any repercussions of your nonexistence.",
   "created_utc": 1692513966,
   "score": 1,
   "submission_id": "15vymoy"
  },
  {
   "comment_id": "jwywmrg",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15vymoy"
  }
 ]
}