{
 "submission_id": "15w22cy",
 "title": "what was your one paranormal experience that you want to tell?",
 "selftext": "",
 "created_utc": 1692507857,
 "permalink": "/r/AskReddit/comments/15w22cy/what_was_your_one_paranormal_experience_that_you/",
 "score": 66,
 "url": "https://www.reddit.com/r/AskReddit/comments/15w22cy/what_was_your_one_paranormal_experience_that_you/",
 "comments": [
  {
   "comment_id": "jwyqoly",
   "message": "I was in France at a remote special training school while serving in the Army. It was comprised of male and female soldiers. The females stayed on the second level of the barracks in rooms with 6 girls in them. It was intense training and we always crashed at bedtime. About an hour in to my sleep I rolled over to see my grandfather standing next to the bed, as clear as day looking right at me with his hand on his suspenders, like he always did. I screamed so loudly and for so long before I fully woke that almost all the male soldiers made it to our room to help all of us--who were all screaming in reaction to my waking terror. I was speechless and had to be calmed down by others before I settled down and we eventually fell back asleep.\n\nThe next day I got a Red Cross message and was escorted to my unit to get my dress uniform and go back to the states because my grandfather had passed away. I'm pretty sure he came to say goodbye to me.",
   "created_utc": 1692511338,
   "score": 53,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwynp6m",
   "message": "After a failed suicide attempt 30 plus years ago, I decided I really wanted to live. I felt someone hug me. I was alone in my apartment, but it brought me to tears. From that moment on, I knew somehow I would be okay. I have been.",
   "created_utc": 1692509378,
   "score": 40,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwyljk0",
   "message": "At my grandma’s house, especially during the night, you can hear footsteps sometimes as if someone was walking up there. The house is only one floor though. Nobody knows what causes it. Everyone says her house is haunted because of other things that happen there too but hearing footsteps is definitely the creepiest thing I’ve experienced.",
   "created_utc": 1692508051,
   "score": 17,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwysmxg",
   "message": "I dreamed one time I was running in the woods and came upon a barn. Inside the barn was a girl in a white dress. The next day was Easter and I saw my cousins and they both had the exact same dream as me. Creepy, but not the end of the story. Years later I was at a girl's house on a first \"date\" or whatever and she was showing me around her property. We get in her backyard and I literally freeze in place staring at the woods entrance. She asked me what's wrong and I just said \"is there a barn about a half mile back in these woods with a big cross beam on the door with the door opening left and right?\" She said \"Yeah, how did you know that?\"\n\nI walked away and literally sat in her driveway in disbelief for like 30 minutes. No follow up date and I have never been to that barn. Not sure what to make of any of that to this day. I don't believe in magic or gods or anything, but this definitely happened to me.",
   "created_utc": 1692512690,
   "score": 8,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwyv1eu",
   "message": "My son had open heart surgery at 6 days old.  His first year was a lot of medication and doctors visits and so on.  He was on a feeding tube for the first 4-6 weeks of him being home post operation.  Because of his medication and feeding schedule we had him sleep downstairs on a little boppy thing and my wife or I would set an alarm to feed him\nAnd give him his medication.  And like clockwork every single night when it was all 3 of us in the living room after about 10pm we would hear feedback. Like a microphone if plugged in and places to close to the amplifier.  It was very loud in that room, but you it was only present in that room.  I would walk thru the house to find it see if it was outside and it was only in his room.  Once he was off the feeding tube and out of that room for sleeping and everything was normal the sound stopped and luckily it hasn’t come back…. But it creeps me out years later and my wife refuses to talk about it.",
   "created_utc": 1692514427,
   "score": 3,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwyoyf8",
   "message": "Tried to close a door once when i was a child. It fought back to try to open up again. Slammed that shit closed. That house was haunted dog.",
   "created_utc": 1692510184,
   "score": 4,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwyrtem",
   "message": "Random faucets going on and off randomly throughout the day, chandeliers shaking when no wind is present, same with shower curtains. My family and friends have claimed to see a similar shadow in my computer room. Footsteps upstairs when I’m home alone. The intercoms with turn on randomly(I think it’s an interference but I figured I should add it). Yeah that’s really it.",
   "created_utc": 1692512117,
   "score": 2,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwyvld5",
   "message": "There was a mirror placed at an angle, so if you looked at it from the side, you could see a hallway across the hallway, horizontally, was a room, and on the other side, stairs. Well, one day I was walking and saw in the mirror something… it was like a dark cloaked human… almost like the grim reaper. It was so long ago though that I can’t trust my memory entirely, but I know it was a dark humanoid thing, and it moved from the stairs towards the bedroom.\n\nI got scared, but thought that perhaps it was my sibling, and I just didn’t see them properly. Trick of the light kind of thing, so I went into the bedroom and it was empty. I fucking ran downstairs and told my mom. Nothing happened though. I mean, what was there to be done? My mom wasn’t about to call a priest over something I saw for less than 2 seconds as a kid.\n\nI saw a shadow being only one more time in my life, and ever since then, things have been pretty chill in the paranormal department, thank god.",
   "created_utc": 1692514842,
   "score": 2,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwyyhls",
   "message": "My dad, sister, and I all heard banging in my moms room while she was out of town one night",
   "created_utc": 1692517042,
   "score": 1,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwz0r0j",
   "message": "Okay, I'm not sure if this is \"paranormal,\" but I can't explain it any other way. And I really don't believe in the supernatural or paranormal. \n\nI once walked into my bedroom with a \"Polly-O Twists\" string cheese. As I got to the dead center of my room, which is nothing but carpet, I accidentally dropped the still plastic sealed string cheese. I saw it fall, it went straight down towards the floor. Right before hitting the ground, something happened that I can not explain for the life of me. \n\nWhen my string cheese landed, it made a loud, reverberating metallic \"THONK\" akin to it falling into an open cooking pot and VANISHED. I still can't explain it. I've tried telling my partner about it and she still thinks it must have bounced somewhere and landed hidden from sight.\n\nEven if that's the case, the sound makes so sense. My entire bedroom is wall to wall carpeting and there are NO metal or hollow objects on ground level that would make such a sound. I've since redecorated my room, got a new bed, and re-arranged the entire decor and while doing so, I ACTIVELY hunted for that string cheese. Never found it. \n\nIt's driven me wild for years, and no one will believe me. I have NO satisfying theories. I just joke about a goblin who lives between dimensions and stole my cheese. But seriously, I sometimes just get pissed off thinking about it. I want answers, dammit!\n\nEdit: typos.",
   "created_utc": 1692518815,
   "score": 1,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwz1a2s",
   "message": "Lived in an old historical church house growing up in upstate NY. Everyone who spent a night at our house said it was haunted. It was specifically mine and my sister’s side of the house though. We used to hear heavy breathing. A common symptom of sleeping over was feeling something sit on your chest in the middle of the night, waking you and making it hard to breathe. That happened only in my room. I used to see a man in a red shirt with dark hair— very nondescript looking— a couple times around the house, only through windows. He looked like an NPC. Never looking in like some peeping Tom. I always felt kinda like he was a past resident because he payed us no mind. Was told it was just my imagination. My sister would roll out of bed every night in her sleep, bumping her face on the floor, giving herself nose bleeds. All the time. There was a permanent blood stain on the wood floor after we left. \n\nThere were other sightings of a little girl and a “colonial” looking woman, but parents never believe kids. TVs and radios would turn on on their own. So many small instances. Nothing provable or definitive. I don’t even want to look up the history for that address.\n\nI swear there was evil in that house though. I still have awful nightmares about that house. Always our side of the house. Always this one corner of my room with a window looking down on the street (2nd floor.) I don’t know how to describe it. Nothing innately scary is present in the dreams; no monster or visible ghost, but the presence is everywhere. This looming, imminent threat. But specifically in that corner. I’m back at this house for some undisclosed reason— maybe I’m even a kid again— everything’s the same: the bunk bed, the yellow hallway with uneven stairs going down, my sisters room across from mine, the cracked dry wall that would just crumble under your finger tips to reveal yellowed newspaper that was used as insulation, old toys, etc. Like I always go back there, like I’m trapped.\n\nThat’s just a quick synopsis because it’s late. Hoping I don’t go back to that house tonight in my dreams because I rehashed it.",
   "created_utc": 1692519234,
   "score": 1,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwymj8b",
   "message": "Not that paranormal but when I’m mowing my lawn sometimes when I look around my yard some of the trees look like Bigfoot, slender man or any really but guy. I know it’s just the way the trees look but it can freak me out sometimes",
   "created_utc": 1692508643,
   "score": 5,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwyrl8j",
   "message": "I live in Florida so alot of old houses and land with native burialgrounds as well as I'd assume areas where many slaves died. \n\nWorking as a pizza delivery driver I've been to many places that gave me the creeps but a few that actually spooked me as far as paranormal goes where your intuition tells you something it off/thr small hair stands at the back of your neck. \n\nOrder came in for me to delever to a place i never been to at 11:30pm, I drove down a super spooky dirt road off a old highway no one uses on the outer part of town so no roadlights and bearly any traffic other then 7am/5pm when people are going and coming from work. \n\nThe dirt road has very old large oak trees covering the sky making it even more darker about half a mile in I make it to what I think is the house which looked like a shack and lights all off. I call the number 5 times trying to get them to come out or turn the lights on they don't. So I leave my car running parked and my handbrake also up(habit that I never forget to do) my high beams on so I could see where I was going. I get to the house and knock and no one answers. I stand there for about 5 to 7 minutes trying to call and knock again, but no one answers. \n\nI get a wierd feeling behind me and I turn around to look at my car and something seemed off after about 30 seconds it looked like my car was moving very slowly towards me so I run to my car about 20 to 30 feet away and as I do the car starts speeding up, I guess catching momentum I manage to get in the car and put the car in park and safety break on completly freaked out. 1minute after that a old lady shows up outside the house screaming at me asking me what I wanted.",
   "created_utc": 1692511956,
   "score": 0,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwyss13",
   "message": "I was in the shower and felt a hand touch my lower back. I thought for sure it was my husband messing with me. When I got out, I told my husband he wasn’t funny and it didn’t scare me. He had no idea what I was talking about",
   "created_utc": 1692512789,
   "score": 0,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwyu4w4",
   "message": "I was para gliding normally",
   "created_utc": 1692513763,
   "score": 255,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwynpqw",
   "message": "I have too many to tell. But experienced stuff since a child. Still do to this day. For those that don't believe, that's cool. But your absence of belief does not equate to presence of being... One day you'll find out.",
   "created_utc": 1692509389,
   "score": 242,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwytqgm",
   "message": "I'm pretty sure my last home was haunted. One of my experiences was I saw my dad with a relaxed smile on his face, towel around his neck entering the bathroom. I told him \"oh dad you're already back?\" I went to the living room and was chilling with my sister until she told me dad didn't arrive home yet.",
   "created_utc": 1692513472,
   "score": 1,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwyz6s3",
   "message": "About 10 years ago, a house on our farm was kind of a spare house for a couple years. Sometimes it’d be two siblings living there for a while sometimes four of us and a couple partners, me by myself once.\n\n When just my oldest sibling was staying there for a month or two noises were happening, door latch would rattle a little, it would sometimes sound like a bass drum was playing in a back lawn. Foot steeps on the roof and around the house, but it started getting aggressive over a week or maybe two, like her guitar strumming in her room 3 meters from her, me and a few younger sibling’s and a couple friends went down to the house that night because she rang scared and wanted us to come get her. We all decided once we got there to investigate and just hang out in the room that’s when it started getting peak aggressive, the bass drum started and the door handle sounded like someone was really trying to get in but didn’t know how to fully open the door. Footsteps again on the roof and sounded like multiple people running around the house. \n\nWe all left back to parents house who were away, later that night one of my older siblings was going to their little cabin and had to drive past the spare house to get there, looks other to the house 80 metres away and sees 7 orange orbs going around the house, moving from the ground to the roof, moving around up there then dropping down to the ground again, the orbs were about the size of a basketball. \n\nBy the time they came back to tell us and we went to look there was nothing to see",
   "created_utc": 1692517595,
   "score": 1,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwz0erz",
   "message": "Grandpa really wanted to make sure you got that goodbye!",
   "created_utc": 1692518548,
   "score": 1,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwz0stn",
   "message": "High desert of Southern California, '04 or '05. Early morning, 1:30ish. A friend and I were walking North along a dirt road toward his house when a light appeared behind us; we thought at first it was headlights from a car since our shadows were cast very far forward into the night but there was absolutely no noise and then we could tell the light started ascending rapidly into the sky as our shadows got shorter and shorter. After a couple of seconds the light was so bright our surroundings looked like it was midday then suddenly the light was gone. It happened so quickly and we were both too stunned to turn around until it was all over and by the time our eyes adjusted from the shock we couldn't see anything out of the ordinary. \nWe tried to be logical about it at first and thought that it might have been a rocket test of some sort from deep in the desert but we could never find anything to substantiate that idea online (we realized that not all military activity is announced to the public but we couldn't even find other reports of people witnessing something odd that night).",
   "created_utc": 1692518853,
   "score": 1,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwz2q9n",
   "message": "I don’t know if this is the paranormal experience you’re expecting but about a year after I lost my mom, I had a very vivid dream of her visiting me. \n\nIn my dream, I was walking down the street of my the neighborhood I was living in at the time. I saw my mom in the front yard of one of the houses, looking completely healthy (I wasn’t used to seeing her like that). I ran up to her and she held me for awhile, staring at my face and telling me how beautiful I was as a grown woman. My mom went blind when I was a really young kid, so I knew I wasn’t dreaming of a memory. After a long moment of crying in each other’s arms, my aunt who had died a couple years before my mom opened the front door of the house to tell my mom to come back inside. I wasn’t close with my aunt, the last time I saw her I was a child, and I never really thought of her either. So it was unusual for me to dream of her all of a sudden. My mom asked me to come inside with her, and even though I missed her and wanted to spend more time with her, I told her I couldn’t. I guess I knew in my dream that the house was symbolic of the afterlife. She understood, we said our goodbyes, and she went inside with her sister. Now I know this wasn’t just a regular dream because it messed me up for weeks after I had it. I had dreamt of my mom before this, and it never affected me the way this one did. And it’s never happened again since, despite still seeing her in my dreams to this day. I really believe that was actually her, coming to visit me one last time.",
   "created_utc": 1692520388,
   "score": 1,
   "submission_id": "15w22cy"
  },
  {
   "comment_id": "jwz2smt",
   "message": "We had just moved houses when I was around 7. The very first night my mother and I stayed up setting the house up while my father and sister slept. My mother was in the far end of the bedroom while I stood by the door looking into the lounge, I saw a human shaped black shadow just walk through the lounge, look at me, then go into the next room. I tried to follow it but it disappeared. I told my mother and she said to check my family was still asleep, which they were in the next room. \n\nWe stayed there for a few years and things always happened that felt weird, such as I looked under the bed one night and saw a face... etc. \n\nYears later when we moved out and I was in highschool my parents said they also saw very strange things in the house and that the previous owners wife had died in the house and there was possibly an affair involved.",
   "created_utc": 1692520441,
   "score": 1,
   "submission_id": "15w22cy"
  }
 ]
}