{
 "submission_id": "15wjxe2",
 "title": "What did you get fired for?",
 "selftext": "",
 "created_utc": 1692558480,
 "permalink": "/r/AskReddit/comments/15wjxe2/what_did_you_get_fired_for/",
 "score": 215,
 "url": "https://www.reddit.com/r/AskReddit/comments/15wjxe2/what_did_you_get_fired_for/",
 "comments": [
  {
   "comment_id": "jx1njgu",
   "message": "The owner of our restaurant was smoking too much heroin and thought we were all stealing. We showed up to work that day to find he had changed the locks and put a now hiring sign up in the door.",
   "created_utc": 1692564734,
   "score": 112,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx19doo",
   "message": "Our store was going out of business and I was ''Too negative about the store closing",
   "created_utc": 1692559153,
   "score": 180,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1qf0d",
   "message": "We were told we get OT for night work\n\nThe new \"company manager\" let it slip that we don't actually get OT for night work, so when I was scheduled for five nights in a row working on a transmission line cell site I mentioned that I expect everyone working from our company on site get OT.\n\nOnce it was said that we won't get OT and that it wasn't an actual policy (was written in employee handbook), I forwarded the email chain to the entire company and leadership at Verizon.\n\nI was canned, but now everyone gets OT for nightwork. \n\nMy life is better now anyway and got my people what the deserve\n\n*edit\n\nThank y'all for the support, worth mentioning that it doesn't matter what our role is to make a difference for the folks around us. Even after the miserable events that followed this, suffering the reality I brought up on myself, it was very much worth it even if only on a personal level.\n\nDon't hesitate to pull the trigger on some assholes that get paid to ruin you and be kind to the people who work with you",
   "created_utc": 1692565875,
   "score": 206,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1q7vm",
   "message": "Aggressively squeezing breakfast muffins lol.\n\n\nI was a few days into working at Mcds and someone complained I gave them a muffin that was too hard-they bake them at like 3 am and sit in a warmer all day. This was before they had the full bakery menu, I think muffins was the only thing baked and maybe cookies. So my manager told me to squeeze them before I hand them out. \n\n\nMe being a dumb teenager squeezed the shit out of these muffins and got another complaint. They stopped scheduling me haha",
   "created_utc": 1692565795,
   "score": 135,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1mxbx",
   "message": "The companys timeclock software ran off of the computers time, so when I was late I would just close the software, change the time back to before shift start and then clock in and change it back.\n\nEdit:   The supervisor who showed me the trick fired me, after I told him to stop being a bitch and fire me.  A day or two later he saw me pulling in late, and when he went over the time info that day, it showed me clocked in on time.  He knew why.",
   "created_utc": 1692564498,
   "score": 174,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx19cwj",
   "message": "I just stopped working and began only attending meetings. Lasted almost 9 months that way before they let me go.",
   "created_utc": 1692559144,
   "score": 113,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1l2xn",
   "message": "My boss was talking shit about me to employees, and I confronted her with “how would you expect the people below me to respect me when you show them that you don’t?” She didn’t like it and literally went crying to the owners, who then fired me for “causing problems.” \n\nClearly I was better off not working there.",
   "created_utc": 1692563777,
   "score": 144,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1m3mn",
   "message": "I got fired for slacking off and underperforming at work by taking my legally required lunch.",
   "created_utc": 1692564174,
   "score": 32,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1wuhk",
   "message": "Embezzled almost $500,000 from the doctor's office I worked at.\n\nOh no, wait.  That was my former supervisor who did that...26 years after she fired me for taking home a left over slice of pizza after a drug rep hosted a pizza party for the office staff.\n\nKarma can take a long time, but it always comes through.  ;)",
   "created_utc": 1692568522,
   "score": 146,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1v47i",
   "message": "I got fired, but then luckily rehired thanks to my union, because my manager confronted a shoplifter 4 times her size and the guy started to beat her. I along with other coworkers intervened, pinning him to the ground till cops arrived. The next day, store reps came in told me I shouldn’t of intervened and let me go lol.",
   "created_utc": 1692567808,
   "score": 139,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1l6np",
   "message": "I took two days off to put down and grieve my family dog who was 16 years old. I came back on Monday and they said \"they no longer trusted me\" despite opening and closing the shop for 6 months.",
   "created_utc": 1692563818,
   "score": 118,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1npja",
   "message": "HVAC: me and my buddy were assigned to a paper plant. He did installs, I did service/maintenance.\n\nNote: refrigerant is closely monitored by the EPA with savage repercussions for misusing it.\n\nSo, I would only use a couple pounds here, a couple there, just for topping off units. I meticulously recorded everything I used.\n\nMy buddy was using three or four jugs at a time (25 lbs a jug) because he was installing brand new units. And he never recorded what he used. Yikes.\n\nMy bosses decided to fire me because I wasn't recording my refrigerant usage. I threw my pocket notebook on the desk. \"It's all right there. Everything I used.\" Their eyes bugged a little because they knew they got caught lying.\n\nThe difference between the other guy and me? I wasn't related to anyone high up in the company, like my buddy.\n\nTruth be known, the company is going down and they're letting tons of people go. They made up lies to fire me. I don't hold it against my buddy - he didn't fire me.",
   "created_utc": 1692564800,
   "score": 28,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1tkmf",
   "message": "1970s YES \"'Close to the Edge\" tour. I had my tickets and had the request approved for time off, they changed their mind at the last minute and would not let me off. Pfft. Left anyways and was genuinely surprised when I got back on Monday and they informed me that I was fired.",
   "created_utc": 1692567165,
   "score": 11,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1mqj7",
   "message": "This one's the worst.  I don't know why.  I thought everything was fine.  I was there over 5 years then one morning they offered me a.) a month's pay and go or b.) get a lawyer if I wanted to know why and take it from there.  We didn't have money for a lawyer, husband was still in college, so I walked away with a bit of cash.  Bugs me to this day.",
   "created_utc": 1692564423,
   "score": 153,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1owc1",
   "message": "Went on a company business trip and accidentally found out my two immediate managers were having an affair - I DIDN'T GIVE TWO SHITS - never said a word, but should have reported to HR as the global manager (male in affair) then did his best to get me fired, including making up lies about me stealing time, which I was able to prove was lies (thank you email and phone records), except for one hour of the \"stolen\" time.  The female in affair tried to give me warnings and let me know I needed to get help. \n\nI went on early maternity leave and both of them were fired within two weeks - because of this. \n\nCame back from maternity leave to a very hostile work environment, despite the affair and the firings having nothing to do with me.  Was back for a month and they ended up firing me as \"it wasn't working out\" despite stellar reviews from those I worked with and my clients.",
   "created_utc": 1692565269,
   "score": 27,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1udul",
   "message": "Worked at a gas station and was a sucker for the free soda. I would drink a few 24 oz glasses of Dr. Pepper (don’t judge) per shift and had to piss relatively frequently. I usually worked with the same lady every shift and every shift my drawer came up short even like $10-20 bucks. One day my usual co-worker was off and I worked with another lady who warned me to watch my drawer around the other and hers had been short when she was around. That got me to thinking. \n\nThe next shift with the usual lady I stuck some receipt paper into the lip of the bottom of my drawer and hit the bead. When I came back the paper was on the floor. My drawer was short $20 at shift change and my boss fired me. I told her of my findings and asked her to review the security tape. She told me to fuck right off the other lady had been there years. I left heart broken and rented some VHS tapes to indulge in and recover. One of the movies was Casino and man is that a good movie. \n\nCome to find out the usual lady was the boss lady’s cousin and they fuckin told people I knew I got fired for stealing money. I though about calling a lawyer but also, I was in high school and was delusional I suppose. \n\nI got out of that town after high school and rarely return especially considering all my family moved off.",
   "created_utc": 1692567502,
   "score": 1,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1qbqt",
   "message": "Being the last hired when they instituted layoffs.",
   "created_utc": 1692565838,
   "score": 18,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1rhus",
   "message": "I was fired after a month into my first job at a local pizza joint when I was 16. They called me during the Super Bowl and said I had to come in. I told them I was out of state without a car so no way I could make it. They said I should’ve known this was one of the busiest days of the year and I should’ve stayed in the area. I came in to work my next shift and they just gave me my paycheck and said they had to let me go for not being a team player.\n\n10 years later I was fired from a job in tech because I refused to move out of state. This one hurt alot more.",
   "created_utc": 1692566312,
   "score": 43,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1po2y",
   "message": "I worked for a small English language school with two teachers. The other teacher said something very worrying and slightly predatory, and I told our supervisor. The supervisor got angry at me, because the students liked the other teacher, and a month later when it came time to extend my contract, I was told I would not be rehired. The other teacher received a 100-euro bonus.",
   "created_utc": 1692565576,
   "score": 199,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1v6ta",
   "message": "Caught the boss stealing. So he fired me. \n\nHis word vs. mine and it didn't go my way.",
   "created_utc": 1692567837,
   "score": 242,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1o0yn",
   "message": "I put too many toppings on people’s sandwiches when I worked at Subway.",
   "created_utc": 1692564923,
   "score": 52,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx18bi8",
   "message": "I was a terrible employee",
   "created_utc": 1692558735,
   "score": 230,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1evb3",
   "message": "Leaving early because i was blacking out working in the heat",
   "created_utc": 1692561323,
   "score": 120,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1ss4z",
   "message": "Long story short, I worked in a nursing home for rich people for 2 months. This old man is a perv and has grabby hands. He molests lretty much all the young orderlies when they do his morning hygiene. A girl was crying because he grabbed her ass and tried to get her boobs. He also used racist insults when she left. This was not the first occurance, but I was new and it was the first time I heard about it. The orderlies supervisor wanted to force the girl to go back to this man’s room and she refused, there were fighting about it. I was the nurse in charge at the moment so I told them to send one of the guys instead. I got told basically that the resident was rich so he could do whatever. I was appalled and furious. I wrote an email to the manager telling her about this abuse and how it was unacceptable that his behavior was normalized by the supervisors, how we should be protecting our staff and provide a safe environment to work in. SA is SA. Got fired the next day somehow 🤷🏼‍♀️",
   "created_utc": 1692566841,
   "score": 203,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1mkc2",
   "message": "I worked at Sears, I just walked in for my shift and the store manager asked why the department was a mess. How the fuck should I know? I just walked in. Yep, well that lead to an exchange of words on the sales floor. I probably shouldn’t have said “go choke on a glittery dildo”.\n\nJust a little backstory, the store manager was a lesbian, as am I, and she automatically thought that meant we were buddies.\n\nStill to this day I flip her off when I see her driving. Fuck you, Lisa. 😘",
   "created_utc": 1692564356,
   "score": 11,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1qfp6",
   "message": "I worked in AP for several months and had the ability to issue payments. There were some payments that weren't accepted by the client and I was tasked with researching why. I discovered the problems and sent it over to the team responsible for updating contact and payment information (segregation of duties required that I couldn't change where the money went because I was the one effectively writing the check). \n\nThe team responsible did nothing with me sending weekly emails asking for updates. I went to my manager and the manager above her with documentation requesting the changes. After 4 months, they were asking me for a timeline when the outstanding payments would be taken care of, and I told them that I needed them to tell to the other team to get the payment information fixed or nothing could move forward. I was told that it would be addressed.\n\nFast forward a month, nothing was fixed, I was asked again for an update. I told them I was beyond frustrated with the situation because nothing was getting done and that I had no faith that my managers would actually do their job and that I was tired of the incompetence. Let's just say that they didn't like that",
   "created_utc": 1692565882,
   "score": 37,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1kkf5",
   "message": "Took too many leaves. As I was preparing for masters degree. And I couldn't disclose it to my boss.\n\nSo I took holidays for random reasons. Basically was trying to settle my finances for fees.\nI got fired. \n\nThen after a month I got admission to masters degree. Pursue a degree for next year. \nLanded in better paying job after. 😅",
   "created_utc": 1692563578,
   "score": 101,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx20mmj",
   "message": "Fired once from a night auditor position at a hotel because the swing shift lady decided she wanted my job.  After 4 months of working straight (owners refused to hire another person that wasn't family) I finally was able to take 2 days off.  When I woke up the first day, there was a message on my answering machine saying that I was fired because the audit was completely screwed up and the swing shifter had to spend 4 hours fixing it.  \n\n\nI was OCD about the audit so I knew it was BS.  I asked them to check the audit sheets to see if my initials were on the back bottom corner.  They said no so I knew right then I was set up and told them so.  Doesn't matter though, still fired.  Found out 6 months later that the swing shifter not only got my position but was fired for stealing almost 10 grand from them.  Karma people....Karma.",
   "created_utc": 1692570104,
   "score": 130,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1uok0",
   "message": "New operator forgot a piece of his equipment when he left.  I had to make a run out to where he was with what he needed.  Foreman told me to drive home the point he needed to check his equipment before he left the yard.  I did.\n\nTwo weeks later they fire the foreman and introduce the new guy.  Of course it was the operator I chewed out for not checking his equipment.  Wanna guess who the first person HE fired was?",
   "created_utc": 1692567625,
   "score": 111,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1bphn",
   "message": "Ah yes, my first summer job during high school. Got my  managers daughter arrested for assaulting a customer. She didn’t work there but slapping a woman in a wheelchair for “taking up to much space” was not something I could let slide.",
   "created_utc": 1692560074,
   "score": 31,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx19zze",
   "message": "Submitting resignation paperwork.",
   "created_utc": 1692559399,
   "score": 60,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1ulvr",
   "message": "Depression. It was full time at an auto parts store. I had to stop going to school because the depression was too much. I would try to go to work but was often late or would call in. The regional manager told my store manager i had to be let go because i wasn't reliable. He wasn't wrong. My boss was crying as he did it. He knew i needed help and wanted to be the last thing i could hold on to. \n\nI ended up getting help and doing much better. That was about 16-17 years ago. I still have moments that kick my ass. But i can work around it better. Also super rare.",
   "created_utc": 1692567595,
   "score": 195,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1tgr3",
   "message": "Did a big project, boss took the credit and presented to the whole company and I was fired the next week.",
   "created_utc": 1692567121,
   "score": 95,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1n2c4",
   "message": "- New COO comes\n- fires me for difference of opinions. \n- new COO leaves after 3 months\n- I'm re-hired for a superior role\n\n- a year and a half later - I'm fired for difference of opinions about management style with my direct manager and new new COO\n- 4 Monthes later: the COO switched roles to another department, and my ex-direct-manager is on the way out...\n\n- here's me waiting to get re-re-hired, and then fired for the 3rd time from the same company ;)",
   "created_utc": 1692564551,
   "score": 69,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1n6n1",
   "message": "Another one... I was stacking wood behind a machine and a piece wood shot out. The wood splintered into my hand, I cleaned up the wound, notified the supervisor and went back to work. At the end of the day I was fired for being lazy and not stacking fast enough. Oddly, I was stacking fast enough to keep up with the line.",
   "created_utc": 1692564596,
   "score": 178,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1e2id",
   "message": "After months of being told I was useless and too slow to do the job I had a massive panic attack and my mom made me call in sick. I got fired, best thing to ever happen.",
   "created_utc": 1692561006,
   "score": 127,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1zvin",
   "message": "I reported harassment and got fired. Fuck that place.",
   "created_utc": 1692569773,
   "score": 111,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1rdeb",
   "message": "Not me but one of my co workers came in drunk and hungover and proceeded to have a 2 hour nap in the lunch room and then was shocked to find out he was getting fired.",
   "created_utc": 1692566262,
   "score": 129,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1ssen",
   "message": "Worked at a children's theatre. Ended up dating a coworker. We kept completely professional at work but would see each other after hours. A parent saw us holding hands or something small and complained that we were setting a bad example for the kids.",
   "created_utc": 1692566844,
   "score": 159,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1mcrs",
   "message": "Spending a Saturday with my girlfriend when she had a cancer scare. Phoned and left a message explaining the whole situation on the Friday. Monday morning I was fired. The tests came back negative a few days later.",
   "created_utc": 1692564273,
   "score": 153,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx2fzf9",
   "message": "I got fired from my tech support job for telling customers to \"turn their computers off and on with an accent\" to fix issues. Apparently, a British reboot doesn't actually solve glitches! 💻🇬🇧😄",
   "created_utc": 1692576901,
   "score": 105,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1nxu6",
   "message": "Got ridiculously drunk at an industry conference out of town in Boston. Ended up sleeping with the wife of a senior level exec who worked for a vendor of ours. That was on Thur night of a 3-night stay. Friday night, the exec found out and confronted me in front of my boss. Let go almost on the spot (we were walking to the elevators when he said it was a really good idea if I found a new place to work). Room was paid for through Sunday, so I stayed in Boston (just kept away from the hotel bar and conference center), bar hopped and took in a Boston College football game. Sat night, exec’s wife shows up at my room very late, very drunk. We fucked again. Took me 5 months and a change in industry to find a comparable gig and shed that experience. This was about 15 years ago…nothing similar has happened since LOL.",
   "created_utc": 1692564890,
   "score": 117,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx182zw",
   "message": "I worked for Hobby Lobby as a manager in my mid-twenties.  I was fired when they found out I was gay. They said it didn’t fit with their “family values.” \n\nReason #974,356 to hate Hobby Lobby!",
   "created_utc": 1692558639,
   "score": 149,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1qyes",
   "message": "My brother tried self-harming himself at school, so I left work to go get him and speak with counselors to set up therapy. Had to miss the following day as well. Got fired for missing that 2nd day",
   "created_utc": 1692566093,
   "score": 88,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx20osm",
   "message": "I was fired from Lowe's for calling in sick after my 6th shift.\n\nSome stomach bug had been going around the store, I caught it and got pretty sick. Called in and was told if I was willing to call in before 2 weeks that I wasn't Lowe's material.\n\nTurns out I wasn't and made a pretty good life for myself without Lowe's.",
   "created_utc": 1692570131,
   "score": 127,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1lkz5",
   "message": " not fired but almost fired for eating all the chocolate inventory. apparently i was caught on camera opening the boxes in the back and snacking on the food multiple times. whoopsie",
   "created_utc": 1692563971,
   "score": 171,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1sw10",
   "message": "Giving away the \"secret recipe\" for scones, which was taped to the side of the refrigerator IN FULL VIEW of customers!",
   "created_utc": 1692566883,
   "score": 99,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1xtuu",
   "message": "I worked at a gas bar for my first job and the new manager had it out for me because I wouldn't put up with her bullshit. She was in way over her head and put into a managerial position due to nepotism. Wrote me up over very *very* minor things that other employees wouldn't even get a talking to over. \n\nAccused me of stealing from the till because my float was out a few dollars, accused me of giving discounts to friends and family and tried to blame me for over-ordering that week's fuel delivery and causing an overflow of gas in the lot (even though that was like the sole thing the manager was responsible for doing). \n\nI was told my next write up would result in my termination and after realizing the company *and* our union didn't have my back at all despite me being the longest tenured employee at the time and several of my coworkers coming to my defense, I decided to hand in my uniform without notice the day before she was supposed to leave for a week long climbing trip and left without saying a word. One of my coworkers said she was furious at me because we were so short staffed that she had to cancel her trip to cover my scheduled shifts, so that made me feel a lot better.\n\nIf you're reading this, Jodi, I hope for your current employee's sake that you're not a such a huge cunt to work under anymore.",
   "created_utc": 1692568886,
   "score": 156,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1sjx0",
   "message": "\"Yawning too much\". And once after I dislocated my shoulder.",
   "created_utc": 1692566746,
   "score": 47,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1uufm",
   "message": "\"Updating my resume using company property\". \n\n100% worth it. That job sucked ass. This job made me call in \"sick\" for the first time ever because I hated it so much.",
   "created_utc": 1692567694,
   "score": 98,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx2fv52",
   "message": "I got fired from my job at the bakery for trying to organize a \"cookie rebellion.\" I guess the idea of cookies demanding equal rights was a bit too crumb-crazy for the boss to handle...",
   "created_utc": 1692576848,
   "score": 37,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1f432",
   "message": "Before covid testing was available to everyone, I got fired because I couldn't get a rapid covid test after being exposed.",
   "created_utc": 1692561419,
   "score": 63,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1stjf",
   "message": "Called someone “Hun” at a tattoo shop.",
   "created_utc": 1692566856,
   "score": 48,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx2fqx8",
   "message": "\r  \nI got fired from my lifeguard job for yelling, \"Water you up to?\" every time someone jumped in. Apparently, puns and pool safety don't always mix!",
   "created_utc": 1692576797,
   "score": 81,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1y5gq",
   "message": "Worked as a QA tester for an online game company. Found bug while on my personal account at home. Came in the next day and reported the bug. I was VERY clear I found the bug while playing at home on my personal account. It was a nasty bug that let you duplicate very expensive items. A few weeks later someone in customer service was checking the logs for people exploiting the bug. They found mine and the company decided to fire me on my birthday. That was around 15 years ago but it still upsets me every year, on my birthday.",
   "created_utc": 1692569025,
   "score": 169,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1s39z",
   "message": "Worked at McDonald's and in 2005 My boss fired me and told me it's for, \"Trying to take down McDonald'\"",
   "created_utc": 1692566554,
   "score": 60,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1ud25",
   "message": "I spoke my opinion about some things that had recently been said by the owners. \n\nTo be more clear - I spoke my opinion to my colleagues who were “my friends” and unless the owners had listening devices (we were a satellite branch) then I was unfortunately ratted out by one of the girls I worked with. \n\nSucks because I did a lot for her. Helped her a lot. Made her feel welcomed when she joined. And the the worst part - I fucking told her IF I EVER SAY ANYTHING YOU DONT LIKE JUST TALK TO ME AND ILL MAKE SURE IT DOESNT HAPPEN AGAIN. \n\nFirst time it happens (months later and with nothing to do with her) she rats me out first chance. \n\nCunt.",
   "created_utc": 1692567493,
   "score": 19,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1wewe",
   "message": "They hired too many people. I was there for a week.\n\nSomeone contacted the temp agency, and they contacted me that my services were over.",
   "created_utc": 1692568340,
   "score": 25,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx24z1c",
   "message": "Which job? Lol\n\nI once got fired for injecting drugs in the bathroom. I was a car salesman at the moment. (Circa late 1990s)\n\nThey found me nodded out on the bathroom floor. \n\nStay off the needle, kiddos.",
   "created_utc": 1692572017,
   "score": 28,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx2fu8t",
   "message": "I was 16 and working in a supermarket in the early 1980s NYC. I was fairly off the chain as a kid and would do random dumb shit. I had a thing for the A-Team as a kid and would imitate Mr, T as I went about my shift stocking shelves. \n\nThe hammer finally dropped when I boisterously proclaimed, \"I pity the fool who has to build the gafilka fish end cap\". Big props to Saul, he held out as long as he could.",
   "created_utc": 1692576838,
   "score": 68,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1pt84",
   "message": "Been working for nearly 40 years now. Was never let go until 2001, where I was let go from 2 jobs in a30 day period. \n\nWas never given an explanation other than “it’s not working out”. I still legit have no idea what I did as I thought I was doing well. \n\nNever been let go since. \n\nJust those 2 jobs within a couple weeks of each other lol",
   "created_utc": 1692565633,
   "score": 49,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx20hrk",
   "message": "Mopping “wrong”. After riding my bike to work every morning at 4 AM to make breakfast for 400 nursing home residents, then cleaning the kitchen, washing the dishes that came back, and putting everything away. While keeping strict Kosher (Jewish nursing home). \n\nThen ride my bike to high school for classes. \n\nI was kind of relieved. I was exhausted.",
   "created_utc": 1692570045,
   "score": 73,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1t445",
   "message": "I was the night manager at a hotel at the beginning of covid. Our hotel shut down, but they needed to have at least one person on for every shift because of some tax or zoning law. They fired me, then kept the breakfast cook and moved her to overnights because she made $2 an hour less than me. \n\n3 weeks later they asked me to come back because she couldn't take it lol",
   "created_utc": 1692566976,
   "score": 71,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1u81r",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1wsz6",
   "message": "Company I worked for put on a big concert with a famous country singer.  I got REAALY HIGH with the #1 sales guy in the parking lot before the show.  I thought I would be cool to go on stage during the show.  I was absolutely tackled by security and kicked out and then fired.  Bad day, bad choices.",
   "created_utc": 1692568504,
   "score": 51,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1y4d4",
   "message": "Going to see my family after my grandmother died. I found out on a smoke break via phone call. I went inside and brought the mail to my supervisor choking back tears and she urged me to go. I didn't want to leave work, but she said it would be okay. I got fired a week later for leaving in the middle of my shift with no notice, and using my phone during business hours, according to the owner of the business. \n\nIf you ever want to know where NOT to buy Harley-Davidson motorcycles and apparel in SC, I'm your girl.",
   "created_utc": 1692569012,
   "score": 151,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1t350",
   "message": "Because my daughter became severely ill.",
   "created_utc": 1692566965,
   "score": 19,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1qyvv",
   "message": "I gave away to many free drinks at Starbucks loll I had the whole town coming through",
   "created_utc": 1692566098,
   "score": 48,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1fr2k",
   "message": "I was working at a printing shop in Oxford Street, back when I was a teen I was really accident prone. One day my job was to print and collate a film script and the guy came to pick it up, so when I was coming up the stairs and tripped and both the script and the copy went flying out of my hands my boss wasn't too pleased. I was about 18.",
   "created_utc": 1692561675,
   "score": 26,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1ww8q",
   "message": "One of my first jobs I got fired because a co-worker was stealing and they thought I was helping her.   \n\n\nIt was cashier at a fast food place. We had a safe under the counter to get change from. The safe was directly below my register (owner always put girls at register closest to door, guys under the one with a safe).   \n\n\nWell the girl that usually worked opposite me would go to get quarters and pocket the $10 instead of putting it in the safe. Owner decided I had to be helping her since it was happening right in front of me.   \n\n\nTruth is I had no idea she was doing it. She was cute, I was a horny 16 year old, I wasn't watching what she was doing with her hands...",
   "created_utc": 1692568543,
   "score": 16,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx2hz6s",
   "message": "Complaining about the sociopath who kept trying to trap employees into making mistakes by lying to them, two summers in a row. I didn’t understand this asshole was my client, not my boss, because he was in charge of delegating work to me. I was a tech and too young to understand how the power dynamics between consultants and clients worked. First time I stood up for myself (second summer) I got fired. \n\nHowever, a week before I left for school (first summer), I wiped my sweaty balls all over his office phone, which he regularly pressed against his face",
   "created_utc": 1692577789,
   "score": 36,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx2kxge",
   "message": "I was a manager at a big retailer and there was an employee that disliked me. He lied and said I call him the n word, and the company made me write a statement in which I said “I didn’t say that, and never would.” And they fired me. No interview. No investigation. Nothing. $60k salary with benefits gone in seconds because someone lied and got their way.",
   "created_utc": 1692579123,
   "score": 38,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx1zu0e",
   "message": "I trusted the wrong people at work. One girl became went to my supervisor for 4 months straight to complain about me all while she was texting me how she was thankful for my friendship. She was repeatedly telling my supervisor how stupid I was at my job and how she had to keep helping me (that never happened) and I was fired for being “incompetent.” My supervisor never even told me there was an issue.",
   "created_utc": 1692569755,
   "score": 23,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx4660a",
   "message": "Was 22M in my first job out of college, working for a tyrannical CEO at his software startup where his underlings knew no better as no one had worked anywhere else. Workplace relationships VERY frowned upon, unless you get married to someone there, in which case you’ll stay forever.\n\nStarted crushing on the 22F in the cube next to me and one Sunday we went to brunch, but there was a wait, and no chairs to sit on while waiting. So I sit on the curb and she sits on my knees for 5 min. During that time, the 25F right-hand bitch of the CEO sees us, gasps audibly, and then walks off.\n\nNext day at work, tons of closed-door meetings, everyone looking at me weird. Shocker, I was fired at the end of the day, where I was told, “It’s just not working out…” I guess they decided my crush was the better worker, so I would be sacrificed for her to be more focused…\n\nShe quit the next day, we were both unemployed for 4 months, but found great, healthy jobs to really kickstart our careers, started dating, and have been happily married for 10 years. The company asked each of us to come back multiple times.",
   "created_utc": 1692615330,
   "score": 22,
   "submission_id": "15wjxe2"
  },
  {
   "comment_id": "jx3bhsi",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15wjxe2"
  }
 ]
}