{
 "submission_id": "15wkibu",
 "title": "What industry attracts the wrong people and actually aren't qualified? (Serious)",
 "selftext": "",
 "created_utc": 1692559832,
 "permalink": "/r/AskReddit/comments/15wkibu/what_industry_attracts_the_wrong_people_and/",
 "score": 169,
 "url": "https://www.reddit.com/r/AskReddit/comments/15wkibu/what_industry_attracts_the_wrong_people_and/",
 "comments": [
  {
   "comment_id": "jx1b3ii",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1692559832,
   "score": 1,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1bf91",
   "message": "Politics",
   "created_utc": 1692559961,
   "score": 60,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1d31j",
   "message": "Hospital Administration\n\nThey are often business oriented people with little to no experience in the health field. So they have no idea what those on the front line actually do. For them it's all about profitability.",
   "created_utc": 1692560614,
   "score": 71,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2ca98",
   "message": "Not exactly a job, but any board of education.\n\nNo idea what goes on in the classroom, let alone the offices of a whole district of schools, but they literally make every decision.",
   "created_utc": 1692575254,
   "score": 136,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1gas1",
   "message": "Elder care :(",
   "created_utc": 1692561890,
   "score": 86,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1b9m0",
   "message": "Stockbrokers. I have some friends who are stockbrokers. I love them, but man, they are some bullshit artists. And not like, \"Oh, they're a good salesman, and could sell you anything,\" No, it's like they make shit up as they go along and try to sound confident in what they say.",
   "created_utc": 1692559899,
   "score": 75,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1ezb2",
   "message": "Tech work.  People go into it for the high salaries and hate the work (and therefore aren’t very good at it).",
   "created_utc": 1692561366,
   "score": 202,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1lmap",
   "message": "Law Enforcement.\n\nIt attracts bullies who claim to want to help people but most of them don't care and, worse, they don't have the right mentality.  Of course, the job doesn't help.  But the ones who end up hired are the ones who love using force on people are have a sadistic nature.  They love causing problems for people.  \n\nThis is one of the things that has generated so much hatred for the police.  They need better training and the correct attitude.",
   "created_utc": 1692563985,
   "score": 234,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1cocv",
   "message": "Honestly a lot of the time nurses. I've met so many nurses that are just unnecessarily mean and grumpy and can't do their job properly",
   "created_utc": 1692560452,
   "score": 235,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1da0x",
   "message": "Based on my current job, Mental Health work.\n\nInstead of attracting people who are actually healthy and would give good advice, it seems to **overwhelmingly** attract workers who are themselves deeply traumatised, and have HUGE rescuer/saviour complexes, which usually just winds up deeply traumatising their clients even more.",
   "created_utc": 1692560691,
   "score": 80,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1tro3",
   "message": "Acting. Just like anything else, acting is a craft and it takes training, practice, and experience to get good at it. But people think it's something you can just... do with no qualifications. The worst part is because of the weird way acting works, some of those people do end up getting work.\n\n\u0026amp;#x200B;\n\nPolitics is another one. It blows my mind when someone runs for office BECAUSE they have no political experience. Like why would I hire someone with NO experience to do any job? Why is running the government or making laws any different?",
   "created_utc": 1692567247,
   "score": 77,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1ic1i",
   "message": "Hotel Management....believe me I know 😏",
   "created_utc": 1692562699,
   "score": 28,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1vdtj",
   "message": "Veterinary medicine.\n\nMany people decide to go into vetmed because they 'love animals'. That's not enough. \n\nYou have to be able to deal with people, because you're going to be treating the pet AND educating the owner, you have to be able to multi-multi-multi-task, deal with gross/sad/terrifying/depressing/angry/stinky animals and people, all while holding your bladder for hours, starving, getting yelled at by clients, answering the phone, writing in charts and trying not to forget all the stuff that need to write down, order, put away, clean...\n\n It's not just \"playing with puppies and kittens all day\". Yes, I've been told that I was lucky to have that job, because that must be what I did.",
   "created_utc": 1692567916,
   "score": 111,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1qrf5",
   "message": "IT  - the demand for people and decent salaries, along with low barriers of entry, mean that all sorts of charlatans get into that industry.\n\nAnd don't get me started on the lies and qualification/CV fraud from a certain country",
   "created_utc": 1692566014,
   "score": 124,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1k1qk",
   "message": "Professional photography. No Susan, your Instagram photos of cats and sunsets do not qualify you to do professional studio work. It takes a hell of a lot of practice and learning to do that properly.",
   "created_utc": 1692563377,
   "score": 116,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx21wvx",
   "message": "Law enforcement.\n\nThere's a problem with staffing in a lot of places, and the means in which they entice people to apply draw in a lot of people who really shouldn't be in that position of power.\n\nThey wind up giving a gun to people who don't realize there are (most of the time) better ways to resolve a situation without ever drawing it.\n\nIn a job like that, corruption is also very dangerous to the public. And if the people they hire aren't honest and good people, they're more likely to become corrupt themselves.\n\nAnd it really shines a bad light on those in uniform that really do want to make their communities a safer place.  When so many are crooked or complacent, they run out the good people trying to make a difference, leaving the wrong people in their place.",
   "created_utc": 1692570673,
   "score": 23,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1dot7",
   "message": "Police and security.\n\nAlso hospice care. It seems like that industry is so rife with corruption and cruelty at every level, from the directors down to the aides.",
   "created_utc": 1692560854,
   "score": 107,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1udva",
   "message": "Disability support work",
   "created_utc": 1692567503,
   "score": 18,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1lic3",
   "message": "Handymen.   Usually it‘s people with zero actual training who think because they once built a deck with their friend that they are qualified to fix anything.",
   "created_utc": 1692563943,
   "score": 35,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1rjyv",
   "message": "Real Estate Agents",
   "created_utc": 1692566335,
   "score": 50,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1gcll",
   "message": "Community management and HR. How are people that don't give two asses about others think they're capable of managing others?",
   "created_utc": 1692561910,
   "score": 40,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1u47d",
   "message": "I've heard from more than one ex-military say that they should not be hired as police. \n\nHow they're trained to deal with situations and the skills they are trained in run counter to the skills of de-escalation of violence and preservation of human life. \n\nThis neither a criticism of the military or the police. Just addressing how we confuse their adjacency and training for violent scenarios as being trained to provide the same response.",
   "created_utc": 1692567392,
   "score": 54,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx22de7",
   "message": "Teaching right now is so hard up that it's pulling paras who have no idea what they're doing and people who think teaching might be a nice career change (though the latter has always been true). \n\nPeople are by and large unaware of how hard it is to teach, how much bullshit paperwork there is behind the scenes, and how much time you'll spend defending that you've done the job you've been hired to do. \n\nWhat I see in a lot of my coworkers is: people trying to either relive or rewrite their high school days. If they were cool then they will make sure they are the cool teacher and undermine others (oh you're cutting class. Cool I'll write you a pass). People who want to rewrite will take absolute blatant pleasure in bossing a kid around and will often take advantage of the fact that admin will usually take another adults word over that of a kid. \n\nI see lazy people abound. I have a coworker who will give kids a 2 question worksheet to complete in a 50 minute class. More often than not kids are watching movies in her class or she's walking them over to the gym, every day, for at least half the class. \n\nI knew a woman... get this... she won teacher of the year (something that teachers self nominate for) who didn't teach after lunch. The entire second half of the day she sent them to the gym, to specials, or let them be on computers.",
   "created_utc": 1692570879,
   "score": 28,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx24op0",
   "message": "Phlebotomy. Everyone thinks they can find a vein and put a needle in it, but in my experience after nearly 15 years you either have it or you don't. I've trained hundreds of people over the years and only a handful would I call good. Even fewer of them would I consider  the ones to call when someone comes in that says nobody can ever get their blood. I would say at least 3 times a day someone tells me they can't find a vein on someone and I put a tourniquet on their arm and feel something in less than 3 seconds.",
   "created_utc": 1692571892,
   "score": 20,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2cizo",
   "message": "Politicians, police force and school board representatives",
   "created_utc": 1692575363,
   "score": 9,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1stwb",
   "message": "police and federal agencies.",
   "created_utc": 1692566860,
   "score": 14,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx21gdg",
   "message": "Law enforcement",
   "created_utc": 1692570469,
   "score": 6,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1uuck",
   "message": "Law enforcement",
   "created_utc": 1692567693,
   "score": 6,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1uyn6",
   "message": "Politics.\n\nAnyone who wants to have power usually wants it for all the wrong reasons.",
   "created_utc": 1692567744,
   "score": 16,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1ml08",
   "message": "Corrections",
   "created_utc": 1692564363,
   "score": 11,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1fvye",
   "message": "Therapy.",
   "created_utc": 1692561728,
   "score": 23,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx218s4",
   "message": "The troubled teen industry",
   "created_utc": 1692570373,
   "score": 11,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2aj2j",
   "message": "law enforcement \n\nyou shouldn’t be able to kill me with impunity with your high school diploma filled with Ds",
   "created_utc": 1692574473,
   "score": 9,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2652t",
   "message": "Security. Got tired of working around “warm bodies.”",
   "created_utc": 1692572526,
   "score": 6,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx29139",
   "message": "Trucking",
   "created_utc": 1692573807,
   "score": 5,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2b9cp",
   "message": "Estheticians. Everyone thinks they know it all and are qualified individuals because they completed a 250 hour course.",
   "created_utc": 1692574795,
   "score": 6,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1fgyz",
   "message": "Politics",
   "created_utc": 1692561564,
   "score": 8,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx29tos",
   "message": "Government jobs.  People get hired based on anything but experience and we wonder why nothing can get done.",
   "created_utc": 1692574158,
   "score": 10,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2em0m",
   "message": "Teaching, specifically teaching in high need, high poverty areas. I came through a teaching program and you wouldn't believe how many of the people coming through these programs seem to think \"these kids just need the love they don't get at home!\" and that if they are kind they will be successful teachers. And yes, that idea is racist and a significant number of the people coming through these programs have never had a conversation with a person of color and don't understand that teaching children of color might be different from teaching white children. \n\nLong story short, the issues facing children in underserved communities can't be solved with hugs and love alone, and these teachers tend to flame out quickly.",
   "created_utc": 1692576294,
   "score": 12,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1q34j",
   "message": "Consulting. Holy cow. Consulting.",
   "created_utc": 1692565743,
   "score": 15,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1e8yb",
   "message": "The \"self-help\" or \"personal development\" industry often attracts people who lack appropriate qualifications but position themselves as experts in fields like psychology, coaching, or counseling. This often leads to misinformation and bad advice",
   "created_utc": 1692561077,
   "score": 4,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1xxrx",
   "message": "Policing agencies.",
   "created_utc": 1692568932,
   "score": 3,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2dkpj",
   "message": "Management.",
   "created_utc": 1692575830,
   "score": 5,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2ko50",
   "message": "IT attracts a lot of people who are stubborn, inflexible, egotistical and who have difficulty with other people.  There's this impression that it's a dream field for independent workers with no desire to interact with others.  It's not a realistic expectation in most cases, and especially not if you're not going into business for yourself.\n\nI know a ton of people who went into IT, and all of the ones who hated it and quit jobs constantly or changed their careers did so because they had difficulties with other people.  Bosses, customers, coworkers or a combination or all three.   \u0026gt;90% of their complaints about work involved people, and in a lot of the complaint anecdotes the people complaining came off as just as bad as the people they were complaining about.\n\nUnless you're some sort of irreplaceable genius who will be retained and well treated no matter what *or else,* you're going to need to be able to tolerate other people and to treat them with respect, to obey orders from higher-ups even if you disagree with them and to accept that, at the end of the day, your company doesn't value you as a person - only as a source of labour.",
   "created_utc": 1692579007,
   "score": 5,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2ks6u",
   "message": "The people who want to become cops usually aren’t the people we want becoming cops.",
   "created_utc": 1692579057,
   "score": 4,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2sq01",
   "message": "Law enforcement",
   "created_utc": 1692582738,
   "score": 4,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2tuac",
   "message": "Cops and stock traders",
   "created_utc": 1692583267,
   "score": 4,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx22wvb",
   "message": "The police force",
   "created_utc": 1692571114,
   "score": 5,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1mbbv",
   "message": "The priesthood, evidently.",
   "created_utc": 1692564258,
   "score": 15,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx276q4",
   "message": "Most school administrators (principals, vps) were originally teachers. But the skills needed to be a good administrator are often wayyy different than those needed to be a good teacher. Unfortunately, I think that’s why we have so many shitty admin.",
   "created_utc": 1692572986,
   "score": 3,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2p44a",
   "message": "Music",
   "created_utc": 1692581043,
   "score": 3,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2seck",
   "message": "Stock traders",
   "created_utc": 1692582587,
   "score": 3,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2thpd",
   "message": "Life coaches.  There is no licensing board for these, that I know of.",
   "created_utc": 1692583102,
   "score": 3,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1yvyl",
   "message": "Medical. I had to literally threaten to murder one of my mom's nurses about a year ago to get her the care she needed",
   "created_utc": 1692569344,
   "score": 6,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx23zis",
   "message": "Law.\n\n\"I want to become a lawyer.\"\n\n\"Oh, so you are interested in the field and want to know your rights and defend people?\"\n\n\"No, I have heard people that work there are smart and earn a lot of money.\"\n\nI swear to god, some people whose work is to know laws don't know shit. Thank god so many quit before they get to practice what they were supposed to have learned.\n\nFYI just because your parents want you to have a career and you were good in high school, does not mean you should work in a field that you have 0 interest in.",
   "created_utc": 1692571583,
   "score": 9,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1swx2",
   "message": "Police, pastor, prison guard.",
   "created_utc": 1692566893,
   "score": 5,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx26rj2",
   "message": "Policing.",
   "created_utc": 1692572801,
   "score": 4,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx27em6",
   "message": "Human Resources",
   "created_utc": 1692573084,
   "score": 4,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1cxwj",
   "message": "General contractors. Most of them are just good talkers who are too incompetent to do actual trade work.",
   "created_utc": 1692560558,
   "score": 5,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1f53c",
   "message": "Police in the US. Politicians everywhere. Healthcare. (might be a local thing, but in my country's healthcare workers are str8 assholes for no fucking reason)",
   "created_utc": 1692561431,
   "score": 5,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1wwip",
   "message": "Several:\n\nHollywood: acting. Half the people in Hollywood can’t act worth a damn. They’re either only hired for how they look OR nepotism. \n\nGovernment (DMV, Social Security type offices): takes forever to get through, half the time they don’t know what they’re doing and the other half they’re just rude af.\n\nSpecial Education Teachers Assistants/most people that work with the disabled (I am one): most are doing it only for money (not all just most) and are super not understanding, if not just abusive.",
   "created_utc": 1692568546,
   "score": 5,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1y4e8",
   "message": "Politics",
   "created_utc": 1692569013,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1ymsr",
   "message": "Management",
   "created_utc": 1692569234,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1ywar",
   "message": "Cop",
   "created_utc": 1692569348,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx1z0js",
   "message": "Solar sales.",
   "created_utc": 1692569399,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx211c5",
   "message": "Politicians",
   "created_utc": 1692570281,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx23s6v",
   "message": "Police",
   "created_utc": 1692571494,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx25cw8",
   "message": "Most positions of power in general to be honest like government officials, police officers, CEOs.",
   "created_utc": 1692572184,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx27ncd",
   "message": "Locally, it is the Taxi/Uber industry. People who barely know the area are driving around adding 10$ to ever trip because they can not or do not know the city streets, and to tell them, they barely understand you.  \nI understand, shitty job  and that people do not want them, and that the companies hire foreigners or new immigrants, but that way they can screw the drivers over and pay less.",
   "created_utc": 1692573192,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx28506",
   "message": "Politics",
   "created_utc": 1692573411,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx29acm",
   "message": "Police officers",
   "created_utc": 1692573921,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2a6im",
   "message": "Politicians. The sooner we realize they’re only in it for themselves and not the betterment of the public",
   "created_utc": 1692574317,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2arp8",
   "message": "Alternative medecine",
   "created_utc": 1692574578,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2ayr8",
   "message": "Politics and Police",
   "created_utc": 1692574662,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2b526",
   "message": "IT support for a product I just purchased. Especially when they outsource to another country and they only read from a script. Damnit. I need 3rd tier. I already did everything you are about to ask me. 3 hours wasted. Then I FINALY get handed over to someone (hopefully) that knows WTF they are talking about.\n\n\u0026amp;#x200B;\n\nTime and time again. These people they hire are a joke.",
   "created_utc": 1692574741,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2bpmx",
   "message": "The property managers where I live. Ex cons.",
   "created_utc": 1692574997,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2cuwz",
   "message": "How about anyone who uses opinion as fact. This is right across the board of people.",
   "created_utc": 1692575510,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2doxl",
   "message": "U.S. Congress.",
   "created_utc": 1692575883,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2eb4b",
   "message": "All the good answers are taken so I would like to nominate the following:\n\nThe \"tech industry\" when the company is really just a website, and then the employees act like they're on the cutting edge of something. \"I work in tech.\" said with some perceived air of superiority.\n\nYou're not working for NASA bro, calm the fuck down. Its a website or a mobile app.",
   "created_utc": 1692576160,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2fg8v",
   "message": "Acting",
   "created_utc": 1692576667,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2fp6q",
   "message": "Computer programming / coding / software engineering, including management.\n\nIt seems, from the holy triangle Cheap / Fast / Good, only the first two are available anymore.",
   "created_utc": 1692576776,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2god8",
   "message": "Police. Too many people seem to go into it for the power over others, rather than keeping society safe and functional.",
   "created_utc": 1692577208,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2hcjn",
   "message": "Equine industry is full of people who don't have a damn clue what they're doing. It puts your life at risk and the lives of other equine professionals.",
   "created_utc": 1692577506,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2hgqw",
   "message": "Police officers",
   "created_utc": 1692577559,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2hskp",
   "message": "A bit of a corollary to the \"tech\" answer...Engineering, specifically automotive engineering. Too many folks took the \"C's get degrees\" idea to heart, and it shows. A good engineer needs one thing above all else, curiosity.  And WAY TOO MANY just want to get settled and earn their 6 figure paycheck. The bigger OEMs are in a big transitional   period (we are starting to adopt more SW development processes as we become more SW centric) and the amount of, \" this is new and different and I don't want to learn it\" is simply astounding.",
   "created_utc": 1692577708,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2ijat",
   "message": "A good 60% of this thread is just \"why experts should run society instead of rich people\" and I'm here for it.",
   "created_utc": 1692578040,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2lzhc",
   "message": "Psychology.",
   "created_utc": 1692579602,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2n418",
   "message": "Reddit mods",
   "created_utc": 1692580115,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2rt6w",
   "message": "Cops",
   "created_utc": 1692582310,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2tj80",
   "message": "Honestly? Any industry that gives you power or control over vulnerable groups of people.",
   "created_utc": 1692583122,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2twb9",
   "message": "Audio engineering. Anyone with a laptop and a scarlett interface thinks theyre the next CLA or Bruce Swedien.",
   "created_utc": 1692583293,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2u4sh",
   "message": "The police.",
   "created_utc": 1692583404,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2w5uj",
   "message": "Cops\n\nFuck those pigs",
   "created_utc": 1692584365,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx2yz0p",
   "message": "Law enforcement/ corrections.",
   "created_utc": 1692585721,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx30m5m",
   "message": "Software development, maybe unpopular opinion BUT as the market is open and everywhere they need devs so people think that I'll just study it to get an easy job. Actually for being a dev you need some qualities and habilites to solve problems by applying programmers logic which is not for everyone",
   "created_utc": 1692586533,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx3292a",
   "message": "Cops",
   "created_utc": 1692587363,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx338vt",
   "message": "Lawyers. Many of them are technically qualified, but get into it for the money over anything else. My father is a lawyer, and he absolutely loathes talking to other lawyers at dinner parties.",
   "created_utc": 1692587889,
   "score": 2,
   "submission_id": "15wkibu"
  },
  {
   "comment_id": "jx23g7x",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15wkibu"
  }
 ]
}