{
 "submission_id": "15wxsdt",
 "title": "If you could send a message to your 10-year-old self that they would definitely believe, what would you say?",
 "selftext": "",
 "created_utc": 1692594217,
 "permalink": "/r/AskReddit/comments/15wxsdt/if_you_could_send_a_message_to_your_10yearold/",
 "score": 31,
 "url": "https://www.reddit.com/r/AskReddit/comments/15wxsdt/if_you_could_send_a_message_to_your_10yearold/",
 "comments": [
  {
   "comment_id": "jx3exzo",
   "message": "Sweetie, your mom is not smart. Don’t tell her your secrets and don’t believe her when it comes to god. She’s just making stuff up as she goes.",
   "created_utc": 1692594771,
   "score": 10,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3huik",
   "message": "Take care of your teeth.",
   "created_utc": 1692596736,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3fumt",
   "message": "Wear sunscreen. Don't put baby oil on like your mom.",
   "created_utc": 1692595366,
   "score": 5,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3epgv",
   "message": "Life is about to change a lot, your mom is going to marry the guy she’s dating. It will be rough but you’ll get through it",
   "created_utc": 1692594614,
   "score": 3,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3hnce",
   "message": "I believed that the earth was flat, and if I kept running, someday I will fall off one of the edges. So I think I would believe anything that anyone told me when I was 10.",
   "created_utc": 1692596593,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3i3sf",
   "message": "Don't be afraid to question things. Have a voice.",
   "created_utc": 1692596921,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3i3ta",
   "message": "We made it, bud. It took some time, but we're finally there. Just keep it up.",
   "created_utc": 1692596921,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3id5l",
   "message": "Just stop going to your grandmas house. Stay home alone and just relax.",
   "created_utc": 1692597104,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3gnpi",
   "message": "build a business",
   "created_utc": 1692595910,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3gw0u",
   "message": "Bet on Tom Brady",
   "created_utc": 1692596071,
   "score": 2,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3hbna",
   "message": "DONT LET PRESIDENT LINCOLN GO TO THE FORDS THEATRE!!!!",
   "created_utc": 1692596363,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3jl87",
   "message": "Dear SN,\n\nI can feel your pain. I can understand your pain. I want to tell you something about future. I know you won't believe me but this the truth. Do not blame your father for his behavior towards you. Do not blame your siblings for their behavior towards you. Do not let their behavior make any difference towards your inner self. Look for what you love and focus on it. Your father was brought up in situations you cannot comprehend. He made sure that you and your siblings are living the life he couldn't, away for feudal lords in peace. You have a thinking pattern that no one, literally no one in family has. Stick to it. Nurture it. By the time you are my age, you will learn that anyone and everyone you look up to is an asshole. The people that you call your friends these days just so you are not alone, they are going to do anything and everything to hurt you in future because you are better than them. In future 3 assholes will enter your life. They will do everything to destroy your career. You will meet them in university. Do not react on anything they do to you in university and they will suffer the same pain in career path.\n\nMake sure not to hurt anyone innocent. Make sure that no one is allowed to bully you. If one does, break their nose then and there. You have more physical strength than you realize. Do not lie to yourself. Be true to yourself. Start a YouTube channel while in university. Do whatever you want but keep posting once a day everyday as soon as you enter the hostel. Start writing blogs posts on blogger. One post a week. Focus on learning. Do not go after girls because your friends are. Focus on work they will open their legs for you as soon as you complete university. Focus on consistently working your way up. And finally, read. Read so much that your home looks like a public library.\n\nYours truly\n\nYour Future Self",
   "created_utc": 1692597970,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3jovb",
   "message": "Go ahead and invest in the mutual growth fund but also invest in Amazon.",
   "created_utc": 1692598041,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3lisi",
   "message": "Don’t get in the car",
   "created_utc": 1692599402,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3feyy",
   "message": "One day, a girl will put your penis in her mouth.",
   "created_utc": 1692595082,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3hs09",
   "message": "Man I don't even remember that person anymore. Good luck, little girl lol.",
   "created_utc": 1692596686,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3huud",
   "message": "Everything I tell you is a lie. Every question I ask is a trick. You will find no truth in me. Though you believe nothing else, you may rest your faith on this.",
   "created_utc": 1692596742,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3kavd",
   "message": "Hey kid, listen up! Trust me, mom's got her own sitcom going on. But don't worry, she still loves you!",
   "created_utc": 1692598491,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3kra1",
   "message": "Get your anxiety sorted early. Everything sucks until it's fixed.",
   "created_utc": 1692598831,
   "score": 1,
   "submission_id": "15wxsdt"
  },
  {
   "comment_id": "jx3lvjy",
   "message": "You aren’t dumb, stupid or lazy, you just have undiagnosed ADHD.",
   "created_utc": 1692599672,
   "score": 1,
   "submission_id": "15wxsdt"
  }
 ]
}