{
 "submission_id": "15wxv38",
 "title": "What did you do when you were heartbroken?",
 "selftext": "",
 "created_utc": 1692594456,
 "permalink": "/r/AskReddit/comments/15wxv38/what_did_you_do_when_you_were_heartbroken/",
 "score": 170,
 "url": "https://www.reddit.com/r/AskReddit/comments/15wxv38/what_did_you_do_when_you_were_heartbroken/",
 "comments": [
  {
   "comment_id": "jx3ggz9",
   "message": "Let my emotions out for as long as it took and don’t try to get over it quickly. It can take time and you need time to heal. But eventually work towards moving on.",
   "created_utc": 1692595784,
   "score": 157,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3kwrv",
   "message": "I would have to take NyQuil to help me get sleep at night, I lost nearly 25 pounds in a month from not eating, while binging RedLetterMedia YouTube videos because for some reason they were the only things that could remotely make me laugh.  I wasn't okay for a solid three-four months following my worst breakup.  I worked myself to death, begging to go in whenever I could so I'd be around people and have something to keep my mind busy otherwise I would have gone mental.  At one point, I think I worked like 13 days in a row?  It took a very long time for me to move on.",
   "created_utc": 1692598943,
   "score": 63,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3s87i",
   "message": "I met my fiance in high school and dated throughout college.  She passed away 28 years ago.  I've never gotten over it.  Sometimes I look at keepsakes I have that I keep in a large chest and ruminate.   Sometimes she's in vivid dreams that I want to stay in.",
   "created_utc": 1692604644,
   "score": 56,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3h9iw",
   "message": "When I was heartbroken, I just kinda shut out the world and wallowed in my emotions. Spent a lot of time alone with my thoughts until eventually life felt normal again.",
   "created_utc": 1692596322,
   "score": 34,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3i0by",
   "message": "exercise",
   "created_utc": 1692596852,
   "score": 64,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3ejqq",
   "message": "When my relationship ended and just functioning was difficult",
   "created_utc": 1692594512,
   "score": 23,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3nxpu",
   "message": "Got angry. Worked out. Tried to do things to take my mind off of it. Hung out with friends but I was careful not to talk about heartbreak a lot. Friends could get frustrated hearing about it constantly.",
   "created_utc": 1692601253,
   "score": 14,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3fuo5",
   "message": "Set a deadline for “just make it to ____.” Then check in on that date and recognize how much easier it is already. Try one week, then one month, then six months. \nUnrequited love is a buckin bish hopefully you can narrow down what was good that you want again, and what was bad that you don’t want anymore. Maybe even make a list of who you want to be for your partner in the next one.",
   "created_utc": 1692595367,
   "score": 23,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3k3jc",
   "message": "Drink and cry for a while tbh. Then made a choice to respect myself enough to give myself a proper life even if they weren’t going to be in it. Most liberating feeling ever, although bittersweet. \n\n\nI was lucky though, I have them in my life again and we’re better than ever. But what helped me the most was setting myself free from the chains of attachment and obsession, it was so unhealthy.",
   "created_utc": 1692598341,
   "score": 12,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3ou7d",
   "message": "Took time off from work and cried myself into a migraine for a few nights. Now I honor my sweet best friend, Athena, by keeping her resting place cheerful and nice. She was my pal and confidant for 10 years and I had to let her go October 7, 2022. Some people saw a pit Bull, I saw my soulmate. Laugh all you want, that sweetheart dog knew me better than any human ever bothered to. \n\n7 years prior to losing Athena, my heartbreak sent me running to move back in with my parents. Athena and her adopted daughter, Pippa stuck by my side when my husband of 10 years sent me a text telling me he didn’t want to be married anymore. My dogs loved me more than the man I gave 10 years of my life to. My parents offered me the luxury of a full on breakdown at their home and waited patiently for me to get my shit back together.\n\nSo, the short answer is I let myself feel and grieve for as long as I needed to.",
   "created_utc": 1692601951,
   "score": 12,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3fsuw",
   "message": "I've been heartbroken more times then I could think. slowly do things you once loved. if you can't get out of bed then watch something you used to love then eventually when you can do more and more things go places you love, see people you love, slowly establish your life again without whoever broke your heart. \n\nI wish you the best and hope you get better.",
   "created_utc": 1692595334,
   "score": 10,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3f6d2",
   "message": "I still am going through a heartbreak it’s only been two months but what I find helps me the most is drawing. It’s a way to express how I feel without writing or speaking.",
   "created_utc": 1692594924,
   "score": 6,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3ehqv",
   "message": "Sleep",
   "created_utc": 1692594476,
   "score": 6,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3l91x",
   "message": "had a complete meltdown, locked myself in my basement for weeks with the lights off and numbed myself to anime (I had also lost my job so that was easy), took a long, long time to start living life again and it'll probably never feel totally normal but at this point I can live a day to day life and at least be numb to it if not fully recovered",
   "created_utc": 1692599198,
   "score": 6,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3mxhw",
   "message": "Got really drunk for many months while being depressed and suicidal. I don't recommend it.",
   "created_utc": 1692600476,
   "score": 5,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3n7lk",
   "message": "Cried a lot and drank a lot.",
   "created_utc": 1692600690,
   "score": 6,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3nzva",
   "message": "I sit here and suffer everyday. As time goes by the wound never closes but it gets slightly easier to talk about it.",
   "created_utc": 1692601298,
   "score": 7,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3m8b1",
   "message": "The best revenge is success. Sink yourself into any activity that not only takes your mind off of the person who broke your heart, but also proves to them that you are better off without them. Regardless of where they’re at, the fact that you’re killing it in life *without* them will be enough to wonder what if. I’d say that’s the best remedy for heartbreak.",
   "created_utc": 1692599937,
   "score": 12,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3obsq",
   "message": "Dropped out of grad school and moved out of state. Moved forward and didn't look back. Never thought about him. Got married, had a kid, was very happy. Almost ten years later, I saw on social media that he'd gotten married and I burst unexpectedly into heaving sobs. In retrospect, it might have been good to wallow a bit right after we broke up. Process some emotions or something, so they didn't all hit me all at once years later. I guess you gotta get through it one way or another. Anyway good luck kid, you'll be okay.",
   "created_utc": 1692601551,
   "score": 5,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3r181",
   "message": "My wife and I have struggled with sexual compatibility for most of our 22-year relationship, and at about year 15, she gave me a hall pass for casual sex, as long as I was safe, always came home, and she could never find out.\n\nI didn't race out or anything, but about a year later, I had an opportunity and went for it. Met a gorgeous recently-divorced mom who was also just looking for something casual. She was also very explicit that if any emotions came up, it was over.\n\nWell, long story short, we hung out a few times, got to know each other a bit, and had wild sex. I caught emotions very quickly, she sensed it, and cut it off. She did a really bad job though, and wasn't clear or direct about it at all - so I had to wallow in a gray area for weeks wondering what I'd done or said wrong, until I kind of snapped out of it and realized how attached I'd gotten.\n\nSo I let it be and cut it off, but for the next few weeks I was intensely heartbroken. I couldn't say a word about it to my wife or to anyone who might spill the beans to my wife some day. I just had to linger in it. I've never felt more alone. It felt like it couldn't possibly lift anytime soon. I considered talking to a therapist.\n\nFortunately(?), I've dealt with depression and recovered before, several times - and while this wasn't the same, since I was in pain rather than emotionally numb (as depression affects most people), I knew it would pass, as all things eventually do.\n\nI got back into my hobbies, worked on myself (exercise, healthy habits, meditation, gratitude), tried to use what I could from the experience to get closer to my wife (it did help), and just sweat it out while time passed. I don't remember how long that took, but I think after a couple of weeks, it started to fade a bit, and after a month or two, it was mostly gone. Sooner than I thought, honestly.\n\nI still think about it from time to time, but there's plenty of emotional distance now and it feels like just another chapter of my life - not something that still stings.",
   "created_utc": 1692603680,
   "score": 5,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3r2e6",
   "message": "exercised, dated lots of women with lots of horrifying baggage. got progressively pickier and healthier mentally and physically, found a great one, got fat again",
   "created_utc": 1692603706,
   "score": 5,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3grcd",
   "message": "hang out with friends",
   "created_utc": 1692595980,
   "score": 6,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3jmo2",
   "message": "I took a month long vacation. Went hiking and fishing every day.",
   "created_utc": 1692597999,
   "score": 5,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3mbx0",
   "message": "I rely on my hobbies, and spending time with family and friends! Look, we all go through heartbreak, and it's natural to feel down and out while we reflect and heal. But just remember, for that one thing that broke your heart, there are many more things that bring joy and happiness to your heart! So try getting back to them and stay positive!",
   "created_utc": 1692600013,
   "score": 4,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3nayq",
   "message": "I read *Heartbroken: Field Notes on a Constant Condition* by Laura Pratt. There's some interesting science behind heartbreak. Might as well learn about it.",
   "created_utc": 1692600761,
   "score": 5,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3p9yq",
   "message": "Cry, scream into a pillow. I felt all of my feelings. I let them out in a healthy manner, and I eventually got over it. Whatever you do, don’t get a rebound. Those will almost always make things worse. I was with a guy for 4 years of my life and then I got with someone immediately after and hated my life. Just feel, heal, and move on. \u0026lt;3",
   "created_utc": 1692602294,
   "score": 3,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3md8j",
   "message": "Sang out of tune and danced like I was in a Missy Elliot music video. So exercise, I guess.",
   "created_utc": 1692600042,
   "score": 3,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3nwjv",
   "message": "Listened to a lot of Nine Inch Nails and Alanis Morrissette. Burned through two sets of tires and a lot of gas.",
   "created_utc": 1692601227,
   "score": 3,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3oqms",
   "message": "I lost my job around the same time, so I spent about a month in bed curled up with my cats and crying. I lost like 25lbs because I couldn’t make myself eat. When I wasn’t crying or sleeping, I was journaling. \n\nWhen I finally did muster up enough energy to get out of the house, I landed another job and just threw myself completely into work so that I didn’t have to think about it. It took me over a year and a half (maybe more like 2 years) to really get over it.",
   "created_utc": 1692601871,
   "score": 3,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3s352",
   "message": "Listen to music, lots of music. It soothes the soul whilst healing.",
   "created_utc": 1692604528,
   "score": 3,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3tkk7",
   "message": "I'm going through one....just read this post and comments...called him...my heart is sunken right now , my beath feels heavy on me, even don't able to cry right now, just laying on bed all day all night..  I remember I haven't laughed fully to my stomach ache since my break up..he made me laugh,, each and every sec seems heavy on me.......he broke up with me on a very small thing,,I made him understand but ik he will not understand.....I guess our relationship is irreparable.......I wish kaash wo samjh pata",
   "created_utc": 1692605740,
   "score": 3,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3vqwi",
   "message": "1. Curled up and cried myself to sleep in the bathroom 😶\n2. Allowed myself to grieve on my own terms and as long as it took, reminding myself grief is like the ebbs and flows, like waves in the sea, it never truly leaves. I just need to learn to swim better to not drown, or call for assistance when the signs says that it will hit like a tidal wave again (assistance= talk about itbin therapy).\n\n3. Compartmentalize the emotional void and the physical need for food and water, and maybe meds. Once of my unhealthy coping mechanism of processing heartbreak is \"punishing myself\" by hurting myself in terms of not eating, or eating too much sweet stuff ti eallow in self pity. Thankfully due to my other coping mechanism of compartmentalization I recognize my inclination for unhealthy eating habit during the time, but I force myself to cook something nice for myself and make myself eat. I tell myself that this is how I am showing self love and kindness I deserve that love and kindness especially from myself since the idiot I loved clearly did not understand. \n\n4. Look cat photos and videos.",
   "created_utc": 1692607496,
   "score": 3,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3xif0",
   "message": "Workout, a lot",
   "created_utc": 1692608899,
   "score": 3,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx4dlji",
   "message": "Music is great both to distract and pour out your heart. Sometimes you just need a good cry. I have some song suggestions if you like.",
   "created_utc": 1692619724,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx4dq4j",
   "message": "I ran and exercised intensely",
   "created_utc": 1692619791,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3ie4p",
   "message": "Shaved my head.",
   "created_utc": 1692597123,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3m83d",
   "message": "I think listening to music helps me the most.",
   "created_utc": 1692599933,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3qynk",
   "message": "Drove around a lot",
   "created_utc": 1692603622,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3schx",
   "message": "I did a lot of pointless buzzword quizzes, worked overtime, and got myself a cat. I wasn't ok for a long time but those things helped me get through.",
   "created_utc": 1692604743,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3vlnz",
   "message": "My dog died a few weeks ago, so I had to distract myself while being heartbroken. My kind of distraction are my old motor cycles, either I ride one of them or I try to make the broken one to be able to ride again.\n\nSorry for my bad english, it's not my first language",
   "created_utc": 1692607380,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3xgjh",
   "message": "I tried to drink myself to death initially. When I realized it was going to take a miserably long time I moved across the country and started taking better care of myself. It won't be for a while yet, and none of this means anything when you're in the thick of it, but one day you will look up and the skies won't be as gray. Happiness will still be a long trek away at that point, but if you can get 1% better every day you'll find your way back. \n\nAlso don't drink during this time. It doesn't help at all. \n\nI wish you a speedy recovery on your path back to wholeness, friend.",
   "created_utc": 1692608858,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3ye1j",
   "message": "It's hard to say. It's one of those deeply personal things that's kind of different each time. One time had me on the floor crying. It was juvenile. \n\nAnother, I fell into a deep depression. Then I just became numb. I just didn't try anymore. I didn't care about anything or anyone. I didn't feel anything. \n\nEventually, I didn't get out of bed for 4 days. I was resigning to giving up. The kind you don't come back from.  You don't shower or eat. You barely exist. I spent those 4 days sleeping and playing animal crossing on a futon in my ex boyfriends spare bedroom in mid April of 2020. I only got up to use the bathroom or get a drink of water. But then I  felt gross... And I took a shower. \n\nI felt a little better. I began to put thought into my situation. I had no job, money, or car. I began job searching. I needed to move home. Slowly I dug myself out of that hole. I fought. I scraped, clawed, and willed myself out of it. That was three years ago.\n\nWhen I did move home, I sought help for my depression and started medication. I started to feel happy again. I cried because I couldn't regulate my emotions and it had been all I ever wanted. Slowly and surely I climbed the hill, and now I feel like life still gets better than this. I am in awe. \n\nToday, I have an awesome boyfriend. We're going on a camping trip tomorrow in the U.P. of Michigan. We're taking the dog. He's an amazing guy. He cares and loves me. I couldn't ask for a better guy to spend my life with. I am deeply grateful for all his kindness and support. I truly love him more each day 😊🥺😭❤️",
   "created_utc": 1692609604,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx44o25",
   "message": "Sat on the ground outside all night. The cold felt better than thinking.\n\nBut listen! It will get better. It won’t feel better knowing that but it’ll happen, bit by bit. Trust me when I say, one day you’ll be okay.",
   "created_utc": 1692614318,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx48hh7",
   "message": "Whenever I’ve felt really good, there’s a little voice inside my head reminding me that it’s temporary. I used to think the little voice was being a killjoy, but grief is normal. It means you loved someone and not everyone gets to have that and give that. Everything thing in life, good and bad, is temporary. Connecting with people is what makes it worthwhile. Don’t want to grieve? That’s easy. Don’t connect with anybody. \n\nIt’ll help you keep your head screwed on right, I think.",
   "created_utc": 1692616824,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx4b13j",
   "message": "sex with strangers",
   "created_utc": 1692618320,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3fqfa",
   "message": "not eat, sleep, cry , listen to sad song to make me cry harder. all that fun stuff",
   "created_utc": 1692595289,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3mcy7",
   "message": "A lot of things, but one was a random hookup. I'm not saying that's healthy for everyone, but for me, it did work, as one reason I was so attached to my ex was that they were my first everything. Sleeping with someone else helped me remove my ex from the \"first and only\" pedestal I'd put them on, and reminded me that I could have a life outside of that relationship. \n\nNot necessarily saying you should do the same, everyone has different personal values surrounding intimacy, but as long as casual sex isn't against your personal morals, and you are gonna be safe, and you are upfront with the casual partner, it's something to consider, especially if you don't have much experience outside of the person who broke your heart.",
   "created_utc": 1692600036,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3fg8p",
   "message": "Moved on with my life.  Found someone new.",
   "created_utc": 1692595106,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3pb9h",
   "message": "When I got rejected (for the first time and by someone that I had liked for 2 years) I spent a week emotionally wrecked by it. Not to mention I got rejected in front of like 10 people. I picked myself up - I then put myself on nofap and I embarked on a self improvement journey, I realised what I have to do to become better",
   "created_utc": 1692602323,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3xt7z",
   "message": "the best way to get over one, is to get under one.",
   "created_utc": 1692609142,
   "score": 2,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3g6tx",
   "message": "Watched swingers.  Cheered my right tf up",
   "created_utc": 1692595595,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3pu1j",
   "message": "A good amount of cocaine and crying.",
   "created_utc": 1692602729,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3im50",
   "message": "Went on tinder and had one night stands. Didn't say it was a healthy coping mechanism.",
   "created_utc": 1692597277,
   "score": 0,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3hk0o",
   "message": "[deleted]",
   "created_utc": 1692596528,
   "score": 0,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3enni",
   "message": "Cry",
   "created_utc": 1692594582,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3ezg9",
   "message": "My mind entered a dark place. It was filled with pain, sorrow, and regret.",
   "created_utc": 1692594797,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3i5az",
   "message": "Cry. Fill bathtubs just to lay in the water and scream. Drank too much wine and wrote in a journal. Eventually that stab wound in my heart healed over and scarred.",
   "created_utc": 1692596952,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3iuf7",
   "message": "Cried. A lot.",
   "created_utc": 1692597440,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3j3zn",
   "message": "Cry.",
   "created_utc": 1692597630,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3jpm3",
   "message": "Cry",
   "created_utc": 1692598055,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3ko3p",
   "message": "Working out to heartbreaking songs helped me a lot. Plus, finding time for friends.",
   "created_utc": 1692598765,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3l4q5",
   "message": "Find other things to be thankful and grateful in my life",
   "created_utc": 1692599109,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3l4sa",
   "message": "Blast Frank Sinatra's \"My Way\"",
   "created_utc": 1692599110,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3legh",
   "message": "played skyrim",
   "created_utc": 1692599311,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3lfqv",
   "message": "Get hair extensions",
   "created_utc": 1692599338,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3lm8p",
   "message": "Ice cream.",
   "created_utc": 1692599475,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3mc5y",
   "message": "watch comfort movies",
   "created_utc": 1692600019,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3mpjk",
   "message": "I shutdown and took a backseat on life for a while. I don't recommend doing that, life just kept getting worse the more I was like that.",
   "created_utc": 1692600306,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3nl3c",
   "message": "Let my emotions out and accepted a bit after.\nI basically cried and smiled on the same day.",
   "created_utc": 1692600982,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3nngv",
   "message": "Drank like a fish till I spent my days numb.",
   "created_utc": 1692601033,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3no8x",
   "message": "Shit, I'm heartbroken now...I drink a lot, go out a lot, had sex with an ex and am obsessing about somebody new.  \n\n\nIt's a good formula. Give it a month or two, and I will hardly remember my current pain.",
   "created_utc": 1692601049,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3oarx",
   "message": "What did I do? I was 21 when my first girlfriend/high school sweetheart moved out. I drank and ate myself to wildly excess in the span of about 4 months. I gained about 60lbs in that time. Wasn’t fun and was very immature.",
   "created_utc": 1692601529,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3ocqn",
   "message": "Just try not to die, getting through my studies and gain advice from people around me. My mom and bff were amazing.",
   "created_utc": 1692601571,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3oczg",
   "message": "Drink, unfortunately",
   "created_utc": 1692601576,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3pb1y",
   "message": "Currently I'm on reddit. I'm kind of stuck indoors because of wildfire smoke. Before that, I played board games with friends. The plan is to meditate and then hit the hay.",
   "created_utc": 1692602319,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3pcqc",
   "message": "Listened to our favorite song a bunch and then never listened to it again (this was a friend who shared feelings with me but neither of us would admit it) and we gave each other that look you do when \"you both know\" and then I never saw him again\"",
   "created_utc": 1692602356,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3pvmx",
   "message": "I was told best way to get over someone is to get under someone. Can’t say it works for everybody but it helped me. Distracted my mind and heart. Let me feel life wasn’t over.  Allowed me to view the situation differently.",
   "created_utc": 1692602764,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3pxso",
   "message": "My girlfriend broke up with me while I was in a sort of very secure and closed psychiatric ward. At least she told it to me in person. I had a psychosis and said a lot of crazy things. So it probably freaked her out and her mother was also very controlling so yea. \n\nI had been clean from watching Porn for 5 months by then. Eventually watched it again. Then I was perscribed Lorazepam (Ativan) a benzo. I eventually used other drugs once I went to another place on the same campus. They kept on forcing me to stay via a \"freedom judge\" who would asses me if I was still a danger to society or myself. I had pretty hard drug use. Even went to Rehab.\n\nSo yeah the break up really messed with my head. I'm clean now tho and In a much better place.",
   "created_utc": 1692602811,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3q4vj",
   "message": "Went to the gym.",
   "created_utc": 1692602963,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3q7g1",
   "message": "Cried. \n\nSlept.\n\nCried more.\n\nTime heals.",
   "created_utc": 1692603019,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3q8w6",
   "message": "My last one fucked me up. I stress ate, gained all the weight I had lost back, became spiritual, bought some sex toys. \n\nTry to take your mind off of it.",
   "created_utc": 1692603050,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3qbql",
   "message": "Take a nap",
   "created_utc": 1692603113,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3qn6n",
   "message": "I ran. \n\nI started walking and then running in the forest, because the endorphins take the edge off of feelings. It didn't make me numb but it helped. It didn't take long until I could run 10 km and meanwhile I was able to process my feelings with less sting.\n\nI also watched a shit ton of tv and visited all my friends in another cities I could afford to .",
   "created_utc": 1692603368,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3qtte",
   "message": "Bought bunch of romance novels.",
   "created_utc": 1692603515,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3qyrg",
   "message": "I'm going through it now. I don't hold back my pain and I feel and let it out. I also like to keep busy so there's less idle time to think (Reddit is helpful).  I try my best to be present and embrace the things that brings me joy. I used to go for walks... probably should start that up. In all I try to fall in love with things I enjoy all over if that makes sense.",
   "created_utc": 1692603625,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3r02x",
   "message": "Stopped drinking, started working out every day, and re-established connections with my close friends and family.",
   "created_utc": 1692603655,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3r4fs",
   "message": "Cry",
   "created_utc": 1692603752,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3r4qk",
   "message": "Watched sappy movies trying to make myself cry... it happened years ago, so the sapoy wasn't easy to find \u0026amp; the tears never really came. So I got inline \u0026amp; found someone to fuck \u0026amp; a couple guys later I moved on.",
   "created_utc": 1692603759,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3r7kt",
   "message": "I went in a negative direction and smoked a lot of weed for a year straight, and then when I got bored of that I drank for about 6 months every weekend I got spending all my money. Coincidentally I ended up finding someone who was just as broken as me and we spent a year being good friend until we started dating and bettered ourselves immediately after, dropped all negative things and got healthier and now it's been 4 years together. Life is still complicated but I'm glad I'm not the person I was while being heart broken, it was a lot of stupid decisions and wasted time that I won't get back.",
   "created_utc": 1692603823,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3rgoz",
   "message": "therapy, boxing, gym, and some fucking around.",
   "created_utc": 1692604028,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3rn0x",
   "message": "You have to fight it out so distracting our mind from such incidence will be temporary only. U hv to deal with it internally untill u figure it out it's in ur best interest to leave that incident and  move on .",
   "created_utc": 1692604169,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3rqhv",
   "message": "Drink and cry.\n\nThat did not work so I started exercising and shagging someone new, that kinda worked.",
   "created_utc": 1692604246,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3rwv4",
   "message": "Played Borderlands while listening to sad songs. It’s silly now that I’m typing it.",
   "created_utc": 1692604387,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3rwyq",
   "message": "I died.",
   "created_utc": 1692604390,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3sc08",
   "message": "Made a playlist and listened to it on repeat.",
   "created_utc": 1692604732,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3skeb",
   "message": "Eat any I want while listening to Air Supply",
   "created_utc": 1692604921,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3sklu",
   "message": "I tend to wobble between crying and feeling blank numbness. Sometimes a bout of anger as well, just to really round out the experience.",
   "created_utc": 1692604926,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3sknw",
   "message": "Alcohol 👍",
   "created_utc": 1692604928,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3sl7s",
   "message": "I went for a lot of late night drives and would just cruise around the city and highways listening to slow heavy bass music or just rain sounds and I would do alot of self reflecting mentally (meditation i guess you could call it) and would just go over everything that happened and just process it until i was ready to move on. Some advice if you feel like you’re gonna start crying or emotionally overwhelmed or distracted in a way PLEASE PULL OVER or go to your nearest late night gas station or something so you can let it out. If you cry or whatever while driving you’re at risk of crashing. Believe me ive had way too many close calls cause of it.",
   "created_utc": 1692604941,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3slnq",
   "message": "Picked up a new hobby and made time for my friends. Also keeping to routine really helps me so I didn't take any time off work, I would have felt way worse if I stayed home and got stuck in my own head.",
   "created_utc": 1692604950,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3slxc",
   "message": "I drank a lot. And listened to a lot of Mayday Parade. But mostly, I leaned on my friends. I wasn’t happy, but I was happier with them around.",
   "created_utc": 1692604957,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3soxh",
   "message": "I became best friends with a bottle of whisky.",
   "created_utc": 1692605025,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3sppm",
   "message": "I prayed to god if he could release me from the pain",
   "created_utc": 1692605043,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3srcg",
   "message": "Lift weights",
   "created_utc": 1692605078,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3surg",
   "message": "Hmmm I have a corner next to the heater where I look to curl up with a blanket and cry (if I need to lol)",
   "created_utc": 1692605153,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3sw1x",
   "message": "Let me feel all my emotions and if I was still heartbroken or thinking about the person too much then talking to my therapist helped me fix everything",
   "created_utc": 1692605182,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3swpt",
   "message": "I exercise makes me feel better",
   "created_utc": 1692605197,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3sxet",
   "message": "It was a long time ago for me. But after 43 years of marriage to the real deal all I can say is reflect for a while and accept that it was not meant to be. You are and will be better for it. It will make you a better catch for your real one when they come along.",
   "created_utc": 1692605212,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3t081",
   "message": "Prayed everyday to get healed. 3.5 months later, still hurts, not too much. Watch lumma azizs breakup video on youtube. It will get better, trust me.",
   "created_utc": 1692605274,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3td1h",
   "message": "Accepted that the relationship was over and went through the seven stages of grief.",
   "created_utc": 1692605571,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3tnxq",
   "message": "Drank.\n\n\nAlot.\n\n\n0/10 would not recommend.",
   "created_utc": 1692605818,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3tp1j",
   "message": "I pushed it down deep inside where it'll never ever be found and covered it with happiness.",
   "created_utc": 1692605843,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3tqcr",
   "message": "Cry, mostly. And then I started taking care of myself. 3 meals a day, exercise, reading books, creating healthy habits like sleep early. You see, most times we create a version of them in our heads that is not really true. Take it day by day and remember to respect yourself always",
   "created_utc": 1692605872,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3trgx",
   "message": "Listened to 60s songs",
   "created_utc": 1692605897,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3ubck",
   "message": "Got my shit together",
   "created_utc": 1692606338,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3ubp0",
   "message": "Always considered it an easy pre workout",
   "created_utc": 1692606346,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3ujal",
   "message": "Started smoking and driking heavily. Then I realised it was stupid and started to work on myself. I started to work out, changed my diet, quit smoking and reduced drinking. Feeling better than ever",
   "created_utc": 1692606521,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3ule9",
   "message": "Live with it and let time heal the wound. Depending on how badly your heart was broken, it may take a lot of time and in some cases it won’t ever heal.",
   "created_utc": 1692606572,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3uo2k",
   "message": "gym + work",
   "created_utc": 1692606631,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3v0l9",
   "message": "Workout. Quit smoking weed",
   "created_utc": 1692606913,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3v1y5",
   "message": "It gets better. Just better yourself while it's gettin'",
   "created_utc": 1692606943,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3v413",
   "message": "I listened to men relationship advice, laid in bed all day and cried and watched Pitch perfect on repeat. Looool, I don't even want to talk about how many days I didn't shower. BUT when I did get up and shower, I knew I was beginning to heal. Hahaha",
   "created_utc": 1692606989,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3vb6s",
   "message": "Wrote songs, Got drunk,  smoked a bunch of pot, fucked my buddies wife,  wished he would kill me, huffed acetone, cut my arm up, sat in the garage with my car running,  wrote more songs. \nThose were the days.",
   "created_utc": 1692607147,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3vnr1",
   "message": "Haven’t dealt with this yet and hopefully I’ll never have to. I live my life by two phrases tho. First one is “set your expectations as low as possible so nothing disappoints you” and the second is the quintessential “it is what it is.”",
   "created_utc": 1692607427,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3vodl",
   "message": "drank heavily and partied a lot.",
   "created_utc": 1692607440,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3vwvu",
   "message": "Just waited. \nAnd talked about it sometimes, it's really good to open up to the right people",
   "created_utc": 1692607627,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3vxug",
   "message": "Drugs",
   "created_utc": 1692607650,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3w008",
   "message": "Got blind drunk, made awful phone calls at 2am, self-harmed and then sought psychological help.",
   "created_utc": 1692607700,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3w08n",
   "message": "Amphetamines",
   "created_utc": 1692607705,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3w67u",
   "message": "Took time. Immediately went out and found friends, now we meet up every Monday!",
   "created_utc": 1692607837,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3w6dl",
   "message": "I cry so hard that I can't breathe, and I cry until I pass out",
   "created_utc": 1692607841,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3w8iq",
   "message": "Smoked a bunch of weed, didn’t leave bed, lost 30lbs, and failed a semester of college. Wouldn’t recommend.",
   "created_utc": 1692607887,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3w93p",
   "message": "Watch prime video",
   "created_utc": 1692607900,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3wa6x",
   "message": "Trying to realize what was bad between us and why it wouldn't work anyway.",
   "created_utc": 1692607923,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3wbns",
   "message": "Gym and meditation are my two methods of calming my heart and mind.",
   "created_utc": 1692607955,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3wjo0",
   "message": "Tried to kill myself and failed. So that's two things I failed at.",
   "created_utc": 1692608134,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3x88v",
   "message": "A lot of hiking and thinking. Just letting time do it's thing.",
   "created_utc": 1692608680,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3x9q3",
   "message": "Did a ton of drugs which just delayed the inevitable feelings of heartbreak, do not recommend. Exercise and hobbies are the way to go, also remember that healing isn’t linear, i still get random moments of missing that person as if it was fresh. You will get past it eventually and be able to function normally",
   "created_utc": 1692608712,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3x9ze",
   "message": "Isolate. Then reflect on how I wasted my time with someone who never deserved me or my energy in the first place.",
   "created_utc": 1692608717,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3xeh4",
   "message": "I’ll just cry and take care of myself. Talk with friends and really take time to feel everything even if it’s hard it’s not impossible",
   "created_utc": 1692608814,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3xjv6",
   "message": "Random casual sex with strangers",
   "created_utc": 1692608930,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3xln8",
   "message": "I rose the ante up to 11",
   "created_utc": 1692608969,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3xlvo",
   "message": "Cried in the shower lol",
   "created_utc": 1692608974,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3xx7u",
   "message": "bottle everything up and use it as forbidden preworkout",
   "created_utc": 1692609232,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3xz3k",
   "message": "Drink and fuck a lot. Defenitely would not recomend for anyone it's been 9 months and now getting my life back together.",
   "created_utc": 1692609273,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3y0r3",
   "message": "Locked myself in for six months straight just smoking weed and watching movies all day/night until I snapped out of it and started seeing friends again.",
   "created_utc": 1692609310,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3y2nr",
   "message": "I’ve learned you have to get the emotions out. Experience then and they will subside in time, hold it in or fight against the feelings and they never go away. \nMusic has always been able to make me emotional, so I use it as a tool for dragging the feelings out of me. I have a specific playlist for heartbreak so I lock myself in my room listen and cry. Once the emotions are no longer overwhelming I can think more clearly and get my head straight and eschew all that “why god WHY??” stuff and move on.\n\nETA: “So make the best of this test, and don't ask why\nIt's not a question, but a lesson learned in time”",
   "created_utc": 1692609352,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3y3u3",
   "message": "Wrote in a diary everyday.\nWrote dozens of songs and recorded most of them. I'm not a songwriter, just a very average guitar player but for some reason being heartbroken made me very prolific.\nIt was super cathartic.",
   "created_utc": 1692609379,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3yfpw",
   "message": "Played very depressing music, moped, i’ll never love aga…  hey Jenny’s kinda cute",
   "created_utc": 1692609639,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3yg27",
   "message": "I usually turned to weed and alcohol",
   "created_utc": 1692609647,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3yhua",
   "message": "Listen to very sad songs to make me feel even more heartbroken.",
   "created_utc": 1692609684,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3yko0",
   "message": "went to a chinese restaurant and ate some fried noodles and fried duck with peanut sauce. took good care of my heart.",
   "created_utc": 1692609745,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3yvfn",
   "message": "I listened to When Doves Cry for a month straight.",
   "created_utc": 1692609986,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3z132",
   "message": "Became utterly obsessed with work. Still heartbroken to this day, and still working obsessionally, sixteen years on.",
   "created_utc": 1692610110,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3ziie",
   "message": "Hmm so me, I let on the worst thoughts take over me. It was a constant rehearsal of \"I'm not worthy, I'm not good looking, I'm shit\" etc. I was 18, and it was my first love. I had some \"relationships\" before but this feeling towards this one was incredible, also it was my first intimate relationship. Anyways, I cried literally every night for atleast 2weeks, didn't eat and lost 15kg. These were the short term impacts but my negative thinking about myself lasted for about 5 years, I smoked weed everyday, now I control it a bit more.\n\nHowever, I am not the same person I used to prior. I was an outgoing, happy person. And a 4 month relationship made me destroy myself. Now, I'm 4 years in a relationship, but I'm not as \"lovely\" as I used to be. I'm cold, and kinda in the \"it is what it is\" mentality.\n\nThe one thing that this heart break taught me is that your mind is extremely powerful. That your thoughts become reality.",
   "created_utc": 1692610493,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3zjem",
   "message": "Cried everyday for like two months straight. The day I had no more tears left was the day I started to move on. It was glorious.",
   "created_utc": 1692610512,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3zl0o",
   "message": "Drowned myself in alcohol.  It didn't help and made things worse.  Much worse, in fact.",
   "created_utc": 1692610547,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3zuc2",
   "message": "Cry my eyes out and got depressed for about a month.",
   "created_utc": 1692610746,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3zx7v",
   "message": "Travel. Putting10000 miles between you and your sorrows help.",
   "created_utc": 1692610809,
   "score": 1,
   "submission_id": "15wxv38"
  },
  {
   "comment_id": "jx3zy7d",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15wxv38"
  }
 ]
}