{
 "submission_id": "15wy54r",
 "title": "What can you say to someone who’s just had a family member pass away?",
 "selftext": "",
 "created_utc": 1692595339,
 "permalink": "/r/AskReddit/comments/15wy54r/what_can_you_say_to_someone_whos_just_had_a/",
 "score": 155,
 "url": "https://www.reddit.com/r/AskReddit/comments/15wy54r/what_can_you_say_to_someone_whos_just_had_a/",
 "comments": [
  {
   "comment_id": "jx3r15g",
   "message": "For me it is more about what you do than what you say. \n\nSaying sorry for your loss is easy, but if you care about the person follow up a few days later. How are you doing now? Need something, a listening ear or ....? Often after a loss people are flooded with 'I will be there if you need me' and that is basic. But from experience after a week or so people have moved on and the one with grief is left standing. Those are the times that what you do/say are more important imo.",
   "created_utc": 1692603678,
   "score": 163,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3jenp",
   "message": "Listen\n\ndont talk",
   "created_utc": 1692597839,
   "score": 235,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3qdab",
   "message": "\"I'm making that casserole of mine that you like.  I'll be over with it tomorrow afternoon.\"\n\nGrief turns people's brains to mush.  Their normal planning and day-to-day life get scrambled.  Don't even ask if you can help, they won't be able to answer.  Make them food.",
   "created_utc": 1692603148,
   "score": 86,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3rmc8",
   "message": "The fake ones go and the real ones stay",
   "created_utc": 1692604154,
   "score": 37,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3tlij",
   "message": "My Dads advice that I've never forgotten: The people whose loved one has passed have so much going through their heads that they aren't going to remember anything you said.  That time is a blur.  They WILL remember that you were there.  So show up no matter what, but don't get caught up in thinking you have to say something profound or unique.  'I'm sorry for your loss' or if you knew them well - 'I'm so sorry, we're really going to miss them' is perfectly fine.",
   "created_utc": 1692605763,
   "score": 28,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3gf5k",
   "message": "The others are next.",
   "created_utc": 1692595749,
   "score": 73,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3p8r4",
   "message": "Missing Serious tag.\n\nI lost my father about 6 weeks ago.  There’s very little that can be said.  There’s even very little comparison beyond that.\n\nMinus the serious tag?\nCongrats!  What did you get?",
   "created_utc": 1692602268,
   "score": 12,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3g19x",
   "message": "Hailie, I know you miss your Mom, and I know you miss your Dad  \nWhen I'm gone, but I'm tryin' to give you the life that I never had  \nI can see you're sad, even when you smile, even when you laugh",
   "created_utc": 1692595490,
   "score": 53,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3r6xk",
   "message": "Just don't treat them like a leper like my generation did. Just be there for them regardless of words.",
   "created_utc": 1692603809,
   "score": 10,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3j3n8",
   "message": "*Just say I'm sorry for your loss and move on.*",
   "created_utc": 1692597623,
   "score": 57,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3konj",
   "message": "I hope, in time, that happy memories bring you comfort.\n\nActually, when my dad died, one friend sent me a card that said, \"This SUCKS!\"  and I found it very comforting. She really understood",
   "created_utc": 1692598776,
   "score": 10,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3g2ny",
   "message": "share a memory you have of them. if you don't know them make one up like how they served you as your loyal butler when you worked as a vigilante in gotham city",
   "created_utc": 1692595516,
   "score": 26,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3ifys",
   "message": "Try to be there without saying something like “I know how you’re feeling.”  There’s no comparison between grief you may have experienced and grief someone else may have experienced.  \n\nStart with telling them that you’re sorry for their loss and acknowledging that while you may not know exactly what they’ve been going through that you’ll do everything you can to be there for them.",
   "created_utc": 1692597158,
   "score": 3,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx44sot",
   "message": "Don't talk. Let them talk. Listen. And when they're done say \"check this out\" and then do the splits.",
   "created_utc": 1692614407,
   "score": 4,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3j0fk",
   "message": "As someone who recently lost a close family member - it's not as much what you say as when you say it. \n\nCheck in. Be present for them. Ask how they are doing and feeling. Listen if they want to talk. Don't disappear - continue to reach out and check in periodically",
   "created_utc": 1692597559,
   "score": 6,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3np6i",
   "message": "No intention on being rude with this. Sometimes not saying anything is best. As someone who lost a close friend a few days agom I don't want anyone saying anything to me about it just yet. But then knowing you're there makes a huge difference and they will remember that. Trust me",
   "created_utc": 1692601070,
   "score": 3,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3fvir",
   "message": "I'm sorry for your loss",
   "created_utc": 1692595383,
   "score": 5,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3m93y",
   "message": "Do not worry my friend they are in a better place now Satan will make arrangements",
   "created_utc": 1692599954,
   "score": 4,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3hbo7",
   "message": "How are you managing now?",
   "created_utc": 1692596363,
   "score": 2,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3jdww",
   "message": "Depends upon who passed away and how their equation was with that person whom I'd be meeting. If a close friend lost an immediate family member, I'd be hugging my friend and staying there for as long as they require me, and till they're able to cope with it.. even if we do not speak at all. If it is just an acquaintance, I'd say a formal \"I'm sorry for your loss\" which is expected at this time.",
   "created_utc": 1692597824,
   "score": 2,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3qeql",
   "message": "Give them a hug. Just sit there with them. Don’t say anything.",
   "created_utc": 1692603181,
   "score": 2,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3kaip",
   "message": "I'm sorry for your loss.\n\nAnyway.... so I hear (insert widow/er) is now single. Care to introduce me.",
   "created_utc": 1692598484,
   "score": 5,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3g1oh",
   "message": "“sorry broski 😓💔”",
   "created_utc": 1692595498,
   "score": 2,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3ghi7",
   "message": "Cherish all the good times you had and they'll always be with you.",
   "created_utc": 1692595794,
   "score": 5,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3i5st",
   "message": "Wanna talk about it?",
   "created_utc": 1692596962,
   "score": 2,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3lkju",
   "message": "Skill issue",
   "created_utc": 1692599438,
   "score": 3,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3ml7g",
   "message": "Got any money from deceased? Lets get hammered",
   "created_utc": 1692600214,
   "score": 2,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3nwbg",
   "message": "\"I ain't gonna read it all but I'm happy for you or sorry that happened.\"",
   "created_utc": 1692601223,
   "score": 2,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3oeux",
   "message": "Google 5 stages of grief cycle/chart find an image with some good verbiage you like the best and screenshot it and send it.  Helps make sense of emotions.",
   "created_utc": 1692601615,
   "score": 2,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3tvg1",
   "message": "There is plenty of fish in the sea.",
   "created_utc": 1692605984,
   "score": 2,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3fz7m",
   "message": "\"Remember the good times and smile because you made memories\"",
   "created_utc": 1692595451,
   "score": 255,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3i6w6",
   "message": "My condolences 💐",
   "created_utc": 1692596983,
   "score": 0,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3jmq3",
   "message": "I'm truly sorry for your loss. Losing a family member is never easy, and I can't imagine how you must be feeling. If you need someone to talk to or if there's anything I can do to help, please don't hesitate to let me know.",
   "created_utc": 1692598000,
   "score": 0,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx47ntq",
   "message": "So, how much will you get?",
   "created_utc": 1692616308,
   "score": 0,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx48axu",
   "message": "Double it and give it to the next person",
   "created_utc": 1692616713,
   "score": 0,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3glrf",
   "message": "why is this NSFW? feels like you left off, \"and also okay during sex\"  for it to be NSFW\n\n\u0026amp;#x200B;\n\nSorry for your loss....",
   "created_utc": 1692595874,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3gwnv",
   "message": "My condolences",
   "created_utc": 1692596083,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3ku6u",
   "message": "why is everything in this sub nsfw?",
   "created_utc": 1692598890,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3kx4y",
   "message": "Something like ‘I’m so sorry for your loss’ is fine, the most important part is that the sentiment is expressed with love and kindness.\n\nIf you genuinely want to offer help don’t just say ‘what can I do to help?’ … offer some specific ideas like cooking some meals, watching their kids, or someone to just sit with them for company. The period after you lose someone is the hardest: after the funeral and everything, most people go back to their own lives. Death is confronting, so it’s easy to whitewash it, and get on with things. So continue to check in with your grieving person in the weeks and months ahead. Anniversaries and holidays like Christmas are also difficult times.",
   "created_utc": 1692598950,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3mf9i",
   "message": "I’m sorry for your loss gets said so much that it becomes meaningless. Try saying something like, this must be a very difficult time. I am here for you.",
   "created_utc": 1692600085,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3mlp0",
   "message": "\"Peas and carrots.\"",
   "created_utc": 1692600225,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3mvxn",
   "message": "Nothing really. Just tell any stories you have about the person. Or let them tell you stories about them. My husband passed end of 2021 \u0026amp; I still get random people who reach out and tell me some funny story from when he was younger.",
   "created_utc": 1692600442,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3n0kg",
   "message": "\"How much inheritance are you getting?\" wouldn't be one of them.",
   "created_utc": 1692600542,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3o3ff",
   "message": "WHATS IN THE WILL",
   "created_utc": 1692601375,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3ogvh",
   "message": "Taco Bueno has half price tacos on Sunday and Thursday.",
   "created_utc": 1692601657,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3oyu4",
   "message": "There’s really nothing I can say or do to make this better.  I love you and am here if you need.",
   "created_utc": 1692602054,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3p84k",
   "message": "Treat them like you would normally. Try not to be awkward around them. If they initiate the subject, listen. Let them vent. \n\nThere’s nothing you can say to ease their pain. But you can let them know you care and you’ll be there when they are afraid to be alone yet don’t want to be around anyone. Parallel support is every bit as effective as doting, hovering support. Sometimes just ring in the same room without saying anything is plenty.",
   "created_utc": 1692602254,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3q3hg",
   "message": "I’m sorry for your loss.",
   "created_utc": 1692602933,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3qjlr",
   "message": "Talk about your own problems so they forget about their loss.",
   "created_utc": 1692603291,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3qqos",
   "message": "When you are finished listening, most people's reaction is to say \"please let me know if you need anything\" or something like that. \n\nBut people are inclined to never ask for anything, even under that kind of circumstance.\n\nSo you should ask closed questions with simple answers. \"Have you eaten today?\" Or \"is it ok if I bring you some snacks over?\" Or \"can I fill up your tank for you?\" Or \"i left your favourite cans of drink in the fridge with your favourite fruit, let me know if you would like more, or something different because I'm popping by the store, ok?\"\n\nHelp the person so they don't have to do any of the mental work. Even small little things can make a difference. And it could be really small. Especially if you don't know the person. Making them a coffee or a cup of tea so they don't have to do it themselves can make a huge difference. Especially with such a mental weight on their shoulders.",
   "created_utc": 1692603445,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3rg33",
   "message": "You can say anything or nothing at all. There are just consequences to different things said.",
   "created_utc": 1692604014,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3rmpx",
   "message": "It depends on whether they are way better off without them or not.",
   "created_utc": 1692604162,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3sjr2",
   "message": "I didn’t do it !",
   "created_utc": 1692604906,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3sp56",
   "message": "Are people truly sorry for other people's loss are they indifferent about it",
   "created_utc": 1692605029,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3ss0k",
   "message": "\"Meh, let's be honest. Nobody actually liked him/her anyways. Sooooo... anyone down for some tacos?\"",
   "created_utc": 1692605092,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3t6kj",
   "message": "Who kicked the bucket?",
   "created_utc": 1692605422,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3td6k",
   "message": "My bad",
   "created_utc": 1692605573,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3tedq",
   "message": "Just say: I am sorry for your loss, [and move on](https://youtu.be/TKOrr4XRbg8).",
   "created_utc": 1692605601,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3tqea",
   "message": "i wrote to my cousin, whos dad died last year that i do not believe in afterlife but on the other hand i like the idea that his dad and my dad now sit together in a park on a bank in the afternoonsun surrounded by all the doggos we once had, talking about their memories of their families.",
   "created_utc": 1692605873,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3u6g7",
   "message": "Avoid platitudes at all costs. Say things that are supportive but not condescending. Reassure them that they’re allowed to feel the way they feel and it isn’t disrupting you.",
   "created_utc": 1692606229,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3upuh",
   "message": "GG no re",
   "created_utc": 1692606671,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3uxi9",
   "message": "That even though grief is one of the most universal things that everyone goes through at some point, no one else experienced the relationship that they shared, so everyone/no one understands. Other than that it just fucking sucks",
   "created_utc": 1692606846,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3vbz3",
   "message": "Mega ooof. Big L.",
   "created_utc": 1692607163,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3vczr",
   "message": "Definitely DON'T say 'they're in a better place now' - the worst thing to hear when you're grieving somebody.",
   "created_utc": 1692607186,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3wlan",
   "message": "We will get through this!",
   "created_utc": 1692608171,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3wpsx",
   "message": "Who’s next?",
   "created_utc": 1692608274,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3wqum",
   "message": "Oof.",
   "created_utc": 1692608297,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3wwvu",
   "message": "I hate saying sorry, it feels so patronizing. So, unless there is a more polite way of putting it, I'm going with \"That sucks that you lost your family, and that you have to go through the grieving process.\". \n\n\nThen plop them down on a couch somewhere, let them be a lump or whatever they need, and then be busy for them. Like make them food, or get them gift card to restaurants around town so they don't have to think about food.",
   "created_utc": 1692608430,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3wy0i",
   "message": "If they want to talk, i tell them that i feel its ok to miss the person and let the emotions hit you early on. That just means they were loved and made a difference in your life. Also that it gets less intense with time usually.",
   "created_utc": 1692608455,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3x0hv",
   "message": "When my parents passed away, those that said things like \"Is there anything I can help with?\" Or \"do you want to talk? Or do you want to listen to nonsense?\" Were the people that meant the most to me. The \"I'm sorry for your loss\" people or the ones who didn't bother saying anything are the people who I don't really have any contact with anymore. \"I'm sorry for your loss\" feels quite insincere and becomes white noise after a bit.",
   "created_utc": 1692608508,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3x29w",
   "message": "1. Sorry for your loss\n2. A positive thing about the person if you knew them\n3. Listen",
   "created_utc": 1692608548,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3y71u",
   "message": "ask them to share memories of those that they lost. sometimes talking about it and reminiscing together can be good?",
   "created_utc": 1692609449,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3y8hn",
   "message": "Doesn’t matter what you say, just say it.  Unless it’s, “that sucks”.",
   "created_utc": 1692609483,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3ybdl",
   "message": "Dont need to talk, take some food around there and just listen",
   "created_utc": 1692609548,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3yl48",
   "message": "Nothing, just be there",
   "created_utc": 1692609755,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3ys2s",
   "message": "I’m sorry. What’s your favourite memory of them? (Followed by) I wish I had a chance to know them better.",
   "created_utc": 1692609911,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3yyrv",
   "message": "Wishing you strength and comfort as you navigate this tough journey.",
   "created_utc": 1692610058,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3zcc8",
   "message": "Honestly? When I lost my dad last year, I just wanted to be left alone. I just wanted to cry and mourn his loss. Nothing that anyone said, or could do, would help or change anything.\n\nAll one can really do is say a few positive words, pray for the departing soul, and just be lightly in touch with the person to keep tabs on if they need anything. Otherwise, just honestly leave them alone. It's hard to lose someone close to you, and everyone needs time and patience to recover.",
   "created_utc": 1692610354,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3zmq8",
   "message": "In Spain we say \"Te acompaño en el sentimiento\" especially to someone that don't really have that much of a close relationship with. I like it.",
   "created_utc": 1692610583,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3zmzh",
   "message": "People say a lot of things when they are grieving and angry. Everyone processes those emotions differently. It's important to not take things personally if they need to have a \"verbal punching bag.\" \n\nObviously there's a difference between that and someone being outright abusive, just wanted to note that grief can do very strange things to people, make us lose a part of ourselves.",
   "created_utc": 1692610589,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx3zpc7",
   "message": "i know this sucks. but it wont forever, unless it does. anyway, can i leave? i've got some things to take care of",
   "created_utc": 1692610639,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx403ec",
   "message": "I recently said \"I'm really sorry. All your feelings are valid and it's probably going to feel like shit for a while - but in time, each day will come to feel a bit less shit. Any time you need someone to listen, I'm here.\"",
   "created_utc": 1692610943,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx40ah6",
   "message": "https://youtu.be/TKOrr4XRbg8?si=_9ITIMIA65ANP7dl",
   "created_utc": 1692611100,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx40chb",
   "message": "I'm sorry",
   "created_utc": 1692611143,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx40nob",
   "message": "damn bro, that sucks. anyway, CSGO this evening?",
   "created_utc": 1692611384,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx40vkf",
   "message": "So...Mike's not gonna need that Playstation anymore huh....$50 ?",
   "created_utc": 1692611550,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx40vuv",
   "message": "Sux 2 b ded",
   "created_utc": 1692611557,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4113g",
   "message": "If you don't know what to say, tell them \"I don't know what to say\". Offer to listen, hugs, and run errands for them (groceries, kids to and from daycare/school)",
   "created_utc": 1692611670,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx412mf",
   "message": "\"knock knock\"\n\"Who's there?\"\n\"Not (insert dead person)\"",
   "created_utc": 1692611704,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx412xf",
   "message": "Who would I get the death certificate from?",
   "created_utc": 1692611710,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx416ko",
   "message": "So what did they leave for you in the will?",
   "created_utc": 1692611788,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx41af0",
   "message": "Some fantastic advice on here.",
   "created_utc": 1692611873,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx41arg",
   "message": "Skill issue",
   "created_utc": 1692611880,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx41fpy",
   "message": "I'm sorry is enough. \nDon't abandon them. We need people the most months later. This is when (at least for me) the shock begins to wear off and we are left utterly alone as the world moved on. The silence is deafening. And we won't say anything because we don't want to be a bother.",
   "created_utc": 1692611987,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx41kok",
   "message": "I'm sorry for your loss.",
   "created_utc": 1692612092,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx41r6u",
   "message": "\"I'm sorry for your loss. Move on.\"",
   "created_utc": 1692612226,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx421b7",
   "message": "A good friend of mine shouted to me across the room at the gathering straight after my father's funeral \"Hey Orphan Boy Orphan Boy!! Welcome to the club!!\" \n \nI just burst out laughing and giggle to myself every time I think about it. For context, I was about 40, my dad was 70-something and not the nicest guy and my friend's parents died quite young in tragic circumstances (suicide and alcoholism). I'm sure those who overheard it thought it was wildly inappropriate, I thought it was hilarious.",
   "created_utc": 1692612433,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx42bc6",
   "message": "Can say \"I cannot imagine how you must feel right now.\"",
   "created_utc": 1692612638,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx42cop",
   "message": "Dibs on the kidneys.",
   "created_utc": 1692612665,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx42mkz",
   "message": "Nothing  your gona hear alot  if there's any thing i can do lwt ms know. Well with this being  said. Take them up on the ofer  have fun with it tell them I don't want my mortgage to be paid off. I want a new boat and I'm gonna need $3000 a month. See how many people actually respond to it. My dad died two years ago. I had a blast with it I asked every single person that said that I said I need money to pay off the mortgage is paid off my boat. That's what I need. I didn't get a dime not from anybody, but I said why even ask what I will say then bring the fall through it. I would have fun with it. It sucks. I'm sorry for your loss.",
   "created_utc": 1692612868,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx42rtx",
   "message": "Rip bozo",
   "created_utc": 1692612974,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx43856",
   "message": "My sincere condolences probably. The obligatory \"time heals all wounds\"  On the other hand, you might just say nothing and be there for them. I found more comfort in people listening than in people talking",
   "created_utc": 1692613299,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx439ho",
   "message": "just gotta make them believe in afterlife and 24x7 surveillance",
   "created_utc": 1692613326,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx43fai",
   "message": "I lost my dad in 2020, so I will say this from personal experience:\n\n1. Do not give unsolicited advice to them\n2. Everybody grieves in their own way. Don’t judge them.\n3. If they are living in a toxic environment, try to temporarily move them away from it.\n4. Just be there. You don’t have to talk, or do anything. Just be present. It makes all the difference in the world. \n5. While you’re at point number 4, also remember to give them enough space so they don’t feel like they are suffocating.",
   "created_utc": 1692613441,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx43gmq",
   "message": "Just be there for them for more than only a few days, unless they want to be left alone.",
   "created_utc": 1692613468,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx43qre",
   "message": "Grief is such a complex journey and it's hard to second guess how someone is feeling or what they need, and it can change from one hour to the next sometimes. \n\nMy advice is to let them know that however they are feeling , whether they want to talk, or need a shoulder to cry on, or someone to take their mind off their grief and think about someone else, sometimes they may say it would help if you could just make them laugh, or they may need to let out their feelings (sometimes they may just want to yell!) or just someone to keep them company when they don't feel like talking or anything else: tell them you are unconditionally here. That they are not alone, you are there for them any time they need someone. \n\nNot just today but in the days and weeks, even months ahead. The hardest part having been in that awful place can be feeling like you don't want to burden people, or when people start assuming that because you are \"functioning\" normally you've moved on. I had a not very close friend ask, well-meaning but horribly clumsily, if I had got over it now? I just replied no, but I'm getting on with things and I'll be fine. (Then never shared with that person again!)\n\nWorth remembering too that when grieving a loss you can be fine for a while then another wave hits and you can feel completely thrown again. \nJust be there for them, check in regularly while respecting they might also just need some time on their own. \n\nI was so grateful for those that just were a quiet presence (not necessarily even physically, my best friends live back in my home country), sometimes just a phone call or a text makes a big difference. Also depending on your relationship, offer a hug!! That can do a lot of good! \n\nGood luck to you and anyone in this situation, even small efforts at such a difficult time in someone's life can make such a difference when they are hurting and vulnerable.",
   "created_utc": 1692613669,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx44116",
   "message": "That sucks, man.",
   "created_utc": 1692613875,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx448jl",
   "message": "I hope you and your family are hanging in there. It sucks and it’s hard and it’s not fair. We are here if you need us. \n\n\nI’m a cancer Dr- this seems to work.",
   "created_utc": 1692614024,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx44cas",
   "message": "Sorry mate. The bullet was meant for you.",
   "created_utc": 1692614096,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx44cea",
   "message": "“How can I support you?”",
   "created_utc": 1692614097,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx44fsw",
   "message": "So… did you do it?",
   "created_utc": 1692614162,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx44h72",
   "message": "There isn’t always something to say. If it’s someone you’re close to, just being present is often best. I would offer one thing to avoid: unless you are absolutely certain of the person’s beliefs about life, death and faith, don’t start telling them that it was “God’s will”, or that their loved one “is in a better place.” For many people those concepts can do more harm than good.",
   "created_utc": 1692614188,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx44i3v",
   "message": "My condolences",
   "created_utc": 1692614205,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx44n00",
   "message": "I'd love to hear about some of your favorite memories with this person if you're open to sharing so I can remember them with you. Also are there any ways I can support you at this time such as x,y,z (picking up a dinner or helping grab groceries,  knocking out some household chores)",
   "created_utc": 1692614297,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx44uex",
   "message": "Ask him if he really loved that peraon.\n\nOf they answer with Yes you than say..\n\nThan the best part or them will keep living in you.",
   "created_utc": 1692614440,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx45aap",
   "message": "did he drop any good loot?",
   "created_utc": 1692614743,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx45jxi",
   "message": "If I don't know them, I ask how they would want to be remembered. Then I remember them.",
   "created_utc": 1692614925,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx45k7o",
   "message": "i apologise",
   "created_utc": 1692614931,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx45lh4",
   "message": "God wanted him there  /s",
   "created_utc": 1692614955,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx45n2z",
   "message": "How can I help",
   "created_utc": 1692614984,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx45s1b",
   "message": "I'm sorry for your loss, move on.",
   "created_utc": 1692615074,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx45uk8",
   "message": "“I’m sorry for your loss.” There’s nothing to say.",
   "created_utc": 1692615119,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4612v",
   "message": "I’m here. And then just listen. Offer to do things grieving person isn’t thinking of.",
   "created_utc": 1692615239,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx463el",
   "message": "'May their memory be a blessing'",
   "created_utc": 1692615282,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx46690",
   "message": "At services for my parents, I loved hearing stories about them from friends, especially funny stories.",
   "created_utc": 1692615334,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx46eyz",
   "message": "\"sorry for your lost\"\n\nThat's all you need to say.\n\nDO NOT SAY ANYTHING ELSE",
   "created_utc": 1692615497,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx46k8n",
   "message": "Unlucky mate",
   "created_utc": 1692615595,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx472tu",
   "message": "oh shit that's crazy",
   "created_utc": 1692615935,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4733t",
   "message": "It’s all a pain in the arse, isn’t it? Have you got a battery for an Ericsson?",
   "created_utc": 1692615941,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4786c",
   "message": "My dad’s announcement for my grandma dying (not his mum)\n\n“Hands up who only has one grandma?”",
   "created_utc": 1692616032,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx479ld",
   "message": "That's rough, buddy.",
   "created_utc": 1692616058,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx47iwr",
   "message": "I should have asked this question before last Monday, when I had to face this irl.  I’m pretty sure I did it wrong.",
   "created_utc": 1692616222,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx47k7g",
   "message": "\"Sorry for your loss. Move on.\"",
   "created_utc": 1692616244,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx47qdi",
   "message": "Baseline, 'I am so sorry for your loss'\n\nespecially if you know this was a loved, cared for family member.\n\nIf its complicated, if you know this deceased person was, idk, their abuser, or there's some shit there, you're pretty safe on something like '...and how are you feeling?'\n\nand nothing else.\n\nLet them tell you if they're like 'I didn't expect to be so devastated' in which case, back to the top 'I am so sorry' and at best 'I know it's complicated for you, whatever you're feeling is valid'\n\nOr 'Honestly I'm weirdly relieved' in which case you can point blank say 'How can I support you right now?'\n\n\u0026amp;#x200B;\n\nAnd if thats the situation then just be present for them, be the person they can vent to. Funerals are sticky, if someone was a monster their victims sometimes have to sit through other family singing their praises, and thats just what it is. \n\nif you know thats hard for your friend, be the shoulder they can cry on about that specifically, so they dont have to wade through it with family who want to forget.",
   "created_utc": 1692616355,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx47y51",
   "message": "Having lost relatives in the last year's, I found that the best thing was friends asking me how I was feeling and listening me talk about the deceased and how I was feeling. There's not much you can say that will appease the pain. Imo talking about the deceased is a way to make sure they're not forgotten and brings some comfort.",
   "created_utc": 1692616492,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx488sd",
   "message": "\"I'm sorry, they were a good person. Are you ok, is there anything you need ?\"\n\nThen just be there for them and check in on them regularly.",
   "created_utc": 1692616677,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx48pyw",
   "message": "Oof",
   "created_utc": 1692616965,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx494g0",
   "message": "Lost my dad 2 weeks ago.. ):",
   "created_utc": 1692617206,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx496bg",
   "message": "Keep it simple and how sorry you are. Ask if they need anything. Likely the answer will be 'no' because you can't even think at that point. \n\nAfter that it really depends on how close you are to the person. I will say this from personal experience not just death but any trauma or medical. YOU need to follow up a day or couple of days (this really depends on the situation) when they can at least sort of think and say you want to do something to help and ask them for a specific thing you can do for them. If they can't come up with anything have something planned to say you will do. If you know a food they like say \"I'm going to bring you X on this day/time unless a different day/time works for you\".\n\nI cannot tell you the number of times I've been dealing with really tough stuff and people, when I can't even think, ask what they can do and then I never hear from the again because I can't think or even come up with what they can do and would never call them and be like \"do XYZ\". To be clear these people have no ill will, are good people, are friends and family to this day",
   "created_utc": 1692617239,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx49aty",
   "message": "Anything you want if your prepared for it.",
   "created_utc": 1692617317,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx49frx",
   "message": "A friend of mine's mother passed away, so I told him a quote I had once read. \"Energy can't be created or destroyed. Every time she waved, or laughed, or flicked her hair, her actions changed the particles around her. And thus, her energy will always be here.\"\n\n2 months later my father passed away, and my friend told me the exact same quote. It brought me so much comfort",
   "created_utc": 1692617400,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx49jc6",
   "message": "\"It could be worse. They could still be among the living.\"",
   "created_utc": 1692617458,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx49jk8",
   "message": "I lost my brother recently. \n\nI’ll tell you what didn’t help. Any questioning about what happened. Any anger or blaming of people. Constant questions. Sending photos in the first few days was too much to handle. \n\nThe things I appreciated most. People sending me messages, telling me they loved my brother. I appreciated people that told me they didn’t expect or require a response but just wanted to send some good wishes. A few friends sent food, and a few friends sent Uber eats vouchers. This was also appreciated. Had close friends arrange things I enjoyed doing, but put no pressure on me to attend.",
   "created_utc": 1692617462,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx49qat",
   "message": "\"Im sorry for your loss, move on.\"",
   "created_utc": 1692617573,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4a5wi",
   "message": "Don't say, just listen. Words are cheap and once you've heard the same few sentences it becomes meaningless. \nJust make sure they know that you are there for them during these tough times, even if it's just to vent.",
   "created_utc": 1692617825,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4acib",
   "message": "Sorry for you lose. Don’t offer to help with something just go ahead and do it. Bring food",
   "created_utc": 1692617930,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4afod",
   "message": "sKiLl IsSue LoL",
   "created_utc": 1692617982,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4aoh4",
   "message": "Sorry for your loss. Move on.",
   "created_utc": 1692618120,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4b1dd",
   "message": "Well if you’re the prime minister of Australia, “shit happens”.",
   "created_utc": 1692618325,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4b3tx",
   "message": "“The lord works in mysterious ways.”  Kidding of course.  It’s a terrible thing to say in any situation.  Lazy people say that when they don’t want invest any time or effort for heartfelt condolences or don’t want to know…anything really.  Someone said that to me after my uncle died last year and it took everything I had not to beat his ass.  Seriously.  Fuck off with that trite, lazy bullshit.",
   "created_utc": 1692618363,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4b74a",
   "message": "No matter where they go, they’ll always be surrounded by loved ones. In this life and to the next.",
   "created_utc": 1692618414,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4bd2j",
   "message": "Just say I’m sorry for your loss, and move on.",
   "created_utc": 1692618507,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4bnkh",
   "message": "Atleast it wasn’t you.",
   "created_utc": 1692618669,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4bskh",
   "message": "When I was in this situation words hurt so much for no apparent reason, however hugs just gave this feeling that I cannot describe. It may differ from a person to another but if it doesn't, hugs are the best way for support!",
   "created_utc": 1692618746,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4bywv",
   "message": "Everyone grieves differently so I tell them I hope they are surrounded by the people and things they love the most to help them get through this difficult time.",
   "created_utc": 1692618845,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4bzec",
   "message": "Give your condolences, offer to comfort, be emotional support, check in every now and then, maybe drop by once a week and bring some food/offer to play a board game. anything to try to somewhat keep their spirits up, while also not forcing them to have fun when they have dips.\n\nThe most important thing though, is to not be overly pushy. trying a bit to convince them if they decline an invite to do something is good, because theyre gonna shut themselves in, however do not overstep if they’re firm on wanting to keep to themself for the time being",
   "created_utc": 1692618853,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4cdab",
   "message": "Say: I’m sorry.\n\nDo: put a reminder on your calendar to contact them in 6 months, because as a widow of 8 months I can guaran-damn-tee that all the heartfelt promises to “be there for them” at the funeral won’t have amounted to shit.",
   "created_utc": 1692619063,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4cjhj",
   "message": "Say sorry for your loss then move on",
   "created_utc": 1692619157,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4cmjt",
   "message": "\"Sorry for your trouble, move on\" --moss.",
   "created_utc": 1692619204,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4coz2",
   "message": "F",
   "created_utc": 1692619240,
   "score": 1,
   "submission_id": "15wy54r"
  },
  {
   "comment_id": "jx4dadt",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15wy54r"
  }
 ]
}