{
 "submission_id": "15x301v",
 "title": "What's something you never realized about yourself until someone else told you?",
 "selftext": "",
 "created_utc": 1692611440,
 "permalink": "/r/AskReddit/comments/15x301v/whats_something_you_never_realized_about_yourself/",
 "score": 35,
 "url": "https://www.reddit.com/r/AskReddit/comments/15x301v/whats_something_you_never_realized_about_yourself/",
 "comments": [
  {
   "comment_id": "jx41rhg",
   "message": "That I’m opinionated.",
   "created_utc": 1692612233,
   "score": 23,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4eh9u",
   "message": "I made a statement to two friends who have known me since high school that I'm not very confrontational and they both laughed so hard they couldn't breathe. \n\nOne of them said that was part of what she liked most about me when we first met, that I wasn't shy about saying what's on my mind.",
   "created_utc": 1692620192,
   "score": 14,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx45fdg",
   "message": "Apparently im a pretty nice / good person. Ive been depressed for so long and I always thought i was kinda a shit person and wasnt good enough for relationships or deserving of love. I met a woman recently and she just cant get over what a good guy i am and tells me constantly. I dont see it but its nice to hear and i think she likes me.",
   "created_utc": 1692614840,
   "score": 43,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx42ygn",
   "message": "Whenever I walk around alone, even if I'm in a perfectly good mood, I look like I'm going to somewhere I know I am going to die. I apparently have a constant look of pure dread whenever I walk around alone.",
   "created_utc": 1692613108,
   "score": 23,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx43qoh",
   "message": "That I'm hot. I think I look like a potato with teeth.",
   "created_utc": 1692613668,
   "score": 16,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx44n47",
   "message": "That I let people step all over me",
   "created_utc": 1692614300,
   "score": 7,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx43twl",
   "message": "That I “always have to have the last word”",
   "created_utc": 1692613732,
   "score": 7,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx456w9",
   "message": "I have a lazy eye",
   "created_utc": 1692614680,
   "score": 6,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx411wj",
   "message": "That I am an asshole",
   "created_utc": 1692611688,
   "score": 10,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx423bz",
   "message": "That I'm incredibly pedantic.",
   "created_utc": 1692612475,
   "score": 5,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx47lf2",
   "message": "that I don’t seem to judge people no matter what they tell me about themselves. \n\nbeen told multiple times by different groups of friends. always catches me by surprise, but it’s nice, I guess, to be an adhoc therapist from time to time.",
   "created_utc": 1692616266,
   "score": 5,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4erdc",
   "message": "... that I like being angry and retalliating at others for wronging me. I was aware I'm a revenge type of person but I didn't realize I like being that way.\n\nI've started therapy and I'm hoping to become a more positive person.",
   "created_utc": 1692620340,
   "score": 4,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx43sqw",
   "message": "I gave a presentation at work and afterward a coworker told me, “Wow! You do everything *times ten!”*\n\nI was surprised when I realized that statement was 100% true. \n\n110% true.",
   "created_utc": 1692613709,
   "score": 8,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx434h2",
   "message": "That I'm a toxic Dota player.",
   "created_utc": 1692613227,
   "score": 3,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4br1c",
   "message": "I have OCD. A girl I dated told me I shared a lot of the same habits and mannerisms as her dad who had been diagnosed. I ended having it confirmed it myself, and also learned my brother has it too (and had been medicated for it for some time). \n\nA lot of things clicked after that lol.",
   "created_utc": 1692618723,
   "score": 4,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx413a6",
   "message": "I have a cute nose. Ex and current gf both commented on it.",
   "created_utc": 1692611718,
   "score": 6,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx418xv",
   "message": "You think you are better than everyone else.",
   "created_utc": 1692611840,
   "score": 3,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4941u",
   "message": "That I pout when I don’t get what I want. Really eye opening for me.",
   "created_utc": 1692617200,
   "score": 3,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4kuq6",
   "message": "That I'm arrogant, and I thought I was perfect :(",
   "created_utc": 1692623325,
   "score": 5,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4cvnr",
   "message": "That my voice was deep, I swear I thought I had a high pitched annoying voice",
   "created_utc": 1692619341,
   "score": 2,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4k6b8",
   "message": "That i have a large head for my body",
   "created_utc": 1692623007,
   "score": 2,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4y38o",
   "message": "Apparently i have a confident walk.  I walk with purpose.",
   "created_utc": 1692628892,
   "score": 2,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx40rvd",
   "message": "that I really am ugly as fuck",
   "created_utc": 1692611471,
   "score": 4,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx40v45",
   "message": "I said \"I'm not very competitive\" they said, \"Wtf are you talking about? You're incredibly competitive!\"",
   "created_utc": 1692611541,
   "score": 3,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4gmfu",
   "message": "That I'm beautiful... I was always crazy insecure after years of people leaving me for my friends or choosing them over me. Never having a long-term relationship despite everyone around me being in one. I've also had the same friend since elementary, everyone refers to her as the pretty one. Because of all that I thought I was ugly. One day, I was hanging out with a friend, and two separate people stopped me to tell that I was beautiful. I went home and cried. I looked at myself for so long, trying to see what those strangers saw in me.",
   "created_utc": 1692621292,
   "score": 4,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx418nx",
   "message": "That having a vestigial tail isn't normal",
   "created_utc": 1692611834,
   "score": 2,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx41j7c",
   "message": "I blink weird. And I totally do. I just never noticed",
   "created_utc": 1692612062,
   "score": 2,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4ty5g",
   "message": "I’m a little crazy, not like the joke around haha crazy, but the actual you need a therapist for life crazy.",
   "created_utc": 1692627261,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx47fpr",
   "message": "That I had a lot of symptoms of ADHD.\n\nGetting diagnosed with that and starting treatment really turned my life around.",
   "created_utc": 1692616165,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx47t79",
   "message": "I stand a certain way in photos. Never knew until an ex pointed it out when I was around 24 and looking back at old albums I saw that I pose the same since I was like 5.",
   "created_utc": 1692616406,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx46mzc",
   "message": "I have a big dick? I didn't know and was kind of self-conscious, but apparently, it's big... I still don't really believe it tbh",
   "created_utc": 1692615646,
   "score": 253,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx410b8",
   "message": "I've been told I'm incredibly attractive. And very smart  \nI never thought of myself that way",
   "created_utc": 1692611653,
   "score": 0,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx46ory",
   "message": "Whenever I walk around alone, even if I'm in a perfectly good mood, I look like I'm going to somewhere I know I am going to die. I apparently have a constant look of pure dread whenever I walk around alone.",
   "created_utc": 1692615680,
   "score": 255,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx49r4b",
   "message": "Being a horny ass dude.",
   "created_utc": 1692617586,
   "score": 0,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4dx4r",
   "message": "That I'm confident. \n\n\nWut? It's called projection, you guys. And having no clue when I'm being a bit loud.",
   "created_utc": 1692619897,
   "score": 0,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4jd1y",
   "message": "That i make ppl feel better (maybe sometimes)",
   "created_utc": 1692622621,
   "score": 0,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4jxgh",
   "message": "I’m fat? This is news to me…..",
   "created_utc": 1692622891,
   "score": 0,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4rhmj",
   "message": "I’m above average at virtually anything athletic that I put effort into. My dad and younger brother are just gifted, like 95+ percentile natural athletes (3 varsity sports types), so I always felt bad by comparison. I was young for my grade and small for my age growing up, with limited aerobic capacity due to asthma, so that didn’t help either. Wasn’t until junior high when I was routinely beating my friends at basketball, ping pong, pool, disc golf, etc that I realized I was actually pretty good at stuff. They were like, “kdawg, you’re good at everything” and my initial respons was to not believe them lol",
   "created_utc": 1692626245,
   "score": 0,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx45fiq",
   "message": "My eyes change colors based on my mood",
   "created_utc": 1692614843,
   "score": 253,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx47r8s",
   "message": "OCD",
   "created_utc": 1692616370,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx48eam",
   "message": "apparently I talk loudly",
   "created_utc": 1692616770,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx49u7i",
   "message": "I say hello before I even swipe to answer \nI've always wondered why people stayed silent on the phone for a while 🤣🤣",
   "created_utc": 1692617637,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4dxd2",
   "message": "I apperently have a weird/disdinct way of walking. To the point people can see me from even before I even know they are around.",
   "created_utc": 1692619900,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4f1q0",
   "message": "I interrupted people when they spoke",
   "created_utc": 1692620492,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4gj4g",
   "message": "That my jokes and extrovertness is my way of hiding from myself how depressed I actually am.",
   "created_utc": 1692621245,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4hj1o",
   "message": "My mom didn't tell me that I was possibly autistic until I was almost done with high school. Back in 2003, doctors weren't allowed to diagnose both ADHD and Autism at the same evaluation.\n\nShe has admitted that she regrets not following up on it when I was a kid.",
   "created_utc": 1692621744,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4hvig",
   "message": "That I’m a kind person, even if I come off as closed off/cold to most people (pretty introverted).",
   "created_utc": 1692621912,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4hzjl",
   "message": "Therapist told me I was angry when I thought I was sad. That took a while to land, but it was totally true. It was a bad coping mechanism. Changed my life.",
   "created_utc": 1692621968,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4jsum",
   "message": "I'm being told that I'm loud constantly... I never realize that.",
   "created_utc": 1692622831,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4lmew",
   "message": "At the age of 35 married with 2 kids i was told by my therapist that I was autistic. In fact she asked me why I never told her that. I was so confused I needed a second opinion. From then on I have been diagnosed with autism. And then it slowly all started becoming obvious. Remembering past social interactions. How I interact with the world. My lack of ability to read someone's facial expressions. My lack of emotional understanding. I have inappropriate responses to very serious situations. \n\nThis diagnosis has sent me into a mental downward spiral for the last few years. I'm finally starting to come back out of my shell and attempt life again. My wife has been super supportive and amazing to me about the whole thing. I can tell I frustrate her sometimes but we communicate fairly well considering I suck at communication like you wouldn't believe.",
   "created_utc": 1692623680,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4lufe",
   "message": "Back when me and my wife were dating she told me that I stand like a girl never thought about how I stood before, but after that I can totally see what she was talking about lol",
   "created_utc": 1692623780,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4m066",
   "message": "That I talk in my sleep often.",
   "created_utc": 1692623853,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4mo21",
   "message": "My PCP said I was highly intelligent, and another called me scholar.",
   "created_utc": 1692624152,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4n1bm",
   "message": "that i'm like a little bit autistic.\n\nthis never occurred to me, even though i'm in my 50s",
   "created_utc": 1692624314,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4nbnl",
   "message": "That I blink a lot.",
   "created_utc": 1692624442,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4ooqz",
   "message": "That I'm the most \"Canadian-like\" American they have ever met.",
   "created_utc": 1692625046,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4pslp",
   "message": "Turns out I am autistic.",
   "created_utc": 1692625526,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4qj5j",
   "message": "That I tend to cross my toes. Without realizing it, I will cross my \"pointer\" toe over the big toe.",
   "created_utc": 1692625843,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4spb1",
   "message": "THAT MY VOICE CAN BE HEARD FROM THE OTHER SIDE OF A CROWDED ROOM.",
   "created_utc": 1692626752,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4uvxv",
   "message": "That I might have some attention disorder. Also according to my husband, that I have a high tendency to escape reality because I don't always \"seem here\". That's when I discovered something called \"maladaptive daydreaming \" and could really explain a lot of things. But officially, I don't have any diagnosis for anything except anxiety.",
   "created_utc": 1692627636,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4v2s3",
   "message": "That I \"Don't need to act like I don't deserve nice things,\" by a coworker. Years later, just recently, in fact, I realized that acted like that because I classify myself, on an unconscious level, as a bad person (possibly due to my upbringing). So I have a lot to unlearn and relearn.\n\nLiterally gonna bring it up in therapy today.",
   "created_utc": 1692627712,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4vtvw",
   "message": "That I talk a lot. I've always seen myself as reserved and shy kinda guy who only talks when needs to. But few years ago a friend of mine asked me one day \"Do you realize how much you talk?\" I was almost offended and replied to him in disbelief how I don't talk much, what a bunch of nonesense, how dare he etc. He leaned on a wall and said \" You just talked 5min straight how you don't talk much\" haha I've embraced this gift ever since!",
   "created_utc": 1692628010,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4vyuv",
   "message": "I have a funny walk.  It's been described differently, but I just look funny when walking or running.",
   "created_utc": 1692628063,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx4z4pz",
   "message": "Once a Teacher in Middle School told me I was Cliché... I'm still asking myslef what she meant :\"/",
   "created_utc": 1692629294,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx527yn",
   "message": "That I come across as someone who's autistic. Got checked out and everything! Turns out I'm just weird.",
   "created_utc": 1692630470,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx5424r",
   "message": "I have a twitch/muscle pull of my left eyebrow that is triggered by flash photography, bright lights, etc\n\nSomeone first told me around 8 or 9 years ago for the first time and I forgot about it until another person mentioned it to me last month.",
   "created_utc": 1692631171,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx54ccj",
   "message": "That I’m a master manipulator 🫠",
   "created_utc": 1692631277,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx563c4",
   "message": "That I have a thick phat kitty 😺",
   "created_utc": 1692631932,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx567yk",
   "message": "A girl I was seeing in college told me I didn't have any tact.  I replied that I didn't even know what the fuck that meant.",
   "created_utc": 1692631980,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx569rp",
   "message": "That my smile lights up the world.\n\nThat's what he said anyway.\n\nAnd No - he'd already got lucky!",
   "created_utc": 1692631999,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx58q96",
   "message": "That I’m smart. Always thought I was dumb af, one day a classmate told me that I am smart I just pretend to be dumb. I never believe other people’s opinions but THIS ONE hit me like a truck",
   "created_utc": 1692632908,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx58rmn",
   "message": "A few people have told me I'm too nice. But nobody really elaborated. Recently an ex friend I reached out to said I'm too nice because she knows I never want to hurt anyone, but I ended up hurting her in the process. I try to stay neutral, I try not to pick sides so I stay on both of their 'good side', but in the end sometimes there really is a right or wrong. I hate confrontation. \n\nUsually when a friend circle fights, I'm usually the one in the middle... Both sides are wanting my opinion and I try so hard to not pick a side.  Unfortunately, this one time I got influenced to pick a side. I really didn't want to. But that's not an excuse, as I did in the end. Honestly I really hated how I got influenced and I regret it. Idk how but I got influenced into thinking I was also being attacked by her. I should've fought harder for everyone to just communicate properly. But it's too late now. Been over a year and we've kinda drifted apart as people. It was pretty awkward talking to her again recently, but we're just too different now I guess.\n\nI'm not going to avoid confrontation next time. I unfortunately lost a good friend out of it.",
   "created_utc": 1692632922,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx59h2o",
   "message": "That I am considerate about other people's opinions and try to make sure we meet at the middle ground....I always thought I was a selfish bitch (still do 😂)",
   "created_utc": 1692633180,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx5amst",
   "message": "I exaggerate a lot",
   "created_utc": 1692633607,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx5aq1r",
   "message": "I pronounce “both” like “bolth”",
   "created_utc": 1692633640,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx5bzub",
   "message": "I have a really nice ass. I never realized it until the girls in high school started telling me and patting my ass. I am 57 now and I have not had a job where women didn't pat/grab my ass.",
   "created_utc": 1692634110,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx5d8ar",
   "message": "Apparently I’m really, REALLY weird 🤷‍♀️",
   "created_utc": 1692634574,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx5dldy",
   "message": "I have a birthmark on the back of my neck. I had no idea until someone I worked with mentioned it when I was 24. Apparently it's shaped like South Carolina.",
   "created_utc": 1692634708,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx5e13w",
   "message": "I've been told by multiple people that my talking voice is very comforting / nice to listen to. Not gonna lie, I hate knowing this for some reason lol.",
   "created_utc": 1692634870,
   "score": 1,
   "submission_id": "15x301v"
  },
  {
   "comment_id": "jx5ek07",
   "message": "That I'm pretty and have patience. The latter always surprises me. Figure I'm more cautious at times. But, I for sure know how frustrated I can be about something at times too. I just don't fly off thr handle about that frustration, as much as most people do.",
   "created_utc": 1692635064,
   "score": 1,
   "submission_id": "15x301v"
  }
 ]
}