{
 "submission_id": "15x555p",
 "title": "What was a red flag that made you stop talking to a person immediately?",
 "selftext": "",
 "created_utc": 1692617904,
 "permalink": "/r/AskReddit/comments/15x555p/what_was_a_red_flag_that_made_you_stop_talking_to/",
 "score": 32,
 "url": "https://www.reddit.com/r/AskReddit/comments/15x555p/what_was_a_red_flag_that_made_you_stop_talking_to/",
 "comments": [
  {
   "comment_id": "jx4fpj5",
   "message": "First date and the person started telling me everything wrong with my body and making a gym plan for me. Never indicated I wanted or needed their assistance.",
   "created_utc": 1692620831,
   "score": 66,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4lajz",
   "message": "Within about 10 seconds of meeting me, this dude asked if I swallow. I asked if he'd ever been punched in the face.",
   "created_utc": 1692623528,
   "score": 42,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4d0iq",
   "message": "He mentioned his dating criteria which included my ethnicity and I just felt fetishised.\n\nI don’t mind someone being curious about my culture, but a criteria?! Nawww",
   "created_utc": 1692619412,
   "score": 67,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4i57f",
   "message": "A childhood friend decided to stop me from getting up from the couch one day. No reason, we weren't playing around, he just pinned me down using my wrists and shoulders. He wouldn't respond to my demands to be let up, he just smiled at me, I guess enjoying his little psycho power trip until I was about to cry from sheer panic. \n\nHe later apologized and said he just wanted to see what I'd do but I'll never forget that fucked up smile he had on his face. Ghosted him right after.",
   "created_utc": 1692622046,
   "score": 47,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4gpmh",
   "message": "He told me he was against gay marriage and I told him I wasn't because I was gay and he said, \"Oh I know what that's like, I raped someone once.\" and went on a big diatribe about it and then his dead mom etc. etc.",
   "created_utc": 1692621338,
   "score": 32,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4tww4",
   "message": "This one wasn't a dating/relationship one. It was a customer at the body shop I worked at. \n\nHe called up to the shop every day his car was in there and after the first few days I told him that we would call him and update him as things got completed so he didn't have to call every day and he said \"I just like to call to hear your voice\". I didn't really know what to say other than \"well we will call you when there are any updates on your car, have a good day\" and then I told the mechanic about it and how i wasnt going to talk to that guy anymore because it felt inappropriate and weird. So the next day the mechanic called the customer first thing in the morning to try and give him the update and he refused to talk to the mechanic. Said he only wanted to talk to me. The mechanic (sweet but tough older man who didn't take shit from anyone) told him to leave me alone and that he wouldn't be talking to me anymore and hung up on him. Then the dude came up to the shop to look for me. Luckily we saw him before he came inside the shop so the mechanic sent me out back and said I wasn't there. The guy called again later that day looking for me and showed up again the next day. Every day until his car was fixed he would either call or come to the shop. Luckily the mechanic made sure to get the guys car fixed and out of the shop as quick as he could. And the mechanic and painter walked me to my car every day for months just to make sure the guy didn't come back around. They were just as freaked out by him as I was. I don't know how to explain it but he felt dark and I felt so uneasy around the guy and the moment he said he just called to talk to me made me super uncomfortable.",
   "created_utc": 1692627246,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4bnnw",
   "message": "They said people with mental health issues need to get over it",
   "created_utc": 1692618671,
   "score": 30,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4f2oz",
   "message": "Had a date with a guy who told me a couple of stories about his life, and ended them saying \"Nah, I'm just kidding.\" At the end of the date, I felt like I knew less about her than I did going in. Made me feel really uncomfortable.",
   "created_utc": 1692620506,
   "score": 26,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4sgr7",
   "message": "They always talk about themselves.. And they are always the good guy in their stories.",
   "created_utc": 1692626655,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4fmfh",
   "message": "Have you found Jesus yet?",
   "created_utc": 1692620786,
   "score": 21,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4exd3",
   "message": "He said \"if women had to live like men, no compliments, always rejected, no sex, and men had ALL the power in dating, I am sure women would r*pe men. For now women don't have to because sex for them is sooo easy to get\".",
   "created_utc": 1692620428,
   "score": 30,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4p5vi",
   "message": "She started bragging about cheating..or she would talk about all of these other guys that wanted in her pants every time I mentioned the 1 guy I liked.",
   "created_utc": 1692625253,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4g0bj",
   "message": "He told me he saw love in my eyes after I asked for his number and talked to him for 10 MINUTES",
   "created_utc": 1692620982,
   "score": 15,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4r5ps",
   "message": "He has some narcissistic behaviours",
   "created_utc": 1692626107,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4tkjj",
   "message": "That they believed in Q-Anon",
   "created_utc": 1692627105,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4us8p",
   "message": "I met up with person and she wasn’t even looking at me. She didn’t even talk or have a conversation with me. Maybe just a few words. I asked her what’s on her mind and she says “I’m thinking about taking my own life”. I’m like uhhhhh okay. I told her we should just get going. She messages me later and says thank you for hanging out with me. I stopped talking to her immediately.",
   "created_utc": 1692627597,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4pyx8",
   "message": "When their facial expression is super animated but their eyes stay cold the whole time.",
   "created_utc": 1692625602,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4rm39",
   "message": "N word",
   "created_utc": 1692626297,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4t6oj",
   "message": "The constant neediness and the constant texting when I was busy and then he would get mad at me and I’d have to comfort him because I was too busy to pay attention to him 24/7",
   "created_utc": 1692626949,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4atip",
   "message": "They didn’t seem to care about all my own red flags",
   "created_utc": 1692618201,
   "score": 10,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4e6a3",
   "message": "Canceled 2 dates- i didn't respond to the last cancelation and never spoke to him again.",
   "created_utc": 1692620034,
   "score": 6,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4u00x",
   "message": "Told me he likes to watch porn of women fucking dogs. 🤮🤢 absolutely disgusting and someone clearly not mentally well.",
   "created_utc": 1692627282,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4u4ji",
   "message": "Racist or sexist comments.",
   "created_utc": 1692627333,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4neyu",
   "message": "If they are a police officer. If I'm talking to someone or in a group of people and one of them discloses they are a police officer, I will leave the conversation as quickly as possible and do everything in my power to not to talk to or around that person.",
   "created_utc": 1692624484,
   "score": 9,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4rv7j",
   "message": "They said they’re still considering whether to vote for trump again or not",
   "created_utc": 1692626403,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4mj1m",
   "message": "She said she had onlyfans",
   "created_utc": 1692624090,
   "score": 254,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4bbzc",
   "message": "She started coping evry feeling i share",
   "created_utc": 1692618490,
   "score": 0,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4pxsq",
   "message": "Thinking in stereotypes. Evaluating people by simple schema. Talking about \"red flags\".",
   "created_utc": 1692625588,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4czrj",
   "message": "Imagine having the confidence to just stop talking to a person because you don't like something about them.",
   "created_utc": 1692619401,
   "score": 245,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4smua",
   "message": "Literally anyone who asks anything about my extremely personal life",
   "created_utc": 1692626725,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4upuf",
   "message": "\"I'm still friends with my ex\" will get me outta there real quick.",
   "created_utc": 1692627570,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4wnva",
   "message": "a huge  trump flag sticking up in back of his truck",
   "created_utc": 1692628335,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4t2pa",
   "message": "\"Are you actually gonna eat the hunk of cow flesh?  Do you know what terrible things it will do to your body . . .\"",
   "created_utc": 1692626904,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4tf6d",
   "message": "They'd DM me their snap chat story just so I'd see it. I thought it was really odd",
   "created_utc": 1692627045,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4vgyb",
   "message": "Kept trying to apply preconceived notions and twisted every word I said basically. I troll these people now because it makes them squirm so hard it makes me happy haha",
   "created_utc": 1692627868,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4vobg",
   "message": "First date. He wanted me to try his video game, I said I don’t game and would be bad. He demanded I try it, then got annoyed at how bad I was.",
   "created_utc": 1692627948,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4wchw",
   "message": "She told me she had cheated on her ex husband with his best friend. I figured I didn’t want to get involved with someone who would behave that way.",
   "created_utc": 1692628211,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4wlkt",
   "message": "Met a friend of a friend for the first time. The first thing she asks is how long I’ve been with my boyfriend. 2 years. \n\nThe second thing she says is “Wow that’s a long time to just be dating. You know, if you get knocked up he’ll *have to* put a ring on it!” \n\nI just gave her a look and walked away. I never want kids regardless, but baby trapping is abhorrent.",
   "created_utc": 1692628310,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4wp6v",
   "message": "If anyone in my family was a strict Republican and refused to talk about anything else. \n\nOr my cousin that had parties every weekend during 2020, 2021, 2022. She'd invite 30 people to drink and drive. Some would stay on the couch, in their camper. But most drove home. \n\nHer father was killed in a drunk driving accident. So you'd think she wouldn't encourage it.",
   "created_utc": 1692628349,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4wqkj",
   "message": "Drove 45 minutes to her house to pick her up \n\nAs soon as I pulled into her drive way she texted me “you’re gonna hate me” fuck you Kelsey if you didn’t wanna do this then you should have told me before I made the fuckin drive \n\n\nBut I’m not bitter",
   "created_utc": 1692628364,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4wqrp",
   "message": "They bought a gun and were showing it to us, and then he aimed it directly at my one friend's heads.\n\nIt was jokingly sure, but still a loaded gun, safety on or not neither of us found that the slightest bit amusing.\n\nHis reaction afterword's was really what sold it though it was just completely dismissive of it all \"It's not a big deal\" \"Your just overacting\" \"Stop whining the safety was on\"\n\n  \nI literally had to rather rudely and vividly explain to him what could of and would've happened if that gun went off. and then he gave the most pathetic apology I have ever seen.",
   "created_utc": 1692628366,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4wtb5",
   "message": "She said \"I dont work, not because i cant i just cant be bothered\"",
   "created_utc": 1692628394,
   "score": 1,
   "submission_id": "15x555p"
  },
  {
   "comment_id": "jx4x0u9",
   "message": "Random guy on Reddit starts tagging me in comments and messaging me. Starts harmless but then mentions having a kink. I look at his profile, it’s only two weeks old and the only posts are of geese or sexual things/kinks/wanting his cock rated. The big kicker was I recognized my neighborhood in the pictures. Told him I didn’t want to talk anymore, he messaged a few times after but eventually stopped. Still freaked out by it.",
   "created_utc": 1692628478,
   "score": 1,
   "submission_id": "15x555p"
  }
 ]
}