{
 "submission_id": "15x5272",
 "title": "What was your \"Sir, this is a Wendy's\" moment?",
 "selftext": "",
 "created_utc": 1692617658,
 "permalink": "/r/AskReddit/comments/15x5272/what_was_your_sir_this_is_a_wendys_moment/",
 "score": 218,
 "url": "https://www.reddit.com/r/AskReddit/comments/15x5272/what_was_your_sir_this_is_a_wendys_moment/",
 "comments": [
  {
   "comment_id": "jx4lt2g",
   "message": "I worked at Walmart for a long time in the hardware dept.  Had a customer call asking if we sold toilets. I said, 'like, toilet seats?'   \n\nHe said, 'No, like actual toilets.'\n\nSo I said, \"Sorry, we just sell the seats and replacement parts., no porcelain.\"\n\nHe got all huffy and said, \"Jesus, what is this place? Walmart??\"\n\nI paused for a moment and said, \"Yes sir, it is.\"\n\nSilence for a long moment.  Then he said in a little voice, \"This isn't Home Depot?\"\n\n\"No sir, you called Walmart.\"\n\n\"Oh shit, I am so sorry!\"  And he hung up.  I laughed my ass off.",
   "created_utc": 1692623763,
   "score": 162,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4an2d",
   "message": "A man come into my tattoo shop once and asked for a massage with a happy ending. Was like “err this is a tattoo studio not a massage palour” and he just stood there like “yeah? I know” as if tattooists are synonymous with sexual masseuse.",
   "created_utc": 1692618098,
   "score": 230,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4a9xy",
   "message": "I love when customers traumadump on me. \n\n\"OK sir that will be $2.15\"\n\n\"Yeah my dog just died and my son was arrested. My mom's house burned down last week too\"  \n\n\"Oh.. would you like a straw?\"",
   "created_utc": 1692617889,
   "score": 240,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4c1ai",
   "message": "I drove into a McDonald's drive-thru and asked for a Whopper combo. \n\n(I was half-asleep.)",
   "created_utc": 1692618881,
   "score": 15,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4couh",
   "message": "I automate dumb buildings with temperature controls systems.  Something I get a lot is, all of this equipment was working before you touched it, now none of it works.  The best ones, and my favorite ones are when we get that call on a unit we haven't even touched. \"Unit 1? You're calling about unit 1?\" \"Yeah, it was working fine before your guys touched it and now it's not running.\" \"Okay, well we started working on the other side of the building first,and we haven't begun tying into the units yet, so that unit is all on you.\" \"Oh.\"",
   "created_utc": 1692619238,
   "score": 187,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4m9lu",
   "message": "I work as a facilities manager for a company with a few hundred locations around the country. Back at the end of 2020 I was having trouble getting in touch with a vendor we had a contract with to do some work around one of our offices. Nothing big. I figured he just ghosted us, so I began looking for another vendor who could take over the work.\n\nAfter 2 months of radio silence, vendor 1 calls me out of the blue and was clearly very drunk and crying at 1pm on a week day. Turns out he had gotten covid, was hospitalized, got blood clots in both legs, and had to have them both amputated.\n\nHe called me while I was at work and told me his whole life story. I ended up staying on the phone with him for about 30-45 minutes and I helped him track down a grief counselor. Hopefully he went. I still wonder how he's doing some times.",
   "created_utc": 1692623974,
   "score": 41,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4rgxt",
   "message": "Literally working at a Wendy's. Guy threatens to jump over the counter and strangle me because I accidentally entered an extra kids meal on his order. \n\nI made the mistake because while he was ordering, he was simultaneously talking on his phone *and* poorly wrangling like 4 or 5 small children, leading him to repeat himself several times. I didn't catch that one of them was a repeat.",
   "created_utc": 1692626237,
   "score": 21,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4i3ce",
   "message": "So my family own’s an old fashioned Chinese restaurant. One of those places that have like 100 menu items with massive portions because it was from way back when. \n\nSo I’m taking an order and this woman gets her kids together. The son whose a teenager I think asks “do you guys have Thai tea?” I said no. The little girl whispers something to her mom and mom asks “you have sticky rice?” No. Some girl whose younger than the teenager says “oh, I don’t see pho on here.”\n\nAt this point I’m screaming in the back of my head; “This restaurant has been open since before my uncle was born. At that time you Americans thought that fried rice was exotic. Nobody was worried about ox tail soup, chilled tea with cream, and rice steamed in a bamboo. If you would like, you can drive 5 minutes down the street to the Lao restaurant that serves that. I know the owner and will give him your order.” \n\nSo my aunt notices me from the register and in our language asks me what’s taking so long to get their order. I told her that they were asking for. She tells me “send them down the street where they serve that stuff we don’t do that here.”\n\nI got their order, and told me cousin about it. She says “well that’s technically Asian food. It’s not stupid to ask.” Don’t walk into a Chinese restaurant and ask for ‘Thai Tea’ or Vietnam’s most famous noodle soup dish.",
   "created_utc": 1692622020,
   "score": 236,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4bn3g",
   "message": "Not mine, but there was a thread on here where a Karen lost her shit at Chipotle because they wouldn't make her a fried chicken burrito.",
   "created_utc": 1692618662,
   "score": 113,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx49x0k",
   "message": "A man rapping his order",
   "created_utc": 1692617683,
   "score": 174,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4hlc5",
   "message": "Found the product I needed online. Drove to the store. Spent 20minutes failing to find said product on the *a*isle it was supposed to be on. Showed the picture to multiple staff, none of whom recognised it. Finally went to the customer services desk and after 10 minutes of waiting in line got told the website I was looking at was one of their competitors.\n\nedit: *a*isle, because it's  large store, but not a peninsula. Thanks  u/Klendy",
   "created_utc": 1692621775,
   "score": 38,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4t2dk",
   "message": "Delivered two large pizzas to a guy's apartment at 10 am on a Sunday. When I got there, he proceeded to say, \"My girlfriend just dumped me.\"  I slowly backed away and said I had more deliveries to do.",
   "created_utc": 1692626901,
   "score": 68,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4avd1",
   "message": "When a customer in line in front of me was refused service because she was wearing a T celebrating pride month. “That offends our religious beliefs,” said the manager. Yup, that’s Wendy’s.",
   "created_utc": 1692618230,
   "score": 129,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4q015",
   "message": "Customers at my retail job explaining that COVID passports are the mark of the beast and check-in QR codes are a means of tracking us all... while paying for the groceries electronically via their phone.\n\nAnd those eager to let me know that the mask I'm wearing traps bacteria and causes cancer... while in the process of purchasing cigarettes.",
   "created_utc": 1692625616,
   "score": 115,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4ndch",
   "message": "Someone wrote into my work to say that a neighbor of hers died (natural causes) and the police have no next of kin info to contact so we need to call them and give them any information we have on-file for her. Ummm that’s a hard no",
   "created_utc": 1692624463,
   "score": 95,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4nryf",
   "message": "Well, not me but my brother when they try to order a Big Mac or a Whopper from him.",
   "created_utc": 1692624644,
   "score": 2,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4r5gr",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4lwr3",
   "message": "I went to Wendy’s",
   "created_utc": 1692623809,
   "score": 3,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4d09v",
   "message": "Oh man, I had a classic \"Sir, this is a Wendy's\" moment when I walked into a clothing store and tried to order a cheeseburger. Talk about mixing up my cravings! The cashier gave me the most bewildered look before kindly reminding me of my location. Needless to say, I quickly retreated from the clothing section and made a beeline for the nearest fast food joint.",
   "created_utc": 1692619409,
   "score": 2,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4iryf",
   "message": "Worked a grocery store, went into a bathroom stall, no one was in the bathroom, come out there’s a homeless dude with his shirt off taking a bath in the sink🤷🏻‍♂️",
   "created_utc": 1692622347,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4r91q",
   "message": "I’m a high school teacher in Australia. I had a parent rail me out that I wasn’t teaching their daughter how to do her taxes. \n\nI’m a history teacher.",
   "created_utc": 1692626145,
   "score": 23,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4kttf",
   "message": "I was watching a guy trying to negotiate a cheaper price for a prostitute because honestly, she wasn't all that attractive and clearly past her prime age-wise.   Finally, I had to intervene, and say \"Sir, this is [Sister Wendy](https://en.wikipedia.org/wiki/Wendy_Beckett)\".",
   "created_utc": 1692623313,
   "score": 0,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4kig3",
   "message": "One time, I was at a Wendy’s drive-thru and I ordered a burger, fries, and a drink. The cashier asked me if I wanted any sauce with my fries. I said yes, and then proceeded to list all the sauces I wanted: ketchup, mustard, mayo, barbecue, honey mustard, ranch, sweet and sour, hot sauce, and salsa. The cashier looked at me incredulously and said “Sir, this is a Wendy’s. We don’t have all those sauces.” I was so embarrassed that I just drove away without paying or getting my food. 😅",
   "created_utc": 1692623167,
   "score": 255,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4mtzc",
   "message": "I ordered a Frosty and Baconator.",
   "created_utc": 1692624223,
   "score": 0,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4hgrd",
   "message": "Worked at a golf course. The guy came in and demanded a caddy for his round. We don’t have caddies but he insisted!",
   "created_utc": 1692621712,
   "score": 23,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4rmmb",
   "message": "Used to work for a Dominos that was located right next to a gas station, and by default our two businesses shared a street sign where the gas station would advertise their specials.\n\nSo one day they’re advertising tacos-in-a-bag and I have a guy walk in ordering one. Took me a minute to realize he was legit trying to order a taco-in-a-bag at a Dominos and I said sir, we don’t do that here.\n\nSo he points out at the sign and I say, “yeah, that’s for the gas station next door. Why would Dominos be selling tacos-in-a-bag?”",
   "created_utc": 1692626303,
   "score": 75,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4smfm",
   "message": "Recently completed a construction project with my neighbour. He was a complete idiot and dicked us around every step of the way until finally we just said “fuck it” and let him finish up the last little bit on his own. We went over to settle up the material costs, as we’d agreed upon from the start. He immediately starts ranting about how we owe him $2000 because we didn’t help finish the project, so we owe him for his labour. We pointed out that he took it upon himself to work on it while we were at work, or at 9pm, and refused any communication about actually PLANNING times to work on it. He would just go out there, start working, and expect us to join him. Yes, even if we weren’t home. He told us we should have been waiting around every day, just in case he decided it was a good time for him to work on it. He also didn’t keep any receipts from any of the materials he purchased, but “don’t worry bruh, I wrote down all the numbers, you can totally trust me, bruh!”\n\nObviously we told him that was just stupid and we wouldn’t be giving him shit but our share of the material costs, and then only when he could cough up some actual proof of what he spent. He got really frustrated and started screaming “I’m under pressure man! My boat broke, it needs a new motor!” And then he just kept screaming about his boat, and ran into his house. Hasn’t looked either of us in the face since.\n\nI guess I at least understand why he needed to try to swindle us for two grand lol",
   "created_utc": 1692626720,
   "score": 242,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4vw1v",
   "message": "I own a Drywall company and our shop is in a giant storage unit complex for big rvs (like $500k-$1m rvs) so the bays are gigantic, a lot of contractors have their shops there, the front building is shared between myself and a power washing company (we both have signage up clearly stating drywall business / power washing business) \nOne day my crew was at the shop loading up equipment and some older guy came up and wanted to rent a storage unit. My guys gave him the info for the owners (which is on a big sign by the road that says rv storage units with all the info)\nHe just ignored them, pulled out his check book and said” who do I make this check out to? I want to rent unit #12” again my guys pointed to our business sign clearly stating drywall business. He then got aggravated and asked when we were open so he could get a unit. Finally my crew leader told him the boss would be back in a couple hours so he would leave them alone. \nGuy never came back.",
   "created_utc": 1692628033,
   "score": 97,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4wlib",
   "message": "I worked in an ice cream truck, a tweaker came up to the back (the rear doors were open), and tried to buy weed from me while I was serving customers. I had to explain to him I was not selling weed. \n\nLater on he ambushed my truck when I was leaving the park, stood in front, hit the hood a couple times with a piece of metal, and then when I was driving off, threw said metal and shattered one of the side windows on the truck.",
   "created_utc": 1692628309,
   "score": 238,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4wqac",
   "message": "Closing shift at a Starbucks, was like 10pm at night and this couple come inside and walk up to me at the front counter saying, \"The deli across the street is racist towards white people.\"\n\nI really had no response besides just standing there for a few seconds before saying, \"...did you want to order something...?\"",
   "created_utc": 1692628361,
   "score": 160,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4yqb0",
   "message": "Went to drive-thru at a Wendy’s and the person taking the order said welcome to Walmart. I was really confused and I heard laughing and he said I’m so sorry he works there too and was on autopilot.",
   "created_utc": 1692629139,
   "score": 112,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx54f1h",
   "message": "This story is gonna show my age for a few reasons, but when I was about 12 or 13, I saved up my allowance and neighbourhood yardwork money to finally afford the newest iPod, the ones that could play videos as well.\n\nI wanted to make sure they had it at the store before I got my parents to drive me there, so I opened the phone book, found the Apple Store, and called them.\n\n\nGuy at Apple Store: \"Hello?\"\n\nMe: \"Hi do you have the iPod Video in stock?\"\n\nGuy: \"Uh...this is an apple store. Like...crunch crunch?\"\n\n\nI had called the gift shop at an apple orchard.",
   "created_utc": 1692631306,
   "score": 149,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx512b4",
   "message": "I work for a marketing company. \n\nA customer saw one of our \"BLM\" designs and immediately went on a rant about how Black Lives Matter is evil.\n\nIt was for the Bureau of Land Management.",
   "created_utc": 1692630028,
   "score": 94,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx52r25",
   "message": "I used to run a free food bank for HIV-positive clients in a health care organization. Most days of the week, clients could come and “shop” at the bank for their items. One day each week, however, we offered pre-packed bags (this was clearly communicated to clients) to cut down on wait time, as the bank could get very busy and backed up while people chose their items. On those days, we had a strict “you get what you get and you don’t get upset” policy, since the whole point of the pre-packed day was speed. One fateful pre-packed bag day, a client who came in was adamantly displeased with the juice offering in her bag. She returned to my window to insist on a juice trade; I politely refused and told her that she was welcome to come back another day to choose her items. She proceeded to scream all manner of creative profanities at me and throw the family-sized juice at my head. \nI’m aware of the strain that living in compromised positions (medical or otherwise) can place on people. I am also aware that throwing juice is not generally rational, effective, or respectful. It just results in spilled juice, and that’s no fun for anyone.",
   "created_utc": 1692630674,
   "score": 173,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4yytz",
   "message": "While waiting for my food at a drive thru window, the attendant told me about how his mother was kindnapped and murdered..",
   "created_utc": 1692629230,
   "score": 32,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4yqxj",
   "message": "I use to work at a pizza place that had a alcohol/etc drive thur attached I would have people come through and ask for batteries, paper towels,  and diapers. But one that had me scratching my head was lube and q tips .",
   "created_utc": 1692629146,
   "score": 228,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4zx4o",
   "message": "Frat boy wanted to buy beer right as the clock in the self check hit midnight and it stops accepting it. He started demanding free chips because I was refusing him service as the self check clerk.... on a Tuesday (maybe it was Wednesday?). He didn't like it when he demanded a manager and I went to the service counter and called for a manager and transferred the phone to my self check desk. I picked up and said manager speaking. (managers all left at 10 pm as usual and I was the only front end employee which I found always to be stupid. I'm a small gal) I was pretty amused about his temper tantrum though",
   "created_utc": 1692629594,
   "score": 219,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx53xez",
   "message": "Work in radio. Got a call on the contest line one time.\n\n\"Yeah, I need a hotel room,\" said the caller.\n\n\"OK. How would you like me to help you?\"\n\n\"Well...book me one!\"\n\n\"You're aware you called a radio station's contest line, right?\"\n\n\"Yeah. Don't you book hotel rooms for rock stars when they do a show in town? Book me one!\"",
   "created_utc": 1692631123,
   "score": 67,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5270n",
   "message": "Once my mom sent me to get Chinese takeout and my Chinese ex-gf tagged along.\n\nShe talked to them in Chinese, asking for authentic Chinese dishes. It was kind of funny to hear them say they don't actually serve Chinese food. We all laughed.",
   "created_utc": 1692630460,
   "score": 222,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx513km",
   "message": "When I worked at subway, there was a dude who asked how I hadn’t been murdered as a baby. The conversation went as followed: \n\nHim: “What ethnicity are you? You speak English so well”\n\nMe: “I’m Indian but I was born in Chicago before moving to California!” \n\nHim: “Chicago? You should’ve been murdered as a baby, I’m surprised you’re alive.”\n\nMe: “…uh. Yeah.”\n\nHim: “my buddy is on drugs and homeless” \n\nI literally didn’t know what to say.",
   "created_utc": 1692630042,
   "score": 60,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4zkm4",
   "message": "I worked at Tim hortons when I was in high school. One time, a man came through that didn’t speak English super well. He tried ordering a burger and fries- I told him this is Tim hortons we don’t have that. He was super confused and shocked we didn’t have either. I explained to him we sell sandwiches, bagels, etc. He ended up leaving.",
   "created_utc": 1692629461,
   "score": 108,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx54ifw",
   "message": "I worked in a local cafe/newsstand/convenience store type spot. We also had a ticketmaster outlet for a bit. Our small town had an annual concert that usually ran two or three nights. It was really popular with the local folks, so it brought in a lot of foot traffic with people buying tickets (my boss was honestly a small-business mastermind). That was the extent of our involvement — we sold and printed gate passes.\n\nOn night one of the event, I was closing the store as usual, at 10pm. An irate woman called wanting to “file a noise complaint” about the concert. I was like, ma’am, you must have the wrong number, this is *local cafe*. She INSISTED that she was filing “an official noise complaint” and demanded to speak to the owner RIGHT NOW — 10pm on a Friday? Yeah, he’s not here. He also isn’t the police, and doesn’t deal with noise complaints. Also, it’s only 10pm, and this concert has been widely advertised for months.\n\nShe then went on a wild rant that we needed to do…something?…about the noise, since we sold tickets. She wouldn’t let me off the call, and was going berserk. I told her I was going to disconnect, since we had nothing to do with the event or the noise. She called back multiple times, and finally I just let the phone ring…was still ringing when we locked up. MA’AM ARE YOU OK?",
   "created_utc": 1692631340,
   "score": 20,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx571nk",
   "message": "I had a car for sale and an influencer called me up and said they would like to use my car for a podcast.\nThey said \"You need to have your car at\" and I cut them off and said \"I am sorry did you just tell me that I need to deliver a car you are asking to borrow for no money\"?  They said \"Yeah\".  I said \"Oh, okay, just send me a retainer of 1/4 the price of the car and you can borrow it, I don't know you\".  She said \"I don't have that much money\".  I said \"Well I do, so who the hell in their right mind tells the person they are asking for a favor where to be and what to do\"?  She got really angry and explained to me \"Who she was\".  Then told me \"I can destroy your business in minutes with a negative comment\".  I couldn't stop laughing, I am an architect and normally work for corporations.  She said \"The people do as I demand and I have 90,000 followers\".  I said \"Cool have every one of your followers send you $ so you can borrow my car\" and then hung up.  I got 4 emails from her loyal followers...4.",
   "created_utc": 1692632284,
   "score": 92,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx53lpq",
   "message": "I’m the doofus who tried to order ice cream at the Tim Horton drive thru.",
   "created_utc": 1692630998,
   "score": 29,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx57tsc",
   "message": "Worked at a book store in the late 90s. We were located in a mall. Had someone come in asking if we sold computers. \n\nMy classmate worked at a camera/film store in a mall and said they had someone asking if they sold bicycles.",
   "created_utc": 1692632573,
   "score": 124,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx509xg",
   "message": "At least once a month I have someone come in with a check from Chase bank or BofA and try to cash it at my bank. I always want to say \"sir this is a Wendy's\", when really I say sir this is a different bank.",
   "created_utc": 1692629728,
   "score": 28,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx51bun",
   "message": "I used to work at Pier 1 Imports. A woman came in asking where our food was, and I told her we didn’t sell any food except for decorative food. She said, “You must be new. Where’s your manager?”\n\nMy manager told her the same thing and she left yelling that “no one wants to work anymore!”\n\nThen a complaint came in about us from corporate, that we refused to show her the snacks and we were discriminating against her because she said she was heavier.\n\nI think she thought we were the same as Cost Plus World Market…",
   "created_utc": 1692630130,
   "score": 234,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx51kdn",
   "message": "I work the bilingual line for a major insurance company in the USA. I can't tell you how many times the Spanish customers call us and they're calling the wrong company.  They have absolutely no idea who they're with but they call me wanting help to find them in the system.\nThis doesn't happen on the English line; it drives me nuts!",
   "created_utc": 1692630221,
   "score": 97,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx55d5f",
   "message": "I used to work for Kmart. Someone came into the store and wanted to know where the pet department was located. We only had one aisle of pet items and it was mostly items for dogs/cats (food, litter, toys, etc). \n\nI took the customer to the aisle, and they said “this is it? This is all you have for pet supplies? You don’t have an actual department like other stores?”\n\n“Yes sir, we just carry the basics. If you need a bigger selection, there is a Pet Supplies Plus located at the other end of the plaza.”\n\nThe customer got upset and said, “But if I wanted to go to Pet Supplies Plus, I would have gone there. But I wanted to go to Kmart. So I’m guessing you don’t have fish food or anything like that?”\n\nI showed him the same selection of fish food, and he got upset. He then started asking advice for fish tanks and again, I directed him to the Pet Supplies Plus that was located just a couple storefronts down from Kmart. When he insisted on not going to that store, I gave him directions to 2 other pet stores in the area. \n\nEventually he left, but not before saying “this is why Kmart is going out of business!” Sure buddy, the lack of a pet department is the sole reason Kmart is going out of business.",
   "created_utc": 1692631657,
   "score": 143,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx59nx7",
   "message": "I worked at Wendy's throughout high school and some lady ordered a burger meal at the drive thru. Over an hour later she comes back to the front counter, slamming the burger on it saying it was cold. I checked our receipts and told her she ordered over an hour ago and that burgers aren't meant to stay hot for that long. She said that was absolutely unacceptable and how dare we serve her a burger that gets cold. She then proceeds to ask me for my full name and details so she could sue me, at the same time freaking out when I didn't have a pen to give her to write down my info. Another customer walking by said holy shit lady relax, and she yells at him to mind his business. He says well I just feel bad for this poor employee you're yelling at, if you don't wanna eat here go somewhere else. Bless his soul I was only 17 and was so shook.",
   "created_utc": 1692633250,
   "score": 143,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5arc9",
   "message": "I was in Lowes one morning right after they opened. There was a woman at the service desk having a complete melt down yelling and screaming because Lowes didn't have a licensed contractor there at the store for her to hire. She apparently woke up that morning and decided she needed a deck like that same day and thought she could just go to Lowes and have someone immediately start building a deck. It was dead so I stood with the cashier listening to the show. They ended up having to call the police to get her to leave.",
   "created_utc": 1692633653,
   "score": 27,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5256d",
   "message": "When I worked at Starbucks, older people would regularly ask for instant coffee, and be pretty furious when I told them that we serve beverages on espresso",
   "created_utc": 1692630441,
   "score": 69,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx54jjp",
   "message": "I used to work in a local government office so it was a hot spot for the elderly to hang out for no other reason than to talk to us. One gentleman came in every day for weeks to use a microfiche reader and would wait until we were actually assisting someone to butt in and tell us all about his current health issues and how his friends died and who in his extended family was arrested. Eventually he was told to stop bothering us or he would be banned.\n\nHe was fine for a while until he went up to the only person with an actual customer and told them both about his stomach ulcers. Refused to leave and had to be escorted out by police.\n\nI felt bad for him but I wasn't paid enough to be a therapist.",
   "created_utc": 1692631351,
   "score": 179,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx55i1k",
   "message": "I work for a CPA office that is in an office park with a couple doctors offices. One day a guy came in only speaking Spanish, so I grabbed my Spanish speaking colleague to translate. He talked to the guy in the lobby for a few minutes, then the guy left and my coworker came back and asked if that was a joke or we put someone up to that. Apparently the guy explained that his testicles were extremely swollen and painful, he was looking for one of the doctors offices and just walked into the first building in the complex. …I’m, sir, we do taxes here, not testicles.",
   "created_utc": 1692631708,
   "score": 45,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx56940",
   "message": "Not one specific moment, since it happened all the time when I worked at Ulta.\n\n\"I'm looking for this lipstick\" *shows me Sephora brand lipstick* \n\n\"We don't sell that, but I can show you something similar!\"\n\n\"No, I want this specific lip stick, don't you sell it?! Well where can I buy it?!\"\n\n\"At Sephora m'am\"",
   "created_utc": 1692631993,
   "score": 250,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx50ybz",
   "message": "Years ago when I was a cashier at Borders I had long hair and was starting to grow a beard so [I looked a little bit like Jesus](https://i.imgur.com/IDsNiJA.jpg) according to some people. \n\nOne day I had this lady I was ringing up and she seemed pretty average, a little on the hippie side in terms of looks, but overall it was a pretty normal conversation with typical small talk. Then towards the end she comments about how I looked like Jesus and asked me if she could tell me something. I didn't want to be rude, so I said okay. That's when things got weird and she ended up going on this rant about her life and what Jesus meant to her. There were other customers, so I tried tk cut her off and said sorry but there were other people in line. This didn't stop her though, she just stood off a bit to the side and continued on her rant. It was incredibly awkward having to ring up these other people while she stood there talking about the bible. This went on for about 20 minutes before my manager finally came back and she got security to escort her out. \n\nShe seemed pretty harmless but I was still a little bit freaked out that she would be waiting outside for me after my shift was done.",
   "created_utc": 1692629986,
   "score": 19,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx547bo",
   "message": "Oh like 8 times a week when I was working at a Dollar General everyone loved their \"original\" joke.\n\n\"I thought this was a Dollar General, why isn't everything a dollar?\"\n\nI had two ways I responded to this both got the same blank stare most of the time. Either I would say \"The dollar tree is 6 blocks down that way and they are not associated with one another.\" Or I go with \"Yeah Dollar General gave that up about 10 years before I was born. Turns out you severely limit what inventory you can buy if you sell everything at a dollar.\"",
   "created_utc": 1692631226,
   "score": 10,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx55vi0",
   "message": "I worked at a cable company for a couple years in call center customer service. We handled accounts all over the usa.\n\nA man calls in and gives me his account number. I immediately notice that there are too few numbers , but try anyway. No account.\n\n\"What the fuck do you mean you can't find my account ? What are you an idiot\"\nDude starts getting real angry and toxic , repeats the same 8 digit account number back to me slowly and has me repeat it back to him.\nI told him our account numbers were ten digits long , and he was only giving me eight.\nHe asks for a manager and starts yelling about how Verizon was the biggest shithole of a company and he was going to have me fired.\nI told him he had called the wrong company. He called their competitor.\n\n\"Well....shit , whats Verizons number?\"",
   "created_utc": 1692631849,
   "score": 208,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx53d9a",
   "message": "I used to work at Sonic so I got used to ordering tots with my burger. I went to Wendy's and had to be informed that they don't sell tots. Feeling I'd be adventurous and splurge I went with the onion rings instead. I got fries.",
   "created_utc": 1692630910,
   "score": 4,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx55a72",
   "message": "Not my moment but I was there for it! This happened over 30 years ago, keep that in mind. \n\nPlaced my order, guy behind me steps up and orders a Whistledog \u0026amp; Teen Burger combos. The girl literally said to him, “Uh sir, you’re at Wendy’s.” \n\nNot a great story except now that the meme exists, it’s been elevated!",
   "created_utc": 1692631627,
   "score": 183,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx569hm",
   "message": "This did not happen to me but like last year my dad was wasted so I had to pick him up from a friends house and on our way home he asked me to stop at a fast food place and he will pay me back so I pulled into Wendy’s at the drive through I asked him what he wanted and he screamed “I want a Big Mac, a six piece nugget with sweet and sour sauce and a McFlurry,” p.s he sounded hammered so the Wendy’s employee said I hope you are driving and sir this is a Wendy’s.",
   "created_utc": 1692631997,
   "score": 4,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx56k3d",
   "message": "Worked at a Wendy’s next to a costume shop. A man walked in wearing a Burger King mascot costume and placed an order. I started laughing and literally told him this was a Wendy’s. \n\nThe customers who were in the dining room thought it was hilarious too. Some people took pictures of him eating a frosty.",
   "created_utc": 1692632106,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx56lib",
   "message": "This happened 22 years ago (I was 11) and I still feel mortified thinking about it.\n\nI went to my stepsister's end-of-the-year play. They performed some sort of musical. The play was split in two acts, and there was a 30 minute break after the first. Parents were escorted to a counter where they could get some coffee and a cake. I saw a group of children walking around with juice boxes and bags of crisps, so I followed their trail to get some myself. \n\nI was standing in line for them in a classroom. I knew no one, so everyone looked at me funny. When it was my turn, the woman asked me who I was, so I told her my name. Then she said that the queue was meant for the performing children. I remembered her feeling bad for me, so she promised me I get some if there were leftovers. I hurried back to my parents (who laughed at me of course) and was given a juice box before the play resumed after my father asked the teachers for it (which embarrassed me even further).",
   "created_utc": 1692632120,
   "score": 178,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx56ta8",
   "message": "I work in a betting shop and someone handed me a Homebase receipt, adamant he had won something...\n\nI said sir this is a Homebase receipt.\n\nHe wasn't having any of it.\n\nLike no it placed 1st.\n\nTHIS IS A TICKET FOR SOIL!\n\nstill wasn't getting it.\n\nYou may think I made this up, I can assure you this happens a lot more than you think.",
   "created_utc": 1692632199,
   "score": 86,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5887o",
   "message": "“Can you take me to pick up my son from soccer practice?” \n\nLady- I’m a psychologist. I’m not a taxi service 😆",
   "created_utc": 1692632723,
   "score": 206,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5a1ax",
   "message": "Customer was in line with a cashier and having fits because all of the items he was trying to buy were 'supposed' to be on sale. Got to the point he started waving around the flyer in his hand like a flag, declaring we were all trying to rip him off. Cashier voids the transaction.\n\nOn his way out the door he's shouting about how he's going to call corporate on us and I offer to look at his flyer and see if I can figure out what's going on.\n\nIn my mind I remember thinking the date had to be off. It's a fairly common problem that customers will get *last* week's flyer and get it into their heads it's for *this* week, won't check and then will get mad when they're wrong.\n\nWell, that wasn't what was wrong. This was an entirely different, and unique unicorn I've never encountered before nor since. I realized it the moment he finally let me see the flyer.\n\n\"Sir, this flyer is for a different store.\" Even the color of the flyer was wrong.\n\nHe looked at it in disbelief, silently turned bright red and left the store.",
   "created_utc": 1692633387,
   "score": 127,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5emo3",
   "message": "My wife asked me what we should do for dinner.  I asked which children would be home so we could plan properly. This led to a short discussion about new school bus drop off/pick up times this year. Ultimately leading to, the children being home by 4,  6 of us for dinner and it consisting of smoked chicken legs. Then we finished having sex.",
   "created_utc": 1692635092,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx54x0m",
   "message": "While working at the college bookstore, I bumped into a guy I knew from our quiz bowl club. I said hi and asked him how his summer was.\n\nHe said. \"it was better than last summer, when my GRANDMA DIED.\"\n\nI didn't quite know how to respond.",
   "created_utc": 1692631490,
   "score": 3,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx56x9n",
   "message": "Worked as \"Mobile Expert\" at a T-Mobile retail store.\n\nI answer the phone, and the guy wants me to explain to him why \"all the people in the city can watch Netflix on their phones\" but he is having signal issues, so they can \"lock away\" people like from communications...\n\nI work in a mall, why the fuck do you think I would have the answers to the conspiracy theories you have about a triple digit billion dollar telecom company based in Germany?\n\nCrazy be Crazy.",
   "created_utc": 1692632240,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx571zv",
   "message": "When I worked at McDonald's someone came in and demanded steak. It was a McDonald's. He demanded to see a manager who helpfully informed him this was a McDonald's.\n\n\u0026amp;#x200B;\n\n\"I can get steak at Taco Bell!\" he claimed. Then go to Taco Bell??",
   "created_utc": 1692632288,
   "score": 50,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx57iwr",
   "message": "I was a cashier at Dollar General. A woman and a man came through my line with a bunch of junk food (mostly candy) and paid for it with her EBT card. Not all of it would charge to the card (I can't remember if it was a product that wasn't approved through EBT or if she was out of funds) so she says \"I see you take paper and plastic, but do you take glass?\", and she flashed a little baggie of meth out of her bra. \n\nI just kinda blue screened and said, \"Uh, we just started taking PayPal. Do you have that?\"\n\nThe man grabbed the meth, tossed a $10 at me, grabbed the bag of candy, and the dragged the woman out by her elbow. They were only like $3 short after the EBT charge, so we had to keep their change in a little envelope in the office, just in case they came back. They never did. The manager ended up pocketing it after 3-ish weeks.",
   "created_utc": 1692632460,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx57m59",
   "message": "When I worked at Lowe's at the beginning of the pandemic, people thought it was a great place to share their political opinions with anyone who would listen. They especially loved that employees couldn't say much without getting in trouble. So people would come up to the register and ask me questions about the pandemic and it's supposed political implications. My favorite was when a woman who clearly thought the world revolved around the US asked me if I agreed that \"this bullshit would all be over by the election\". She was dissatisfied with my answer because I didn't give a yes or no. I just said \"who knows\" and \"have a nice day\" This is a hardware store, lady, not a public forum. Sure, say what you want, but don't expect people to engage.",
   "created_utc": 1692632493,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx58et5",
   "message": "I bought a small package of light bulbs and ended up finding the package I already had, so I went to take them back to Wal-Mart. Brought the receipt and everything. They couldn't get the receipt to scan, then couldn't get the item to scan, so the CSR just starts hand typing all the info in her computer to give me a refund. Halfway through this process, I realize that the receipt isn't even for that store. She was going to just give me the money.",
   "created_utc": 1692632791,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx58j6q",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5di0b",
   "message": "Uber driver\n\nOnce had a girl I picked up from a karaoke bar that was obvious upset/distressed. Asked if she was okay.\n\n“Yeah, I just did karaoke”\n“Oh? That’s pretty cool”\n“I did a song for my dad that died a year ago”\n“Awe that’s sweet of you”\n\nNothing else was said until I got her home, which was only a couple blocks away. As I pulled in this is what she said.\n\n“I’m not going to give you a bad rating for this BUT you could have been more emotionally available for me”\n\nI just said “I’m …sorry?” And had to stop myself from bursting into laughter. I felt bad for her of course but that was just the most ridiculous thing I’ve ever heard from a passenger. Especially prefacing it with “I’m not gonna give you a bad rating for this but…”\n\n\n\nSecond story\n\nPicked up a lady, she was distressed, I asked if I could do anything for her and she said “not unless you can take back the last forty years of my life”\nIt was a very silent awkward ride.",
   "created_utc": 1692634673,
   "score": 250,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5dxkp",
   "message": "Got one, nice lady walks into the cinema i work in, asks for a ticket yadda yadda. We start chatting a bit while i ring her up, explain how the cinema works etc (it was a slow day too so i could actually do that), and thats when she asks me what hall to go to. I explain to her she has access to *all* of them, she can just pick where ever she goes first. \n\nCue this:\n\n- \"Ok thats great, where's the Barbie movie in though?\"\n\n- \"What do you mean *Barbie movie*...?\"\n\n*lady looks around...realises things are very fucky*\n\n- \"Oh...oh no.\"\n\n- \"Oh, i see it too now. Yeah this isnt *this* kind of cinema. Let me reimburse you.\"\n\nTurns out she literally managed to miss every dvd rental case, the posters and interior deco of the PORN CINEMA she walked into.",
   "created_utc": 1692634834,
   "score": 205,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5d8ux",
   "message": "I was working at McDonald’s and this lady said “can I get the Wendy’s 4 for 4?!” I said “ma’am this is a McDonald’s” and without a moments hesitation she replied “indeed it is can I get a Big Mac?”",
   "created_utc": 1692634579,
   "score": 220,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5dmar",
   "message": "I've told this story tons of times to my friends/family because it's one of my favorite Domino's Stories. This happened somewhere around 2017-2018.\n\nOne day it was really slow at work at Domino's. I was still a relatively new Insider (only a few months in to what would be about 4 years) and still in school, so I was hoping that it would stay slow so I could go home so I can cheat on my math homework, play some League of Legends, and get some sleep since my school started an hour earlier than other schools in the area. A woman, probably mid-40s, comes in to order a pizza. She's pretty chill, and we're just chatting while she's ordering because there really isn't much to do otherwise since we already cleaned the store and oven and all that.\n\nAfter she gets her pizza all done up I ask her if she'd like any drinks. She's like \"oh what do you guys have?\" I'm running down the drink options and she notices Coca-Cola and looks at me wide-eyed like she just saw someone get hit by a car.\n\n\"DON'T YOU KNOW THEY PUT HUMAN EMBRYOS IN COKE?!?!\"\n\n\"^^^I'm ^^^sorry??\"\n\nShe then spends the next SEVEN. MINUTES. Running down pretty much every major conspiracy, from human embryos in Coca-Cola to Flat Earth to the moon landing being faked, etc. If you think of a pre-COVID conspiracy, she hit it. And she tied it all up in a neat little bow of \"It's all the Jews.\"\n\nI'm stunlocked. The only words that can come out of my mouth are \".............. so no on the drink?\"\n\n\"Coke Zero please. :)\"\n\nI guess the Zero means \"Zero Embryos.\"",
   "created_utc": 1692634717,
   "score": 165,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx59crj",
   "message": "I used to have a job working front desk 3rd shift concierge at a swanky apartment tower.  Very exclusive.  NFL players, NBA players, MLB players, high end all around.  The top floor is a penthouse owned by the owner of a modeling firm.  \n\nPaid. Like. Shit.\n\nOne night two girls come in, want to purchase a few things from the residents dispensary (like a in house 7-11), I just get a room number and it gets tacked onto the monthly rent.\n\nWhile one is getting a few things, the other decides to tell me her life story and is asking me for advice on all these life-changing things she's thinking about doing.  When the other was done shopping, she came over to the counter and the two of them just chatted with me for a couple hours, asking for my advice on everything - and I mean everything.  I felt like a therapist for them.  After a while, they wanted me to come upstairs and party with them and the friend they were visiting.  I assumed they were at least a little drunk, but they had been there for a while, and they weren't getting any more sober.\n\nAnd then the person who they were visiting (a lawyer who lived in the building) came down and was like \"where the hell have you two been?\" and ushered them upstairs.\n\nNext day at the start of my shift, he was waiting for me.  He apologized profusely and gave me a $200 tip and asked me to not mention the two girls to anyone.\n\nApparently they were a pair of escorts and were high as a fucking kite on Extacy.",
   "created_utc": 1692633136,
   "score": 179,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5bzzj",
   "message": "Used to work In a musical instrument shop, pianos in the window , a single file path to the counter , that went through about 20 pianos and keyboards , the counter is a giant novelty guitar amp.  With guitars hung on every free inch of wall space .\nLady comes in , trips over a couple piano stools In her rage filled stomp over to the counter , slams a receipt on the counter and immediately starts shouting, conversation was as follows :\n\n Lady:“ I ORDERED THIS TV FOUR WEEKS AGO AND ITS STILL NOT ARRIVED , WHAT SORT OF BUSINESS ARE YOU RUNNING HERE ?!” \n\nMe: “ well that must be frustrating for you but I’m sorry to say we sell instruments not TV’s , I think you’re looking for the Sony shop a couple of doors down the road “\n\nLady” so you’re calling me a liar !? I bought a £500 tv from this shop 4 weeks ago ! I’m not stupid I can see the tv on the wall !”\n\nMe “ So that single tv is the one we use to monitor cctv and let customers know they’re on camera , we have a lot of issues with theft and stock loss , again I think you want to be talking to Sony staff the shop is like 50 meters down the road , and your receipt says Sony , this is not Sony , we don’t sell Sony items here , we sell guitars and pianos .”\n\nLady : “ where is your manager , I was in this shop 4 weeks ago and one of you sold me a TV that hasn’t showed up , there were TV’s on the wall like that and speakers like those you have over there . You’re a liar and you’re calling me a liar or stupid , either way I want my refund NOW “\n\nMe : “ Well I am the manager , I have worked here for 4 years and can guarantee you we have never sold a TV to yourself or anybody else . You’re being rude and you need to leave now .” \n\nBest part is she threw the receipt at me and a couple racist slurs , stormed out . \nShe comes back in 5 minutes later and starts shouting whilst I’m helping an actual customer \n“ WHERE DID YOU PUT MY RECEIPT ?! YOU STOLE IT DIDN’T YOU “ \n\nI pulled her receipt out the bin as it was just resting on top , gave it back to her and gave her a sickly sweet smile “ so did you find the correct shop on the end or are you just going up and down the road berating random shop workers ?” \n\nShe got a bit dumbfounded and just stood with her mouth moving but no sound coming out so I held the door open , pointed at the giant Sony sign visible from the doorway “ that is the Sony shop by the way, good luck!”",
   "created_utc": 1692634112,
   "score": 136,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx59i3t",
   "message": "Had a guy come in to my place of work yesterday pissed off because he issued his payment date and had to pay extra to turn his phone back on. He said something along the lines of “it was due at midnight and y’all aren’t open at midnight so how was I supposed to pay?” I calmly explained that we are open until 7:00 pm every day but Sunday and he screamed “Well unlike you I actually have a job!”\n\nAt my job. \n\nWhilst doing my job.",
   "created_utc": 1692633190,
   "score": 235,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5cfo2",
   "message": "At my friend's wool shop, I was checking out the latest shipment she had just finished putting on the shelves, when this crazy lady walks in, makes a beeline for the counter, and just screams that she wants her hair cut now.\n\nCue my friend blinking in shock because that was very much not how her usual clientele behaved.\n\nShe pulls herself together, and goes:\n\n\"-Madam, I'm afraid the only thing that will be cut short here is our tempers. In case you haven't noticed, this is a wool shop, and has been for the last seven years.\n\n\\-I. DON'T. CARE! YOU WILL CUT MY HAIR IF YOU KNOW WHAT'S GOOD FOR... Pardon?\n\n\\-Wool. Shop.\"\n\nShe reaches on the shelf next to her and picks up a huge ball of yarn with size 50 needles sticking out of it, plonks it down in front of the lady and crosses her arms.\n\n\"-Unless you have need of knitting implements, kindly get out of this shop now.\"\n\nThe lady scurries out quickly. My friend deflates and starts laughing nervously, shaking like a leaf.\n\nThe previous shop before my friend's had been a library for 15 years. The one before the library? A hair salon.\n\nLady had been at the very least 22 years late to her appointment.\n\nOr she walked in the wrong shop since the hair salon was right next door.",
   "created_utc": 1692634276,
   "score": 103,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx59bo6",
   "message": "I work at a shoe store. One time, a lady came in carrying a pair of leather shoes and after walking around the whole store, came up to the registers looking very confused. I asked her what she was looking for and she said “Do you have a cobbler here?” When I said we didn’t she was like “Really? You don’t have anything in the back?” Like there’s a cobbler with a workbench hidden in some corner of our back room. I had to explain to her that there are virtually no retail stores that sell shoes offer cobbling services in this day and age and she acted like that was the craziest thing she’s ever heard.",
   "created_utc": 1692633124,
   "score": 77,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx58rwz",
   "message": "Worked as a nurse at the hospital when my patient told me to pick up his food delivery at the main entrance, as if I didn’t have 3 other patients I was looking after. \n\nSir, this is *NOT* a Wendy’s.",
   "created_utc": 1692632925,
   "score": 68,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5ftui",
   "message": "I work managing conservation lands for a US state. We were managing invasive species around a sensitive area with endangered species of plants in the area, and a car pulled up asking what we were doing. Thinking it was a well meaning person who was curious, I explained we were with the State, doing a monitoring project of an endangered plant found here, and while we were there we were removing invasive plants to give this endangered plant a fighting chance to recover. She flipped a mental switch and just goes off on a tirade asking if the state monitors and tracks the number of babies that get aborted in the state. and then just stops and stares at me waiting for a response. I just responded with a \"ma'm, this is a nature preserve....",
   "created_utc": 1692635535,
   "score": 62,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5dvvz",
   "message": "Helping facilitate a support group for people who lost a loved one to su__cide, and a trio of women enter and begin pouring their hearts out about how badly they want their lives to end, and how we must all totally empathize because we’re all there for the same reason.\n\nNo. This was a group specifically to get support for people we’ve already lost. \n\nIt was so awkward having to not only ask them to pause and stop talking, and explain that while we all sympathize with them, they were at the wrong group. \nI’ve never seen a group turn ugly so fast. “So we can’t stay? Do you want us to turn up dead like your family members? Why wouldn’t you be honest and say what this group is REALLY ABOUT?!?” ….lots of defensive arguing and some truly hurtful things that re-traumatized our group members.\nIt’s the closest I’ve ever gotten to just punching a bunch of random people in the face. We worked hard for years to make that group a safe sanctuary for those of us who have been through that loss. It took a few months for some of our regulars to come back, and some never did after that. \n\nI’m still so irrationally angry about this.",
   "created_utc": 1692634816,
   "score": 61,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5dj6m",
   "message": "I work as a cashier at a home goods store. I’m very friendly and honestly treasure my customer interactions. \n\nI was doing my usual patter - “Hi there, how’re you doing, did you find everything all right?” - and this lady tells me that it’s the first time she’s been out of the house in a while. I thank her for choosing [store] and go to move on with the transaction. She raises her shirt, shows me a HUGE angry red incision on her stomach and starts telling me about her recent hysterectomy. The stitches hadn’t even been removed yet. I sort of nod and smile and try to pivot to her total so I can move on with the MASSIVE line that’s building, and she won’t stop talking. \n\nI had to call for a back-up cashier, while getting a very detailed description of surgery, uterine cancer, and the recovery process. She didn’t drop her shirt the entire time.",
   "created_utc": 1692634685,
   "score": 54,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5c48y",
   "message": "I was at a Nandos location in New Delhi with my mom and my mom ordered a chai. The waiter apologized and said they don't have chai.\n\nMy mom answered I'm a playful tone \"Oh but we're in India, I thought you would have chai.\"\n\nWaiter responds \"No ma'am, you're at Nandos\".\n\nCracks me up whenever that memory pops back up.",
   "created_utc": 1692634157,
   "score": 44,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx5ddiq",
   "message": "I once walked up to the Dunkin Donuts (getting something for the staff at work) counter and confidently asked for a 50 piece McNugget.\n\nThe young lady at the register gave me a confused look.\n\nMe, counter-confused, and thinking she didn't hear me, asked again for a 50 piece McNugget.\n\nThe poor young lady at the register didn't know what do to - just looked at me confusingly.\n\nMe, finally realizing... I asked for a McNugget didn't I?  She nodded.  I put my head down, shake, and said 50 piece **munchkin**, please?\n\nWe bought laughed over it.",
   "created_utc": 1692634626,
   "score": 41,
   "submission_id": "15x5272"
  }
 ]
}