{
 "submission_id": "15x5272",
 "title": "What was your \"Sir, this is a Wendy's\" moment?",
 "selftext": "",
 "created_utc": 1692617658,
 "permalink": "/r/AskReddit/comments/15x5272/what_was_your_sir_this_is_a_wendys_moment/",
 "score": 38,
 "url": "https://www.reddit.com/r/AskReddit/comments/15x5272/what_was_your_sir_this_is_a_wendys_moment/",
 "comments": [
  {
   "comment_id": "jx4lt2g",
   "message": "I worked at Walmart for a long time in the hardware dept.  Had a customer call asking if we sold toilets. I said, 'like, toilet seats?'   \n\nHe said, 'No, like actual toilets.'\n\nSo I said, \"Sorry, we just sell the seats and replacement parts., no porcelain.\"\n\nHe got all huffy and said, \"Jesus, what is this place? Walmart??\"\n\nI paused for a moment and said, \"Yes sir, it is.\"\n\nSilence for a long moment.  Then he said in a little voice, \"This isn't Home Depot?\"\n\n\"No sir, you called Walmart.\"\n\n\"Oh shit, I am so sorry!\"  And he hung up.  I laughed my ass off.",
   "created_utc": 1692623763,
   "score": 171,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4an2d",
   "message": "A man come into my tattoo shop once and asked for a massage with a happy ending. Was like “err this is a tattoo studio not a massage palour” and he just stood there like “yeah? I know” as if tattooists are synonymous with sexual masseuse.",
   "created_utc": 1692618098,
   "score": 98,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4a9xy",
   "message": "I love when customers traumadump on me. \n\n\"OK sir that will be $2.15\"\n\n\"Yeah my dog just died and my son was arrested. My mom's house burned down last week too\"  \n\n\"Oh.. would you like a straw?\"",
   "created_utc": 1692617889,
   "score": 123,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4c1ai",
   "message": "I drove into a McDonald's drive-thru and asked for a Whopper combo. \n\n(I was half-asleep.)",
   "created_utc": 1692618881,
   "score": 28,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4couh",
   "message": "I automate dumb buildings with temperature controls systems.  Something I get a lot was, all of this equipment was working before you touched it, now none of it works.  The best ones, and my favorite ones are when we get that call on a unit we haven't even touched. \"Unit 1? You're calling about unit 1?\" \"Yeah, it was working fine before your guys touched it and now it's not running.\" \"Okay, well we started working on the other side of the building first,and we haven't begun tying into the units yet, so that unit is all on you.\" \"Oh.\"",
   "created_utc": 1692619238,
   "score": 28,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4m9lu",
   "message": "I work as a facilities manager for a company with a few hundred locations around the country. Back at the end of 2020 I was having trouble getting in touch with a vendor we had a contract with to do some work around one of our offices. Nothing big. I figured he just ghosted us, so I began looking for another vendor who could take over the work.\n\nAfter 2 months of radio silence, vendor 1 calls me out of the blue and was clearly very drunk and crying at 1pm on a week day. Turns out he had gotten covid, was hospitalized, got blood clots in both legs, and had to have them both amputated.\n\nHe called me while I was at work and told me his whole life story. I ended up staying on the phone with him for about 30-45 minutes and I helped him track down a grief counselor. Hopefully he went. I still wonder how he's doing some times.",
   "created_utc": 1692623974,
   "score": 18,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4rgxt",
   "message": "Literally working at a Wendy's. Guy threatens to jump over the counter and strangle me because I accidentally entered an extra kids meal on his order. \n\nI made the mistake because while he was ordering, he was simultaneously talking on his phone *and* poorly wrangling like 4 or 5 small children, leading him to repeat himself several times. I didn't catch that one of them was a repeat.",
   "created_utc": 1692626237,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4i3ce",
   "message": "So my family own’s an old fashioned Chinese restaurant. One of those places that have like 100 menu items with massive portions because it was from way back when. \n\nSo I’m taking an order and this woman gets her kids together. The son whose a teenager I think asks “do you guys have Thai tea?” I said no. The little girl whispers something to her mom and mom asks “you have sticky rice?” No. Some girl whose younger than the teenager says “oh, I don’t see pho on here.”\n\nAt this point I’m screaming in the back of my head; “This restaurant has been open since before my uncle was born. At that time you Americans thought that fried rice was exotic. Nobody was worried about ox tail soup, chilled tea with cream, and rice steamed in a bamboo. If you would like, you can drive 5 minutes down the street to the Lao restaurant that serves that. I know the owner and will give him your order.” \n\nSo my aunt notices me from the register and in our language asks me what’s taking so long to get their order. I told her that they were asking for. She tells me “send them down the street where they serve that stuff we don’t do that here.”\n\nI got their order, and told me cousin about it. She says “well that’s technically Asian food. It’s not stupid to ask.” Don’t walk into a Chinese restaurant and ask for ‘Thai Tea’ or Vietnam’s most famous noodle soup dish.",
   "created_utc": 1692622020,
   "score": 40,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4bn3g",
   "message": "Not mine, but there was a thread on here where a Karen lost her shit at Chipotle because they wouldn't make her a fried chicken burrito.",
   "created_utc": 1692618662,
   "score": 16,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx49x0k",
   "message": "A man rapping his order",
   "created_utc": 1692617683,
   "score": 9,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4hlc5",
   "message": "Found the product I needed online. Drove to the store. Spent 20minutes failing to find said product on the isle it was supposed to be on. Showed the picture to multiple staff, none of whom recognised it. Finally went to the customer services desk and after 10 minutes of waiting in line got told the website I was looking at was one of their competitors.",
   "created_utc": 1692621775,
   "score": 15,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4t2dk",
   "message": "Delivered two large pizzas to a guy's apartment at 10 am on a Sunday. When I got there, he proceeded to say, \"My girlfriend just dumped me.\"  I slowly backed away and said I had more deliveries to do.",
   "created_utc": 1692626901,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4avd1",
   "message": "When a customer in line in front of me was refused service because she was wearing a T celebrating pride month. “That offends our religious beliefs,” said the manager. Yup, that’s Wendy’s.",
   "created_utc": 1692618230,
   "score": 15,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4q015",
   "message": "Customers at my retail job explaining that COVID passports are the mark of the beast and check-in QR codes are a means of tracking us all... while paying for the groceries electronically via their phone.\n\nAnd those eager to let me know that the mask I'm wearing traps bacteria and causes cancer... while in the process of purchasing cigarettes.",
   "created_utc": 1692625616,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4ndch",
   "message": "Someone wrote into my work to say that a neighbor of hers died (natural causes) and the police have no next of kin info to contact so we need to call them and give them any information we have on-file for her. Ummm that’s a hard no",
   "created_utc": 1692624463,
   "score": 2,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4nryf",
   "message": "Well, not me but my brother when they try to order a Big Mac or a Whopper from him.",
   "created_utc": 1692624644,
   "score": 2,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4r5gr",
   "message": "I work as a cashier. A guy came by my register, and I noticed he's wearing an FJB shirt. While I was checking out his stuff, he said something like \"yeah I think a lot of people in Congress need to... you know...\" and made a gun shooting gesture with his hand. I still think about it a lot.",
   "created_utc": 1692626104,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4lwr3",
   "message": "I went to Wendy’s",
   "created_utc": 1692623809,
   "score": 3,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4d09v",
   "message": "Oh man, I had a classic \"Sir, this is a Wendy's\" moment when I walked into a clothing store and tried to order a cheeseburger. Talk about mixing up my cravings! The cashier gave me the most bewildered look before kindly reminding me of my location. Needless to say, I quickly retreated from the clothing section and made a beeline for the nearest fast food joint.",
   "created_utc": 1692619409,
   "score": 2,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4iryf",
   "message": "Worked a grocery store, went into a bathroom stall, no one was in the bathroom, come out there’s a homeless dude with his shirt off taking a bath in the sink🤷🏻‍♂️",
   "created_utc": 1692622347,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4r91q",
   "message": "I’m a high school teacher in Australia. I had a parent rail me out that I wasn’t teaching their daughter how to do her taxes. \n\nI’m a history teacher.",
   "created_utc": 1692626145,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4kttf",
   "message": "I was watching a guy trying to negotiate a cheaper price for a prostitute because honestly, she wasn't all that attractive and clearly past her prime age-wise.   Finally, I had to intervene, and say \"Sir, this is [Sister Wendy](https://en.wikipedia.org/wiki/Wendy_Beckett)\".",
   "created_utc": 1692623313,
   "score": 0,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4kig3",
   "message": "One time, I was at a Wendy’s drive-thru and I ordered a burger, fries, and a drink. The cashier asked me if I wanted any sauce with my fries. I said yes, and then proceeded to list all the sauces I wanted: ketchup, mustard, mayo, barbecue, honey mustard, ranch, sweet and sour, hot sauce, and salsa. The cashier looked at me incredulously and said “Sir, this is a Wendy’s. We don’t have all those sauces.” I was so embarrassed that I just drove away without paying or getting my food. 😅",
   "created_utc": 1692623167,
   "score": 255,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4mtzc",
   "message": "I ordered a Frosty and Baconator.",
   "created_utc": 1692624223,
   "score": 0,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4hgrd",
   "message": "Worked at a golf course. The guy came in and demanded a caddy for his round. We don’t have caddies but he insisted!",
   "created_utc": 1692621712,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4rmmb",
   "message": "Used to work for a Dominos that was located right next to a gas station, and by default our two businesses shared a street sign where the gas station would advertise their specials.\n\nSo one day they’re advertising tacos-in-a-bag and I have a guy walk in ordering one. Took me a minute to realize he was legit trying to order a taco-in-a-bag at a Dominos and I said sir, we don’t do that here.\n\nSo he points out at the sign and I say, “yeah, that’s for the gas station next door. Why would Dominos be selling tacos-in-a-bag?”",
   "created_utc": 1692626303,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4smfm",
   "message": "Recently completed a construction project with my neighbour. He was a complete idiot and dicked us around every step of the way until finally we just said “fuck it” and let him finish up the last little bit on his own. We went over to settle up the material costs, as we’d agreed upon from the start. He immediately starts ranting about how we owe him $2000 because we didn’t help finish the project, so we owe him for his labour. We pointed out that he took it upon himself to work on it while we were at work, or at 9pm, and refused any communication about actually PLANNING times to work on it. He would just go out there, start working, and expect us to join him. Yes, even if we weren’t home. He told us we should have been waiting around every day, just in case he decided it was a good time for him to work on it. He also didn’t keep any receipts from any of the materials he purchased, but “don’t worry bruh, I wrote down all the numbers, you can totally trust me, bruh!”\n\nObviously we told him that was just stupid and we wouldn’t be giving him shit but our share of the material costs, and then only when he could cough up some actual proof of what he spent. He got really frustrated and started screaming “I’m under pressure man! My boat broke, it needs a new motor!” And then he just kept screaming about his boat, and ran into his house. Hasn’t looked either of us in the face since.\n\nI guess I at least understand why he thought needed to try to swindle us for two grand lol",
   "created_utc": 1692626720,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4vw1v",
   "message": "I own a Drywall company and our shop is in a giant storage unit complex for big rvs (like $500k-$1m rvs) so the bays are gigantic, a lot of contractors have their shops there, the front building is shared between myself and a power washing company (we both have signage up clearly stating drywall business / power washing business) \nOne day my crew was at the shop loading up equipment and some older guy came up and wanted to rent a storage unit. My guys gave him the info for the owners (which is on a big sign by the road that says rv storage units with all the info)\nHe just ignored them, pulled out his check book and said” who do I make this check out to? I want to rent unit #12” again my guys pointed to our business sign clearly stating drywall business. He then got aggravated and asked when we were open so he could get a unit. Finally my crew leader told him the boss would be back in a couple hours so he would leave them alone. \nGuy never came back.",
   "created_utc": 1692628033,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4wlib",
   "message": "I worked in an ice cream truck, a tweaker came up to the back (the rear doors were open), and tried to buy weed from me while I was serving customers. I had to explain to him I was not selling weed. \n\nLater on he ambushed my truck when I was leaving the park, stood in front, hit the hood a couple times with a piece of metal, and then when I was driving off, threw said metal and shattered one of the side windows on the truck.",
   "created_utc": 1692628309,
   "score": 1,
   "submission_id": "15x5272"
  },
  {
   "comment_id": "jx4wqac",
   "message": "Closing shift at a Starbucks, was like 10pm at night and this couple come inside and walk up to me at the front counter saying, \"The deli across the street is racist towards white people.\"\n\nI really had no response besides just standing there for a few seconds before saying, \"...did you want to order something...?\"",
   "created_utc": 1692628361,
   "score": 1,
   "submission_id": "15x5272"
  }
 ]
}