{
 "submission_id": "15x7yn4",
 "title": "[Serious] What split second decision have you made in your life, that if you hadn't made it you would have died?",
 "selftext": "",
 "created_utc": 1692625121,
 "permalink": "/r/AskReddit/comments/15x7yn4/serious_what_split_second_decision_have_you_made/",
 "score": 169,
 "url": "https://www.reddit.com/r/AskReddit/comments/15x7yn4/serious_what_split_second_decision_have_you_made/",
 "comments": [
  {
   "comment_id": "jx4ov23",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1692625121,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx5iol5",
   "message": "Driving 80 miles per hour on a lonely interstate in the middle of the night. Decided to change lanes for no reason, and ended up missing a crumpled car in the middle of the lane I just left. It looked like a professionally crushed car that had fallen off of a truck. No light lenses or reflectors.",
   "created_utc": 1692636593,
   "score": 8,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx4q0gc",
   "message": "Was in a bombing. Knelt down to sign something when the detonation happened. Glass shards were a hair away from killing me. The person who gave me the paper to sign technically saved me, they’re fine too.",
   "created_utc": 1692625621,
   "score": 78,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6fr4l",
   "message": "I’m here today because I woke up late on Sept. 11th and decided not to go into work.",
   "created_utc": 1692648678,
   "score": 94,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx58i7n",
   "message": "Previously I was a biker. I'm sure you all know the risks. One time it was any other day riding to work. I pull up to the lights and check the car next to me. Girl mid 20s on her phone - revved my engine to get her to look at me. She doesn't. She proceeds to go straight on into my lane. \n\nI had planned for this. Half the reason I don't ride now is other people being morons.",
   "created_utc": 1692632826,
   "score": 32,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx5bp92",
   "message": "I was in an accident back in 2008. I was going to college on my motorcycle (pretty common where I come from). It had just ended raining. I was about to overtake a vehicle when a tuktuk came out of nowhere from the street. Hit the break real hard but still rear tyres touched I was in air. That when it dawned on me that it is either my right arm or my head. Chose let my right arm get crushed and saved my skull. Properly healed on 50days. Have trouble writing with my right hand ever as I cannot handle pen properly. Learnt to write with my left hand and went on with my life.",
   "created_utc": 1692634002,
   "score": 142,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx4qa5h",
   "message": "I asked a stranger standing out on the street for weed with my friend on a late night out (I was still a teenager)\n\nStranger told us he was too drunk to drive but his car was parked up the block, if we drove him, he’d take us to where we could get some.\n\nI get in the driver seat, adjust everything, seatbelt check, turn on the car and put it into drive but kept my foot on the break (I didn’t have my license and this was maybe my 4th time ever driving a car)\n\nA white charger pulls up next to us and a guy with a bandana over the lower half of his face runs up to my window and points a gun at me (looked like a revolver, window was closed.) \n\nThat split second felt like a lifetime but I slammed on the gas swerved out of the parallel park job. Stopped at a stop sign at the end of the block (*internal screaming intensifies* Like, why am I stopping at a stop sign rn?)\n\nI keep going, run a couple red lights, made a few turns and parked somewhere I knew was hidden \u0026amp; much safer (this was pretty late at night and basically my home town)\n\nI was a dumb teenager",
   "created_utc": 1692625738,
   "score": 218,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx66jsu",
   "message": "Grabbing a middle schooler's backpack as she was about to cross without looking and staying on the sidewalk instead of crossing the road. (I was in high school at the time)\n\nThe reason?\n\nThe red car that had almost ran me over a few weeks before was barrelling down the street at high speed.\n\nCar zooms past at the moment the kid and myself would have been in the middle of the road.\n\nSame driver. I recognized the shade of blonde hair.",
   "created_utc": 1692645351,
   "score": 150,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx51jkr",
   "message": "Driving 220km/h on the German autobahn when a van moves into the left lane without looking. Thankfully I reacted fast and managed to avoid him.",
   "created_utc": 1692630212,
   "score": 142,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx59ed0",
   "message": "English is not my first language, sorry if I make some mistakes.\n\nMy friend and I were chilling at a skate park. There was a Basketball hoop made out of stone. I was sitting right underneath that hoop. Suddenly I got the urge to stand up, Seconds later this massive thing came crashing down where I sat seconds before. \nI didn't comprehend it in that moment but I often think about it from time to time and a shiver goes down my spine.. my friend was scared as fuck..",
   "created_utc": 1692633152,
   "score": 144,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx55dv4",
   "message": "Driving a friend home in the middle of the night.  We were working at a mine in the middle of the Mojave desert.  He had worked a double so I offered to drive his car.  Doing at least 80 and an oncoming car swerved into our lane and I swerved into their lane and we passed each other in the wrong lanes.  It was just an automatic reaction and we barely missed a head on collision.  Not sure if they were trying to commit suicide or just play chicken, but I'm sure if he had been driving, he was so tired we would have been killed.",
   "created_utc": 1692631665,
   "score": 94,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx5elg9",
   "message": "I was in high school, and driving home from a robotics team party when it felt like instinct took over, and I slammed the brakes from 50 mph. A car plowed through the intersection in front of me, hit a curb, and left with a drunken weave. I realized that if I hadn't stopped, I likely would have gotten hit. At that point I found the nearest parking lot, and had a panic attack for an hour before driving to my parents.",
   "created_utc": 1692635079,
   "score": 155,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx5hox3",
   "message": "When I was in 9th grade I was walking to church on Sunday morning. My friends stopped and asked if I wanted to go riding with them. I thought about going but something stopped me from getting in the car. Later that afternoon 2 of my friends in the car died in an accident.",
   "created_utc": 1692636226,
   "score": 189,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6a973",
   "message": "Fell asleep at the wheel, woke up and corrected my steering without panicking.  \n\nDrowsy driving is just as dangerous as drunk driving. Never again !",
   "created_utc": 1692646696,
   "score": 195,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx5c9bw",
   "message": "I made a horrible decision to intervene in parking lot machine  robbery. \nAs I was at the caged gate of the parking lot he swung his crowbar at me. Somehow I moved in the right way to avoid his strikes. I still don’t know how his crowbar didn’t hit me. He also screamed like a gorilla. But I didn’t die that night. And I was very close to it.  Never felt so stupid and also so relieved he didn’t tag me.  Heroine is bad kids. It will make you a coin robber who almost became a murderer for like 8 dollars in coins.",
   "created_utc": 1692634210,
   "score": 87,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx5ot4j",
   "message": "When I was 9 I loved sleeping in my older brothers water bed upstairs when he decided to live with my dad instead. One cold January night I decided against it for some reason. I ended up sleeping in my own bed downstairs. A massive earthquake hit in the middle of the night and the headboard with tons of shelves on it ended up crashing down onto my brothers water bed. I would have been seriously injured if I had been sleeping in that bed that night!",
   "created_utc": 1692638879,
   "score": 68,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx5pu9n",
   "message": "Happened at a river after pulling an all nighter with a group of friends. Hungover and sleep depraved, while swimming, and without giving it any thought, I swam into a waterfall. I completely underestimated the power of kinetic energy. I went under like a twig and couldn’t get back up. In my panic, I kicked my legs forward and somehow managed to push off the underwater rocks facing the cliff side. Nobody saw anything. I was as good as dead if it wasn’t for that fortuitous move.",
   "created_utc": 1692639261,
   "score": 69,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx5xq2f",
   "message": "I went to ride my bike and almost forgot my helmet, I honestly debated grabbing it since I was only planning on doing a few miles; last minute I decided I might as well have it and then half a mile out I got hit by a car. Helmet was busted as hell but other than a concussion I was fine",
   "created_utc": 1692642125,
   "score": 129,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6g69r",
   "message": "13/14 walking home and it started to storm, storm.  Man in car, that I recognized from neighborhood stopped and asked if I wanted a ride, sure jumped in.  Our house was on a really long hill (back when they built houses into the landscape instead of flattening everything), at a point he should have started slowing down he started accelerating, just opened the door and rolled out onto the asphalt at 30-35.",
   "created_utc": 1692648829,
   "score": 31,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6dxt4",
   "message": "I was caught in a bar brawl. Tumbled to the bottom of a crowd and was pressed to the floor when some psycho was on my back choking me. Couldn't move and couldn't breathe. I thought that was it. I was gonna die on the floor of a New Jersey nightclub. Suddenly I remembered a move my wrestling coach taught us to break grips. I found his thumb, folded it like a fist and squeezed as hard as I could. It cracked like a stick. I could hear him scream in my ear and he hopped off. I pushed up and swung my way out. I was choked so hard that both of my eyes were full blood red, no whites and I cracked a molar. That was a close one and who knows what would have happened if I didn't recall that one random move or if I never wrestled to begin with. Scary.",
   "created_utc": 1692648021,
   "score": 76,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6ddz1",
   "message": "Nowhere near as extreme as some of these, but I used to go for walks in a nature park right behind my neighborhood, usually with headphones. On one such walk, I happened to look down to see the foot I was currently stepping with was about 6 inches from coming down on a diamondback rattlesnake. It was arched back, ready to strike, rattle going, but I couldn't hear it over my music. Leapt back immediately and walked around it without issue, but holy crap, it gets my heart going just thinking about it.",
   "created_utc": 1692647822,
   "score": 53,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6e9la",
   "message": "Step on the brakes for no reason other than a bad feeling in the midle off the street, sudently two Cars racing pass on the next corner with no head lights.",
   "created_utc": 1692648142,
   "score": 28,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx613vu",
   "message": "I was driving on the highway on a dark moonless night. Suddenly with about 30 yards of distance, I saw 4 lines on the road in my headlights. I had about 1 extra second to swerve lanes after I realized it was a FUCKING COW.",
   "created_utc": 1692643362,
   "score": 36,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6wp45",
   "message": "[removed]",
   "created_utc": 1692654956,
   "score": 41,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx5sg99",
   "message": "Deciding to go to A\u0026amp;E over the \"gas pains\" in my abdomen instead of going to sleep (I was already in bed).\n\nAppendix was about to blow by the time the surgeon got to it that same night.\n\nI remembered something specifically about looking out for pain when you lift your left leg, and since healthcare is free here, decided not to chance it despite the symptoms being relatively mild.",
   "created_utc": 1692640214,
   "score": 54,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6ri2e",
   "message": "Not going to see Great White at The Station probably saved my life.",
   "created_utc": 1692652953,
   "score": 26,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx58h4f",
   "message": "When someone had a gun to my my head, i immediately grabbed it. Right after, they pulled the tirgger. Burned my hand and my ear, and couldn't hear shit out my left ear for 4 days. Yeah, they tried it. Will never try again.",
   "created_utc": 1692632815,
   "score": 38,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6ay71",
   "message": "I used to work for a company that manufactured modular oil camps, we worked in shipping, loading semis with the trailer units for them to take up north. The units were stored on cribs in a giant lot and after a lot of rain a couple of the units fell down when the ground got too muddy and the cribs shifted. Me an another labourer had to crawl under one of the units while a forklift had lifted it to grab and reset the cribs. When we were underneath I heard a loud cracking and looked up and the whole trailer was coming down. We scampered out the side right before it crashed to the ground right behind us. Almost became a puddle in the mud.",
   "created_utc": 1692646946,
   "score": 13,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6e5db",
   "message": "Moving to Texas. Changed my whole life. Where I lived I was a fucking mess and now I am thriving more than I ever had in my life.",
   "created_utc": 1692648098,
   "score": 18,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx5y4kp",
   "message": "Not laying down in the back of my mother's car with my head pushed against the door, a couple seconds later whilst we were looking for a parking spot, someone reversed exactly into that door",
   "created_utc": 1692642270,
   "score": 13,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx707rb",
   "message": "Maybe not died but been serious injured and facially disfigured.\n\nRescue dog for some reason freaked out and attacked me. Right before it happened I sat up and gently pushed his face away from mine (he had been whining and trying to lick at my face while I was stretched out on the couch). Some instinct told me to sit up and push his face away and do it now. \nEnded up with a huge hole in my arm and he kept coming trying to take me down. If my husband hadn't been there the dog would have kept going til he got me down and kept me there.",
   "created_utc": 1692656370,
   "score": 30,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx71xi0",
   "message": "When I was in my early 20's I was working with a company laying deep services for new neighborhoods. In the winter, at the end of the day, the laborer crew would spend a few minutes scraping mud off the excavator tracks.\n\nOne day I was in between the two tracks scrapping away mud. Suddenly, my colleagues are shouting (almost screaming) my name. Although I didn't see it, it instantly occurred to me that they would only be that terrified if the excavator was still in motion and I was about to be pinned between the rear counterweight and the track.\n\nI dropped to my knees and rolled away with less than a second to spare. The rear of the excavator swung across where I had just been standing. Had I been any later, I'd have been cut in half.\n\nThe operator had thought we were done. We didn't mention it to anyone... you know how you are at that age.\n\nOnce in a while I still think about it. Scary stuff.",
   "created_utc": 1692657079,
   "score": 16,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7a6i0",
   "message": "I woke up in the middle of the night because of a voice in my head yelling at me, telling me to lock a nearby door. I reluctantly got up, locked the door then fell back asleep immediately. About 30 minutes later somebody tried breaking in.",
   "created_utc": 1692660568,
   "score": 56,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx68nfu",
   "message": "I was driving across an intersection with a hedge blinding my driverside. I pull up a bit, see no cars oncoming, so I cross. Look out the driverside widow to see a truck speeding towards me and will hit. Split second instinct, hit the pedal to the floor. Still got hit in the rear bumper, but had I not floored it, probably would have hit me directly",
   "created_utc": 1692646115,
   "score": 16,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6xoz8",
   "message": "Me and my friend were crossing a tall train bridge in his hometown while mildly intoxicated. We had called his mom to ask when the train went by and she said that one went by daily around noon; it was 4:30ish so we were all set. We got halfway across when we heard the train whistle. The problem was that we were above a river valley so the whistle echoed and we couldn't tell which way it was coming. We ended up scurrying back the way we came and the moment we jumped off onto the embankment, the train barreled around the corner immediately in front of us. If we had chosen to continue across rather than turn back, we wouldn't have made it.",
   "created_utc": 1692655349,
   "score": 21,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7dyhy",
   "message": "Not taking that pill. And then decided to quit all drugs. 🤞🏽🙏🏽 two months sober",
   "created_utc": 1692662176,
   "score": 170,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx5xyma",
   "message": "I don't know if I was in danger, but I was in an unfamiliar city heading back to my hotel a couple blocks away after docking a rental bike. It was late, like 3 AM.\n\nDown a street I'm passing I see, out the corner of my eye, a man sidetackle and flip someone to the ground. She (I think she, maybe it was a high pitched yelp) screamed and cried for help. I am not proud but I just ran immediately, I was worried if he had a knife or a gun. I ran till I turned the next corner and then kind of speed walking was thinking if I should go back or what because what if it was a rape or a murder. I flagged down a campus cop car another block away and told him what I saw and where he said he'd call it in. Went straight back to my hotel another block away.\n\nI'm submitting myself to judgment here because honestly I feel like I did the right thing and that I'm a coward at the same time. I didn't want to leave her but I didn't want to fuck around and potentially die like that. I really hope it wasn't an assault just maybe a robbery or something. I also feel really bad that I don't feel as shaken as I should, if that makes sense?",
   "created_utc": 1692642211,
   "score": 12,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6zoj2",
   "message": "Icy roads in sweden and i was young and thought i was the best driver in the world. My backend slide in a corner and got my car over to meeting line. \nAfter the corner i saw a big semi traveling my way blinking his headlights. \nAs i had a frontdrive car i just floored it and engaged the ebrake to get the backend to slide so the car would turn around. \nI was just feets away from when the my car got grip and slid to my lane.  \nLucky for me i had black undies 😂",
   "created_utc": 1692656151,
   "score": 8,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx74rfr",
   "message": "Ive spent time working in the Philippines, where eveyone drives like shit. In 10 minutes you are likely to be cut off 3 times. Numerous times ive avoided catastrophic accidents by sheer video game reflexes. You have to assume the other drivers around you will make the worst decision possible and prepare for it, because all too often they will.",
   "created_utc": 1692658277,
   "score": 5,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7b5sm",
   "message": "I was carried away by a current while swimming at a beach. The beach was protected by a rock formation but I stupidly swam past it and I was swept away. The rest of the coastline was more or less a sheer rock cliff. I managed to spot a very tiny spot that I could swim ashore to but the waves kept throwing me against rocks that sat just below the surface. I decided to try to swim ashore by grabbing onto the rocks between waves and to hold on for dear life as the waves came over me so that I don't end up like shredded cheese. I managed to get to shore and I later realised that if I hadn't done exactly what I did I'd be dead.",
   "created_utc": 1692660985,
   "score": 14,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6bnck",
   "message": "Well, I dunno if I'd have died but it wouldn't have been a pleasant experience.  The scariest moment I ever had when driving.  I'm on a 4 lane highway, there's a guy running the same speed in the lane next to me.  I see a car going well over the speed limit fast approaching and realize there's no room for him to slow down, there's no shoulder and he's gonna slam into both of us.  I moved over a little to the left, the guy next to me must have come to the same realization and moved a little to the right.  Crazy speeding guy goes right in between us and keeps on going.  It happened in less than a second, but it seemed like slow motion.  Had two people not being checking their mirrors at that exact moment, well it would have been messy.",
   "created_utc": 1692647205,
   "score": 9,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6jkzv",
   "message": "jumped over a  double bars in PE (those things that gymnast use, but like one is higher then the other, it was round about 2 meters), we were suppossed to land on our feet, I did a dive. If I hadn't put my head to the side, but instead either on my chest or \"normal\", I'd have probably broken my neck, but instead it only hurted a bit. 2/10 wouldn't recommend.",
   "created_utc": 1692650045,
   "score": 6,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6fs5d",
   "message": "Do not jump under a running train, standing next to all my relatives who escorted me to another city. I am often haunted by obsessive thoughts",
   "created_utc": 1692648688,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx716uo",
   "message": "I've had a few instances where a split second saved someone else. One time at work, a customer fell down and hit her head badly. I didn't see what had happened, but I felt the air change, what I can only describe as a disturbance in the force. (I don't really have anything better) I turned around just in time to see an ambulance roll up and told everyone around to make way, as they would've been blocking the paramedics from getting the gurney through. Maybe those seconds that I saved meant nothing, but you never know.",
   "created_utc": 1692656772,
   "score": 255,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx6zgm5",
   "message": "Dealing with a psych patient at the hospital that I used to work at he had a pen in his hand, and I was trying to get it from him. As I got closer, it looked like he was about to stab me, but I backed off and my coworker took care of the situation no problem.",
   "created_utc": 1692656061,
   "score": 254,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7cdqd",
   "message": "Penetrate my mothers Egg",
   "created_utc": 1692661500,
   "score": 254,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx70u8r",
   "message": "Get to the hospital during your roommates wedding. Had an aneurysm on my aorta rupture during therapy the reception/dancing. Never got more than a single bit of the prime rib",
   "created_utc": 1692656626,
   "score": 3,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx71jes",
   "message": "Years ago, I parallel parked my car on a busy street in Hollywood where I lived at the time. The street was on a hill and my car was parked on the downhill side of traffic a couple hundred feet from a blind curve in the road. I checked for cars and got out of the driver's side of the car, being careful not to step too far in the street. There were no cars going by at the time. \n\nSuddenly, a voice inside my head shouted \"FREEZE!!! DON'T MOVE!!!\" I instinctually froze and pressed myself up against my car even though I had no idea why. Out of nowhere a large city bus came barreling around the curve going at least 60mph and missed hitting me by just a couple inches. I can still feel the wind from the bus on the back of my neck at it blew past me. If I had taken just half a step back to lock my car door, I would have been flattened and that would have been it. \n\nEven worse, my future husband was with me and would have witnessed it all. It still shakes him up to think about how close he came to losing me that day.",
   "created_utc": 1692656917,
   "score": 7,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx76bxu",
   "message": "I was piloting a small training aircraft, with an instructor (I had full control), when a slightly larger light aircraft flying ahead, but to our far right field of view, seemed to be creeping in a bit too near towards us. The instructor yelled for me to watch out.\n\nI immediately cut the throttle and applied the air brake, just as that aircraft swerved right in front of us, with less than 10 metres clearance.\n\nWas nearly a mid-air collision.\n\nThe instructor had many swearwords for that aircraft and took down details to report them for dangerous flying. He also praised my response and said I was a natural.",
   "created_utc": 1692658943,
   "score": 10,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx76ilj",
   "message": "Pulling back from the kerb an instant before some maniac swerved around a car which had stopped for me at a zebra crossing, without bothering to slow down or check where he was going. Had I not done so, both myself and my dog would have been turned into nothing smears on the pavement.",
   "created_utc": 1692659023,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx76rdq",
   "message": "My first MDMA experience that I was super excited to try because everyone raves about it.  Well, not me - I had such a severe reaction that in a split second I knew I could stay or go.  My poor husband freaked out - he was fine - just me - it was the first and last time.  :)",
   "created_utc": 1692659127,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7781h",
   "message": "Realizing that me being gone would have long-lasting effects on everyone that knew me. \n\nAt the time, I had just returned from living overseas with my parents to being back Stateside living with my brother, who was living with his wife while they were still dating. \n\nThe first month was fine, but then she started to open up about her myriad problems with me. It got to the point where we would constantly be getting into arguments. The problem was, I wasn't working and I was only going to community college--my brother was my only option for housing; he knew that, she didn't. But it then caused them to have arguments frequently.\n\nI would wake up most mornings to listen to her complaining about everything to friends or family over the phone--I was sleeping on their futon in the living room.\n\nOne of these conversations, she made it clear that when they do eventually get engaged that I wouldn't be invited to the wedding. \n\nOne morning, when both my brother and her were out of the house, I went into his closet to find his pistol. I was kneeling there staring at it for a long, long time. My body compelled me to bring the barrel up against my chin. \n\nI never pulled the trigger. I put the gun back where I found it, called my dad in tears. To this day I never told my brother that I was on the verge of suicide because I thought in that moment it would make things better for him to not have to worry about me, anymore.",
   "created_utc": 1692659322,
   "score": 15,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx77gvt",
   "message": "I'm a little ashamed of this one because it shouldn't have even been an issue what with learning this from childhood. But...\n\nAt a university I went to, I'd gone through the day off and on crossing the street without looking both ways. Sometimes, I didn't look at all. Not sure what that was about. A random decision. But during one particular street that I assumed was a one way street even though no signs existed, I was one step from just going forward while my eyes were facing one direction when something made me look the other way. Instinct, intuition, guilt that I knew better? I don't know.\n\nBut I looked in the other direction and my eyes connected with a driver as his car just drove by. And it was like... OH. I had been so close to just waltzing into the street. Would have been a direct hit.\n\nI definitely make sure to look both ways now forever. I don't care if there's a dead end sign or what.",
   "created_utc": 1692659424,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx788ox",
   "message": "Back when I was about 14 or 15 years old I was riding my bike. It was maybe about 8pm and my friend and I were coming back from a festival. \n\nAs we we riding up a hill in the city downtown some kid, maybe 17/18 years old ran up to me and pulled out a gun and put it to my stomach. My friend being scared, rode off… leaving me alone and the kid demanded that I come with him across the street (busy main road), he told me he knew me, which he didn’t and said his boys wanted to speak with me. As I followed this teenager, about 2000 feet, we approached an ally (kind a long ride between houses, just a street and peoples car garages) his buddies openly he door to a old school caddy, they were about 6 or more of them, all strapped with guns.. and a voice in my head said throw your bike in front of you and run like a sob… or they will kill you… so I did exactly that and around the corner was a 24/7 hour donut shop and I called 911 on a pay phone inside. Eventually cops came maybe 1 1/2 hours later, didn’t do anything, but the gang bangers did take my bike. It was a nice BMX. I believe had I not run, they would of shot me. They would not of cared or thought twice about it. We had lots of gangs in our city.\n\nThis happened many years ago, but something I’ll never forget.",
   "created_utc": 1692659747,
   "score": 4,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx794mg",
   "message": "I was driving up a hill, in the left lane. Some asshole driving down the hill going probably 2x as fast as as comes driving down **in** my lane, and swerves out to avoid me. The other asshole following him had less warning and swerved to avoid me by about 1 car length. \n\nI was angry about what happened for about 2 days.",
   "created_utc": 1692660122,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx794nn",
   "message": "My buddy and I were riding our motorcycles on the highway a few years ago. We couldn’t get the Bluetooth in our helmets to connect so we couldn’t communicate. I notice him in my mirror move over to the left lane behind a semi truck. I turned around to look and see why. As soon as I turned back, I saw a mattress right in the middle of my lane. Barely managed to get around it or I definitely would’ve gone airborne going 80 mph.",
   "created_utc": 1692660122,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7d0wz",
   "message": "When I was 14 I was walking to the river with two girlfriends when I stopped to get a pebble out of my shoe. Fortunately the other girls stopped with me because 2 seconds later a vehicle came plowing up onto the sidewalk and slammed into a brick wall just metres from us and EXACTLY where we would have been had we not stopped seconds before. It was wild. We could feel the force of that car hit the wall and there is no way we would have survived. Not sure what happened to the driver tbh.",
   "created_utc": 1692661778,
   "score": 2,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7dvyr",
   "message": "Tractor trailer crashed into cars coming on the northbound side of highway and jumped the median into our southbound lanes.  All cars started slamming their breaks.  I gunned it and it just missed us, slamming into the cars that had stopped.  Don't even know what made me do that, but happy I did.",
   "created_utc": 1692662146,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7e70r",
   "message": "Riding my bike from Uni in the dark, and as I passed a silouhete of a person on the edge of the path, I stood up on the pedals. They struck me with a bat, landing the blow on my biceps. I was able to keep my balance/grip on the bars and ride through it. \n\nStaying seated on that bike would have been my face meeting that bat. Plus, who knows what to follow on tbe ground.",
   "created_utc": 1692662278,
   "score": 11,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7epzd",
   "message": "I was painting in a friend’s mobile home as someone was cutting down trees in the yard. One fell right on the room I was painting in, and a limb stabbed the exact place I had just been standing to wet the paint roller. \n\nWasn’t a split decision as much as dumb luck and good timing. My back would have been skewered for sure.",
   "created_utc": 1692662506,
   "score": 2,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7fgdb",
   "message": "Was driving on a steep downhill 50mph road with a traffic light at the bottom of it in Colorado. Was very icy and I was in a 1992 Toyota Corolla. Wasn’t able to break and there was a line of cars in front of me. Some blacked out combo of braking, accelerating, and ebraking got me into the ditch next to the road rather than going 50mph into a row of stopped cars. Car didn’t survive but I did",
   "created_utc": 1692662822,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7gcwj",
   "message": "Was robbed and grabbed onto the guy as he hopped into a car which then dragged me outside of the car flying down the street. I realized if I didn’t let go I could be killed hitting something on the side of the street.\n\nRock broke when scrambling down from a rock climb and tumbled onto a loose slope, managed to flip around with my pack on anyway lower my center of gravity and grab onto the tiniest baby sapling growing in a crack in the rock and stop myself…\n\nNarrowly avoided a flying shovel on the highway—spotted it way ahead on the ground then saw it launch into the air after a semi ran over it (no joke), realized with a fraction of a second to go it was coming at me through the windshield and ended up doing a 720 off into a ditch. Walked away with a busted door (hit the ground next to my door since I swerved—no one was around) and just had to reseat the tires to get the grass and mud out of them from sliding sideways into the ditch.\n\nMany such cases…",
   "created_utc": 1692663211,
   "score": 5,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7gjwb",
   "message": "It's definitely not as crazy as some of the other replies but asking my partner out for our first date. At the time I was really struggling between a mental health crisis, 2 abusive ex's, family drama, and the list goes on. He doesn't know how incredibly grateful I am for him, without him I certainly wouldn't be alive. Sending that text was the impulsive decision that saved my life.",
   "created_utc": 1692663295,
   "score": 5,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7gp30",
   "message": "My work flew me into Costa Rica (prefer not to specify city) at night and got to my hotel around 7 or 8 pm, and I wanted something to eat as I hadn’t eaten in hours. I remembered seeing a Subway just up the street from my hotel, put my earbuds in and walked to Subway. \n\nGot there and got the sandwich and began walking back to the hotel, when I get a block away and a white van drives up quickly in front of me at a crossing, and this man starts yelling at me in Spanish (I can faintly hear it through my earbuds). \n\nFor a split second I gave myself the choice to stop and figure out what was going on, or to start walking faster around the back of the van and just keep looking forward. I took out one of my earbuds so I could hear better and began walking quickly around the back of the van and could hear a sliding door open while the vans backup lights turn on and it starts to backup. \n\nI started speed walking away and at the last probably 20 feet it would take to get to the hotel I began running. The feeling of trying to remain calm while booking it had started to turn into fear, and once I got into the doors of the hotel I looked back up the street to see the white van speeding off in the opposite direction. \n\nI still don’t know if it was actually what I think it was that was going to happen or if I just misunderstood the situation. Either way, I personally believe that split second changed my life, because normally I’d stop and try to figure out what’s going on in any other situation.",
   "created_utc": 1692663356,
   "score": 11,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7gv3r",
   "message": "10 years ago, my GF was going to San Diego to visit her parents for the weekend.  She asked if I wanted to go, and I quickly declined (her parents were unsubtly racist).  When she was driving south on the I-5, she was hit head-on by a drunk driver.  She swerved and survived only because the angle of the impact smashed the engine block of her car into the passenger seat (where I would've been sitting).",
   "created_utc": 1692663426,
   "score": 5,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7ihfp",
   "message": "I don't know if i can count this as a decision, but that's definetly at least an involuntary one.\n\nI'm a neuropsychology student (still didn't finish for financial reasons). I do know how to prescribe drugs and have a lot of knowledge of psychological drugs, one of those (of course i won't say which one) is really easy to die from overdose and doesn't have an \"antidote\". After a long time with persistent depression, that sometimes it was severe like a (in my country is called \"major depression\", don't know how to call the diagnosis in english) i decided to suicide with a more than necessary overdose of that drug with alcohol.\n\nI didn't want my family to suffer heavily because of this decision, so i've glued 5 pages of instructions on how to make the grief process shorter. Somehow my mom entered the room after i took the meds, and to this day i don't know how and don't remember that i did this, but my i sit on the bed and explain to her to read the paper, and brieflyn explain what was on it. At first she tought i was just drunk (even that almost the bottle was almost full) so she decided to throw the bottle away. Only after realizing that i didn't express a reaction when she was throwing that kinda expensive (for my reality/country) down the pipe she realized that things was really serious. When she returned to the room, i was blacked out. So she called an ambulance, a lot of things happened im the street, i've gotten rescued, desintoxicated and stayed in a 13 days coma.\n\nI don't remember that i sit and explained this things. Even today i can't even believe how i could sit, like, the strenght and will required to do this is incredible. Thinking backwards it's almost magic. Definetly if i wasn't able to sit and talk to her she wouldn't see the paper on the door, would think i was drunk sleeping and leave. But somehow even if i don't remember i wake up and had a comprehensive conversation.",
   "created_utc": 1692664107,
   "score": 7,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7ipsz",
   "message": "I remained perfectly still after shooting a pellet gun. \nThe bullet came back and would have taken my eye out if I moved even a little bit.",
   "created_utc": 1692664206,
   "score": 3,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7iw8z",
   "message": "I was a troublemaker when I was younger. One morning I was standing at my locker, and my friend, who had just got her new car, asked me to sip class and ride around with her. I usually would have, but I just skipped that last day, so I said I couldn't. That day she died, and her sister, who was in the car was paralyzed because the weather was bad. I always look back at the moment and wonder what would have happened if I made the decision I would have normally made.",
   "created_utc": 1692664282,
   "score": 3,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7j35p",
   "message": "I was 9yo and we played on a hockey rink on a lake the day before. At 6am the day after I decided to take a stroll. The lake looked a bit off as far the ice goes and the temperature was much warmer. I had planted my hockey stick in some snow hill and decided to bring it with me. It was very helpful when I went through the ice because my suspicions turned out to be right and I was able to use it like to extract myself from the lake.",
   "created_utc": 1692664364,
   "score": 5,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7jbjx",
   "message": "Driving during a snow storm to tutor a 2nd grader as part of a college outreach program. My cars wheels hit a fresh patch of snow and my car started sliding around and I ended up backwards on the highway facing a schoolbus and behind that an 18-wheeler. I saw there was a guardrail, so I cut the wheel to aim the car towards it while slidong backwards on the highway at about 40mph, and it worked. Avoided an accident. Had I not acted, I would have been crushed by the school bus and the school bus would have been hit by the 18-wheeler.",
   "created_utc": 1692664465,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7l4t0",
   "message": "Almost went to the midnight showing of The Dark Knight in Aurora, Colorado when and where the shooting happened. Changed our minds enroute because a friend called us and we had to turn back and get them.",
   "created_utc": 1692665238,
   "score": 10,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7tb6l",
   "message": "This isn't really a spit decision. But I'm going to go ahead and tell my story.\n\nOne night I decided to go to bed earlier than usual  after playing video games. Later on that night, I heard some gunshots near my window and hit the floor to escape the gunfire. When I got off the ground I noticed a bullet in my doorframe. The bullet trajectory just so happened to cross the area where I play every time late at night. If I didn't decide to bed early that night I probably wouldn't be here to share this tale.",
   "created_utc": 1692668793,
   "score": 5,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7tfb2",
   "message": "10 years old, looking in the trunk of my mom's street parked Honda. I heard tire squealing close behind me. I jumped straight up. Drunk driver slammed into the back of the Honda , then I landed unhurt on the hood of his car.",
   "created_utc": 1692668845,
   "score": 3,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7u17h",
   "message": "Its stories like these thaf make me always trust my gut, even if its something pedantic like shutting my bedroom door as i go down stairs for breakfast. Cause just in case",
   "created_utc": 1692669115,
   "score": 5,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7jmxb",
   "message": "A *lot* of times while driving. \n\nOne time when I was younger, I felt like I was being followed. I ended up breaking into a dead ass sprint. I guess I can’t for sure I wouldn’t be okay, but I’m glad I did it.",
   "created_utc": 1692664598,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7jquy",
   "message": "We were living in New Orleans, in the French quarter, in 2005. I was working for a restaurant for 6 months in the French quarter, Mr. B's bistro. I asked for a raise and they gave me 50 cents. I said please sir I have a dollar raise. They said $0.50 it is. So I said all right, screw that, I'm moving to Utah and going skiing for the winter. We packed up the car and drove up to Utah. When we turned on our TV after connecting cable and saw the French quarter underwater. Hurricane Katrina rolled through and I absolutely would not have left. I would have been one of those poor suckers on top of my roof, getting rescued to go get raped in the Superdome if I'd lived. Over 50 cents, the course of my life changed.",
   "created_utc": 1692664644,
   "score": 4,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7k09s",
   "message": "Letting go of a night light when I was younger that was electrocuting me.  Really felt like I saw my Skeleton. (Was plugging the night light in then all I remember was black and white for like 2 seconds then I let go and I was fine)",
   "created_utc": 1692664757,
   "score": 4,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7k2w2",
   "message": "I was returning from school one winter evening. There was a blizzard and ot was really cold even though I had a scarf and a warm, long coat. When I was like 200 meters from my house, I suddenly felt very warm. I panicked a bit, because the first thing that came to my mind was hypothermia. (In cold environment sudden feeling of warmth is a sign of your body using its last energy reserves to keep you alive a little longer) I thought that just in case it IS hypothermia, I better hurry. I was tired and it's not easy to walk in deep snow, especially with a heavy backpack and briefcase.\n\nAnyway, when I opened the door of my house, I was feeling weak and dizzy and I would faint if I wouldn't force the bloodflow by tightening the muscles in my torso and legs a few times over and over.\n\nI was still exhausted after that and went to sleep right after doing my homework.",
   "created_utc": 1692664788,
   "score": 2,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7kfpe",
   "message": "Deployed to Kandahar air field, Afghanistan in 2011z Just another pt morning, we got to do it on our own because large groups could be seen as a target. Well there’s a perimeter road that goes behind the gun range, and curves back toward the barracks, and that was my usual run route. I was ready to leave, when I had this feeling that I should stay today, and did a workout video instead. About the time that it would have taken me to reach the curve behind the range, it was hit by a mortar. Myself saved myself that day.",
   "created_utc": 1692664940,
   "score": 3,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7kozh",
   "message": "Got out of a car when friends were doing a driveby, they all ended up dying from return fire/car accident fleeing the scene",
   "created_utc": 1692665050,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7l075",
   "message": "Was about 15 was partying with my friend and these 4 girls. Men to women ratio was off so one girl calls her cousin and his friend perfect we are all hanging out drinking smoking listening to music. Someone brings up the idea that they want Dunkin’  one girl was sober so everyone piles in. Something in my gut told me to not get in that car. Two three hours later no one shows back up. Pre cellphone days so I wait awhile figure I got ditched missed out on the fun didn’t think about a crash or anything because the girl who drove them was super responsible ,head on her shoulders ,going places in life. Make my way to a different party have a blast figuring I’ll get back up with my boy either later in the night or that morning. Next day we wake up we’re sitting around making breakfast recovering from the night before. Someone turns the t.v on and BREAKING NEWS Turns out they stopped for smokes and decided that for whatever reason robbing the convenience store is a great idea. As they smashed and grabbed the girls cousin turns around and shoots the clerk KILLS the guy. They all were caught arrested blamed each other. \n\nCousin. LIFE WITHOUT THE POSSIBILITY OF PAROLE \nhis friend. Same as above\nMy friend . 15 years to life \nThe three girls 1 got life ( the driver ) other two 15 years to life. We were all 15,16. My boy JUST got out I’m in my 40’s . But mostly I feel bad for the driver she would have absolutely made the world a better place. Sometimes you need to listen to your gut",
   "created_utc": 1692665184,
   "score": 3,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7lfoo",
   "message": "Driving down interstate around 10pm at night on my way to work. Was behind a semi truck so I moved to the left lane to pass him. Did this on a slight curve to the right in the road between 2 rest stops. As I'm passing the semi I see his brake lights light up which was odd cause the curve wasn't bad for his speed but what I didn't see cause of him was the car coming at us on a two lane divided road. I hit the brakes and swerve to the right lane, dodge the oncoming vehicle, and swerve hard left to get control. I was driving my mother in laws old beat up suv too, I instantly remember how they can roll over doing what I was currently doing. I don't know for sure what I did next but I know I drove into the grass median that divided the interstate. Sat for a few minutes after I stopped to process what just happened in the span of 20 or 30 seconds. People from the rest stop came to check on me as they had seen it happen. Drove home, called work, and went to bed.",
   "created_utc": 1692665365,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7llwl",
   "message": "Picture this, just past midnight on NYE, walking from a remote house on a very remote dirt road to meet someone who was driving out from town to pick me up.\n\nNext to no moonlight with a nearly flat mobile so no torchlight. Walking but could feel the gravel road so knew I was on the road.\n\nA few drinks in of course, so very full bladder.\n\nCould hear some animal approaching....then hear 2 very loud growls...large dogs????\n\nImmediately squatted down and peers. Don't know what came over me.\n\nThen I just stayed down. The animals circled me growling....then they moved on.\n\nI was so scared. Literally squatting there thinking, this is how I die? \n\nPerson that picked me up says did you see those huge pig dogs?\n\nLife drained from me. I am telling you I was lucky I was not mauled to death. They are trained to kill big wild boar.",
   "created_utc": 1692665437,
   "score": 2,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7mkgy",
   "message": "I used to not drive with a seatbelt. One day while leaving the parking lot I stopped and took a second to put my seatbelt on before turning. Right after I got on the road a truck came flying across the intersection (no divider) where I should have been. Ever since then I’ve worn a seatbelt.",
   "created_utc": 1692665848,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7myd4",
   "message": "I work now at McDonalds.. in europe.. so I drive every day like 30 km to work.. usually do “schluss” shifts which means I’m closing.. and because I’m used to the track road and can drive it over 150 km/h while blindfolded i am always driving very fast.. this one time i was just in a different mood.. relaxed.. shift was kind of ok, not exhausting like most of times and i decided to just play some music and drive relaxed.. \n\nwell.. i drove out of the city on my way home and there’s one steep upcoming and then down over on hard right down and like 100 meters to a village ..\n\non that 100 m was a porsche overtaking a truck, which i saw just as a vehicle that is behind that truck.. nope.. It was overtaking.. my instincts made me go offroad (Škoda Superb 3 4x4) trying not to damage my car.. I ended up going offroad on my right side, not hitting anything, almost shitting my pants and remembering just that the time slow down and once i hit the road back again ( we missed so close i could feel the brumling of the engine of the car passing right bettween me and that truck that was heavily breaking) I was ejected on the opposite side of the road where another cars that saw that from behing already slowed down (thank god).. i just braked and didnt think.. hoping i would eventually stop.. i was empty.. and was just sitting there holding my steering wheel for what felt like an eternity, then i remember just backing up, shaking and not having a single thought in my head.. well.. stopped at a bus stop in that village, puked, cried and sat there for a few minutes\n\nIf I drove that evening like i always drive I wouldn’t be posting now..\n\nAnyway.. I’m not sure how to describe my feelings now but I learnt one thing from it.. This thing never happened to me while driving fast.. and I’m not an idiot or recklessly driving one, I always go only as fast as I am 100% sure about mine and my car’s capabilities (It’s not stock) and knowing that I and every other people on the road will make it home safely.. \n\nBUT these things only happened to me while driving below speed limit..",
   "created_utc": 1692666013,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7ngew",
   "message": "When I had just gotten my driver's license I was going to the grocery store. The light I was at had just turned green and I was about to pull out into traffic. I paused momentarily and a large SUV barreled through the intersection. It would have hit me if I had gone through at that moment.",
   "created_utc": 1692666231,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7nx86",
   "message": "Pulled cutaway and then reserve handles in the correct order.",
   "created_utc": 1692666428,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7o543",
   "message": "Wasnt really split second, but my dealer asked me if i wanted to sell his mdma crystals for him, cuz he wasnt moving them and i knew people who bought. I kinda needed the money but I said no and went on my merry way. My dealer was killed that day. He stole the 50Gs and wanted someone else to take the blame.",
   "created_utc": 1692666523,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7ou3z",
   "message": "Semi truck came into oncoming lane on two lane highway right after we passed them.",
   "created_utc": 1692666824,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7p6va",
   "message": "I was driving down a rural back road where the speed limit is 50mph. Coming up to a T intersection, road i was on was straight and no stop. The other road had a stop and was a complete blind corner due to trees. Some idiot in an old beater hatchback runs the stop as I was probably 100 feet away; realizes his mistake and just freezes. Slams on the brakes right in the middle of the road completely perpendicular to me. \n\nI knew I wasn't going to be able to stop in time so either I was going to T bone him on the driver's side, probably killing him or I had to swerve. To the right was a big drop straight into an orchard and boulders so that would have most likely been death for me. I swerved left and into somebody's lawn and eventually into a big ass bush which prevented me from slamming into their living room. \n\nWorst part was that the guy who ran the stop just fled the scene after asking if I was ok. I got a clear picture of his license plate as he was driving away. Called the cops, told them what happened and showed them the picture of his license plate. Didn't matter, they couldn't do anything because they had no proof he caused the accident. Sometimes i wish I had just slammed into him",
   "created_utc": 1692666979,
   "score": 2,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7phpm",
   "message": "I had just gotten off of a graveyard shift.  I was driving home and I stopped at a 4 way stop.  I was the only at the stop.  I looked to my left and noticed that a city bus was travelling a bit too fast. I decided not to drive through the intersection.  That bus realized they were about to run the stop sign and he slammed on his brakes. The bus went slightly sideways before he just drove right through the intersection. I don't know if that would have killed me but I would have been very injured.",
   "created_utc": 1692667111,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7piqr",
   "message": "e_o",
   "created_utc": 1692667123,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7qqvd",
   "message": "choosing to run off the road instead of the car coming at me",
   "created_utc": 1692667654,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7t809",
   "message": "About 11-12 years ago my husband and I got into a fight and ditched me at the bar. I was gonna call a cab but these guys , there was 4 of them, said they’d give me a ride I was in the back seat and in the middle when an overwhelming feeling of deep dread washed over me and a well of panic was setting in and a voice in my head told me “ you need to get out of this car or you’ll die!” I made an excuse that I needed to use the bathroom, like right now or I’m gonna 💩myself !! I didn’t care how it sounded because if they weren’t gonna let me out I was gonna scream bloody murder. Luckily they let me out and I hide until I felt safe enough to come out. I immediately called a cab and arrived home safe and sound. But that really scared me. To this day I still firmly believe if I went with these men I would’ve went missing.",
   "created_utc": 1692668753,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7tlt1",
   "message": "Was helping a friend push his car that had broken down off the road along with another friend and his gf. Needed to catch my breath for a second, decided to fall back a bit to the side and a car suddenly back ends our friend’s car, killing my other friend and his gf. If I hadn’t moved to catch a breather I would’ve definitely been killed too",
   "created_utc": 1692668926,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7tsoh",
   "message": "My daughter and I were driving into town, from the country.  We were approaching an intersection where the cross lane stopped but we didn't.  I saw the car coming down the cross road and thought \"they seem to be a little fast\" and braked (semi-hard) just in case.  The car was absolutely speeding (way faster than 55mph) and blew the stop sign.  I had to slam on my brakes to avoid getting hit.  If I hadn't made my initial slow down, he would have t-boned us at 65+mph directly into my daughter's side of the car. No way she would have survived.\n\n\nHow close I came to for sure her and probably me dying made me sick. Thinking about it still makes me panic.",
   "created_utc": 1692669011,
   "score": 2,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7ubh4",
   "message": "I had a really shitty car and the heat/defrost didn't work.  It was the middle of a snow storm.  The only way I could even see was activating  the windshield cleaner and even then it was a tiny opening to see through.  Drove an hour like that just fine somehow.  We get into town and come to a stop sign.  Both side windows are iced up so can't see out of them.  So I crack my window (that's as far as it would go down) to look out of my side and tell my friend to do the same.  He tells me we're clear.  I start driving through the stop sign and to this day have no idea why I slammed on my break.  Thank goodness I did as a big ass school bus comes flying by.  I was so pissed at my friend for telling me that his side was clear when it was clear he hadn't even looked.",
   "created_utc": 1692669240,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7ugc7",
   "message": "Not going through an intersection when we had a green light. Jackhole ran it speeding right after we would have driven through likely killing my wife and I. Something didn't feel right and I wasn't even fully conscious of him being there. Bizarre but I'm still happy.",
   "created_utc": 1692669300,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7ukuy",
   "message": "Driving down a country road following a friend, he was doing 75, I was following. \nWe had just left a gas station and we were less than a mile from his house. I didn't put my seatbelt on,\na voice in my head told me to put it on so I did. 10 seconds later he hit a car that pulled out in front of him. My 80s truck didn't have good brakes, I slammed into him doing 60+. If it wasn't for that voice I would have probably died.",
   "created_utc": 1692669357,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7v34b",
   "message": "There was a Christmas party across the street from where I was living. My ex and I were going to attend but at the last second as we were walking across the street I got in my car and said I was going to go to a family dinner instead and that he should come with me. He got in the car with me and we argued like crazy the entire drive. As we were leaving I heard a few gun shots close by but honestly, it wasn't uncommon for the area. When we returned home the street was blocked off by police cars and when they let us go home there was a bunch of crime scene tape and blood on the front steps, leading towards the sidewalk.\n\nSomeone had gotten into an argument in front of the door inside the house and as they were opening it to leave, they were shot in the head/torso at around the time my ex and I would have been standing on the other side waiting to be let in. And that door definitely didn't stand a chance against a gun.",
   "created_utc": 1692669580,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7vnse",
   "message": "I was hiking Mt LaConte in TN. Some friends I was with were a bit more active than me and I was slowing my pace but told them I would be fine so they went ahead a bit. As I was going along the path, there was a ledge on a mountain side that was part of the trail that also had hand ropes setup by hikers from what I would assume awhile ago. On this day of the hike, there was black ice in the most random areas and unless you were really looking for them, they were invisible to the eye. Well the ledge was plenty wide but I decided to hold on to the railing anyways. As I started to go around the side my feet slipped on black ice and due to my insane drummer hand grips I was able to keep myself on the mountainside with my feet dangling off the mountain. There was a couple that was hiking as well that I hadn't noticed yet as they were way behind me and the female screamed like she witnessed a murder. They both said they were sure I was a goner.   \n\n\nI never was in a life/death situation like this before I honestly laughed in relief after and became a master of looking for black ice as I finished my hike up and down the mountain. As it didn't stop my passion for hiking, I certainly will be doing my best to go in warmer climate seasons to avoid such a situation again.",
   "created_utc": 1692669837,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7w71l",
   "message": "Driving home from a 12 hour shift in the emergency room. I worked nightshift so I was getting off around seven in the morning. Perhaps I was more exhausted than I had thought and could have missed a redlight, all I remember is a woman cutting across both lanes directly in front of me. As if time had slowed down I watched her jaw drop with coffee in hand. In that slowed moment I had time to look left and see concrete of either a lane or intersection and without missing a beat cocked my car sideways long enough to clear her car and quickly get back into my lane. it all happened so fluidly it barely registered until I got home.  I am pretty sure I ran the light, night shifts shouldn't be 12 hours.",
   "created_utc": 1692670076,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7wxqj",
   "message": "On patrol in Iraq. Decided to change route for no particular reason. Huge IED went off on our usual route.",
   "created_utc": 1692670409,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7xc7s",
   "message": "Turning down the last shot of Bacardi 151",
   "created_utc": 1692670593,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx7y9mb",
   "message": "Pulling into a gas station instead of going straight home.",
   "created_utc": 1692671009,
   "score": 1,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx83w2q",
   "message": "I wouldn't have died, but my mom would've. Last year my mom had this problem where she didn't pee for 3 days. She didn't make a big deal about it until she mentioned it to one of our coworkers. We work with special needs children so we work with nurses every day. The coworker had mentioned that it is not normal or good and we should schedule an emergency appointment with her PCP. There was an availability that day around 2, it was currently around 10-11 so she took a small nap. After the nap she was a complete ragdoll, I mean 100% body weight. She could barely talk, on the drive to the doctor's office she got worse just mumbling and raising her eyebrows. Thank fucking God the nearest hospital is LITERALLY across the street from her PCP, so all I had to do was turn right instead of left. She was admitted right away and after a day or so she was put on dialysis. She isn't permanently on it, she only needed it for a few days. I think like 3-4 days, but the doctors at the hospital said that if I didn't take her to the hospital she'd be dead.",
   "created_utc": 1692673634,
   "score": 6,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx855n8",
   "message": "I got a couple, but I'll go for the biggest one.\n\nFell snowboarding, and had a splitting 'migraine' the next day. Went to the GP, deciding after a night without sleep it was worth the early phonecall and appointment. He took one look at me and proceeded to give me a course of oral steroids and schedule an MRI. I was completely dissociated, just kinda thought maybe he was looking to see if I'd twinged my neck.\n\nDamage **at C1**. For context, C1 is your first vertebrae at the base of your skull and by damage I'm referring to spinal cord damage. A very small lesion and some swelling which was now being treated by the oral steroids course. After the course, another MRI showed the area of damage more clearly - I also now had a severe movement disorder, and minor issues with my breathing alongside chronic neuroinflammation which would eventually result in another lesion (C5/6) that hit 4 years later, paralysing me.\n\nBUT if my GP hadn't seen fit to prescribe outside of his remit and give me those initial steroids there is no telling if that C1 lesion could have enlarged and just straight up killed me at 21. My neurologist tells me that he did possibly save my life that day.",
   "created_utc": 1692674262,
   "score": 3,
   "submission_id": "15x7yn4"
  },
  {
   "comment_id": "jx699ms",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15x7yn4"
  }
 ]
}