{
 "submission_id": "15x7qok",
 "title": "What are you tired of Redditors whining about?",
 "selftext": "",
 "created_utc": 1692624600,
 "permalink": "/r/AskReddit/comments/15x7qok/what_are_you_tired_of_redditors_whining_about/",
 "score": 130,
 "url": "https://www.reddit.com/r/AskReddit/comments/15x7qok/what_are_you_tired_of_redditors_whining_about/",
 "comments": [
  {
   "comment_id": "jx4o8ka",
   "message": "Their inability to cope with literally anything.",
   "created_utc": 1692624849,
   "score": 25,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4pv45",
   "message": "Things the average “capable” human can keep to them selves and not make a big deal about",
   "created_utc": 1692625556,
   "score": 133,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4omgm",
   "message": "Is there something specific? I thought Redditors whine about everything.",
   "created_utc": 1692625019,
   "score": 106,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4o0ih",
   "message": "Stuff being overrated or underrated.",
   "created_utc": 1692624750,
   "score": 82,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4sevu",
   "message": "Posts that are written with the slightest bit of ambiguity, leading to the redditors posting their 'quirky' misreading. \n\n\"Did anyone else read this as....\" \n\nI don't care about your journey reading through an eight word sentence.",
   "created_utc": 1692626633,
   "score": 80,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4ogua",
   "message": "Other social media platforms (facebook especially). Redditors like to think they're so much better than people who use Facebook or tiktok but it's all just different displays of the same shit.",
   "created_utc": 1692624949,
   "score": 45,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx546mt",
   "message": "My God the Linus tech tips bullshit. You'd think they put Activision/Blizzard to shame.",
   "created_utc": 1692631219,
   "score": 19,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5j9dh",
   "message": "The Kardashians. If you really want them to become irrelevant then stop bringing them up at every opportunity 😭 \n\n(I have just realised that I've become who I despise though. Fuck.)",
   "created_utc": 1692636808,
   "score": 15,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx573bk",
   "message": "USA bad. Other countries good.",
   "created_utc": 1692632301,
   "score": 103,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4ub6t",
   "message": "How \"society doesn't help \\[x\\]\" when the reality is they don't even bother to help themselves.",
   "created_utc": 1692627408,
   "score": 45,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx59cks",
   "message": "America.",
   "created_utc": 1692633133,
   "score": 23,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5no5u",
   "message": "Always questioning if they're ugly. Every time I see the subreddit of amiugly, the people on there are clearly attractive and I'm sick and tired of them thinking that they are ugly just because people don't want to talk to them, date them, sit next to them, etc. To all of you who post on said subreddit, no, you are not ugly you are very attractive. Please stop thinking that you're ugly.",
   "created_utc": 1692638461,
   "score": 10,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5xpu7",
   "message": "How the baby boomers screwed them over, and rose-colored glasses when it comes to the so-called \"greatest generation.\"\n\nFirst off, all the shit that people are complaining about was set in motion by the \"Greatest\" generation in the 70s and 80s. Ronald Reagan was not a baby boomer. People need to stop pretending all of the generation that fought in World War II were progressive liberals who loved FDR. The reason things were great in the 50s and 60s and sucked afterwards is pretty much solely because we were an ocean away from where World War II was actually happening. When the dust settled and the war was over, we were pretty much the only country with significant manufacturing capacity left. Our economy skyrocketed and companies were paying union wages because we had pretty much *no competition* in the global market. That all changed in the 70s which was a decade of shit all going wrong at once. When a company has a choice of paying union wages in a rich country or paying starvation wages in a poor one, they're going to pick the latter.  Not saying that there weren't Boomers who did harmful shit to our long-term economic health but it was not solely boomers and it was not all boomers, which leads me to my next point:\n\nNo generation is a monolith. Your anecdotal experience with people of a certain generation does not mean that's the reality of the situation. That applies to when people want to talk shit about Millenials or Boomers, or even Gen Z.\n\nEverybody needs to just stop this \"_____ generation ruined everything!\" talk. It's simplistic, it's lazy, and it's wrong. We'd be a lot better off if people didn't try to reduce every complex issue down to a single, simple cause.",
   "created_utc": 1692642123,
   "score": 9,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5kdwr",
   "message": "Whining about how this world is fucked. \n\nWe get it. Stop it and go enjoy what life does have to offer.",
   "created_utc": 1692637226,
   "score": 19,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5qyan",
   "message": "Life is tough, fucking deal with it. Staying inside bitching about whatever it is you’re bitching about will not solve the problem. \n\nNo words ever solved a problem.",
   "created_utc": 1692639668,
   "score": 18,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5ryay",
   "message": "The Reddit API changes.  You would think that there was a military coup that installed fascism in their country the way Redditors talk about it.",
   "created_utc": 1692640032,
   "score": 18,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4om6f",
   "message": "Bitching about any other platform that is not Reddit, seeing themselves as someone better than those pleb Tiktoker or Instagram people.",
   "created_utc": 1692625015,
   "score": 37,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4q18f",
   "message": "Literally everything. A group of Redditors is always waiting to bitch about something.",
   "created_utc": 1692625630,
   "score": 20,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx58bru",
   "message": "Hollywood. \n\nIt really isn’t that deep, and it really isn’t that devilish, fantastical, or whimsical. \n\nIt’s just an industry full of working professionals, some of which are passionate about their work and some who just found a job that they could tolerate…much like the rest of society.",
   "created_utc": 1692632760,
   "score": 19,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5ab3f",
   "message": "Politics, no need to elaborate further",
   "created_utc": 1692633487,
   "score": 15,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4yynn",
   "message": "Sand.",
   "created_utc": 1692629228,
   "score": 7,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4qa0s",
   "message": "Things that are offensive.",
   "created_utc": 1692625736,
   "score": 41,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4qg7e",
   "message": "When they go to McDonalds or any food place repeatedly, **knowing** they can't stand the food, prices are too high etc. then moaning bitterly about it! \n\nIf the place is so bad then why do you repeatedly go?!",
   "created_utc": 1692625808,
   "score": 19,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5q8j0",
   "message": "True unpopular opinion: Men’s rights. And I’m a man.\n\nEvery time I see a post complaining about men’s rights or that men’s rights aren’t taken seriously, I can’t help but roll my eyes. Few things with this. One, it almost always sounds disingenuous like they’re trying to diminish the rights of other’s instead of uplifting men. They always compare it to the progress of women and LGBTQ+ rights Ike those groups didn’t scratch and claw for those rights. Men should be much more concerned with calling out misogyny, homophobia, and sexual assault in their friend group. Our rights are fine and very well protect in every corner of the earth.",
   "created_utc": 1692639405,
   "score": 15,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4qoyf",
   "message": "Trump.. like pls stop enough",
   "created_utc": 1692625910,
   "score": 54,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4qfsd",
   "message": "Religion with Christianity/ Catholicism and Islam in specific",
   "created_utc": 1692625803,
   "score": 24,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx50ag2",
   "message": "The idea of being a Landlord.",
   "created_utc": 1692629734,
   "score": 25,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx50fi0",
   "message": "Being blocked after they were being assholes. What did they think was gonna happen?",
   "created_utc": 1692629787,
   "score": 6,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5d01f",
   "message": "jobs/work; get new one!!",
   "created_utc": 1692634488,
   "score": 6,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4x8gq",
   "message": "Capitalism, while also whining about wanting communism or socialism without realizing that neither of them have ever truly worked out.",
   "created_utc": 1692628559,
   "score": 42,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4oqsc",
   "message": "The same questions being asked on askreddit repeatedly, like y’all could just not engage with things you don’t find interesting.\n\nI think there’s still value in a lot of them because you rarely get the same people responding to the same questions with the same answers, generating the same discussions.",
   "created_utc": 1692625071,
   "score": 14,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx57act",
   "message": "Trump. I get it, I don’t like him either. We all agree, so just shut up about it.",
   "created_utc": 1692632372,
   "score": 14,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx58z89",
   "message": "Whining about redditors whining.",
   "created_utc": 1692632999,
   "score": 10,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4p3xo",
   "message": "Pineapple on pizza (It’s really good, btw)",
   "created_utc": 1692625229,
   "score": 26,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5aug9",
   "message": "Being broke. You'd think everyone on this site went to Harvard and got a doctorate in something useful and just can't find a job and are living paycheck to paycheck with a bazillion dollars in debt.",
   "created_utc": 1692633686,
   "score": 7,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4oe09",
   "message": "Reddit, like no one is forcing you to be on the platform. If you don't like it, don't use it. I don't have a Facebook or Twitter (x) whatever account and I never bitch about them because I don't use them.",
   "created_utc": 1692624916,
   "score": 10,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5a9kd",
   "message": "It’s been awhile but the BS of the third party apps, and subreddits shutting down.",
   "created_utc": 1692633471,
   "score": 5,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5e2zu",
   "message": "Tipping. From both sides.",
   "created_utc": 1692634889,
   "score": 3,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5l88t",
   "message": "When Redditors whine about being single.\n\nyet, they don't even attempt to go out with someone, and just expect women to walk up to them, instead.",
   "created_utc": 1692637547,
   "score": 3,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx670u7",
   "message": "Circumcision. At this point, what's done is done. I don't know what else to tell you. Take out your seething rage on your parents or shut up.",
   "created_utc": 1692645525,
   "score": 3,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5af1l",
   "message": "Rich people. I promise you your life doesn't suck because some random dude owns a Ferrari",
   "created_utc": 1692633527,
   "score": 9,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4yhvf",
   "message": "Was reading about someone complain about their dad having rules for moving back home after the guy dropped out of college.  One of the rules was the son had to attend church twice a month.  Some people acted like going to church twice a month was oppressive and forcing their religion on someone.  I just thought \"really people?  The dad is trying to help him out and twice a month he would have to go sit for an hour and listen to someone talk?  That's super oppressive?\".\n\n\n\nThe kid was getting a great deal but it just stunned me how ungrateful some people are.  I don't attend church myself but if I was in that situation I wouldn't bemoan the fact I have to get up 2 Sunday's a month.  If sitting in a pew for an hour is so oppressive then I don't know how you deal with the world.",
   "created_utc": 1692629049,
   "score": 19,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4o0c3",
   "message": "The US and China",
   "created_utc": 1692624748,
   "score": 4,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5825a",
   "message": "blaming social media for every conceivable problem",
   "created_utc": 1692632660,
   "score": 4,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx52uub",
   "message": "Parents freaking out because someone touched their baby. Seriously?  There’s so many other things to concern yourself about.",
   "created_utc": 1692630714,
   "score": 6,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx52gs0",
   "message": "Reviewers not agreeing with their personal opinion.",
   "created_utc": 1692630563,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5dlau",
   "message": "Charitable acts recorded. It’s the same as wealthy people who donate to get a placard. Sure. They get attention for it. Who cares? Half the people whining aren’t donating at all. And the ones who are donating anonymously, I’d like to ask them what they’d prefer: good deeds done on video, or that same good deed never done at all?",
   "created_utc": 1692634707,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5eu3v",
   "message": "Mods",
   "created_utc": 1692635167,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5f5r9",
   "message": "Circumcision (in general, not on children, which i think many of us know is wrong), people being fat, men having it much harder these days (i'm a man, i get it)",
   "created_utc": 1692635289,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5fgu1",
   "message": "Streaming services. You don’t have to subscribe to all of them. Pick one or two and just be ok with not seeing everything.",
   "created_utc": 1692635403,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5h0yu",
   "message": "TBH all of these order of operations posts.  We get it, not everyone learned OOO or PEMDAS.",
   "created_utc": 1692635980,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5jb5j",
   "message": "Women",
   "created_utc": 1692636826,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5r4jf",
   "message": "Tipping culture",
   "created_utc": 1692639731,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5saf0",
   "message": "Religion. Get over it. I realize that most Redditors are in their 20’s or younger so are still feeling the effects of religious upbringing. The fact is that all religions have exactly the same amount of proof that their version of God exists, which is exactly zero. You don’t need to have an existential crisis over fairy tales. Just get over it and live your life",
   "created_utc": 1692640155,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5xy2n",
   "message": "Fat people.",
   "created_utc": 1692642206,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4rxaz",
   "message": "Atheism, Cheating, the US,",
   "created_utc": 1692626427,
   "score": 6,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4yr11",
   "message": "How saying anything non-negative about Russians is you literally being a Kremlin agent 😀 mf most of you haven’t even seen a Russian outside of social media videos 😀",
   "created_utc": 1692629147,
   "score": 4,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4nviv",
   "message": "Other people wearing shoes indoors in their own homes.  What's it to ya?!",
   "created_utc": 1692624688,
   "score": 6,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4sj96",
   "message": "Spez. Fucking spez",
   "created_utc": 1692626684,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5wt3t",
   "message": "Fat people. I’m tired of seeing posts about how fat people are gross, unattractive, a scourge on society, etc. I get enough hate in the wild for being fat, I really don’t need unimaginative, hateful rants filling my online spaces too.",
   "created_utc": 1692641793,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4o324",
   "message": "Incel shit like the red pill, \"mens rights\", all that shit.",
   "created_utc": 1692624781,
   "score": 10,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4r1f5",
   "message": "Increased cost of living. Complaining won’t help as there are market forces beyond your control. Just do your best to adapt.\n\nLower your cost of living or get a higher paying job.\n\nEdit to add : ok let the downvotes come. U know u are the only one who can and is responsible to overcome this. Good luck.",
   "created_utc": 1692626056,
   "score": 7,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4wdps",
   "message": "Everybody in they pussy when someone speaks facts or an unpopular opinion",
   "created_utc": 1692628225,
   "score": 4,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5gvy4",
   "message": "Work pizza parties. Seriously, you're getting a free meal, quit finding a way to make it a bad thing.",
   "created_utc": 1692635928,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5agch",
   "message": "All of the common themes, all of the things that are pushed on this site are completely backwards, and utterly wrong. \n\nPeople here are incredibly hateful, but try to wrap it up in self righteousness. But they're not right. They're deluded. \n\nIt seems anything that makes people happy they hate, and anything about suffering they love.",
   "created_utc": 1692633541,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx54en9",
   "message": "Reddit. Not the polocies or the company. The users. There's more than one. Stop complaining about reddit as though it's a single fat dude sweating in his mom's basement. You are reddit as long as you engage here. If you don't like it, there are several other options for social media.",
   "created_utc": 1692631302,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5s34y",
   "message": "Genders, sexualities...pronouns.",
   "created_utc": 1692640081,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5d0gp",
   "message": "Cheating.\n\nFrankly if the mere mention of the word in a discussion sends you into a frenzy you need professional help and attacking everyone else on reddit wont solve your imo severe issues",
   "created_utc": 1692634492,
   "score": 2,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5d4kt",
   "message": "they angry about trans n there spaces; it is 2023 move on",
   "created_utc": 1692634535,
   "score": 3,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4rh3c",
   "message": "They need to stop bitching about January 6. The \"coup\" failed, Trump is no longer president, almost everyone involved are in jail, can we stop talking about it as if it's the worst thing ever happened in American history?",
   "created_utc": 1692626239,
   "score": 1,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx57y0y",
   "message": "How none of them can be honest with themselves and know they are the AH, and other redditors seem to want to be PC and tell them they aren't.",
   "created_utc": 1692632618,
   "score": 1,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5c24i",
   "message": "Republicans",
   "created_utc": 1692634134,
   "score": 1,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5kfxz",
   "message": "Not wanting to work..   or accept the fact they are an actual specific gender, physically.",
   "created_utc": 1692637248,
   "score": 1,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx599zw",
   "message": "Probably gonna get massively downvoted, but here goes: Third party apps. I get what happened wasn't fair, but oh my fucking god it was as if it was the end of the world.",
   "created_utc": 1692633107,
   "score": 1,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx58a0n",
   "message": "Politics",
   "created_utc": 1692632742,
   "score": 1,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5drjc",
   "message": "Being hot and unable to get a date",
   "created_utc": 1692634771,
   "score": 1,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5f0gb",
   "message": "Work pizza parties. Seriously, you're getting a free meal, quit finding a way to make it a bad thing.",
   "created_utc": 1692635235,
   "score": 1,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4zhsd",
   "message": "Women",
   "created_utc": 1692629431,
   "score": 0,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5c5gf",
   "message": "How bad the USA is. Try living in a communist regime like North Korea. People don’t realize what they have",
   "created_utc": 1692634170,
   "score": 0,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4sdqb",
   "message": "Almost everything. Contemplating closing the account. Everyone is offended. I don’t come from a place where everyone wins, everyone gets a participation trophy. People are becoming so weak.",
   "created_utc": 1692626620,
   "score": 254,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4qbx3",
   "message": "People not supporting lgbtq, we’re allowed to have our own opinions",
   "created_utc": 1692625759,
   "score": 240,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5kthx",
   "message": "The other day I was reading a post on how people wanted to be able to cover anyone they want, under their medical insurance.\n\nIn other words, I can have a job that should insure myself, my immediate family, and nephews and nieces and grandparents and parents. Anyone I see fit because after all \"*who decides what family means*?\". Lol\n\nThey're really are lots of people who have no idea that money is real and if you have a small amount of people paying into medical insurance but 20 times pulling out, it won't work. It blows my mind that there are people who don't understand how this won't work",
   "created_utc": 1692637392,
   "score": 0,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx58ibv",
   "message": "Why do they feel the need to whine about cheating all the time?",
   "created_utc": 1692632828,
   "score": 255,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5i4o1",
   "message": "I always find it strange how Americans will simp and white knight for their country. There are commenters in here who are saying they are tired of hearing redditors making fun of the USA. Are you fucking her? Is the USA your mom? Why the fuck are you getting offended when someone correctly points out that the USA is a shithole??",
   "created_utc": 1692636388,
   "score": 253,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5dgpo",
   "message": "America. Most of us don’t live there and couldn’t care less about front page posts about American internicene quabbles.",
   "created_utc": 1692634659,
   "score": 0,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx5ijua",
   "message": "The heat.  Yep, it does get hot in the summer.  Pretty much every year.",
   "created_utc": 1692636544,
   "score": 0,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx63v10",
   "message": "Everything that they can’t afford being terrible. So many things like “who would want to drive a BMW when my 1994 Toyota carola gets you there just as good” “why buy a $30 bottle of wine when a $12 Mickey of vodka gets you just as drunk” “why spend $50 for a meal at a nice restaurant when I can make that meal at home”. The sour grapes fallacy runs strong in the Reddit hive mind.",
   "created_utc": 1692644366,
   "score": 0,
   "submission_id": "15x7qok"
  },
  {
   "comment_id": "jx4nrsh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15x7qok"
  }
 ]
}