{
 "submission_id": "15x9bia",
 "title": "what is propaganda but people don't seem to realise is propaganda?",
 "selftext": "",
 "created_utc": 1692628218,
 "permalink": "/r/AskReddit/comments/15x9bia/what_is_propaganda_but_people_dont_seem_to/",
 "score": 6,
 "url": "https://www.reddit.com/r/AskReddit/comments/15x9bia/what_is_propaganda_but_people_dont_seem_to/",
 "comments": [
  {
   "comment_id": "jx5su7e",
   "message": "Things you agree with can still be propaganda. Critical analysis is needed to understand whether something is being presently accurately or sprinkling something wrong among a lot of facts. Even if something's all factual there can be sensationalized testimony or appeals to emotion that try to make it more compelling.\n\nThis isn't necessarily *bad*. At the end of the day people want to convince others. But whenever you see an ad, ask yourself why and how they're reaching out to you.",
   "created_utc": 1692640353,
   "score": 225,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx4y0us",
   "message": "Any movie that's made with the 'cooperation' of the US Military.",
   "created_utc": 1692628867,
   "score": 91,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5qaim",
   "message": "Internet memes, especially any that are political or reference culture war nonsense.  \n\nThey're deliberately created by people who are trying to manipulate their audience into feeling or thinking a certain way.",
   "created_utc": 1692639425,
   "score": 208,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5wdol",
   "message": "A lot of apparently vapid or mildly interesting shit you see on YouTube, TikTok, Facebook, Instagram, and oh yes, Reddit. Sometimes even the comments.",
   "created_utc": 1692641639,
   "score": 235,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx58i05",
   "message": "**Air Shows!**\n\nI remember going to air shows with my dad when I was young.  I loved seeing the Blue Angels, Thunderbirds, and all the military aircraft they flew in for static displays.\n\nI remember asking dad, why does the government/military spend so much on these things?  They're just entertainment.\n\nThen he told me that these shows are very big recruitment tools.  They also encourage patriotism and pride in the US military.",
   "created_utc": 1692632824,
   "score": 142,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx52x1a",
   "message": "If you follow politics you are the subject of propaganda, both by your party and the opposing parties.",
   "created_utc": 1692630738,
   "score": 180,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6021t",
   "message": "Pizza parties the manager throws",
   "created_utc": 1692642976,
   "score": 167,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6dx6c",
   "message": "Saying the pledge of allegiance in US schools every day",
   "created_utc": 1692648014,
   "score": 144,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5307u",
   "message": "When the news regurgitates some government official's comment or press release uncritically",
   "created_utc": 1692630771,
   "score": 102,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5x36w",
   "message": "Law \u0026amp; Order",
   "created_utc": 1692641894,
   "score": 101,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx52c17",
   "message": "\"the war on \\[insert here\\]\" Drugs, Christmas, whatever..",
   "created_utc": 1692630512,
   "score": 155,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5mu43",
   "message": "Those 80's cartoons everyone is so nostalgic for? He-man? Thundercats? Transformers? GI Joe?\n\nThey were 20 minutes toy commercials, with a message slapped just to comply with Broadcast standards and regulations, but they were blatantly creating brand awareness of plastic crap.",
   "created_utc": 1692638152,
   "score": 173,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6atwn",
   "message": "Most of everything posted in r/conspiracy",
   "created_utc": 1692646903,
   "score": 21,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5xzwo",
   "message": "Certain video games, or at least the Modern Warfare franchise.  Activision has a weird amount of former national security officials in high positions.  There are also interesting choices, like how they put the infamous “Highway of Death” (when the US destroyed the retreating Iraqi military convoy during the Gulf War) in one of their games…but blamed it on Russia.  Also, in MW2, you start out guiding a missile strike on an Iranian general named “Gabroni” who looks suspiciously like Suleimaini (excuse the horrible spelling) that we assassinated during the Trump administration.  In the game, Russia is supporting Iran (believable enough) who is turn supporting “Al-Qatala,” an obvious reference to Al Qaeda.  It’s almost a throwback to the speech W. Bush gave in which he dubbed North Korea, Iraq and Iran the “Axis of Evil,” as if they were working together in conjunction with Al Qaeda.",
   "created_utc": 1692642224,
   "score": 19,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5yndx",
   "message": "“Yvan Eht Nioj”",
   "created_utc": 1692642458,
   "score": 54,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx65z1j",
   "message": "“Breakfast is the most important meal of the day” -Cereal companies",
   "created_utc": 1692645139,
   "score": 51,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx50br8",
   "message": "Honoring military personel at pretty much anything (especially baseball/football, although they said they stopped this practice in 2016).\n\nThe pentagon has a large budget for 'enticing' public displays of support for the troops, honoring wounded soldiers / decorated veterans, etc. Major sports leagues (especially baseball/football) and the military got put through the ringer in 2015 when they found tens of millions in sponsored 'tributes', but when one avenue closes, another opens.\n\nIf you are seeing something at an amusement park, or a concert/venue, or pretty much anywhere, there is a decent chance that the 'we love the troops' message was paid for by.... the troops.",
   "created_utc": 1692629748,
   "score": 197,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx4z0iy",
   "message": "Any suggestion that working-class people are competing against one another for super-limited government resources.\n\nThe only competition is the vast majority of Americans against the very few ultraelite that are hoarding all the wealth.",
   "created_utc": 1692629248,
   "score": 26,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5plvd",
   "message": "Any video of a cop playing basketball with an inner city kid.",
   "created_utc": 1692639175,
   "score": 210,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx4wuc4",
   "message": "Movies like Top Gun",
   "created_utc": 1692628405,
   "score": 186,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6io3s",
   "message": "Political memes on social media.  \n\n90% of the time the point meme thinks it's making doesn't actually hold up under scrutiny.  The person composing the meme doesn't care.  They just want to get their funny dunk in on on their opponent.",
   "created_utc": 1692649719,
   "score": 10,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5i2lb",
   "message": "The idea that hard work or working long hours is inherently virtuous.",
   "created_utc": 1692636367,
   "score": 111,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6npl6",
   "message": "Nutrition education, at least in the United States.\n\nMost schools, even the well-funded ones, don't have a budget for teaching proper nutrition. So they rely on materials provided by the food industry, notably the dairy and meat producers. Which, surprise surprise, teach children to eat a lot of dairy and meat. In some places, it get so bad that people literally pin their identity on eating meat. If you suggest that they don't need meat for *every* meal, they act like you suggested they castrate themselves to fight climate change.\n\nAnd if the schools don't teach children even the industry biased stuff, mainstream culture will. More is more and more is better and vegetables are for weak-wristed hippies. Even the USDA isn't innocent; you can tell what we're having a surplus of because suddenly scientists have realized you should be eating more of it (eggs are a pretty great example; they're bad for you or good for you depending on how many the poultry farmers of America have been producing recently).\n\nThis is to say nothing of the *massive* disruption of our food culture in the mid-20th century. Suddenly everything was canned or frozen, and the housewife was more concerned with making simple dinners her children would eat. Put everything in gelatin because this formerly-rich person food is now within middle class reach. Don't make anything too 'ethnic' or the neighbors will talk. The liberation of white middle class women from the kitchen meant a lot of families just straight up forgot how to cook. Cooking became Hamburger Helper, Kraft Dinner, and other things out of a box or a can. And cooking is *still* gendered, with a lot of men assuming it's not their job to literally know how to nourish and feed themselves and their families.\n\nThe truth is, most people with sedentary or low physical activity jobs should be eating 1,800-2,200 calories a day, and most of those should come from whole grains, beans, vegetables, and fruit. Most meat consumed should be poultry or fish, and only a few times a week. Red meat should be rare. Sugar should be even rarer. High fructose corn syrup is the devil and should be banished to the lowest rung of Hell. But eating that way is a direct contradiction of our Capitalist Values, so people scream and cry at any suggestion to eat less, eat less meat, and eat less processed foods.",
   "created_utc": 1692651538,
   "score": 20,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx4wuzo",
   "message": "\"He gets us.\"\n\n100% scumbag red-hat propaganda.",
   "created_utc": 1692628413,
   "score": 42,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx4ztgb",
   "message": "You don't really think the information we are getting in the west on the conflict in Ukraine is unbiased I hope? \n\nIt's not as bad as the propaganda back in Russia, but it's certainly not neutral.",
   "created_utc": 1692629555,
   "score": 163,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx546gn",
   "message": "Most 24 hour news channels. Some more so than others.",
   "created_utc": 1692631217,
   "score": 38,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx4x141",
   "message": "Any movie that's glorifying the US military. They are literally paid for in part by the US Army marketing department.",
   "created_utc": 1692628481,
   "score": 49,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx4yw4y",
   "message": "Hallmark Movies (iirc some publication did an expose on this, and it's even funded as propaganda) and Copaganda",
   "created_utc": 1692629202,
   "score": 33,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5uwo7",
   "message": "Most, if not all, major financial magazines and newspapers.",
   "created_utc": 1692641103,
   "score": 13,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx65vny",
   "message": "Fuck tonne of movies. That Sniper biopic starring Bradley Cooper, how is that not the movie from Inglorious Basterds?",
   "created_utc": 1692645105,
   "score": 15,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6fgzj",
   "message": "Commercials any kind of TV or even internet commercial is propaganda if you understand what the definition is. Everyone reading this post should look up the word in the dictionary and be surprised how broad it is it does not just apply to the military. The military is obvious, the question was what do people not realize is propaganda?..",
   "created_utc": 1692648577,
   "score": 5,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6h5kk",
   "message": "Those idyllic YouTube videos of \"village life\" where it's just two or three people in immaculate clothes and hair doing a whole harvest worth of work. Somehow they get millions of views and people fall for it hard. It's obvious they are produced with good cameras and lighting, costumes, actors and when you look where they are from it is usually China or Azerbaijan, both dictatorships that don't allow communication with the \"Western world\" like that. People there are suffering and don't have access to Internet. Somehow everyone believes that they can do all this work, film immaculate scenes, edit the whole thing and do it weekly. Blows my mind",
   "created_utc": 1692649183,
   "score": 6,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx563lz",
   "message": "A shitload of movies about the US military and police.",
   "created_utc": 1692631935,
   "score": 19,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5zn5w",
   "message": "Anything created by the American Dairy Association such as generic milk commercials or pro-dairy literature in doctors offices.",
   "created_utc": 1692642824,
   "score": 20,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5nmmg",
   "message": "A lot of mine have been said. But taking a similar route and saying many US Holidays.\n\nBetween Memorial Day, Flag Day, Independence Day, and Labor Day (which somehow became another patriotic holiday) It encourages people to leave up their decorations all summer. More than 3 straight months of weirdo nationalism exactly when kids are out of school and families can spend more time together. How convenient.",
   "created_utc": 1692638445,
   "score": 26,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx671jq",
   "message": "The Call of Duty series of video games.",
   "created_utc": 1692645532,
   "score": 5,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx4xpm4",
   "message": "National anthems, as well as the US \"pledge of alligence\"",
   "created_utc": 1692628743,
   "score": 74,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5c0o8",
   "message": "\"In God We Trust\" being printed on money",
   "created_utc": 1692634119,
   "score": 42,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5ulox",
   "message": "The 2009 NFL marketing and advertising deal with the US Military.\nBefore this noone really remembers football games weren't this jingoistic recruiting machine.",
   "created_utc": 1692640990,
   "score": 10,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5u78h",
   "message": "Reddit. Just look at these comments.",
   "created_utc": 1692640843,
   "score": 18,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5spzz",
   "message": "Milk, it does a body good. An apple a day keeps the doctors away. Carrots help eye sight. Diamonds are rare and necessary for marriage. Christmas and most other US holidays.",
   "created_utc": 1692640311,
   "score": 13,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5vn25",
   "message": "Hollywood. all of it",
   "created_utc": 1692641371,
   "score": 14,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx62sv3",
   "message": "Late night talk shows",
   "created_utc": 1692643979,
   "score": 9,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx65zzf",
   "message": "When the main character uses modern talking points in a film based on a historical setting",
   "created_utc": 1692645149,
   "score": 9,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5du7n",
   "message": "Fox news",
   "created_utc": 1692634799,
   "score": 43,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6c8bt",
   "message": "Top Gun: Maverick",
   "created_utc": 1692647413,
   "score": 5,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5umce",
   "message": "All of mainstream media.",
   "created_utc": 1692640997,
   "score": 13,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5vp6f",
   "message": "Cop shows.",
   "created_utc": 1692641393,
   "score": 12,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6bie2",
   "message": "Every \"rags to riches\" trope promoted by capitalism.\n\nThe beauty, for capitalism, is that the stories are individually true.  They can always find one, do a photoshoot, and tell the narrative - 100% true.\n\nThe propaganda part is that they're peddled as normal and probable, making millions of people think this system is \"freedom\" and the surest way for everyone to become a multimillionaire.",
   "created_utc": 1692647154,
   "score": 15,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5ryht",
   "message": "Its all propaganda...",
   "created_utc": 1692640033,
   "score": 10,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx60c10",
   "message": "Advertisement. Their function is to make us believe certain things (superiority of some product) and act according to it (buying the product). Ads also give ideas about what is beautiful, good, healthy and admirable. Advertisements create consumerist culture and are always made with an intention.",
   "created_utc": 1692643078,
   "score": 6,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5hf3l",
   "message": "All United States news organizations.",
   "created_utc": 1692636125,
   "score": 8,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5vtkj",
   "message": "Logos on shirts. NIKE, Apple, all of it and people are proud to be companies advertising boards.",
   "created_utc": 1692641436,
   "score": 9,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx51dpx",
   "message": "Most Marvel movies (specifically the Ironman and Captain America movies) are pro-military propaganda.",
   "created_utc": 1692630150,
   "score": 33,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx65lwk",
   "message": "Law enforcement announcements of children rescued from \"human trafficking.\" What this usually means is that, over the course of doing day-to-day policework, they find kids who are with the wrong parent and take them back to the right parent (i.e. whichever parent is supposed to have custody at that time). They then wait until they've accumulated enough of these cases, give it a punchy name (like \"Operation Apollo\"), and announce them all at once. This gives the impression to the public that they like raided a warehouse and rescued 40 kids from slavery, when in reality it's just 40 separate, boring cases.",
   "created_utc": 1692645006,
   "score": 3,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6lxho",
   "message": "The advertised and highly believed false information that vaping isn't bad for you",
   "created_utc": 1692650895,
   "score": 3,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6vjl6",
   "message": "Anything in US high school history about MLK.\n\nHe was a very staunch communist and that part is very very intentionally left out. The rest of the curriculum is likewise full of propaganda (even the \"critical\" parts are manipulatively framed).\n\nAlso: Any implication that a free market will sort itself out in any positive meaning. It won't.",
   "created_utc": 1692654505,
   "score": 3,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx7a3gc",
   "message": "Telling teachers to “Just do it for the kids.”  No.  Pay me properly and support me.",
   "created_utc": 1692660532,
   "score": 3,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx4yvjf",
   "message": "Mainstream media.",
   "created_utc": 1692629195,
   "score": 23,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5yb1p",
   "message": "The idea that any basic college degree opens the floodgates of success. Many people worldwide accumulate college debt to study things that may not lead to personal/financial success. \n\nIn the US, college programs were bolstered and encouraged heavily during the Cold War. The government enacted national defenses education bills that would allow the US to compete academically with the Soviet Union. The Soviet Union had early success with the space program that made the US panic and start taking STEM really serious (culture wise/the US was coming out of the economic boom of the 50s and post-WWII). \n\nMy limited research suggests that the student debt crisis in the US is linked to the Cold War era education goals. Instead of flatly encouraging any $300k+ degree as a catalyst for success , we need to consider new ways to educate the masses appropriately. \n\nMy big hopes are that community colleges are further de stigmatized and encouraged for adults (possibly create free programs). I also believe trade programs can be ‘romanticized’ to be more attractive for people. \n\nMany people I know are in life long debt for their liberal arts/music degrees and undoubtedly will find trouble paying off their debts. Of course the crossover between people who want to do trade work and study liberal arts is probably not huge. I just think that the propaganda is “want to be middle class +? Get a 4 year degree”\n\nI would love to see this propaganda in the future “want to work in STEM or higher academics? Get a 4 year degree. Want to get started with higher education? Get a free community college degree. Want to get industry training and have a high paying, recession proof trade skill? Sign up for trade school……\n\nRant over",
   "created_utc": 1692642335,
   "score": 4,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5yqtw",
   "message": "Hollywood",
   "created_utc": 1692642494,
   "score": 6,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx61t46",
   "message": "Most mainstream media. I was watching some report of collusion between French politicians and Russia today. Instead of doing their job properly and give as many facts as possible, the journalists (from a major French info channel) just dismissed them as traitors, drunk and/or corrupted. Which is probably true, but without proper facts and evidence, it's no more than cheap propaganda. I can't really blame some for falling into Russia's trap if they watch shit like that all day.",
   "created_utc": 1692643618,
   "score": 5,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx66739",
   "message": "The American Dream.",
   "created_utc": 1692645222,
   "score": 4,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx66993",
   "message": "Back the blue",
   "created_utc": 1692645244,
   "score": 4,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx5mku3",
   "message": "The news shown in the USA.",
   "created_utc": 1692638055,
   "score": 9,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx66o37",
   "message": "Reddit.",
   "created_utc": 1692645395,
   "score": 5,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx4ztjt",
   "message": "The notion of freedom to get people’s allegiance to the US.",
   "created_utc": 1692629556,
   "score": 11,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx51bdb",
   "message": "Got milk and all the other animal titty milk programs.",
   "created_utc": 1692630125,
   "score": 17,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx66u5s",
   "message": "So I've leared from this thread, all conservative thinking is propaganda, and no liberal thinking is propaganda. \n\nSeems legit.",
   "created_utc": 1692645456,
   "score": 14,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6b0b2",
   "message": "MSG hate",
   "created_utc": 1692646968,
   "score": 2,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6f05j",
   "message": "Playing the National Anthem at every sporting event.",
   "created_utc": 1692648408,
   "score": 2,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6g3ve",
   "message": "Calling everyone that thinks mandatory flag ceremonies is propaganda \"traitors\" while branding them \"elitist\" if they also rail at why everything we do to help people needs to go through government as coerced taxes since people are both accustomed to coercive taxation as part of their sworn oath to a flag as opposed to swearing an oath to their fellow citizens.",
   "created_utc": 1692648804,
   "score": 2,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6h0z4",
   "message": "Televangelists",
   "created_utc": 1692649136,
   "score": 2,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6leof",
   "message": "Cop shows",
   "created_utc": 1692650707,
   "score": 2,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6n0xt",
   "message": "A majority of stuff posted on reddit",
   "created_utc": 1692651290,
   "score": 2,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6nk3r",
   "message": "Qanon and the anti-clean power movement.",
   "created_utc": 1692651483,
   "score": 2,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6oojx",
   "message": "Propaganda is information meant to trigger and emotional response. It doesn’t have to be false or even harmful. Most media could be classified as propaganda",
   "created_utc": 1692651893,
   "score": 2,
   "submission_id": "15x9bia"
  },
  {
   "comment_id": "jx6pm4z",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15x9bia"
  }
 ]
}