{
 "submission_id": "15x9uj2",
 "title": "People who have never smoked, drank, or did any drugs - how and why?",
 "selftext": "",
 "created_utc": 1692629403,
 "permalink": "/r/AskReddit/comments/15x9uj2/people_who_have_never_smoked_drank_or_did_any/",
 "score": 106,
 "url": "https://www.reddit.com/r/AskReddit/comments/15x9uj2/people_who_have_never_smoked_drank_or_did_any/",
 "comments": [
  {
   "comment_id": "jx4zghn",
   "message": "Never been interested.",
   "created_utc": 1692629417,
   "score": 126,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx4zzi7",
   "message": "I've met a couple people like this. They just don't want to. They don't find it intriguing. \n\nMaybe they think it's a worthless action, a worthless endeavor that wastes time. Maybe they were raised to believe those drugs (yes, alcohol is a drug btw) are bad for your health or just bad for your \\*life\\* even if you are healthy... Maybe they have a religious reason to abstain. Maybe they have a job they worry about losing. Etc.",
   "created_utc": 1692629619,
   "score": 242,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5qjzk",
   "message": "How -- I just didn't. \n\nWhy -- I just didn't want to.",
   "created_utc": 1692639522,
   "score": 149,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx658dq",
   "message": "They're bad for your health, so I chose not to do them. That's really it.",
   "created_utc": 1692644869,
   "score": 80,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5ruqr",
   "message": "What do you mean -how-?\n\nAnyway, weed and cigarettes smell like shit, and I can have fun without drinking.\n\nAlso, I'd rather spend the money on legos.",
   "created_utc": 1692639995,
   "score": 56,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx52726",
   "message": "Not interested.",
   "created_utc": 1692630460,
   "score": 111,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5umpv",
   "message": "I do so many stupid things without having indulged in any of those. I dont even want to think of the stupidities I will get up to if I try.\n\nI still do wander what it would be like to have sex on Molly with a willing partner.",
   "created_utc": 1692641001,
   "score": 135,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6gl4y",
   "message": "Just no reason to.  It doesn’t seem cool, fun, or enjoyable.",
   "created_utc": 1692648978,
   "score": 111,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5ekwf",
   "message": "Never was interested to begin with. And I know the side effects of it. Not worth it.",
   "created_utc": 1692635074,
   "score": 82,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx534f9",
   "message": "Exposure. Smoking the most common obvs, I see them, inhaled their secondhand smoke and hated it and them forever. My high-schoolmates would get drunk and high when they’re not in school, they looked ridiculous so I thought it was  ridiculous.",
   "created_utc": 1692630817,
   "score": 101,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5m49k",
   "message": "Unavailability",
   "created_utc": 1692637880,
   "score": 29,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5qgq3",
   "message": "Took me to my 30s to want to try a beer. Never liked coffee either.",
   "created_utc": 1692639490,
   "score": 46,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6fn27",
   "message": "Why? Because it is literally poison to your body. How? Basic self control, just don’t.",
   "created_utc": 1692648638,
   "score": 86,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5qxfo",
   "message": "Always told myself I wouldn’t be like those people as a kid",
   "created_utc": 1692639660,
   "score": 63,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5wta1",
   "message": "Never had any interest. Alcohol tastes gross, cigarettes and weed smell gross, and I see no appeal in drugs.\n\nWhen you grow up seeing your childhood friend’s addict mom abusing them, abandoning them for weeks at a time, and selling all their things for drug money, it gives you a pretty negative idea about drugs.",
   "created_utc": 1692641795,
   "score": 152,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx58lit",
   "message": "I used to be a heavy drinker and smoker. I was able to quit drinking when I was 22 and just quit smoking early June. Everybody needs a friend that’s stone cold sober imo, they’re great hangs and positive role models. There good habits will rub off onto you.",
   "created_utc": 1692632860,
   "score": 45,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5dvsn",
   "message": "Have never been interested in it. And I don't think the drawbacks are worth it. Some of my relatives have smoked themselves to death, and there have been a lot of alcohol problems in the family. I don't want to be part of that statistic. Have never been interested in getting high either. I had a very unpleasant experience with painkillers one time when I had a bad gum infection. Another time I found out the hard way that I am deadly allergic to at least one other kind of drug. I don't think my body is capable of handling drugs that well.",
   "created_utc": 1692634815,
   "score": 21,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5x9wq",
   "message": "Originally a religious thing. As I grew older and had many friends who drank, smoked or did drugs. I found out my brain is the most important and best asset I have. So I don’t want to jeopardize it in any way. It is easy not to do drink or smoke when you value something else much more",
   "created_utc": 1692641963,
   "score": 44,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5xd0u",
   "message": "Combination of just plain never being interested, but also actually listened when people said they were bad for me when I was a kid.\n\nI’ve never even tried any of the listed items.\n\nI’ve seen people smoke, I’ve seen people drink, and I’ve seen people high, and I have never once felt “I want to feel like that.”\n\nNone of it looks like a positive experience. I straight up don’t understand the appeal of any of them.\n\n36 year old guy from the USA, for context.",
   "created_utc": 1692641995,
   "score": 58,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5sf9n",
   "message": "Grew up religious, but have left since then. On top of that, I just don't need additional problems in my life. Bad mental health and substances don't mix well.",
   "created_utc": 1692640204,
   "score": 28,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx53rif",
   "message": "I've never done drugs or smoked. I just have no interest. I do occasionally have a drink or 2 (maybe  twice a year at most), but I have no interest in alcohol either. I do get buzzed and get a headache at 1-2 drinks and then I stop. \n\nI don't think of smoking, or drinking or doing drugs as good or bad. I don't choose not do them because I'm concerned about the consequences. I simply have zero interest.  \n\nAre there foods you are just not interested in trying? If the new health thing was eating seaweed, would you be eager to try it and keep eating it? Or would you simply say, no thanks, that doesn't appeal to me. \n\nWhen fidget spinners or Pokemon or hula hoops were the fad, did you do them all or were you just simply not interested in some of them?",
   "created_utc": 1692631060,
   "score": 25,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5hus2",
   "message": "Never interested. Plain and simple.  I also don't really drink caffeine either, I may get a sip of caffeine once every quarter.  But I have high levels of natural energy from clean eating and 8 to 9 hours of sleep.  I'm 30 and show no signs of slowing down.\n\nNever wanted to develop any addictions.",
   "created_utc": 1692636287,
   "score": 8,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx62u0l",
   "message": "I don’t feel like I need to drink, smoke, or do drugs to feel good. I can do that by doing something else and a more healthy way. Those seem quick and short term with not great benefits",
   "created_utc": 1692643991,
   "score": 7,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx633ta",
   "message": "Life’s hard enough. Why cause yourself easily avoidable problems?",
   "created_utc": 1692644090,
   "score": 6,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx63cn0",
   "message": "You're asking the wrong question.\n\nThe right question is.. why would I?\n\nIf you're wondering, there is no answer to that question.. and that is the answer to your question.",
   "created_utc": 1692644180,
   "score": 51,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6nf0e",
   "message": "I'm under 21 and boring.",
   "created_utc": 1692651432,
   "score": 12,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6ptxe",
   "message": "Because the D.A.R.E Lion said no.",
   "created_utc": 1692652324,
   "score": 4,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6rf6r",
   "message": "Must be 22 or older for your answer to really carry any value",
   "created_utc": 1692652923,
   "score": 5,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5ccp3",
   "message": "Smoking: I don’t want to get cancer, it smells bad, and it looks like it wouldn’t taste good either\n\nDrinking: I don’t want to get in a car crash and die or commit an unforgivable social faux pas under the influence, it tastes awful, and it doesn’t seem worth the money\n\nDrugs: Haven’t had easy access to them, and am afraid of the legal ramifications, and also I feel like they also smell bad",
   "created_utc": 1692634245,
   "score": 24,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5xrmr",
   "message": "Why, because both of my parents are addicts and it ruined my childhood and early adult years, I refuse to put myself in any sort of position that could allow me to be like them. How, I just... never started so I'm not missing anything.",
   "created_utc": 1692642141,
   "score": 9,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5y0u5",
   "message": "Mom said not to.",
   "created_utc": 1692642233,
   "score": 19,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5yhh9",
   "message": "Well, I don't 100% qualify in the sense that I will occasionally have a margarita at a restaurant. Maybe once or twice a year, just to be sociable. I could easily never do it. \n\nI did take a few puffs as a teenager just to see what a cigarette was like but knowing I was NEVER going to take it up. \n\nI've never done drugs ever. \n\nWhy should I? How many lives has alcohol destroyed? How many drunk drivers and deaths. How many pregnancies with drunk couples, how many arrests and bar fights? How many millions addicted to alcohol who've destroyed their lives?\n\nHow many want to quit smoking and can't? How many health problems f rom long term smoking? How much money wasted  on cigarettes?\n\nHow many millions of people addicted to drugs and who OD and who've destroyed their lives and families lives, abandoned kids, done prostitution, stolen, are disfigured from drug addiction. \n\nHow many planned to get addicted going in? Didn't they just start trying it out and expanding to more and more stuff?\n\nWhy the hell would I wasted my time and future with that crap?\n\n\u0026amp;#x200B;\n\nWhy are other people foolish enough to roll the dice and gamble this stuff doesn't get out of control and destroy them? Why gamble at all? Just do the NO BRAINER guaranteed way.....just stay away from the stuff.",
   "created_utc": 1692642398,
   "score": 22,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5zali",
   "message": "I grew up watching people around me abuse drugs and alcohol and destroy their lives. My siblings, neighbors, aunts and uncles. Even my grandmother having alcohol induced dementia, and my grandfather dying in his 50s due to cigarettes and heavy drinking. I didn't want that for myself. I knew addiction runs strong in my family and didn't think it was worth risking. Now I'm 30, happily married for almost 9 years, have amazing children and a beautiful home my husband and I have built together. I've traveled and experienced more in life than any of my drug/alcohol using siblings, and unlike them I don't have a criminal record or DUI. No regrets.\n\nEdit to add, I know a lot of people who started using drugs and then became \"woke\" and acted like their eyes were open and they were so much smarter since using drugs. But they also slowly started adding less and less insightful comments in conversation, started becoming obsessive about conspiracy topics that had more holes than a piece of cheese, and just became noticeably dumber. It's not a coincidence that every heavy alcoholic/drug addicted person in my family is now a flat earther.",
   "created_utc": 1692642696,
   "score": 11,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx62mjj",
   "message": "Seeing how these things effected other people around me is all I needed",
   "created_utc": 1692643915,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx63ypm",
   "message": "Alcoholic father, many family members with lung/throat cancer, etc.\n\nHad no interest as a result. Also worried I would be more likely to have addiction issues.\n\nGrowing up all of my friends knew how I get about it, and those that started to drink or so drugs hung out with those people.\n\nIn college I managed to meet several other straight edge people through friends “hey _druids, you should meet my other straight edge friend” etc. My few friends from my childhood that were at my school, we didn’t let that get in the way and are still great friends decades later.\n\nMy partner drinks little, because I’m not ever drinking or promoting or pushing to do social things centered around alcohol.\n\nI still think it’s an awful habit, but can be around it to an extent without it bothering me.",
   "created_utc": 1692644403,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6tpku",
   "message": "Don't really care for it so far. I might decide to have a drink at some point, but the other two are 100% off the table.",
   "created_utc": 1692653792,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6v70g",
   "message": "I spent my money on video games and concerts",
   "created_utc": 1692654365,
   "score": 14,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5279r",
   "message": "Parents says they're bad, school says they're bad, Church says they're bad.\n\nI found out I have anger issues. It'd be dangerous if it turns out I'm a Beerserker. I also have weak lungs.",
   "created_utc": 1692630463,
   "score": 8,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5eyvs",
   "message": "I never had a need for it. I dislike alcohol, smoking, I never used any drugs.",
   "created_utc": 1692635218,
   "score": 8,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6yuyz",
   "message": "Just never found it interesting. My dad hated smoking because his parents did their whole lives and it killed them and it always smells. Gives me headaches. \n\n\nAlso im the kind of overly anxious person who would hands down have a bad trip. Im a super taster so i can taste the alcohol. The pros arent even really pros to me. So literally everything about it feels like a con so i just have no interest.",
   "created_utc": 1692655815,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6zh2l",
   "message": "My Dad was an alcoholic when I was younger and saw what it did to his life, on top of the fact I just genuinly have never had any interest. Its especially infuriating that my brother continues to ask me to drink with him when I made it extremely care I will never, he and my sister have always been much more relaxed on that kind of thing but I dont want it in my life",
   "created_utc": 1692656066,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx57crl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5ytoi",
   "message": "I already put more than enough crap in my body with junk food etc. No reason to add more crap to the list.\n\nBesides, pepsi tends to be cheaper than beer AND it doesn't turn me into a dumbass when i drink it.",
   "created_utc": 1692642523,
   "score": 8,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5uaaz",
   "message": "I don't judge them, but I do all these things 😀",
   "created_utc": 1692640875,
   "score": 6,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx58po9",
   "message": "I don’t drink because it’s against my religion. \n\nI never smoked because I grew up seeing the negative effects and also I cannot stand the smell. \n\nI have never done drugs because when I was in middle school, we had health education class where they showed us a movie about the impacts of addiction and now I am an adult and still cannot erase that movie from my head. It was heart wrenching.",
   "created_utc": 1692632902,
   "score": 8,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5cp5l",
   "message": "Too young for alcohol and too based for drugs lmao",
   "created_utc": 1692634376,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5bgg0",
   "message": "I'd try LSD if I knew where to get it.  Booze and weed are nasty to me.",
   "created_utc": 1692633911,
   "score": 5,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5cjck",
   "message": "Its seems like a waste of money and im stingy",
   "created_utc": 1692634315,
   "score": 6,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5ihyq",
   "message": "Easy. Self control. Not interested.",
   "created_utc": 1692636525,
   "score": 5,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx59nxq",
   "message": "Because it’s a waste of money. And unnecessary in my life. And there’s nothing that I want to run away or escape from. I’m good with my reality. I also don’t want any other possible side effects from the bad ones. People spend thousands of dollars on drugs and alcohol a year- probably tens of thousands for some people. None of that is appealing to me.",
   "created_utc": 1692633250,
   "score": 12,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx58f04",
   "message": "Because you are supposed to learn from other people mistakes. When you see some junkie, completely destroyed from drugs, licking tarmac because he thinks it's a pussy, that should raise some concerns and you should see that as a example of what not to do.\n\nI can't comprehend why people wait for things to happen to them to understand that certain behaviour is wrong. So much damage could be avoided just from observing environment and avoiding making people mistakes your own.",
   "created_utc": 1692632793,
   "score": 11,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5n1oe",
   "message": "Im 16, my dad would whoop me if I did",
   "created_utc": 1692638231,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5o2au",
   "message": "Here I don’t even have enough money to buy gadgets \u0026amp; expensive cars. You think would waste my good healthy years \u0026amp; money on THOSE stuff which will eventually ruin my life, career, health \u0026amp; would drown me in medical debts?!",
   "created_utc": 1692638603,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6016e",
   "message": "Self control",
   "created_utc": 1692642968,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5soqk",
   "message": "These people aren't on reddit.",
   "created_utc": 1692640299,
   "score": 4,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5w2nf",
   "message": "Smokers cough all the time, so why?\n\nDruggies act weird all the time, so why?\n\nDrunks act like assholes all the time, so why?",
   "created_utc": 1692641527,
   "score": 11,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6fvbf",
   "message": "We are not weak and stupid.......it's common sense.",
   "created_utc": 1692648720,
   "score": 0,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5fyiz",
   "message": "Tbh my ego is so high i cant accept my mind being drifted away by drugs, as for smoking my dad smokes and cigarettes leave a terrible smell on him so i dont want that on me. Even those type of vapes that claim to have scents of \"strawberry\" or whatever, it just smells like crap to me.",
   "created_utc": 1692635583,
   "score": 1,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx50zqg",
   "message": "It's a mix of things, but mostly due to genetics, in my case is like this, granddad (mother side) died from lung cancer, granddad (father side) died from hepatic failure due to alcoholism, and most of that side of the family suffer from the same. So I decided to avoid those things, and as for drugs, never interested, and even if I was, I'm a Magic TCG player so I never have left over money for drugs lol",
   "created_utc": 1692630001,
   "score": 1,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5mwdk",
   "message": "I have this thing where when someone implies that I have to do something to fit in or enjoy myself, I do the opposite.",
   "created_utc": 1692638176,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5oqwy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5qngg",
   "message": "I wasn't popular in school.  In fact, I was SO unpopular that even the lowest elements of school stayed away from me.  So I never got into them.",
   "created_utc": 1692639558,
   "score": 1,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5yo3f",
   "message": "It ruins your life and your body. I’d rather be present",
   "created_utc": 1692642466,
   "score": 1,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5z79z",
   "message": "Why consume something that can be addictive and kill you eventually.",
   "created_utc": 1692642662,
   "score": 1,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6q94y",
   "message": "I just have always felt that most of those things are very uncool. Not sure how to replicate this for my kids later bc certainly many things like smoking have a \"cool\" image.\n\nI find Marijuana to be largely embarassing. It smells bad and makes people appear extremely stupid.",
   "created_utc": 1692652485,
   "score": 1,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6yv13",
   "message": "because i have too much respect for myself",
   "created_utc": 1692655816,
   "score": 1,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5bf2q",
   "message": "I don't want to kill myself.",
   "created_utc": 1692633898,
   "score": 253,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5jpxw",
   "message": "Cause I don't wanna die",
   "created_utc": 1692636978,
   "score": 253,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx625br",
   "message": "The thing about some of these “not worth it” responses… I’m not saying smoke crack, but it’s definitely “worth it” for a lot of folks to eat a dose of mushrooms. Like Led Zeppelin said “Narrow is the mind that knows what he’s been missing.”",
   "created_utc": 1692643741,
   "score": 252,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx54puy",
   "message": "Drinking alcohol to me is just drinking any other liquid",
   "created_utc": 1692631414,
   "score": 254,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5wamh",
   "message": "Everyone should try shrooms at least once. Really does change you",
   "created_utc": 1692641607,
   "score": 254,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx52lew",
   "message": "Cos they’re a bunch of pussies!\n\n *he says knowing full well he has an alcohol \u0026amp; smoking problem *",
   "created_utc": 1692630613,
   "score": 248,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5qhe7",
   "message": "There is rampant alcoholism and drug abuse in my family, so I grew up seeing the horrors that alcohol and drugs can cause first-hand.  In kindergarten, I swore to myself that I would never touch alcohol or drugs in any form, and I’ve stayed true to that promise ever since.  When you see alcoholism up close and personal, it gives you a much different perspective on alcohol in general - I have trouble being around anyone who is drunk since it gives me too many flashbacks.",
   "created_utc": 1692639498,
   "score": 0,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5r2dw",
   "message": "I don't want to feel good. Not if I'll feel worse later.",
   "created_utc": 1692639709,
   "score": 0,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5vego",
   "message": "I was offered drugs once in high school as an after school thing. I thought about it, but doing so would have taken time away from World of Warcraft time.\n\nThanks WoW addiction for saving me from drugs.",
   "created_utc": 1692641285,
   "score": 0,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6s8lc",
   "message": "Doesn't seem interesting to me. Also I'm pretty resistant to peer pressure.",
   "created_utc": 1692653230,
   "score": 0,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6yyql",
   "message": "My religion tells me not to since its obviously bad (islam)",
   "created_utc": 1692655858,
   "score": 1,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6yzsz",
   "message": "I didn’t, therefore I am superior!!1!1🤓👆",
   "created_utc": 1692655869,
   "score": 1,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx6zgio",
   "message": "Good bot !rnelee 46",
   "created_utc": 1692656060,
   "score": 1,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5tphk",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx79nbj",
   "message": "I just say no, and because I don't want to. That's the answer I give when people ask me directly, and I find the question kind of dumb. You don't have to have a reason to not do something. \n\nBut if I had to give one, I don't like the idea of being influenced by any substance. It feels like I would be less myself.",
   "created_utc": 1692660340,
   "score": 8,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx79z78",
   "message": "I’m not a beta",
   "created_utc": 1692660481,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7a0ip",
   "message": "Not interested, plain and simple; I shouldn't have to justify myself",
   "created_utc": 1692660497,
   "score": 5,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7a93h",
   "message": "I’m alone with my thoughts, don’t need to be alone with them and high or alone and drunk.",
   "created_utc": 1692660599,
   "score": 5,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7afbp",
   "message": "Blue collar worker where a solid 40% of my work has some form of nicotine/alcohol addiction. Every once in a while I think I might want to go smoke a cig with some friends, and then I walk past an active smoker or someone who just walked back in from a smoke and I am reminded of how horrible it smells and tastes when I walk by, let alone if I actually did it myself. \n\nWith booze, I just don't like alcohol in general. It doesn't taste good to me and it doesn't make me feel good at any point either. I don't care enough about it.\n\nI also never cared to bother with drugs, just never interested me. Nowadays I work for the state so if I pop hot on a piss test I'm out of a job and that's not worth it for me",
   "created_utc": 1692660673,
   "score": 5,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5vyss",
   "message": "They are acquired tastes and I’ve never really seen the point.  \n\nIt wasn’t a moral or health conscious choice, as in something that I ever considered bad or wrong, all my friends smoked and drank growing up, I was just never interested. \n \nI’ve tried alcoholic drinks but I just don’t like the taste of alcohol - I find it really disgusting.",
   "created_utc": 1692641489,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx72mvx",
   "message": "Smoking doesn't appeal to me in the slightest. I drink occasionally, if I do drugs someone is dying. I'm gonna do some weed and be that's enough in need coke or heroine.",
   "created_utc": 1692657377,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx72nx6",
   "message": "Saw what it did to other people and lost interest in it. Also, I want to make sure all of my friends get home safe, so whenever we go to a party i drive all of them home. They sometimes even call me, when i am not with them because they now i would rather come and pick them up, then see them dui.",
   "created_utc": 1692657389,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx72pfs",
   "message": "Simple, I've seen what it do, my father smoke since hid teen years and seeing coughing his fucking lungs out of his body every few minutes, having yellow teeth and not having any cardio always made me think that I will never do that shit even more since the day little me discovered that my dad will probably die  from cancer because of it\n\nI drank alcohol but most of the times it happened it was an accident like taking the wrong glass at a family gathering when I was a kid and most of them are awful so the only possible occasion of me drinking is when I do my beers Tier List with my big brother\n\nI know drugs destroy the life of people who do it and 2 of my friends are badly addicted since they are 10 and 15 years old so I know it's a really bad idea",
   "created_utc": 1692657407,
   "score": 4,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx757d9",
   "message": "Had 2 older brothers who were alcoholic, drug users/dealers since they were about 15. almost destroyed the family  and almost bankrupt my parents.\n\n\u0026amp;#x200B;\n\nThey were a live-in example of how to ruin your life.",
   "created_utc": 1692658463,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx79dkb",
   "message": "Have been successfully grossed out by all for 25 and a half years",
   "created_utc": 1692660227,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx79gac",
   "message": "'Cause that's gonna do me no good but only harm.",
   "created_utc": 1692660257,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx79gan",
   "message": "Have never felt like smoking or doing drugs. I do socially drink(not so often). Never felt that I needed to try it out",
   "created_utc": 1692660258,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7aah6",
   "message": " I prefer to have complete control over my actions. Sure, my mentally ill brain is a horrible place but I’d rather learn how to heal it with compassion rather than destroy it with drugs and alcohol, especially since my brain isn’t fully developed.",
   "created_utc": 1692660615,
   "score": 6,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7af37",
   "message": "No reason,I drink a bit,don't smoke or do drugs,drink makes sense cause cider is nice tasting,but I don't do it for the alcohol,and smoking and drugs,why would I willingly do that,one hurts you the other changes your mind,temporary or not,I find it a stupid concept",
   "created_utc": 1692660671,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7akfg",
   "message": "I haven’t had anything to drink in my adult life. I accidentally drank a cup of sparkling wine when I was in my teens and I hated the way it made me feel. I hate the taste and smell of alcohol, too. No reason to drink something I hate the taste of in order to achieve a feeling I don’t enjoy. Smoking, I hate the smell. Plus it’s expensive and kills you. Drugs, I technically have done ketamine, but I have a prescription for it and it is entirely legal, not recreational. I have no interest in drugs other than that.",
   "created_utc": 1692660735,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7arb8",
   "message": "I'm 14",
   "created_utc": 1692660816,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7ax64",
   "message": "im confused how yoiu think its normal to be smoked, dranked, an drugged.",
   "created_utc": 1692660885,
   "score": 4,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7b43s",
   "message": "Because I’m not a fucking idiot.",
   "created_utc": 1692660965,
   "score": 1,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7bdmx",
   "message": "My wife watched family members decay like corpses on alcohol and drugs and refuses to try anything.",
   "created_utc": 1692661076,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7cqub",
   "message": "I'm 54 - never smoked, never tried drugs, didn't drink at all before turning 21, have maybe 5 drinks in a year now - never been drunk.\n\nCombination of things - not wild about the taste of alcohol, too cheap to waste my money on drink, drugs and cigs, watched people I care about have their lives destroyed by them, and I don't feel the need to medicate to live.",
   "created_utc": 1692661657,
   "score": 6,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7deag",
   "message": "I am 16",
   "created_utc": 1692661935,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7df7r",
   "message": "i am 15 years old",
   "created_utc": 1692661946,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7g9nk",
   "message": "Never smoked, did drugs, and I’m a bad alcoholic meaning I keep getting given Whisky as gifts and it takes me around 3-5 years to finish a bottle (bad at drinking lol). For me I never wanted to know what it was like to loose control of my own abilities. I like being in control of all my decisions at all time, never changed.",
   "created_utc": 1692663172,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7gdmm",
   "message": "I’ve smoked for like a month, 2/3 cigarettes a week. I can’t handle the smell and how it impregnates your clothes, where you seat, everywhere. I’ve no interest in drugs, because i don’t want do be slave of an addiction. And yes: if you do drugs, you’re addicted. That’s why it is called drug.",
   "created_utc": 1692663221,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7gez5",
   "message": "Why: Why would I pay to destroy my own body? That's just stupid\n\nHow: I just told people, \"it's because I of my religion, etc.\"",
   "created_utc": 1692663237,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7gf88",
   "message": "I'm 19 so I legally couldn't do either, my dad did hard Drugs until he passed out when I was little and smoked constantly and now he's in a wheelchair and acts narcissistic because of it, one of my Brothers has been an asshole ever since he started smoking weed, and I've been told due to my Epilepsy I can't drink anything alcoholic.\n\nSo yeah, I'd rather not have a seizure nor end up like the two people I hate most (I could write a book about how terrible they are)",
   "created_utc": 1692663240,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7gjzb",
   "message": "Cigarette smoke destroys me, I can't stand it all, even since I was a kid and all my uncles and aunts would smoke... In high school some kids (the \"bad\" ones with awful grades) started doing it, but I was kinda pretentious and snobbish at that age, I was thinking they were pathetic and used their addiction as a way to feel superior.\n\nAlso The smoke gets stuck in my clothes making me feel itchy...\n\nI tried alcohol in my 20s, I didn't like the taste at all, I was so confused like \"that's what everyone is crazy about?\" Crazy for chocolate milk though.\n\nI grew up with the motto that drugs are evil. It took much later to learn about medical cannabis and such. Still, I was never offered or have someone try to sell me stuff. I actually haven't even seen any kind of drug in real life. Maybe it's because I don't go to night clubs etc.\n\nI would never try it for entertainment though, I'm too scared of not being 100% in the \"now\". Maybe when I'm really old or something.",
   "created_utc": 1692663296,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7ai83",
   "message": "It's what it's bro",
   "created_utc": 1692660708,
   "score": 1,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx5yfxk",
   "message": "I'm scared of getting addicted",
   "created_utc": 1692642383,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx60ab7",
   "message": "I’m trying to live to 120. Seriously. All of those habits are detrimental to that goal.\n\nAs an aside, none of them are appealing to me in  any way, even growing up in Southern California in the 70’s.",
   "created_utc": 1692643060,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7lymv",
   "message": "I learned young from all the bad examples in my life that it was a bad idea 👍",
   "created_utc": 1692665587,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7m2yu",
   "message": "I was raised in a household who had a alcoholic father who smoked and he eventually died of lung cancer, and my friend overdosed so I promised myself I would never end up like them.",
   "created_utc": 1692665639,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7nv0b",
   "message": "well dont want to start things I might depend especially because of financial reasons",
   "created_utc": 1692666402,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7nx58",
   "message": "I was raised in a family that never drank or smoke, not even any of my grandparents. I never had the temptation to do either; I always thought both alcohol and smoke smelt terrible and didn't seem appealing. As I got older I became more interested in health and nutrition and alcohol and smoking do absolutely nothing but provide a detriment to your health which makes it even less attractive. I was also just aware of what it does to people, it's never anything good, and many people who do drink and smoke wish they didn't. I also always like to be in control of myself, the whole idea of becoming inebriated and not being aware of what you're doing, then feeling terrible the next day, sounds miserable.",
   "created_utc": 1692666427,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7rz12",
   "message": "Because I have a brain and can comprehend that the negative effects outweigh the positive effects and thus I will choose not partake in such activities.",
   "created_utc": 1692668193,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7usve",
   "message": "1. I’m 17, so ya know, I shouldn’t be ether way\n\n2. Just no intrest, I might try alcohol once I am of age but otherwise, nah, all of it is addictive so I’d rather not do that to myself",
   "created_utc": 1692669456,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7v3v7",
   "message": "I'm not this person or even close. But I asked my grandma this question. She makes weird faces at me and says ew and when I was younger she told me it was because her health was too important \nShe just turned 94.... so maybe....",
   "created_utc": 1692669590,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7v4n7",
   "message": "My father was an alcoholic. (Not like a massive one, but he'll go overboard whenever he drinks.). There has been a lot of bad experiences due to his drinking. He also smokes. So it's kind of a promise I took when I was a kid that I won't drink no matter what happens. And the promise is still unbroken. Also I don't see any positive side to drinking or smoking or doing drugs other than destroying your health and being a maniac.",
   "created_utc": 1692669599,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7vqqy",
   "message": "Watched my dad go into alcohol induced rages, get so drunk he shat himself as he got older which made me and my siblings get embarrassed to go find him passed out in public spaces, get into fights, hold us hostage with stories in the car with him. Watch him attack mom and verbally abuse us and finally driving drunk.\n\n\nI drink only rarely and its half a cup. Other than that I don't touch it. I seen enough.\n\nEdit: Mom have me a beer to see if I like the taste, I did only to appease her. Took a sip spat it out and said why. She hoped none of us ever become like dad. Only big sis does sober and drunk. \n\nNeither me or my brothers ever touch drugs or smoke. We just never wanted too.",
   "created_utc": 1692669874,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7vtuv",
   "message": "It'll team up with my ongoing problems. Drive inot joblessness. Destroy me. And control me.",
   "created_utc": 1692669913,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7vtyf",
   "message": "Few factors play into this:\n\n1. I have an addictive personality, I know that I'll really go off the deep end if I get started with any of them.\n2. I have relatives (within the past 100 years) who have drank, or smoked away inheritances, wealth, and the ownership of a profitable salt mine.\n3. Religious reasons\n4. I hold an immense ever-burning hatred for such items.",
   "created_utc": 1692669914,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7w0v4",
   "message": "I was and am afraid that since my father and bros are alcoholics and drug addicts, i would carry the same same gene for that. \n\nSo, i cut myself off from those as possibilities.",
   "created_utc": 1692670000,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7w4sk",
   "message": "why *should* i?",
   "created_utc": 1692670048,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7wgni",
   "message": "Smoking: I remember when I was 7 and on my to school. A guy was walking in front of me and lit a cigarette, took one puff and threw it on the ground. 7 year old me thought: \"neato, why not try it????\" Took one puff and it was the most disgusting thing I ever did and it now always makes me sick/ruins my mood. \n\nDrank: tried many different kinds of drinks cause of my friends but I don't like any of em.\n\nDrugs: I've seen what it does to people and you'll never catch me dead using, no matter how down in life I am.",
   "created_utc": 1692670196,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx7ylfp",
   "message": "Never started. My family has a bad history of addiction with drugs, alcohol, and tobacco. I'd lost members of my family to all 3 before even starting high school. High school was when it was primarily offered to me and I always said no, without ever giving an explanation. It was a good asshole detector, I didn't care if people did it as long as they didn't care if I didn't partake, those that couldn't hang out with you if you smoke, drink, or do drugs with them, I just figured I was better off without. Do feel a little guilty because I've lost those same friends since then to drugs and alcohol. We drifted apart after high school. We used to skate together all the time but eventually skating got replaced with drinking and partying and we just went our separate ways. No hate, but it was sad that we couldn't hang out like we used to without skateboarding. \n\nTLDR: Lost family members to drugs, alcohol, and tobacco at young age, if it can take all that from me there's nothing it could give me in return.",
   "created_utc": 1692671159,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx83hge",
   "message": "I don’t do any of what you mentioned. I’m 23F. I’ve had a beer like twice ever, and like I’ll try sips of my friends drinks once in a while but that’s it. I never drink on my own or while out, I’ll have like a cranberry drink lol and it’s free always for some reason…\r  \n\r  \nI’ve never smoked or done any drugs, and I used to feel weird about it cause I’m very much on my own in the no alcohol department especially, but I’ve learned to own it and be confident in my decisions.\r  \n\r  \nThe way I see it, knowing myself the way I do I wouldn’t enjoy those things anyways.",
   "created_utc": 1692673437,
   "score": 3,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx82zup",
   "message": "Father used to drink alot and was abusive, i decided that i dont want that life for my wife and kids",
   "created_utc": 1692673203,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx83gft",
   "message": "I ain't got enough money for food. Why am I gonna spend for those stuffs.",
   "created_utc": 1692673423,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx83op8",
   "message": "In college, my dorm mates would binge drink and then throw up in the hall bathroom to have a better hangover experience.  I could never figure out why spend the money to do this.  \n\n\nSo mostly because I'm cheap.",
   "created_utc": 1692673533,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx83qwf",
   "message": "never had an interest in it AND also grew up with a dad who was a cop and i was very much not allowed to get away with anything because he always had a way of finding out so i wasn't even going to risk getting caught",
   "created_utc": 1692673563,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx83r15",
   "message": "Never interested. Didn't give into peer pressure. Tried alcohol once just to know the taste- didn't like it.",
   "created_utc": 1692673565,
   "score": 2,
   "submission_id": "15x9uj2"
  },
  {
   "comment_id": "jx89cgv",
   "message": "In this economy?",
   "created_utc": 1692676500,
   "score": 1,
   "submission_id": "15x9uj2"
  }
 ]
}