{
 "submission_id": "15xga5b",
 "title": "What's the biggest lesson that employment has taught you?",
 "selftext": "",
 "created_utc": 1692643609,
 "permalink": "/r/AskReddit/comments/15xga5b/whats_the_biggest_lesson_that_employment_has/",
 "score": 44,
 "url": "https://www.reddit.com/r/AskReddit/comments/15xga5b/whats_the_biggest_lesson_that_employment_has/",
 "comments": [
  {
   "comment_id": "jx61xdv",
   "message": "Trust no one",
   "created_utc": 1692643660,
   "score": 129,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx68cub",
   "message": "Just do your job. Nothing more. Nothing less. You will not get rewarded for doing extra. Your job really does not care about you. You are a line item on expense report.",
   "created_utc": 1692646008,
   "score": 46,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx63m0y",
   "message": "Companies/leadership don't care about you and your career....the only person who cares about your career and advancement is yourself",
   "created_utc": 1692644274,
   "score": 88,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx623qp",
   "message": "It's just a job. The rest of life is way more important.",
   "created_utc": 1692643724,
   "score": 46,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx65r4s",
   "message": "If you work hard and get your job done faster than other people in your position, instead of downtime, you get rewarded with more work, but not more pay. If you set a pace above what is expected of you, and you ever fail to meet your new standard, you will get poor evaluations for not producing as much as usual, even if you are still 200% above the corporate requirements.\r  \n\r  \nCorporate work environments teach great workers to be average, average workers to not have aspirations, and bad workers how to keep their jobs by exploiting HR's desire not to get sued for wrongful termination.\r  \n\r  \nFrom the move \"Office Space\":\r  \n\r  \n\"Now if I work my ass off and Initech ships a few extra units, I don't see another dime, so where's the motivation?\"",
   "created_utc": 1692645059,
   "score": 43,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx66758",
   "message": "Say less and listen more.",
   "created_utc": 1692645223,
   "score": 22,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx66upx",
   "message": "It's just a job. Spend time with your family, go to your kids' games, take that trip you always wanted \n\nYou won't be on your deathbed saying \"Damn, wish I had worked more.\"",
   "created_utc": 1692645462,
   "score": 22,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx67p89",
   "message": "look busy and work less  and keep your mouth closed about it",
   "created_utc": 1692645770,
   "score": 20,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx69by0",
   "message": "HR is not your friend",
   "created_utc": 1692646362,
   "score": 21,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx64h9v",
   "message": "Try to be born wealthy.",
   "created_utc": 1692644591,
   "score": 48,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx65f9s",
   "message": "Don’t stress about shit. It goes away.",
   "created_utc": 1692644938,
   "score": 14,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx67til",
   "message": "That hard work benefits your employer more than you.",
   "created_utc": 1692645813,
   "score": 15,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx657yr",
   "message": "Only trust yourself. Every one can drag you down if you let your guard down.",
   "created_utc": 1692644865,
   "score": 14,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx67pkp",
   "message": "Employers don't care about you, you are not a family, they would sell you down river if they could, and the second someone becomes a manager they are part of the problem",
   "created_utc": 1692645773,
   "score": 13,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx68gsx",
   "message": "Working harder than what they pay you for doesn’t workout well 95% of the time.",
   "created_utc": 1692646047,
   "score": 11,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6fvoj",
   "message": "Use your PTO\n\nJob love/loyalty won’t pay the bills \n\nIf you died, your job would have you replaced before you’re even buried.",
   "created_utc": 1692648723,
   "score": 11,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx666uf",
   "message": "Oh, when you're in high school everything will be different... nope.\n\nOh, when you're in college everything will be different... nope.\n\nOh, when you're in a career, everything will be different... nope.\n\nSome things just don't change. Take the lessons from elementary school and apply them broadly, because just like elementary school, there's always some motherfucker who just isn't content unless they're actively trying to fuck things up for everyone. Keep your focus, work hard, and advocate for yourself.",
   "created_utc": 1692645219,
   "score": 21,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx61ur5",
   "message": "Try harder in school",
   "created_utc": 1692643634,
   "score": 9,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6raf9",
   "message": "Companies don’t give a fuck about you, just what you bring to the table. Every time you are inconvenient, that is a strike against you.",
   "created_utc": 1692652873,
   "score": 9,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx63646",
   "message": "That I'm not very driven.",
   "created_utc": 1692644114,
   "score": 8,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6gkb5",
   "message": "If you do a really good job you get to do everyone else’s job too.",
   "created_utc": 1692648970,
   "score": 8,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6a9m7",
   "message": "People suck",
   "created_utc": 1692646700,
   "score": 6,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6m173",
   "message": "You are easily replaceable, \nwhy give 2 weeks notice if companies don’t give 2 weeks notice to fire/ lay you off..",
   "created_utc": 1692650933,
   "score": 6,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6wfzz",
   "message": "Take your days off. Your happiness and mental health is more important. Working more hours to try and impress will just end with you having more of a work load than you can handle. Work hard and do your job well but use your days off. They are there for a reason.",
   "created_utc": 1692654856,
   "score": 7,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6721g",
   "message": "The harder you work, the more people expect you to work hard.",
   "created_utc": 1692645537,
   "score": 5,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx69us6",
   "message": "There's a saying that if everyone around you is an asshole, then you are in fact the asshole.\n\nHowever, that may not be true when it comes to work since you can't choose who you surround yourself with. Everyone else around you may in fact be assholes, while you yourself are not.\n\nAlso, it only takes one asshole in a team to turn everyone into an asshole (provided the OG asshole is not punished for their behaviour). As the saying goes, one bad apple spoils the bunch. This [video](https://www.youtube.com/watch?v=YyXRYgjQXX0) succinctly explains why.",
   "created_utc": 1692646552,
   "score": 5,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6gv46",
   "message": "Business owners will, more often than not, expect you to care about their business as much as they do.  When you do not -- because naturally you aren't in line to receive the rewards they do -- this will be taken as an insult.\n\nIn terms of misreading one's role in the relationship... this is not a failing of the employee.",
   "created_utc": 1692649078,
   "score": 5,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx66jh7",
   "message": "They don't care about your feelings",
   "created_utc": 1692645348,
   "score": 5,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx67jfw",
   "message": "Don't work harder than anyone else.",
   "created_utc": 1692645713,
   "score": 3,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx68nod",
   "message": "Keep your work drama at work and your home drama at home.",
   "created_utc": 1692646117,
   "score": 3,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6pev5",
   "message": "working for american corporations is soul-sucking",
   "created_utc": 1692652164,
   "score": 3,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6t7at",
   "message": "Dont expect to be appreciated.   don’t expect fairness.  You only have  worth when u r working well and helping to make the  mgrs/bosses look good.  Get sick or hurt and you will see how little you are really valued.   The only great thing you have for all your hard work and dedication is personal integrity.",
   "created_utc": 1692653597,
   "score": 3,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx69gjh",
   "message": "The popularity contest from high school never ends.",
   "created_utc": 1692646409,
   "score": 8,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6u9ce",
   "message": "That they don’t care about you like they say they do!",
   "created_utc": 1692654001,
   "score": 3,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx70ra3",
   "message": "HR is not your friend, and work is not your family. Do your job, and do it well, but nothing more.",
   "created_utc": 1692656592,
   "score": 3,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx74ual",
   "message": "When their job security is threatened, people will do anything to keep their job. That includes throwing you or anyone they can under the bus. That doesn't mean there are some noble people out there, but you shouldn't expect people to be noble",
   "created_utc": 1692658311,
   "score": 3,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx79c0f",
   "message": "That it is in no way a meritocracy. The corporate world will show you there are staggering number of idiots or assholes in positions of power, and it always is just who they know.",
   "created_utc": 1692660208,
   "score": 3,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx656gu",
   "message": "Learn to take your lumps and learn from them.\n\nAlso, being present at the worksite will afford you more opportunities than those that work remotely (unfair but true)",
   "created_utc": 1692644850,
   "score": 5,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6awo4",
   "message": "- Document everything\n\n- Soft skills are as important as hard skills, a team of all technically skilled people with no soft skills is miserable, despite what Reddit so often claims\n\n- Skilled management is way better than no management, your direct boss will make or break the job\n\n- Career jobs expect you to take individual initiative - skating will only keep you in good graces for so long\n\n- There is still some value to in-person interactions and some exercises are best in person (however, I still think the majority of work should be WFH-allowed when digital)\n\n- A lot of Reddit is projecting their experience at service-level jobs to career-facing jobs in threads like this, so take it with a grain of salt here",
   "created_utc": 1692646930,
   "score": 3,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx625hd",
   "message": "Nobody cares about my money like I do.",
   "created_utc": 1692643742,
   "score": 2,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx69oqw",
   "message": "Don't rely on anyone to care about your career but you. If you want something, go after it. Do **not** wait for good things to happen to you (and then wonder why they don't!)",
   "created_utc": 1692646492,
   "score": 2,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6n1vp",
   "message": "Don’t work for a company that’s public in the stock market. Most CEOs like mine will sacrifice your benefits, raises, and overall well being to please shareholders and make the stock go up.",
   "created_utc": 1692651299,
   "score": 2,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6vtt3",
   "message": "That the company can make a record amount of money during a pandemic and work you to death but still can't afford to give you a pay raise.",
   "created_utc": 1692654616,
   "score": 2,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6vvzf",
   "message": "That I should have taken investing much, much more seriously when I was younger.",
   "created_utc": 1692654638,
   "score": 2,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx71kat",
   "message": "If they tell you they value your feedback, give it but don’t expect them to like hearing it for every situation. There’s not always a way to know when to speak up and when not to.",
   "created_utc": 1692656927,
   "score": 2,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx78e8n",
   "message": "You're always replaceable, you're just a person filling a role. I worked in an office, we all walked in to work one morning to an email informing us that someone in the office had passed away tragically in an accident after work the previous day. That person was kind, they were great at their job and made everyone feel welcomed, we all felt that loss... but they had that job listing up by the end of the week.\n\nLike I get it, the job needed to be filled but the person that passed wasn't even in the ground yet. That's when I realized I didn't need to go above and beyond at work. Just do what I'm paid to do and go enjoy my life outside of work because at the end of the day they'll replace me as soon as they can.",
   "created_utc": 1692659812,
   "score": 2,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6k9vm",
   "message": "No one gives a damn about your personal life",
   "created_utc": 1692650292,
   "score": 3,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx69yyu",
   "message": "Money is nice.",
   "created_utc": 1692646594,
   "score": 2,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx681p3",
   "message": "The value of a dollar.",
   "created_utc": 1692645896,
   "score": 0,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6h6g2",
   "message": "That schools and universities are BS in a lot of fields. \n\nI never finished school, never went to uni, and I'm better qualified than pretty much every fresh hire that came to where I used to work. While others went to uni to learn sales and marketing, I got a job at 16 in sales, moved up to marketing, did digital marketing, and by the time I had friends coming out of uni with their sales and marketing degrees and looking for jobs, I was launching my own business.\n\n\u0026amp;#x200B;\n\nAlso, big companies don't care about you. At all.",
   "created_utc": 1692649192,
   "score": 0,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6kpw9",
   "message": "The amount of work you put in, the way you present yourself, and every accomplishment you've ever had DO NOT MATTER. I was reprehended for saying I don't want to come in a third day (only work 2 days a week). My tone was \"off-putting\" because I used a period and never spoke up before. Despite saving the company over $300,000 per year. None of it matters.",
   "created_utc": 1692650454,
   "score": 0,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6v3rv",
   "message": "normal people don’t understand and are scared of the system that’s supposed to help them\n\n(i’m in healthcare and myself alongside every coworker i’ve ever had want to do everything we can to help you understand and afford everything you need)",
   "created_utc": 1692654329,
   "score": 0,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx66ffc",
   "message": "They're stealing everyone's disabled (from birth by an invisible disability) labor\n\nAnd every nuerodivergent is being exploited this way as well if they don't have access to adequate and community centered behavioral healthcare",
   "created_utc": 1692645306,
   "score": 254,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx65ros",
   "message": "To work towards something better",
   "created_utc": 1692645065,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6axcc",
   "message": "working for someone else is for the birds. be your own boss. it's much better.",
   "created_utc": 1692646937,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6cwy0",
   "message": "You don't need to make fake friends at work. Just go there to make money and that's it",
   "created_utc": 1692647654,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6dfii",
   "message": "You should have a backup for income stream. Because you could be fired from the company anyday without notice. That happened to me with my first job. I wasn't even notified about it. One day I went to the workplace and got to know that me and my boss wwere fired because of my boss's irresponsible behavior. Since then I maintain two income streams. One of them is my freelance career which is my own business.",
   "created_utc": 1692647838,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6doo2",
   "message": "Human Resources is there to look out for the company the majority of the time.",
   "created_utc": 1692647930,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6g4gp",
   "message": "Doing everything as well and as fast as possible only gets you more work.",
   "created_utc": 1692648810,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6gncv",
   "message": "That no one cares about you unless you're doing something for them.",
   "created_utc": 1692649000,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6h8hh",
   "message": "Trust no one.",
   "created_utc": 1692649212,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6hron",
   "message": "Weirdly, my biggest take away has been that no matter where you go, there will be issues. The key is finding the issues that you can live with, build a little reputation, and start working to implement positive change. The right workplace, at least in my experience, will most likely notice, and your work life will generally improve as change takes hold. I guess what I’m saying is that patience goes a long way.",
   "created_utc": 1692649405,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6hxpz",
   "message": "Trust nobody and that most people are barely competent.",
   "created_utc": 1692649466,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6ibwz",
   "message": "Don't work super hard, because you will set a standard for hard work.\n\nSo then when you work average, even if your still performing perfectly fine compared to others, your still performing worse compared to yourself, they will see it as a negative and use it against you.",
   "created_utc": 1692649603,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6inel",
   "message": "Your a number,  not a person",
   "created_utc": 1692649713,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6izgz",
   "message": "If you died today, you could be replaced tomorrow. Business goes on, life does not. Take your time off. Take your vacation. Be loyal to no job, only your family.",
   "created_utc": 1692649832,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6j2sr",
   "message": "Do your work\n\nGo home\n\nIt's easy.",
   "created_utc": 1692649865,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6jpwt",
   "message": "Follow through with what you say, no one has your best interests in mind, take care of yourself and do your best for a solid work/life balance.",
   "created_utc": 1692650094,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6km01",
   "message": "People will throw their morals, if they have any, out the window if they want to climb the ladder, especially in the corporate world. \n\nThe best way to get to know people from work is through a shared hobby or interest. I became friends with some high up people via after work clubs. During these clubs, do not talk about work. \n\nThe company will never thank you for not taking a vacation. Take the damn vacation.",
   "created_utc": 1692650415,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6kvc3",
   "message": "Working hard doesn’t always get rewarded.",
   "created_utc": 1692650510,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6mxwx",
   "message": "I had to prove my value everyday.  There could not be an incident that would cause my employer to question my value as an employee. .\n\nPretty simple, really.",
   "created_utc": 1692651260,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6p3qo",
   "message": "Performance punishment is a real thing. Overworking high performers to pick up the slack of the under performers.",
   "created_utc": 1692652047,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6pdkn",
   "message": "That we are still mentally children.",
   "created_utc": 1692652150,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6rv01",
   "message": "You're replaceable,you may get the occasional \"atta boy\" or \"atta girl,\" but you're 100% replaceable,they can have someone trained up in a few weeks to do your job. Your hard work and ideas might,might,pay off and get you a promotion,but why promote someone who knows what's going on? That one star employee can train employees, keep up with the work,and perform their duties on a S tier level.",
   "created_utc": 1692653087,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6rwbn",
   "message": "Got this advice when I started in construction 20 years ago: You can't mess it up enough to where it can't be fixed.\n\nI know you can mess something up BAD, but you aint going to jail and the worst they can do is fire you, and you'll find something else. Otherwise just be careful and don't be SCARED of the work. We are all just pretending we know what the hell we are doing until a decade passes and you got your shit down pat.",
   "created_utc": 1692653101,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6s41m",
   "message": "Trust no one,your coworkers are not your friends, you're replaceable,do your tasks only nothing more",
   "created_utc": 1692653182,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6tjm4",
   "message": "Don't settle. Look for new opportunities. Whether that is further education/certification, promotions, or just looking for a higher-paying job or a job with a better management structure.",
   "created_utc": 1692653729,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6twbx",
   "message": "That it can end no matter what. I was at the same company for 13 years. From 21 when I was in the coat check to a corporate position overseeing the entire country. Last Wednesday I was called in and told that my position was terminated due to budget cuts.",
   "created_utc": 1692653862,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6u0wn",
   "message": "Loyalty and hard work don't get you ahead they get you taken advantage of.",
   "created_utc": 1692653911,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6ub85",
   "message": "HR is not there to protect you,  it is there to protect the company.",
   "created_utc": 1692654021,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6utuh",
   "message": "Most companies cause significantly more harm to the world than benefit.",
   "created_utc": 1692654222,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6uyf1",
   "message": "Wealth does not correlate with intelligence, willpower, or capability; but is almost exclusively tied to luck.",
   "created_utc": 1692654271,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6vnqn",
   "message": "Anyone and everyone can be a potential shoplifter. Theft is increasing and anyone is capable of stealing.",
   "created_utc": 1692654551,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6wbbk",
   "message": "Involve / file an EEO complaint and/or a state labor board complaint and/or federal wage theft to get your employer to act correctly",
   "created_utc": 1692654804,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6wwyt",
   "message": "Stupidity rises",
   "created_utc": 1692655042,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6x6la",
   "message": "Don’t ever fully rely on your employer to be there for you, be cautious.",
   "created_utc": 1692655149,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6x9oa",
   "message": "Step on everyone to advance.",
   "created_utc": 1692655182,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6xahb",
   "message": "You have 4 grandparents.",
   "created_utc": 1692655191,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6xe66",
   "message": "That they can fire you because they don’t want to pay you.",
   "created_utc": 1692655231,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx6y1sv",
   "message": "Money keeps you from starving",
   "created_utc": 1692655491,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx704ym",
   "message": "You’ll learn more on the job than you ever will at school. \n\nIf you fail on school, you get a bad grade and the teachers move on. \n\nIf you fail on the job, the company fails. The employer has more at stake if you don’t succeed, and will push you to learn.",
   "created_utc": 1692656339,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx70g8f",
   "message": "You get paid more when you work",
   "created_utc": 1692656466,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx70my1",
   "message": "A well-paying job that drains your soul is not worth it. Your time and your sanity are worth more than money.",
   "created_utc": 1692656542,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx70ogk",
   "message": "half of life really is just showing up (on time and presentable)",
   "created_utc": 1692656560,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx72zkf",
   "message": "Life sucks and then you die.",
   "created_utc": 1692657525,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx74xcj",
   "message": "You don’t have friends unless you leave and they still are your friends. All the coworkers you go out of your way for, typically forget you exist. I haven’t heard from most of the coworkers from a job from 3 years ago at all. I thought we were pretty good but apparently not. I know from job i just left, I’ll hear from and see 3 that are still there.",
   "created_utc": 1692658346,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7531f",
   "message": "Thought this said unemployment, was gonna be all like “get a job”",
   "created_utc": 1692658412,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7579g",
   "message": "Keep. \n\nYour. \n\nMouth. \n\nShut.",
   "created_utc": 1692658462,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx75cqm",
   "message": "How common nepotism is\n\nHR covers the company not you\n\n\"If you don't like him, promote him\"",
   "created_utc": 1692658526,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx75deo",
   "message": "Employees and employers will lie to you and about you and you can't trust anyone. They also don't give a shit about any of you.",
   "created_utc": 1692658534,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx75eov",
   "message": "School doesn’t teach you how the real world works",
   "created_utc": 1692658549,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx787di",
   "message": "That I don't like people",
   "created_utc": 1692659732,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx78jbi",
   "message": "Metrics-focused customer service is bullshit.",
   "created_utc": 1692659872,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx78pot",
   "message": "A strong work ethic and hard work will only lead to more work, not appreciation. \n\nYour employer can and will take advantage of you in any and every way possible.\n\nYour coworkers are not your friends.",
   "created_utc": 1692659946,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx79cvf",
   "message": "Thst luck is the biggest factor when it comes to new jobs",
   "created_utc": 1692660218,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx79edy",
   "message": "You are replaceable. Quite easily.",
   "created_utc": 1692660236,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7a3g8",
   "message": "Your manager's job is to solve your problems, not the other way around.",
   "created_utc": 1692660532,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7adb4",
   "message": "Find a happy-medium between getting comfortable without becoming complacent. Very challenging.",
   "created_utc": 1692660650,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7bbfs",
   "message": "That a terrible day at home is better than a terrific day at work.",
   "created_utc": 1692661050,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7bbhl",
   "message": "These companies do not care about you. You owe them nothing. If you were to drop dead today, your job would be posted tomorrow. So take that extra time off. Why not.",
   "created_utc": 1692661051,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7bfra",
   "message": "People who say and/or act like they are \"irreplaceable\" frequently find out that they are.",
   "created_utc": 1692661101,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7bh8q",
   "message": "Wage Slavery is brutal, retirement is bliss.",
   "created_utc": 1692661118,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7dimh",
   "message": "Don't sweat the small mistakes.  I'm a replaceable cog in a machine with plenty people above me.  If I make a minor mistake, nothing bad is going to happen; the worst thing I can do is call attention to it.",
   "created_utc": 1692661985,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7dpzg",
   "message": "You have to work hard for what you want. People don’t give handouts.",
   "created_utc": 1692662074,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7e9nh",
   "message": "The only people with rights and legal issues are people who have lawyers.",
   "created_utc": 1692662310,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7ftlr",
   "message": "that food service is a terrible industry to be in and wfh is the only way to work",
   "created_utc": 1692662980,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7i7jc",
   "message": "Work for yourself because your job is never secure.",
   "created_utc": 1692663990,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7iqmr",
   "message": "No employer will give a fuck about you, your personal life, your family or your personal life/issues/problems etc. They pay you to do a job and that is all.",
   "created_utc": 1692664216,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7jeqd",
   "message": "Life is unfair.",
   "created_utc": 1692664501,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7k2rd",
   "message": "That you will be hated unless you actively kiss ass.",
   "created_utc": 1692664787,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7k4ce",
   "message": "Never ever let your work know your social media!  They can and will use it against you!",
   "created_utc": 1692664806,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7kcee",
   "message": "The more work you get done the more work they’ll give you",
   "created_utc": 1692664901,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7lgy1",
   "message": "You either play the system or the system plays you.",
   "created_utc": 1692665380,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7n2y2",
   "message": "fuqpayme",
   "created_utc": 1692666069,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7n5ad",
   "message": "Don't go above and beyond. It won't be rewarded, only expected. And only devalues your own time and labor.",
   "created_utc": 1692666097,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7np6u",
   "message": "Never give 100% when you first start. You’ll have nothing left to give.",
   "created_utc": 1692666333,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7quef",
   "message": "You’re nothing but a number, never stay with a company out of loyalty they’ll dump you the second it suits their interests",
   "created_utc": 1692667698,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7rd00",
   "message": "Rules to live by. \nDon’t work with family\n\nA job is a means of getting paid, don’t work for free. \n\nIf management says we are family see the first rule.",
   "created_utc": 1692667925,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7rd2b",
   "message": "The biggest reward for doing great work is…\n\n\nMore work.",
   "created_utc": 1692667926,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7rim0",
   "message": "People are stupid",
   "created_utc": 1692667993,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7sf2q",
   "message": "Never work 100% because you'll always be expected to work at 100%. Also if you're vastly outperforming your peers you should put on the brakes. Your coworkers will like you better and you'll easily be able to do your job, even if you don't feel the best.",
   "created_utc": 1692668393,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7skin",
   "message": "Everyone is replaceable.",
   "created_utc": 1692668462,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7swbk",
   "message": "Sometimes you are lucky and feed your soul, most times it’s to feed your dog. My soul has been fed a few times this year. But my dogs is fat, lazy and happy. Work means sucking it up buttercup.",
   "created_utc": 1692668608,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7t8ry",
   "message": "Loyalty and working hard means absolutely nothing.",
   "created_utc": 1692668763,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7tekd",
   "message": "The most petty arguments can turn ugly real fast",
   "created_utc": 1692668835,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7tq51",
   "message": "I miss being a stay-at-home-mom, and the freedom of time.",
   "created_utc": 1692668980,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7u6zl",
   "message": "You are a middleman for rich people.",
   "created_utc": 1692669185,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7v5l3",
   "message": "RN here. Show the fuck up.",
   "created_utc": 1692669611,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7vjln",
   "message": "You are only there to make a paycheck, not friends.",
   "created_utc": 1692669783,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7w8bb",
   "message": "They'll need you to come in, even at your own funeral.",
   "created_utc": 1692670092,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7x24f",
   "message": "You have to work to live. If you're smart when you're young, you'll find a good job doing something you love that has a great retirement plan. Otherwise,  you just work to live.",
   "created_utc": 1692670464,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7xjoz",
   "message": "An asshole boss can make doing something you love miserable. A great boss can make doing something you don't like better. I was a florist and loved it but had a couple miserable bosses that made the job intolerable. Had great bosses at a pizza place where we worked flat out in a hot kitchen on 10-11 hour shifts and we had fun.",
   "created_utc": 1692670687,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7xlpy",
   "message": "Trust no one",
   "created_utc": 1692670713,
   "score": 1,
   "submission_id": "15xga5b"
  },
  {
   "comment_id": "jx7ya56",
   "message": "Never get comfortable or complacent. Life has a way of pulling the rug out from under your feet when you least expect it.",
   "created_utc": 1692671015,
   "score": 1,
   "submission_id": "15xga5b"
  }
 ]
}