{
 "submission_id": "15xikc7",
 "title": "What's a problem that's never addressed in apocalyptic movies?",
 "selftext": "",
 "created_utc": 1692648627,
 "permalink": "/r/AskReddit/comments/15xikc7/whats_a_problem_thats_never_addressed_in/",
 "score": 85,
 "url": "https://www.reddit.com/r/AskReddit/comments/15xikc7/whats_a_problem_thats_never_addressed_in/",
 "comments": [
  {
   "comment_id": "jx6pbyz",
   "message": " Caffeine and nicotine withdrawal.  After a week, there are going to be a bunch of very grumpy people around.\n\nCigarettes and coffee are going to be valuable exchange items.",
   "created_utc": 1692652134,
   "score": 125,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6mnv9",
   "message": "Hiker here. There are three main things you care about while on the move or in a camp, and none of them is addressed in any media:\n\n1) Footwear and foot hygiene. A good pair of shoes is ESSENTIAL for long marches and bad/junky/absent pair would quite literally kill your feet and joints. Socks and/or wraps also go here as a \"must have\". \n\n2) Camp setting in general. You know what is bad for your health? Cold ground. You want to have a failure in your every organ below the ribcage? Couple of months of outdoor sleep would definitely do it. Sleeping bags are great, but they are designed to keep you from losing heat into the air, not into the ground — think of them like of portable blankets. You don't see apocalyptic survivors making an insulated bed or sleeping in a hammock.\n\n3) Nutrition. Proper nutrition. There are literally hundreds of guides on what and how you should eat on the move, all I am going to say... Dear Ellie, good luck surviving on that rabbit.",
   "created_utc": 1692651158,
   "score": 114,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6rd0k",
   "message": "If it goes on long enough, keeping cars operational. Tires going bad,  gasoline going bad, even fuel lines going bad if a car's been sitting for a few years. Mice chewing on the wires. Sometimes they'll show the effort to obtain gas (but never address it going bad over time) and sometimes they'll show a battery being jumped, but mostly it's hop in a car you just found and drive off.",
   "created_utc": 1692652900,
   "score": 34,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6obpz",
   "message": "Dental care. How many people would be straight up dying from abscesses, or in pain from fucked teeth.",
   "created_utc": 1692651759,
   "score": 100,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6go10",
   "message": "Women ALWAYS have bare legs and armpits 🙄",
   "created_utc": 1692649007,
   "score": 117,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6rqvm",
   "message": "A zombie will starve eventually, probably in a week or 2. Otherwise their energy of movement is purely magical. Only a few will feed; most will be out of luck. And will freeze solid in the winter because they're too dumb to seek shelter. There can't be an ongoing zombie apocalypse, it would be over in weeks.",
   "created_utc": 1692653044,
   "score": 24,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6jotn",
   "message": "At least in zombie movies in modern times (with phones, news, internet, etc.), they never really address WHY the zombies were able to kill off 90% of the population so all that's left are small factions of humans scattered around. Especially with slow-walking zombies, once it was figured out that there are rotting crazy people walking around the streets attacking people, and they seem to be contagious like a virus, everyone would lock their doors, and the military/police/national guard would come in to start wiping them all out. End of scenario.",
   "created_utc": 1692650083,
   "score": 31,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6o1lx",
   "message": "Disease. Seriously if most doctors and infrastructure are gone, people would be dying left and right, and zombies or radiation would be the least of their problems",
   "created_utc": 1692651657,
   "score": 30,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6idji",
   "message": "Lawncare/overgrowth\n\nNot all of them, but TWD for example, all of the lawns were tended to as if there WASN'T you know, a zombie apocalypse happening.",
   "created_utc": 1692649618,
   "score": 21,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6t595",
   "message": "The situation is already \"apocalyptic\" but no one mentions what would happen to the nuclear power plants/weapons without 24/7 maintenance.",
   "created_utc": 1692653576,
   "score": 17,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6tbh7",
   "message": "Glasses!",
   "created_utc": 1692653642,
   "score": 8,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6fv15",
   "message": "where do they shit\n\nim sure theres a good answer i just wanna see it",
   "created_utc": 1692648717,
   "score": 21,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6s2e8",
   "message": "Slavery.  The breakdown of society will bring slavery. \n\nSexual assault.  Same with this.  \n\nPregnancy.  There would be a lot of pregnancy.  Babies everywhere after a year.  \n\nPoorly set broken limbs.\n\nTeeth falling out.",
   "created_utc": 1692653164,
   "score": 21,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6xoj8",
   "message": "Gasoline rots.  Gasoline doesn’t remain stable for more than a few months. At least in mad max they wrote gasoline production into the storyline. Though it would probably be really hard to do on a small scale without a real knowledge of chemistry.  And without reverting back to lead based additives.",
   "created_utc": 1692655344,
   "score": 6,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6nx0p",
   "message": "Charging their walkie talkie batteries.\n\nZombie apocalypse and they always have freshly charged radio batteries that last... forever.\n\nJust once I wanna see someone sit down and stick their radio in a charging cradle.",
   "created_utc": 1692651611,
   "score": 10,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6niqz",
   "message": "Obtaining drinkable water, often enough to stay hydrated.\n\nIRL this would be your biggest challenge, even greater than food, unless you happen to live in some unspoiled paradise that's coincidentally free of natural microbes that will make you sick.  There's basically two places like that on Earth, neither of which is ever featured in disaster movies, and both of them are in climates where a dozen things other than water will kill you.",
   "created_utc": 1692651470,
   "score": 15,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6mos4",
   "message": "Having braces",
   "created_utc": 1692651167,
   "score": 10,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6ttxc",
   "message": "Diarrhea. So many things can cause it, and it used to be (well, still is in the least developed countries) quite lethal, mostly for babies and children.",
   "created_utc": 1692653837,
   "score": 6,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6yw8f",
   "message": "Persons with diabetes wouldn't live long after an apocalypse.\n\nAlso, depending upon how quickly the end of civilization comes, the thousands of engineers at the world's over 400 nuclear reactors better get them all shut down safely, and the fuel stored properly and permanently. Otherwise, it will be hundreds of Chernobyls, worldwide, in just a few weeks.\n\nGasoline goes bad in months, especially the higher the ethanol in it. Better get used to bicycles.",
   "created_utc": 1692655829,
   "score": 5,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx70jkz",
   "message": "Body hair for women.\n\nI mean, you will see this woman in rags, covered in dirt, with the stringiest hair that looks like it hasn't been washed, much less conditioned in a year. Yet, they have perfect brows and look like they've had a full-body wax within the past week. So, they must be doing this somehow.",
   "created_utc": 1692656503,
   "score": 4,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6g1y8",
   "message": "How they don’t treat open wounds with any anti-bacterial but somehow never die of infection.",
   "created_utc": 1692648785,
   "score": 19,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6xgvw",
   "message": "The seasons, but winter specifically.\n\nLike did you stockpile enough supplies for the winter? If you’re well into an apocalypse, then no doubt that markets/stores and nearby houses have already been looted. Do you have warm clothing and blankets with how cold it can get? Any way of having sources of heat and keeping it alive assuming if there’s no power. Is the location your staying ideal for holding out til Spring? And what’s the plan if starts snowing a lot? If anyone knows a good movie that explores this I’d like to know so I can watch but I’d like to see movies explore this issue",
   "created_utc": 1692655261,
   "score": 4,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6xry9",
   "message": "No one has dysentery. Everyone would have dysentery.",
   "created_utc": 1692655383,
   "score": 4,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7049c",
   "message": "Why do \"traditional zombies\" only make noise when they're right up in your business?\n\nZombie moving through the woods in stealth mode, no branches snapping, no leaves rustling, no moaning or growls. \n\nBut right when they're about to get their funky zombie mitts all over your throat, they are loud as shit.\n\nWhat's the deal?",
   "created_utc": 1692656331,
   "score": 4,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7862z",
   "message": "I'm not 100% sure on this; but I've heard somewhere before that gasoline expires eventually.",
   "created_utc": 1692659718,
   "score": 4,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6t29r",
   "message": "Why no one ever remembers or talks about the world before the collapse.\n\nPeople never talk about favorite movies \u0026amp; TV shows, no one ever complains about never finding out how their favorite series ends. If there's a singing scene, it's something made up on the spot (usually tribal-sounding for some fucking reason) - no one's belting out Britany Spears to cheer themselves up.\n\nEven from a world building standpoint, you'd expect to hear people talking about politics, who's to blame for the world getting to that point, who's gonna be in control next, etc.",
   "created_utc": 1692653544,
   "score": 6,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6jmr8",
   "message": "Apocalyptic movies often skip over the issue of repopulation. It's a delicate, yet crucial topic!",
   "created_utc": 1692650062,
   "score": 9,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6qjng",
   "message": "It's sometimes touched upon and usually resolved by scrounging meds but INFECTION and disease.  Antibiotics expire and become useless as do most other meds but somehow, after 20yrs of apocalypse, those pills in the back of the old pharmacy are still saving lives.\n\nAfter a zombie outbreak or any other disaster, there would still be horrific bacterial infections, pneumonia, viral flu, strep, etc etc etc.",
   "created_utc": 1692652594,
   "score": 3,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx71mhc",
   "message": "* Bathing\n* Dental hygiene\n* How girls constantly have perfect makeup.\n* What the characters wipe with after pooping.\n* Food preservation\n* Clothing and repairs\n* Power generation\n* Pet care\n* Childbirth and maternal care.\n* Menstrual hygiene\n* Eyeglasses\n* Prescription medications\n* Sanitation and waste management for when the characters establish a permanent home.",
   "created_utc": 1692656952,
   "score": 3,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx73261",
   "message": "This is why I liked the book Station Eleven. Post-apocalypse, they have:\n\nSomeone who is blind because they lost their glasses \n\nSomeone who runs out of prescription psych meds and can’t function \n\nSomeone who dies from an infected cut\n\nPeople who scavenge look for soap, then clothing, then other things",
   "created_utc": 1692657555,
   "score": 3,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7a39c",
   "message": "Why do zombies have stitched up wounds? Who's giving them medical care?",
   "created_utc": 1692660530,
   "score": 3,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6m5a6",
   "message": "Feminine hygiene products.",
   "created_utc": 1692650973,
   "score": 6,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6p98n",
   "message": "Theres only one plan that would work, but it was thought of by this guy\nhttps://youtu.be/TBan2JkWbhs",
   "created_utc": 1692652105,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6sifs",
   "message": "Gas goes sour, gunpowder stales, drinking water requires distillation (or at least filters)",
   "created_utc": 1692653333,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6tw9l",
   "message": "Considering how I had to take my fiancee to the ER this morning because of what should have been a minor UTI that traveled to her kidneys...",
   "created_utc": 1692653861,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6vn4e",
   "message": "Periods.",
   "created_utc": 1692654544,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6wkhq",
   "message": "Shaving.",
   "created_utc": 1692654905,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6ws44",
   "message": "Zombies are never called zombies.",
   "created_utc": 1692654990,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6xf6w",
   "message": "Laundry",
   "created_utc": 1692655242,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6ybyw",
   "message": "Withdrawals for the normal things like coffee heck my friend starts having symptoms if he doesn't have a monster per day",
   "created_utc": 1692655604,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx73o4l",
   "message": "If water plants went offline, as they would in such a scenario, there would be a lot of effort made just to have water you and your people can drink.\n\nClean water would become a huge value item.",
   "created_utc": 1692657814,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx770s2",
   "message": "People in movies often travel a lot of distance with next to no food or water on them.  If you are on foot you would need a descent amount of calories to sustain your energy.  And a good pair of shoes. Your feet would be a mess in no time. And you would stink to high heaven.",
   "created_utc": 1692659237,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx771tc",
   "message": "I read this question and my mind instantly goes back to the ending of Shaun of the Dead, where the army finally arrive and restore order. In a way, Shaun was right; If they had just waited, it would've blown over and they all would've been alright.",
   "created_utc": 1692659250,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx77r9s",
   "message": "Read Earth Abides. Very realistic view of what could happen post apocalypse. Spans about 50 years. It's one of my favorite books.",
   "created_utc": 1692659546,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx77zvs",
   "message": "Grid down the infrastructure would collapse rapidly. Roads would be rapidly covered with trees, crashes, other debris and would become impassable quickly. Electrical and water systems going down would make finding water that could be made potable would probably take most of your time. Lakes and rivers would probably become polluted instantly from people using them for clothes, toileting, other dumb stuff ( people who fire lead ammo in water sources I'm looking at you). Most water filters aren't rated for those kinds of pollution. \n\nGasoline goes bad in like 6 months, unless you use products like Sta-Bil. You might get a year. Ride a bike or eBike people. \n\nHunting and foraging for food is pretty laughable. I figure most edible species will be wiped out quickly in a true long term disaster scenario. Everyone with half a brain cell will be trying to catch whatever they can.",
   "created_utc": 1692659646,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx78uym",
   "message": "One you never see is that in most cities you have about 3 days till things just start exploding because no one is running the utilities. Gas lines are being almost constantly fiddled with to make sure pressure doesn’t build up anywhere in the system and cause an explosion.",
   "created_utc": 1692660008,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx79i5d",
   "message": "Prescription drugs.\n\nHow're you supposed to get that heart medication, pain medication, antidepressants, or insulin? Raiding pharmacies is only going to get you by for maybe a month or so. Any medication that needs to be refrigerated is gone too. What about your chemo treatments? Or dialysis?\n\nThere goes 10's of millions of people in the first week or so.",
   "created_utc": 1692660279,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7byli",
   "message": "OP crowdsourcing story ideas. Good on you, my dude.",
   "created_utc": 1692661321,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7c8jv",
   "message": "That a weirdly high amount of people will shout about how there is no apocalypse going on.",
   "created_utc": 1692661439,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7e8n0",
   "message": "Overweight people. How are they getting the calories to maintain their obesity.",
   "created_utc": 1692662298,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7h10g",
   "message": "Gasoline goes bad.",
   "created_utc": 1692663495,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6jhjk",
   "message": "For completely crazy people who’ve seen shit and are also criminals (where true) and are running around with swords and chainsaws, they’re awfully organized and cooperative and exhibit strong leadership and other skills far beyond the people who are supposed to be normal.",
   "created_utc": 1692650010,
   "score": 4,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6irfq",
   "message": "People jerking off literally everywhere.",
   "created_utc": 1692649752,
   "score": 5,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6u3az",
   "message": "Breaking HOA rules",
   "created_utc": 1692653936,
   "score": 2,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6r6k6",
   "message": "A post-apocalyptic society would not become a society of anarchy \u0026amp; chaos as the survivors would either rebuild the old society or create a new \u0026amp; better society from scratch.\n\nIt would be difficult but it can be done.",
   "created_utc": 1692652833,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6yqjv",
   "message": "Gas goes bad within a year or so. Any \"3 years later\" cuts that involve people using internal combustion engines are nonsense unless they've gotten the refineries running again.\n\nEdit: I lied, it starts to degrade after about 6 months. Even worse lol.",
   "created_utc": 1692655766,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx76y1a",
   "message": "Dental care and body odor",
   "created_utc": 1692659205,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7h4v1",
   "message": "how did she drive onto the island in I Am legend?",
   "created_utc": 1692663540,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6podr",
   "message": "Hair and make up",
   "created_utc": 1692652264,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6s3bx",
   "message": "Those little day to day health, hygiene, and disability problems we take for granted that we can care for. Everyone seems ready to apply a tourniquet but no one gets a headache, breaks their glasses, or starts their period.",
   "created_utc": 1692653174,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6t7y6",
   "message": "Women magically stop having their time of the month. Proper nutrition. In movies where it's packed with action, when do they drink water? Does water still exist?\nPlus I know that this doesn't really count, but in every movie where aliens attack the world, it's always The USA. What's the deal with that?",
   "created_utc": 1692653605,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6uvb7",
   "message": "Minor injuries or diseases can be deadly if not treated by a professional or the proper medicine. If there’s some type of settlement or camp to go to then it could be less of a problem. \n\nBroken bones can kill you via internal bleeding and something like a stab or gunshot wound requires months of recovery.",
   "created_utc": 1692654237,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx6wdwu",
   "message": "How do people get around with the leftover scraps of supplies left, surely there’s gonna be those few guys that won’t accept it and continue to try and charge everyone",
   "created_utc": 1692654833,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx724uy",
   "message": "* Periods are never dealt with\n* Hair is still well maintained, women's bodies are shaved\n* Gas goes bad in three to six months, yet people go around driving old cars and trucks after decades (looking at you Last of Us)",
   "created_utc": 1692657166,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx72578",
   "message": "Reproductive health.",
   "created_utc": 1692657170,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7564s",
   "message": "All the nuclear plants around the world melting down.",
   "created_utc": 1692658448,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx75y5k",
   "message": "The likelihood of “those” characters portrayed actually surving an apocalypse",
   "created_utc": 1692658778,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx76xzq",
   "message": "Toilet paper",
   "created_utc": 1692659205,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx779qn",
   "message": "Bathroom breaks",
   "created_utc": 1692659341,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx77rll",
   "message": "The fact that people aren't morons assuming they are classic zombies slow, spread by bite etc they would get a few hundred people at most before word was out and they were utterly destroyed.  O no a few zombies in the street walk backwards and hit them in the head with a spear or knock out some stairs from a house and spear them from up there etc etc.",
   "created_utc": 1692659550,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx78m55",
   "message": "Women we walking round with perfect makeup and hair",
   "created_utc": 1692659905,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx79hzu",
   "message": "Disease.",
   "created_utc": 1692660277,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7b2fz",
   "message": "Hemorrhoids.",
   "created_utc": 1692660945,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7b586",
   "message": "Human waste literally never gets a second thought, and any settlement over 3 people would have major sanitation issues.",
   "created_utc": 1692660978,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7cd2d",
   "message": "Street addresses in third world countries.",
   "created_utc": 1692661492,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7cf27",
   "message": "Mental health and stress, they always greatly overestimate how held together and stoic everyone would be... Most people will actually die from it, just the mental inability to continue to suffer",
   "created_utc": 1692661516,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7crfp",
   "message": "Needing contacts or glasses.",
   "created_utc": 1692661665,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7ctho",
   "message": "Any decent military would make short work of a zombie apocalypse.",
   "created_utc": 1692661690,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7dc3w",
   "message": "More reliance on anal sex to prevent pregnancy.\n\nWishful thinking perhaps.",
   "created_utc": 1692661910,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7dxjt",
   "message": "See I’m in that niche thing of “what about all the people who died in that event, other than the main characters?” I kinda feel like that’s easily brushed aside as “millions died and we barely get any idea what that means to the world post-apocalypse.” \n\nI feel like that would be adressed in one way or another.",
   "created_utc": 1692662165,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7eqlq",
   "message": "how to properly dispose of ur poop.",
   "created_utc": 1692662513,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7er7y",
   "message": "I always think about what would happen to a contact/glasses wearer. If something happens to your glasses you’re SOL",
   "created_utc": 1692662521,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7f46m",
   "message": "Zombies freezing up nort and by wintertime.\n\nSaw it once in Znation.",
   "created_utc": 1692662677,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7ft4l",
   "message": "All that toilet paper that people hoarded during the pandemic would become really valuable…",
   "created_utc": 1692662974,
   "score": 1,
   "submission_id": "15xikc7"
  },
  {
   "comment_id": "jx7fzzk",
   "message": "where all the bicycles went",
   "created_utc": 1692663057,
   "score": 1,
   "submission_id": "15xikc7"
  }
 ]
}