{
 "submission_id": "15xo9ze",
 "title": "What did your ex do that made you instantly break up with them?",
 "selftext": "",
 "created_utc": 1692661296,
 "permalink": "/r/AskReddit/comments/15xo9ze/what_did_your_ex_do_that_made_you_instantly_break/",
 "score": 93,
 "url": "https://www.reddit.com/r/AskReddit/comments/15xo9ze/what_did_your_ex_do_that_made_you_instantly_break/",
 "comments": [
  {
   "comment_id": "jx7hy0a",
   "message": "She hit me",
   "created_utc": 1692663879,
   "score": 108,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx89jnx",
   "message": "She had a best friend who hated me. That guy lied to her and said that I'd been DM'ing tons of girls the entire time we dated. I told her *you can go through my phone* and know he's fucking lying. She said \"he would never lie to me.\"\n\nSo you're allowed to develop this close male friendship and I'm in trouble over *fictional* ones? Instant breakup.",
   "created_utc": 1692676612,
   "score": 124,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7d7c7",
   "message": "Left rehab early and immediately resumed her bad habits",
   "created_utc": 1692661853,
   "score": 55,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7z0zc",
   "message": "Went to France for an abroad study program.  Told me she could have sex with guys there but since she's in a different country, it didn't count as cheating",
   "created_utc": 1692671359,
   "score": 55,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx82j4q",
   "message": "I chose a sports-related halloween costume.\n\nHer (mad): why does it always have to be sports with you??\n\nMe (sad): because I like sports.\n\nI knew it was over. I already wasn’t happy but she had never done anything wrong but, in this moment, it became crystal clear: she didn’t like me for who I am.",
   "created_utc": 1692672979,
   "score": 128,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7c7w9",
   "message": "Found out he didn’t actually break up with his previous girlfriend",
   "created_utc": 1692661431,
   "score": 72,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx84spd",
   "message": "Hit me in the head with a glass bottle and gave me a concussion. I called the cops and they came and arrested her and charged her with assault.",
   "created_utc": 1692674083,
   "score": 39,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7cajl",
   "message": "Tell me I was genetically inferior when discussing children",
   "created_utc": 1692661463,
   "score": 76,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx851vu",
   "message": "Caught her texting another dude about having a dream about how much better sex would be with him after having sex with me the night before. That was enough to break up, Then catching them in the act a day after was enough to change the locks on the house.",
   "created_utc": 1692674210,
   "score": 29,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx86vyc",
   "message": "I found him to be in possession of child pornography. 6 year marriage evaporated in a second. I called police. He never came home again. He's now in prison",
   "created_utc": 1692675165,
   "score": 69,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8226a",
   "message": "Slapped me across the face while we were dancing together during his birthday party that I had planned and paid for",
   "created_utc": 1692672756,
   "score": 45,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7f018",
   "message": "Threw a glass tumbler at the wall behind my head during an argument.",
   "created_utc": 1692662627,
   "score": 20,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx80h6z",
   "message": "Turn out to be married (the weekend before we met!!!)",
   "created_utc": 1692672025,
   "score": 22,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7c2y2",
   "message": "They dumped me so I dumped them back",
   "created_utc": 1692661372,
   "score": 60,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8i72d",
   "message": "We'd been living together for about 4 months and dating just about a year.\n\nHer living with me was through circumstances that I would later find out about. She had been kicked out of her previous living situation and needed a place to stay.\n\nTurns out, I was the other man. For our entire relationship.\n\nShe was still dating her \"ex fiance\" that was more than twice her age.\n\nI found out when she was \"going to a friend's birthday party\".\n\nI would use her MacBook enough that it wasn't unusual for me to be on it. Well, Macs don't really hide text messages, they actually pop up a notification in a text bubble without pressing anything. So she got a message about 15 minutes after she left. It was from her ex fiance..\n\nHe was telling her how excited he was to see her and that he couldn't wait to do all of these things to her and that he was still horny front he last time.\n\nIt broke me. Completely. I had no idea.\n\nI packed up all of her shit and had it piled by the door.\n\nShe came home and saw her stuff and tried to crocodile tears her way out of it.\n\nI called her out on it and she left.\n\nShe begged me to take her back for months.\n\nI eventually found out she had been cheating on me with about 5 people the whole time, all the while her \"ex-fiance\" thought they were still... Fiance'd....\n\nIt was rough.\n\nFuck you, Rachel.",
   "created_utc": 1692682040,
   "score": 61,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7twcc",
   "message": "Cheat. Then denied it when confronted about it. Then blamed me for it when trying to talk about it. At that point I was done",
   "created_utc": 1692669056,
   "score": 18,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7dkj3",
   "message": "Told me that he expected to have control over me. Ended it right then and there, took him his things, took back mine, and told him to never contact me again.",
   "created_utc": 1692662008,
   "score": 80,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7xovk",
   "message": "After dating her for a few months, she finally admitted she was married.",
   "created_utc": 1692670753,
   "score": 16,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8cimu",
   "message": "Threw a wine glass over her shoulder, off a balcony onto a street because \"I finished it, I'll just go get another one from the bar\"",
   "created_utc": 1692678356,
   "score": 16,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx853g5",
   "message": "I was being playful and sneaking up on her.\n\nPeeked through the bathroom doorway to make sure she wouldnt see me coming.\n\nSaw her pop a birth control pill out of the foil and toss it down the sink.\n\n20+ years later and i can still \"see\" this moment.\n\nBroke up a couple days later.",
   "created_utc": 1692674231,
   "score": 102,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7dfrd",
   "message": "Finally introduced me to her mother",
   "created_utc": 1692661952,
   "score": 14,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8at9m",
   "message": "I got a phone call from his wife, whom he supposedly divorced before we started dating two years before.",
   "created_utc": 1692677338,
   "score": 14,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7c37t",
   "message": "She saw scratches on my back and accused me of cheating. Didn't ask. Just accused me.\n\nTurns out I hadn't pulled the plastic price clasp completely off my loofa and it was scratching me in the shower.",
   "created_utc": 1692661376,
   "score": 30,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx89yrj",
   "message": "He was upset that I apparently wasn’t paying attention to him closely enough as we were watching a movie then started licking his arm and said “I’m just a kitten” \n\nI broke up with him on the spot.",
   "created_utc": 1692676851,
   "score": 13,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8037l",
   "message": "I found out he was married",
   "created_utc": 1692671847,
   "score": 13,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8353c",
   "message": "Broke my arm",
   "created_utc": 1692673272,
   "score": 12,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx86dsz",
   "message": "Lack of gratitude and disrupting my peace over petty things. Kinda harsh at the time but I was young and didn’t have patience to grow with them",
   "created_utc": 1692674896,
   "score": 11,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8g9fe",
   "message": "Started choking me during sex saying \"I'll stop when you say you love me\", \"I'll stop when you say you'll marry me\". We were only dating a few weeks",
   "created_utc": 1692680732,
   "score": 10,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx80ryj",
   "message": "Heroin",
   "created_utc": 1692672162,
   "score": 10,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7clwg",
   "message": "I gave him a courtesy heads up that I had to do a kiss scene with an acting partner in class. He told me that he wasn't worried because no other guy would find me attractive anyway. I broke up with him, started dating my now-husband within a couple days. Two months after my ex and I broke up, he ended up at my dorm room apologizing and asking me to give him another chance and I got to tell him that I was with someone else and had been since right after I broke it off with him.",
   "created_utc": 1692661598,
   "score": 62,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx80unb",
   "message": "Fucked a \"friend\", then wanted to stay married and keep fucking him.\n\nThat ended things pretty quick.",
   "created_utc": 1692672196,
   "score": 18,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx86e5o",
   "message": "Raised his voice and threatened my (not his)  7 year old daughter when he thought I was napping.",
   "created_utc": 1692674901,
   "score": 17,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7pnvu",
   "message": "Threatened me in a Facebook post with an ultimatum involving the slaughter and consumption of my pets, over a DVD that they’d wrecked the packaging for \n\nActually now that I think of it, we weren’t dating anymore bc I’d already seen he had serious problems. This was just the the last straw, the end of all semblance of friendship. \n\nI bought him a replacement DVD, and cut off all contact. After he got it and send me the “thanks” and said so on his campaign of FB harassment, he then proceeded to assume I was still going on a trip with him. He was baffled as to why I wasn’t replying to his messages.",
   "created_utc": 1692667183,
   "score": 17,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8afup",
   "message": "Didn't respect my boundaries. I've got a couple deal breakers, we all do. If a girl knows about one of these and does it anyway for whatever reason, it isn't worth sticking around.",
   "created_utc": 1692677124,
   "score": 9,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8rijd",
   "message": "It was the last drop after years of bad treatment, but he ended up calling me gross, pathetic and idiotic when I was trying to talk to him about the cute puppy my boss had brought into work that day. It was nothing deep, puppy was cute, it made me happy to spend my working day with it around, and I was just sharing that with him. He however doesn’t like dogs and was in a bad mood. So he decided to smack me down and belittle me. Looking back I think it was because it made him angry that I was in a good mood for a reason unrelated to him and even *despite* him and his sour mood. He wasn’t entirely in control of my every thought and feeling and felt that needed correcting.\n\nAfter 4,5 years of far worse bullshit, this was like a switch was flipped. I can clearly remember looking at him and seeing him in a completely different light. Like „Really, you couldn‘t even let me have a happy moment about a damn pet?“. I told him I was done right then and there and left. Never did return.",
   "created_utc": 1692689017,
   "score": 7,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7cxby",
   "message": "She gave me an ultimatum that was impossible to fulfill even if I wanted to\n\nEdit: she was upset that I was visiting a friend about 2 hours away for their birthday. She was invited but declined to attend. She knew where I was, who I was with, and the plan was always for me to drive back to her place after dinner\n\nShe called me at 6pm, in the middle of dinner, to freak out on me and say \"be here by 7 or we're done.\" Like I said I was 2 hours away and the laws of physics do not bow to me, so I could not possibly get there in one hour\n\nI said \"then we're done,\" hung up, and returned to my meal",
   "created_utc": 1692661736,
   "score": 13,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7c1np",
   "message": "Cheated.",
   "created_utc": 1692661357,
   "score": 12,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx83c5o",
   "message": "All his partners have BPD.  \nI also have BPD. That made me realize he likes people with that disorder, because he thinks he can control them better.",
   "created_utc": 1692673366,
   "score": 11,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8yhuf",
   "message": "Tried to beat up my cat. \nKicked him out immediately.",
   "created_utc": 1692694728,
   "score": 6,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7nqp9",
   "message": "Wore a wedding dress to a fancy dress party that we attended together.",
   "created_utc": 1692666351,
   "score": 11,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx848kf",
   "message": "He ate my beefaroni \n\nThe straw on the camel, folks",
   "created_utc": 1692673803,
   "score": 6,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8fb0j",
   "message": "Showed up drunk to her sisters wedding and proceeded to mock everyone there. I was the plus one. Drove separately to and from.",
   "created_utc": 1692680102,
   "score": 5,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8s3lv",
   "message": "Told me I needed to send him pictures of whomever I'm meeting when I go out. I told him to go fuck himself instead.",
   "created_utc": 1692689493,
   "score": 6,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx86qwz",
   "message": "Had an affair with 7 different guys and then made her entire family hate me because I made a friend (that was not romantic in anyway but she convinced them I was the one cheating, when there was proof of her cheating but it was ignored by all of them) and now that friend is my wife (dating for 3 years strong) she fat shamed her and said we'd never make it a month because I'D cheat. Worst fever dream of my life.",
   "created_utc": 1692675089,
   "score": 9,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7cc12",
   "message": "Wasn’t instant… but after we 69’d and found a smidge of shit on my nose, it definitely went downhill from there..",
   "created_utc": 1692661480,
   "score": 12,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8bxai",
   "message": "He pushed one of my boundaries.",
   "created_utc": 1692677998,
   "score": 4,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8o5ph",
   "message": "Slapped me. Byeeeeee",
   "created_utc": 1692686402,
   "score": 4,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8qlok",
   "message": "We were making plans to get together on his birthday, after I hadn't seen him for a couple of weeks and had been asking to see him for days. This was the day of, as in *on his birthday*, making plans to see each other that afternoon. \n\nSo we were texting back and forth and he says okay I'm getting in the shower, so I assume he's going to shower and come over so I shower and get ready too. \n\nAnd then he ditches me. Radio silence.\n\nAfter sitting there fuming for 3 hours I realized he's been doing this all along. More and more one word replies, longer and longer gaps and more \"👍🏻\". So I decided it was the last time.",
   "created_utc": 1692688294,
   "score": 4,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8mbdc",
   "message": "I had recently gotten a new job that allowed me to be more expressive in my appearance. \n\nI dyed my hair a beautiful shade of blue with navy and aquamarine highlights. \n\nFor the first time in my life, I was actually excited about my new job and my new freedom! I'm 52 by the way. \n\nIn the course of one sentence, he tells me I look like the Joker, I should delete the first picture I sent because I have \"scary eyes\" and honestly I didn't hear the last insult over the sound of my bubble bursting. \n\n\nThis was a long term relationship. His tone was full of disgust. A man hadn't made me feel so trash in 20 damn years. \n\nYou don't get to yuck my yum, asshole!",
   "created_utc": 1692685015,
   "score": 10,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8g1g6",
   "message": "He came in me after promising not to the one time we didn’t use a condom",
   "created_utc": 1692680585,
   "score": 3,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8qkcg",
   "message": "Told me that he bullies everyone he cares about.\n\nThat's a nope for me. I was bullied enough in school. I don't want to be bullied by someone that is supposed to love me.",
   "created_utc": 1692688265,
   "score": 3,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx87z8r",
   "message": "She got some kind of fake tongue sleeve from a novelty shop that tasted like licorice and frenched me with it. I was like WTF?",
   "created_utc": 1692675747,
   "score": 6,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx85jb2",
   "message": "lie about like little things , it would be like “oh why didn’t you do this” then his excuse in that moment would be “oh darn i forgot i had to milk a goat” (or something dumb like that) then later on he would be like “yea i didn’t get to do that thing cause i couldn’t find my keys” ….. SO WHAT IS IT U HAD TO MILK AND GOAT OR COULDNT FIND UR KEYS ?????? smh it bought out a lot of anger in me and then mfer would say sorry but then do it all . all bc they were “ afraid “ of telling me the truth",
   "created_utc": 1692674456,
   "score": 4,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8fxtj",
   "message": "Had a bf at her work. She was fucking both of us every day for a year. No condoms.",
   "created_utc": 1692680519,
   "score": 3,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7cebh",
   "message": "She wanted to jump out the car while we were driving home. She had gone batshit crazy and said she didn’t want to live. Looking back now I should’ve left her crazy ass way before that. \n\nCrazy bitch. Sometimes we tolerate so much for the sake of “love”.",
   "created_utc": 1692661507,
   "score": 9,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx829nr",
   "message": "SirGlenn, Wife cheated, girlfriend cheated, 40 years ago, it was still the drug era, a lot of people F'd up.",
   "created_utc": 1692672855,
   "score": 2,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8f7zl",
   "message": "Cheated with my “friend”",
   "created_utc": 1692680048,
   "score": 2,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8mmcj",
   "message": "Flirting with my friend.",
   "created_utc": 1692685241,
   "score": 2,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8ty31",
   "message": "Woke up to find weird texts from multiple girls that were either friends or people I hadn’t talked to in forever. She’d gone through my phone and texted all of them to leave her bf alone and then deleted the conversations. I confronted her and she eventually admitted after someone sent me a screenshot. Then she started swinging. Then she physically blocked me from leaving. I picked her up by the shoulders and dropped her on the bed and gtfo of there.\n\nUnfortunately she found someone more unstable than her and was beaten and strangled several years ago. Dude only got 18 years for 2nd degree even with a history of DV.",
   "created_utc": 1692690996,
   "score": 2,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8u3re",
   "message": "Told me she didn't believe in dinosaurs. She said they were a fairytale like tooth fairy etc. Wouldn't budge on it after gentle conversation to tease it out. Broke up with her mentally there and then and never saw her again after that night. We'd only gone out 4 or 5 times but I couldn't handle that level of denial!",
   "created_utc": 1692691130,
   "score": 2,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8vzv1",
   "message": "Bitch got drunk, hit me in the face infront of my mother.  \nI slapped her back and she fell asleep.  \nnext day she moved out of my house.\n\nFun times. She had an amazing ass.",
   "created_utc": 1692692683,
   "score": 2,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8z3cg",
   "message": "Realize she was a lesbian (Christian conservative upbringing in the south), i couldn’t be angry",
   "created_utc": 1692695211,
   "score": 2,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx9a4kl",
   "message": "As a side note, my ex labeled herself as a very active and sporty person who was trying to lose weight and get in shape (she was 5’9” and about 300-320 pounds). We dated for literally one week. She told me a few days into our relationship that she lied about exercising and just wanted to fuck and maybe have a relationship. I told her that her health was a big deal and that she should have been more open because I wanted to be with someone who has similar goals and expectations for health. And even during sex she was constantly out of breath and wanted to take breaks (which was fine but kind of a turn off to stop and go and stop and go).\n\nI tried asking if she just needed motivation or wanted to take it slow or try different kind of exercise or diets or whatever and she said “no I’m pretty comfortable at my weight and I think I’m hot AF so if you can’t handle me then we should break up.” So we did. She flipped out and called me a POS who is selfish and inconsiderate of others, and fatphobic. I met my wife shortly after breaking up with her though so I guess everything ended up working out.",
   "created_utc": 1692703217,
   "score": 2,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7yvph",
   "message": "After asking and confirming three separate times what he wanted to do, i said ok and let him do his thing. Then, 10 minutes later after i let him do his thing he proceeded to text from a room that was 10 feet away asking why i was upset. I wasn’t until i got the text. The communication was awful.",
   "created_utc": 1692671292,
   "score": 3,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8mk59",
   "message": "Faked her death.",
   "created_utc": 1692685197,
   "score": 4,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx7pize",
   "message": "Wasn’t immediately after, but basically it started a few nights before Christmas…\nAt the time, I was living in the south of China because that’s where my then bf was from. I didn’t speak fluent Cantonese but I could get by day to day and I could understand what people were saying - I was self taught btw because my ex didn’t want me to learn the language. Kinda sus considering he would bring up marriage and shit.\nAnyway, his family didn’t know I could understand because I decided to learn and not tell anyone so that they wouldn’t alter how they spoke. Well one night, on our way back from a Christmas sermon (we were all in a long family car, there were a lot of witnesses), I was sat next to his mum, and she is just going off in Cantonese chatting shit to my ex about me, saying I was the reason he gained weight and that he’s not working and that he’s failing college (which, so sorry Sam Sam, but actually is impossible considering your son was at Internet cafes with his friends playing league of legends most of the time, a’ight).\nIt hurt my feelings a lot, cos I thought she had liked me up until then. But I was mainly upset cos he just sat there and looked sorry for himself. I didn’t expect him to stand up to his mum, but I did expect him to talk to me about it after the car ride.\nHe just brushed it off, like it was just something silly. It was his younger brother who actually came up to me and said “I’m sorry, I know you understood everything. Idk why she’s being like this”. We were together for a coupla months after that, then I boosted the fuck home.\nAnyway, if you made it to the end of my unintentionally long ramble, thank u and stay groovy",
   "created_utc": 1692667126,
   "score": 7,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8eumz",
   "message": "Stood me up on a date I had planned to LSD in a shed",
   "created_utc": 1692679812,
   "score": 2,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx82s2k",
   "message": "She said she loved me, so I noped the hell out of there. I don't need that kind of trouble. This was years and years ago. I have grown up a lot since then. Been married 35 years to the love of my life.",
   "created_utc": 1692673098,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8t5hk",
   "message": "Told me she had herpes lmao bye",
   "created_utc": 1692690354,
   "score": 0,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8poto",
   "message": "He didn’t pay for a date. Doesn’t work like that in my culture. Dumped and gone forever. No regrets. Found someone who pays and provides for me now.",
   "created_utc": 1692687576,
   "score": 241,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8gzoz",
   "message": "Cheating with other guy",
   "created_utc": 1692681218,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8jvi6",
   "message": "So, some background. My parents had a rocky marriage when I was growing up. My mom and sister can be abusive. It led me to have trust issues. On top of it, my first real boyfriend I dated for 6 years decided instead of breaking up like I had tried to discuss with him (moving for uni, not wanting to live with him), he cheated on me and tried to lie about it.\n\nDating guys later was tough. I don't know if they thought it was an act, but I would tell them that I have trust issues and if they go too fast, it won't work. That doesn't mean sex or dates. It means commitment.\n\nAfter 3 months of dating someone, he wanted to move in together. I told him no and said I don't think this will work out. My current SO I was with for years before we lived together and we get along great. I still had panic attacks thinking about moving in with him. We've now been together for 14 years, which seems insane to me. Weddings also give me panic attacks so no wedding, ever.",
   "created_utc": 1692683231,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8l1uh",
   "message": "Heroin.",
   "created_utc": 1692684083,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8sy71",
   "message": "Had an affair with one of my friends",
   "created_utc": 1692690188,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8t725",
   "message": "She wanted to fuck her brother. Sent me dick pics. Was immature and manipulative to the core",
   "created_utc": 1692690390,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8vser",
   "message": "While talking at a bar a guy came over, greeted her and kissed her. Apparently she had 4 other guys. We continued the date as if nothing even happened and never contacted each other again",
   "created_utc": 1692692512,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx8y7uu",
   "message": "She let her best friend talk shit about me constantly. I called her out on it, she defended her friend saying she was kidding. Had to bluntly say that it upset me that every time I was brought up she said something terrible about me. \nDownhill from there, tons of flags that I had ignored became too bright.",
   "created_utc": 1692694505,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx915jg",
   "message": "He didn't want to relocate so I broke up with him, furthermore, he was immature and never thought about the future.",
   "created_utc": 1692696898,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx92xml",
   "message": "She started to behave exactly like her mom and told me i would be \"exactly like her father\" (parents are divorced, she doesn't like her father).",
   "created_utc": 1692698296,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx92yc7",
   "message": "Punch me in the face while I was trying to sleep",
   "created_utc": 1692698311,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx932dw",
   "message": "He cheated on me, that case I don't have any reason to stay",
   "created_utc": 1692698398,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx93e9r",
   "message": "He abused me verbally on phone over a minor issue. I knew than and there that if he had been in front of me he would have hit me (We were LD at that time).",
   "created_utc": 1692698650,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx94cu5",
   "message": "Coming home after after work and finding some random guy balls deep in her. Why are divorces expensive? Because they’re fucking worth it!",
   "created_utc": 1692699362,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx94dqs",
   "message": "Farted",
   "created_utc": 1692699380,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx95c0w",
   "message": "Letting his mom seeing our text when we had an argument",
   "created_utc": 1692700053,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx985mt",
   "message": "Fake a pregnancy.",
   "created_utc": 1692701972,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx99c7b",
   "message": "fucked my best friend",
   "created_utc": 1692702729,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx99px0",
   "message": "He hooked up with my (now ex) best friend of 8 years",
   "created_utc": 1692702967,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx9bg8n",
   "message": "She wanted to fuck a guy to get pregnant, even though it was decided that either I get pregnant from donor sperm or we adopt a kid.",
   "created_utc": 1692704014,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx9dao8",
   "message": "She yelled “I fucking hate you” at me, she yelled a bunch of other mean things but that was the final straw for me",
   "created_utc": 1692705042,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx9fcer",
   "message": "She discouraged me from going to the gym. I think it made her insecure",
   "created_utc": 1692706130,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx9g1f1",
   "message": "She told me that I was cheating on her because I didn't went to her house just one weekend (I always traveled across the metropolitan area to date her) cause the gang wanted to have lunch and I went bro before hoes.",
   "created_utc": 1692706492,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx9gtsr",
   "message": "He was married.. just not to me lol\n\nDidn't know. And when I found out I broke uo with him",
   "created_utc": 1692706896,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx9gvwd",
   "message": "Said Fuck you and hung up on me in the middle of an argument",
   "created_utc": 1692706925,
   "score": 1,
   "submission_id": "15xo9ze"
  },
  {
   "comment_id": "jx9gy52",
   "message": "Went through my phone",
   "created_utc": 1692706956,
   "score": 1,
   "submission_id": "15xo9ze"
  }
 ]
}