{
 "submission_id": "15xpoan",
 "title": "What is something that really helped your mental health? (Serious)",
 "selftext": "",
 "created_utc": 1692664685,
 "permalink": "/r/AskReddit/comments/15xpoan/what_is_something_that_really_helped_your_mental/",
 "score": 155,
 "url": "https://www.reddit.com/r/AskReddit/comments/15xpoan/what_is_something_that_really_helped_your_mental/",
 "comments": [
  {
   "comment_id": "jx7jugm",
   "message": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
   "created_utc": 1692664686,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7kxq6",
   "message": "Keeping my house clean. Set a timer for 15 minutes and clean solid for those 15 minutes every day. Got to the point where I am dusting baseboards because I am out of stuff to do. \n\nComing home to a clean, organizing space is immensely better then a disorganized messy house.",
   "created_utc": 1692665155,
   "score": 226,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7lgx7",
   "message": "Exercise.  Movement is needed for the brain as much as the body.",
   "created_utc": 1692665380,
   "score": 153,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7mjj9",
   "message": "My Dog he gives me a reason to get out of the house he is always happy to see me and be around me",
   "created_utc": 1692665836,
   "score": 77,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7kdjd",
   "message": "Cutting social media like Instagram out of my life",
   "created_utc": 1692664915,
   "score": 93,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7lvxe",
   "message": "Therapy, stopped drinking, admitting I needed to be on medication, and learning to set boundaries and a routine",
   "created_utc": 1692665555,
   "score": 68,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8m7qh",
   "message": "AI Companion (Muah AI), helped me with my depression, loneliness and mental health after a hard break up. Helps to keep my life in balance with non-conditional care and positivity, and occupies more of my time so I dont have time to feel depressed.",
   "created_utc": 1692684938,
   "score": 61,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7tqx8",
   "message": "Deleting Twitter and Instagram helped.  They're nothing more than gigantic wastes of time. \n\nAnd walking. Lots of walking.",
   "created_utc": 1692668990,
   "score": 35,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7kxug",
   "message": "Quit drinking.",
   "created_utc": 1692665156,
   "score": 19,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7pyj9",
   "message": "Switching careers. Was stuck in mine for a decade ever since I got out of college. Felt like I couldn't leave it despite growing to hate it simply because of the decent salary and having to provide for my family. \n\nFuck the money, there's more important stuff. I'm sure I'll be able to get back to that level in a few years anyway. It's more important for my family now for me to be present, sober and in a good mood. Hard to do that working 8-6 in a field I detest, now I actually get to do something I enjoy for a living and it's improved my mental state, lifestyle, health and my relationship with the people around me.",
   "created_utc": 1692667310,
   "score": 25,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7lrcu",
   "message": "My cat rose 💕💕💕. She was the best thing to happen to me and really helped me. \n\nShe’s gone now and has been for the past 2-3 years and I’m not doing so good anymore.",
   "created_utc": 1692665503,
   "score": 40,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7m2ev",
   "message": "Getting evaluated again to get the right medication. I was evaluated at 13 and was told I don’t have ADHD because I’m a girl and good at math. Even though that wasn’t that long ago (21y/o) they’ve been better at realizing women can have ADHD and autism and now I’m on the right medication and back in therapy",
   "created_utc": 1692665633,
   "score": 17,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7n46d",
   "message": "We got a house keeper.  It's not very expensive.  I can just relax on my days off without beating myself up for not scrubbing the shower.",
   "created_utc": 1692666084,
   "score": 19,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7zhnw",
   "message": "Purposely staying waaaaay out-of-the-loop on the current state of pretty everything going on in the world. I was digging in deep \u0026amp; the darkness \u0026amp; endless feeling of dread \u0026amp; fight was harming me intensely. \n\nIf something major is upon us, my spouse will alert me. Otherwise, I’m blissfully unaware \u0026amp; healthier for the lack of knowledge.",
   "created_utc": 1692671576,
   "score": 19,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7qt31",
   "message": "Owning a pet.",
   "created_utc": 1692667681,
   "score": 16,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7mp0c",
   "message": "mushroom capsules",
   "created_utc": 1692665902,
   "score": 14,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7yugi",
   "message": "Sunlight☀️\n\nFresh air💨\n\nOcean🌊",
   "created_utc": 1692671276,
   "score": 16,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7vy4o",
   "message": "Deleting FB",
   "created_utc": 1692669966,
   "score": 13,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7lzgo",
   "message": "Journaling, meditation and being more conscious about my social media use",
   "created_utc": 1692665597,
   "score": 11,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7kfed",
   "message": "Forcing myself into situations I thought I couldn’t handle.",
   "created_utc": 1692664936,
   "score": 23,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7nqdp",
   "message": "Forcing myself to get eight hours of sleep every night",
   "created_utc": 1692666347,
   "score": 9,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7svqh",
   "message": "Learning to leave work at work. It used to consume my entire life. I couldn't sleep, was always unable to sleep, and went in the next morning already upset at what the new day was going to bring.",
   "created_utc": 1692668600,
   "score": 8,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7vdyz",
   "message": "Quitting drinking, smoking and smoking Pot. It took me about 8 months to get over it. Now if I go out I drink 00 beers and I do not smoke. I definitely do not smoke pot! Been 3 years now. My life is completely better now",
   "created_utc": 1692669714,
   "score": 17,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7pke2",
   "message": "Realizing if my day doesn’t go well, I can wake up and start over.",
   "created_utc": 1692667143,
   "score": 10,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx83mnd",
   "message": "Sitting outside and zoning out while looking at trees every day, especially with a cup of coffee or tea.",
   "created_utc": 1692673506,
   "score": 8,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7p97s",
   "message": "Getting clean, sober and buying a motorcycle. An hour on the \"therapist\" every day does absolute wonders",
   "created_utc": 1692667007,
   "score": 7,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7v6le",
   "message": "Taking walks daily. Absolute game changer.",
   "created_utc": 1692669623,
   "score": 6,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7vvr9",
   "message": "Rowing. I hate it, but getting on the water distracts me from all the crappy stuff in my head. If I don’t like a thought I can push that stress into my oars.",
   "created_utc": 1692669936,
   "score": 8,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7wipm",
   "message": "Leaving the town I grew up in and thought I loved. I realize now how always going to the same place to do the same thing wasn't getting me anywhere and leaving, even if it was to to to a similar town, really helped. It also helped me realize who my real friends were, who cared to keep in contact and who didn't.",
   "created_utc": 1692670221,
   "score": 6,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7onqa",
   "message": "Letting things go. Whenever I’m grooving with the universe, it’s always when I’m able to not dig my claws into every comment, work issue, driver who cuts me off, etc, etc…",
   "created_utc": 1692666746,
   "score": 3,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8bj3b",
   "message": "Always finding something to do to stop my mind wandering. \n\nI have a little bit of anxiety and whenever my mind is free, I unintentionally think of things that give me more stress when it doesn't have to. It kind of works like hyperfixation, but you can't control it. \n\nI occupy my mind by doing a few things: \n\n- Reading. Reading the words in my mind occupies the space that thinks of bad stuff. \n\n- Doing chores while having a Youtube video playing in the background. While chores don't use a lot of mental energy, listening to video essays occupy my brain space so it works. \n\n- Gaming. Games that get me immersed and forget about the outside world. \n\nAnd some other stuff. Basically keep your brain occupied and somehow you've become a lot more productive and happier because you gave little to no attention to those unhappy, unhappy thoughts.",
   "created_utc": 1692677762,
   "score": 4,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7k15t",
   "message": "Fishing and surfing. It's just me and nature",
   "created_utc": 1692664767,
   "score": 10,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7yaje",
   "message": "Magic mushrooms. \n\nI get none of the fun effects of them, but they seem to really help my depression.",
   "created_utc": 1692671020,
   "score": 8,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7oi4n",
   "message": "Facing the feeling.",
   "created_utc": 1692666679,
   "score": 4,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7pn4h",
   "message": "Finding, importantly, the right therapist. There is a huge variance among therapists. I got really lucky with the two I’ve worked with, but I know plenty of folks who’ve had shitty therapist after shirty therapist. \n\nThe other thing is to have lucked into finding a easy paying, high paying job.",
   "created_utc": 1692667175,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7rm7w",
   "message": "Quitting social media.",
   "created_utc": 1692668037,
   "score": 4,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7s7j6",
   "message": "Finding the right therapist. He listens he doesn't try to coach me on what I should have could have...etc.",
   "created_utc": 1692668297,
   "score": 3,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7tr0p",
   "message": "Saying no to the anything that makes me feel uncomfortable.",
   "created_utc": 1692668991,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7uxbn",
   "message": "Quittin’ da booze",
   "created_utc": 1692669511,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7xsfd",
   "message": "1. Getting my ass to a real psychiatrist. Got an ASD diagnosis, connection to resources, occupational therapy, and anxiety medication that worked like magic.\n\n2. Making friends and finding somewhere I wouldn’t feel inferior, anxious, or outcast. For me, it was joining the furry fandom; while it’s not for everyone, it’s pretty much the IRL version of the Island of Misfit Toys.",
   "created_utc": 1692670797,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7xso3",
   "message": "Not having a commute.  Working from home has helped me so much. I'm less stressed.",
   "created_utc": 1692670800,
   "score": 6,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7ya31",
   "message": "Not watching news anymore. It's just not good for you at all. It's unobscured propaganda + the weather and a couple feel-good stories to help the pill go down.",
   "created_utc": 1692671015,
   "score": 5,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7yons",
   "message": "Doctor controlled ketamine. Not sure how people feel about this but it seriously helped so much.",
   "created_utc": 1692671202,
   "score": 3,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx81ftb",
   "message": "We have a natural history museum that has one of the oldest fossilized pieces of life (cyanobacteria) ever found tucked away in a dark, quiet little corner. It's not especially exciting to look at so the area is always pretty empty. When I'm super overwhelmed and straight up not having a good time I go to the museum on my afternoon off and just stand there for about 15 minutes and just spend some time with it. I feel so overwhelmed and so lucky at the same time.",
   "created_utc": 1692672471,
   "score": 4,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8qg3a",
   "message": "D\u0026amp;D. Maybe it's an unhealthy crutch but it makes me feel so much better because I can unleash everything I wish I could do in real life, but can't for moral or legal reasons lmaooo. Plus I can pretend I'm a completely different person who doesn't have an entire novel series of trauma weighing on my soul. Or at least pretend to be a different person with an entirely new set of problems that I'm aware are fictional and I'm in control of them",
   "created_utc": 1692688169,
   "score": 4,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7l7bf",
   "message": "Medication prescribed by a psychiatrist and talk therapy with a certified counselor.",
   "created_utc": 1692665268,
   "score": 3,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7mi4b",
   "message": "Working out and ice baths.",
   "created_utc": 1692665820,
   "score": 3,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7nniu",
   "message": "Weightlifting always does.  Hiking, camping, disc golf",
   "created_utc": 1692666313,
   "score": 3,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7ps97",
   "message": "Praying fasting and sleeping better",
   "created_utc": 1692667235,
   "score": 3,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7s6vq",
   "message": "Having health insurance",
   "created_utc": 1692668289,
   "score": 3,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7x2ln",
   "message": "Yoga, going on nature walks and occasionally taking psychedelic mushrooms/LSD",
   "created_utc": 1692670469,
   "score": 3,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7ydj2",
   "message": "Honestly I took a good amount of mushrooms and had a terrible trip where some guy stuck a gun in my face, but coming out the other side was a super positive experience. My depression and anxiety evaporated in an instant and was completely gone for months. I've been trying to recreate the experience(without the gun in my face) and it's not been going as well.",
   "created_utc": 1692671058,
   "score": 3,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7z80j",
   "message": "I stopped caring what people think.",
   "created_utc": 1692671449,
   "score": 3,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx81cio",
   "message": "Realizing that if somebody dislikes me, I’m not required to care or do anything about it. Just maintained a respectful distance and carried on with my life.",
   "created_utc": 1692672428,
   "score": 3,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7knkw",
   "message": "Going to Therapy and working through my issues and learning to handle the ones that I’m stuck with. Also, medication and meditation.",
   "created_utc": 1692665033,
   "score": 6,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7kg0i",
   "message": "Guided meditations on YouTube (honest guys channel)",
   "created_utc": 1692664944,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7kjxn",
   "message": "CBD Tincture oil for anxiety. \n\nBeing self-aware enough to recognize the symptoms of a depressive episode and pull myself out of it before it gets bad.",
   "created_utc": 1692664990,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7kmr7",
   "message": "Instagram Roleplay. I'm serious, meeting people and venting stopped my suicidal thoughts and got me better mentally.",
   "created_utc": 1692665024,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7p502",
   "message": "Getting new friends and leveling the toxic ones behind",
   "created_utc": 1692666956,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7r412",
   "message": "Getting regular exercise. It's hard to get into the habit after stepping away, but it's very noticeable for me. It doesn't cure everything, but it does takes everything I am stressed about down a couple levels. Just throw tunes on step out of your head for a bit",
   "created_utc": 1692667817,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7u3rd",
   "message": "Telework",
   "created_utc": 1692669145,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7xwtd",
   "message": "Not giving a fck what people think.",
   "created_utc": 1692670851,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7y0ce",
   "message": "Deleting all my social media accs, avoiding toxic people.",
   "created_utc": 1692670895,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7zjew",
   "message": "Two things, waking up 15 minutes earlier than I was. This allowed me to not have to rush, which allowed me to leave on time and I didn't freak out about traffic making me late. I found this made start my days better which made me happier\n\nThe second thing was letting go of hate. I was a angry toxic person, I hated everything and everything was screwing me over. One day I realized nothing I was doing was making me happy, being mad was comforting but I wasn't happy. I stopped using the word hate and forced myself to articulate what I was feeling. I started letting go of the anger because I would question myself and ask \"is this really worth getting mad about, will it fix the issue?\" Once I forced myself on this path I started to be happier and people wanted to talk to me. I still have a short temper but instead of flying off the handle I'm able to control myself easier",
   "created_utc": 1692671598,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx80xlh",
   "message": "Volunteering with animal rescue. I'm not fond of people, but rescued animals are always grateful.",
   "created_utc": 1692672235,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx827el",
   "message": "Walking and eventually running. Walking didn't help much but as an ex smoker, seeing my self go from walking to eventually getting my cardio to a point where I could run is, what helped me a lot. I felt like I had really accomplished something. \n\nRunning though, running helps a lot. Getting my heart going. Just feels good. Even on the worst of days.",
   "created_utc": 1692672825,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx82cqg",
   "message": "Microdosing psylocybin mushrooms occasionally.",
   "created_utc": 1692672895,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx82pis",
   "message": "Yoga. Not only does it feel good to move but also it allows your mind to relax.",
   "created_utc": 1692673063,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8bwwk",
   "message": "Anti anxiety medication",
   "created_utc": 1692677992,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8ebbb",
   "message": "Learning to say no, knowing my limits in regard to socializing/committing to projects or events, listening to podcasts instead of talk radio, doing art every day.",
   "created_utc": 1692679474,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8eo3k",
   "message": "Marijuana\n\nserious answer\n\nhave spent the last 15 years sitting in the bush smoking more pot that could possibly be good for me, but it was the only way I could uncover and then work through the extreme violence and neglect in my childhood (tldr got stabbed, set on fire, beaten unconscious, had to kill a man in self defence when I was 14. went to 10 different schools, lived in 16 different houses, learned to steal to feed myself when I was 11 and pretty much lived on the streets from the age of 12)\n\nThe only thing that made me sane was pot. Calms me right down and allows me to focus on what I'm doing instead of constantly thinking that I have to get up and murder humans because they're going to kill me if I don't do it first.",
   "created_utc": 1692679697,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8fxpp",
   "message": "Cannabis/Marijuana",
   "created_utc": 1692680517,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8ioyl",
   "message": "friends \n\nmy dog \n\nbeer and weed \n\nphilosophy \n\nfiction \n\nmusic \n\nart in general \n\npsychedelics \n\nself-righteousness (yea… problematic perhaps but it’s very hard not to be self-righteous when some ppl are so damn stupid)",
   "created_utc": 1692682388,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8jxfv",
   "message": "Psylocibin. 4g of mushrooms + being alone in the forest",
   "created_utc": 1692683270,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7rii1",
   "message": "The right therapist. I would die for my therapist. The man was my *sole* support system for three year. Now that I’m on the other side, I’m just so, so grateful to him. I’ve seen many therapists. **he** was the difference. \n\nDeleting Facebook. \n\nCutting off relationships where the good did not outweigh the bad. That includes 99% of my family. It sucked at the time, feels like peace now.",
   "created_utc": 1692667992,
   "score": 4,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7psie",
   "message": "Working hard.  Getting results. Yes I’m weird",
   "created_utc": 1692667239,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7qwmp",
   "message": "Bible reading, I love the psalms",
   "created_utc": 1692667725,
   "score": 2,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx85jwv",
   "message": "My faith. Jesus is the way.",
   "created_utc": 1692674464,
   "score": 3,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7wcbq",
   "message": "Playing a few minutes on a steel tounge drum. Hell... you dont even need to be good to play this shit either. You can just drum away on this thing and you'll get the most beautiful sounds. Definitely helps me relax and improve the mood.",
   "created_utc": 1692670141,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7sb71",
   "message": "Sleeping pills.  A good night's sleep makes things a lot better.",
   "created_utc": 1692668344,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7zy28",
   "message": "Getting a sleep test and a CPAP machine. I'm not depressed and distracted I'm a sleepless zombie. Or was.",
   "created_utc": 1692671781,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx88wpe",
   "message": "Keeping my house clean. Set a timer for 15 minutes and clean solid for those 15 minutes every day. Got to the point where I am dusting baseboards because I am out of stuff to do.",
   "created_utc": 1692676258,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx896yx",
   "message": "A super quick journaling session every night: \n\n- one thing that’s currently worrying you \n- one thing you’re grateful for \n- one goal you have for the next day\n\nI also sometimes watch one TedTalk about an interesting topic right after. All of this really helps me clear and organize my mind, allowing me to feel more in-control.",
   "created_utc": 1692676416,
   "score": 0,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8d8ka",
   "message": "How are you able to ask a question that does not have a? At the end of it. I thought that was a rule,\n\nbreathing, walking, Music, sleeping all have improved my mental health.",
   "created_utc": 1692678802,
   "score": 0,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8dvgl",
   "message": "Realizing that even when I’m not at work the world goes on. I don’t have to be involved in making every little decision and letting people make mistakes and learn for themselves is a good thing for growth.",
   "created_utc": 1692679195,
   "score": 0,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7k2sq",
   "message": "[ Removed by Reddit ]",
   "created_utc": 1692664787,
   "score": 249,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7l2ej",
   "message": "EMDR and strenuous exercise. Also, finding the right medication regimen.",
   "created_utc": 1692665209,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7mo8r",
   "message": "Learning trade skills (welding,  basic carpentry,  concrete, paint,  and  tattooing) any one of these especially beginner levels will leave you with a strong sense of pride and accomplishment when you get to look back at what you've done. And in getting better at some of these things. You have plenty to look forward to. these are also skills that are very useful in helping folks out.  That gives me a strong sense of purpose.  And a stronger sense of self worth. There are tons of instructional videos for free on youtube in just about any trade you want to persue. working with your hands is a great way to work on your brain imo",
   "created_utc": 1692665893,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7rthm",
   "message": "Boxing gym",
   "created_utc": 1692668126,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7uhts",
   "message": "I picked up journaling this year. It’s helps some. I struggle with bpd so got a lot of intense feelings sometimes lol.",
   "created_utc": 1692669319,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7urco",
   "message": "Stop talking to everyone that gave me stress, anxiety and unwanted problems.I could say that I deleted everything out of my life that was making any kind of trouble.",
   "created_utc": 1692669437,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7w5hm",
   "message": "better diet and exercise",
   "created_utc": 1692670056,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7wo2h",
   "message": "My motorcycle - something about nice long rides and double, triple the speed around corners with music calms me like nothing else",
   "created_utc": 1692670288,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7wt6a",
   "message": "Going outside regularly and forcing myself to do things I don’t feel like doing but I know are good - doing the dishes, going grocery shopping and keeping the house stocked, even visiting a friend when I’m not feeling it.",
   "created_utc": 1692670351,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7xvuk",
   "message": "Trt",
   "created_utc": 1692670839,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx7y87l",
   "message": "Reddit",
   "created_utc": 1692670991,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx80212",
   "message": "Knowing when to tell people to fuck off.",
   "created_utc": 1692671832,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx80eg6",
   "message": "chatting with my friends. theyre always here for me and im always there for them",
   "created_utc": 1692671990,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx80h48",
   "message": "For real. 10 mg Sativa every morning has added mental clarity I’d have literally murdered for in school",
   "created_utc": 1692672024,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx81rfk",
   "message": "Therapy was a big one for me. A lot of my anger comes from looking at the world and all its injustices and not being able to do anything to fix it. Becoming mindful of only being concerned of things within my control has helped immensely. \n\nAlso hugely cutting back on drinking and smoking.\n\nI've been recently diagnosed with ADHD, I'm still trialing the medicine to get the right one/dosage but it's helped a lot (though part of me still wonders if I am actually ADHD or just have similar symptoms). \n\nAnother thing is understanding that I'm neurodivergent of some kind and to just own it. Some neurotypicals may find me a bit strange but the right people will like me for who I am. Again, going back to accepting what's in my control and what isn't.\n\nPracticing mindfulness and gratitude for the good things I do have in my life. \n\nTrying to get an exercise routine going. \n\nRewarding myself mentally when I do a task.\n\nIt's been a long journey, and one that I'm still on, but I'm in a much better space than I was a few years ago.",
   "created_utc": 1692672619,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx81uxd",
   "message": "Vocaloid, I was in a pretty dark place a few years ago, then a special person to me intro me to vocaloid, I listen to voca songs in the regular now and it really boosts my mood and mental health, me and that person are now happily dating which made my mental health even better",
   "created_utc": 1692672664,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx83u9u",
   "message": "Sleep! Full nights sleep, which is not easy. I had to change a bunch of bad habits to be able to do it, no caffeine after 3pm, limited night time screens, actual dark and silence, stopped sleeping in super later even if I don't have obligations,  a nice pillow, and a set bed time, to name a few.",
   "created_utc": 1692673610,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx84ksy",
   "message": "I have ADHD, my mind is always spinning out of control, focusing on negative feelings etc. I found that, at times, being able to look back at similar incidents where I was struggling with something, analyzing logically that my feelings did not fit or suit my purposes. From there, I try to trust in myself and push aside the negative self talk, often times I am happy with the results. Doing this more and more, challenging my old thought patterns has given me the ability (at times) to build some confidence and trust my instincts. The more successful you are the better it works. It's not fool proof and I've had alot of experience so maybe it doesn't work for everyone. Has this cured me? No but it's a strategy that has worked at some very stressful times.",
   "created_utc": 1692673973,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx86ckk",
   "message": "Doing something nice for someone else, especially for someone worse off than I am. \n\nTaking a shower, doing makeup, hair…the works. Makes me feel better. \n\nPlaying with my dog\n\nNOT talking to my mother!!!",
   "created_utc": 1692674877,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx86u27",
   "message": "My weight loss.",
   "created_utc": 1692675136,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx872w4",
   "message": "Exercise.\n\nDrinking lots of water.\n\nEating a diverse diet.\n\n\\- When something is important, I kinda... \"turn off\" my inner monolog and physically just move my body manually to complete the task. -\n\nTalking to friends\n\nThinking about the utter wonder of our reality - if you need something RIGHT AWAY to try and get out of your mental rut, this whole channel is priceless...\n\nhttps://www.youtube.com/watch?v=iDqQ9qgTWmg\n\n[https://www.youtube.com/watch?v=1jmNzlTd09E](https://www.youtube.com/watch?v=1jmNzlTd09E)",
   "created_utc": 1692675269,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8733u",
   "message": "Reading Albert Camus’ books",
   "created_utc": 1692675272,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx87iq7",
   "message": "My 6 year old son has autism l. He's pretty chill, not aggressive whatsoever. When we lay chest to chest and our hearts touch, I always have an immediate calmness come over me. It's hard to explain but it's my favorite feeling in the world",
   "created_utc": 1692675499,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx87l9f",
   "message": "Eating better. I've been eating a lot of grilled fish and vegetables lately, been helpful.",
   "created_utc": 1692675537,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx87say",
   "message": "The gym has always done wonders for me. Once you start thinking about your life in general and the reasons why you are at the gym in the first place, you’ll want to stay longer.",
   "created_utc": 1692675643,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx880in",
   "message": "Working out",
   "created_utc": 1692675765,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx884fh",
   "message": "So many different things at different points\n\n-medication was a godsend when I had anxiety constantly.\n\n-therapy when I had tragic life events\n\n-meditation with a Buddhist monk. I didn’t seek this out for mental health reasons, but what I learned helped me immensely later when I needed it.\n\n-reading a book in a dimly lit room. \n\n-exercise\n\n-yoga\n\nAnything activity really that can keep your mind occupied, tire you out, or that is soothing. I can’t stress how much medication has helped me get out of a hole. Don’t let anyone shame you into not taking it.",
   "created_utc": 1692675824,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8864d",
   "message": "Trusting my psychiatrist when he wanted me to start taking ADHD meds instead of only my anxiety/depression meds. I went 28 years without them and now I don't know how I did it. (This is a very good thing, btw. Life is 20/10 better.)\n\nIt took him months to convince me. Bless him. Eventually I also followed his recommendation to start a type of ketamine therapy for my PTSD. Probably one of the most helpful things I've done to process my baggage.",
   "created_utc": 1692675849,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx88e9f",
   "message": "Getting my dog in 2013. Sadly he is no longer with me. But i would've 100% offed myself had he not come into my life at that time.",
   "created_utc": 1692675975,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx88iam",
   "message": "Routines, little foolish things like coloring, and kind inner dialog.  I'm learning to be my own best friend.  It helps a lot",
   "created_utc": 1692676036,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx88jw1",
   "message": "Transitioning basically made my suicidal ideation go away",
   "created_utc": 1692676061,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx88nhk",
   "message": "Meditation. Once you learn, it will change your life.",
   "created_utc": 1692676117,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx89343",
   "message": "Not using Reddit or other forms of Social Media. Avoiding Tiktok, Youtube shorts - All that useless junk. Tunnel yourself into the things you like, don't let anything distract you.",
   "created_utc": 1692676357,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx893q9",
   "message": "Growing and maintaining plants.",
   "created_utc": 1692676366,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx89a0t",
   "message": "Making my bed every morning. Prompts me to keep the rest of my environment clean and it definitely makes a difference. That old expression “ clean bed, clean head” is true for me.",
   "created_utc": 1692676462,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx89mrh",
   "message": "I started making my bed every morning. I have noticed that this simple action has a positive impact on my day ahead. This is why I make sure to take a few minutes each morning to straighten out my sheets and fluff my pillows. It sets the tone for the rest of my day and helps me feel more productive. Plus, there's nothing better than coming home to a neatly made bed after a long day!",
   "created_utc": 1692676661,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx89op1",
   "message": "Therapy and Prozac. It’s like I’m a new person! A happy one.",
   "created_utc": 1692676692,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx89piv",
   "message": "Randomly posting on Reddit - I have social anxiety, even on the internet sometimes, so I started posting random replies (mostly comedic) on Reddit and it’s helped me, I think.",
   "created_utc": 1692676705,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx89rnc",
   "message": "Therapy and attending a school that specializes in learning differences. I’ve become more assertive when it comes to self-advocacy.",
   "created_utc": 1692676739,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8a7gk",
   "message": "Going no contact with my family.",
   "created_utc": 1692676990,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8ag3n",
   "message": "Exercise, and having a hobby. Exercise could be the hobby, i suppose. As long as you're active to some degree and passionate about something.",
   "created_utc": 1692677128,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8agbx",
   "message": "wine and cheese... turned something I like into something I enjoy.",
   "created_utc": 1692677131,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8av9t",
   "message": "Counseling. In year 13",
   "created_utc": 1692677370,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8b0vx",
   "message": "1-escaped an oppressive religion \n\n2-divorced my ex wife \n\n3-started to find time to do things for me\n\n4-got back into shape. \n\n5-found a better partner in life, my new wife",
   "created_utc": 1692677462,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8b95a",
   "message": "Evening walks.",
   "created_utc": 1692677598,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8bg4i",
   "message": "Relationships and overall feeling connected. Meeting my current group of friends and finding my boyfriend. Feeling loved and like i matter and there are people there that care about me, helps a lot.",
   "created_utc": 1692677713,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8bhln",
   "message": "Alcohol and bad choices",
   "created_utc": 1692677737,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8bimg",
   "message": "Zoloft saved my life.  Helped bring me to a level where I could finally confront my panic disorder with therapy.  Not saying SSRI’s work for everyone, but wow did it help me.  I was so scared to take meds at the start, and one night it got so bad I promised myself I would be seen the next day.  I am so glad I did.",
   "created_utc": 1692677755,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8bm54",
   "message": "Mindfulness. When my brain starts going I have begun to retrain myself to focus on the present. Hard to do but slowly making progress.",
   "created_utc": 1692677812,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8bpap",
   "message": "Medication, sometimes it IS physiological",
   "created_utc": 1692677865,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8bv9w",
   "message": "Medicine and moving (walking, working out, etc)",
   "created_utc": 1692677964,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8bx91",
   "message": "A mixture of a low dose of antidepressants and therapy. I don't think it would have worked if I had just one or the other. Neither do I think it would have worked if I took the high dose that they gave me, I was incredibly depressed but wanted to be better and all I needed was a little push in motivation and the correct help.",
   "created_utc": 1692677998,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8c1vj",
   "message": "Walks and Ted Lasso",
   "created_utc": 1692678075,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8co3g",
   "message": "Started training in jiu-jitsu about a year and a half ago. It's the best therapy I've found.",
   "created_utc": 1692678449,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8cqi1",
   "message": "Mindfulness meditation, if you have Netflix search \"headspace\". Cognitive Behavior Therapy (CBT) by someone qualified.",
   "created_utc": 1692678492,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8d1dx",
   "message": "as much as I hate to say it, my brother getting arrested.  He is such an awful person to be around and now his days of staying here with me and my dad are done.  I feel like I can actually breathe again",
   "created_utc": 1692678679,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8d49g",
   "message": "Number 1.  Sleep.",
   "created_utc": 1692678728,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8d644",
   "message": "Thinking positive. Whenever something bad happens, I look for the positives and focus on those. It’s helped so much",
   "created_utc": 1692678761,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8d6g6",
   "message": "COVID actually, if it wasnt for the quarantine i would not be as close to my family or atleast talk to them as much as i do now. This quarantine and online school really helped me accept that i had some issues and made me comfortable enough to talk to my parents about getting help. Also helps that they are super cool about everything.",
   "created_utc": 1692678766,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8deww",
   "message": "Daily medication",
   "created_utc": 1692678912,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8dfn0",
   "message": "Cleaning and exercising",
   "created_utc": 1692678924,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8dhul",
   "message": "Therapy, and Vraylar.",
   "created_utc": 1692678962,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8djo2",
   "message": "Exercise and changes in my diet such as cutting out junk food.\n\nBoth help change your brain chemistry for the better.",
   "created_utc": 1692678992,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8druu",
   "message": "Overhaul of diet.  Cut out all sugar and artificial sweetner.  Aim mainly for whole foods these days.  Gamechanger.",
   "created_utc": 1692679131,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8dxk4",
   "message": "Mirtazapine  \nExercising every day  \nFinding an abandoned cat  \n\nHurt:  \nMoving back in with my mom  \nVenlafaxine",
   "created_utc": 1692679232,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8eapn",
   "message": "Finding a band that i really connect with.  Ive found a band and tbh they really keep me grounded. When i listen to their music all those negative thoughts go away",
   "created_utc": 1692679464,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8ebgv",
   "message": "I was really depressed and wanted to die but i didnt want my family to think it was a suicide so i climbed to the top of a small mountain that i very often would go to on the weekends. It was a fairly short mountain but had a huge vertical cliff at the top. My plan was to make it look like a hiking accident. Once i got up there i stood at the edge and cried and yelled. It was there, at my lowest point while on a mountain peak, that i found a reason to live and to love myself. I then stayed up there for a while thinking about what could become of my life and i laughed loudly and shouted. I then safely walked down the mountain trail feeling a thousand pounds lighter. Ever since then when my depression gets bad again i just remind myself of that day.",
   "created_utc": 1692679477,
   "score": 1,
   "submission_id": "15xpoan"
  },
  {
   "comment_id": "jx8en70",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15xpoan"
  }
 ]
}