{
 "submission_id": "15xq86t",
 "title": "What seems like snake oil but is actually 100% legit?",
 "selftext": "",
 "created_utc": 1692666088,
 "permalink": "/r/AskReddit/comments/15xq86t/what_seems_like_snake_oil_but_is_actually_100/",
 "score": 182,
 "url": "https://www.reddit.com/r/AskReddit/comments/15xq86t/what_seems_like_snake_oil_but_is_actually_100/",
 "comments": [
  {
   "comment_id": "jx8i12f",
   "message": "Rain-X and Bidet attachments. Not at the same time tho",
   "created_utc": 1692681922,
   "score": 198,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7qm21",
   "message": "I’m going to collect more data on this but personally for me\n\nWhen I feel that scratchy feeling in my throat I drink a very small amount of everclear and avoid the week or two of coughing. \n\nIt’s worked 19 out of 19 times",
   "created_utc": 1692667597,
   "score": 52,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8b9w9",
   "message": "[Actual snake oil](https://pharmaceutical-journal.com/article/opinion/the-history-of-snake-oil)",
   "created_utc": 1692677611,
   "score": 106,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7nha1",
   "message": "that Liquid IV stuff. it's legit, it will give you a lot of electrolytes, probably way more than an average person ever takes lol. is it some sort of super energy drink or someting? nah, but if you are working out or doing some sort of a sport or a physical activity, it really does help you stay hydrated better, I personally think it's better than things like Gatorade.",
   "created_utc": 1692666241,
   "score": 220,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8h5yz",
   "message": "Breathwork. \n\nI know I know you're like \"Consciously breathing is stupid.\" But we unconsciously do it our entire lives and rarely think about it. Our breath changes based on our moods, thoughts, and actions. Have you ever forgot to breathe when you were lost in thought or worried? When you're angry, do you notice that you probably take shallow breaths in your chest? Our breath is the mind-body connection and can change our moods and minds in just a few minutes.\n\nYou don't have to go full Wim Hof, but these are great:  \n\\+ psychological sigh (2 count nasal inhales, long slow mouth exhale)\n\n\\+ box breathing (inhale 4 count, hold 4 count, exhale 4 count, hold 4 count, repeat)\n\n\\+ bedtime breath (nasal inhale 4 count, hold for 7 count, mouth exhale for 8 count)\n\nEdit to add:\nI love the free app Unwind. It’s simple, no sign ups, with 3 great timed breathwork options.",
   "created_utc": 1692681335,
   "score": 150,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8al9s",
   "message": "Neti pot aka nasal saline douche is amazing if you have seasonal allergies, a cold or a sinus infection. Anecdotally it can also help reduce severity of COVID infections.",
   "created_utc": 1692677211,
   "score": 127,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8jo1n",
   "message": "Yoga. I have severe upper back pain and went to months of physical therapy. I couldn't keep up with the millions of appointments and started doin yoga as a way to stretch my upper back instead. I was doing it for 30 mins each day and forgot that I had pain. It's so annoying that it does what people say it does because this whole time I thought they were just being annoying but they're 100% right. There's an app that is called \"Down dog yoga\" it's a blue dog as the logo, that's the app I really enjoy! You can Customize time and focus area so you can fit things in when you have time",
   "created_utc": 1692683083,
   "score": 223,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7ocm8",
   "message": "Bluetooth \n\nWizardry if you ask me",
   "created_utc": 1692666615,
   "score": 28,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8iq8m",
   "message": "Glucosamine supplement is my answer. I know the jury is still out on rather or not it actually helps with joint health, but I swear by it. One of my knees used to fatigue and ache super fast when I go out for a run, but after taking this stuff daily for a couple months it’s soo much better.  Still sometimes I get some aches on runs, it isn't a miracle cure, but it’s soo much better than it was before.",
   "created_utc": 1692682413,
   "score": 48,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8h9ne",
   "message": "Salt water swish and gargle for toothache and sore throat (as long as it’s not something like strep). Source: currently have strep and ain’t nothing working. Otherwise even the dentist tells me to salt water swish if I get tooth pain or something stuck. Total relief.",
   "created_utc": 1692681405,
   "score": 231,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7rw0c",
   "message": "Apple cider vinegar can do a lot.  There are some websites that tout it as a cure all.  It's not, obviously, but things like rashes, sunburn, dry scalp or dandruff, etc, it really does work.",
   "created_utc": 1692668157,
   "score": 148,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8hhtq",
   "message": "If you have hiccups, just remind yourself you're not a fish.  It'll fix your hiccups.  Im not even joking",
   "created_utc": 1692681559,
   "score": 131,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8jlbg",
   "message": "ITT: Lots of stuff that's actually snake oil but people foolishly believe it's true.",
   "created_utc": 1692683027,
   "score": 39,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx82uyy",
   "message": "Melatonin.",
   "created_utc": 1692673136,
   "score": 69,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8hif5",
   "message": "Spoonful of sugar to cure hiccups. Works for me every time.",
   "created_utc": 1692681569,
   "score": 225,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8j4ca",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8dxdv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8mj7b",
   "message": "Many people can't believe this but: Vaccines are actually Safe and Effective!",
   "created_utc": 1692685177,
   "score": 130,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8lwga",
   "message": "ITT actual snake oil.",
   "created_utc": 1692684705,
   "score": 12,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8ksq3",
   "message": "Not sure if this is mainstream now but air fryer \n\nGame changer and so much better than cooking in the grill or oven\n\nI don't really care that you don't use oil I just like how easy it is\n\nI don't have kids but I'd like it even more if I did, it's so good at stuff like frozen chips or chicken nuggets",
   "created_utc": 1692683897,
   "score": 61,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8jtef",
   "message": "Supposedly digesting Local Honey will stop you from getting seasonal allergies.",
   "created_utc": 1692683189,
   "score": 32,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8gkdm",
   "message": "Snake oil.\n\nIt was the knockoff stuff that gave it the bad name.",
   "created_utc": 1692680929,
   "score": 8,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7sdpj",
   "message": "Acupuncture is a totally legitimate evidence-based practice. Chiropractic, on the other hand…",
   "created_utc": 1692668375,
   "score": 32,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7na5y",
   "message": "Kickstarter",
   "created_utc": 1692666156,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8lr3n",
   "message": "Direct Neurofeedback. Literal brainwave monitoring and real-time retraining, done subconsciously. It’s actually settled science, is being used by NASA and JPL, and is being tested on Parkinsons patients. Personally, it’s done wonders for my anxiety and depression.",
   "created_utc": 1692684595,
   "score": 43,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7un1v",
   "message": "Hypnosis. Sounds like voodoo magic but is used in healthcare, has proven medical use, etc",
   "created_utc": 1692669384,
   "score": 242,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8g5gb",
   "message": "Unpopular opinion after liver king BUT - I take Tasmanian freeze dried beef liver caps and after and after a month I was amazed how good I felt. Obviously everyone is different and experiences may vary. \n\nI got into it a few years ago and wouldn’t look back",
   "created_utc": 1692680660,
   "score": 253,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8e1d7",
   "message": "I use a product called xtend bcaa, blue raspberry flavor.  Has sucralose in it though, so need to find something else",
   "created_utc": 1692679300,
   "score": 250,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7wr3f",
   "message": "Dogecoin",
   "created_utc": 1692670326,
   "score": 214,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8mg08",
   "message": "How effective Medical cannabis is on Parkinson’s and MS.   \n\nYou watch the videos and the effects are like the patients are paid actors before. But it’s real, and it works.",
   "created_utc": 1692685110,
   "score": 172,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8n07d",
   "message": "Adults drinking pedialyte before a night of drinking.\n\nDigging my fingers into my squishie to hold off hypnic jerk and sleep well.\n\nFancy tea tasting better than cheap stuff. Just got reminded today! I’ve been sipping on jasmine all day! So hydrated and happy.",
   "created_utc": 1692685525,
   "score": 16,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8n4g9",
   "message": "Anybody got a good remedy for hair loss? I’m using Rogaine and Finesteride. I don’t want to shave my head. Thanks",
   "created_utc": 1692685615,
   "score": 8,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8nh8w",
   "message": "Feminism",
   "created_utc": 1692685886,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8s0n2",
   "message": "Vinegar and news paper to clean windows. \n\nI thought the ink would come off and make an even bigger mess. \n\nAlmost turns the window invisible.",
   "created_utc": 1692689424,
   "score": 111,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8w36d",
   "message": "Hopping on the opposite leg when you have water in your ear after swimming - works every damn time",
   "created_utc": 1692692761,
   "score": 139,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8q20q",
   "message": "The Epley Maneuver for vertigo.\n\nhttps://www.hopkinsmedicine.org/health/treatment-tests-and-therapies/home-epley-maneuver",
   "created_utc": 1692687865,
   "score": 146,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8v1rs",
   "message": "Epsom salt baths. They rapidly help recovery and I don’t know why I ever believed people saying it’s an old ‘wives tale’. \n\nDuring the pandemic I rode my bike ~150+ miles a week, each day id do an Epsom soak for 15mins and I’d be good to go the next day. \n\nHonorable second mention: Win Hoff method. Ice baths suck ass. But they do your body wonders. I couldn’t get used to it, and bitched every time. But dammit do they help recovery time.",
   "created_utc": 1692691904,
   "score": 7,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8q1j6",
   "message": "Sleepy time tea. I always thought it was just a tea that’s nice to drink before bed but sleepy time extra actually puts my dick in the dirt. Chamomile and valerian root are legit natural sedatives.",
   "created_utc": 1692687854,
   "score": 120,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8ui06",
   "message": "Vitamin E and it’s various oils and extracts. Super healthy for you and good for your skin as well",
   "created_utc": 1692691457,
   "score": 9,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8ytov",
   "message": "Daylight lamps.\n\nSomeone mentioned melatonin, so it reminded me of the opposite lol. Bought a daylight lamp last winter because I get depressed when it’s dark outside for long periods of time. Got one off amazon for 40€ and now I can’t live without it in the winter. Thought it was a sham initially. The light basically imitates the wavelengths of light emitted by the sun (bar the UVs) and inhibits the production of melatonin. Not only that, but it also boosts my mood and morale. You just have to be careful because it’s difficult to fall asleep for a couple of hours after using it.\n\n\nEDIT: putting the link here because it got buried in the comments \nhttps://www.amazon.com/Beurer-Daylight-BrightLight-Simulation-TL30/dp/B01HOBZ066",
   "created_utc": 1692694994,
   "score": 92,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8zasq",
   "message": "EMDR",
   "created_utc": 1692695380,
   "score": 43,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8sa69",
   "message": "Arnica gel. My daughter's stepmum (K) was struggling with a heat rash for weeks and nothing she tried had worked. I told her my gran always swore by arnica gel for that. K bought some immediately, and texted me the next day to tell me that the rash had disappeared!",
   "created_utc": 1692689641,
   "score": 14,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8w9rg",
   "message": "I forgot what it was called but I couldn’t believe it actually worked, my grandmother would buy some cheap medicine from some small and frankly cheap looking stores \n\nOne was some sort of paste like medicine that was purple and smelled kind of funny, when I was young my brother accidentally slammed a door into my toe nail nearly breaking the whole thing off and splitting it in two \n\nMy grandmother then comes back to my family’s apartment and puts on the purple medicine on my toe, no joke when I say it healed in what, three to five days I think? Anyways my toenail is then fully healed, no pain or problems years after the accident \n\nToo bad she didn’t have that stuff on her when I ended breaking my other toenail….",
   "created_utc": 1692692914,
   "score": 174,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8w9ka",
   "message": "Sitting on your deck in summer or are you having a nice picnic when suddenly you're being accosted by the hellspawn known as wasps? Get rid of them with this one easy solution: burn some coffee!\n\nBurn coffee? I hear you say incredulously. Yes, burn coffee! Take a little saucer, pour a little pyramid of ground coffee on in and use a lighter to light the top. It will smolder slowly and give off a smoke that smells, well like burnt coffee. It will also instantly get rid of any wasps that are bothering you. No idea why, they absolutely hate the smell.\n\nSome people also dislike the smell of the burning coffee, I understand this. But ask yourself this important question while the smell is annoying you: what do you dislike more; wasps or the smell of burning coffee? I know what I would pick.",
   "created_utc": 1692692909,
   "score": 111,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8xaaa",
   "message": "Mindfulness meditation (meditations based on mindfulness based cognitive therapy). Just ten minutes each day is life changing.\n\nOther than Jon Kabat Zinn's YouTube channel, I'd recommend the Balance meditation app because before each plan starts it explains the science behind it and has personalized meditations based on the way you answer the questions. Plus they have offered one full year free since the pandemic started, just set a reminder in your phone so your remember to cancel the day before. https://balanceapp.com/",
   "created_utc": 1692693753,
   "score": 6,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8uzvc",
   "message": "Retinol.\n\nOne of the few ingredients in cosmetics that is actually scientifically proven to work. You do need to get the good stuff (depending on your country you might actually have to get a doctor's note to get the high concentration product) but it does improve your skin.",
   "created_utc": 1692691861,
   "score": 61,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8p85k",
   "message": "Turmeric for joint pain.",
   "created_utc": 1692687216,
   "score": 11,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8vohg",
   "message": "This is going to sound ridiculous, but infrared light therapy. I have an autoimmune disorder and some old injuries from childhood, so I’ve struggled with chronic pain and moderate-severe fatigue for most of my life.\n\nAfter my first experience in one of those beds, I spent the next week or so with no pain and the energy to actually get stuff done without being even a little tired afterward. \n\nI have no idea how it works, I just know that I don’t hurt now and my inflammation numbers have been cut in half. That doesn’t even happen on my immunosuppressant.",
   "created_utc": 1692692421,
   "score": 145,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx91wma",
   "message": "Herbal teas for ailments. I get very bad panic attacks, but drinking hot chamomile tea actually brings me \"back down\" when one tries to start. By the end of drinking a full cup of camomile tea, my panic attack is gone. Peppermint tea is really good for menstrual or any sort of muscle cramps (I have endometriosis AND adenomyosis and it works as well as an Advil for me). Peppermint tea also helps you sleep because it's a muscle-relaxant.",
   "created_utc": 1692697491,
   "score": 70,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8p6gi",
   "message": "crystal deodorants, absolutely blown my mind when i tried it",
   "created_utc": 1692687179,
   "score": 12,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8z18s",
   "message": "Meditation!",
   "created_utc": 1692695164,
   "score": 3,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8z4hg",
   "message": "Cranberry juice. At the first sign if a UTI I drink a bit of natural cranberry concentrate in a big glass of water. I get immediate relief.",
   "created_utc": 1692695236,
   "score": 70,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx91j8w",
   "message": "Nasal irrigation. If you have headaches that start in your back, upper teeth, it's probably a chronic sinus infection. Sinuses are empty spaces and channels in one's head. They fill with mucus and can simulate dental pain. If you don't have a nedi pot, you can use a coffee cup. Just snort slowly through one nostril, jiggle your head around while rubbing your neck and face for 20 second, then blow your nose.",
   "created_utc": 1692697199,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx92td9",
   "message": "Calorie defect for weight loss. It just works. 100%. For everyone.",
   "created_utc": 1692698203,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx942wd",
   "message": "I feel like a lot of the things mentioned here is not \"100% legit\". Just anecdotal claims and gut feelings, not saying they're necessarily wrong though.",
   "created_utc": 1692699158,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9bjb1",
   "message": "The whole \"hold your breath to get rid of hiccups\" trick.\n\nThing is, most people just don't know the proper way to do it or why it works.\n\nIt's got nothing to do with simply holding your breath. It's got to do with using your lungs to hold down the diaphragm and stop it from spasming.\n\nYou breathe in until you cannot fit literally anything else into your lungs. When your chest is as full as humanly possible **then** you hold it and within about 15 seconds the hiccups are gone.",
   "created_utc": 1692704064,
   "score": 200,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9gd6j",
   "message": "Taking magnesium. It really can cure some joint, nerve, muscle, heart and breathing problems. \n\nOf course, the only one it can cure are ones that are caused by a magnesium deficiency which a surprising number of people have. \n\nSome life events that can rapidly use up magnesium in the body are pregnancy, surgery, viral illness and major period of stress.",
   "created_utc": 1692706660,
   "score": 79,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9s9xs",
   "message": "I had a weird smelling basement. Someone said to get aromatic cedar blocks, sand them down and leave them there. I thought, no way this could work. But it did. The smell is totally eliminated.",
   "created_utc": 1692712166,
   "score": 54,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9npbr",
   "message": "Good posture.\n\n\nI had chronic back pain for years. Then, just a few years ago I slept on my neck wrong and had neck pain that wouldn’t resolve; I saw a physical therapist and the first thing she did was look at how I sat and how I stood and walked. She told me nicely but essentially that my posture was horrible, affected by years of slumping in my seat and also being told continually by my mom “suck in that tummy!” when I stood or walked, which led to me thinking a pelvic tilt was necessary for good posture. \n\nThe therapist showed me how to sit and stand with a straight back, my chest up and forward, and my back keeping a healthy lumbar curvature. Let me tell you, it was HARD. My shoulder/back muscles were not used to it and I had to train them like any muscle is trained, with a posture bra and also using a long sheet tied like a strap around my neck, arms, and waist. It also felt so unnatural at first to be sticking my chest and butt out, like I was looking for attention—which is part of the reason people have such terrible posture; we feel that’s “immodest.”\n\nNo lie, 3 weeks later all my back pain symptoms were gone and haven’t returned. I can do some slumping when I sit with no great penalty now, but when I walk, or when have to stand for a duration, or sit on something backless, I use my good posture and I am pain-free.\n\nTrying to spread the word on this makes me feel like a 1950s health movie (“Posture Pals!”) but it’s so effective I can’t stop sharing. Years of chronic back pain completely eliminated by just a few weeks of good posture training.",
   "created_utc": 1692710186,
   "score": 160,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9mjkd",
   "message": "Meditation. When I was an alcoholic and drug abuser, my friend use to tell me about meditation to help with anxiety and stress. I thought “bitch we use Xanax around here, no one’s got time to meditate” we no longer use Xanax, and have the time to meditate:)",
   "created_utc": 1692709658,
   "score": 144,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx991kr",
   "message": "Does a dog thundershirt count? Had an anxious dog with storms/loud noises, got him one, and while not perfect, he did seem to calm down with it on more often that not.",
   "created_utc": 1692702541,
   "score": 245,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9ndd8",
   "message": "Hot water, baking soda, and aluminum foil to clean tarnished silver. I was amazed when I dropped in a piece and watched the tarnish disappear almost instantly.",
   "created_utc": 1692710039,
   "score": 199,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9ta62",
   "message": "I was suffering with plantar fasciitis for over six months. I tried new shoes, new insoles, pills, and physical therapy but none those things fixed it. A friend kept suggesting I try these gel toe separator things like they wear when painting toe nails. I thought it was silly but they were only $10 on Amazon, what do I have to lose? I wore the neon blue gel thing at night feeling very silly. After The first night my foot hurt like hell but after the 2nd it felt a whole lot better. I wore it for two weeks straight and plantar fasciitis was gone. Those things were like magic.",
   "created_utc": 1692712589,
   "score": 212,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxagzn7",
   "message": "Placebos are shockingly effective. \n\nNot great, but larger than zero.",
   "created_utc": 1692721705,
   "score": 161,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxa4ad6",
   "message": "Exercises that use just your bodyweight, like push-ups, bodyweight squats, stuff like that. Can legit be done in place of weight training if you're not just trying to get large.",
   "created_utc": 1692716965,
   "score": 239,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9o43z",
   "message": "Valerian is a very effective anxiolytic and sleep aid, and it's cheap and legal everywhere.   \n\n\nApplying apple vinegar to skin tags will result in them falling off in a couple of days.  \n\n\u0026amp;#x200B;\n\nThe pain of a migraine can be drastically reduced by sitting down in the shower in the dark and letting warm water fall directly on your head.",
   "created_utc": 1692710369,
   "score": 94,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxa02xe",
   "message": "Vitamin D supplements. it's much more important than any of us realized.",
   "created_utc": 1692715343,
   "score": 174,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxa1hyc",
   "message": "diatomaceous earth to treat for bed bugs \n\nIt works, make sure to get a sealed mattress bag, powder inside the bag too.\n\nWithin 2 weeks we eliminated an infestation",
   "created_utc": 1692715889,
   "score": 123,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx90zc1",
   "message": "I had a couple mouth surgeries and was told putting a tea bag in my mouth would stop the bleeding. Bled non stop til I had a brew going on in my mouth",
   "created_utc": 1692696758,
   "score": 189,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9gc8u",
   "message": "Tiger Balm.",
   "created_utc": 1692706647,
   "score": 219,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9ipwu",
   "message": "EMDR therapy for PTSD\n\nSounds like total bullshit - and it actually works\n\n\nAlso for more complex subconscious memories - like early childhood core memories, there are reprogramming methods to change those entirely as well, but these require a lot more work with a specialized psychotherapist.\n\nThe human mind is highly pliable, the negative experiences of our past can be molded like putty into a new positive experience",
   "created_utc": 1692707841,
   "score": 27,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9ckf8",
   "message": "The new electric-shock bands as treatment for travel sickness.\n\nI have SEVERE travel sickness. Like, have had to call an ambulance before, get sick in some kinds of building, yes even if I am the one driving kind of travel sickness. I have tried every possible solution to this crap.\n\nA couple of years ago I found out of about the electric shock bands. The acupressure bands have always actually made me feel *worse* so I was skeptical, but I took a risk. They are straight up miraculous.\n\nFor example, my wife doesn't drive and her family live 3 hours away. Going to see them used to entail me taking medication and going immediately to bed on arrival and still feeling ill the next day. Now if I remember to keep the band on during the journey and for like an hour or so after the journey the effects are minimised so much its more like a mild headache.\n\nAlso in this category: travel sickness glasses. They look ridiculous, but they do have an effect. Not gonna stop you being sick, but they help a little.",
   "created_utc": 1692704643,
   "score": 179,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxaquf8",
   "message": "Creatine monohydrate. The vast vast vast majority of muscle/strength building supplements are total garbage and won’t do anything at all for you. However, creatine monohydrate when taken at 5g per day (after saturation) has been shown to significantly increase muscular growth, strength, and even mental function in hundreds of studies. It isn’t magic and won’t turn you into the hulk, but if you are already doing well by training hard, eating enough, and resting properly then simply allowing your muscle cells to saturate over a few weeks can really make a difference in the gym. There is a myth that taking creatine will do things like cause hair loss and make you bloated with water weight. The hair loss is complete nonsense outright. The bloating is a misconception about how the water is stored when you take creatine. It is true that you will gain some water weight (usually 1-3lbs), but that water will be stored in INTRAMUSCULAR cells, not just randomly around the body to bloat you. In fact, that extra water in the muscle will actually make them appear slightly larger, which is a good thing! Creatine monohydrate is a great supplement that gets overlooked sometimes due to the rampant lying and scams in the fitness industry.",
   "created_utc": 1692725328,
   "score": 124,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxaj2at",
   "message": "Weighted blankets. My partner has anxiety disorder (I don’t) so I bought one for her as a gift while we lived apart. I didn’t think they would make any difference to me. She moved in, and I slept under it for the first time… I can’t get a good night of sleep without it now. It’s literally a 10x improvement to my sleep, and I discounted it because I thought it wouldn’t do anything\n\nI guess you could say I slept on it for too long 😎👉👉",
   "created_utc": 1692722471,
   "score": 212,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8uwii",
   "message": "Aloe vera for burns and skin conditions. Also, ginseng.",
   "created_utc": 1692691786,
   "score": 251,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9pqzi",
   "message": "Magic Eraser",
   "created_utc": 1692711084,
   "score": 122,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9dy3s",
   "message": "Msg is great",
   "created_utc": 1692705392,
   "score": 17,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9dn4a",
   "message": "Fun fact: the original snake oil WAS legit. “ Oil from Chinese water snakes has for centuries been used in Chinese traditional medicine to treat joint pain such as arthritis and bursitis. It has been suggested that the use of snake oil in the United States may have originated with Chinese railway laborers in the mid-19th century, who worked long days of physical toil. Chinese snake oil may have had real benefits due to its high concentration of the omega−3 fatty acid eicosapentaenoic acid (EPA)—more than that of salmon; the rattlesnake oil later sold by charlatans did not contain a significant amount of omega−3.” White people, especially at medicine shows, would try to recreate these recipes with local snakes who didn’t have these properties hence it didn’t work and snake oil’s reputation for being a ripoff.",
   "created_utc": 1692705226,
   "score": 154,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9xlhd",
   "message": "Apple cider vinegar! As soon as I feel a cold or sore throat coming on, I take a shot that evening and I'm 100% the next morning. You just have to make sure you're on a full stomach to avoid a stomachache and I recommend cutting it with oj or something for the taste.",
   "created_utc": 1692714367,
   "score": 31,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxai7qe",
   "message": "I have serious, lifelong, horrible insomnia. I’ve tried every non-narcotic (and some narcotic) sleep aid you can imagine, melatonin is spotty and only works in the right conditions/makes me so groggy for 24 hours, benadryl is pretty terrible for you long term, etc. etc. etc. I tried valerian tea and it tasted like socks and did nothing. Then I learned that valerian takes a high dose to be effective, so I tried it in pills, and it seemed to help but it gave me a stomachache. Then a friend created a high dose valerian tincture for me. I swear on everything a dropper of that under the tongue for 2 minutes has almost the exact benefits as taking a xanax. You can properly feel it kicking in and you just drift off to sleep. There’s a reason they call it nature’s valium.",
   "created_utc": 1692722159,
   "score": 121,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxao95o",
   "message": "WD40 cleans candle wax off your living room carpet.   If ever in doubt, consult an old housewife.",
   "created_utc": 1692724377,
   "score": 98,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx9bj4f",
   "message": "Tea tree oil for skin tags.  Cover in tea tree oil using a cotton ball - you can tape the cotton ball over it too.  In a couple of days it shrinks, dries up and falls off.",
   "created_utc": 1692704061,
   "score": 160,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxa49mb",
   "message": "Distilled white vinegar as fabric softener. Put that in your softeners compartment in your washer. Clothes come out super soft. Don’t use fabric softener sheets in the dryer. They have wax that builds up on your clothes. Instead use a wool balls (they sell them by the detergent) and throw them in the dryer. That stops the static clinging\n\nEDIT: compartment not department",
   "created_utc": 1692716957,
   "score": 25,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxa6iki",
   "message": "Retinol to tackle fine lines and wrinkles.",
   "created_utc": 1692717808,
   "score": 38,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxaby85",
   "message": "Huffing isopropyl alcohol wipes for nausea",
   "created_utc": 1692719832,
   "score": 55,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx95dyy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxaxe3e",
   "message": "wearing sunscreen / spf everyday is the simplest, cheapest and very effective anti-ageing. \n\nyet a lot of people still ignore, prefer overpriced overrated cream, facelift and some invasive surgery.",
   "created_utc": 1692727744,
   "score": 111,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxato7w",
   "message": "Vitamin D supplementation or going out and getting natural sunlight for mood stability and depression. I was super close to going on antidepressants but it turned out I just had really low vitamin D levels.\n\nI had mood/confidence swings throughout the day that were a lot... I felt like it was a very mild version of bipolar, which didn't make any sense because it doesn't manifest mid-life, and I didn't have any symptoms before.",
   "created_utc": 1692726368,
   "score": 49,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxaopoo",
   "message": "If you have a fireplace with a glass door. Wet some paper towel and dip it in the wood ash. Then wipe it liberally onto the glass so everything has a thin amount of ash paste on it, then scrub it and wipe it clean with another wet paper towel. Rinse and repeat for dirtier sections.\n\nMy wife and I spent hours trying to clean it before with detergents, vinegar, etc. But this had it completely cleaned and crystal clear in maybe 10 mins.",
   "created_utc": 1692724549,
   "score": 37,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jxafrih",
   "message": "I have POTS and the fact that the main treatment is salt is still mind blowing. Just salt. A butt load of salt.and compression",
   "created_utc": 1692721254,
   "score": 31,
   "submission_id": "15xq86t"
  }
 ]
}