{
 "submission_id": "15xq86t",
 "title": "What seems like snake oil but is actually 100% legit?",
 "selftext": "",
 "created_utc": 1692666088,
 "permalink": "/r/AskReddit/comments/15xq86t/what_seems_like_snake_oil_but_is_actually_100/",
 "score": 11,
 "url": "https://www.reddit.com/r/AskReddit/comments/15xq86t/what_seems_like_snake_oil_but_is_actually_100/",
 "comments": [
  {
   "comment_id": "jx8i12f",
   "message": "Rain-X and Bidet attachments. Not at the same time tho",
   "created_utc": 1692681922,
   "score": 18,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7qm21",
   "message": "I’m going to collect more data on this but personally for me\n\nWhen I feel that scratchy feeling in my throat I drink a very small amount of everclear and avoid the week or two of coughing. \n\nIt’s worked 19 out of 19 times",
   "created_utc": 1692667597,
   "score": 239,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8b9w9",
   "message": "[Actual snake oil](https://pharmaceutical-journal.com/article/opinion/the-history-of-snake-oil)",
   "created_utc": 1692677611,
   "score": 197,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7nha1",
   "message": "that Liquid IV stuff. it's legit, it will give you a lot of electrolytes, probably way more than an average person ever takes lol. is it some sort of super energy drink or someting? nah, but if you are working out or doing some sort of a sport or a physical activity, it really does help you stay hydrated better, I personally think it's better than things like Gatorade.",
   "created_utc": 1692666241,
   "score": 231,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8h5yz",
   "message": "Breathwork. \n\nI know I know you're like \"Consciously breathing is stupid.\" But we unconsciously do it our entire lives and rarely think about it. Our breath changes based on our moods, thoughts, and actions. Have you ever forgot to breathe when you were lost in thought or worried? When you're angry, do you notice that you probably take shallow breaths in your chest? Our breath is the mind-body connection and can change our moods and minds in just a few minutes.\n\nYou don't have to go full Wim Hof, but these are great:  \n\\+ psychological sigh (2 count nasal inhales, long slow mouth exhale)\n\n\\+ box breathing (inhale 4 count, hold 4 count, exhale 4 count, hold 4 count, repeat)\n\n\\+ bedtime breath (nasal inhale 4 count, hold for 7 count, mouth exhale for 8 count)\n\nEdit to add:\nI love the free app Unwind. It’s simple, no sign ups, with 3 great timed breathwork options.",
   "created_utc": 1692681335,
   "score": 75,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8al9s",
   "message": "Neti pot aka nasal saline douche is amazing if you have seasonal allergies, a cold or a sinus infection. Anecdotally it can also help reduce severity of COVID infections.",
   "created_utc": 1692677211,
   "score": 239,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8jo1n",
   "message": "Yoga. I have severe upper back pain and went to months of physical therapy. I couldn't keep up with the millions of appointments and started doin yoga as a way to stretch my upper back instead. I was doing it for 30 mins each day and forgot that I had pain. It's so annoying that it does what people say it does because this whole time I thought they were just being annoying but they're 100% right. There's an app that is called \"yoga\" it's a blue dog as the logo, that's the app I really enjoy! You can Customize time and focus area so you can fit things in when you have time",
   "created_utc": 1692683083,
   "score": 231,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7ocm8",
   "message": "Bluetooth \n\nWizardry if you ask me",
   "created_utc": 1692666615,
   "score": 48,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8iq8m",
   "message": "Glucosamine supplement is my answer. I know the jury is still out on rather or not it actually helps with joint aches and pains, but I swear by it. One of my knees used to fatigue super fast when I go out for a run, but after taking this stuff daily for a couple months it’s soo much better.  Still sometimes I get some aches on runs, it wasn’t a miracle cure, but it’s soo much better than it was before.",
   "created_utc": 1692682413,
   "score": 87,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8h9ne",
   "message": "Salt water swish and gargle for toothache and sore throat (as long as it’s not something like strep). Source: currently have strep and ain’t nothing working. Otherwise even the dentist tells me to salt water swish if I get tooth pain or something stuck. Total relief.",
   "created_utc": 1692681405,
   "score": 108,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7rw0c",
   "message": "Apple cider vinegar can do a lot.  There are some websites that tout it as a cure all.  It's not, obviously, but things like rashes, sunburn, dry scalp or dandruff, etc, it really does work.",
   "created_utc": 1692668157,
   "score": 148,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8hhtq",
   "message": "If you have hiccups, just remind yourself you're not a fish.  It'll fix your hiccups.  Im not even joking",
   "created_utc": 1692681559,
   "score": 175,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8jlbg",
   "message": "ITT: Lots of stuff that's actually snake oil but people foolishly believe it's true.",
   "created_utc": 1692683027,
   "score": 39,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx82uyy",
   "message": "Melatonin.",
   "created_utc": 1692673136,
   "score": 69,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8hif5",
   "message": "Spoonful of sugar to cure hiccups. Works for me every time.",
   "created_utc": 1692681569,
   "score": 31,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8j4ca",
   "message": "Snake oil.  It is high in Omega-3 and an effective anti-inflammatory.",
   "created_utc": 1692682690,
   "score": 46,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8dxdv",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8mj7b",
   "message": "Many people can't believe this but: Vaccines are actually Safe and Effective!",
   "created_utc": 1692685177,
   "score": 130,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8lwga",
   "message": "ITT actual snake oil.",
   "created_utc": 1692684705,
   "score": 12,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8ksq3",
   "message": "Not sure if this is mainstream now but air fryer \n\nGame changer and so much better than cooking in the grill or oven\n\nI don't really care that you don't use oil I just like how easy it is\n\nI don't have kids but I'd like it even more if I did, it's so good at stuff like frozen chips or chicken nuggets",
   "created_utc": 1692683897,
   "score": 61,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8jtef",
   "message": "Supposedly digesting Local Honey will stop you from getting seasonal allergies.",
   "created_utc": 1692683189,
   "score": 32,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8gkdm",
   "message": "Snake oil.\n\nIt was the knockoff stuff that gave it the bad name.",
   "created_utc": 1692680929,
   "score": 8,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7sdpj",
   "message": "Acupuncture is a totally legitimate evidence-based practice. Chiropractic, on the other hand…",
   "created_utc": 1692668375,
   "score": 32,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7na5y",
   "message": "Kickstarter",
   "created_utc": 1692666156,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8lr3n",
   "message": "Direct Neurofeedback. Literal brainwave monitoring and real-time retraining, done subconsciously. It’s actually settled science, is being used by NASA and JPL, and is being tested on Parkinsons patients. Personally, it’s done wonders for my anxiety and depression.",
   "created_utc": 1692684595,
   "score": 43,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7un1v",
   "message": "Hypnosis. Sounds like voodoo magic but is used in healthcare, has proven medical use, etc",
   "created_utc": 1692669384,
   "score": 242,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8g5gb",
   "message": "Unpopular opinion after liver king BUT - I take Tasmanian freeze dried beef liver caps and after and after a month I was amazed how good I felt. Obviously everyone is different and experiences may vary. \n\nI got into it a few years ago and wouldn’t look back",
   "created_utc": 1692680660,
   "score": 253,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8e1d7",
   "message": "I use a product called xtend bcaa, blue raspberry flavor.  Has sucralose in it though, so need to find something else",
   "created_utc": 1692679300,
   "score": 250,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7wr3f",
   "message": "Dogecoin",
   "created_utc": 1692670326,
   "score": 214,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8mg08",
   "message": "How effective Medical cannabis is on Parkinson’s and MS.   \n\nYou watch the videos and the effects are like the patients are paid actors before. But it’s real, and it works.",
   "created_utc": 1692685110,
   "score": 127,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8n07d",
   "message": "Adults drinking pedialyte before a night of drinking.\n\nDigging my fingers into my squishie to hold off hypnic jerk and sleep well.\n\nFancy tea tasting better than cheap stuff. Just got reminded today! I’ve been sipping on jasmine all day! So hydrated and happy.",
   "created_utc": 1692685525,
   "score": 16,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8n4g9",
   "message": "Anybody got a good remedy for hair loss? I’m using Rogaine and Finesteride. I don’t want to shave my head. Thanks",
   "created_utc": 1692685615,
   "score": 8,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8nh8w",
   "message": "Feminism",
   "created_utc": 1692685886,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8s0n2",
   "message": "Vinegar and news paper to clean windows. \n\nI thought the ink would come off and make an even bigger mess. \n\nAlmost turns the window invisible.",
   "created_utc": 1692689424,
   "score": 147,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8w36d",
   "message": "Hopping on the opposite leg when you have water in your ear after swimming - works every damn time",
   "created_utc": 1692692761,
   "score": 31,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8q20q",
   "message": "The Epley Maneuver for vertigo.",
   "created_utc": 1692687865,
   "score": 28,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8v1rs",
   "message": "Epsom salt baths. They rapidly help recovery and I don’t know why I ever believed people saying it’s an old ‘wives tale’. \n\nDuring the pandemic I rode my bike ~150+ miles a week, each day id do an Epsom soak for 15mins and I’d be good to go the next day. \n\nHonorable second mention: Win Hoff method. Ice baths suck ass. But they do your body wonders. I couldn’t get used to it, and bitched every time. But dammit do they help recovery time.",
   "created_utc": 1692691904,
   "score": 19,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8q1j6",
   "message": "Sleepy time tea. I always thought it was just a tea that’s nice to drink before bed but sleepy time extra actually puts my dick in the dirt. Chamomile and valerian root are legit natural sedatives.",
   "created_utc": 1692687854,
   "score": 27,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8ui06",
   "message": "Vitamin E and it’s various oils and extracts. Super healthy for you and good for your skin as well",
   "created_utc": 1692691457,
   "score": 9,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8ytov",
   "message": "Daylight lamps.\n\nSomeone mentioned melatonin, so it reminded me of the opposite lol. Bought a daylight lamp last winter because I get depressed when it’s dark outside for long periods of time. Got one off amazon for 40€ and now I can’t live without it in the winter. Thought it was a sham initially lol. The light basically imitates the wavelengths of light emitted by the sun (bar the UVs) and inhibits the production of melatonin. Not only that, but it also boosts my mood and morale. You just have to be careful because it’s difficult to fall asleep for a couple of hours after using it.",
   "created_utc": 1692694994,
   "score": 8,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8zasq",
   "message": "EMDR",
   "created_utc": 1692695380,
   "score": 8,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8sa69",
   "message": "Arnica gel. My daughter's stepmum (K) was struggling with a heat rash for weeks and nothing she tried had worked. I told her my gran always swore by arnica gel for that. K bought some immediately, and texted me the next day to tell me that the rash had disappeared!",
   "created_utc": 1692689641,
   "score": 14,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8w9rg",
   "message": "I forgot what it was called but I couldn’t believe it actually worked, my grandmother would buy some cheap medicine from some small and frankly cheap looking stores \n\nOne was some sort of paste like medicine that was purple and smelled kind of funny, when I was young my brother accidentally slammed a door into my toe nail nearly breaking the whole thing off and splitting it in two \n\nMy grandmother then comes back to my family’s apartment and puts on the purple medicine on my toe, no joke when I say it healed in what, three to five days I think? Anyways my toenail is then fully healed, no pain or problems years after the accident \n\nToo bad she didn’t have that stuff on her when I ended breaking my other toenail….",
   "created_utc": 1692692914,
   "score": 7,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8w9ka",
   "message": "Sitting on your deck in summer or are you having a nice picnic when suddenly you're being accosted by the hellspawn known as wasps? Get rid of them with this one easy solution: burn some coffee!\n\nBurn coffee? I hear you say incredulously. Yes, burn coffee! Take a little saucer, pour a little pyramid of ground coffee on in and use a lighter to light the top. It will smolder slowly and give off a smoke that smells, well like burnt coffee. It will also instantly get rid of any wasps that are bothering you. No idea why, they absolutely hate the smell.\n\nSome people also dislike the smell of the burning coffee, I understand this. But ask yourself this important question while the smell is annoying you: what do you dislike more; wasps or the smell of burning coffee? I know what I would pick.",
   "created_utc": 1692692909,
   "score": 11,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8xaaa",
   "message": "Mindfulness meditation (meditations based on mindfulness based cognitive therapy). Just ten minutes each day is life changing.\n\nOther than Jon Kabat Zinn's YouTube channel, I'd recommend the Balance meditation app because before each plan starts it explains the science behind it and has personalized meditations based on the way you answer the questions. Plus they have offered one full year free since the pandemic started, just set a reminder in your phone so your remember to cancel the day before. https://balanceapp.com/",
   "created_utc": 1692693753,
   "score": 6,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8uzvc",
   "message": "Retinol.\n\nOne of the few ingredients in cosmetics that is actually scientifically proven to work. You do need to get the good stuff (depending on your country you might actually have to get a doctor's note to get the high concentration product) but it does improve your skin.",
   "created_utc": 1692691861,
   "score": 14,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8p85k",
   "message": "Turmeric for joint pain.",
   "created_utc": 1692687216,
   "score": 11,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8vohg",
   "message": "This is going to sound ridiculous, but infrared light therapy. I have an autoimmune disorder and some old injuries from childhood, so I’ve struggled with chronic pain and moderate-severe fatigue for most of my life.\n\nAfter my first experience in one of those beds, I spent the next week or so with no pain and the energy to actually get stuff done without being even a little tired afterward. \n\nI have no idea how it works, I just know that I don’t hurt now and my inflammation numbers have been cut in half. That doesn’t even happen on my immunosuppressant.",
   "created_utc": 1692692421,
   "score": 8,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx91wma",
   "message": "Herbal teas for ailments. I get very bad panic attacks, but drinking hot chamomile tea actually brings me \"back down\" when one tries to start. By the end of drinking a full cup of camomile tea, my panic attack is gone. Peppermint tea is really good for menstrual or any sort of muscle cramps (I have endometriosis AND adenomyosis and it works as well as an Advil for me). Peppermint tea also helps you sleep because it's a muscle-relaxant.",
   "created_utc": 1692697491,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8p6gi",
   "message": "crystal deodorants, absolutely blown my mind when i tried it",
   "created_utc": 1692687179,
   "score": 12,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8z18s",
   "message": "Meditation!",
   "created_utc": 1692695164,
   "score": 3,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8z4hg",
   "message": "Cranberry juice. At the first sign if a UTI I drink a bit of natural cranberry concentrate in a big glass of water. I get immediate relief.",
   "created_utc": 1692695236,
   "score": 3,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx91j8w",
   "message": "Nasal irrigation. If you have headaches that start in your back, upper teeth, it's probably a chronic sinus infection. Sinuses are empty spaces and channels in one's head. They fill with mucus and can simulate dental pain. If you don't have a nedi pot, you can use a coffee cup. Just snort slowly through one nostril, jiggle your head around while rubbing your neck and face for 20 second, then blow your nose.",
   "created_utc": 1692697199,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx92td9",
   "message": "Calorie defect for weight loss. It just works. 100%. For everyone.",
   "created_utc": 1692698203,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx942wd",
   "message": "I feel like a lot of the things mentioned here is not \"100% legit\". Just anecdotal claims and gut feelings, not saying they're necessarily wrong though.",
   "created_utc": 1692699158,
   "score": 1,
   "submission_id": "15xq86t"
  }
 ]
}