{
 "submission_id": "15xq86t",
 "title": "What seems like snake oil but is actually 100% legit?",
 "selftext": "",
 "created_utc": 1692666088,
 "permalink": "/r/AskReddit/comments/15xq86t/what_seems_like_snake_oil_but_is_actually_100/",
 "score": 139,
 "url": "https://www.reddit.com/r/AskReddit/comments/15xq86t/what_seems_like_snake_oil_but_is_actually_100/",
 "comments": [
  {
   "comment_id": "jx8i12f",
   "message": "Rain-X and Bidet attachments. Not at the same time tho",
   "created_utc": 1692681922,
   "score": 59,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7qm21",
   "message": "I’m going to collect more data on this but personally for me\n\nWhen I feel that scratchy feeling in my throat I drink a very small amount of everclear and avoid the week or two of coughing. \n\nIt’s worked 19 out of 19 times",
   "created_utc": 1692667597,
   "score": 190,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8b9w9",
   "message": "[Actual snake oil](https://pharmaceutical-journal.com/article/opinion/the-history-of-snake-oil)",
   "created_utc": 1692677611,
   "score": 36,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7nha1",
   "message": "that Liquid IV stuff. it's legit, it will give you a lot of electrolytes, probably way more than an average person ever takes lol. is it some sort of super energy drink or someting? nah, but if you are working out or doing some sort of a sport or a physical activity, it really does help you stay hydrated better, I personally think it's better than things like Gatorade.",
   "created_utc": 1692666241,
   "score": 227,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8h5yz",
   "message": "Breathwork. \n\nI know I know you're like \"Consciously breathing is stupid.\" But we unconsciously do it our entire lives and rarely think about it. Our breath changes based on our moods, thoughts, and actions. Have you ever forgot to breathe when you were lost in thought or worried? When you're angry, do you notice that you probably take shallow breaths in your chest? Our breath is the mind-body connection and can change our moods and minds in just a few minutes.\n\nYou don't have to go full Wim Hof, but these are great:  \n\\+ psychological sigh (2 nasal inhales, long slow mouth exhale)\n\n\\+ box breathing (inhale 4, hold 4, exhale 4, hold 4)\n\n\\+ bedtime breath (nasal inhale for 4, hold for 7, mouth exhale for 8)",
   "created_utc": 1692681335,
   "score": 62,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8al9s",
   "message": "Neti pot aka nasal saline douche is amazing if you have seasonal allergies, a cold or a sinus infection. Anecdotally it can also help reduce severity of COVID infections.",
   "created_utc": 1692677211,
   "score": 94,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8jo1n",
   "message": "Yoga. I have severe upper back pain and went to months of physical therapy. I couldn't keep up with the millions of appointments and started doin yoga as a way to stretch my upper back instead. I was doing it for 30 mins each day and forgot that I had pain. It's so annoying that it does what people say it does because this whole time I thought they were just being annoying but they're 100% right. There's an app that is called \"yoga\" it's a blue dog as the logo, that's the app I really enjoy! You can Customize time and focus area so you can fit things in when you have time",
   "created_utc": 1692683083,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7ocm8",
   "message": "Bluetooth \n\nWizardry if you ask me",
   "created_utc": 1692666615,
   "score": 115,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8iq8m",
   "message": "Glucosamine supplement is my answer. I know the jury is still out on rather or not it actually helps with joint aches and pains, but I swear by it. One of my knees used to fatigue super fast when I go out for a run, but after taking this stuff daily for a couple months it’s soo much better.  Still sometimes I get some aches on runs, it wasn’t a miracle cure, but it’s soo much better than it was before.",
   "created_utc": 1692682413,
   "score": 13,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8h9ne",
   "message": "Salt water swish and gargle for toothache and sore throat (as long as it’s not something like strep). Source: currently have strep and ain’t nothing working. Otherwise even the dentist tells me to salt water swish if I get tooth pain or something stuck. Total relief.",
   "created_utc": 1692681405,
   "score": 24,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7rw0c",
   "message": "Apple cider vinegar can do a lot.  There are some websites that tout it as a cure all.  It's not, obviously, but things like rashes, sunburn, dry scalp or dandruff, etc, it really does work.",
   "created_utc": 1692668157,
   "score": 69,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8hhtq",
   "message": "If you have hiccups, just remind yourself you're not a fish.  It'll fix your hiccups.  Im not even joking",
   "created_utc": 1692681559,
   "score": 35,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8jlbg",
   "message": "ITT: Lots of stuff that's actually snake oil but people foolishly believe it's true.",
   "created_utc": 1692683027,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx82uyy",
   "message": "Melatonin.",
   "created_utc": 1692673136,
   "score": 40,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8hif5",
   "message": "Spoonful of sugar to cure hiccups. Works for me every time.",
   "created_utc": 1692681569,
   "score": 8,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8j4ca",
   "message": "Snake oil.  It is high in Omega-3 and an effective anti-inflammatory.",
   "created_utc": 1692682690,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8dxdv",
   "message": "Here's one that's cool. \n\nBear Bile: collected from the gallbladder of bears for 1000's of years in China and used to treat a variety of digestive disorders and liver diseases is actually 100% legit. Modern medicine now uses Ursodiol (UDCA) a synthetic version that treats liver blockages, gallstones and a host of other issues.",
   "created_utc": 1692679229,
   "score": 24,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8mj7b",
   "message": "Many people can't believe this but: Vaccines are actually Safe and Effective!",
   "created_utc": 1692685177,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8lwga",
   "message": "ITT actual snake oil.",
   "created_utc": 1692684705,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8ksq3",
   "message": "Not sure if this is mainstream now but air fryer \n\nGame changer and so much better than cooking in the grill or oven\n\nI don't really care that you don't use oil I just like how easy it is\n\nI don't have kids but I'd like it even more if I did, it's so good at stuff like frozen chips or chicken nuggets",
   "created_utc": 1692683897,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8jtef",
   "message": "Supposedly digesting Local Honey will stop you from getting seasonal allergies.",
   "created_utc": 1692683189,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8gkdm",
   "message": "Snake oil.\n\nIt was the knockoff stuff that gave it the bad name.",
   "created_utc": 1692680929,
   "score": 8,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7sdpj",
   "message": "Acupuncture is a totally legitimate evidence-based practice. Chiropractic, on the other hand…",
   "created_utc": 1692668375,
   "score": 32,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7na5y",
   "message": "Kickstarter",
   "created_utc": 1692666156,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8lr3n",
   "message": "Direct Neurofeedback. Literal brainwave monitoring and real-time retraining, done subconsciously. It’s actually settled science, is being used by NASA and JPL, and is being tested on Parkinsons patients. Personally, it’s done wonders for my anxiety and depression.",
   "created_utc": 1692684595,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7un1v",
   "message": "Hypnosis. Sounds like voodoo magic but is used in healthcare, has proven medical use, etc",
   "created_utc": 1692669384,
   "score": 242,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8g5gb",
   "message": "Unpopular opinion after liver king BUT - I take Tasmanian freeze dried beef liver caps and after and after a month I was amazed how good I felt. Obviously everyone is different and experiences may vary. \n\nI got into it a few years ago and wouldn’t look back",
   "created_utc": 1692680660,
   "score": 253,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8e1d7",
   "message": "I use a product called xtend bcaa, blue raspberry flavor.  Has sucralose in it though, so need to find something else",
   "created_utc": 1692679300,
   "score": 250,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx7wr3f",
   "message": "Dogecoin",
   "created_utc": 1692670326,
   "score": 214,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8mg08",
   "message": "How effective Medical cannabis is on Parkinson’s and MS.   \n\nYou watch the videos and the effects are like the patients are paid actors before. But it’s real, and it works.",
   "created_utc": 1692685110,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8n07d",
   "message": "Adults drinking pedialyte before a night of drinking.\n\nDigging my fingers into my squishie to hold off hypnic jerk and sleep well.\n\nFancy tea tasting better than cheap stuff. Just got reminded today! I’ve been sipping on jasmine all day! So hydrated and happy.",
   "created_utc": 1692685525,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8n4g9",
   "message": "Anybody got a good remedy for hair loss? I’m using Rogaine and Finesteride. I don’t want to shave my head. Thanks",
   "created_utc": 1692685615,
   "score": 1,
   "submission_id": "15xq86t"
  },
  {
   "comment_id": "jx8nh8w",
   "message": "Feminism",
   "created_utc": 1692685886,
   "score": 1,
   "submission_id": "15xq86t"
  }
 ]
}