{
 "submission_id": "15xzlkr",
 "title": "What are the effects of doing 10 pushups daily for someone who is not very active and has a sedentary job working from home? Is starting with 10 pushups a day a worthwhile endeavor?",
 "selftext": "",
 "created_utc": 1692693394,
 "permalink": "/r/AskReddit/comments/15xzlkr/what_are_the_effects_of_doing_10_pushups_daily/",
 "score": 53,
 "url": "https://www.reddit.com/r/AskReddit/comments/15xzlkr/what_are_the_effects_of_doing_10_pushups_daily/",
 "comments": [
  {
   "comment_id": "jx8x0un",
   "message": "Any effort is worth more then zero effort.",
   "created_utc": 1692693534,
   "score": 197,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8x1mr",
   "message": "I think any exercise is worthwhile, but you’d need to increase the amounts once 10 feels ‘easy’. Keep upping it to see any benefits in your shoulders.",
   "created_utc": 1692693551,
   "score": 73,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8zr2n",
   "message": "Starting with anything is better than nothing. HOWEVER, don't add the opposite (Because I've done 10 push up then i can eat more cake/etc). JUST do the pushup.",
   "created_utc": 1692695759,
   "score": 39,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8xioo",
   "message": "Any number of pushups per day is better than none. \n\nA good way to tell what's right for you is just to get down and see how many you can do (with good form) in a row. That might be 2, it may be 10, then stick to it for a few days. Every second day, you should challenge yourself and see if you can stretch beyond what you thought was your maximum, and if you could do it, stick to it. Boom, you've got progressive overload! \n\nOverall, yes it is very worthwhile. Build a habit and you will find it easier pump them out and this can even help move you onto other forms of exercise, leading to an active and healthy lifestyle!\n\nNow drop down and give me 10!",
   "created_utc": 1692693945,
   "score": 17,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8zu3g",
   "message": "I've recently started doing pullups. Not strict about how many or when, but when I started (2-3 weeks ago) I could do one or two. Now I can do four. I'm a heavy guy.",
   "created_utc": 1692695829,
   "score": 11,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8xbn2",
   "message": "Absolutely valuable. Strive for the consistency of ten daily pushups, gradually transitioning into an effortless routine of increased numbers. Progressing to 20, then 30, and potentially reaching 100 pushups in a single day might lead you to reflect on this decision with gratitude. Just take that initial step – it's truly as uncomplicated as that.\r  \n\r  \nThis person gained considerable attention a year or two ago, offering insights into how anyone can embark on their pushup journey.\r  \nhttps://www.youtube.com/watch?v=zkU6Ok44\\_CI",
   "created_utc": 1692693785,
   "score": 13,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8x1vv",
   "message": "We all start somewhere! It’s important to stay consistent ! Doing 10 is a good starting point but definitely work your way up with more reps each day",
   "created_utc": 1692693558,
   "score": 7,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8xl8n",
   "message": "Do as many as you can.\n\nThen add 1 the next day. \n\nWhether that's 5 or 10. Don't worry about sets when starting off. \n\nThen you can do it twice a day. Before you sleep and after you wake up.",
   "created_utc": 1692694002,
   "score": 14,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8xck0",
   "message": "Starting is the most important step, so the effects can be great! \nSpecially if the person gradually increases the number of push ups and eventually incorporate other forms or exercises. But you got to start somewhere and 10 pushups a day is a great way to start!",
   "created_utc": 1692693806,
   "score": 2,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8xhj3",
   "message": "Doing anything is better than nothing. \n\nSitting is boring and leads to eating more, so I'd buy some new running shoes and maybe some exercise clothes, walk as soon as you wake, then make sure to move every 30 minutes - even if you get off your chair and jog on the spot for 30 seconds. The problem with sitting for so long is you get tired and want energy. You think food will do that, but exercise does more so get in the habit of moving instead of eating.",
   "created_utc": 1692693918,
   "score": 2,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8xitx",
   "message": "Better to do ten push-ups than to not do ten push-ups. After you do ten push-ups for awhile, you'll get bored. They will probably turn into 20...than 100. Or you might start thinking about other forms of exercise. So do those ten push-ups.",
   "created_utc": 1692693948,
   "score": 2,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx906tr",
   "message": "Just the habit of doing some exercise every single day is already super valuable.\n\nJust the mindset of doing that is already a lot!\n\nThen you can adjust the activities to what you need. Add more pushup, do it more often, go for a brisk walk or a short run, ....",
   "created_utc": 1692696121,
   "score": 2,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx91r43",
   "message": "I started with 10 push ups every.morning. it was the most I could do. A couple weeks and I was up to 15. I'm now doing 1 set of 30 every morning and a set of 30 some evenings. I'd like to get to 40 soon. It's only a few minutes each set so nobody can say they don't have time and i feel a fair bit stronger too.",
   "created_utc": 1692697369,
   "score": 2,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx93q6l",
   "message": "Long story short: YES!!\n\nAnything more than nothing is better. You'll eventually find 10 to be easy and you wil increase difficulty or the amount.\n\nEffects include:\n\n1. Muscle strength growth (noticable after the first week. Record your first and last workout to compare)\n2. Muscle size growth, same as 1 but not as noticable.\n3. Overall fitness\n4. You'll discover weak points (maybe lower back, triceps, wrists)\n\nThere are more effects but these will certainly happen. There is _no_ reason not to start with 10. You could even start with less if you cant just yet make 10 push-ups.\n\nA lot of people start with 5. \n\nAdvice: do at least 2 sets of 10. The last two push-ups in the last set should be near failure (form is incorrect) or, do push-ups toll failure.\n\nYour gains are mostly in the failure part. This should be a good base to work on.\n\nSource: information gotten from Atlean-X and Jeremy Ethier. Also my personal experience in testing afore mentioned sources.",
   "created_utc": 1692698896,
   "score": 2,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx98r7z",
   "message": "Starting with 10 pushups a day can be a worthwhile endeavor, especially if you're not very active and have a sedentary job. Incorporating some form of physical activity, even if it's just a small amount, can have several benefits.  \nDoing 10 pushups daily can help gradually increase your upper body strength over time.Strengthening your upper body muscles can contribute to better posture, which can be especially beneficial if you spend a lot of time sitting at a desk.  \nEngaging in short bursts of physical activity like pushups can slightly increase your metabolic rate, potentially aiding in calorie burning and weight management.  \nPhysical activity, even in small amounts, can trigger the release of endorphins, which are natural mood lifters. This can help combat stress and improve overall well-being.  \nOnce you're comfortable with 10 pushups, you might find it easier to incorporate other exercises or increase the intensity of your workout routine.",
   "created_utc": 1692702360,
   "score": 2,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9a6hs",
   "message": "I'd be concened about posture as pushups tend to tighen your chest and front delts. If you had to do only one exercise a day some pulling exercise like pullups or easier variations would be much better, especially as you say you have a sedentary job",
   "created_utc": 1692703249,
   "score": 2,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9b2x3",
   "message": "Any starting point is good.",
   "created_utc": 1692703795,
   "score": 2,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9bsw1",
   "message": "I love how everyone is jumping on how to increase the number. Hell, just do the ten each day and be proud that you made that change. You will be doing ten more than half the population and you will be better for it.",
   "created_utc": 1692704213,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8x8st",
   "message": "Start with 10, and do them 5 times a day.",
   "created_utc": 1692693718,
   "score": 3,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9eooo",
   "message": "I guess its equal to having diet coke with whole burger king menu",
   "created_utc": 1692705785,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8x5m0",
   "message": "Make it 50. 10 sets of 5. Seriously should only take about 15 minutes out of your day.",
   "created_utc": 1692693644,
   "score": 251,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8xais",
   "message": "If you eventually push beyond 10 yes otherwise no",
   "created_utc": 1692693758,
   "score": 255,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8ytqe",
   "message": "You should train for 1 hour at a nearby gym.",
   "created_utc": 1692694995,
   "score": 248,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8x822",
   "message": "I guess you could find someone on fiverr to do it for you.",
   "created_utc": 1692693700,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8y59v",
   "message": "Any sort of exercise is worth it, especially if you're generally sedentary.  Will 10 a day give you massive muscles?  Probably not, but over time you will gain strength and if your muscles grow, you'll burn more calories at rest.",
   "created_utc": 1692694446,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8y8oy",
   "message": "Depends on your weight a little. If you’re really skinny 10 might not be enough to really build muscle but you don’t want to do too many. Your muscles shouldn’t be too sore you need to recover every single day. There’s some studies that show that kind of exercise is really good for strength. You may not get as big as you would from lifting heavy a few times a week but you’ll see strength gains.   \n\nThink of guys that do manual labor everyday. They get really strong but don’t necessarily have a great physique without adding in gym training",
   "created_utc": 1692694523,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx8zpwl",
   "message": "It certainly can't hurt.",
   "created_utc": 1692695731,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx90vxx",
   "message": "Better then nothing for sure, if you have space for adding few pullups 👍🏻",
   "created_utc": 1692696682,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9169h",
   "message": "Starting with any form of exercise is a good start in the right direction.",
   "created_utc": 1692696914,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx917wd",
   "message": "I actually do this and it has helped me and as the other comments say \"Any effort is worth more than zero effect\".",
   "created_utc": 1692696949,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx91acz",
   "message": "if your max is 10 a day, i would consider to do assisted pushups. maybe using some bands or trx. or even just making the angle you do the pushups not so hard. you could use a chair to get a better angle. \n\nyou really want to aim for at least 3 x 10 pushups a day if not more.",
   "created_utc": 1692697002,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx91o0j",
   "message": "i think anytime we practice good health no matter how it starts out it promotes better fitness and mindful of what you put into your body it also promotes better mental health so yes i think it’s worthwhile",
   "created_utc": 1692697302,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx91was",
   "message": "The journey of a thousand push ups begins with one push up.",
   "created_utc": 1692697483,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx92cf6",
   "message": "Do series of 10 during your day, at some point you will get pumped, you will be proud and will keep going and do more and become fit, best feeling ever",
   "created_utc": 1692697837,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx92wkp",
   "message": "When I was recovering from an injury I did 10 pushups, jumping jacks and crunches through the day for a week then went to 11 on day 8, 12 on day 9 etc then by about 2 weeks you naturally want to add more\n\nYou have to start somewhere",
   "created_utc": 1692698273,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx93l53",
   "message": "Do it. Also, once you are able to do lots of pushups and in better shape, you can \"go back to only 10\" and maintain your physique. But by then you'll be wanting to do more anyways.",
   "created_utc": 1692698792,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx945vp",
   "message": "There are definitly much better training approaches than that, but it is better than doing nothing.\n\nBut beware of impalances. You could get tight shoulders and shortened chest muscels if you do no other training or no flexing at all.\n\nI would guess that after some time you would get bored and then either stop or look into some better training plans.",
   "created_utc": 1692699219,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx94d79",
   "message": "This is a 20 minute workout daily, 25 with a warmup, every person has that much to spare, do it daily and you'll feel so much better after spending 8+ hours sitting.\n\nhttps://www.youtube.com/watch?v=UjwKKl157hw",
   "created_utc": 1692699369,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx94jnz",
   "message": "Yes! Any small step that you'll be able to do consistently is worthwhile. It's actually one of the best pieces of advice you'll get from anyone interested in physical health - do the thing that you can do without disruption. After a while your body will naturally crave a little bit more, and then you'll move to maybe 12 pushups and 20 squats for good measure. One year later you may very well be running a fiver and doing a nice 30-minute routine afterwards. Baby steps.",
   "created_utc": 1692699499,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx94pzn",
   "message": "1 push is better than no push up.\n\nSo 10 pushs up a day is great.\n\nBut don't stop at 10.\n\nYou'll eventually get to 20, 30, 40 and more.\n\nPush ups is one of the best exercise, but please do it with proper form.",
   "created_utc": 1692699624,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx959nm",
   "message": "Absolutely. After 30 days, you'll need to raise the bar to continue to progress.  Slow controlled movements. It's not about accomplishing the movement, it's accomplishing the mind/muscle connections through establishing new neuronal pathways. If you can do 10 push-ups easy, concentrate on the muscle activation and do then slow. Make them as hard as possible on purpose. Don't just blast them out, make them slow, deliberate, and as difficult as possible. Flex your chest at the top. Tighten your core. Take 3 to 5 seconds per pushup. There's a HUGE difference in simply performing the movement vs activating the muscle fibers at full capacity. That's why you don't need heavy weights if you know how to properly activate the muscle with your mind. The heavy weights typically do activate the muscle fibers better simply because it forces them to, but if you do it yourself, your mind, you won't need heavy weight. Do it. Stick to the routine. See results.",
   "created_utc": 1692700007,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx95abq",
   "message": "Probably a good starting point",
   "created_utc": 1692700021,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx95j55",
   "message": "10 strict, slow, mentally activated deliberate push-ups are probably equal to at least 40 regular push-ups blasted out with no concentration at all.",
   "created_utc": 1692700192,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx95sow",
   "message": "I started doing this in the morning on workdays. Wakes me up a bit and my grip has improved after a few weeks. I'm barely going up, around 1 rep a week, but it's still better than before.",
   "created_utc": 1692700378,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9614x",
   "message": "Gotta start somewhere.",
   "created_utc": 1692700543,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx96i69",
   "message": "Learn proper form and give it a try. Not doing will make you continue to question. And doing will only hurt your muscles slightly till you're used to it, or your pride if you get too frustrated at too high a goal and give up. \n\nDo your max at first. could be 1, could be 10 and keep increasing by 1 going forward.",
   "created_utc": 1692700872,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx96knc",
   "message": "Like everyone is saying, something is better than nothing.\n\nBut [walking seems to be the best all-around exercise.](https://www.mayoclinic.org/healthy-lifestyle/fitness/in-depth/walking/art-20046261) Walk around your neighborhood. Walk at a mall. Walk in a park. Walk somewhere.\n\nVarious sources recommend [150 minutes of activity every week](https://www.cdc.gov/physicalactivity/basics/adults/index.htm) for good health.",
   "created_utc": 1692700918,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx96qsw",
   "message": "Every exercise plan starts small.   Do what you can do.   As time goes on you can choose to do more or the same but you'll never have that choice if you don't start.",
   "created_utc": 1692701036,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx97lgd",
   "message": "Definitely worthwhile, but add in some other exercises and eat healthier too.  You'll be surprised how easy it becomes after a couple of weeks.  As a doctor once told me, the moment we stop moving is the moment we start to die.\n\nWhen I worked from home I had a timer set to remind me to get up and move around every hour.",
   "created_utc": 1692701605,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9825g",
   "message": "It definitely is and the only way i could get myself to start working out is little by little.\n\nI worked in tech had a very sedentary lifestyle and I'm mid 30s. Could no longer play with my kids without heaving and turning blue. Held that thought for years.\n\nI got a cross machine said all i wanted to do was 15 minutes daily. Stuck to it for a week then it became a coat hanger. \n\nA year later i went back to it. Started 15 min again but this time had more motivation to keep. Yes 15 min is definitely better than nothing, and i did not expect a major chnage but anything was better then nothing in my mind.\n\nLittle by little i got into a groove, kept doing the 15 min. Got better reaching 15 min no issue. Then it became 20, then 25. Then kept increasing difficulty. Figured why not add some weightlifting just to better my spongy body. \n\nLong story short I've been running 3-4 km in 25 min and around 1hr weightlifting day on day off for the past 5 months. Body improved i finally have a little muscle, nothing spectacular but definitely fit better in clothes and can finally play with my kids like i wished years ago.\n\nWithout the 15 min goal at start i would have never got here. So yeah your 10 pushups have the same potential.\n\nGoodluck and for me the key was not what you do. The goal is to be active in any way shape or form for a year. That's it. All i want is something i can keep doing. No other strings attached.",
   "created_utc": 1692701910,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx988rc",
   "message": "Something as simple as parking a little further away from the entrance is huge. It's not about the extra steps, it's about the mindset.\n\nTen push-ups? Hell yeah, even if it's just to remind yourself that you matter to you.\n\nCheesy, but that's my input",
   "created_utc": 1692702029,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9ahd3",
   "message": "youre gunna have to bump those numbers up those are rookie numbers.\n\nYou should start with 150 and move up 50 every week or two.",
   "created_utc": 1692703431,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9bksy",
   "message": "It won't do much but starting regular exercise is the hardest part. Once you've done 10 a day for a while it will be easy to increase by small amounts, maybe 1 extra per week.",
   "created_utc": 1692704087,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9c4am",
   "message": "You start with what you can do, not what you can't, and then build from there.\n\nIf you can do 10 pushups each day, in a week you'll probably be able to do 12, 15, or 20 a day.",
   "created_utc": 1692704391,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9csnl",
   "message": "Not sure on the exact stats but it goes along the lines of. \"Doing 10 minutes of working out a day for someone who never works out is more beneficial than someone who works out everyday for longer periods.\" Or some crap like that. The point being doing any amount of physical exercise will be extremely beneficial even if you don't physically see results.",
   "created_utc": 1692704767,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9ed6g",
   "message": "Do it! That’s how I started. Now I do 120 push-ups every morning.\n\nMy advice is just focus on doing the 10. Don’t think about adding more reps every week or anything like that. Just do the 10.\n\nFind the routine. Get comfortable with it. Make it something you do while you make your morning coffee/tea/juice. Make it almost effortless.\n\nThen at some point you’ll think to yourself “this is easy, I’ll do a couple more today.”\n\nBuilding the routine is the most important thing, you can increase your reps and think about adding more once you have that part down.\n\nGood luck!",
   "created_utc": 1692705616,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9eey5",
   "message": "Yes. But add more. \n\nAdd 1 push every day until you can't. Then add again when you feel like you can again. Keep adding until you can do 30 in a row.\n\nTHEN do 3 sets of 15 a day. \nAnd then keep adding till you can do 3 sets of 20.\n\nYou got this!",
   "created_utc": 1692705642,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9elec",
   "message": "I started with 10 wall push-ups daily and that helped me to get in the groove",
   "created_utc": 1692705737,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9f2xw",
   "message": "I couldn't even do 5 when I started, can bang out 20 no easily after less than a month. Do it!!! You'll feel really good.",
   "created_utc": 1692705995,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9fo36",
   "message": "The cool thing with a simple approach like this is it gets the body interested in more. You can approach it tired as hell, get down and do some pushups, and then feel your body craving more activity. \n\nPushups followed by squats makes for an easy exercise that isn’t too strenuous. End with some deep stretches: reach for the ceiling, bend at the waste, try to touch your toes (I still can’t). \n\nAgain, doing some pushups will make the body want more. Anything to move the joints and stretch things out will feel great. You will overall feel better in no time.",
   "created_utc": 1692706300,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9g5d7",
   "message": "100 pushups 100 sit ups 100 squats and a 10km run",
   "created_utc": 1692706549,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9gkwj",
   "message": "and body weight squats.   \n\nso yes!   you can try to do more than 10 a day though.",
   "created_utc": 1692706770,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9gpom",
   "message": "Building a routine of doing literally anything is the important part",
   "created_utc": 1692706838,
   "score": 1,
   "submission_id": "15xzlkr"
  },
  {
   "comment_id": "jx9gpwv",
   "message": "I started doing 10- 20 a day 1 month ago and I definitely notice a difference. \n\nStart small and you'll build over time. But take that first step.",
   "created_utc": 1692706841,
   "score": 1,
   "submission_id": "15xzlkr"
  }
 ]
}