{
 "submission_id": "15y7fk6",
 "title": "What was your most sexual nonsexual interaction?",
 "selftext": "",
 "created_utc": 1692714433,
 "permalink": "/r/AskReddit/comments/15y7fk6/what_was_your_most_sexual_nonsexual_interaction/",
 "score": 237,
 "url": "https://www.reddit.com/r/AskReddit/comments/15y7fk6/what_was_your_most_sexual_nonsexual_interaction/",
 "comments": [
  {
   "comment_id": "jxa3rgn",
   "message": "A worker at a fast food restaurant gave me some vibes like she was attracted to me… then when I tried paying for my food by debit card the machine didn’t read it properly, so she then looked me in the eye and said in a flirty voice: “you’re gonna have to pullout (referring to the card)…. then you can put it back in a few times”.\n\nIt was probably all in my head; but I’ve never before had such an innocent interaction with such a sexual undertone.",
   "created_utc": 1692716763,
   "score": 29,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxa4aql",
   "message": "Sat on a bus next to a beautiful stranger for a long trip. We talked for a while because we were gonna be up in each other's personal space for the next half a day. So the trip goes on, we're minding our own business, I'm busy reading, and then suddenly I feel something lean up against my shoulder: She had fallen asleep and her head was resting on me. I thought I couldn't wake her up cause that would be rude, so I just sat and kept minding my own business. FF a couple of minutes, and she started pressing her leg against me, and then finally over of my knee.\n\nShe wakes up like half an hour later, realizes the situation, and profusely apologizes. I know she was just sleeping, but I am going to lie if I say I hadn't imagined the next 30 years with her lmao.",
   "created_utc": 1692716969,
   "score": 128,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxa1fkj",
   "message": "When I was a teenager I had to see a rheumatologist. She was fairly young and very attractive. She did a test by poking her fingers into pressure points all over my body. A few times it made me yelp in pain. She leaned over and whispered in a deep voice, \"Sorry about that. I'm very good at inflicting pain.\" I just about died.",
   "created_utc": 1692715863,
   "score": 82,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jx9yusx",
   "message": "I’ll go first.  \n\nIn college, had a roommate who was dating an extremely wealthy girl (her parents bought her a 300k apartment to live in while she was in school… just stupid money) and one night, the 3 of us went out for some drinks, then went back to her place to crash since the bar was right down the street. They went to bed and I slept on the couch but at some point rolled onto the floor. When I woke up in the morning I smelled coffee and looked over to see my roommates gf in a tank top and panties. \n\nIt gets worse. \n\nIt was a split second later my body remembered my back is made of jello and moldy bread and I couldn’t move that much so I attempted to crawl on the couch. The gf knows of my marshmallow spine and immediately comes over and helps me to the couch and sits down next to me and goes “DONT WORRY MY MOM IS A MASSEUSE AND MY DAD IS A CHIROPRACTOR. ILL FIX IT.”\n\nI got a massage from a half naked woman who was just out here doing the lords work while I couldn’t move for multiple reasons. Best part. Roommate walked out of the bedroom and didn’t even question it. Just went “is OPs back fucked up again?”",
   "created_utc": 1692714864,
   "score": 253,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxarkp5",
   "message": "Young me in a miniskirt wanted to try some high boots in a gothstore - one guy that worked there insisted in helping me - knelt before me and tied them all up",
   "created_utc": 1692725597,
   "score": 215,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxb6x2w",
   "message": "Took a ballroom dancing class in college. Last class I got paired up with a girl I hadn't met before. We didn't say much, but there felt like there was some instant chemistry or tension. About halfway through the class we were just about to do a waltz. I went up to her to start, and for some reason I just grabbed her and pulled her sharply into me. She gasped, flushed deep red, and broke out in a sweat",
   "created_utc": 1692731243,
   "score": 49,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbdsfw",
   "message": "I've had more than one girlfriend ask me if they can hold my penis while I pee. Nonsexual because there was no sex and none of us are/were into that sort of thing, but sexual because penis.",
   "created_utc": 1692733787,
   "score": 103,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbjx4j",
   "message": "One day back in 1998, I lit a smoke for a girl. She gently touched my lighter hand with hers and maintained eye contact throughout . I was done.",
   "created_utc": 1692736018,
   "score": 192,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbb0xm",
   "message": "A girl was hiding out in my room from her friend, she had to answer a call and I asked if she wanted pasta, she responded “Yep, thanks daddy” and I genuinely didn’t know how to respond. She later explained that I reminded her of her dad’s house and didn’t think before responding. Still threw me through a loop.",
   "created_utc": 1692732767,
   "score": 151,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbkojo",
   "message": "I (male) was taking a scuba diving class in my university.  There was a stunning redhead with a amazing body.  We never spoke in class.  Fast forward to the end of the school year.  We are diving for 2 days at a lake doing the checkout dives.  One day 1 as I am exiting the water she is entering the water and said something to like “hurry up you are holding me up” I have no idea why but my response was “Fuck you” in a playful tone.  She smiles and responds “OK”.  My mind is blown.  Class ends and she said. I’ll see you tomorrow.  The next day she did not make it to class because she was involved in a car accident.  She had injuries that kept her from diving.  So yeah. Never saw her again. It’s been 23 years and I still remember that sexy redhead in the white two piece.",
   "created_utc": 1692736297,
   "score": 134,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jx9xztj",
   "message": "Accidently touching a boob",
   "created_utc": 1692714525,
   "score": 76,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jx9y6da",
   "message": "I drive Lyft, and one night at like 1 am I had a passenger who kept calling me baby and let me hit her vape and gave me weed. Just the sweetness in her voice was so gushy",
   "created_utc": 1692714598,
   "score": 82,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxb78z5",
   "message": "I don’t know what you’d consider sexual or nonsexual, but once I was taking pictures at a festival of a girl dancing. She then proceeded to show off the cute slits in her cute dress and her lack of panties underneath. I’m usually pretty focused and unaffected when shooting, but good damn if that wasn’t one of my most sexually charged moments as a photographer.",
   "created_utc": 1692731363,
   "score": 91,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbbtq7",
   "message": "Drove two girls in my grade to school every morning in high school. Both extremely attractive and out of my league, but we grew up together and were good friends. One morning we are driving to school and I get cut off, I slammed on the brakes and I put out my right hand instinctively (I know it’s dumb) and got handful of boob. \n\nIt was a bit awkward but she seemed more worried about us almost rear ending a car. I apologized profusely and she said it wasn’t a big deal.",
   "created_utc": 1692733064,
   "score": 129,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxarxd5",
   "message": "Handing a piece of carrot stick with some dip on the tip to a girl at a party, which she proceeded to dab on her lips before sucking the carrot stick in her mouth all while maintaining eye contact. She was super drunk so thought nothing of it but dayum...",
   "created_utc": 1692725728,
   "score": 65,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxasgim",
   "message": "I once went to shake my head of HR's hand and he went in for a kiss on the cheek which threw me off so I accidentally grabbed his bum whilst he kissed by cheek and it was very intimate.",
   "created_utc": 1692725922,
   "score": 93,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbams4",
   "message": "Not sure if this applies, but:\n\nWorked at a pizza place when I was in college.  Most of the staff were other teenagers that I went to high school with.  Closed the place down for the night, and we all hung out in the parking lot sharing a joint and shooting the shit.\n\nFor no reason whatsoever in the middle of this conversation, I and a female friend of mine, began slowly moving our heads toward one another.  You know like when you're working your way slowly towards a first kiss?  It was absolutely electric.  I could feel it, and I could tell she could feel it too.  And then in like an instant we both kind of came to and snapped our heads back before anything happened.  We both kind of looked at each other sort of bashful, and then went back to the conversation like nothing happened.  We've never spoken about it since and we're still friends today and both happily married (to other people).",
   "created_utc": 1692732620,
   "score": 38,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbcimg",
   "message": "i was playing saxophone in a band in a hot cellar, and when we finished i was sweating heavily.  A lovely young woman (who i had just been introduced to as the girlfriend of the guy doing the light show) came up and told me how much she liked my playing and i thanked her and as we chatted i tried to say something technical about my playing since she kept complementing me about how much she liked it, but she told me she liked it because it was so sexual.  i got bashful and thanked her profusely and i said i'd hug her except i was so sweaty.  She grabbed my forearm and licked the sweat off. i never saw her again.",
   "created_utc": 1692733319,
   "score": 53,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbhtzd",
   "message": "Told a friend I didn't get the the whole \"Daddy\" thing some women do.\n\nShe then showed me why by calling me Daddy the entire evening.",
   "created_utc": 1692735255,
   "score": 71,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxb80c0",
   "message": "I got a boner while watching a good friend's widow crying at his funeral.",
   "created_utc": 1692731646,
   "score": 28,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxawit8",
   "message": "The toothbrush scene from a certain anime",
   "created_utc": 1692727419,
   "score": 14,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxb7jw7",
   "message": "My old crush brushing against my dick while skinny dipping",
   "created_utc": 1692731477,
   "score": 12,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbc10k",
   "message": "I was at a newtworking thing on an out of town business trip. Had many drinks and decided to bail. No ubers available and my hotel wasn't that far so I decided to walk. It was FREEZING out (polar vortex) and a cop rolled up behind me, lights flashing. Out steps a gorgeous female officer wondering why I am walking drunk down a busy road in arctic conditions. I explain that I am just walking to my hotel and she offers a ride but says she has to check me for weapons first. Hands on the hood of the cop car, she gives me a very deliberate patdown and seems to linger around my swimsuit area.\n\nI get in the front seat next to her after being cleared. It's a very short drive to the hotel but we get every red light and it takes maybe 10 minutes. The entire time was the most delightful, flirty conversation ever. At the hotel, I get out and say thanks for the ride. I can still picture the look on her face and I swear she wanted me to invite her up to my room.\n\nMaybe it was all in my head and my ego was inflated with alcohol but I don't think so. She had the cutest laugh and was cracking up at my stupid jokes on the ride. If I weren't married I definitely would have taken my shot. Absolutely the hottest interaction with police I have ever had.",
   "created_utc": 1692733139,
   "score": 56,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxblib1",
   "message": "I’m not very social and can’t really talk to people even if I want to. I met this girl who’s a friend of a friend. She was just as awkward and I thought she was cute too. We talked on weekly basis for a few months on instagram talking about our lives and stuff. Made plans to meet someday too but never really got to. \n\nOne time we finally made plans to meet and we did. I don’t really go out on dates for meals and coffee so i suggested we drive around listen to music and chill. We smoked up during the drive and listened to music. We were comfortable eight with each to start singing together and had a really great time watching the sunset while driving and singing together. At some point we held hands together and she rested her head on my shoulder holding on to my arm. I couldn’t believe how happy i was at the moment.\n\nWell that was more than three months ago, we haven’t met after that and don’t get to talk that much. But i still think about her most of the time.",
   "created_utc": 1692736602,
   "score": 41,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbg9o3",
   "message": "I spent the night at a friend's house back in grade school.  We were horsing around and I cut my knee on something.\n\nHis stepmother (much younger than dad and hot as hell) knelt down in front of me to bangage it up wearing only her nightgown.  As I looked down I saw my first set of bare breasts.  Man, they were glorious!",
   "created_utc": 1692734685,
   "score": 27,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbogbb",
   "message": "high school",
   "created_utc": 1692737686,
   "score": 41,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxb91iz",
   "message": "I got a physical done by a beautiful pa, she had me drop my underwear and well yeah.",
   "created_utc": 1692732029,
   "score": 16,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbf2m9",
   "message": "I work for a school. I went into the lunch room and asked one of the cafeteria workers if I could get some milk for my protein shake. She said \"Oh honey, you can have my milk or you can have hers.\" As she was pointing to a rater large chested woman who was also a cafeteria worker. I'm like yeah, I gotta get out of here.",
   "created_utc": 1692734251,
   "score": 25,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxba4av",
   "message": "Doctors office. Very beautiful, charming, brand new doctor needs to check my butt.\n\nRealizes that the room was set up wrong, no lube. She's gloves up and says something like she's just going to go for it.\n\nWe have a little talk about how that's not going to happen with a hole that doesn't self lubricate. She went and got the lube.\n\nLike shit, a lil rough is ok but even if you're cute at least take me to dinner and spit on it a bit first....",
   "created_utc": 1692732428,
   "score": 14,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbf8fn",
   "message": "I was working at a CVS 4 years ago and a guy comes up to the register with extra large condoms, I'm holding the package to scan it with a huge smile on my face and I looked for a buldge then I looked at him and he is soooo smiling, I kinda forgot to scan it, he reminded me to scan it",
   "created_utc": 1692734309,
   "score": 14,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbh7r3",
   "message": "Two different experiences with two different friends:\n\n1. Me and 3 other female friends were coming back from the beach where we spend the weekend and my friend said her dream was to show her boobs on the road. She almost did it but my friend that was driving didn't let her because it might be a felony.\n2. My friends (F) and I were by the pool and my friend wanted to take pictures in the outside shower. Detail: she wanted topless photos. I went to the bathroom and when I came back they were still taking pictures and I kinda frooze as I saw her with her hands covering her breasts. We shared a look that felt like forever and I continued my path to the kitchen.\n\nNever happened anything with them and never will because I value their friendship so very much, but still...",
   "created_utc": 1692735030,
   "score": 7,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbirnl",
   "message": "Me and my female friend were getting drunk one night and she declared she wanted a \"Men at Work\" road works sign, the one with the person with a shovel. So late teens early 20s us decide to go get one just down the road at like 2am, thinking there's gonna be no-one about in the quiet suburban type area.\n\nSo off we set/stagger to get this sign and it doesn't take us long to find it and we start eyeing it up only to notice a cop car parked nearby... shit balls.\n\nTurning back would make us look Sus as hell so we tuck into a shadowy spot that's kinda out of sight but not really so we can watch the cop car. It was a small spot and we heard the cops talking saying what happened to us... We on instinct turned to face each other and hugged like we were kissing and started giggling out of drunken embarrassment more than anything.\n\nNext thing a bright torch light shines on us, cops (who were in their late 30s, early 40s) asks what's happening, if my friend was ok (drunk lady late at night I kinda get the precaution) and told us to head home if we wanted to take things further. They hopped in their car and left. We waved them goodbye and left ourselves...\n\nAnd we forgot the fudging sign!!",
   "created_utc": 1692735598,
   "score": 20,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxborud",
   "message": "I was a music major but got interested in programming near the end of my college career. I was about to graduate, but still wanted to take some math in hopes of maybe getting into some software engineering classes before my school finally sent me out into the wide world.\n\nMy Calculus 1 class I subsequently enrolled in had a bit of group work with our assigned desk partners, and as I sat down in our first class, I immediately noticed that my desk partner was gorgeous. She introduced herself with an unusual name, and I assume she was used to people mispronouncing it because she immediately instructed me, forcefully, almost angrily, to repeat it by saying \"Say it. Say my name.\"\n\nI couldn't stand up for a few minutes.",
   "created_utc": 1692737805,
   "score": 50,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbw4bs",
   "message": "Do massages count? On more than occasion I had couples massages with my wife and the woman massaging me was attractive. Needless to say, I enjoyed it. NO happy ending",
   "created_utc": 1692740599,
   "score": 6,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxa42ob",
   "message": "I was helping a colleague train for life guarding after she had finished she ask for my help getting out of the pool, I leaned back and pulled her up in doing so pushed herself into me rubbing her face, tits and groin looked me dead in the eyes and said I always wanted to do that. \n\nNow I knew she was a strange one with a mental sense of humour but I certainly was wank worthy. Note. She was dating my F flat mate so I didn’t think any of it other than she was just teasing but then a couple of weeks later we all went out and shared a hotel room she woke up swung her legs out and Sharon stoned me went to the toilet and went back and winked at me so I returned the favour I got up shown her my morning wood went to toilet and went back to bed. I decided it was better we didn’t spend time together after that and shortly after I got a better job.",
   "created_utc": 1692716883,
   "score": 11,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbutaa",
   "message": "Getting my teeth cleaned felt oddly intimate. She was very cute and had to gently move my head in a lot of weird ways, I left very confused lol",
   "created_utc": 1692740091,
   "score": 4,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbuuww",
   "message": "My friends and i used to light each others Cigarettes by touching the Tips together. Which lead to a few times where i was less than 2 cigarette lengths away from my crushs lips while looking straight into her eyes.\nHad me woozy from more than just the nicotine.",
   "created_utc": 1692740109,
   "score": 3,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbv4mg",
   "message": "Went to the river with friends,  I'm a guy. One of the girls who was there I ended up hanging out with more than the other folks. At the end of the day, I realized I had leaches on my lower area when I was peeing in the woods, she helped me get them from under my balls then she stripped down and had me inspect her... like every inch. It's was cool because we were just friends at the time. Never thought I'd be exploring my future girlfriend for leaches haha.",
   "created_utc": 1692740213,
   "score": 3,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbx3zg",
   "message": "I was returning home from school with a classmate of mine in one of those rickshaws in India. It started raining heavily and he pulled out his umbrella, opened it to shield us from the rain. He slowly asks if its okay if he leans towards me to hold the umbrella in place, and I say okay. He presses his thighs on mine and puts his arm around my shoulder. I died a little.",
   "created_utc": 1692740988,
   "score": 6,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbx79v",
   "message": "I was in a very very crowded bar/club, crowded to the point of barely even being able to squeeze past people. No idea how I ended up there, I hate tightly packed environments like that. On your way through the crowd you had to occasionally pause squeezing past people because there was just no small opening to even attempt to keep moving and you’d end up literally pressed against some stranger for a few seconds. I paused and ended up face to face pressed up against this guy, we politely smiled at each other in a “this is awkward but there’s no other option way”. He tried to make a bit of room for me and made some comment about how ridiculously crowded it was. I thought it was a nice gesture, and he seemed so sincere as opposed to all of the drunk oblivious idiots I was surrounded by. Between his kind gesture calming down my crowd anxiety and the nonexistent physical space between us I kind of froze. A few seconds after we were able to move past each other I wish we had exchanged numbers or something.",
   "created_utc": 1692741024,
   "score": 3,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbx7zu",
   "message": "At uni my girlfriend and her female housemates decided to have a wrestling competition on her bed with me. I was pinned down, straddled and crushed by thighs by each one of them before watching them wrestle each other for dominance. One girl who held me down for a while got so excited down there she actually left a wet patch on me after. They were very racially diverse which made it even hotter.\n\nI will never get over it. I can't believe how lucky I was.",
   "created_utc": 1692741032,
   "score": 7,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbx9wq",
   "message": "Not sexual per se, but very romantic feeling- when I was in college I booked a cheap flight home for the holidays on a very small plane. Took off in a pretty massive thunderstorm, to the point that gusts of wind were lurching the plane like some kind of cheap carnival ride. Sat next to a very cute girl a few years older than me, newly engaged (she showed me her ring). When the wind started to pick up, she looked over nervously and asked, “I’m a little scared, could I maybe um, hold your hand?” I said sure, and she reached over and she kept my hand locked in a death grip for about 20 minutes, while talking about her family (and fiancé) to keep her mind off of things the whole time. After we landed safely without any issues, she just looked so grateful, said a relieved “thank you” and gave me a quick hug as we were leaving. It was very sweet, I was still pretty awkward with women at that point in my life and it felt great to make a positive connection in that way.",
   "created_utc": 1692741053,
   "score": 14,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbl9wa",
   "message": "Every slow dance at a Bar/Bat Mitzvah party when I was 13",
   "created_utc": 1692736517,
   "score": 7,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbdr1r",
   "message": "I had an ultrasound done back when I was 18 and the lady was like \"it feels really good doesnt it?\" In a weird ass way. Then asked me if I wanted her to keep doing it.",
   "created_utc": 1692733773,
   "score": 2,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbgffp",
   "message": "In my mid twenties I went to a new Dr. She was a younger blonde, when she walked in i figured she was a medschool student which is fine, whatever. Anyway, she was getting ready to prescribe me a medication and she said \"hows your sex drive? I wouldnt want to ruin the sex drive of a young buck such as yourself\" while looking me straight in the eye. I told her \"it's great\" and she said \"thats what i wanted to hear\" and she wrote the script and left. She left for another officr shortly after and my insurance wasnt accepted there. 🤣",
   "created_utc": 1692734743,
   "score": 5,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbq00q",
   "message": "At Panera, making a coffee. I did a large light roast with 3 raw sugar.\n\nStrange woman: Hah, you ever have a little coffee with you sugar?\n\nMe: Ah, I like this brand but my wife doesn't let me keep the good stuff at home.\n\nStrange woman: (touches my arm and leans in) Then maybe you need to look outside of your home for the good stuff.\n\nMe: What the fuck?",
   "created_utc": 1692738268,
   "score": 20,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbttj9",
   "message": "A while ago there was this Trend called speaking in cursive. One time me and a few friends tried it and while trying to get the cadence right my girl best friend basically moaned my Name. Had me bright Red in under a second.",
   "created_utc": 1692739708,
   "score": 3,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbw7bj",
   "message": "Went to a mental institution for people with borderline where they were unable to help me because women get wrongfully diagnosed with borderline a lot and I was one of them. Because of this however there was only one man and the rest of us were all women. I wasn't ever really part of \"girl groups\" because I used to get bullied and I just retreated and avoided socializing constantly so this was all new to me. One day one of the girls just randomly sat on my lap and I felt a weird sensation in my chest I've never felt before. That was the day I found out that I wasn't nearly as straight as I thought I was. So in the end that clinic was good for something lol",
   "created_utc": 1692740631,
   "score": 4,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbx3cq",
   "message": "I went on a first date with this beautiful girl, and out of nowhere while I was watching the stage, she leaned in and kissed my neck very gently.",
   "created_utc": 1692740981,
   "score": 2,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbxdg7",
   "message": "Icy, snowy day in a usually hot desert state, and I was walking from my car to work. I gashed my hand open trying to catch myself on a street sign when I slipped on ice. It was super early in the morning and the only person around was the cop/EMT on duty who was rolling by in his squad SUV. Nice fellow, a good twenty years older than me (F late twenties at the time), had known each other for a good five years through the fire department (my significant other is a full time firefighter).\n\nI definitely considered this man a good friend, and never anything but a platonic one. He’s married, I am happily in a long term relationship with a wonderful man. It’s a small town, so we interacted frequently.\n\nHe stopped and came over with his medic bag to check on me. I’d gotten up and was on a street bench trying to stop the bleeding and he came over and we talked for a few seconds and he asked if he could check my hand out, so I let him take my hand in his.\n\nI suppose we’d never had any physical contact before this, aside from a brief handshake the first time we met, but when he took my hand it was like the most insane current of electricity ran through me and I got hot and tingly all over. I know he felt it too. We stared at each other for a few seconds and he turned bright red and sort of fumbled and muttered his way through disinfecting and wrapping up my hand. He was wearing weather-appropriate footwear and so he helped me to the door of my work and gave me some care instructions for the hand and left. He kindly came back a half hour later and salted the sidewalk in front of my building, but we just waved awkwardly from either sides of the window.\n\nWe never mentioned it again. We remain friends, but it was pretty awkward for a while after. It’s been a few years and we are still very careful to never cross any boundaries and we definitely, *definitely* avoid physical contact.\n\nIt is the #1 most erotic and non sexual event of my entire life. Never felt anything like it before or since.",
   "created_utc": 1692741091,
   "score": 5,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbxj8b",
   "message": "Gave my coworker a high-five after a big sale. Snagged boob instead of hand. Oops.",
   "created_utc": 1692741155,
   "score": 2,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbxjmz",
   "message": "My late grandmother and I were dancing at a family wedding. She was 5’2 and I’m almost 6 foot. She wasn’t a plump lady, but had the grandma pooch. The whole time we’re dancing small talk was made while we both pretended her belly wasn’t touching my crotch.\n\nYou complete strangers are the only people I’ve told this story too.",
   "created_utc": 1692741159,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbz8xj",
   "message": "In HS I dressed up and a woman for halloween. In every class some girl had to redo my makeup. So I spent a good chunk of the class just staring at them. Watching the minutiae of muscle movement while they were lost in thought and focused. The little plays of emotion across thier face at what they were doing. Then the moment they noticed me noticing, and the immediate blush.",
   "created_utc": 1692741838,
   "score": 8,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxc1gcn",
   "message": "When the hair dresser washes your hair before a cut and gives a bit of a head massage",
   "created_utc": 1692742731,
   "score": 36,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbihh7",
   "message": "Literally just last week my best friend at work (he’s a man and I’m a woman, everyone I work with pretty much is male) he’s not my type physically and I’m happily married as is he, but we were sat in the office and he randomly tucked a piece of my hair behind my ear which was really random and I just about melted. So weird I thought about it for a while 🤣 but as I say I don’t have feelings it just caught be off guard in a surprising way!",
   "created_utc": 1692735495,
   "score": 6,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxam298",
   "message": "Watching movies nude with my fwb.",
   "created_utc": 1692723567,
   "score": 2,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbq1pb",
   "message": "I wanted some ice cream a few weeks ago, and walked in a very, very, busy ice-cream shop. \n\n The guy behind the counter is super hot but very young, and I'm married.\n\n But..Dude!!!! There was chemistry 😈...\n\n Like our eyes locked in the crowd from the moment I stepped in, he gave me the best smile and wouldn't take his eyes off me while he helped everyone in line. When it was my turn we were both blushing. He hands me the cone and his fingers touched mine, I swear I haven't felt like this in years. It's how you instantly know you are compatible with the other person, if you know - you know. \n\nI gave him a good tip. \n\nI know...the pearly gates won't open for my kind.",
   "created_utc": 1692738286,
   "score": 4,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbrm5o",
   "message": "In high school. This chick in my science class had the best pair of tits I’d ever seen at that age. I was stood by the desk with my hands flat on the desk, listening to the teacher. She comes to stand next to me to ask about a science problem we were all working on. She leans over the desk and rests her crossed arms on the desk while she talks to me. One of her boobs is right on top of my left hand. She didn’t even flinch, and I fought with all my might not get a boner right there in class 😂😂",
   "created_utc": 1692738875,
   "score": 3,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbodee",
   "message": "I figured out I was attracted to my coworker when he handed me a roll of garbage bags while staring into my eyes. We're getting married next month",
   "created_utc": 1692737657,
   "score": 3,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbidym",
   "message": "I was at a club meeting with my (at the time) boyfriend, and he was sitting in a swivel chair in the middle of the room watching a big screen like everyone else. I stepped up behind where he was sitting and lovingly put my hand on his head. Now, I'm standing over my boyfriend, he is now facing me, with my hand on his head, and his head at my crotch level. He says \"yknow from this angle it's kinda like....\" and I say \"huh?\" Like an absolute idiot and he blushes and turns back to the screen.",
   "created_utc": 1692735459,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxa0glm",
   "message": "Getting my balls waxed and somehow the tech got talking about her kinks.. \n\nIt's hard to hide excitement that way..",
   "created_utc": 1692715488,
   "score": 2,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbmt8b",
   "message": "Attractive drunk girl on the subway  plopped down beside me, put her head on my shoulder and started nuzzling my neck. I froze, got a boner, then my conscience kicked in and I gently pushed her off. I tried to play it nice, she got mad and started yelling, then went over and did the same thing to this guy with deer in headlight eyes, he got up and moved seats, she started yelling again and making crazy eyes at me. I just got off at the next stop and waited for the next train.",
   "created_utc": 1692737082,
   "score": 2,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbsnjb",
   "message": "When I was 19, I went to a Periodontist who was maybe 40ish?\n\nAs she was examining my gums, she had her hands on my shoulders (I was lying on my back and she was sitting behind me). Something about her hands on my shoulders made me feel cared for and it was unfamiliar at that stage of my life.",
   "created_utc": 1692739266,
   "score": 4,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbt6a6",
   "message": "Browsing /r/askreddit",
   "created_utc": 1692739463,
   "score": 0,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbue9n",
   "message": "The amount of \"I'm married\" in this post is disgusting",
   "created_utc": 1692739928,
   "score": 0,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbwrt0",
   "message": "i was breast fed as a baby",
   "created_utc": 1692740854,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbt39m",
   "message": "What is it with these fucking questions. Most nonsexual sexy thing? Guys what's the most non sexual sex feeling. Name a feeling or a thing that is not sexual but is sexual. What's the sexiest thing you've ever seen but it's not sexual. Name a sex sexy. I feel like I'm going crazy",
   "created_utc": 1692739431,
   "score": 254,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxa9yyh",
   "message": "She and I were both children. I must have been about 6/7 years old and she must have been about a year older than me.\n\n We had both come back after cycling around the block. I was keeping my bike in the garage before we went into the house for snacks. I don't know what got into her or from where she even got the idea but she just crept up on me, embraced me tightly from behind and planted a kiss on my back.  I immediately turned around and slapped her on the back and went into the house. 😂\n\nNeedless to say, our friendship was never the same after that day and it soon ended and turned into bitterness towards each other.",
   "created_utc": 1692719102,
   "score": 250,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbaoou",
   "message": "My brother in law asked me for head once. He was such a hot man.  I almost came. Nothing happened though",
   "created_utc": 1692732640,
   "score": 248,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxa27kf",
   "message": "[removed]",
   "created_utc": 1692716159,
   "score": 250,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbgg4a",
   "message": "A guy was trying to be sexual and like do stuff when I was in his bed but I was tired and I didn’t wanna do anything and I said no and he got mad and so I just let it happen I was looking at the wall",
   "created_utc": 1692734749,
   "score": 249,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxa1bhm",
   "message": "[removed]",
   "created_utc": 1692715821,
   "score": 245,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jx9xxra",
   "message": "Hug",
   "created_utc": 1692714502,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxat4bh",
   "message": "Random Hugging",
   "created_utc": 1692726164,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbyi2c",
   "message": "I was in a bar with a friend and her friend whom I had just met that day, he looked all confident on the outside my friend had to leave I was waiting for a hookup who said he’s coming to the bar, the guy didn’t have to stay to keep me company but he did, we talked and he confessed to me that he never makes eye contact with people, he just looks at their nose or eyebrows so it looks like he is, I asked him if he would make eye contact with me and he did, it was so sweet. we’ve been together for 3 years now but this is just one cute non sexual detail that made me feel sexual tension.",
   "created_utc": 1692741539,
   "score": 3,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbyr6u",
   "message": "I passed another hiker on a bluffside trail and meant to simply greet him with a friendly \"hello!\" but the word accidentally came out all sexy sounding like a bad phone sex operator. Other hiker did a double take and my SO laughed like a braying donkey the whole way back down the bluff. Gives me shit about it to this day.",
   "created_utc": 1692741639,
   "score": 3,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbz8uf",
   "message": "Way back in college this guy in my class, who I liked in a \"this guy is nice to everybody and charismatic like a golden retriever\" kind of way took off his glasses.\n\nIt was like time froze, holy shit. I could feel my face flush red and had to wait for myself to \"calm down\" before I could get out of my seat.\n\nI've never had that reaction before or since.",
   "created_utc": 1692741837,
   "score": 4,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxbzyjd",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxc0wm6",
   "message": "I had an insanely high fever, and the doctor determined that I needed an immediate solution. \n\nThese two female nurses came in and had me take my shirt off and lay down. They proceeded to wash my abdomen with cold cloth, speaking a language I didn’t understand, and occasionally giggling.",
   "created_utc": 1692742507,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxc2eww",
   "message": "I was getting a tattoo on my wrist. The tattoo artist, a beautiful woman with some badass tattoos, was leaning over my arm and did the top part of my wrist no problem.\n\nbut when it got time to do the inside, I had to turn my hand palm up and when she started tattooing the underside I noticed her breast was resting on my palm.\n\nthe pain of the tattoo was nothing compared to the cramping in my hand as I tried to keep my palm open, fingers pushed back as far away from her as possible for 45 minutes.",
   "created_utc": 1692743121,
   "score": 2,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxc313t",
   "message": "I got a handjob from a ghost but im scared of ghosts.",
   "created_utc": 1692743378,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxc39my",
   "message": "Me and my best guy friend were talking for hours and then he jokingly picked me up and literally flipped me over and I’m not the lightest person either. Instantly caught feelings",
   "created_utc": 1692743475,
   "score": 2,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxc3l1x",
   "message": "Went out drinking with a female friend and drove her back to my place where her car was parked. Told her she drank more than me and it wasn't a good idea to drive home. Told her she could crash with me and she climbed into my bed and asked if I was going to sleep? I said sure, got into bed and we just slept together platonically. The whole time I kept wondering what was going on, but I was a gentleman. We woke up the next day, had breakfast and joked we slept together, which we did technically.",
   "created_utc": 1692743608,
   "score": 2,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxcgr5o",
   "message": "When I found out a second plane hit the WTC on 9/11. I was in eighth grade and had an orthodontist appointment that morning. The dental tech that was working on me had huge breasts and idk if she just didn’t know but they’d always rest on my head and I’d have to flex my thighs for the entire half hour she would work on my mouth in order to not get a middle school erection. So now, I hear anything about 9/11 and it makes me think of boobs on my head.",
   "created_utc": 1692749159,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxc4on4",
   "message": "I was wearing the plunging v neck sparkling spaghetti strap top with high waisted black pants and came back from the bathroom at a dance social. I was already shy about that top and figured one guy liked me and I was starting to like him…. And he did this lean thing… to look around the people in front of me, and he looked me down and up and back down again and it also felt like he saw Me 🥺… and he slowly leaned back into position I guess when he figured I caught him. And I blushed so much. It’s the sexiest way a man has and ever will look at me. Appreciated all of me.\n\nI still really like him. Send us some good vibes. I’d marry him. 👀😅",
   "created_utc": 1692744067,
   "score": 3,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxc69y2",
   "message": "I got a full body massage while rolling on MDMA nothing overtly sexual happened.  But it was pure magic.",
   "created_utc": 1692744730,
   "score": 3,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxce6ij",
   "message": "I was at a restaurant eating my food, some girl walked by my table and farted directly at my food and winked at me",
   "created_utc": 1692748058,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxcfh9y",
   "message": "The last time I had an eye exam, the lady doctor made a TON of eye contact with me. It was the most attention I've gotten in a long time",
   "created_utc": 1692748608,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxc9ljw",
   "message": "Went backpacking in Hawaii and found myself grouping up with two girls my age. Both attractive, but one of them was just a bombshell. And she knew it. It was a long trek to the destination we were aiming for and we had to set up camp for a night. We pitched our tents by a river but I wanted to respect their space and found a spot for myself a little down the way. After setting up, I jumped in the river to cool down. About 15 minutes in, the extremely beautiful girl swam my way and she was completely nude. I played it cool, acting as if this was a normal thing for her, so I was not judging but, man, she seemed to have laid it on thick. She stood in front of me, inches away, pressing her chest together, stretching in ways that showed off her body, and touching me here and there, pointing out tattoos that she liked. I honestly felt like she was toying with me because she knew she could. Or she’s apt to do such things. We had a genuine conversation for 20 minutes or so until I called it a night. Again, I’m sure she was just messing with me but i Ike to believe I flexed my strength and will that day.",
   "created_utc": 1692746118,
   "score": 2,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxcebk7",
   "message": "Getting patted down by TSA",
   "created_utc": 1692748118,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxcf052",
   "message": "I gotta say it's kinda interesting how you guys all remember this stuff and I wonder if my memory is fucked because I cannot remember specific interpersonal interactions like this. There's too many people, too many moments man.",
   "created_utc": 1692748407,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxcfi18",
   "message": "Met a girl in a club a few weeks ago. I invited her to a drink, she gladly said yes and told me that she wanted a shot of Tequila. So I park my ass infront of the counter, but since it's quite busy I have to wait for a long time. A few minutes later, she joined me at the counter.  \nI get to order a bit later, her Tequila and a shot of Vodka for me.  \n\n\nAnd this is where the fun begins.  \nI'm not that experienced with Tequila, so I forgot that it's served with salt and a slice of lemon. The second the drinks are served, I suddenly remember how to drinkt Tequila \"properly\". But instead of licking her own hand, she takes mine, licks it, pours some salt over it, licks it again, bites the lemon and takes the shot.  \nNot gonna lie, my spirit left my body for a quick second. Almost forgot to take my shot afterwards.",
   "created_utc": 1692748617,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxchf5w",
   "message": "At the very least there are tens of thousands of those.\n\nOrdinary dialogues. I am 53. So.",
   "created_utc": 1692749449,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxchxh4",
   "message": "I had a brief entanglement with a girl. We were hanging out and by chance had to cross path with a protest that was happening, and she got some ash from a flare in her eye and started panicking, and I rinsed her eye while she put her head on my lap, asking me to get close and look if it’s gone. That was a moment.",
   "created_utc": 1692749669,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxck0r9",
   "message": "Idk if this counts because it involves a kiss but it wasn't sex and I think about it often.\n\nThere was a guy I had been talking to platonically for a few months online after we met through a mutual friend. He seemed like the perfect guy and I enjoyed talking to him. Our mutual friend had a party and he was there. I think I went to get a beer out of the kitchen and he followed me and just kissed me out of the blue, without saying a word. It was exciting and surprising and probably the best kiss of my life because of that. I still melt thinking about it.",
   "created_utc": 1692750560,
   "score": 1,
   "submission_id": "15y7fk6"
  },
  {
   "comment_id": "jxc4u4r",
   "message": "I visited my wifes family (she was just my gf at the time) in Switzerland and as an American I'm not used to the cheek to cheek kissy thing that many people around the world do when they greet each other. \n\nOne of her relatives is a beautiful blonde Swiss girl in her early 20s and was kinda shy. We met up with her and her family at a park and upon our arrival she greets us with the cheek kissy thing and I was still learning that you don't actually kiss the persons cheek but just touch cheek to cheek and make the kissy sound. Maybe I got too comfortable because it was a pretty girl but without thinking my initial instinct was to actually kiss the cheek the way I'd kiss my girlfriends cheek. When I pulled back I saw she was blushing a lot and had a kinda nervous smile on her and I realized that I did the wrong kissy thing. Luckily I dont think anyone else noticed. Not super sexual but there was definitely some tension after that.",
   "created_utc": 1692744130,
   "score": 1,
   "submission_id": "15y7fk6"
  }
 ]
}