{
 "submission_id": "15y9cr9",
 "title": "What are somethings one should definitely know by the age of 26?",
 "selftext": "",
 "created_utc": 1692718577,
 "permalink": "/r/AskReddit/comments/15y9cr9/what_are_somethings_one_should_definitely_know_by/",
 "score": 79,
 "url": "https://www.reddit.com/r/AskReddit/comments/15y9cr9/what_are_somethings_one_should_definitely_know_by/",
 "comments": [
  {
   "comment_id": "jxakzek",
   "message": "How and where to ask for help.",
   "created_utc": 1692723173,
   "score": 115,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxa9ydv",
   "message": "How to cook",
   "created_utc": 1692719096,
   "score": 65,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxah3ub",
   "message": "That nobody has life figured out. Everyone is just trying their best. Try not to worry about things that are out of your control. Worry about what you can control and do your best. The biggest one is do not compare yourself to others. We are all on our own path at our own pace. Comparison destroys happiness.",
   "created_utc": 1692721747,
   "score": 117,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxa8smm",
   "message": "How to save money/budget",
   "created_utc": 1692718666,
   "score": 107,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxaoudm",
   "message": "That women don't pee out of their vaginas.\n\nEdit: or butts.",
   "created_utc": 1692724597,
   "score": 62,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxaqbha",
   "message": "How things like health insurance, credit cards, and mortgages work. You don’t have to have them but if you do, please learn them.\n\nHow to maturely and politely respond to a decline of your advances.\n\nHow a round about/traffic circle works\n\nBasic car maintenance. How to change a tire or at least how or who to contact if you’re stranded with a flat. Knowing your tires need rotating, oil changes, etc.\n\nHow to do your own grocery shopping and make your own doctors appointments.",
   "created_utc": 1692725136,
   "score": 29,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxas6vi",
   "message": "There, their, they're\nYour, you're\nDesert,  dessert\nIts, it's\nLose, loose",
   "created_utc": 1692725824,
   "score": 28,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxaom9o",
   "message": "How compounding interest works, and to start investing now.",
   "created_utc": 1692724514,
   "score": 32,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxa9pn6",
   "message": "How to wipe your own ass.",
   "created_utc": 1692719007,
   "score": 37,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxa8prg",
   "message": "You should know how to vote and how to determine if a candidate is worth voting for.",
   "created_utc": 1692718637,
   "score": 52,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxald69",
   "message": "How a woman's reproductive organs work.",
   "created_utc": 1692723313,
   "score": 19,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxaro09",
   "message": "The muffin man, the muffin man",
   "created_utc": 1692725631,
   "score": 9,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxahjz3",
   "message": "That you aren't alone in your struggle, whatever it is.  There are hundreds, thousands, millions of other people who are going through what you're going through, or have been there, and they won't judge you for talking about it.  They will listen and understand, and they will all tell you that it gets better.",
   "created_utc": 1692721916,
   "score": 9,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxal15k",
   "message": "How to be honest with yourself about what you want out of the people you date.\n\nIf you want to fall in love, don't stay with people who clearly aren't going that way. Move on, even if they are super fun, even if they are better looking than you thought you could even land, even if it just seems like the timing is off, even if it's the best sex you ever had.\n\nSimilarly, if you're the person who doesn't want something serious and you get the feeling the person you're with does, move on. People will often tell you they also want something non-serious, or are willing to wait seemingly endlessly for you to make up your mind. But don't take advantage of people when your gut is telling you they don't want the same thing you do.\n\nHonestly, it really doesn't take that much time to know you are in a situation where you don't need play games with each other and there is potential for something serious. Don't waste each other's time saying you need to figure things out or waiting for the other person to come to a decision.\n\nToo many people waste their late 20s in these relationship deadends.",
   "created_utc": 1692723190,
   "score": 9,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxaeaxf",
   "message": "How to cook a nice fried or scrambled egg",
   "created_utc": 1692720712,
   "score": 6,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxaiwrq",
   "message": "how to do laundry, how to iron your clothes, how to cook a good meal, personal finance, the difference between parsley and coriander, how to deal with with loss and grieving, how to deal with rejection.  how to use a credit card.  I think those skills will get you trought life.",
   "created_utc": 1692722415,
   "score": 7,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxatsbb",
   "message": "How to cook for yourself, at least.",
   "created_utc": 1692726411,
   "score": 7,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxa9mst",
   "message": "How to balance a checking account. Or at least keep track of it.",
   "created_utc": 1692718978,
   "score": 4,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxa9mvo",
   "message": "Basic math",
   "created_utc": 1692718979,
   "score": 4,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxalysd",
   "message": "That its okay to not know things and start from now on",
   "created_utc": 1692723532,
   "score": 3,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxasov0",
   "message": "Righty tighty, lefty loosy. It applies to almost any kind of screwy stuff including piercings.",
   "created_utc": 1692726007,
   "score": 4,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxaw33s",
   "message": "Buckle down a bit for a few years to make the next 30 easier.. but no so much you regret not having fun while you can",
   "created_utc": 1692727256,
   "score": 3,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxayewn",
   "message": "How to do their fucking job, I know a guy at work that's been working for longer than me and he actually finished university",
   "created_utc": 1692728123,
   "score": 4,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb6mim",
   "message": "That the opinions of others do not matter.",
   "created_utc": 1692731137,
   "score": 3,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb9bhi",
   "message": "Compounding interest, Roth IRA and Index Funds. 5 extra years of snowball effect can massively change your life when you are 56 plus.",
   "created_utc": 1692732131,
   "score": 4,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxabo7m",
   "message": "All I can say is that it should be a hell of a lot more than I know now at the age of 24.",
   "created_utc": 1692719728,
   "score": 7,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxar7te",
   "message": "You now need to have your own health insurance.  Don't go without it, cause these hospitals, ambulances, doctors can ruin your life with medical bills.",
   "created_utc": 1692725463,
   "score": 3,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxars3j",
   "message": "Financial Grammar. Of course you would be broke if you don‘t know how to use money and credits.",
   "created_utc": 1692725674,
   "score": 3,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxasuv1",
   "message": "* Have some base-level discipline, because filth accrues interest.  You don't need to live like Gunny's about to come crashing through your door and tearing your rack apart for the slightest infraction, but definitely make sure you keep up with cleanliness and maintenance.  Dishes, laundry, pet care, etc.; don't let what could be a five minute chore now become a five hour ordeal later.\n* Have a few staple recipes memorized, and the means to make them on hand if possible.  Knowing the recipe forwards and backwards means you're that much more able to experiment with them (and folks love a potential partner that can cook).\n* Know that sometimes shit just plain isn't going to go your way despite your every plan and precaution.  Such is life.  You don't need to be on Batman's level when it comes to plans and contingencies all the way to Z, but when something inevitably goes sideways, knowing when to pivot and how to do so will save you a ton of stress.\n* If nothing else, remember; **the end goal is what** ***you*** **want it to be, not anybody else**.",
   "created_utc": 1692726067,
   "score": 3,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxat4zy",
   "message": "Their sleep patterns and how to adjust them for things. I can now work days and nights if needed. It's not truly that you have trouble sleeping. Most of the time you have trouble waking up.",
   "created_utc": 1692726171,
   "score": 3,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxawcrd",
   "message": "How to iron a shirt correctly",
   "created_utc": 1692727355,
   "score": 3,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb6cud",
   "message": "How to clean",
   "created_utc": 1692731037,
   "score": 3,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxabii9",
   "message": "Basic adult functioning: Having a current job, a career worth pursuing, meaningful savings, an actionable plan for your future/finances, a back up plan, and the ability to self reflect.",
   "created_utc": 1692719669,
   "score": 5,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxafcou",
   "message": "The location of the clitoris",
   "created_utc": 1692721103,
   "score": 9,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxals1j",
   "message": "How to drop toxic people from your life and cultivate good, meaningful friendships with quality people.\n\nUp to about your mid-20s, I think there is a lot to be said about quantity over quality for friends, especially when you're in school.\n\nBut my 26, you should get a good idea of what you really want in a friend and how to be that kind of friend as well. Don't waste time flakes, users, insecure people who want to bring you down, those who are always too busy for you, or people with mental health problems who use you as a substitute for a healthcare professional.",
   "created_utc": 1692723464,
   "score": 2,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb089v",
   "message": "if you drive or even ride in a car,\n\n\nhow to change a flat tire.",
   "created_utc": 1692728789,
   "score": 2,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb6b4w",
   "message": "How to look at things through someone else’s eyes. Hell, self reflection in general. \n\nIf someone snaps or gets angry at you, it’s not up to you to be bitter about their outburst. No, take a step back and think about what you did to work them up. People appreciate growth and accountability, and being stubborn and deflecting blame doesn’t get you anywhere in life.",
   "created_utc": 1692731020,
   "score": 2,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbbjpk",
   "message": "How to get up with an alarm clock. \n\nIdeally this should be learned before 18, but I have worked with a surprising number of 20-somethings who were regularly late because they hadn't mastered it yet.",
   "created_utc": 1692732962,
   "score": 2,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbn5pf",
   "message": "Pee is not stored in the balls",
   "created_utc": 1692737210,
   "score": 2,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbsg1y",
   "message": "1.Be accountable for your action\n2.Be a decent human",
   "created_utc": 1692739190,
   "score": 2,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbsznt",
   "message": "How reproduction truly works.  How to properly use birth control and condoms.",
   "created_utc": 1692739393,
   "score": 2,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbzaj9",
   "message": "This is kind of a silly answer but I had someone in their 20s get extremely offended that I implied they should have already known that there’s 365 days in a year by that age. They insisted that knowing how many days are in a year is not basic information everybody knows.",
   "created_utc": 1692741856,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxaib0m",
   "message": "How to tie your shoes and be thankful you lived 26 years without getting coodies",
   "created_utc": 1692722193,
   "score": 2,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxa8rbe",
   "message": "Complete a day full of Random Acts of Kindness.",
   "created_utc": 1692718652,
   "score": 0,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxa8rzs",
   "message": "How to cook, how to do your taxes, how to seduce a lover.",
   "created_utc": 1692718659,
   "score": 0,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxau4fj",
   "message": "You should know to opt out of overdraft protection from any bank. \n\nYou should know how to drive safely without any speeding tickets or accidents. \n\nYou should know how to budget money properly",
   "created_utc": 1692726535,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb05y3",
   "message": "Basic logic, like how to look at a simple logical syllogism and be able to tell if it’s valid or not. This one skill is arguably the most important skill all humans should know because that skill is the basis of critical thinking. I don’t really blame people because we simply don’t make this a required skill, and I have no idea why. We should be teaching basic logic in highschool.",
   "created_utc": 1692728767,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxa98b7",
   "message": "INDEPENDENCE! SELF RELIANCE. if you’re a young healthy person you should rely on no one but YOU.",
   "created_utc": 1692718828,
   "score": 255,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb0b15",
   "message": "That  you should be a swing voter.",
   "created_utc": 1692728817,
   "score": 0,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb36oz",
   "message": "Most likely, the world would be just fine if the company for whom you work just stopped existing (maybe the world would even be better off.)\n\nDon't take it too seriously. Do what you have to do to get by, and try to not let it sap out all of your vitality.\n\nTry to do something interesting/creative in spite of the fact that wage cuckoldry likely takes up most of your life. In this way, we can actually contribute something real to the world. Not just profits for some vapid, materialistic greedy piece of garbage person.",
   "created_utc": 1692729879,
   "score": 0,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbkcjg",
   "message": "Christianity. If you don't believe, that is still your choice, but an educated view of the Bible and why you do or don't accept it is something you owe yourself the chance for a better afterlife. Those who are interested, check out [www.bible.com](https://www.bible.com)",
   "created_utc": 1692736176,
   "score": 0,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxa8u23",
   "message": "Job isn't the only way to earn money",
   "created_utc": 1692718680,
   "score": 249,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxa8xhs",
   "message": "Focus on making money early instead of wasting time on bingewatching and social media...in the end society judges by how you earn",
   "created_utc": 1692718717,
   "score": 251,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxao7ce",
   "message": "Your personality type.",
   "created_utc": 1692724359,
   "score": 255,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxar2to",
   "message": "That a non-processed and varied plant based diet is the best diet for your health. We used to get B12 from dirt residue on vegetables, now you can just take a 50mcg pill everyday.",
   "created_utc": 1692725413,
   "score": 254,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxa9sy3",
   "message": "Where babies come from.",
   "created_utc": 1692719040,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxa9vez",
   "message": "How to read",
   "created_utc": 1692719066,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxacq8t",
   "message": "Nothing lasts forever and life can turn upside or downside anytime.",
   "created_utc": 1692720120,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxaoaca",
   "message": "Tomato does not belong in a fruit salad.",
   "created_utc": 1692724389,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxapoj1",
   "message": "That “somethings” should be two words here.",
   "created_utc": 1692724904,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxaqcrv",
   "message": "How to file taxes.",
   "created_utc": 1692725149,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxaqgm3",
   "message": "How to spell restaurant (Ty autocorrect)",
   "created_utc": 1692725187,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxarsb4",
   "message": "Hardboiled eggs tend to explode if you reheat them in the microwave.",
   "created_utc": 1692725676,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxasl6d",
   "message": "How to change the toilet paper roll.",
   "created_utc": 1692725970,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxat82y",
   "message": "You know what you know\n\nYou know what you don't know\n\nThat you don't know what you don't know and never will",
   "created_utc": 1692726203,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxauq0w",
   "message": "How to cook some meals that aren't processed/frozen.",
   "created_utc": 1692726754,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxavb5b",
   "message": "How to do their own laundry.",
   "created_utc": 1692726969,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxaylb3",
   "message": "How to value other people's time, energy, and efforts. How to recognize entitlement in your own actions. How to combat learned helplessness.",
   "created_utc": 1692728189,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxazveu",
   "message": "How to change a car tire.",
   "created_utc": 1692728657,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb0zvq",
   "message": "Saving money doesn't have to be complicated - just putting a little aside every paycheque, can go a long way down the road. Don't waste money on useless shit that you don't actually need, but reward yourself with a luxury purchase every now and again so you don't feel like you're depriving yourself.",
   "created_utc": 1692729072,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb29pq",
   "message": "How to dance.  Literally any type, just take some lessons in a beginner class and call it a day if you don't like it.  You should at least know some basic steps.",
   "created_utc": 1692729543,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb451l",
   "message": "The Liberal Arts:\nhttps://en.m.wikipedia.org/wiki/Liberal_arts_education\n\nAnd that even if all your friends hold some ideology, you'd better seriously consider that they're all wrong and go think for yourself.\n\nIf you think you're already an independent thinker, you have a LONG way to go.",
   "created_utc": 1692730230,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb5xfw",
   "message": "How to look ahead, and to cope with change/loss.",
   "created_utc": 1692730878,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb7xc8",
   "message": "How to say... no",
   "created_utc": 1692731614,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb8v7m",
   "message": "How to use the potty.",
   "created_utc": 1692731966,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb9nfm",
   "message": "Not to tolerate shitty behavior for the sake of having friends",
   "created_utc": 1692732253,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxb9xvk",
   "message": "How to stop worrying and love the bomb. I mean.. how to change a tire.",
   "created_utc": 1692732361,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbagcu",
   "message": "That you ain’t shit",
   "created_utc": 1692732554,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbbcnl",
   "message": "That being in love and being in a relationship are 2 very different things.",
   "created_utc": 1692732889,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbbeag",
   "message": "26 is not too old to start something new like a career change",
   "created_utc": 1692732906,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbbzw1",
   "message": "oof, this is a long list. i'll hit the high points:\n\n1. basic car maintenance / change a tire\n2. file taxes \u0026amp; manage credit\n3. grill a steak CORRECTLY\n4. diffuse a combative situation\n5. negotiating",
   "created_utc": 1692733128,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbc0de",
   "message": "Make sure you are planning for retirement!!",
   "created_utc": 1692733133,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbc8ok",
   "message": "1) How to save money. \n2) How to do household chores on a regular basis. Depression aside, there’s no reason for your living space to be regularly filthy. \n3) How to cook your own meals.",
   "created_utc": 1692733218,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbcagw",
   "message": "1) How to save money. \n2) How to do household chores on a regular basis. Depression aside, there’s no reason for your living space to be regularly filthy. \n3) How to cook your own meals.",
   "created_utc": 1692733236,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbcikk",
   "message": "How to clap the cheeks properly.",
   "created_utc": 1692733318,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbcthu",
   "message": "business",
   "created_utc": 1692733430,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbddui",
   "message": "That things are not always as they seem to be or not what people have told you they are",
   "created_utc": 1692733637,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbe1i0",
   "message": "How to file your taxes",
   "created_utc": 1692733879,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbe4m3",
   "message": "How to properly wipe your butt",
   "created_utc": 1692733910,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbf7c4",
   "message": "How to wipe butt",
   "created_utc": 1692734299,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbgnfl",
   "message": "1. \"somethings\" need a little space. \n2. If you're still on your parents' health insurance(US), you'll be dropped from coverage at the end of the month following your 26th birthday. Unless you're disabled.",
   "created_utc": 1692734824,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbgrdo",
   "message": "If they take more than a day to text you back, they aren’t interested",
   "created_utc": 1692734864,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbhldp",
   "message": "How to get your partner off and manage your finances entirely",
   "created_utc": 1692735168,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbhspi",
   "message": "Drive, oddly enough I've had a lot of friends I've had to carpool around because of their inability to drive in their age.",
   "created_utc": 1692735242,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbhtin",
   "message": "How to tie my shoes",
   "created_utc": 1692735250,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbi37z",
   "message": "Who won the civil war",
   "created_utc": 1692735350,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbiy8z",
   "message": "How to clean your home",
   "created_utc": 1692735663,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbjk4h",
   "message": "Climbing the corporate ladder is 15% skill and 85% ass kissing / talking about sports.",
   "created_utc": 1692735886,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbl2vr",
   "message": "How important your credit score is.",
   "created_utc": 1692736444,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxblxt2",
   "message": "That life is messed up. Very messed up. \n\nTo know that before hand of getting a job is really useful for your mental health, or atleast for me it is.",
   "created_utc": 1692736759,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbm2oi",
   "message": "Compound interest on a 401k.",
   "created_utc": 1692736809,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbmb79",
   "message": "How to change a tire, spark plugs, oil, radiator, doing laundry.",
   "created_utc": 1692736896,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbn66u",
   "message": "How to balance, the budget, understanding, taxes, and basic financial literacy",
   "created_utc": 1692737215,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbnvfz",
   "message": "How to handle your money in a better way and avoid credit cards.",
   "created_utc": 1692737473,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbo0l8",
   "message": "The things your parents did right and wrong when they raised you.",
   "created_utc": 1692737525,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbp295",
   "message": "How to cook for yourself.",
   "created_utc": 1692737914,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbrkqz",
   "message": "Use your turn signals! For fucks sake!",
   "created_utc": 1692738860,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbs4ow",
   "message": "How to drive a car.",
   "created_utc": 1692739069,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbsfev",
   "message": "How to be comfortable saying you don’t know something.",
   "created_utc": 1692739183,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbtg7t",
   "message": "Where the clitoris is",
   "created_utc": 1692739567,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbtl5s",
   "message": "How to take care of themselves, cooking, cleaning, basic home/apartment maintenance, and any other small things needed to sustain oneself.",
   "created_utc": 1692739619,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbto3j",
   "message": "Never alone, it's all in the family.\n\n\nIt's a sect...",
   "created_utc": 1692739650,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbtyhc",
   "message": "Use condoms.",
   "created_utc": 1692739760,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbwgkv",
   "message": "The importance of a Good Nights sleep and how to get it consistently",
   "created_utc": 1692740732,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbx461",
   "message": "How to safely change a tire on a car. Practice at home if you have to.",
   "created_utc": 1692740990,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbyr8r",
   "message": "their abc’s (if in an english speaking country)",
   "created_utc": 1692741639,
   "score": 1,
   "submission_id": "15y9cr9"
  },
  {
   "comment_id": "jxbyrul",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15y9cr9"
  }
 ]
}