{
 "submission_id": "15yab0r",
 "title": "What’s a secret of your trade that nobody knows?",
 "selftext": "",
 "created_utc": 1692720570,
 "permalink": "/r/AskReddit/comments/15yab0r/whats_a_secret_of_your_trade_that_nobody_knows/",
 "score": 68,
 "url": "https://www.reddit.com/r/AskReddit/comments/15yab0r/whats_a_secret_of_your_trade_that_nobody_knows/",
 "comments": [
  {
   "comment_id": "jxafv7h",
   "message": "Most bottled water is just tap water",
   "created_utc": 1692721292,
   "score": 97,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxal062",
   "message": "If you call a call center of any kind, and the person you're talking to puts you on hold with no hold music, they can hear everything you're saying.\r  \n\r  \nI worked in an insurance call center when I was really young. I had so many people accidentally confess to insurance fraud that way.",
   "created_utc": 1692723180,
   "score": 129,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxaenrd",
   "message": "If you are in a therapy session and feel like your therapist isn't listening, ask them to repeat back what you just said. Half the time, therapists don't even listen and it's fucked up.",
   "created_utc": 1692720847,
   "score": 54,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxawcoe",
   "message": "When you shop at Walmart, do you sometimes hear the announcement saying security cameras to zone six, or another number? They play them randomly in the hopes that someone who might be stealing will get paranoid thinking they’re being watched, and will decide not to shoplift.",
   "created_utc": 1692727355,
   "score": 84,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxawfow",
   "message": "A certain 48” Interstate Natural Gas pipeline valve is being kept open by a strategically placed piece of 2x4 lumber. If the valve was closed, millions of people would be without Nat Gas fairly quickly.",
   "created_utc": 1692727386,
   "score": 78,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxat6sq",
   "message": "Itemized bill,\n\nturn screw to stop toilet from running all the time...$1.00\n\nknowing which screw to turn...............................$99.00",
   "created_utc": 1692726190,
   "score": 63,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxagw5v",
   "message": "ESL teacher. While we do have a methodology, sometimes we just wing the class entirely and basic students don't even notice.\n\nAlso, for teaching in general: students care more about your confidence and how cool you are with them than if you're actually deep into the knowledge. If you teach them things they themselves would find with a simple Google but are cool and confident whilst doing it, they will worship you.\n\nAnd a tip: don't be afraid of looking silly or answering stupid questions. No teacher should take themselves too seriously, else the students would think you're an ass; and there is absolutely no stupid questions in a classroom.",
   "created_utc": 1692721670,
   "score": 39,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxak63f",
   "message": "The best scientists were rarely the best science students.",
   "created_utc": 1692722878,
   "score": 42,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxamaad",
   "message": "There is a special piece of paperwork that is required before a can be cremated after they have died, as it is important to confirm the person doesn't have any metalwork or a pacemaker that could explode during the cremation, and that a further examimation of the body isn't needed. Doctors get paid extra to complete it by funeral directors because it isn't part of their contracted work (in the UK at least). The money they get paid for this is colloquially known as 'ash cash'",
   "created_utc": 1692723648,
   "score": 37,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxazje7",
   "message": "I used to have my own little balloon shop, so I learned more than a few tricks by working there. \n\nMy favorite one was when people started to notice that my helium inflated latex balloons lasted longer than the other balloon shops around me, the secret was that I used hi-float (a gel that sticks on the inside of balloon and avoids leaking the helium through the pores on the balloon). \n\nMost of our competition don't use it as it expensive, but I always aimed at the people who could afford expensive and I took a hold of the market.",
   "created_utc": 1692728536,
   "score": 42,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxawee5",
   "message": "Arcade crane games have knobs inside that let you control how strong the claw grabs. So you basically make the claw really weak strength and then there’s a setting in the motherboard to make the claw go full power after a certain amount of plays. Whatever the arcade or owner decides how often they want people to actually win.",
   "created_utc": 1692727372,
   "score": 34,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxaefkk",
   "message": "If you live in an apartment building, and you’re higher than the 3rd floor; you most likely have water bottles filled with pee in your walls",
   "created_utc": 1692720762,
   "score": 55,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxakv0m",
   "message": "Deep down few of us know what the hell we're doing but the answer is almost always a Google search away.",
   "created_utc": 1692723129,
   "score": 39,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxaroml",
   "message": "My main skill is googling the fastest in the office.\n\nTen times a week, I get some request and just say \"sure, one sec I can look up the exact way so we don't need to click around the menus\" then I look up how to invert a spreadsheet or whatever",
   "created_utc": 1692725638,
   "score": 20,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxb7ivm",
   "message": "Whenever you see professional photos of luxury five star super high class hotel rooms (or really any hotel room), very rarely do they actually look like that. Things you won’t see in beautiful photos of hotel rooms:\n\n- Wires and cables\n- Tv remotes\n- Bins\n- The menus/do not disturb sign/handbook/magazines/advertising\n- Toilets (most of the time)\n- Poorly finished walls and floors\n- Air vents\n- how small a lot of the rooms actually are\n- the creased lumpy bedsheets\n- bird shit on windows\n- The real view\n\nI am sure there is more, but that’s a very standard list of things I frequently retouch out of hotel rooms.",
   "created_utc": 1692731465,
   "score": 24,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxaws02",
   "message": "I work with young children. Sometimes I use the problem solving techniques I learned from working with children on adults. (Ex: giving 2 choices that I'm okay with either option, making them think something is their idea, asking a lot of questions, praising the positive things I see vs commenting on the negatives, etc.)\n\nI only recently admitted to my fiance of 7 years that I do this, sometimes on him too. We're both grown adults in our early/late 30's.",
   "created_utc": 1692727515,
   "score": 46,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxakb1e",
   "message": "We order plants 8 months ahead of time. So that new flower you saw in Southern Living? Wait for it next year because we aren’t getting it this year.",
   "created_utc": 1692722928,
   "score": 15,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxast0g",
   "message": "Most Extra Virgin Olive Oil isn’t extra virgin or first cold pressed.",
   "created_utc": 1692726049,
   "score": 18,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxaepx7",
   "message": "We are getting it at a deep discount, and marking it up, sometimes over 10,000 percent.",
   "created_utc": 1692720869,
   "score": 18,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxavxje",
   "message": "A lot of the packaged foods you buy may be slightly under the declared weight. As long as the manufacturer averaged the declared weight or above throughout the production run without any individual untit being too low, it is perfectly in compliance with regulations.\n\nAlso, an individual unit may not strictly be in compliance with the order of ingredients listed.  Again, as long as the average product  adheres to the order of predominance throughout the run, it is in compliance.",
   "created_utc": 1692727198,
   "score": 5,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxb1yyi",
   "message": "We do annual price increases. Back of the contract says you can call in and refuse it within 30 days. \n\nIn 10 years, thousands and thousands of customer increases, only one has called in to refuse. And I'm 90% sure that was because we fired a sales rep the week before and he had a relationship with them.",
   "created_utc": 1692729435,
   "score": 12,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxb7wi5",
   "message": "The premium navigation option in your car is a scam.  It is at least two years behind, compared to the software in free apps, and the digital maps are newer too. Just use your app of choice with Android Auto or Apple Carplay. Do not buy a vehicle without that option, and never, ever pay for a software and/or map update.",
   "created_utc": 1692731606,
   "score": 11,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxavl2t",
   "message": "Devs will purposely mixup the established meta by making something underpowered become brokenly overpowered. This is done purposely even though they understand it's actually too strong.",
   "created_utc": 1692727070,
   "score": 9,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxahjex",
   "message": "All early artificial intelligence was explicitly programmed. Ever heard of Deep Blue, the chess bot that beat a grand master? It was a series of if/else statements that programmers wrote after interviewing other grand masters on how to win at chess. It only won because it came to a decision that wasn't programmed in and defaulted to a random move, which confused the chess master it was playing against. Modern AI is a little more complicated, but not very.",
   "created_utc": 1692721910,
   "score": 18,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxarh10",
   "message": "I can make your clasic car's brakes stop working properly by adjusting your ignition timing",
   "created_utc": 1692725559,
   "score": 7,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxatrh6",
   "message": "That we are surrounded by free food. \n\nIt’s just laying around on the ground or on logs and you can pick it up and eat it. \n\nIt’s non-GMO, free of pesticides and chemicals, just normal nutritious delicious food, and again 100% free and everywhere around us. \n\nThe only cost is some research into where you can get the free food in your area and how to identify it when you find it.\n\n(I am a forager. My fridge is currently too full of wild mushrooms and greens to collect any more.)",
   "created_utc": 1692726403,
   "score": 12,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxahm27",
   "message": "Bigger buildings catch and shape more wind, often down towards the ground, leading to more awkward aerodynamics in built-up areas and cities. Often the solutions to this are to add mesh screens, trees and plants to break up the flow to make it comfortable or safe, or sometimes you need to redesign your building altogether.",
   "created_utc": 1692721938,
   "score": 4,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxb63ls",
   "message": "Half the time we have to research the issue too and hope someone else has solved the problem and then we just tell you the solution. We dont' know it all...I work as tech support for an online database.",
   "created_utc": 1692730941,
   "score": 8,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbbgea",
   "message": "Rebooting actually does fix most problems.",
   "created_utc": 1692732928,
   "score": 9,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxai0cu",
   "message": "That you are throwing your money away if you go to college to get into my line of work.",
   "created_utc": 1692722085,
   "score": 5,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxb4x40",
   "message": "Nobody, ever in the history of buying or selling houses, has ever needed an estate agent, ever!\nThey do nothing for their commission.",
   "created_utc": 1692730510,
   "score": 253,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxb7omh",
   "message": "upvote please\n\nAs of my last update in September 2021, I don't have access to personal experiences or subjective emotions, so I don't possess personal trade secrets or private information. However, I can share a general tidbit about language models like me:\r  \n\r  \nOne aspect that might not be widely known is that while I can generate human-like text, I don't truly understand the content in the way humans do. I don't possess consciousness, emotions, or true comprehension. My responses are based on patterns in the data I've been trained on, and I generate text that is statistically likely to follow the input I receive. This means that although I can provide helpful and coherent answers, I lack genuine understanding.",
   "created_utc": 1692731525,
   "score": 244,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxawb8d",
   "message": "If you call a call center of any kind, and the person you're talking to puts you on hold with no hold music, they can hear everything you're saying.\n\nI worked in an insurance call center when I was really young. I had so many people accidentally confess to insurance fraud that way.",
   "created_utc": 1692727340,
   "score": 240,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxaezuu",
   "message": "Living water",
   "created_utc": 1692720970,
   "score": 247,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxb2mqy",
   "message": "If at that red retailer with a dot logo you whine enough about a price adjustment to a team lead enough where the lead empathizes with you and you don’t piss them off, you can probably get that price adjustment even if you really shouldn’t get that price adjustment.",
   "created_utc": 1692729678,
   "score": 3,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxb7tlv",
   "message": "A lot of pricey issues arise in your home HVAC begin by not doing simple maintenance. I.e. changing out the air filter ~6 months.",
   "created_utc": 1692731576,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxb9mp7",
   "message": "A lot of our upsells don't cost more than the base option. We just charge more for them.",
   "created_utc": 1692732246,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbhqcz",
   "message": "The small bottles of ketchup at your restaurant table may have the Heinz logo on them, but they get refilled from a huge tub of cheap ass \"ketchup\" with little ketchup pumps. Usually by overworked busboys or dishwashers.",
   "created_utc": 1692735218,
   "score": 3,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbhw3n",
   "message": "People in pharma will definitely manipulate or  just straight misreport data so they don't have to redo an experiment",
   "created_utc": 1692735277,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbi8f7",
   "message": "I bend light!",
   "created_utc": 1692735404,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbkivr",
   "message": "I worked for a very large brewery. Several of their beer brands were the exact same beer, just with different labels.",
   "created_utc": 1692736240,
   "score": 2,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbog8f",
   "message": "Most if not all Amazon packages get delivered next or 2 day regardless if your Prime status.",
   "created_utc": 1692737686,
   "score": 4,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbo5rh",
   "message": "Manufacturing(previous trade).\n\nWe tend to give a price to anyone who asks but that doesn't mean you're all getting the same price. Resellers get a lower price and direct sales get marked up by what the resellers would mark up(often plus a bit more for good measure), we don't like stepping on toes by competing with our resellers that we have relations with and generally have less issues getting payed by.\n\nOn another note since we price pretty much anything that comes across our desk it's possible we don't *want* the work or to do business with you and you will get a price that reflects that, sorry. But that generally only happens when you've done something to mess up a relationship in the past like excessively late payments or were rather difficult to work with.\n\nOh, and we really do have a buffer/schedule we have to stick to, we can't just \"squeeze you in\", we don't actually just make that up so *please* plan according to the timeline we give you. It's possible other places do add some wiggle room to look better, but there would be a balance there since any extra time you add would make people look at the competition who might have less(oh, and I know some just lie so watch out for *that* too).\n\nAnd speaking of time, if your manufacture has a slow season there is a very real chance you can get a discount, possibly below cost even, if you order then. We did that during winter since it was better to get work that paid the people half their wage than none of it.",
   "created_utc": 1692737578,
   "score": 2,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbnk03",
   "message": "You choose to sell through an agent, you never said you need one.",
   "created_utc": 1692737355,
   "score": 255,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbmdac",
   "message": "Not a big deal but at some fast food, when it comes to any expensive drinks like a frappe or whatever \n\nThey either put extra ice or extra whip cream on the larger cups when u order a large size",
   "created_utc": 1692736917,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbmupd",
   "message": "Although it's written on most packages of filters and all techs that do installs and service techs will tell homeowners. Most of them still don't know that if you change your air filter in your air conditioning, you would have a lot fewer problems out of it.",
   "created_utc": 1692737097,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbn75h",
   "message": "As a retired educator, I have so many trade secrets. But here is one that might surprise many. After 2 years of teaching under a full time contract, and no bad reviews, the teacher has tenure, and can't be fired. It would take an act of God or a crime to get rid of a poor teacher. That being said, there are usually one a few bad apples in every school. But the few that are there, well, they do what they want, when they want. Nothing happens to them. I knew a Sp Ed teacher with five students, could not stay in her room and talked to office staff all day, dreamed up projects for other teachers to do so she could take credit, and made her aide (who was NOT a certified teacher at the time) teach. And they did not question or fire her. Oh, and she dumped one of her five students on me, made up an outrageous excuse. I had 17 boys that year, and I was expecting. But there will be justice in the afterlife, so I am OK with knowing that all will be corrected. OH, and the biggest kicker was that most teachers did not respect her, and we had to vote for a Teacher of the Year. Guess who miraculously won? YEP, SHE did!  Crooked, crooked, crooked. The really good teachers are rarely recognized.",
   "created_utc": 1692737225,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbojhu",
   "message": "a butterfly needle isn’t any smaller than a “regular” needle used for blood work.",
   "created_utc": 1692737720,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbokby",
   "message": "a butterfly needle isn’t any smaller than a “regular” needle used for blood work.",
   "created_utc": 1692737728,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbpzym",
   "message": "Phone companies often lie to” sell”more stuff",
   "created_utc": 1692738268,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbr3la",
   "message": "Everyone knows but no one ever believes it. \n\n*Ahem*\n\nHave you tried turning it off and on again - fixes 90% of all problems.",
   "created_utc": 1692738684,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbtbbz",
   "message": "It’s all bullshit",
   "created_utc": 1692739516,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbu5rl",
   "message": "If you’re going to be an ass to the customer service agents at the airport they have the right to kick you off the flight. Seen it happen many times.",
   "created_utc": 1692739838,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbwy5b",
   "message": "This happened with my doctor.",
   "created_utc": 1692740924,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbxywn",
   "message": "I’m a mechanic. We use Google and YouTube…A LOT. The main difference between us and the average non mechanic, is it all makes sense and we have the tools and space to implement what we watch and read immediately.",
   "created_utc": 1692741327,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbxzqa",
   "message": "most food places use more ice to keep the super large size cost down...\n\n\u0026amp;#x200B;\n\neveryone does it",
   "created_utc": 1692741336,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxbzdrp",
   "message": "The insides of your old sofas and upholstered items are totally disgusting. Especially if they are old enough to have horse hair. That shit is nasty and it’s in your house lol whew. Get new foam inserts every once and a while y’all.",
   "created_utc": 1692741892,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxc0970",
   "message": "Steel factory worker.\n\nMost of us have reall chill jobs. Almost all of the real man job is done by robots. The only parts that include actual physical work is for the welders and repair crews.",
   "created_utc": 1692742244,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxc1c5n",
   "message": "It's okay if you don't read what I write, no one does.\n\n(Technical writer, I write software manuals.)",
   "created_utc": 1692742683,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxc2mvc",
   "message": "Slot machines are just counting machines. They count up and once $1000 has been entered, they dispense $10. When they reach $10000 they dispense $100, and so on. Sometimes the counts align for a \"jackpot\" but there is no chance involved. You're paying for the opportunity to be the $100000th dollar so you can have your fraction",
   "created_utc": 1692743212,
   "score": 1,
   "submission_id": "15yab0r"
  },
  {
   "comment_id": "jxc3cx7",
   "message": "SEO is 25% knowledge and 75% common sense. People still refuse to learn it.",
   "created_utc": 1692743513,
   "score": 1,
   "submission_id": "15yab0r"
  }
 ]
}