{
 "submission_id": "15ydt2e",
 "title": "What’s the most out of touch thing a rich person has said to you?",
 "selftext": "",
 "created_utc": 1692728077,
 "permalink": "/r/AskReddit/comments/15ydt2e/whats_the_most_out_of_touch_thing_a_rich_person/",
 "score": 171,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ydt2e/whats_the_most_out_of_touch_thing_a_rich_person/",
 "comments": [
  {
   "comment_id": "jxb7xmb",
   "message": "Me: Yeah I love flying. I have a nice flightsim setup at home. Wish I could do it for real.  \n\n\nOwner of the company: Yeah the real thing is so much better. You should buy a plane. I love taking mine out for trips.  \n\n\nMe: You sign my checks.",
   "created_utc": 1692731617,
   "score": 221,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxblith",
   "message": "One of my former coworkers grew up in a wealthy family and married into more wealth, but they decided she should work anyways. She was outside her car crying one day, waiting for her husband to pick her up, saying she couldn’t drive her car because a light was on. My buddy looked, it was a low tire pressure light. He asked if she wanted help filling up the tire. \n\nHer sobbing response “This is a Mercedes! You can’t just put air in the tire!!”",
   "created_utc": 1692736607,
   "score": 98,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxb4a3i",
   "message": "\"You've never been to Disney? Did your parents not love you or something\" Bitch my parents were raising three kids working two jobs on poverty wages.",
   "created_utc": 1692730280,
   "score": 187,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbfhqq",
   "message": "Boss:  My wife and I decided that you and your wife should join us in the Caribbean.  I'lll pay for everything. \n\nMe: We appreciate the offer but we won't be able to afford it. \n\nBoss: Why?\n\nMe: I'd have to hire someone to watch the kids.\n\nBoss: What?  Surely your nanny can handle that!",
   "created_utc": 1692734405,
   "score": 175,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbjavm",
   "message": "Built a 3mil+ house for a couple. After the neighbors built their home, we're talking, and the wife says \"that little house is so dinky. We have a joke going that we call it 'the helps house'. \" Now this is still a 750k-1mil home no less. Just struck me as not very grounded 🤣",
   "created_utc": 1692735792,
   "score": 55,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxb6qxc",
   "message": "Our former president suggested we could buy health insurance for $20 a month. A legislator suggested that about $1500 could by a new car and remodel the kitchen. Technically they were speaking to America, but I'm American so that counts.",
   "created_utc": 1692731181,
   "score": 125,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxba6q0",
   "message": "It’s one banana, Michael. What could it cost, ten dollars?",
   "created_utc": 1692732453,
   "score": 164,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbuep8",
   "message": "I was venting to a school mate about not being able to have a car. \nShe said “why don’t you just ask your mom?”\n\nIt literally broke my brain. Like yeah, why didn’t I think of that?",
   "created_utc": 1692739933,
   "score": 37,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxb3tjo",
   "message": "\"It's only $1,000.\"\n\nOk, bitch. Then give it to me!",
   "created_utc": 1692730112,
   "score": 98,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxaywgc",
   "message": "“How often do you go sailing?” \n\nSaid by the guy that knows I was struggling financially.",
   "created_utc": 1692728302,
   "score": 68,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxb32ow",
   "message": "\"Yo they don't pay you enough, you should get another job.\"\n\nI agree, I agree...",
   "created_utc": 1692729839,
   "score": 50,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxaz8zj",
   "message": "\"What's your families private jet policy?  They charge you?!?!?\"\n\nA friend from school had apparently grown up incredible wealthy.  Freshman year we were talking about spring break and I mentioned I was hoping to afford gas money to drive somewhere.  He thought I meant \"jet plane\" gas money and was curious why my parents would charge me to use the family jet.  \n\nWe do not have a family jet....\n\n2nd story: (years after the college one above.  This was a handful of years back)\n\n\"You should join one of our golf club or country clubs this year.  Initiation fees got reduced to only like $40k a person for some so its basically free the first year.\"  \n(Yes, he was members at multiples of each.  I don't remember the exact cost but it was well into the 5 digits each)\n\nI should mention this person and family do not show off the money and are very free with it to friends.  It just comes thru unbeknownst to them a lot of time because they think thats the norm.",
   "created_utc": 1692728431,
   "score": 93,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbplm5",
   "message": "They lived in Boston and we were talking about how small condos are there. They were lamenting that they had no space and, as a result, they had to buy another condo (this was Beacon Hill) because they ran out of space to store their Persian rugs.",
   "created_utc": 1692738115,
   "score": 20,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbqlht",
   "message": "For context, Bellevue is a city in Washington state full of VERY wealthy people.  The town next door is called Newcastle, and is also full of very wealthy people.  At the time of this story, I lived in Newcastle, but on the outskirts of town in an apartment that I could barely afford.\n\nTalking to one of the parents when picking my son up from kindergarten.  She starts talking shit about her ex-husband's house and says \"and worst it's in Bellevue.  Ew!\"",
   "created_utc": 1692738493,
   "score": 17,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxb8hei",
   "message": "I was between jobs and a bunch of my friends told me that I should take the time to go travel the world.  Like a) just because someone doesn't have a job doesn't mean they can just up \u0026amp; travel the world- in fact the opposite is more likely, but also b) you motherfuckers thought the reason I wasn't traveling the world because I *hadn't thought of it*?",
   "created_utc": 1692731822,
   "score": 36,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbmdz8",
   "message": "i live in southern spain and here it’s so hot during summer months that u can’t even get out of ur house  till 9-10 pm. a lot of people (including me) can’t even afford having air conditioners in their houses and they just survive the hot temperatures inside as they can do it, usually spending the days sweaty and tired. A friend of mine lives in a huge house (one of the hugest i’ve ever been) with many rooms and an air conditioner machine in each one of them. A fewer days ago he started complaining about how tired he was for having to take such a long walk at night in order to turn off all the air conditioners in the house. That day i’ve had to take 4 showers to feel just a bit refreshed and i recognise i felt violence taking up control of my body while he was speaking",
   "created_utc": 1692736924,
   "score": 48,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc1gys",
   "message": "“Money has been tight so we have to wait a couple more weeks before we break ground on the new air conditioned stable for the horses”",
   "created_utc": 1692742738,
   "score": 15,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbwz8t",
   "message": "Reading these reminds me of that video on the Ellen show where Bill Gates was guessing how much normal items cost. highly illuminating lol.",
   "created_utc": 1692740936,
   "score": 12,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbcco6",
   "message": "Went to an estate sale near my home. Middle class neighborhood.  Older woman parks near me, gets out of her mercedes, and we walk in within a yard or 2 of each other. She turns and says, \"Who would believe a house this nice would be in a neighborhood like this?\"",
   "created_utc": 1692733258,
   "score": 11,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbrrpp",
   "message": "\"it's not expensive, You just can't afford it\"",
   "created_utc": 1692738932,
   "score": 11,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbv3qh",
   "message": "Met a guy on a backpacking trip that said he couldn't understand why all these backpackers stayed in hostels when there are so many hotels around. I pointed out that most of us have budgets and hostels are cheaper. The thought had just never occurred to him that we can't all afford that. Same thing with restaurants. He just never considered that nicer places aren't in everyone's budget.",
   "created_utc": 1692740203,
   "score": 11,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbr2t0",
   "message": "My boss's wife grew up wealthy and then married an \"heir to the throne\" for a multi-million dollar organization.\n\nShe is meandering around our office bullpen one day and brings me into the conversation, \"How about you, where would you take your lady on a Honeymoon?\"\n\nMe: I dunno, go to the coast for a week and just enjoy the sun.\n\nShe laughed out loud at me and said \"Oh my god, no woman will ever marry you unless you're going to take her on a Hawaiian honeymoon.\"\n\nAt the time I made $10 an hour.",
   "created_utc": 1692738675,
   "score": 34,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbkfcb",
   "message": "Guy makes 250k at least, probably low 300s.\n\nSomething something \"middle class people like us\".\n\nI make 40.",
   "created_utc": 1692736204,
   "score": 40,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbda0c",
   "message": "Advising that I wait to buy a house cash in California (in my 20s)",
   "created_utc": 1692733598,
   "score": 10,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc2peh",
   "message": "\"You don't need to own a house. Just rent for the rest of your life.\" -my aunt and uncle who own two houses",
   "created_utc": 1692743242,
   "score": 10,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxb6hhy",
   "message": "\"Rich people like you and I...\" \n\nDude, I am not rich, you're rich.",
   "created_utc": 1692731085,
   "score": 17,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbfkpq",
   "message": "I worked at a bank for many years, since I needed the money. My co-worker P. did not need the money, and she constantly complained about the job, how little it paid, how stupid the work was, how boring it was, etc. She was also disorganized, sloppy, and incompetent. I usually had to redo all of her work to make it presentable. They finally confronted her, and she quit. It was a great day for the department.",
   "created_utc": 1692734433,
   "score": 9,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbgthg",
   "message": "\"Washing dishes is slavery!\"",
   "created_utc": 1692734885,
   "score": 8,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc0zh9",
   "message": "One thing I’ve learned about very wealthy people if they tend to hang around with other very wealthy people. I mean if I want to take a vacation to Aspen and go skiing I’m going to pay out my asshole for that, between flight, equipment rental, and hotel?A wealthy person will just talk to their friends who will offer up there or multi million dollar chalet that they have just for Funzies. wealthy people will literally have a ski chalet that they rarely go to that house is all of their top of the line ski equipment and just offer it to their friends.",
   "created_utc": 1692742540,
   "score": 8,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbufvq",
   "message": "Years ago I overheard a woman bitching to a 7/11 (convenience store in the midwest) about the color of the Maserati her husband bought her.  I was like, Bitch, the man you're talking to makes min wage.",
   "created_utc": 1692739945,
   "score": 12,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxby7kz",
   "message": "I worked for a very wealthy lady.  Her son graduated college (with some useless degree) and she put him to work answering phones.  \n\nShe also bought him a car.\n\n\"Can you believe it?  I told her I wanted a blue car.\"  She didnt get him a blue car *so he asked her to paint it.*  She refused.\n\nI could see his naivete as he spoke since he truly thought this was something I could relate to. \n\nSorry kiddo, I had to work at Chuck E Cheese as a teenager to be able to afford to buy a piece of crap that overheated if I drove for longer than 20 minutes.",
   "created_utc": 1692741423,
   "score": 7,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxb0ix0",
   "message": "\"The world would be a lot better without The Poors\"",
   "created_utc": 1692728900,
   "score": 18,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc0qgr",
   "message": "My boomer father insists that moms should not work. When someone says that a family needs 2 incomes to survive, he insists that they could manage if they lived within their means. He always cites these examples as \"extravagant choices\" - cell phones, disposable diapers, and paper towels. I cringe every time I hear this.",
   "created_utc": 1692742438,
   "score": 10,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbhfqz",
   "message": "Ive seen a horse for you. Its on offer at 100.000 ppunds. All the while driving around in a peaugot 106",
   "created_utc": 1692735112,
   "score": 6,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbkqor",
   "message": "“I always carry at least ₹1 Lakh worth cash with me at all times”\n\n“ I don’t know how commercial planes work, I own a private jet”",
   "created_utc": 1692736319,
   "score": 10,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxayl56",
   "message": "“You’ve never been to Paris?!”\n\nAlso, this is what this girl’s father said after I commented on Albert Camus’ “The Stranger” on his bookshelf. “Well, have you read it in French?”",
   "created_utc": 1692728188,
   "score": 8,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxb9res",
   "message": "A new exec came on and was talking about her hobbies. They included white water rafting and flipping houses.",
   "created_utc": 1692732294,
   "score": 9,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbxqyr",
   "message": "Back in the early 2000's, I had just been laid off for the 3rd time in 10 years and the Trust-fund baby of our friend group says to me \"why don't you just apply for a job that you would LIKE to do?!\"\n\n...A job that I'd *like* to do.  It took all of my strength and willpower not to pimp-slap that idiot.",
   "created_utc": 1692741239,
   "score": 5,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbyl7j",
   "message": "My CEO’s daughter was talking to me and she now lives in the UK. She bought a place in London. I mentioned I have some family over there that I’ve always been interested in visiting, and hoped to see it one day. \n\nHer response? Just go. Definitely, it’s as easy as buying a plane ticket. She had no idea why I hadn’t gone yet.",
   "created_utc": 1692741573,
   "score": 5,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc36vr",
   "message": "At the height of COVID, I was living in a small apartment in NYC making $50K. I put this beautiful view from Brooklyn Heights m/DUMBO as my Zoom background. For those who don't know, one of the most expensive areas of NYC. \n\nI had a meeting with a SVP who asks: \"omg! Is that your view? Are we neighbors?!\"\n\nNo lady, you don't pay me nearly enough to be your neighbor.",
   "created_utc": 1692743444,
   "score": 4,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc42t2",
   "message": "“Where did you go for summer vacation?”\n\n“Everyone has been to Disneyland, it’s not even that expensive.”\n\n(laughing) “OMG you guys, can you believe Candice has never even *been* to a beach or seen the *ocean*? Yeah, I guess straight A’s aren’t everything. You can tell me about the animals in the ocean all you want, but you’ve never even seen it! How could you know anything?”\n\nChick: “Did you go to that concert last night?” \n\nMe: No, I couldn’t afford it.\n\nChick: “I don’t understand…”\n\nMe: “Aww, I know you don’t, honey”",
   "created_utc": 1692743814,
   "score": 3,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbd3a2",
   "message": "One Big4 partner to another when talking about some unexpected personal expenses in a room full of junior staff: it’s only 50k, but still… The whole room went silent",
   "created_utc": 1692733530,
   "score": 3,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbxg2h",
   "message": "\"I don't understand why it's so hard for you to find a job\" Ex Rich Girlfriend, June 2010.\n\nAfter the financial crisis, the Los Angeles, CA Unemployment Rate reached as high as 13.9% in 2010.\n\nShe wasn't an econ major but it's clear she didn't skip the Kardashians to read the WSJ.",
   "created_utc": 1692741120,
   "score": 3,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc3lfq",
   "message": "We base your pay off fair market value.\nThis is fancy talk for we take your job title and find the median pay rate for your title. They don't take your experience into account, no adjustments for inflation.\nThere's people leaving with their security clearance for jobs that pay double their current rate and the company loosing people knows this and just shrugs. If you mention increasing pay they say \"We have to spend money carefully and have to assess if we can afford that later on.\" OK enjoy bleeding money to hire and train replacements that will probably leave once they get their clearance.",
   "created_utc": 1692743612,
   "score": 3,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxb6viq",
   "message": "Not sure if rich or just plain delusional, but at a job interview i was asked \"Would you be willing to move to a different city for a bit more (than minimum wage)?\"",
   "created_utc": 1692731227,
   "score": 4,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbraxd",
   "message": "Me: “I wanted this model of car in green, but they didn’t have any in the lot.” \n\nPerson: “So why didn’t you just buy a green one?”\n\nMe: “…because I can only afford a used car and can’t get a custom ordered car?”",
   "created_utc": 1692738760,
   "score": 5,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbo3ws",
   "message": "It wasn't the phrase as such but the way the old boy casually described taking a disassembled vintage Bugatti through customs and excise in the back of his van. \n\nActually a very down to earth bloke, unlike a lot of the \"hoorays\" at the event. Really nice guy!",
   "created_utc": 1692737558,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbvb9g",
   "message": "Sure, I'll just hop on my invisible private yacht. No charge!",
   "created_utc": 1692740283,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbvfpe",
   "message": "If you don't like your job, just quit. During a pandemic, when my entire industry was shut down and I was lucky to get anything. Didn't know if I quit I wouldn't get unemployment or that I was playing 100% of rent and utilities although her millionaire son lived with me. They had no concept",
   "created_utc": 1692740330,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc0gvs",
   "message": "Getting your car broken into 15 times is just \"living in a big city\".",
   "created_utc": 1692742330,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc3yyn",
   "message": "that they didnt understand how parents could let their kids go to public school (5min after i told her that i was from public school)",
   "created_utc": 1692743770,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc574f",
   "message": "“You should save it”\n\nUnfortunately I’m unable to save money because I don’t have a substantial amount to spare. I can either eat now or eat later and I’d prefer to eat now",
   "created_utc": 1692744283,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc88ee",
   "message": "We had no bread to eat, so she told us to eat cake",
   "created_utc": 1692745546,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc9xmw",
   "message": "l worked for Medicaid.  The big bugs at the state government level had a \"poverty exercise\" where they had to try to budget at poverty level and live on it for 3 days.  \"My, that was SO difficult!\"  No shit pal - that whole idea pissed me off so bad.",
   "created_utc": 1692746260,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxca1v5",
   "message": "“Your house is so quaint.  I didn’t know that u could live in such a small place” lol",
   "created_utc": 1692746310,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcajuu",
   "message": "\"I have to watch my nickels \u0026amp; dimes\"......\n\nThen later that month he goes to Europe with his family of eight for three weeks.",
   "created_utc": 1692746516,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcby5d",
   "message": "\"Isnt it funny we are the same age but my dad bought me a condo and you have to work 2 jobs?\"",
   "created_utc": 1692747107,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcc8d9",
   "message": "Referring to a coworker, they said \"she's been saying she wants to buy a house. She's in her 30s now but she still rents. Kinda embarrassing.\" This person owns an apartment downtown, is paying for a fucking villa in the suburbs with the help of some relative and could choose to stay at their parents' big ass house which they've owned for generations. According to this person, they're \"normal people\" because they're not filthy rich/old money. The coworker is middle class too. And If she can't afford a house right now, how the fk are we supposed to?",
   "created_utc": 1692747229,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxccxix",
   "message": "“You don’t just buy new furniture when you move?”",
   "created_utc": 1692747526,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcf1t1",
   "message": "\"Pardon me. Do you have any Grey Poupon?\"",
   "created_utc": 1692748426,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcgo4f",
   "message": "My dad, a boomer who has lived an absolutely charmed financial life, tells me every time we talk, \"You should invest in real estate!\"\n\nGreat idea, dad, let me take this $0.36 I have to my name and buy a house with it, I don't know why more people don't do this.",
   "created_utc": 1692749123,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbjbk6",
   "message": "\"Thank you.\"\n\n\n($2.00 tip)",
   "created_utc": 1692735798,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbuiwe",
   "message": "\"You know, you really mustn't shop at asda, their workers are paid a pittance and have the most awful working conditions.\"\n\nI was a single parent of two little kids, working in a care home for minimum wage. Don't fucking talk to me about poverty and awful working conditions.",
   "created_utc": 1692739978,
   "score": 3,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc1i79",
   "message": "It's a banana Michael. What could it cost?  $10?",
   "created_utc": 1692742752,
   "score": 2,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbeuiw",
   "message": "\"My parents didn't want to pay for the AC on my new car\"\n\nYeah fuck you",
   "created_utc": 1692734171,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc3nk0",
   "message": "“Young people don’t want to buy houses anymore! They would rather rent.” - said by a guy who owned multiple homes",
   "created_utc": 1692743638,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbb7hc",
   "message": "“Get your hands off my Dick”",
   "created_utc": 1692732836,
   "score": 0,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbmbfv",
   "message": "\"If you don't have any money go to the bank and get some\" \n\nIt was nice seeing her post about her fiance dying before they could get married earlier this year",
   "created_utc": 1692736898,
   "score": 249,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbxdoy",
   "message": "Obama was going to bring Russian Military to America to help with crime….wtf??",
   "created_utc": 1692741094,
   "score": 255,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbyvxt",
   "message": "I had my brother-in-law's dad try to give me a boat.  I said no.  That was back in the day when I had boat pride.",
   "created_utc": 1692741693,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbywfo",
   "message": "\"I never look at the price of gas.\"",
   "created_utc": 1692741698,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbyywj",
   "message": "That if I wanted to be able to haggle with a dealership I should show up with cash. Apparently if you show up with enough cash to buy a car you can get a great deal. 🙄",
   "created_utc": 1692741725,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxbz5cv",
   "message": "She isn’t rich herself but coworker said that her parents used to have \"average\" income when they were both working (when she was growing up). Turns out her father, now **retired**, is getting more from the national retirement pension than us working as professional engineers with 5 years of experience. Tells you how much he used to make, and she thought it was \"standard\"",
   "created_utc": 1692741797,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc1h8u",
   "message": "I bought a red Porsche to match my red Birkin.",
   "created_utc": 1692742741,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc4nra",
   "message": "I don’t understand….Why don’t you just ask your parents for a new car?",
   "created_utc": 1692744057,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc4q0s",
   "message": "Not a rich person but someone who made enough money to be comfortable. We had the same job but since I was new I was getting paid very low. They told me I need to get a new car. They had a nice car and I had a point A to B.",
   "created_utc": 1692744083,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc5tkx",
   "message": "An ex friend of mine whose family was very wealthy while we were in high school. She was looking at Kate Spade bags online to pick out so her mom could buy her one for Christmas. I pointed out one that I liked and she said \"why don't you ask your mom to buy it for you?\" Bitch...they're like $500\n\nI remember eventually explaining to her that my mom works 3 jobs because we're broke and she said \"I didn't know you were poor.\"",
   "created_utc": 1692744542,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc6tas",
   "message": "Ask your parents.",
   "created_utc": 1692744952,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc77bg",
   "message": "My card is made out of metal. Proceed to toss it at the counter for me to swipe it.",
   "created_utc": 1692745112,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc7egu",
   "message": "In context of talking about a broken window: \"I mean, seriously. Who hires *Portuguese* cleaning people?\"\n\nDude was messed up in a lot of ways. His parents had money and thought that counted as affection, and he was just an out-of-touch rich kid.",
   "created_utc": 1692745196,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc7h3w",
   "message": "\"Don't use credit or rent just save for a home\"",
   "created_utc": 1692745227,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc7hqu",
   "message": "I was having lunch with an investor during the 2008 crash. He looked up from his soup and said, \"Things are so bad that I might have to get rid of the polo ponies!\"\n\nPoor, poor, fellow.  ... and, no, he did not have to get rid of the polo ponies.",
   "created_utc": 1692745234,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc7mds",
   "message": "“I have no hair on my body! You should have your husband take you to get laser hair removal! It only cost me $10,000” \n\n…maybe in my dreams\n\nShe was the Mayors daughter and I was catering her dogs birthday party",
   "created_utc": 1692745288,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc7pa2",
   "message": "Not to me, but my wife used to work at a law firm and one Christmas holidays had a party which included a treasure hunt for a few things outside of the office building, one of which was a burger wrapper. My wife watched as one of the partners asked some people eating at a McDonald's if those round things they had were burgers.",
   "created_utc": 1692745321,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc7x29",
   "message": "\"Your just letting money stop you\" yes it does that.",
   "created_utc": 1692745412,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc8fvv",
   "message": "I was venting to a coworker about how burnt out I was (she has a very rich husband, and used to be high income herself, but stepped down to relax a bit) and she suggested I take a few weeks off and travel.\n\nMa'am. I make $30k a year and pay rent.\n\nShe would also complain to me about finding a townhome to buy for her 18 year old son so he didn't have to live in a dorm his freshman year of college. The horror was that she didn't like the carpet in the one they bought, so she *wanted* to replace it.",
   "created_utc": 1692745632,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc8m2h",
   "message": "My wife’s boss told her that she doesn’t really need her meds, she should just do her own research about biohacking. He said he was depressed once and switched to a red meat diet and now he’s not depressed anymore.",
   "created_utc": 1692745703,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc8vms",
   "message": "When i was a freshman in college, i had made a couple friends. People asked me why I took my studies so serious, i just said “well i have student loans i gotta worry about afterwards, so trying to do the best i can here to get a nice job” \n\nA kid (from very very wealthy parents) goes “What’s a student loan?” \n\n😒",
   "created_utc": 1692745814,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc9dnr",
   "message": "A friend of a friend I saw quite a bit overheard me say I was going to propose but not something public (my now wife would've died if there was any applause etc) and he said totally straight faced that I should plan a picnic \u0026amp; take her in a private helicopter.",
   "created_utc": 1692746026,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxc9hwb",
   "message": "On morning one of the C-suites was at the coffee pot when I came in. \n\nHe was really worried because his vacation home was in the path of a hurricane and he had just come back from vacation so he didn’t want to go down back down to make sure everything was alright. \n\nBut it was ok because his property manager was a good guy.",
   "created_utc": 1692746076,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxca2sw",
   "message": "Not really the topic but this story came to mind. \nI had a relative that reached out on Facebook to ask if I could buy him an iPhone. \n\nI like to share what I have, but I’m not loaded.\n\nAnd this relative was someone I’ve only seen once in my life, when he was *a baby*. \nNever spoken or seen him since. \nSo, very out of the blue.\n\nI was confused by his forewardness to be honest. Struggled with finding a response until I came up with a good one: \nHey cuz, would be lovely to meet up for a coffee and meet one another! And as for the iPhone, you know I’m sorry, can’t really afford one but if you scrape up half I’ll help you with the other half of the money! \n\nNever heard from him again🤷🏻‍♀️",
   "created_utc": 1692746320,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxca8gh",
   "message": "\"Everyone's a millionaire,  doesn't mean anything \"",
   "created_utc": 1692746385,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcaaax",
   "message": "Just buy an investment property. It's easy money.",
   "created_utc": 1692746406,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcae7i",
   "message": "I had an ex employer rage at me for being on unemployment.",
   "created_utc": 1692746451,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcajk5",
   "message": "I worked at a small company in the 90s (maybe 25 employees) and the owners hasn’t made payroll for over a week. One morning, several of us were out front smoking before our shifts, complaining about not getting paid, when one of the owners pulls up in their brand new sports car. He gets out and excitedly asks if we wanted to come check it out. It was surreal.",
   "created_utc": 1692746513,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcaon0",
   "message": "\"Why don't you just charter a flight\", in response to me not being able to make it from Oregon to NY by the following day.",
   "created_utc": 1692746572,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcaqwz",
   "message": "Over heard a convo between the Grand Pooba boss and one of my coworkers talking about vacations \n\nGPB \"You should go to Aruba sometime\"\nCoworker 'i don't make that kind of money for all the travel' \n\nThere is at least $50K difference in payscale.\n\nThen there is my conversation.\nAs i had been in my Step manager position for a few months.\n\nMe: \"Yeah thats not even feasible. that time frame, and the goal isn't exactly reasonable.\"\n\nGPB \"Find a way to do it. Thats why you make the big bucks\"\n\nMe \"For a company that does roughly A couple tens of millions in sales at this location alone  $16/hr, no bonuses, and current tax rates isn't exactly big bucks. \nNo Promises, but at least we won't be in the red\"",
   "created_utc": 1692746599,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcdbes",
   "message": "“Can we do this in a half hour or less? My family had a trip to the Bahamas scheduled for next week, but my daughter got Covid, so we canceled it. I got my son and I last minute NFL tickets, and our flight leaves in four hours”\n\nI was at his house to do some outdoor repairs. This guy was tossing suitcases in his car as he said this. I told him I could just invoice him for the work, and he and his son drove off to the airport minutes later.",
   "created_utc": 1692747691,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcdc6q",
   "message": "The original title of the peace was A Week in New York City on $25 an hour\n\nhttps://www.refinery29.com/en-us/money-diary-new-york-city-marketing-intern-income",
   "created_utc": 1692747700,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcdkju",
   "message": "He didn't know what a Target was.  This was back in 1991.  I was floored.",
   "created_utc": 1692747800,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcdqzx",
   "message": "I was going through a bad time financially and my mental state was very low. A woman said to me \"when I feel depressed I go to India for month and just chill that always cheers me up\" in a manner that I took as I ought to do it if i had any sense.",
   "created_utc": 1692747875,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxce0hf",
   "message": "I was tipped 5c, while working at an Australian Island resort.  Huge boats on private moorings; entitled, old men everywhere.\n\n\nIt's not the tip that confused me... it was what he said as he slid the coin across the bar before giving a wink.\n\n\nThe fattest ducklings get that way by eating all the crumbs.\n\n\nI mean yea....\n\n\nBut dude, I have a job\n\n\nTake your 5c and your fake smile and fuck off",
   "created_utc": 1692747988,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxce3l7",
   "message": "\"Life isn't too expensive, just work more.\" I'm already working 50+ hours a week. If I work anymore I'll go into a new tax bracket and take home less money. I couldn't get them to understand this.",
   "created_utc": 1692748024,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcekn3",
   "message": "“Anything less than 1000 square feet per person and I go nuts, but there’s a mansion tax at 5000 square feet - damned if you do, damned if you don’t” - 40 year old multimillionaire with a family of 5 to a bunch of struggling 20-something’s. Guy was such a prick in general",
   "created_utc": 1692748225,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxceyqn",
   "message": "Male VP at our company to female manager me about some kind of household maintenance: Don’t we have wives to take care of that?",
   "created_utc": 1692748391,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcffs7",
   "message": "Our company and industry as a whole wasn’t doing well at the time so as a result there were company wide lay-offs and forced early retirements. At the height of this we had a meeting with our VP (the VP of Finance no less), and to make small talk before everyone got there he felt the need to talk about his new suv and my gosh. It just has so many new awesome features that he doesn’t even know how to work it all! ☹️ He was completely tone deaf",
   "created_utc": 1692748590,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcfh5w",
   "message": "I told a family members fiance that I liked to golf while we were at their house, and he goes \"oh you live in LA, have you played Riviera in the last few months? They're getting ready for the tournament and it's in amazing shape\" when I said no I've never played Riviera (one of the very prestigious clubs that hosts PGA tournaments) he goes \"oh... well when it's shut down I'll probably play belair again(also ultra prestigious), what about that one, have you gotten on there yet? I play a lot better at Riviera but I like both a lot\" .... I'm like bro I haven't paid more than $60 for a round of golf in my life and my clubs I bought on Reddit for $80.",
   "created_utc": 1692748607,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcfhxe",
   "message": "You need to save your money. Like I have extra after the necessities.",
   "created_utc": 1692748616,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcfsec",
   "message": "Just borrow a 50k mortgage down payment from a family member.  jokes.",
   "created_utc": 1692748744,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcfwo6",
   "message": "Went hiking with a friend at his lovely, very large house in the Malibu hills. Told him I lived farther south, was about to move to LA (in the city itself). \n\nHe playfully scoffed, but then said, completely casually but seriously — “LA sucks. Just move here.” *gestures to the vast land and mansions around us* “It’s way nicer.”\n\n….like, yeah, I know it is.\n\nTook me a full 10 seconds to respond.",
   "created_utc": 1692748795,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcg2oq",
   "message": "When the film industry struck this year, my boss with a straight face told me I should always have about 40k put aside for things like this",
   "created_utc": 1692748867,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcg879",
   "message": "\"Let's just split the bill.\"",
   "created_utc": 1692748933,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcg9q7",
   "message": "How much could a banana cost? Ten dollars?",
   "created_utc": 1692748951,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcgo4y",
   "message": "I could see the protestors from my office building!\n\n(The comeback to this, sadly not by me but by a hilarious German guy, was an instant: “oh, did they interrupt you drinking your martini?”)",
   "created_utc": 1692749123,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcgqnm",
   "message": "Walk behind the golf cart.",
   "created_utc": 1692749152,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxchrjw",
   "message": "I was sitting around a conference table with some execs, including the CEO. He and a couple other of us had pretty young babies. He got to talking about his night nurse and insisted I really should get one. So much easier.",
   "created_utc": 1692749598,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxchxkn",
   "message": "\n*set in Houston TX*\nBoss: big plans this weekend\nMe: nah, just hanging out at the apartment. Might go to a bar. You?\nBoss: oh we’re celebrating my 40th birthday this weekend so we’ve got a big party.\nMe: oh yeah? Happy birthday then! Anything special for the party?\nBoss: oh not much, just some friends flying in then I decided to get myself a treat so IM FLYING MY ICE CREAM GUY DOWN FROM NEW JERSEY.",
   "created_utc": 1692749671,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxci8u4",
   "message": "\"slaves are getting too pricey. I can only afford to get one.\"",
   "created_utc": 1692749806,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxciexp",
   "message": "I was talking to my manager about a mistake on a check. \n\nMe: This isn’t even enough to cover my daughters day care for the month. \n\nHer: Well what did you do with the money you were just paid?\n\nMa’am. Food, rent, electricity, and car payment. Boom, check gone.",
   "created_utc": 1692749880,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcilav",
   "message": "[When McDonalds gave out an employees budget to make minimum wage seem like a livable wage](https://www.forbes.com/sites/laurashin/2013/07/18/will-the-mcdonalds-employee-budget-help-get-the-minimum-wage-raised/?sh=6daf35b464b9)\n\nif you have 2 jobs then you dont have time to get sick so that $20 a month for medical is just extra walk around money",
   "created_utc": 1692749956,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxciqvk",
   "message": "Had some kid in his early 20s start working at the restaurant I was at, total trust fund baby but his parents made him get a job or they would cut him off (Phone, car, apartment, school, credit card, everything).\n\nWe were talking about plans for the summer, I mentioned I was gonna take a weekend to head north and visit my mom, someone else was going camping, another guy was taking a long weekend to help his brother move.\n\nHoly fuck. \"You guys have no idea what vacation means, do you? I'm taking my GF to Spain for two weeks and then spending a few days in Italy before we come back.\"\n\nHe got real upset when I asked him where he was gonna work when he came back. Apparently he didn't understand that taking 3 weeks vacation not even two months into a job isn't a thing, especially when part of that was during our busiest season of the year.\n\nEven better when we all looked at him and told him we couldn't even afford a week off, let alone in Spain.\n\nHe didn't last long.",
   "created_utc": 1692750020,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxciw9r",
   "message": "“We didn’t have a lot of money either. I guess that’s why we learned to save our money.”  \nPoor people know.",
   "created_utc": 1692750084,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcizxx",
   "message": "When we had been married for less than a year my grandparents told us that the best way to get ahead is buy a house and pay it off quickly. If possible in less than five years. Together we were making about $20,000 a year in 2012. Most of my extended family did very well for themselves and are incredibly nice but say things like this occasionally. My friend that isn't rich but is financially comfortable told me that whenever he gets real stressed at home he just goes and stays in a local hotel room by himself for the weekend and that I should try that. We can barely afford to stay in a hotel overnight maybe once a year. Realistically we shouldn't even do that but we just fall behind on bills for a couple months so that we can get away for a night or two every year. Our vacation \"budget\" is maybe  $500 to $600 a year and again by \"budget\" I mean we fall behind on bills for awhile. We have a family of four on about $60,000 year.",
   "created_utc": 1692750128,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcj484",
   "message": "I'm not sure, I don't really know any rich people.",
   "created_utc": 1692750179,
   "score": 1,
   "submission_id": "15ydt2e"
  },
  {
   "comment_id": "jxcj97m",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ydt2e"
  }
 ]
}