{
 "submission_id": "15yelj7",
 "title": "What do you wish someone told you when you bought your first house?",
 "selftext": "",
 "created_utc": 1692729737,
 "permalink": "/r/AskReddit/comments/15yelj7/what_do_you_wish_someone_told_you_when_you_bought/",
 "score": 98,
 "url": "https://www.reddit.com/r/AskReddit/comments/15yelj7/what_do_you_wish_someone_told_you_when_you_bought/",
 "comments": [
  {
   "comment_id": "jxbiu4u",
   "message": "This is how you shut the water off to your house.",
   "created_utc": 1692735622,
   "score": 88,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb74mu",
   "message": "Don't get a shared driveway!",
   "created_utc": 1692731319,
   "score": 118,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb79gp",
   "message": "How much dumb little shit you have to buy. Moving from an apartment into our home was lovely, but my god did I underestimate how much household shit you'd have to buy.",
   "created_utc": 1692731368,
   "score": 104,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb7nlu",
   "message": "* Budget for property taxes\n* No one is going to fix it if you don't. If you don't fix the issue, it'll get worse.\n* Your house is also an incredibly powerful financial asset and as a homeowner, you should know how to leverage it accordingly. I'm not recommending everyone leverage this equity but a homeowner must be educated on the subject. It can be to their benefit in certain situations and will reduce the likelihood that they're taken advantage of by a third party.",
   "created_utc": 1692731515,
   "score": 46,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb4ox4",
   "message": "That it's absolutely necessary to budget for taxes and maintenance. Put aside a monthly amount like it's part of your mortgage. A new roof will cost a fortune, so find out when you're likely to need one and budget accordingly. Water heater, furnace/AC, appliances, deck, plumbing, yardwork (including dead trees and limbs) -- it's all on you.\n\nBasically, figure out what you want to spend per month on a house. Now reduce that by 25% and pocket the extra for upkeep and taxes.",
   "created_utc": 1692730429,
   "score": 65,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb2zxn",
   "message": "How much power the HOA has",
   "created_utc": 1692729811,
   "score": 102,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb9tbe",
   "message": "This is extraordinarily obvious in hindsight but when your property inspector notes something as potentially being a problem in the future just go ahead and be proactive about dealing with it.",
   "created_utc": 1692732313,
   "score": 30,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbqo0e",
   "message": "For our situation I wish someone would have told me to invest in a long-term , bigger house instead of a 'stepping stone' property - no way will we ever be able to afford the type of house we could have afforded 7 years ago, even though we both earn more now!",
   "created_utc": 1692738520,
   "score": 28,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb5yns",
   "message": "\"Now its yours. if something breaks, you have to fix it or pay to have it fixed.\"",
   "created_utc": 1692730890,
   "score": 42,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb3rpq",
   "message": "\"Hope you got a good deal.  This place is a real pile of shit.\"",
   "created_utc": 1692730093,
   "score": 20,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbk62j",
   "message": "Don't plant trees too close to your house. Also, everything needs regular maintenance. Dishwasher (filter), AC, water heater, refrigerator (seals, gaskets, clean underneath), washing machine, etc",
   "created_utc": 1692736110,
   "score": 18,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb30xd",
   "message": "Keep it ..u will never be able to afforde one now lol",
   "created_utc": 1692729821,
   "score": 28,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxba77l",
   "message": "Get your own inspector. One recommended by your agent will not usually be impartial.",
   "created_utc": 1692732458,
   "score": 29,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb9jgv",
   "message": "Check your insurance more frequently. I had a shitty agent for 10 years and never realized how much money I was throwing away.",
   "created_utc": 1692732213,
   "score": 12,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbm7qp",
   "message": "When you buy a house, think about how easy or hard it's going to be when you later come to sell it. My first one was a three storey modern townhouse with a LOT of space for the cost. It didn't worry me that there was a railway just to the left, a main road just to the right, a supermarket around the corner and communal land with a small monthly gardening charge. As a single twenty something who didn't spend much time at home, close access to the motorway and train network, and not having to do any gardening was an absolute plus. That place was a nightmare to sell.",
   "created_utc": 1692736861,
   "score": 8,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxc2xg7",
   "message": "High ceilings are NOT a feature. My townhouse (my first home) has extra-high ceilings. When I was touring it, that seemed so great. It was so open and airy!\n\nJust wait until the smoke alarm starts chirping and you need to stand at the top of a *ladder* (not a step stool) and you still can barely reach them with your fingertips. \n\nI'd pay a good deal of money to have normal height ceilings.",
   "created_utc": 1692743335,
   "score": 8,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbben3",
   "message": "Your taxes finna shoot up in a couple years.",
   "created_utc": 1692732909,
   "score": 13,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbu5as",
   "message": "Those people you see online with beautifully decorated homes don't have magical good taste and DIY skills, they have money. Your house probably won't look like that unless you too have the money.",
   "created_utc": 1692739833,
   "score": 6,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcgqdk",
   "message": "Wait you guys can afford houses?!",
   "created_utc": 1692749149,
   "score": 8,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxclj2j",
   "message": "Don’t use the real estate agents recommended home inspector.",
   "created_utc": 1692751211,
   "score": 8,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbn0kh",
   "message": "I’d want someone to tell me to put a stop to the closing when the seller brings up an “oh, by the way, there’s a crawlspace accessed by a trapdoor under the carpet in the closet” that my inspection obviously didn’t include cause we didn’t know about it.  Sneaky bastard knew exactly what a stunt he was pulling.  We didn’t.",
   "created_utc": 1692737157,
   "score": 7,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbscot",
   "message": "Get the plumbing inspected by camera.",
   "created_utc": 1692739153,
   "score": 7,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbq439",
   "message": "How wonderful it is!",
   "created_utc": 1692738312,
   "score": 11,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbc8dx",
   "message": "Building inspectors inspect buildings. Yard issues are buyer beware. \n\nTwo of the biggest mistakes first time home buyers make are assuming yard problems will be straightforward to fix, and shying away from the house with a really showcase yard because that seems like too much work.\n\nSellers already do the easy fixes before putting a home on the market. Often those fixes are just concealment such as mowing a lawn full of weeds the day before the open house. So if there's a brown patch in the front yard that it seems like a bit of seed and fertilizer would fix, odds are that's already been tried.\n\nA year after purchase, many first time homeowners' opinion of their yard is, \"We didn't realize it would cost so much and be so much work.\"\n\nPro tip: go for that house with the immaculate yard. It's so much easier to downscale a great yard than to fix a mediocre yard.  You can get rid of a rose garden in a weekend with a post to Freecycle. That's infinitely easier then discovering the seller foisted a nutsedge problem.",
   "created_utc": 1692733215,
   "score": 8,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbtx6c",
   "message": "That my office was going to relocate within a year, adding an hour to my commute each way.",
   "created_utc": 1692739746,
   "score": 5,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbbnd6",
   "message": "Giant houses suck to clean and have way more space than you need.  My first house had two extra bedrooms we didn't use for anything.  I literally used one to keep christmas presents in and I put my fermenting beer in the extra closet.  That's it.\n\nThe next house I bought was 700 sq ft smaller and generally a much better fit.",
   "created_utc": 1692732999,
   "score": 8,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbtkr1",
   "message": "Any money you \"make\" when you sell this place is not your money until you've paid off your mortgage.  If you buy something else 100% of that money from the last place goes towards the new place - not boats or hos",
   "created_utc": 1692739615,
   "score": 3,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbxdbr",
   "message": "Needs some TLC\n\nT=  TEAR IT DOWN\n\nL=  LOT'S OF MONEY\n\nC=  CASH UP FRONT",
   "created_utc": 1692741090,
   "score": 3,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcmgf9",
   "message": "A few good posts already here. Here's another one. When negotiating, don't do it on a Friday evening. Both the Realtors want to get it wrapped up and your realtor, though he has a fiduciary interest to get you the best deal, has a vested interest in getting out of there on time for his golf game tomorrow, so he's not going to negotiate you the best deal because that'll take extra time.\n\nBefore you make an offer, make sure that the house has no asbestos, urea formaldehyde insulation, and no aluminum wiring. If they do, use that as bargaining chips.\n\nYour realtor is always going to show you stuff that you can't afford, and shitty stuff that you can so that she can interest you in the one or two that they think you should have. Do your own research as well as taking your Realtor's advice.\n\nA contractor friend is worth 10 home inspectors. Ask them if they wouldn't mind coming over and having a look, then give them a bottle of Lagavulin for their trouble.\n\nEDIT--Offer your contractor friend $100/hr to have a look.",
   "created_utc": 1692751609,
   "score": 3,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcmxke",
   "message": "that you can sue the seller for failure to disclose foundation issues.",
   "created_utc": 1692751814,
   "score": 3,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb9inb",
   "message": "We did it without advice but, start a separate savings account for house specific emergencies. Things like major appliances and your roof will eventually pop up. If you're lucky you'll see it coming for a while. But it will come.\n\nAlso, a disaster kit appropriate to local hazards. Don't forget pets or medications if possible!\n\nOoo, and buy and check your fire extinguisers regularly!",
   "created_utc": 1692732205,
   "score": 4,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb4joc",
   "message": "Pay that shit of quickly because the price of living is about to get silly.",
   "created_utc": 1692730376,
   "score": 6,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb8l2c",
   "message": "For the love of god, learn how to maintenance a hot water tank.  It's legitimately a sitting bomb in your home if you don't pay it any attention.  \n\n\nIf you're looking to buy your first home, I'd look for something with a newer roof, and major appliances if possible.  Hire an inspector to ensure it's safe to live in, and if you're close to other neighbors, get a survey of your land, to ensure you don't cut your neighbors grass for the rest of your life without knowing.  \n\n\nAlso, definitely replace all deadbolts/locks after moving in, but I feel like i shouldn't have to tell another adult that.",
   "created_utc": 1692731860,
   "score": 4,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbug0o",
   "message": "Always always always ask questions about the history of the house as it relates to water. Does the basement flood when it rains? Has the roof (or the windows!) had leaks?\n\nYou do NOT want to be caught flat-footed when it rains.",
   "created_utc": 1692739947,
   "score": 2,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxc02yy",
   "message": "Appraisals are very, very subjective numbers",
   "created_utc": 1692742176,
   "score": 2,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxc4bkq",
   "message": "This doesn't apply to me since I bought a newer home, but do not buy a \"fixer\" or very old home as your first purchase. That Victorian home looks beautiful and may even be reasonably priced, but it will cost you a small fortune to keep climate controlled and will never feel as comfortable as a modern home unless you perform serious upgrades. Use your first house to practice repairs and upgrades and maybe your third or fourth home will be that beautiful historic building. You really don't want to be house poor because you're spending so much money keeping the building maintained so it doesn't collapse around you.",
   "created_utc": 1692743915,
   "score": 2,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxce43r",
   "message": "The name and number of a good handyman.",
   "created_utc": 1692748031,
   "score": 2,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxci12h",
   "message": "Electricity is like… so fucking expensive and they take money even if you don’t use it.",
   "created_utc": 1692749713,
   "score": 2,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcl31j",
   "message": "I bought before the housing crash so I guess for me it would be, \"hope you like it because it is going to take 15 years and a pandemic for your mortgage to come above water again\".",
   "created_utc": 1692751020,
   "score": 2,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxd5zul",
   "message": "Watch Youtube videos on doing basic stuff. If your handy, home warranties like American home shield for me where a waste of money. The one time I needed them for something they didn't cover it.\n\nI fix everything, between Youtube and Google and common sense, it's easy. I got a new A/C installed, was paying them $250 every 6 months for \"maintenance\" (15 minutes of blowing air) and figured I could buy a new A/C at that price, stopped after 2 visits and almost 9 years later still going on strong.\n\nMy list: \n\nchange the anode rod in your water heater and drain it yearly. Extends the life.\n\nCheck you sewer trap for roots, you can have a potential problem, scope costs about $300.\n\nGet an air compressor, its great for blowing out everything.\n\nTools: hit up you pawn shops, craigslist, yard sales for deals.",
   "created_utc": 1692760551,
   "score": 2,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbldx8",
   "message": "Take your time.  Don’t settle.  Stick to what you really want.   The realtor won’t help you with much.  We told him what we were looking for and he sent us any type, any bedrooms, anything, any where.  It was just autogenerated all the properties for sale.  we Would look ourself and new properties came up exactly what we wanted and he never contacted us about them, we just found them ourself And had to call him so we could see them.",
   "created_utc": 1692736558,
   "score": 3,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbxmzy",
   "message": "Get a 15 year mortgage instead of a 30 year.",
   "created_utc": 1692741196,
   "score": 4,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbg0xd",
   "message": "Put it in BOTH of your names.",
   "created_utc": 1692734596,
   "score": 2,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxc5cmt",
   "message": "don't do 30 year mortgages, the interest is literally more than the house.",
   "created_utc": 1692744346,
   "score": 2,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxb95jc",
   "message": "The fixed rate mortgage can go up due to land valuation happening every two years. Pay 300 more per month now because house jumped up from 330k to 540k",
   "created_utc": 1692732070,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbpgun",
   "message": "If you’re young, in a career with strong projected growth (must be honest about this), then you can probably splurge a little beyond what seems comfortable at the time. I have a home I love with a less than ideal location due to self inflicted budget restraints that became obsolete two years after buying.\n\nAlso, can’t be restated enough, shop around for a good interest rate.",
   "created_utc": 1692738065,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcka0f",
   "message": "Don’t buy a condo - go get your acreage. \n\nI love my acreage",
   "created_utc": 1692750671,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcliml",
   "message": "The housing bubble is about to burst.",
   "created_utc": 1692751206,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcn13a",
   "message": "Buy a couple more",
   "created_utc": 1692751856,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbkscb",
   "message": "That you need to vet your tenants through a vetting agency and that your rent should be just above average, to keep the destructive fly by nights out.",
   "created_utc": 1692736336,
   "score": 247,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxc9sw4",
   "message": "What do you wish someone HAD told you when you bought your first house?",
   "created_utc": 1692746204,
   "score": 251,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbdx0r",
   "message": "I bought my first house, which was a rental property, in February 2020.\n\nI wish someone had told me that we were about to go through one of the craziest home value increases in decades; I'd have bought a way more expensive house which would have resulted in a shitload of equity now.",
   "created_utc": 1692733833,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxbnzkc",
   "message": "Explaining the difference in mortgage types and importance of shopping around. I financed through the place my realtor was affiliated with and got taken for a ride on closing costs and interest rate.  I got such a bad loan that when I realized it about a year later I was able to refinance to a 15 year instead of my 30 for a whopping $40 a month extra.",
   "created_utc": 1692737514,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxc03ux",
   "message": "Pay attention to the utility easements!!\n\nThey were on the survey but we didn’t know what we were looking at or what they meant. We didn’t realize it until 7 years later when we couldn’t get a permit for a covered patio. Turns out the utility easement runs straight across the yard about a foot outside the back door.",
   "created_utc": 1692742186,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxc159v",
   "message": "The smaller your home, the higher importance it is to maximize your space",
   "created_utc": 1692742605,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxc1sm4",
   "message": "To keep onto it for another year before selling (covid market caused it the price to inflate a lot)",
   "created_utc": 1692742869,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxc3kw1",
   "message": "New houses require maintenance before long. The reprieve isn’t worth it.",
   "created_utc": 1692743606,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxc4ds1",
   "message": "Visit the house/neighborhood at night. Check out the neighbor with the brightest lights on every corner of their house shining in your dream home windows.",
   "created_utc": 1692743941,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxc5wek",
   "message": "Still waiting on that day.  When I get one at this rate… no one’s invited.",
   "created_utc": 1692744576,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxccnk9",
   "message": "That the escrow account is never right the first few years. Added substantially to the debt and payment amount that I was not prepared for.",
   "created_utc": 1692747408,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcdje2",
   "message": "No one told me about property taxes. Not my loan agent, not my realtor, not my tax lady, not my parents, nobody. I didn't know about property taxes and how expensive they are until I received my first bill from the county.",
   "created_utc": 1692747786,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcdojp",
   "message": "Buy another one.  The value shot through the roof in 7 years.",
   "created_utc": 1692747847,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcdryj",
   "message": "The To-Do list never stops growing",
   "created_utc": 1692747887,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxce7jp",
   "message": "Your neighbour is a psychopath",
   "created_utc": 1692748070,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcfkps",
   "message": "Giant trees are beautiful…from FAR AWAY… not in or near your yard.",
   "created_utc": 1692748651,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcglwv",
   "message": "That 25 years ago, the previous occupant murdered his entire family with an axe.",
   "created_utc": 1692749097,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxchs9t",
   "message": "that I couldn't have both an alchemy lab and a child bedroom in it :c",
   "created_utc": 1692749607,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcixob",
   "message": "EVERYTHING is expensive",
   "created_utc": 1692750101,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcj5f6",
   "message": "Don't buy because the 10.5% interest rate can come down at some point. I assumed once it was up there it never came down.",
   "created_utc": 1692750193,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcjkb3",
   "message": "dont buy the house at the bottom of the hill with 2 sump pumps in the basement.\n\nthe 2 pumps were for a reason and quite often couldnt keep up.",
   "created_utc": 1692750366,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcl8f6",
   "message": "Either get an licensed arborist's assessment of the health of large trees close to your home...or depending on the market, ask for the sellers to provide one to you at their cost.  Having had to pay a few thousand dollars to take unhealthy trees down (and not knowing how to identify all of the signs), it would have been worth it to know in advance rather than be surprised.",
   "created_utc": 1692751084,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxclfwy",
   "message": "Property taxes are re-assessed like a yr after. So your orginal mortgage is based on the old owners property taxes. The city will most likely re-assess the property and therefore raise your property taxes. This happened to me twice. Raised my mortgage $100 a month.",
   "created_utc": 1692751174,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcmipd",
   "message": "Replace the carpet",
   "created_utc": 1692751635,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcp7nn",
   "message": "To buy it before the market turned to shit",
   "created_utc": 1692752801,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcpvb9",
   "message": "Find a way to rent that mfer out instead of selling it. God damn bought the house as a foreclosure back in 09 at like 114k, sold like a year or so back for 300+.",
   "created_utc": 1692753090,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcqtf4",
   "message": "Check the retaining wall….",
   "created_utc": 1692753507,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcqwg1",
   "message": "I would be on a first name basis with the guys in the hardware store.  I had no idea I'd be going there every. single. weekend.  There's so much stuff I needed to purchase:  wheelbarrow, hoses, sprinklers, hoes, rakes, shovels, mower, gas can, gardening tools, gloves, ladders, stud finder, picture hooks, drop cloths, paint brushes, buckets and a host of things most apartment dwellers have no need of.",
   "created_utc": 1692753543,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcsafo",
   "message": "The purchase agreement typically requires the previous owners to completely clean out the house except what is physically attached. Make sure they remove absolutely everything. They won't leave good stuff behind, anything they leave is going to be junk they don't want. You will have to move this stuff around and eventually dispose of it yourself. Twenty years later I still have crap in my basement to get rid of. Do yourself a favor and start with a blank slate, you have enough work ahead of you without doing what the previous owner should have done.",
   "created_utc": 1692754151,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcse9j",
   "message": "How much work I would have to do and all the new skills I needed",
   "created_utc": 1692754199,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcsqxv",
   "message": "PVC pipes suck, change them ASAP. We had a pipe burst 2 weeks after moving in that flooded half the house. Had to repipe the house either way.",
   "created_utc": 1692754355,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcuczd",
   "message": "Don’t buy a fixer upper. You can make it yours….when you have $30k in the bank to make all the repairs🙄 it’s a trap.",
   "created_utc": 1692755074,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcult9",
   "message": "Everything that breaks is $500 minimum. I spent 35k in 2022, on house stuff, and this week, my dryer broke.",
   "created_utc": 1692755183,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcvgse",
   "message": "**Buy a fire extinguisher.** Some might consider it common sense but it’s something that never crossed my mind. Then I had a candle explode in my kitchen the first week of December. They had to completely empty my house, and I didn’t get to move back in until the first week of July. Lived in my parents camper for a month while the insurance company was trying to find us a rental, then lived in a nice hotel for a month because the camper was too damn small for that, and then finally moved into a nice townhouse while our kitchen was being finished. The insurance company overestimated the furniture rental budget and they had to take the furniture (AKA the beds) a month before the rental lease ended. My dog had to stay with my coworker for the entire 7 months. Did all of that with four kids in three different schools while working 2 jobs and being a part-time college student. Oh and I had just separated from my husband that October and he was being batshit crazy pants the entire time too. \n\nSo yeah. Get a fire extinguisher. And a candle warmer instead of having open flames in your house.",
   "created_utc": 1692755568,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcxdb5",
   "message": "That Mrs. Kravitz lived across the street.",
   "created_utc": 1692756420,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxcyed6",
   "message": "make sure all the appliances are gonna stay.",
   "created_utc": 1692756885,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxd1itr",
   "message": "If you are planning to keep your house for a long time, think about how it will fit you in the future….as your family grows or as you age. For me, not having a bathroom on the second floor is getting to be more of an issue. Also, do any inconvenient remodeling before you move in if you can afford it. My house needs new floors, but the idea of moving all my furniture is overwhelming.\n\nAlso, look at getting your mortgage through a credit union. I’ve refinanced a few times and it’s never cost more than $500.",
   "created_utc": 1692758333,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxd1nc1",
   "message": "If you have hail or any storm, get the roof inspected. I didn't think mine was bad but the roofer found a ton of little damage. He did the inspection along side the insurance adjuster and I was approved for a new roof and gutters. Only have to pay the $1,000 deductible.",
   "created_utc": 1692758393,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxd2110",
   "message": "Don’t get a damn pool even though 60% of homes have one here. First three years of; water, electricity, chemicals, filter, and pump replacements was EASILY $8,000. Not worth it for the 10-15 times I used it.",
   "created_utc": 1692758577,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxd2gz5",
   "message": "lol y’all have a house?",
   "created_utc": 1692758796,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxd2vv6",
   "message": "You still “pay rent” but it’s called a mortgage now and your new “landlord” is the bank and they have no obligation to fix anything or provide any amenities but they will take your money and screw up your finances forever if you mess up",
   "created_utc": 1692758999,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxd39to",
   "message": "Don’t get a pool, get a neighbour with a pool.",
   "created_utc": 1692759187,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxd3u9g",
   "message": "If you dont want to spend your free time working, find low maintenance yard/landscaping.",
   "created_utc": 1692759467,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxd75vp",
   "message": "Get a prenup",
   "created_utc": 1692761151,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxd7uzg",
   "message": "You should have bought earlier lol\n\nIf I could go back in time, I would have saved every penny from when I started working, and bought a house the millisecond I possibly could have. What prices have gone up to now is unprecedented in US history. It's fucking insane.\n\nAs an aside though, I'd say to NOT worry that people got homes at 2-3% rates though. People focus too much on rate. The fact that homes have DOUBLED across the country in 10 years or less is WAY more troubling than a rate fluctuating between 2-7%.",
   "created_utc": 1692761517,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxd82cv",
   "message": "I wanted a wooded backyard, and we got one, but I underestimated the amount of dropped leaves, nuts, berries, sap, pollen, and general squirrel tomfoolery",
   "created_utc": 1692761623,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxd8pzt",
   "message": "If your hvac system is over 15 years old get a home warranty.",
   "created_utc": 1692761970,
   "score": 1,
   "submission_id": "15yelj7"
  },
  {
   "comment_id": "jxd8vat",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15yelj7"
  }
 ]
}