{
 "submission_id": "15ygmw5",
 "title": "What were you doing on September 11th 2001?",
 "selftext": "",
 "created_utc": 1692734114,
 "permalink": "/r/AskReddit/comments/15ygmw5/what_were_you_doing_on_september_11th_2001/",
 "score": 57,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ygmw5/what_were_you_doing_on_september_11th_2001/",
 "comments": [
  {
   "comment_id": "jxbiyj1",
   "message": "I was in boot camp. Joined on Sept 5th. Great timing.",
   "created_utc": 1692735666,
   "score": 81,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbhj1z",
   "message": "Working till I was told to go home. Girl at work asked me out. I normally don't date coworkers but made an exception due to thinking the world is ending. We're still married.",
   "created_utc": 1692735145,
   "score": 223,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbme2z",
   "message": "I saw the attacks as they happened from my window and then spent 5 plus weeks serving the bucket brigade at Respite center one ground zero. Ouch.",
   "created_utc": 1692736926,
   "score": 133,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbfges",
   "message": "Had just moved to Washington DC a week prior, was a high school freshman and had just moved in with my grandparents \n\nI didn’t know my new address and I didn’t have a cell phone. Went to school in Bethesda, they put us on buses and sent us home midday. I got off at my stop but had no way home, so I went into McDonald’s and sat (watching TV) until my grandmother’s assistant principal found me after searching for a while.\n\nMy mom was back home in Connecticut with no way to reach me until I was picked up and brought home (in DC).\n\nThe morning until they dismissed us was spent watching TV with lots of kids whose parents were diplomats, worked at the pentagon, or were otherwise in government crying, and then others who didn’t really appreciate the impact (in a way that was perceptible to me)\n\nI was just kind of shocked and worried that I didn’t know where my temporary guardian’s house was, or how to reach my grandma\n\nMy parents bought me my first cell phone within the next week\n\nI vividly remember Nickelodeon airing repeats of rugrats for hours with a news scroll underneath. I remember my aunt freaking out in NYC because she had led a weight watchers meeting in downtown Manhattan that day, and her fiancé (now my uncle) stopped a block away from their Hell’s Kitchen apartment to watch the ticker in Times Square, and nobody could get a hold of him. \n\nThe next day school was cancelled in Montgomery County MD, so my grandma (who was a principal at the time) took me to breakfast at a place called Georgetown Grille. The sky was empty and, heading home, we saw a couple tanks on some corners. \n\nI also remember driving past the Pentagon a couple weeks later for the first time heading to the hair dresser. We used to go to Crystal City and Pentagon City a lot. Jarring.",
   "created_utc": 1692734391,
   "score": 48,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbyync",
   "message": "Nice try, Homeland Security!",
   "created_utc": 1692741722,
   "score": 48,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbhvh2",
   "message": "I worked nightshift so I got off at 7:00 am and came home and went to bed. I woke up to my wife shaking me saying \"We've been attacked\". She was supposed to be at work so I said \"someone attacked your work?' She said \"No, we've been attacked, the twin towers are on the ground.\" I was immediately awake.",
   "created_utc": 1692735270,
   "score": 43,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbjqvb",
   "message": "Walked in m dorm room after getting breakfast in the student union.  Turned on the TV, and ESPN was cutting air to go to their ABC affiliate for \"America Under Attack\" as they called it.... I was like, whatever.",
   "created_utc": 1692735954,
   "score": 20,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbma86",
   "message": "I was in the garden with my mom, coming out to her as gay when the first plane hit. Never gonna forget that.",
   "created_utc": 1692736887,
   "score": 69,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbh135",
   "message": "Waiting to hear from my parents who were supposed to be flying home from Vegas...  \n\n\nThat was a long 3 hours...",
   "created_utc": 1692734962,
   "score": 39,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbevhr",
   "message": "Not existing",
   "created_utc": 1692734181,
   "score": 70,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbihhu",
   "message": "Getting dressed for a college interview. Hadn't heard what was happening yet. I was fixing my hair in the bathroom mirror and had just had a random thought about how fortunate I was to have peace in my life when there's so many bad things that happen in the world. Just then I heard my grandmother in the living room say \"they just hit the Pentagon.\"",
   "created_utc": 1692735495,
   "score": 24,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbijak",
   "message": "I was in China with my parents and I visited the great wall that day",
   "created_utc": 1692735513,
   "score": 8,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbtd2m",
   "message": "Going thru the base gate at Andrew Air Force base- they shut it down right after I got thru. Got home to find my husband in tears on the couch watching as the second plane hit the second tower. He was going to war.",
   "created_utc": 1692739535,
   "score": 10,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxblshb",
   "message": "I was renting a car in Cozumel Mexico and the TV in the lobby of the hotel kept saying \"Los Estados Unidos\".  It was my honeymoon.  We had slept in and were going to go goof around that day.   They flipped the TV to CNN roughly the time the first tower came down.  I went back to our room and said \" Pack, we gotta go now \" though I wasn't sure what the heck that was going to do.  They closed the boarders shortly after that.\n\nSo, I spent the rest of the week worried about getting home, among a million other things.   Came home on an eerily empty Carnival Cruise ship the following Monday I think. The State Department had decided to let cruise ships do one way trips just to get stranded Gringos home as they were not letting international flights back in.  Then I got stranded in Tampa for a bit as we couldn't get a flight home and all the rental cars were gone.  I was about 10 min from taking a taxi to the closest UHaul dealer and renting whatever ran to get home when we finally got a flight out of Clearwater.  Continental Airlines just exchanged our tickets or something... we didn't have to pay anything if I remember right.   We had plenty of options on how to get back once we were in the US, but man.... the prospect of getting stranded in Mexico stopped being fun when the money started running out.   Props to the resort though, they let us stay for $35 per night will most of the all inclusive stuff included still.   We drank a lot.",
   "created_utc": 1692736706,
   "score": 18,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbkxrj",
   "message": "I was a child who was in Florida at Disney World. It was my first time at Disney and it was terrifying. Everyone was running out of the park to catch busses back to their hotel because no one was sure what was going to happen next. As a child who had no idea what terrorism was, it was incredibly scary to hear older members of your family in such a panic. I can only imagine how my parents and grandparents felt hearing and seeing the news. My heart goes out to all who lost their lives and to all family members who lost their loved ones ❤️",
   "created_utc": 1692736391,
   "score": 8,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbrpy1",
   "message": "I was ironing pants before work at Radio Shack.  I was watching the news.  When I got to work, my district manager called and said to lock the front door just in case there were more attacks. At Radio Shack. In Oklahoma.",
   "created_utc": 1692738914,
   "score": 8,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbrzfo",
   "message": "I was in 1st grade. Our principle came over the intercom and said we couldn't have recess that day, so naturally the whole class got pissed. \nMy mom came and picked my sister and I up early from school. She was frazzled and told us the twin towers had been hit. I, not knowing what that was, couldn't quite understand why she was so upset. \nWe got home and my mom turned the news on. We watched the footage for the rest of the day. I watched one of the towers fall live. \nHindsight being what it is, idk if an 8 year old is mature enough to see that, but can't take it back now.",
   "created_utc": 1692739014,
   "score": 16,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbx5md",
   "message": "Waking up to the news of the first airplane crash...then watched in horror as the 2nd plane hit and the reality of what just happened sunk in.",
   "created_utc": 1692741006,
   "score": 6,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbhsfe",
   "message": "I was in anatomy class wrist deep in a dead cat. My professor had the radio on and the news came across. We all stopped working on our cats and gathered around the radio to listen. Once class was over I just went home because I didn't feel like going to anymore classes (they all got canceled anyways) and just watched TV and cried.",
   "created_utc": 1692735239,
   "score": 11,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbsphd",
   "message": "I was helping out another office in Savannah, GA.  I heard the news that a plane had just hit a skyscraper in NYC.  Once we figured it was serious, we all gathered in the break room with our managers watching it all.  I then called my daughter’s mom who was a flight attendant to make sure she was safe.  Our boss knew we were not in the mood to go out and make sales calls, just like our clients were not interested in hearing from us.  I left, filled my car with gas and headed back to the hotel to watch the rest of the days news in my hotel room.\nI subsequently learned in my home office, when the manager there was told of the news, his words were that “people die every day. Go back to work.”",
   "created_utc": 1692739286,
   "score": 6,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxc1qfk",
   "message": "I was 11. Was at school when the planes hit. I even stayed somewhat longer to play soccer on the playground next to school. My mom was watching the news when I came home from school around 4 pm. I saw the collapse of the first tower happening. We watched the rest of the day. (I'm from the Netherlands, 6 hours later than NY-time).\n\nAlso, I don't know if you Americans know this, but here in NL 9/11 also is a collective memory-thing. All the people I know and who were alive at that time can tell where they were when it happened.",
   "created_utc": 1692742844,
   "score": 6,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbp4so",
   "message": "I woke up early to finish homework that was due for 11th-grade chemistry when I signed onto AIM to send my lab partner the file and he told me to turn on the TV.",
   "created_utc": 1692737941,
   "score": 12,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbjv4r",
   "message": "Resting in a ballsack",
   "created_utc": 1692735998,
   "score": 20,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbnfho",
   "message": "I was in college.  My first class that day was at 11 am.  I got up and while getting ready I turned on the TV.\n\nI saw the WTC on fire (I had the sound off) and after a moment of watching i saw the 2nd plane hit.  I turned up the sound and realized that this was not an accident.  I popped a tape in the VCR and hit record and left.\n\nI went to the campus and there were large signs up that all classes were cancelled.  I decided to go to the pub that was on campus (and rub by the bartending students) because they had satellite TV.  I usually avoided the place because of the crowds and noise.  On this day the place was dead silent but for the TV that was playing.  It was eerie.  I went back home thinking WW3 was about to start.",
   "created_utc": 1692737310,
   "score": 6,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbu2m2",
   "message": "I put my first grade daughter on her school bus and went to work in my clay studio at home. I had a small tv and shortly after 9 , the news began reporting. I went outside and saw three of my neighbors whose husbands worked at the Pentagon. While we were talking, we heard the sirens from the Pentagon hit. We are 6 miles from the Pentagon. My neighbors were extremely upset and couldn’t reach their husbands. I drove to my daughters school and bought her home. My husband was stranded in DC , No bridges out. I brought my daughter home, she wanted to watch Alladin. I watched the news upstairs on tv. My husband made it home. That night, we had the windows open, all flights were suspended and I had never heard such an eerie quiet that night or since.",
   "created_utc": 1692739804,
   "score": 5,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbf94o",
   "message": "I was standing at the customer service desk at Sainsburys serving customers although it was a pretty quiet day. \n\nA customer said to me that a plane had hit a skyscraper in America and I thought he meant a light aircraft of some sort. \n\nWhen to the cafeteria on my lunch a few minutes later and saw that the second plane had hit the second tower and all the staff were just stood watching the TV in silent horror like a bunch of statues.",
   "created_utc": 1692734317,
   "score": 9,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbhxnt",
   "message": "I was an intern in a company in Paris. I noticed people started congregating in the hallways and eventually a colleague came to me and told me the news. Later on my way home by bus, I noticed a friendly stranger that I had regularly met at the bus stop in the mornings, and we had always said hi. That evening, we decided to get off the bus and grab a coffee and talk about what had happened. It was an interesting conversation, as he had a Middle Eastern background and therefor was not necessarily on the side of the U.S., like all the other white Europeans I talked to before and after.",
   "created_utc": 1692735293,
   "score": 9,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxcgp0h",
   "message": "I remember I skipped school that day. Went downtown to just spend the day screwing around with a friend of mine. Walked into an electronics store to buy batteris for my Discman and it was on every single TV. A wall of TVs showing the burning tower. Watched the second plane hit live and understood the world was changing in irrevocable ways. What I remember most about it though were the days and weeks after. You could tell everyone was deeply wounded, but the level of true patriotism and love for your fellow Americans was off the charts. Damn shame we can't be like that any more.",
   "created_utc": 1692749133,
   "score": 8,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxclx26",
   "message": "I was in an office in the US Capitol.  A tv was showing the the damage from the first plane, and we watched as the second plane hit.  Within a minute, guards were screaming at us to get out of the building.  It was sheer panic as people ran for the exits.  \n\nThe streets were jammed with police and military vehicles.  I couldn’t call anyone to tell them I was alright because the cellular network was overwhelmed.  I walked to a friend’s house and we spent the rest of the day watching TV in horror.\n\nI live my life knowing that if not for the passengers on Flight 93, I’d likely be dead.",
   "created_utc": 1692751378,
   "score": 9,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbfr7v",
   "message": "Rolling around in my nappy",
   "created_utc": 1692734497,
   "score": 4,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbhnmv",
   "message": "Getting ready for school",
   "created_utc": 1692735190,
   "score": 4,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxblhac",
   "message": "Working my first corporate job out of college, which I hated. Remember watching the 2nd plane hit live and thinking \"fuck, life is too random and short\". \n\nQuit my job and moved to Colorado to be a snowboard bum.",
   "created_utc": 1692736592,
   "score": 5,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbp8mn",
   "message": "Sitting at work in Boston when someone ran into my office to say “go to cnn!’\n\nThat was a weird morning. I don’t think I can recall something so ‘big’ happening in my adult lifetime. The challenger comes to mind, but of course that was an accident. Well, “accident”.",
   "created_utc": 1692737980,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxc55c8",
   "message": "At work. A close friend and former colleague worked in Tower 2. I had visited NYC a couple of months earlier and over lunch she told me that she and her husband were expecting. I knew this was a big deal for them, and I was super excited for her. \n\nWatching the attack from the office, I recall like it was yesterday, calling her cell phone and leaving a message to “just let me know you are okay, when you get the chance.”\n\nIn the following weeks, I found out that she had managed to get down the stairs (from the 102nd floor) and was being treated (she was five months pregnant) when the building came down. \n\nBad times.",
   "created_utc": 1692744261,
   "score": 4,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbf4pu",
   "message": "Watching it all live on tv",
   "created_utc": 1692734272,
   "score": 7,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxblr3s",
   "message": "My ex-gf had come over the night before to give me, um, a belated birthday present.  \n\nWe're having a lazy morning, since we stayed up late.  Phone rings, I answer.  It's my best friend and he's like, 'Turn on the TV!'\n\n'What channel?'\n\n'It doesn't matter...\"\n\nWe spent the rest of the morning watching.",
   "created_utc": 1692736692,
   "score": 8,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbfpgf",
   "message": "I had just come home from burying my Grandpa. I got home late at night and was in bed when the first plane hit. My buddy called me after the second plane hit, and I got up and turned on the T.V. About five minutes later the second tower came down.",
   "created_utc": 1692734480,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbglv2",
   "message": "I Was a baby living only blocks from the World Trade Center from what I heard people thought it was a series of terrorist attacks(Which it was) majority of lower Manhattan covered in smoke and hurt people running around, people panicking and not knowing what to do.",
   "created_utc": 1692734808,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbhg84",
   "message": "Deciding to join the Marine Corps",
   "created_utc": 1692735117,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbssg8",
   "message": "High school",
   "created_utc": 1692739318,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxc31af",
   "message": "Getting ready for school in 4th grade. Still went to school. California",
   "created_utc": 1692743380,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxc5g9g",
   "message": "I was living in the Pacific Northwest in sixth grade at the time and I was making Eggo waffles when my mom and I watched the second plane hit on TV. She was on the phone with Grandma when it happened. \n\nWe still had a school day that day and being a Catholic school we all knew that we would have mass that morning. We didn't even take off our coats when we got inside the classroom, we just set our backpacks down and waited while our teacher took attendance. By this point both towers had collapsed, the Pentagon was hit, and there were sketchy details about a plane crashing in rural Pennsylvania. \n\nAfter mass our principal ordered no homework for the week and for the teachers to explain what was going on in an age appropriate manner because \"we are witnessing history today\". We spent most of the morning just talking about it. Eventually class was dismissed, we all went home, and I watched the news the rest of the day.",
   "created_utc": 1692744388,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxca7oh",
   "message": "I was on the rifle range. It was basic training.\nDrill Sergeant called a cease-fire and said that we were under attack.\nWe spent the rest of that day going in shifts into the COs office to watch clips of what happened on the news.",
   "created_utc": 1692746376,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxcckpx",
   "message": "In me ma's fallopian tubes",
   "created_utc": 1692747375,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxcedat",
   "message": "I had just moved to Maryland from California. I dropped my kids off at school. I stopped at Starbucks \u0026amp; while I was waiting on the drive thru, I received a text from a friend that worked in news radio saying reports indicated a small plane hit the New York Trade Center.\n\nWhen I got home 10 minutes later \u0026amp; turned on the news, I realized something far more serious was happening. \n\nI immediately called my husband who was thankfully in California on business. He worked for a NY City based law firm.\n\nShortly, the second plane flew into the second tower. Then the Pentagon was hit. \n\nI knew the US was under attack. I rushed to pick up my children from school, as well as my niece \u0026amp; nephew who were in school nearby \n\nIf we were going to die, I wouldn't leave them to die alone.\n\n9/11 was every mother's nightmare.\n\nI am emotional even as I write this. Scariest day ever.",
   "created_utc": 1692748138,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxcejb6",
   "message": "Schofield Barracks Hawaii, 25th infantry Division... my phone began ringing in my barracks room a bit after 4 am. My First Sergeant was on the phone and told me, \"Red Corvette, Red Corvette, Red Corvette... this is not a drill. Get 'em up.'\"\n\nI was a single sergeant living in the barracks, so I was one of the ranking individuals in there. We were on red cycle, which meant we had to be ready for deployment anywhere in the world within 24 hours. (We had bags already packed and so on.) I flipped on the TV, because I figured something had to be happening, saw what was unfolding and started going door to door, getting everyone geared up, down to the arms room and out to formation.\n\nThere were all sorts of rumors of various attacks all over the US. Eventually, everyone was present, and we were addressed by our commanding officer. I still have the notebook, where I was taking down the instructions of the day. Here is an excerpt: \" ...due to the possibility of continuing attacks, USARHAW (US Army Hawaii) and all associated entities will immediately go to Threatcon Delta until further notice...\"\n\nAfter that, well, let's just say it was a very full day.",
   "created_utc": 1692748210,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxchl9h",
   "message": "putting my hair and my skin out, furiously trying to call my husband at work once I got home to tell him that we would be staying at our flat in Yonkers rather than the one in Hell's Kitchen because of the grid being gone.  And I asked him to pick up two large aloe vera plants so we could blend some into a paste so that I could heal from all the burning debris that fell on me while I was escaping.",
   "created_utc": 1692749522,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbeuod",
   "message": "poo pee in the nappie",
   "created_utc": 1692734172,
   "score": 7,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbg22p",
   "message": "Beeing 6 year old . . . so probably playing on my Nintendo 64.",
   "created_utc": 1692734607,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbevgc",
   "message": "Flying a plane",
   "created_utc": 1692734180,
   "score": 7,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbkaao",
   "message": "I was at school in NYC. I was aware that something serious had happened, but didn't really understand until my dad showed up in the middle of the day to pick me and my siblings up. We walked about 4 miles home, because nobody knew if the subways were safe.\n\nBeing a conspiratorial liberal, my dad kept saying that he bet this was all about Bush and oil. For once he turned out to be more or less correct.",
   "created_utc": 1692736153,
   "score": 10,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbev3n",
   "message": "Having my 6th birthday",
   "created_utc": 1692734177,
   "score": 6,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbeykz",
   "message": "In 6th grade. Had no idea it happened. The teachers kept us in the dark until it was time to leave school. I remember EVERYTHING after leaving school though.",
   "created_utc": 1692734211,
   "score": 3,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbfmme",
   "message": "Getting ready for work at a high school. Woke my wife up, came to work and set up the TV/antenna. This is what we are doing today",
   "created_utc": 1692734452,
   "score": 4,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbhsv2",
   "message": "Getting ready for school in the morning when everything started happening. My Dad had the news on. Got to school and my first class was shop. The shop teacher had the TV on and said “there’s more important things than shop class going on right now”, and we all sat there and watched the live coverage in disbelief.",
   "created_utc": 1692735244,
   "score": 5,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbg18p",
   "message": "Sitting at home watching TV changed channels then ALL the channels had the same thing. I worked at PetSmart at the time, and  I had to go in and work 4 hours that night due to having done inventory that past weekend. \n\nThat was a shitshow and a half. We were under the glide path of the airport AND in a mall complex. I think I wound up working an hour or so and they closed the mall complex for 2-3 days over it.",
   "created_utc": 1692734599,
   "score": 5,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbfid6",
   "message": "Playing Red Alert 2 (over LAN) with a friend, grandma calls, tells something about an accident in America, turn on TV, just as plane 2 hits and it turns out not to be an accident. Watch TV for the rest of the day.",
   "created_utc": 1692734411,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbfyjb",
   "message": "Working.",
   "created_utc": 1692734571,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbha3c",
   "message": "Watching VH1 top 100",
   "created_utc": 1692735054,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbikg3",
   "message": "Attending college.  Walking between classes when I found out.",
   "created_utc": 1692735525,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbj5b7",
   "message": "Driving to Calais, Maine.",
   "created_utc": 1692735735,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbjwzv",
   "message": "Most likely having dinner or watching TV. Was around dinner time on a weekday for my location then.",
   "created_utc": 1692736017,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxblz2i",
   "message": "My wife and I were in Memphis. I was a cop, my wife a flight attendant and I have brothers that are also cops and firemen. My four year old daughter thought everyone was dead, because we couldn't get through on the phone. Got home three days later via Greyhound bus.",
   "created_utc": 1692736773,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbmh5z",
   "message": "I had class that morning. Heat Transfer. It was a 2 hour class that started at 8am. The first plane hit WTC North at 8:46am. During the mid-class break right around 8:50, i wandered out into the lobby, and people were just starting to talk about the news that a plane had hit the World Trade Center. At the time it seemed like it was just an accident - no one knew anything about what type of plane it was or anything at that point. \n\nHeaded back to class to re-start at 9, and had no idea that the second plane hit WTC South at 9:03 until we got out of that class. I don't even remember how we found out classes were cancelled for the rest of the day, but they were. \n\nI drove home, everything was just eerily quiet. My roommates were both working that day, so i just sat there by myself watching news all day.",
   "created_utc": 1692736958,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbmzdl",
   "message": "Sitting in my third grade class wondering why we kept hearing about teachers being glued to the TV and looking out the window. We were in Queens and from certain vantage points could actually see smoke coming from Manhattan.",
   "created_utc": 1692737145,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbnmnu",
   "message": "Woke up, saw the news on NBC, went to work in downtown DC.",
   "created_utc": 1692737383,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbnn3l",
   "message": "Going to college and working part-time at some call center that gave customer service to a cellphone company. I found out about whole thing when I clocked in to work and some of my coworkers started getting calls asking for help from people in Ground Zero. It sucked.",
   "created_utc": 1692737388,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbphuc",
   "message": "School and working.  I literally didn't know about it until 2-3 days later . I had even seen footage of the planes hitting while barely paying attention.  Thought it was some random movie trailers or something. Listend to people talk about going to war. Mostly ignored it . Was sitting with my dad watching the news one day and they're talking about it.  It finally dawns on me . \"HOLY SHIT THIS IS FOR REAL!??!\"\n\nIn my defense, I was a moody teenage loner who kept to himself.  Was more focused on whatever book I was reading.  I was reading Hearts In Atlantis btw.",
   "created_utc": 1692738076,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbqeaj",
   "message": "I was at home  \u0026amp; reviewing Algebra  for my high school  test.  I'm from India.",
   "created_utc": 1692738419,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbqh9m",
   "message": "5th grade in class",
   "created_utc": 1692738449,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbqlov",
   "message": "Riding in an elevator on my way to the office and someone said a plane hit one of the towers. 😥",
   "created_utc": 1692738495,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbti99",
   "message": "In the hospital because my little brother had had an asthma attack earlier on. I was too little to understand what had happened but all the hospital staff stopped working and watched the news, so I knew it was a big deal. Not American but it was still big news in Ireland.",
   "created_utc": 1692739589,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbw63b",
   "message": "Wife and I were at city hall getting out marriage certificate, then got a call to head to the fire station and be on standby. About three hours later I was gathering my gear, dog, and saying goodbye to my future wife as I loaded on a bus with Task Force 1 for search and rescue operations",
   "created_utc": 1692740618,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbya2u",
   "message": "I was actually in Reno with my father, sister and her boyfriend for my 21st birthday. We were supposed to fly out around noon PST on 9/11.\n\nWoke up to the news of the first plane, watched the 2nd plane on TV then all flights were grounded.\n\nThey closed the airport, and that's where ALL of the rental cars were. We were stuck for two additional days until we found a car rental place open, and then drove home to Seattle.\n\nFor two days, we all just found quarter slot machines and would play one quarter per spin while watching the news. The hotels were accommodating and gave us a discount since we were stuck, but it's a memory I'll never lose.",
   "created_utc": 1692741451,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxc3o2m",
   "message": "In work in Ireland. An American colleague rushed in to the smoking area in a panic. Planes are doing kamikaze attacks in Newyork, the world trade centre is in flames. \n\n\"Good\" said one of the smoking gang. Then we all laughed. Good Times. \n\nTill i got home and watched the news. Then it hit me. This terrible news is the best news I have ever seen. Not because what happened was a good thing, but tv will never be that gripping again.",
   "created_utc": 1692743643,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxc3swu",
   "message": "Driving a plane",
   "created_utc": 1692743700,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxc6jx3",
   "message": "At work. Had Howard Stern on the radio. Gary Del’abate interrupted to say that a plane had hit one of the twin towers. We turned on a TV in the conference room to see the second tower hit live.",
   "created_utc": 1692744844,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxccb9s",
   "message": "My mother burst into my bedroom and yelled \"Get up and watch the news\" and left, closing the door behind her without saying another word. I stumbled into the living room just in time to see the 2nd plane hit.",
   "created_utc": 1692747263,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxcdxm2",
   "message": "Getting ready for work, then at work. In shock all day.",
   "created_utc": 1692747954,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxci3ke",
   "message": "Sleeping",
   "created_utc": 1692749743,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxckt58",
   "message": "Working at the mall.  12-10, ended up closing at 1.  No amount of explanation will ever describe that feeling.  I wish we could unite as a nation like we did in that moment.    Never have I seen everyone being so friendly and comforting to every stranger they came across, it was actually beautiful.",
   "created_utc": 1692750901,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxcq0f2",
   "message": "I was 16 and asleep when the planes hit because I was on the west Coast.  My mother woke me up with her 'gentle voice' telling me to come look at the tv.  That voice is usually reserved for telling me when someone in our family has died or has a terminal disease so I was immediately alert and on edge.  I'll never forget her tone and what she said:  \n\"You will remember this for the rest of your life\".\n\nIt's very difficult to describe how that moment felt to people that were not alive or old enough to remember it.  It was very primal feeling of being under attack as a group and thus feeling much closer to the group because of it, and the vast majority of Americans felt it.  It sounds melodramatic but it's not something you can empathize with unless you have personally experienced it.",
   "created_utc": 1692753153,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxcq3j6",
   "message": "Getting ready for work. I worked at a Christian bookstore / educational supply store. When I got in that day, the secretary was convinced it was the rapture and that the pilots had disappeared.",
   "created_utc": 1692753191,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxcr6xn",
   "message": "I was at Sea-Tac Airport (Seattle) checking in for my flight when the PA announced all domestic flights have been grounded by the FAA due to ongoing attacks on the east coast… I turned to the stranger next to me and said “this is how disaster movies start” …. Little did I know how right I was",
   "created_utc": 1692753669,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxcrdmx",
   "message": "It was my freshman year of high school. I was in my first period which was computer science. My dad picked me up from school early that day because I had an orthodontist appointment to tighten my braces. I'm from NJ about 30 mins from where the towers were located. On my way to my appointment we saw ambulance flying past us heading to the city. You can get a nice view of the towers depending on where you drive. It was normal seeing the twin towers regularly. I never thought I would never see them again. I also remember seeing a trail of smoke that lasted for days.",
   "created_utc": 1692753750,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxcsm07",
   "message": "I was in college in Lincoln, NE. Everyone was flipping out in a typical fashion of the whole country, but then Aif Foce 1 flew into Offit AF Base flanked by fighter jets 500 feet off the ground. \n\nIf you don't know, that base is where legend has it to have a 300-foot deep bunker with the button to send nukes. Everyone really shit when word got out that they brought W. to the apocalypse bunker. People immediately started hording gas, and it went to $5 a gallon. If you remember, it was a $1 back then.",
   "created_utc": 1692754294,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxcuq8f",
   "message": "I’m ex Military, I was home on leave from the Golan Heights. I watched the second plane hit.",
   "created_utc": 1692755238,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxcvggm",
   "message": "Grade 3, Gander Newfoundland. We were in the computer lab when we were told. I remember getting to go home early because of what happened.  42 planes were diverted to Gander when all of North America's airspace was closed . I remember my mom taking my brother and I to our school to help with the laundry for the people who were stranded in Newfoundland. It's beautiful how amazing and kind people were. Made me so proud to live in Newfoundland!",
   "created_utc": 1692755564,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbibee",
   "message": "I was sleeping through my morning computer science class when it happened.  My other classes were canceled that day.",
   "created_utc": 1692735433,
   "score": 4,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbeydc",
   "message": "Working at an office that was promptly evacuated after the 2nd plane hit",
   "created_utc": 1692734209,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbfhad",
   "message": "I was in school",
   "created_utc": 1692734400,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbfjsy",
   "message": "I was having an operation in hospital",
   "created_utc": 1692734424,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbg64y",
   "message": "Working. It was such a surreal experience.",
   "created_utc": 1692734649,
   "score": 2,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbf5xu",
   "message": "I was in 8th grade communications.",
   "created_utc": 1692734285,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbg0bt",
   "message": "Wasn’t born yet",
   "created_utc": 1692734590,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbhsle",
   "message": "I was in first grade at school. My mom decided we were safer at school.",
   "created_utc": 1692735241,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbp9iv",
   "message": "Wasn't even a sperm cell in my father's balls",
   "created_utc": 1692737989,
   "score": 255,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbq6mo",
   "message": "Hanging in my dads ballsack",
   "created_utc": 1692738338,
   "score": 255,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbrb9e",
   "message": "Marinating in my dad's balls",
   "created_utc": 1692738763,
   "score": 255,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbt3w4",
   "message": "In my dad’s ball sack",
   "created_utc": 1692739438,
   "score": 255,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbup6m",
   "message": "I was non-existent.",
   "created_utc": 1692740047,
   "score": 255,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbs9q7",
   "message": "I . . . was . . . not alive.",
   "created_utc": 1692739122,
   "score": 0,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxc1ckg",
   "message": "I was not even born.",
   "created_utc": 1692742687,
   "score": 0,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxc1ebl",
   "message": "Moving into a big town for my mom going to college and the moment we get the tv hooked up to the cable and I’m ready to watch cartoons it’s all over the news and we drive all the way home watching planes land",
   "created_utc": 1692742707,
   "score": 0,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxc4kpn",
   "message": "Satan was creating me for 2008",
   "created_utc": 1692744022,
   "score": 0,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxcl2b4",
   "message": "managing two Minneapolis City Council campaigns \u0026amp; it was primary election day",
   "created_utc": 1692751011,
   "score": 0,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbn2ck",
   "message": "⬜",
   "created_utc": 1692737176,
   "score": 255,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbp205",
   "message": "not being born yet",
   "created_utc": 1692737911,
   "score": 255,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbwgxy",
   "message": "I was really busy not existing",
   "created_utc": 1692740736,
   "score": 255,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbz8lx",
   "message": "Probably still sitting in my dad's bollocks",
   "created_utc": 1692741834,
   "score": 255,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxc1j1q",
   "message": "Being unborn",
   "created_utc": 1692742762,
   "score": 255,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbf6qo",
   "message": "playing gta",
   "created_utc": 1692734292,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbg980",
   "message": "I was in 2nd grade of primary school",
   "created_utc": 1692734681,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbgh6z",
   "message": "I was at school. There were rumours going around that something really bad had happened but there were no smart phones to look it up and the teachers were keeping it all quiet and refusing to say anything. \n\nIt wasn’t until I got home in the afternoon that I found out what had happened.",
   "created_utc": 1692734760,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbkdx1",
   "message": "I was 8 and home from school with a stomach bug I remember my mom getting a call from my dad telling her to turn on the news and at first getting upset she switched channels",
   "created_utc": 1692736190,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbknma",
   "message": "I was a junior in high school, saw the second tower fall during AP Biology class and got out of school early during English. Then like everyone else I was glued to the TV for pretty much the whole day.",
   "created_utc": 1692736287,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbkqj7",
   "message": "Was in year 8 at secondary school. They stopped our history class to tell us, then we all got sent home. My friend's mother worked at a national newspaper and when she picked us up she was glued to the radio in the car. Pretty surreal when I think back.",
   "created_utc": 1692736317,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbktv9",
   "message": "Working in Virginia",
   "created_utc": 1692736353,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxblabk",
   "message": "Driving across a bridge on my way to school. I remember everything about the moment it came on the radio.",
   "created_utc": 1692736521,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxblstw",
   "message": "I was in school. A friend had a dentist appointment and came back into school saying that a plane hit the WTC. Then he said another hit the WTC. Something was off. Came to find out later why.",
   "created_utc": 1692736709,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxblwef",
   "message": "Probably shitting my diaper or something, considering i was 1 year old at the time",
   "created_utc": 1692736745,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbng3m",
   "message": "In second grade.  A teacher runs in and tells my teacher to turn on the news.  As she did the second plane hit.  We finished the day but we had to wait in the gym not outside on the sidewalk for our parents to pick us up.",
   "created_utc": 1692737316,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbnrlo",
   "message": "Asking my mum to put my tv show back on",
   "created_utc": 1692737434,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbo06n",
   "message": "I remember watching the news footage of 9/11 live while I was in the first grade. I remember the para breaking the news to our classroom, and the teacher lining us all up to go to the library to watch the event on TV. \n\nStill one of the creepiest days in school… just hearing the whispers of everyone saying “somebody crashed a plane into the World Trade Center”. It was very unsettling. I remember a 6th grader picking on us underclassmen by saying things like Iran is behind it, and Iran planned on bombing/ shooting up every school in the US. \n\nNeedless to say, I was scared as hell to go back to school then. Lol",
   "created_utc": 1692737521,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbo275",
   "message": "It was my 1st semester in college, west of Philly (wcu), and my GF at 801 called me to wake me up and put on TV, I asked what channel and she said it didn't matter.... The ROTC guys got dressed and rolled out of campus in camo Humvees to muster.  I was mentally prepared to take up arms and go.  Also my professors didn't cancel classes that day, unless it was excused for obvious reasons, to maintain normalcy.",
   "created_utc": 1692737540,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbo4t5",
   "message": "4th grade, talking to classmates. teacher was huddled in the corner with a radio. I remember thinking it was strange that nothing was happening.",
   "created_utc": 1692737567,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxboiw2",
   "message": "Everybody got over that weird sound in homeroom and went to first period. Then we all went to the basement with no information about why we didn't have school that day. We waited for our parents to come pick us up one by one and walk home very nervously.",
   "created_utc": 1692737714,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbolvq",
   "message": "Working at a newspaper. I don't use a radio in my car, so I didn't find out the news until I got to work. Everyone was crowded around the TV, crying or looking shocked to the core.",
   "created_utc": 1692737744,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbom2o",
   "message": "nothing unusual i swear",
   "created_utc": 1692737746,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbotox",
   "message": "First day of elementary school",
   "created_utc": 1692737824,
   "score": 1,
   "submission_id": "15ygmw5"
  },
  {
   "comment_id": "jxbovmr",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ygmw5"
  }
 ]
}