{
 "submission_id": "15yyeb9",
 "title": "What is something your teacher did in school that you’re still salty about?",
 "selftext": "",
 "created_utc": 1692781854,
 "permalink": "/r/AskReddit/comments/15yyeb9/what_is_something_your_teacher_did_in_school_that/",
 "score": 1,
 "url": "https://www.reddit.com/r/AskReddit/comments/15yyeb9/what_is_something_your_teacher_did_in_school_that/",
 "comments": [
  {
   "comment_id": "jxejdqx",
   "message": "Threatened to hit me when, as a brand new mid-term transfer in Grade 3, I was too scared to speak to ask for her help, so I had tapped her on the arm instead to get her attention. Apparently, that warranted threatening to assault an 8 yo in the 90s.\n\nI had been there less than 2 weeks and had just transferred from a school of 40 to a school of over 200.",
   "created_utc": 1692793628,
   "score": 98,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxen8aw",
   "message": "20 years ago, we had to make a diorama.  We all had them sitting on tables in the classroom and one day some other kid was messing around, fell into the table and smashed mine.  I failed the assignment for having a smashed diorama.",
   "created_utc": 1692795460,
   "score": 43,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxepkgs",
   "message": "In middle school I did a display with real fossils that my parents had let me borrow. The teacher was insistent that I sell the fossils to him. But I refused.\n\nSo the teacher gave me an F on the display.",
   "created_utc": 1692796516,
   "score": 142,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeclgo",
   "message": "I had a teach accuse me and a classmate of cheating on an exam because we had the same answer. It was a multiple choice test and she was upset we both had it correct.",
   "created_utc": 1692790057,
   "score": 135,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxee8fa",
   "message": "Never gave my art a higher grade than a B+. Even though she asked me every year if she could hold my art back, to show everyone how to correctly apply a technique or what she wanted from everyone else that next year. Not good enough for an A, but this is perfect and it's what I want everyone to do. Which is it then? Bitch.",
   "created_utc": 1692790966,
   "score": 219,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe9tbe",
   "message": "At the end of my first week at a new school, the teacher handed out slips of paper with our current grade. I had a solid A at my old school, but the teacher said I had an F. I asked her why. She said I didn't hand in the quarter project. I reminded her I had just moved to the school. She said we would give me the weekend to do it. The project was to interview a longtime local resident and write a paper about their experiences. The articles were being collected for a book she was \"writing.\" I failed the class.",
   "created_utc": 1692788389,
   "score": 184,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe81rk",
   "message": "My third grade teacher gave me marks down for spelling 'a lot' which her dumb fuck ass \"corrected\" as 'alot.' I will probably spend the rest of my life still annoyed with her and I'm 36.",
   "created_utc": 1692787240,
   "score": 237,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxem3v2",
   "message": "My English teacher admitted to marking down all my work by a grade because “I think you could do better”.\n\nBitch, I *was* doing better and you made it look like I wasn’t.\n\nCaused me to stop even trying.",
   "created_utc": 1692794942,
   "score": 4,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxei1fv",
   "message": "She told me to get the hell out of her classroom because I forgot to get something signed by my mom. She then marked me as truant and played dumb when the principal got involved.",
   "created_utc": 1692792960,
   "score": 120,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe5dds",
   "message": "I had left my calculator on my desk in physics class and the teacher took it. I had engraved my initials on it so it was unmistakable. My problem with this was that he always asked me during class if I had my calculator and I told him I still couldn't find it. The end of school year comes around and another student was snooping through his desk and found my calculator. All year that asshole was giving me a 0 for the day since I didn't have it.",
   "created_utc": 1692785366,
   "score": 163,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxekchp",
   "message": "One of my high school art classes was called 3D design, which was basically clay, sculpting, and various 3 dimensional art work. On the first day of class my teacher pulled me aside and told me she looked at my schedule which was mostly honors and advanced level classes. She said that because I was clearly such a good student she would grade me on a much harsher scale, and would hear none of my objections that being book smart doesn't translate to artistic abilities. The poor marks I received in that class skewed my GPA.",
   "created_utc": 1692794108,
   "score": 198,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxehoja",
   "message": "Oh my god my cookery teacher! Won’t give her real name, so we shall call her Gordon Ramsey’s grandma, aka GRG\n\nGRG was an old witch who should have retired years ago and had anger issues. She was furious when she learned I didn’t use a gas cooker at home (electric was cheaper) so didn’t know how to immediately fire one up on the first lesson (I was about 10 years old). This woman would BELLOW at me from across the room. As a sensitive, people-pleasing kid I was a blubbering, trembling mess each lesson because I was petrified of making mistakes and her shouting at me. One day i was running behind (I always ran behind) and she took my food out of the oven (cakes on a baking tray) and I reached to grab something and accidentally brushed against her arm.\n\nThis c*nt literally SCREAMED, grabbed my wrist and pressed my palm against the baking tray. The baking tray that had just come out of a 200 degree oven. Only for a split second, didn’t hold it there or anything but it was enough to blister my skin.\n\nOne day I couldn’t face going to her class so I feigned illness and was kept off school. One of my classmates told me apparently during registration/roll call, when they told her I was off sick, GRG LAUGHED and said “no she isn’t, she’s just scared of me”. Nice to see you were so self-aware, bitch.\n\nI never reported it directly but I did tell my mum, who demanded the school did something about it. We had a meeting with the head of year who laughed it off saying “she’s a good teacher, she just doesn’t like the quiet ones”. Nothing was done.\n\nIf the crusty cow is still alive, she’ll be in the Guinness World Records. Rot in hell GRG. You saw a shy kid and instead of building up her confidence and patiently teaching her a valuable life skill, you decided to bully her and drag her self-esteem down to rock bottom’s basement.  It took me ages to learn how to cook because of you. Thankfully I got my confidence back and now enjoy cooking.",
   "created_utc": 1692792776,
   "score": 83,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxee37t",
   "message": "Tried to force me to write with my right hand...",
   "created_utc": 1692790888,
   "score": 48,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxf0i02",
   "message": "I was little, probably kindergarten age. We were near the end of the school year, and we’re having a raffle for gifts to take into summer; the top gift was a hella cool bike and I, being from a very poor family, could only dream of such a thing.\n\nAnyway, a little girl is brought up and is given a bucket filled with slips of paper, upon which were written the names of each student. She stirred her little hands around briefly, plucked a piece of paper, and raised it to the light; I clearly saw my name written in reverse through the light shining overhead, so I new my name had been the first drawn and thus the top prize, the bike, was mine!\n\nWell, the teacher overseeing the draw didn’t like me much because my family was poor, so a second after the paper was raised up she slapped the paper gently out of the drawer’s hand, stirred her own hand around in the bucket, clearly reading the names as she did, and plucked another name. Lo and behold, the new name belonged to the popular classmate with the rich parents! I wish I was fucking kidding. The teacher even maintained eye contact with me as she smiled thinly and the winner scurried up to get her bike. That’s when I knew life wasn’t fair.\n\nFuck you, Ms. Simmons.",
   "created_utc": 1692801019,
   "score": 57,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeknxi",
   "message": "I was on course for getting an A* in IT for my GCSE, meaning I'd be able to do a Web design module for A levels, a month before the submission our tutor managed to lose every single piece of coursework for the entire class. Ended up with a U, and had to spend the first semester of college doing a level 2 IT course instead of Web design. 21 years later and I'm still pissed about it",
   "created_utc": 1692794261,
   "score": 5,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe9ijh",
   "message": "In grade 4 my teacher kept making me redo my printing sheets because my handwriting wasn't neat. Eventually I asked him why he didn't make any of the boys redo their sheets because they had messy handwriting too. I still remember the look of shock on his face but didn't understand the significance at the time because I was just genuinely asking. I don't remember what he said afterwards other than the fact that I didn't find his answer satisfying.",
   "created_utc": 1692788196,
   "score": 94,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxelq7g",
   "message": "I had really severe eczema on my hands as a kid. I used to keep them tucked up in my sleeves to avoid 1 people seeing them and 2 getting blood on my paper - yes, it was that bad. She called me out during a test and said to take my hands out of my sleeves because “it’s not like that’s gonna help my grade.” I was a shy kid and silently cried through the rest of the test. Also, I was a straight A, gifted student, so why she was acting like I had poor grade I never knew. I’ll never forget that woman being needlessly cruel to a child who was already in physical pain",
   "created_utc": 1692794762,
   "score": 7,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeao4f",
   "message": "A commonly relatable reddit scenario; typed out an essay in class while we were in the computer lab, yet upon printing and handing it in I was accused of plagarising it.\n\nDon't even remember the teachers name as she was one of the other staff teachers substituting for the regular one, just the shrill accusatory tone of her going \"YOU DIDNT WRITE THIS!?\".\n\nFuck you Miss whoever you were. I worked diligently on that bullshit.",
   "created_utc": 1692788923,
   "score": 173,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe0xe2",
   "message": "She gave me detention for chewing gum. I didn’t even enter the classroom when she did this. She smelled mint from my mouth when I said good morning back to her",
   "created_utc": 1692781946,
   "score": 203,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeln88",
   "message": "Alright, so this is something that really had me PISSED OFF as a kid, and every time I think about it I get fired up. \n\nI was in 3rd grade. The 2nd, 3rd, and 4th grades were doing a week of square dance, than at the end of the week on friday, we were going to have a recital and do a performance. \n\nSadly, I was leaving for vacation and that would be starting that friday, so I couldn't be in the recital. Oh well, I could still enjoy the square dance and have some fun with the rest of the classes, right??\n\nNO\n\nMy teacher made me sit in the classroom alone, while everyone was across the hall in the big classroom doing the dances. She made me do FREAKING VOCABULARY WORDS FOR HOURS while I had to sit, in a darkened room, alone, listening to the muffled sounds of Cotton Eyed Joe, stomping, and laughing coming from the hallway. \n\nI was so pissed. I was crying every day. I begged her to just let me sit in there. I offered to clap, help with music, hold up a sign, just sit in the corner, ANYTHING, to be a part of it. \n\nBUT NO. I had to sit alone, no lights, and do vocabulary words with tears just running down on the the paper. For 4 days straight. She basically punished me with in school suspension for not being able to be at the recital due to my family vacation. \n\nI FREAKING HATE THAT BITCH TO THIS DAY",
   "created_utc": 1692794725,
   "score": 128,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe8ar5",
   "message": "I was about 9 years old and she wrote our language's word for \"ceremony\" on the blackboard. She spelled it with an S, like \"seremoni\", and I raised my hand and asked if the word should not in fact be spelled with a C. She argued that she was quite sure it actually was an S, and wouldn't back down, even though I was absolutely sure (I read a lot of books as a kid and had read the word in my native language multiple times). Of course I looked it up after the class, and it turned out I was right. Still haven't forgotten, 20 years later. I guess she didn't want to lose face in front of a bunch of kids.",
   "created_utc": 1692787407,
   "score": 159,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe2ptw",
   "message": "High school psychology teacher ”evaluated” me in front of the whole class as ”mentally troubled” and told everyone that I’m ”an undiagnosed ADD-case with 99% certainty”. And because she was a psych teacher, everyone took her word for it. \n\nYeah, thanks for making everyone think I was mental throughout high school and giving me nagging self-doubts if I really did have ADD for most of my 20s, until I got that medically ruled out.   \n\nI wasn’t always the best behaved kid and even back then I understood that, but that was pretty harsh of her.",
   "created_utc": 1692783360,
   "score": 122,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxehqlz",
   "message": "Math bitch decided to take me to one task, I had to solve it in front of my whole class. I did, I was pretty confident the answer was correct.\nThen she checked it, went full crazy mode and made fun of me for about 5 minutes, called me silly words and rewarded with juicy bad grade. \n\nThen she proceeded to show my class how it should be done. \nShe did it exactly the same, just like I did 5 minutes earlier.\nSome of my classmates told her about it. \nShe was like “oh, y’all distracted me”. \nShe never spoke to me directly after that",
   "created_utc": 1692792805,
   "score": 153,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeikjg",
   "message": "The teacher wouldn’t let me go to the med bay when I was having the worst fucking headache of my life. “What are they gonna do” I don’t know, maybe treat me, it’s their job. (The nurses were actually good at their job.)",
   "created_utc": 1692793226,
   "score": 230,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxehaba",
   "message": "when i was in 7th grade my history teacher sent me to the headmaster’s room because i was DRAWING. (he never sent people out of the classroom even if they were in their cellphones + another kid was drawing RIGHT IN FRONT OF ME, he saw it and didn’t do anything)",
   "created_utc": 1692792573,
   "score": 82,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxegnw2",
   "message": "I'm half deaf, I was in social studies class, my teacher asked me a question, didn't hear her I said \" what\", she yelled at the top of her lungs \" will you fucking listen!\"\n\nAfter that day I told her, once she dies I plan on pissing on her grave, I still plan on doing that",
   "created_utc": 1692792255,
   "score": 84,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxenp8n",
   "message": "When I was in second grade the teacher slapped my arm because I went to her desk to ask her a question. That was sixty years ago.",
   "created_utc": 1692795676,
   "score": 143,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeqqa4",
   "message": "My final year of secondary school I finally buckled down and started really making an effort to correct both my grades and my behavior (I was an immature little shit back then).  Every teacher recognized it, my report card was basically full of compliments about how much I'd improved.  Even my headmaster wrote a really nice paragraph about how proud he was, and that guy only gave compliments if you really earned them.  All except for one teacher, I quote: \"\\[Zerbey\\] would rather play with computers than concentrate on school work\".\n\nI passed her class, I got good grades, I never caused her any issues.  She viewed computers as unnecessary and having no place in education and me spending my lunch breaks in the IT lab as \"playing with computers\".  She'd often come into the lab and berate us for not spending our time doing homework.  I was doing homework!  Some of it hers!  Guess what?  I've been in the IT industry my entire career and \"playing with computers\" never did me any harm. She was just a bitter old teacher who didn't like change.",
   "created_utc": 1692797020,
   "score": 138,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxecmlv",
   "message": "Not the teacher, the school.  When I was 8. I built a legit, fully functional robot for the science fair. In the early 80s. Not to brag but it was nice. I took parts from two remote controlled cars, PVC pipe for the arms, an upside down small trash bin for the body, etc. I lost to some asshole kid that built the (non-working) generic Apollo model rocket that every kid builds. His dad was probably the judge. Louisiana is stupid.",
   "created_utc": 1692790075,
   "score": 12,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxep7a2",
   "message": "Marking me down as present when I was at home sick. When I came back to school I got suspended for skipping every other class. When I argued that I was falsely accused,my suspension got extended. My school had a policy that if you had 9 unexcused absences you would not earn any credits for that year. I was an A student and got zero credits that year. I dropped out of school and got my G.E.D. that fucking guy really fucked my shit up.",
   "created_utc": 1692796353,
   "score": 226,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeoj4x",
   "message": "Math teacher asked the class a question, I confidently put my hand up and gave what I thought was the correct answer. Teacher looks at me and says “Not everything has to be a joke Mark”. That truly crushed my spirit and I never put my hand up to answer another question all year.",
   "created_utc": 1692796052,
   "score": 64,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeqyl9",
   "message": "In about 91, I was starting to get into animals, specifically marine animals. I wanted to be a marine biologist so i thought. Junior year in HS we all knew we had to do a bug collection. So I went on a family trip out of state and collected bugs in preparation. I put a lot of time into it. Mr Cope, the worst biology teacher ever, failed me because “I could not have collected bugs he’d never seen”. Completely shattered my confidence and desire to peruse science of any sort. Fuck you Mr Cope.",
   "created_utc": 1692797119,
   "score": 131,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxequqm",
   "message": "Art teacher tore up a painting of mine because he said I didn’t follow instructions. We were told to paint an underwater scene. I did, but used a lot of orange and red tones and explained that my underwater scene just wasn’t where water looks blue. He didn’t like my answer and tore it up.",
   "created_utc": 1692797072,
   "score": 124,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe0ybu",
   "message": "One of my teachers simply hated my smirk and we got into it in the hallway. He looked me dead in the eye and said I couldn’t do shit cause he was a teacher and then slapped me. \n\nWell jokes on him cause a decade later his wife fucked a highschool student. \n\nFuck you Mr. Marchese. Your wife fucks kids.",
   "created_utc": 1692781965,
   "score": 140,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxew7a6",
   "message": "I had my highschool guidance counselor failed to send out my transcripts to the colleges I attended to.  Caused me to get wait listed on the good schools.",
   "created_utc": 1692799300,
   "score": 237,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe8d6f",
   "message": "The cut off point for getting an A was 80%, so my History teacher gave me 79.9%. He refused to back down, even when my mother put in a complaint to the school, asking what I had done wrong to miss out on 0.1%. He refused to give a reason. Still kind of burns me up when I think of it, because it was so petty. \n\nSigned, a B++ History student.",
   "created_utc": 1692787453,
   "score": 16,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxepbzc",
   "message": "There were a few from this one teacher but two things stand the most.\n\n1. Gave me a 0 on a test because my pencil broke. She wouldn't let me sharpen it, or use another pencil. \"You should have been prepared\" was her reasoning.\n\n2. Would make fun of me for getting an answer wrong. Other students would get a simple \"no\" if they answered wrong, while I would get scolded and 'talked to' for 5 minutes about how I'm so dumb.",
   "created_utc": 1692796410,
   "score": 231,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxel303",
   "message": "In the 4th grade on fridays we were given these little things called Weekly Readers. It was this 4 page kids news paper about animals, volcanos and other kids stuff. On the last page is 4 questions to see if you read it. No big deal and I finished mine in minutes. So I just sat there waiting for others to finish and the teacher called me up to the desk. So I went up there and she told me to go to the office because she saw me cheating. Cheating?? On a weekly reader? So I went to the office and got the paddle for cheating on a test! You know, those wooden weapons that knock the wind out of you and you couldnt sit for a week. I then get home to find my mom and dad pissed because they got a call about me cheating on a test and my dad gave me the belt. It was my first taste of violence and no one listened to me. I was beaten and that day, I lost my trust in society and family and lost my innocence.\nI hope that fat ass teacher died in a fire.",
   "created_utc": 1692794461,
   "score": 162,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxetcof",
   "message": "Grade 4, I hadn’t received my timetable so I didn’t know when PE classes would take place. Showed up with shorts, tshirt and sandals that day.\nDuring the class my teacher made me stand up in front of everybody and basically humiliated me. Asking everyone to judge my outfit if it was appropriate or not for pe class. Said that I was lazy and irresponsible. The whole class laughed and I had to do pe in sandals ( which is the only part I’m like okay fair enough). \n\nYIKES",
   "created_utc": 1692798134,
   "score": 100,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxecdw6",
   "message": "I was studying drama and was really gunning hard to get into drama schools to be a professional stage actor.\n\nFor one reason or another my personal tutor just fucking hated me, she was always harsh and very dismissive. We argued over something in class and she said something along the lines of “you’ll never achieve your dreams of being an actor, you’ll never get anywhere in life.”\n\nAs much as I tried for 3 years I did not get accepted into any of the London drama schools I auditioned for :( I did give up on my dream and studied Eng Lit instead.\n\nShe was right. But boy was she a bitch.",
   "created_utc": 1692789936,
   "score": 29,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxf9x37",
   "message": "My high school physics teacher was a sad little man who simmered with anger. One day in class some girls were talking and he hurled a piece of chalk at them,  but he was bad at physics and it hit me in the head. I reacted with a WTF?!? and he just shrugged helplessly and resumed teaching.",
   "created_utc": 1692804572,
   "score": 103,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxfa3qp",
   "message": "Grade 8. Teacher teaching sex Ed. Talking about oral sex. I had no idea was oral sex was. I asked her after class if she could give me examples of oral sex. She gave me detention and refused to answer my question. I seriously had no idea. Raised in an extremely catholic household btw.",
   "created_utc": 1692804640,
   "score": 98,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe9u31",
   "message": "took my cute animal erases in first grade. I’ll never forget that",
   "created_utc": 1692788403,
   "score": 175,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeh39p",
   "message": "I got stories:\n\n* 2nd grade teacher disliked boys, and after I complained about mistreatment the school discovered through an investigation she manipulated the organization chart and all but 4 (if I’m recalling correctly) of her students were boys- myself included. I think she had 21 girls and 4 boys and all the boys were essentially failing her class. Mrs. Stout didn’t return the next year. \n\n* 6th grade I had a teacher, Mr. Stump who was monotone and emotionless decided to be an ultimate authority and sign me up for SpEd classes because my handwriting was abysmal. My parents had no idea until I came home with an Alphasmart.\n\n* 7th Grade I had vegan biology teacher who for some reason disliked me. We had a project that was to take a month to do and a final report that was a quarter of our final grade. I kept asking what she wanted from me and the goal post was constantly moving. I wrote I think 3 rough drafts of my finally report on the importance of vegetarian and vegan diets to the ecosystem and she failed all of them and gave me more and more complex demands. Eventually my mother, a college educated woman, decided to try and write a report for me with all my rough drafts and teachers notes and Mrs. Z still failed the report. It was the only time I was given permission to fail a class by my parents and my mother filed a complaint with the school board and got me out of summer school because of her actions.\n\n* 7th grade again I was bullied mercilessly in my gym class and my coach encouraged it. The reason being he thought I was being overly dramatic, and at one point told my parents “If he stopped acting like a goddamned fruit, he’d be fine!”",
   "created_utc": 1692792475,
   "score": 158,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxekrk0",
   "message": "I got a lower score on a test in my senior college biology class. The professor offered extra credit in the form of going to the lab for 3 hour sessions. So I went to all of them. And then at the end of the semester he didn’t give me all the extra credit. He capped it so I was within a point of an A. And no, it wasn’t capped at one session. There was no rhyme or reason. He literally only gave me enough extra credit to get to that high B. I went to the Dean and was told he had tenure so there was nothing he could do about it. I was also told I should be happy because more than 50% of his students failed his class regularly. If that’s the case, sounds like something is wrong with the teacher, not the class. Anyway, it was my only B in college, and that pissed me off knowing I had worked and earned the A. So I graduated with a 3.99 GPA. Doesn’t matter now in the scheme of things but it still pisses me off thinking about it.",
   "created_utc": 1692794309,
   "score": 75,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe9igo",
   "message": "Told the girl I was madly in love with at the time, that she could do better than me, I still hate the prick for it.",
   "created_utc": 1692788195,
   "score": 26,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxehsjg",
   "message": "Went on a rant about how much she hates emo music and fashion while I was sitting right there in front of her looking as emo as one could possibly imagine. \n\nThen when I came home I changed my profile picture on facebook to something super emo and captioned it with \"for my English teacher who hates emos :* \" lmao\n\nI didnt think she would see it, I didnt think anything of it, I meant it more as a joke but she did somehow see it and apologized to me the next day",
   "created_utc": 1692792833,
   "score": 3,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxegpxy",
   "message": "My 1st grade teacher once told to my parents that I have almost no intellectual abilities and will struggle even with simplest jobs. Years later I graduated classical gymnasium, medical university and now work as a game developer.",
   "created_utc": 1692792286,
   "score": 22,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeev5j",
   "message": "Had a teacher who repeatedly dress-coded me for things that weren't even in the rulebook. Bitch had the audacity to call it \"water under the bridge\" when I confronted her years later as an adult. No, bitch, it's *not* water under the bridge. You don't get to mistreat someone and call it \"water under the bridge.\" That phrase is reserved solely for victims who have decided to forgive their abusers, and I dont forgive grown adults who bully children. She actively disrupted my education by sending me out of the classroom multiple times just because she doesn't like goth kids or the clothes they wear. The only skin exposed was my face and hands - this was during my *Tripps and a hoodie even in summer* phase.",
   "created_utc": 1692791305,
   "score": 204,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxemth4",
   "message": "Middleschool gym teacher.  For the presidential fitness test, i decided i was going to do as many situps as i could without stopping.  Made it to 200 before he said \"you know i can only mark up to 50, right?\"\n\nCouldnt have said something sooner?",
   "created_utc": 1692795270,
   "score": 97,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxej1vt",
   "message": "I had my grades docked severely for absences regardless of test performance despite the fact that my absences should've been clearly a sign to call the social services and get me the fuck out of my home. This included being failed for courses where I did significantly well on a test.\n\nI was also kicked out of school after I had taken absences within rule-permitted amounts in the following fashion: \n\nA bunch of teachers declared during a single day that I had gone over the maximum amount of absences for their courses and would thus fail the courses regardless of performance OR ACTUAL number of absences\n\nThen during summer vacation a surprise letter came from the principal's office stating that due to not finishing those courses it was deemed unlikely I'd finish the school in the planned time and was kicked out. This regardless of more severe cases being exempt.\n\nI didn't really question authorities at the time nor was I cognizant of the fact that the social support system in hillbilly areas is more a bureaucratic good old boys for tax paid jobs and influence.\n\nLooking at my school's yard picture of everyone could be a case example for social workers and psychologists of \"spot the guy who needs outside help\" :P",
   "created_utc": 1692793465,
   "score": 184,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe6y4l",
   "message": "I did my first year of high school in Washington state, in a small town, my woodshop teacher was so hideously mean to me because I grew up in Mexico, being full on racist and humiliating, that was more that 30 years ago and I still hate his guts....",
   "created_utc": 1692786494,
   "score": 178,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxemlwc",
   "message": "Ooh my high school \"guidance counselor\". I'm 37 and still salty AF about it. \n\nMy best friend lost her father when we were 15 and both of us got put into \"counseling\".  We also both had a lot of previous trauma. We already had a thing where we spent our weekends volunteering at the local animal shelter and our weekdays were spent either in the library or in band. We were both good kids, we just didn't fit in at our rich, WASP-y HS. There were also *rumors* that we were lesbians. (Oh lawd, fainting couch!)\n\nI had that guidance counselor drag me out of class for sessions I didn't want or need and after giving her a true rundown of what bestie and I did on the weekends, she told me that maybe we should do something different, like dance or something. Because helping save animals was too stressful...(it was our fucking sanctuary).\nRight. Dance. Not...study medicine or... management...or... anyone ask what either of us wanted...\n\nThis same shit head counselor once approached me in front of other students and asked if my relationship with my aunt had improved any. Super professional stuff.\n\nMany, many years later, bestie and I are both successful in our fields and I still want to kick that counselor bitch right in the twat.",
   "created_utc": 1692795173,
   "score": 64,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxentq6",
   "message": "I was kind of a problem child so I've had lots of incidents but the one that sticks out the most (and in hindsight probably was what started my hate of going to school). \n\nI was in grade 1 and I loved my teacher so much. I thought she was amazing, the nicest, the best. One day I found a pen. It was black ink but the outside had a rainbow going along the bottom and the Access logo (80's and 90's Canadian kids will remember.the Access Network). I brought it to school and was using it. All the kids were jealous, it was 1990 and we didnt have much. My teacher was walking around and when she noticed the pen she not only took it away but berated me in front of everyone and was acting really upset. She kept saying how I should of known better and that she was going to tell my parents. It was really embarrassing and I remember thinking how she actually hated me and that no teacher would ever like me. How I couldn't do anything right.\n\nI was a very self deprecating kid and growing up as an only child, was aware of how other adults aside from my parents, would make preconceived judgments about me because of this. How I was a brat or spoiled. I thought my grade 1 teacher was different and I actually work with kids now myself. I gravitate towards the more troubled ones because I see my young self in them and as an adult I can say that she completely overreacted and threw her power around that day. \n\nI also don't remember getting my pen back!",
   "created_utc": 1692795734,
   "score": 61,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeq8sy",
   "message": "My 6th grade math teacher accused me of stealing her lotions... except I'd been out all week in the hospital for trying to off myself and had no idea she had a bucket of lotions. So she confronted me in front of the entire class, and of course I denied taking lotions because I truly didn't and had no use for her stupid lotions anyway. She told me I was going to hell. 🤣 At the time, I was severely depressed and suicidal and it wasn't funny, but in hindsight I'm able to laugh at it.",
   "created_utc": 1692796812,
   "score": 63,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe0yum",
   "message": "Yelled at me in front of the entire class (like a month into moving to this entirely new country) because of how I was sitting. Apparently I was slouching, though I had no idea I was doing anything wrong. Minuscule in the grand scheme of things but shit like that sticks with kids",
   "created_utc": 1692781978,
   "score": 212,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeey4o",
   "message": "Was talking early on into a physics class in middle school at 15 years old. Got admonished for it, which was understandable even if I wasn't being particularly loud compared to several others. But when I said sorry, the guy answered with this beauty of a response:\n\n\"Sorry is what you say when you get your girlfriend pregnant.\"\n\nI was maybe moments away from just leaving the classroom. Such a weird and kinda fucked up thing to say to a teenager. I already didn't like the guy, starting from the first lesson. The only reason stayed was because he'd be leaving soon anyway. Guy was a reservist in the army and was going to be deployed to the middle east.",
   "created_utc": 1692791350,
   "score": 121,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxf9zwh",
   "message": "Yelled at me to stop talking when I wasn't saying anything.\n\nThen a student says it was them, and she said no it wasn't. TF? \n\n6th grade art class 😡",
   "created_utc": 1692804600,
   "score": 58,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxepk4w",
   "message": "My college professor paused her lecture to condescendingly storm over to me and demand to know why I had my phone out, very obviously, centered in plain view on my desk. Almost as if I was reading. Because I was reading. The class text. Along with everyone else. As she had instructed. \n\nIt was the first week of classes and my physical book hadn't arrived in the mail yet so I'd download the free ebook sample to my phone to keep up with the first couple chapters. I don't know why she would assume otherwise, I was right in the front row, not hiding or anything. And plenty of other students around me had ebooks on Kindles or tablets.",
   "created_utc": 1692796512,
   "score": 106,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeqq6b",
   "message": "Oh boy. At 11th grade at my high school we had to take a mandatory road safety class with a person we'll call K. K wasn't a teacher but a person who was involved in a car accident years ago and was left with permanent conditions and injuries. Almost nobody gave a shit about his class and usually over 80% would skip it, it was only me and a dedicated few who would actually show up and take notes. Most of what he taught was either anecdotes or basic things you learn when getting a driver's licence. Principal took note and together those two made up a midterm exam, to which you had to show up with the notebook you took notes in. I'm not sure what went down during that exam but I am convinced ultimate most didn't have a said note book. I was sick that day and showed to an alternate date to take that stupid exam. Me and several others in the same situation showed up to take the exam, me with the notebook mind you. I went over to K to say hello and ask where we will be taking the exam, and he accused me of never showing up to his class, saying if I did he'd remember me, to which I said I did and even showed him the notebook and let him read through it. Even then, K wasn't convinced. We (about 7 students) took the exam, and when I handed mine with other students still in the room he started going through my answers, pointing out any mistakes out loud by exclaiming that if I indeed attended his class, I'd know the answers and reinforced his position that I cut his class. I was more than pissed, so were my parents when I told them, we went to the principal with it, and the best she offered was changing my grade to the equivalent of B+ and an apology. I never got said apology. Fuck you K.",
   "created_utc": 1692797018,
   "score": 49,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxewves",
   "message": "Im not a very creative person, but I enjoyed art class. I spent a long time on a clay sculpture of a giant holding a club. Well, the teacher looked at it and said that it looked like the giant was holding its penis. \n\nDestroyed the clay sculpture right in front of her and walked off, I didn't do any work the rest of the semester because of that comment. Took 15 years to get the courage to make a homemade birthday card for my ex (who loved it, even though her homemade cards were something truly special)",
   "created_utc": 1692799572,
   "score": 51,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe1did",
   "message": "Took NO action when a boy slapped me quite hard, all because he thought I slapped him, I wasn’t even near him at that point. When I said I didn’t think that was fair, she gave me recess detention, of which the whole time she berated me for not just shutting up about it.",
   "created_utc": 1692782303,
   "score": 103,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxec8qf",
   "message": "The cunt made a point of belittling me every single day for a year because my interests were different from the mainstream in a small town. Nothing whacky either, I was into pop culture (like nina turtles and simpsons, etc) in a place where there was no culture outside football for boys or netball (or just being quiet) for girls. I'm over 40 now, and I still go back to that town a few times a year, and that old prick is lucky I haven't got my revenge now that the tables of relative strength have turned. Also, he used to wave his mushroom dick around in the change rooms when we had swimming carivals. Like every time.",
   "created_utc": 1692789854,
   "score": 74,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxei12z",
   "message": "I was a bit of a pain as a kid. Well, that's not *quite* true, I was a shithead.\n\nWith that being said, I incurred a *lot* of bullying, some of it because I was a shithead, some of it because I was a sci-fi fan, some of it because of my race, but mostly because I was a shithead.\n\nOne day in the fourth grade one of my classmates slugged me in the jaw in the coatroom. My I told the teacher, who didn't like me at all (like I said, I was a shithead), and before she could catch herself she blurted out, \"good, I hope it hurt.\"\n\nThis was in 1988, and to this day *nobody* believes me. Not my friends, not my family, *nobody*.",
   "created_utc": 1692792955,
   "score": 254,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxervg1",
   "message": "I was frequently disruptive in school, having a shit life at home. My 6th grade teacher drew a circle on the blackboard about three inches above my head and made me stand on my toes and put my nose in it. After 20 minutes, there was a stream of tears and snot running down the board.  Everyone was laughing at me. It was really cruel, in my opinion.",
   "created_utc": 1692797514,
   "score": 46,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxfcwhi",
   "message": "My seventh grade homeroom teacher would loudly yell, “STOP FLIRTING” whenever I(f) talked to my friend(m), and did it to a lot of other kids.\n\nDefinitely was not flirting. She just wanted to embarrass everyone at one of the most emotionally volatile times of our lives. Still pisses me off just thinking about it.",
   "created_utc": 1692805677,
   "score": 43,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxeax96",
   "message": "My teacher was making us learn what arguments are. She said something along the lines of \"Let's say the debate is about death penalty. One could say 'I'm opposed to it because it's illegal' \". So I raised my hand and said \"But this isn't argument, it's the point of the debate, choosing if it should be legal or not\". She smirked and said \"...ok?\" and the class laughed. Still bitter about it.",
   "created_utc": 1692789077,
   "score": 45,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxejddv",
   "message": "I won a toy as a prize in some sort of class raffle, the teacher confiscated it off me forever for playing with it at lunch time in the playground. I was in grade 3.",
   "created_utc": 1692793624,
   "score": 92,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxe96da",
   "message": "The PE teacher who didn't believe me when I broke my finger in class. \n\nI mean, you know. But you know.",
   "created_utc": 1692787979,
   "score": 125,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxensx7",
   "message": "Ms. Payne you took the only field day I would have ever gotten to experience in school because you didn't like the color of my skin... I get flashbacks to watching everyone ride the rides and eat funnel cake from the dark rooms window to this day, probably why I can't go to fairs or festivals now almost 12 years later.",
   "created_utc": 1692795724,
   "score": 38,
   "submission_id": "15yyeb9"
  },
  {
   "comment_id": "jxey4db",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15yyeb9"
  }
 ]
}