{
 "submission_id": "15z20xe",
 "title": "People who never went to their class reunions, why?",
 "selftext": "",
 "created_utc": 1692792527,
 "permalink": "/r/AskReddit/comments/15z20xe/people_who_never_went_to_their_class_reunions_why/",
 "score": 244,
 "url": "https://www.reddit.com/r/AskReddit/comments/15z20xe/people_who_never_went_to_their_class_reunions_why/",
 "comments": [
  {
   "comment_id": "jxehel1",
   "message": "I stay in touch with my best buddies from high school and university, don't care enough about anyone else to make the effort of traveling for a reunion.",
   "created_utc": 1692792634,
   "score": 151,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxek2lg",
   "message": "Because fuck them, that's why",
   "created_utc": 1692793974,
   "score": 252,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxehhkq",
   "message": "Didn't want to be there as a kid, so had no desire to return.",
   "created_utc": 1692792676,
   "score": 232,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxehn6q",
   "message": "I don’t care about the people I went to school with.",
   "created_utc": 1692792757,
   "score": 44,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxejj1e",
   "message": "I keep in touch with the people from high school I want to keep in touch with. No need to go to a mediocre event and be judged by the others.",
   "created_utc": 1692793702,
   "score": 251,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxelcr9",
   "message": "First of all, I wasn’t invited. I’m still as invisible to them as I was back then. Second of all, fuck those clowns.",
   "created_utc": 1692794588,
   "score": 77,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxehd7k",
   "message": "The fuck I want to hang out with losers for?",
   "created_utc": 1692792615,
   "score": 146,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxehr0s",
   "message": "They held it at a bar, right after I quit drinking.",
   "created_utc": 1692792811,
   "score": 128,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf3ea5",
   "message": "The people that are in my past are there for a reason.",
   "created_utc": 1692802121,
   "score": 63,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxeipcr",
   "message": "I don't want to relive sitting by myself in the cafeteria all over again.",
   "created_utc": 1692793292,
   "score": 20,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxeid33",
   "message": "Social anxiety",
   "created_utc": 1692793122,
   "score": 128,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxeirkk",
   "message": "I don't really know anyone from high school anymore except maybe one or two people, and I can hang out with them on my own terms.",
   "created_utc": 1692793322,
   "score": 78,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf2d0d",
   "message": "I have a hard enough time catching up with my actual friends.",
   "created_utc": 1692801730,
   "score": 167,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxet9nk",
   "message": "Why would I spend time with people I hate?",
   "created_utc": 1692798099,
   "score": 164,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfaekl",
   "message": "I don’t want to pay admission or get dressed up to go see people I willingly blocked on social media",
   "created_utc": 1692804751,
   "score": 100,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxep3ta",
   "message": "Are class reunions a thing in the time of social media?   \n\nWe can find out everything we want from everyone we ever met should we choose to do so.",
   "created_utc": 1692796309,
   "score": 177,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf9un4",
   "message": "My graduating class had 1400 ppl in it. They chose a fancy restaurant for the reunion that was $100+ per person to attend. I’d rather paint my house with a qtip then pay that much to see ppl I don’t care about",
   "created_utc": 1692804547,
   "score": 189,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxft84o",
   "message": "High school was the worst four years of my life. Why would I want to go back to a place I hated and see a bunch of people who treated me like shit, voluntarily?",
   "created_utc": 1692811609,
   "score": 109,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfuzos",
   "message": "Life isn’t a sitcom and this isn’t the 1960s where kids knew everyone in town. I graduated with 800+ other people and we weren’t even the biggest school around, what difference does it make 20 years later if the 20 people that actually knew me then know me now when we weren’t good enough friends to keep up in the first place?\n\nLiterally the only reason to go is if you peaked in high school and need the validation one more time before you hit 40. How sad.",
   "created_utc": 1692812226,
   "score": 80,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfbnya",
   "message": "I hated HS, couldn't wait to get out, hated where I grew up, felt like a caged animal, my life only got better after leaving there.\n\nDidn't look back and don't want to look back.\n\nNow 55 and retired with lots of good years in front of me.",
   "created_utc": 1692805217,
   "score": 74,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf6j5y",
   "message": "Class reunions are borderline pointless nowadays. Used to, you didn't see high school/college acquaintances for 10 years, but with social media you tend to see them too much.",
   "created_utc": 1692803308,
   "score": 44,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxehioz",
   "message": "I don't need a reason to not do something.",
   "created_utc": 1692792692,
   "score": 125,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfh2yt",
   "message": "Mine is in 2 weeks. They were all a bunch of inbred fucks then, and still are today. No need to spend $100 to see their bullshit all grown up.",
   "created_utc": 1692807224,
   "score": 34,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf4lo9",
   "message": "I haven’t spoken to a single person from my high school class in over 20 years.  I never really liked many of them back then so I’m damn sure not wasting time going to a reunion.  Also I never even got an invite",
   "created_utc": 1692802575,
   "score": 60,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfivji",
   "message": "I was bullied, had my property vandalized repeatedly and permanently (car was keyed to shit more than once), got in fights, had inappropriate comments made by teachers. \n\nWhy the actual fuck would I travel out of state and pay hundreds of dollars for a ticket to be surrounded by those memories?",
   "created_utc": 1692807882,
   "score": 33,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxeu6h0",
   "message": "Class of 2010, so covid ruined our 10 year reunion. Dont think anyone cares at this point",
   "created_utc": 1692798477,
   "score": 31,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf3xng",
   "message": "Millennial here, graduated from HS in the mid-to-late 00s.\n\nI'm still close with a core group of friends from HS. Those I'm not friends with, but still cordial acquaintances with, I keep up with through Facebook, which I'm slowly trying to remove from my life aside from my Quest 2 and looking at cat pics \u0026amp; vids on Instagram.\n\nI wasn't very popular in high school. I have some great friends from then, but I was also relentlessly bullied. Seeing as I can keep up with the positive parts of my life from then via just talking to my friends, why go back to the people that bullied me? I don't think about them anymore, I'd rather live my life without communicating with them.",
   "created_utc": 1692802324,
   "score": 26,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxehd7i",
   "message": "Didn't feel like it.",
   "created_utc": 1692792615,
   "score": 19,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf8qf1",
   "message": "I wish all those people the best, but that was a different time in my life. Simple as that.",
   "created_utc": 1692804134,
   "score": 26,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxetm2f",
   "message": "Why would I?  I didn't make it a point to keep being friends with anyone I knew in school.  I hated school when I was there and ditched for probably 50% of all 4 years of high school.  I had 0 interest.",
   "created_utc": 1692798242,
   "score": 23,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxg3srf",
   "message": "a few people organized something and i bailed day of because it occur'd to me that i do not want to see half these people so i went and had dinner with my family instead",
   "created_utc": 1692815345,
   "score": 10,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf365x",
   "message": "They don't bother with that in the hood.",
   "created_utc": 1692802035,
   "score": 16,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxg3kl2",
   "message": "Everyone knows that class reunions are for the popular kids who still get their validation through high school cause it turns out they weren't the shit in the real world.",
   "created_utc": 1692815264,
   "score": 34,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxemth1",
   "message": "Didn't hear about it because the people organizing it thought creating an event on FB would be enough for everyone to find out about it even though our class was '95. It was cancelled because not enough people said they wanted to go. Event had 25 people invited to it.",
   "created_utc": 1692795270,
   "score": 12,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfctjt",
   "message": "I’m afraid they will all want me to fix their cars for no charge again.",
   "created_utc": 1692805648,
   "score": 9,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfnyzi",
   "message": "I didn’t like those people in high school. Why would I want to see them now?",
   "created_utc": 1692809736,
   "score": 14,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfh2qs",
   "message": "Never got an invitation, and the feeling is mutual",
   "created_utc": 1692807221,
   "score": 11,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxem5g6",
   "message": "I pretty much hated everyone in my high school. I couldn't wait to leave. A decade later I moved to the other side of the world.\n\nI stayed in touch with 2 people. One of whom attended our 20 the high school reunion. I was on the *rest in peace * board.\n\nI was resting in Australia.",
   "created_utc": 1692794962,
   "score": 27,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf7kgl",
   "message": "I went to mine and wished I had stayed home. Very few attended. One of my HS friends now has a church and all he wanted to talk about was joining his church.\n\nThere are no future plans for another reunion, thankfully.",
   "created_utc": 1692803700,
   "score": 12,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfbh25",
   "message": "If I wanted to hang out with any of those people, I would. I don't. So, I didn't go.",
   "created_utc": 1692805146,
   "score": 7,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxg76tr",
   "message": "Either I never got any invites or there weren't any reunions",
   "created_utc": 1692816553,
   "score": 8,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgafi7",
   "message": "I feel like reunions are for all the popular kids who peaked in high school who want to return to either gloat about how successful they are or to relive the “good old days” if they weren’t.",
   "created_utc": 1692817759,
   "score": 22,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxginkb",
   "message": "My life didn't peak in high school, so it's not \"the good old days\" for me. There's no reason to see those people",
   "created_utc": 1692820849,
   "score": 8,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxej1xw",
   "message": "No reason, really....just never established a close relationship with any students from my high school or college.",
   "created_utc": 1692793466,
   "score": 5,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf4e37",
   "message": "I have never felt the need to go. I attended my ten year reunion in 1984 and thought why am I wasting my time here? During my work career in public service I saw several people that were in my high school social circle and had four of them that worked for me during my 32 year career.",
   "created_utc": 1692802495,
   "score": 5,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf4ilg",
   "message": "I wasn't invited",
   "created_utc": 1692802543,
   "score": 7,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfaqjh",
   "message": "I was bullied ang ignored and miserable.   I'm not going to pay to be around people who made me miserable.",
   "created_utc": 1692804875,
   "score": 6,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfbcj1",
   "message": "I graduated in 1995.  Never once have I spoken with anyone from my High School in all 28 years since graduating.  I barely spoke to them when we were in school.  Never been invited, never looked into going.",
   "created_utc": 1692805100,
   "score": 9,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfh6mb",
   "message": "I went to a small school in a nowhere town and too many of my classmates stuck around in that shallow gene pool. No reason to return. It'd be like Spock going to visit the Squidbillies.",
   "created_utc": 1692807261,
   "score": 7,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfzcjp",
   "message": "I didn't like them, so when I graduated, I felt happy that I didn't have to see them again in my life",
   "created_utc": 1692813756,
   "score": 5,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxg2f0k",
   "message": "I didn't like those people 10 years ago. Why would I want to go hang out with them now?",
   "created_utc": 1692814858,
   "score": 5,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxg3zt0",
   "message": "The only person I actually cared about from high school is married to me now, so why would I? Those people were nothing to me then so why would I seek them out?",
   "created_utc": 1692815416,
   "score": 6,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxg42gl",
   "message": "my high school reunion cost money to attend despite tuition also having been insanely expensive and i live across the country now so it didn’t feel worth making the trip",
   "created_utc": 1692815442,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxg46c5",
   "message": "Because high school sucked.I was an angry teen, who was not dealing with our processing the fucked up childhood I had, and pushed most people away. \n\nI could easily sit here and say everyone was an asshole, but it was most likely me. And the few friendships I did have weren't strong enough to last past my senior year.\n\nGoing back to revisit past trauma, whether self inflicted or otherwise, has never really interested me. The only thing I've given consideration too, is going back to make amends for the person I was.",
   "created_utc": 1692815480,
   "score": 8,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxg497a",
   "message": "Haven't lived within a 12-hour drive of my hometown since graduation. I've never felt like a reunion was worth the long drive or flight expense. Plus, I fucking hated high school.",
   "created_utc": 1692815509,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxglqrz",
   "message": "My class is too lazy to organize them.",
   "created_utc": 1692821986,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxehaut",
   "message": "I never found out about mine until it was over. It was advertised on social media and I'm not a heavy social media user.",
   "created_utc": 1692792581,
   "score": 12,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf2jrc",
   "message": "This year would be my 20th, never heard a thing. As far as I know nothing was organized, nobody does anything like that now with social media, we already know what we're all up to if we're so inclined. I'm not on FB, and only keep in touch with a couple people, so maybe some folks met up and did something but I also don't really care.",
   "created_utc": 1692801800,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf5zo6",
   "message": "Exactly. Why?",
   "created_utc": 1692803105,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfbrc9",
   "message": "\"Fuck them kids\"",
   "created_utc": 1692805252,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfbt5j",
   "message": "I hated high school and because of social media I already know how everyone turned out.",
   "created_utc": 1692805271,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfmvah",
   "message": "I went to Christian school and am living a very much Not Christian lifestyle now as a queer person in a non straight relationship. I just don't need that judgment. I'm way happier than I was then. There is no reason to revisit the past.",
   "created_utc": 1692809340,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfnx0v",
   "message": "Facebook. \n\nThanks to social media I was able to keep in touch with the people I wanted to, and check in on the people who were friends but drifted apart. I already know how a lot of their lives ended up. \n\nI have no desire to go back and make polite chitchat with people I haven’t seen or thought about in 20 years.",
   "created_utc": 1692809716,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgamf0",
   "message": "Class reunions are dumb. It’s just a bunch of people bragging about how successful they are, kids, family. Reminiscing about stupid past stories. Their annoying and I refuse to be associated with one. I’m still friends with old classmates and they won’t go either.",
   "created_utc": 1692817832,
   "score": 5,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgao4q",
   "message": "While I had a positive highschool experience a reunion sounds boring.",
   "created_utc": 1692817849,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgat6a",
   "message": "Even though I played in the marching band, played basketball and volleyball, I never had that much in common with most of my classmates.",
   "created_utc": 1692817901,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgaw3i",
   "message": "Only found out about it 10 years after it happened.",
   "created_utc": 1692817933,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgdekz",
   "message": "I think most people go to these things for 2 reasons\n\n1. To brag about how well they've done (in jobs or marriage or whatever)\n2. To see who's still single\n\nIf you're self secure and not interested in dating someone from your home town what is the point",
   "created_utc": 1692818876,
   "score": 5,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgjnhw",
   "message": "Because I hated school so much and I was bullied at school so why the hell would I go to a reunion with a bunch of dickheads I rather see dead. 🫶🏻",
   "created_utc": 1692821219,
   "score": 5,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgjs4w",
   "message": "The clit measuring with a side of aging mean girls asking “so what do you do now” to measure how much respect you get is not my cup of tea.",
   "created_utc": 1692821265,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgkbfe",
   "message": "My ten year reunion was in 2020. Even I did receive an invite, I probably wouldn't have gone",
   "created_utc": 1692821463,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgr8pp",
   "message": "The only people from high-school I'd care to see are dead, so no point in going",
   "created_utc": 1692823984,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgrb0x",
   "message": "Because my life was much better once I left that bunch of pricks behind",
   "created_utc": 1692824007,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgxape",
   "message": "Never got invited. Of course I never updated my highschool with my information and my parents moved from that old home years ago.\n\nI have no desire to go to any reunion.",
   "created_utc": 1692826247,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgyy6z",
   "message": "Our parents were just random people who lived near a random building that their kids were legally forced to attend.  What a terrific basis for people meeting up 30 or 40 years later!!!",
   "created_utc": 1692826870,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgzijs",
   "message": "I hated those assholes in 1994, why the hell do I need to go see them in 2024.",
   "created_utc": 1692827087,
   "score": 1,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh0c40",
   "message": "I'm GenX, highschool class of 90. When our ten year reunion rolled around, apparently no one thought to make it happen, or at least they did a shitty job of spreading any kind of word because no one heard anything.\n\nConsequently, some people got together to try and make an 11 year reunion happen but there was so little interest that only about 20 people rsvped, so they just decided to meet at a local bar for drinks. I later heard that about 6 people actually showed up.\n\nI've not heard a single peep about any subsequent reunions.\n\nIn a weird way, it kinda makes me proud to be a Gen Xer.",
   "created_utc": 1692827400,
   "score": 18,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh1qvz",
   "message": "I went to a 5-year reunion. So I know I broke the rule of the thread, but I have no intention of going to another reunion. \n\n* All of the people I wanted to talk to were not in attendance. I'm dead serious. None of them. It was very disappointing.  They had either relocated out of state or didn't want to spend the money or any other number of factors.\n* There was a shockingly large amount of 'I don't want to talk to you' vibes - everyone simply slid back into their clique roles. I was an oddball in high school and I was reminded of that very quickly.  Again, disappointing. \n* It's just not worth it. I appreciate the people who went out of their way to organize it (I knew one of the organizers well, which was one of the main reasons I went), but it's not my cup of tea. \n* Virtually all of the people there have had nothing to do with my life for years. So its just, eh? There's other things I could with my time that would be a lot more fun, or at least be a lot less awkward.",
   "created_utc": 1692827944,
   "score": 17,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfpthn",
   "message": "I'd rather drag my exposed testicles through a mile of broken glass than deliberately meet up with people who made my teenage years a living hell. \n\nInb4 arguments like \"they might have changed since then\" or \"they might try to apologize\"... I don't care. \n\nA 15+ years old person is well aware of the weight of their words and actions, being a spoiled moron is not an excuse for shitty behavior and noone owes them forgiveness.",
   "created_utc": 1692810406,
   "score": 10,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfb2ih",
   "message": "They were mostly rednecks who are proud members of MAGA now.  No thanks.",
   "created_utc": 1692804998,
   "score": 5,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf5pab",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf6h6b",
   "message": "Literally the only person in my graduating class I've spoken to since graduating is my sister. All my friends were a year behind.",
   "created_utc": 1692803287,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf9oiv",
   "message": "I'm still friends with the people from my high school that I want in my life.",
   "created_utc": 1692804484,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfa6wb",
   "message": "Imagine never being able to move on.",
   "created_utc": 1692804673,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfcy80",
   "message": "Who cares?",
   "created_utc": 1692805695,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfd34e",
   "message": "Why would I want to do something like that?",
   "created_utc": 1692805746,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfdkf8",
   "message": "Everyone at school can go eff themselves",
   "created_utc": 1692805923,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfiesy",
   "message": "I’ve moved around a lot and changed friend groups more times than I can count. At this point I honestly don’t give a shit about a class reunion or catching up with people I haven’t seen or spoken to in years.",
   "created_utc": 1692807712,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfinop",
   "message": "Because the cool kids never go.  Only the \"neo-maxi zoom dweebies\".",
   "created_utc": 1692807801,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfkqxy",
   "message": "Because fuck those people.",
   "created_utc": 1692808570,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfkw24",
   "message": "I think reunions are becoming a thing of the past tbh. My class had their ten year reunion last year and like 25 out of 300 people went. I didn't go and don't plan to go to any in the future. I don't care about any of these people.",
   "created_utc": 1692808622,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfrxd5",
   "message": "I only went to one, because I was as excluded at the reunion as I was in high school",
   "created_utc": 1692811157,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfs70k",
   "message": "Because I didn't have a good experience in high school. I was unpopular and it was an all-boys Catholic school. My life is great today and I have no desire to revisit those days.",
   "created_utc": 1692811251,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxft2ko",
   "message": "My class did a ten year (I wasn't invited), but turnout was so pathetic that it doesn't look like anyone even tried to organize a 25.",
   "created_utc": 1692811554,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfx7qp",
   "message": "I don’t care about the people I went to school with.",
   "created_utc": 1692813008,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfzahq",
   "message": "Came here to say this, also.......didn't like 'em then, don't like 'em now....",
   "created_utc": 1692813735,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxg3tzf",
   "message": "They friends I want to talk to, I talk to. I don’t need to see random people that I never had a strong relationship with again.",
   "created_utc": 1692815357,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgaskx",
   "message": "I didn't even want to add the vast majority of those people to social media, why would I want to go see them in person?\nEveryone I wanted to stay in contact with, I did.",
   "created_utc": 1692817895,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgaz5p",
   "message": "I didn't like them in highschool, it hasn't changed",
   "created_utc": 1692817964,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgj6fi",
   "message": "High School was a painful time in my life and I have no desire to reminisce. The life I have now didn't even begin until I was 24, and it wasn't until I was 30 that I finally found happiness and security.",
   "created_utc": 1692821046,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgj7eq",
   "message": "High school life was utter Hell in my little school.  I want nothing to do with anything even remotely related to it other than the few true friends I made.    It's been 30+ years and it still haunts me.\n\nLuckily I got to watch the school be bulldozed under a few years back and be replaced by a nice new modern facility that I hope treats students better.",
   "created_utc": 1692821056,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgjzim",
   "message": "Why would I? I want you to get older you realize everybody in high school was an idiot. But it might be fun to go back.\nI don't have a little bit of fun. Is la cairo gorgeous escort and pass her off as my new girlfriend.",
   "created_utc": 1692821342,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgk3ep",
   "message": "'Cause fuck these guys who made fun of me for self-harm. I have like one friend left from HS and he didn't go either so what was the point.",
   "created_utc": 1692821382,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgk6nn",
   "message": "Because the people I went to school with either didn't know I existed or if they did, they were pieces of shit to me, the teachers I cared about passed on and the ones that were assholes to me, aren't someone I want to see. \n\nSo, I can either do things I like, or, visit a place I hated, to see people who were shit.",
   "created_utc": 1692821414,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgkchq",
   "message": "Don’t like the people I graduated with",
   "created_utc": 1692821475,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgoaiq",
   "message": "Well I transferred mid-way through sophomore year. So I still felt out of place by the time I graduated :/",
   "created_utc": 1692822910,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxguba1",
   "message": "If I haven't spoken to you in 10+ years, it's because I don't want to.",
   "created_utc": 1692825127,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgxhr7",
   "message": "I wasn't invited",
   "created_utc": 1692826320,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgy0b3",
   "message": "Why bother... If we haven't spoken in several decades, we aren't really friends anymore.",
   "created_utc": 1692826517,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgysxs",
   "message": "My class had a reunion a few years ago and contacted me through FB. I declined to go. Mainly because I haven't seen any of my classmates in decades, so the only thing we'd have to talk about would be our school days. Plus I absolutely HATE talking about myself, and if I went I knew I'd have to explain my life and what I've been doing since graduation. No thanks.\n\nMy only connection with those people is that we went to the same school at the same time. That's it.",
   "created_utc": 1692826815,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgz6xz",
   "message": "Because I'm still in touch with the people from high school I care to stay in touch with and I'm not trying to run into people that SA'd me either so there's that.",
   "created_utc": 1692826963,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgzkz3",
   "message": "Class reunions are for the people who peaked in high-school and can't move on. I'm not that person, and I generally dislike that person.",
   "created_utc": 1692827113,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgzmvl",
   "message": "I got nothing to prove to those bitches",
   "created_utc": 1692827133,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgzs4f",
   "message": "If there were any I wasn't invited.\n\nProbably wouldn't go.",
   "created_utc": 1692827188,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgzu84",
   "message": "Wasn't invited, cut that toxic crowd out of my life as soon as I could plus I would never get a babysitter for the feral one",
   "created_utc": 1692827211,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh04xo",
   "message": "You should be making the reverse question: People who always go to their class reunions, why?",
   "created_utc": 1692827325,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh04yy",
   "message": "I was homeschooled",
   "created_utc": 1692827325,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh05y2",
   "message": "I don’t talk to anyone from high school.. didn’t make much sense to fly across the country to hang out for a few hours.. I’m coming up on my 20th.. zero interest in going.",
   "created_utc": 1692827335,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh098l",
   "message": "I was shocked at the casual homophobia in the class reunion group chat. I’m straight, but of course it still bothered me. Also, the chat immediately got cliquey and mean. No thanks.",
   "created_utc": 1692827370,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh11ab",
   "message": "The real question, is why would I??",
   "created_utc": 1692827667,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh1sch",
   "message": "When my 20 year reunion was coming around, I joined the Facebook page. There was a thread where everyone was posting about where they are now. Every single person was posting about this absolutely perfect dream life they were living. Everyone was successful and happy, living the American dream. \n\nBut in the comments of other threads talking about the reunion they were laughing about planning to come without their spouses so they could really have fun. Yep, sounds like everything's fine. Just keep telling yourself that.\n\nHonestly I didn't remember most of these people. A lot of them I recognize the names, but they were just names. I haven't looked them up in the yearbook and still had no idea who they were or why their name was familiar other than knowing they went to my high school. Anyone I had cared to keep in touch with, I had done so already. I wasn't going to spend money on airfare, hotel accommodations, child care, car rental, dressy clothes, and then another 150 a person for admission to an eventful of people that I didn't know, whose opinions I didn't care about anymore, and who are still as fake, phony, and immature as they were 20 years before.\n\nI didn't go to the reunion. And I didn't continue to follow on the Facebook page. But my best friend did, she also did not go, but she said there must have been some extra marital happenings going on at the reunion because there was a lot of drama about it on the Facebook page",
   "created_utc": 1692827960,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh1zmy",
   "message": "I was the fat kid everyone picked on. I have better things to do with my time. Not fat any more and retired young, living life.",
   "created_utc": 1692828039,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh28i9",
   "message": "I honestly didn’t care enough to go. High school wasn’t a super fun time for me, but I’m not angry and I don’t hold a grudge against people for what they did as stupid teenagers. Caveat there is that while I wasn’t popular, I also wasn’t one of the most bullied people, so even though I was picked on and ostracized it wasn’t as bad as other people have been through. So no shame to anyone who is still angry about what happened to them as a kid. \n\nWhen my reunions come around, I think about going every time. But usually there’s something more interesting happening the same weekend.\n\nThe other thing is, I’m not the person I was back then. Some people peak in high school, but some of us change drastically later on. \n\nI’m really happy with who I am now, and what I’ve accomplished. But I always hear stories about people going to reunions and feeling the way they felt in high school and… idk why would I want that?",
   "created_utc": 1692828137,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh2brp",
   "message": "My 10yr was cancelled because Hurricane Harvey devastated the town. Wasn’t gonna go anyway because I was 9mo pregnant and fuck going to that without being able to drink.",
   "created_utc": 1692828174,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh2cvd",
   "message": "Because the ones I truly cared about I am still in touch with.  And the ones I did not care about, I still don’t care about",
   "created_utc": 1692828186,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh420f",
   "message": "People who went to their class reunions, why?",
   "created_utc": 1692828858,
   "score": 1,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh6xbb",
   "message": "everyone that i want to talk to i still talk to you. the rest? meh no need to reconnect",
   "created_utc": 1692830013,
   "score": 1,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfr7ni",
   "message": "Hated those fuckers in high school.\n\nNothing changed.",
   "created_utc": 1692810904,
   "score": 7,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfrhyu",
   "message": "The boys in my year were toxic thundercunts to me for a whole decade. I have no desire to see any of them ever again.",
   "created_utc": 1692811006,
   "score": 5,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxftvjm",
   "message": "Our 25th is this year\n\nThey’re all planning some nonsense. I didn’t like those people then, why would I hang out with them now?",
   "created_utc": 1692811834,
   "score": 6,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxf51kv",
   "message": "Best time to rob those bastards jk",
   "created_utc": 1692802741,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfsf0z",
   "message": "Highschool?  The vast majority of those people did nothing but bully, ignore, and treat me like shit.  Why would I want to go back there?",
   "created_utc": 1692811328,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgoa0f",
   "message": "Cause fuck em.  I already see everyone from high school that I’d want to.",
   "created_utc": 1692822905,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgr00z",
   "message": "They're for people who peaked in highschool",
   "created_utc": 1692823896,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfst1m",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh6j74",
   "message": "High School was Hell. Snobs and cliques.",
   "created_utc": 1692829854,
   "score": 5,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh6pmp",
   "message": "I have no desire to revisit that dumpster fire portion of my life.",
   "created_utc": 1692829926,
   "score": 8,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh74b2",
   "message": "Because fuck those entitled motherfuckers.",
   "created_utc": 1692830093,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxfc3ju",
   "message": "Because I already keep in touch with everyone that means a lot to me (I've had some friends since Kindergarten).\n\nAlso, school shooters, yo.",
   "created_utc": 1692805378,
   "score": 2,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxh3yyo",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhq83s",
   "message": "I came from a very poor family.  Something I as a child and teenager could not directly change.\n\nI was bullied and picked on for my clothes, lack of haircut, dirty old shoes from the time I was 6 to 18.  Kids would attack me becuase they got laughs and when I fought back, they come at me with 3 or 4.  When I beat the shit out of them and broke arms, collarbones and noses defending myself, then the coin was flipped and I was potrayed as the bully... why, becuase I won when the poor kid wasn't supposed to win..\n\nIt did not matter that I did well in school, just became another angle to bully \"nerd boy\".  It did not matter that I was very athletic, tall and fit.  All that mattered to those kids was that I did not have the coolest clothes and that I lived in a crappy dump of a house.\n\nI  joined the military, went to college and built a career where I earn \u0026gt;$200k a year.\n\nWhy would I want to go back and see those privelaged assholes?  Even if I came back, dressed well and driving a fancy car, it wouldn't matter.  They are still be stuck up assholes and I have no time to waste for assholes.",
   "created_utc": 1692838120,
   "score": 9,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhpwuv",
   "message": "Do you go back to prison each year for a party on the anniversary of your release and mingle and chat with the guards and former inmates?\n\nNo? Why not? \n\nHighschool was a fucking PRISON for some people. Are there not enough stories of people taking months, if not years to just recover from the trauma of highschool?\n\nI'm 35 , and I couldn't think of any combined 3-4 year period of my adult life where I felt so much intense pain, misery, depression and fear than from EACH individual year of school attendance.",
   "created_utc": 1692837986,
   "score": 8,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhp3na",
   "message": "The 'popular' boys in my class bullied me to the point of suicidal idealiation, and there was so much bullshit drama, backstabbing and bitchyness both during high school and the years immediately following... No. I have no desire to communicate in any way with those people ever again.",
   "created_utc": 1692837636,
   "score": 5,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhg1nf",
   "message": "Worst years of my life.   School was torture from the 1st grade on.   Dropped out.  Went to college, got a master’s in teaching.   Now I’m the teacher.",
   "created_utc": 1692833789,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhnvha",
   "message": "Mine will be next year. I won't go because I went to 3 different high schools so I never settled in. I don't even think anyone would remember to invite me",
   "created_utc": 1692837110,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhoq26",
   "message": "When I was in High school, I was an introverted insecure mess with severe acne.  I was somewhat silly, so I had a few nerdy friends, but I kept to myself mostly.  No one really bothered me, they did them and I did my own thing. I've been \"friends\" with pretty much everyone on facebook since I graduated but I wouldn't call them actual friends.  If I went, there would be nothing in depth to talk about with anyone, just generic shit about the school. Coincidentally, our 20th anniversary is this year and they're trying to all meet up at a club, lol.\n\nI'm good. Everyone has stories, memories, photos, inside jokes so I would just be in the corner of the bar drinking like \"they don't know I have all of this money...\" Not worth it.",
   "created_utc": 1692837473,
   "score": 5,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhsm57",
   "message": "Because 70% of the people I went to school with were attention-seeking assholes and 100% of the people that went to the reunion happened to fit in that same category",
   "created_utc": 1692839153,
   "score": 5,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhxw4v",
   "message": "Lots of people HATED highschool, why would they want to go hangout with the people they didn't like the first go around.",
   "created_utc": 1692841428,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhmdzh",
   "message": "The people I wanted to stay in touch with, I *am* in touch with.",
   "created_utc": 1692836476,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhofv0",
   "message": "They never found me..for that I am grateful😎",
   "created_utc": 1692837354,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhoh76",
   "message": "For one, I’ve moved on. For two, the one’s who haven’t would be the only ones there. Also, that place is super racist.",
   "created_utc": 1692837370,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhom91",
   "message": "Zero interest.",
   "created_utc": 1692837429,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhovj5",
   "message": "I just don’t care. If I cared I’d be talking to them still. Some I still do. I don’t need a reunion for them- we talk more than once every 10 years.",
   "created_utc": 1692837538,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhowpt",
   "message": "I didn't have fun the first time. Why go back for round two?",
   "created_utc": 1692837552,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhoyb4",
   "message": "Went to the 10. It was a shit show. Heard the 20 was nice.",
   "created_utc": 1692837572,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhp4mb",
   "message": "For what exactly?",
   "created_utc": 1692837647,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhpdn7",
   "message": "Not trying to sound like an ass but why should I. Never even thought about it.",
   "created_utc": 1692837755,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhz9hu",
   "message": "My 50th was last summer. Missed every one of them so far. Considering my 75th, if I’m still around…maybe.",
   "created_utc": 1692842021,
   "score": 4,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxgo2fq",
   "message": "Honestly?  Most of my classmates ate successful.   I went to a fairly prestigious boarding school my family could barely afford.   Instead of building on that opportunity, I decided to take the path of drugs and alcohol.   When the class reunion came up I was about a year and a half sober and still in the rebuilding stage.  Right now I'm still in the rebuilding stage, my 20 year reunion was earlier this year.   I honestly felt insecure.  I try not to compare myself to others but it's hard not to notice all of the time I wasted so I just focus on today.",
   "created_utc": 1692822829,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhny8z",
   "message": "I gained 100 pounds and didn’t want anyone that knew me as a skinny kid to see me like that",
   "created_utc": 1692837143,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxho0bh",
   "message": "Literally what for? Even if I wanted to know the current goings on of people I barely knew in the first place, social media exists for that. I also wouldn't be caught dead in that town.",
   "created_utc": 1692837169,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhpi9u",
   "message": "I'm not interested in seeing people from high school.",
   "created_utc": 1692837811,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhtlgd",
   "message": "The way the cliques couldn't treat you as a real person. You didn't belong to their world, and didn't deserve the dignity of basic acknowledgement. To do so would contaminate them with shame.",
   "created_utc": 1692839574,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxhy2l3",
   "message": "I’m never going back to my old school",
   "created_utc": 1692841507,
   "score": 3,
   "submission_id": "15z20xe"
  },
  {
   "comment_id": "jxibvaz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15z20xe"
  }
 ]
}