{
 "submission_id": "15z45u3",
 "title": "What is your opinion of Adam Sandler?",
 "selftext": "",
 "created_utc": 1692797791,
 "permalink": "/r/AskReddit/comments/15z45u3/what_is_your_opinion_of_adam_sandler/",
 "score": 56,
 "url": "https://www.reddit.com/r/AskReddit/comments/15z45u3/what_is_your_opinion_of_adam_sandler/",
 "comments": [
  {
   "comment_id": "jxf2el6",
   "message": "I've worked on several Sandler movies and can say that they are the most challenging and most fun movies I've ever worked on. Adam is an extremely nice guy and is very caring towards the entire crew. 100% always look forward to working with him and the rest of the crew.",
   "created_utc": 1692801746,
   "score": 54,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxeyopm",
   "message": "I personally thinks he's gotten too much shit online. \n\nWhen he decides to display them, the dude has serious acting chops. \n\nBut mostly he has a production company that makes bank for him and he always has space for his friends in projects. \n\nNot everybody wants to be DiCaprio or Rami Malek and spend their career chasing Oscars. \n\nThe dude has had a career in show business spanning nearly 3 decades, has been mostly controversy-free, and has multiple beloved projects and all-time classics to his name but gets shit on because he would rather get Netflix to pay him millions of dollars a year to work on 1-2 low-stress projects a year with his friends and help keep them paid. \n\n\nI mean according to his IMDB he made $25 million dollars to star in and produce Murder Mystery 2 for Netflix. \n\nAnd if that number shocks you or you never heard of that movie, that's my point. \n\nHe gets Netflix to break the bank for him and his friends to hang out and make whatever projects they want and if it doesn't have mass appeal who cares because he's taking care of everyone in his camp and they all eat because of him. \n\nFucking legend.",
   "created_utc": 1692800304,
   "score": 18,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxet3nv",
   "message": "My momma says he's the devil.",
   "created_utc": 1692798031,
   "score": 252,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxeyun0",
   "message": "I worshiped his movies growing up in the 90's and early 2000's. My opinion of him declined as his movies started to feel lazy. Then around 2013 I met him while living in NYC. My family was visiting and we were out to dinner at some Italian restaurant when we saw him standing at the bathroom door, waiting for his daughters. Small restaurant so he was really only a few feet from our table. He talked with us for a few minutes and couldn't have been nicer. Since then, I've tried to be more open-minded towards his work. Like many other's here have said, he just seems like a genuine dude that loves his friends and families and wants to have a good time while doing his job.",
   "created_utc": 1692800370,
   "score": 111,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxetnk9",
   "message": "Made some great movies. Made some terrible movies\n\nEdit. Wow I was not expecting this comment to blow up like it has.",
   "created_utc": 1692798259,
   "score": 53,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxetflz",
   "message": "He seems like a regular dude who loves his friends, family and playing basketball and makes movies that make people laugh. Hit or miss, I love his movies. It feels like seeing an old friend.",
   "created_utc": 1692798168,
   "score": 15,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxexs3p",
   "message": "They're all gonna laugh at you!",
   "created_utc": 1692799942,
   "score": 76,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfctpx",
   "message": "He’s like ranch dressing. I don’t care for him but he has an enormous mass appeal and a level of comfortable familiarity that makes him highly successful.",
   "created_utc": 1692805649,
   "score": 67,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxffz42",
   "message": "STORY TIME!!!!\n\nActually met Adam Sandler at Disneyland. Super cool guy think he was having a bad day getting recognized. \n\nI was in line for the Screamin at CA Adventure and I heard a voice “Excuse us brotha” and im like I KNOW that “[BROTHA](https://youtu.be/kBPd0hLeM9Y)”\n \nTurned around and there he was! Coming through with his wife and daughters I immediately moved and said “of course Sir” \n\nAs his wife and daughters went on the coaster Everyone was asking for photos and bugging him so holding up the line for single riders.\n\nAs I went to the front, they stopped me and asked me to wait right next to the guy. I can tell he was annoyed with the park security having people bum rush him. Then he spoke.\n\n“Ride good?”\n\n“Its pretty good, I’m more of Guardians and Grizzly rapids fan but for speed yeah its great”\n\n“You know who I am huh?”\n\n“Yeah, love your work and the grown ups series”\n\n“Want a picture?” OH MY GOD DO I????\n\n“Nah man, you’re on vacation and with your family I don’t want to do that to you”\n\n“Appreciate it bud” didn’t say much after that. Two mins later, his family came back and he stopped at me again and extended his hand. We shook it and thanked me again. I seized the opportunity, mimic my best Billy Maddison voice.\n\n“Abby dooby, shalllack et ee toyooouuuu” His wife lost it laughing so hard covering her snorts. He smiled \n\n“thats pretty good you should come work for me” stupid me believed him. Really? He got me back\n\n“[sure ill see you there](https://youtu.be/kmLmt_0XDb0)” Great dude!!",
   "created_utc": 1692806814,
   "score": 177,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxesxec",
   "message": "I like what David Alan Grier said about him:\n\n\"Adam Sandler is like Tyler Perry for white people.\"",
   "created_utc": 1692797958,
   "score": 18,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxeyvgm",
   "message": "He is a musical genius.",
   "created_utc": 1692800380,
   "score": 25,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxf1og7",
   "message": "He’s like comfort food",
   "created_utc": 1692801477,
   "score": 27,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfh62y",
   "message": "While I'm not a huge fan of his movies, he was one of the best actors to work with on set.  He's very open, friendly to everyone on the crew, and even to bystanders (public) watching the filming from a distance.  When we had an extended break in filming (like resetting cameras, etc.) he would go talk to the public standing nearby, signing autographs, taking selfies, etc.  Just a really nice guy.",
   "created_utc": 1692807256,
   "score": 25,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxex11l",
   "message": "You don't mess with the Zohan was actually hilarious. I went in with incredibly low expectations but it hit me in ways Zoolander did, just dumb funny and a good distraction from life for an hour and a bit.\n\nI enjoy most of his movies as I grew up at the height of Happy Maddison.",
   "created_utc": 1692799636,
   "score": 83,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxeswl3",
   "message": "He’s a great human but I don’t enjoy the kind of humor most of his movies have",
   "created_utc": 1692797949,
   "score": 82,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfbroe",
   "message": "I like him at a medium pace.",
   "created_utc": 1692805255,
   "score": 36,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxey2n4",
   "message": "I like how just because he's capable of really good acting, that doesn't stop him from making the kind of stupid movies that he enjoys making (and which make him money, and which allow to him to use a movie as an excuse to hang out with his friends). \n\nLike people see Punch Drunk Love or Uncut Gems and say, \"Adam Sandler legititmately has a good actor in him, why does he still keep making goofy lowbrow comedies?\" and I just think of Kal Penn in Harold \u0026amp; Kumar saying, \"Just because I'm hung like a moose doesn't mean I have to do porn.\"",
   "created_utc": 1692800061,
   "score": 16,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfnhr8",
   "message": "So many of my favorites as a kid were Adam Sandler movies. I love Punch Drunk Love, Wedding Singer, Water Boy, Eight Crazy Nights, Little Nicky, Spanglish… not all of him movies are great but he has lots of gems",
   "created_utc": 1692809564,
   "score": 14,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxew3p3",
   "message": "Makes me laugh but I am admittedly uncultured swine.",
   "created_utc": 1692799260,
   "score": 35,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxezhc2",
   "message": "I outgrew his comedy, but love the memories and one liners from the old movies. Seems like a good dude.",
   "created_utc": 1692800620,
   "score": 10,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxesxxx",
   "message": "Love some of his movies, but wow he makes a lot of terrible stuff.",
   "created_utc": 1692797964,
   "score": 33,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfga8u",
   "message": "Great in the 90s, good in the 2000s and meh the rest of the time other then that's my boy is fantastic. But seems like a genuine great person.",
   "created_utc": 1692806926,
   "score": 16,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfo4ly",
   "message": "He’s funny as shit",
   "created_utc": 1692809792,
   "score": 8,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxeyivx",
   "message": "He seems like a nice guy. Can't stand his movies and I don't think he's even a little bit funny, but he's filthy rich and I'm not.",
   "created_utc": 1692800242,
   "score": 26,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxf4dgg",
   "message": "I love the movies mr.deeds, 59 first date, little Nicky, Big Daddy, click, the wedding singer, the longest yard, anger management, I now pronounce you Chuck and Larry, and the first grown ups.so yeah I'm a fan lol",
   "created_utc": 1692802488,
   "score": 6,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfbhg6",
   "message": "As I got older I find his movies not to be funny at all.",
   "created_utc": 1692805150,
   "score": 4,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfk7qc",
   "message": "He's the fucking best",
   "created_utc": 1692808375,
   "score": 5,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfn5qk",
   "message": "I'd always enjoyed his humour, though it's probably not for everyone.. much less the younger crowd these days.",
   "created_utc": 1692809444,
   "score": 5,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxeykqt",
   "message": "Seemingly talented guy who’s content to totally slum it in bad comedy after bad comedy",
   "created_utc": 1692800262,
   "score": 9,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxez2hh",
   "message": "I think he's funny! Happy Gilmore is my favorite movie of his. I thought Hubie Halloween was hilarious and I watch it every Halloween season.",
   "created_utc": 1692800456,
   "score": 8,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfbsw2",
   "message": "A lot of his movies are repetitive and not very funny unless you really like his movies.",
   "created_utc": 1692805268,
   "score": 12,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxesn1z",
   "message": "Adam Sandler is a smart actor. Not only is he funny, but he has his regular ensemble that comes along with him for his movies. He does do a lot of adult humor, but he also does a fair amount of kid safe movies as well (something not many actors/directors/producers can claim.)",
   "created_utc": 1692797839,
   "score": 17,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxf02yk",
   "message": "Never found him funny, but I have heard from multiple accounts across years that he is a genuinely good guy. That doesn’t make him funnier to me, but it does make me applaud his success and goodness.",
   "created_utc": 1692800856,
   "score": 11,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxeyt72",
   "message": "He makes mediocre movies, but he was funny on SNL and his early movies were funny.  That's pretty much my opinion of Adam Sandler.",
   "created_utc": 1692800355,
   "score": 7,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfkz2y",
   "message": "Legend",
   "created_utc": 1692808652,
   "score": 4,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfo05q",
   "message": "It's a 'the rock' situation for me. He plays the same person every single time for every movie so if you don't like that then it's hard to like the movies he does.",
   "created_utc": 1692809748,
   "score": 4,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfzrfg",
   "message": "He’s the inspiration of all my outfits. Not sure if that’s a good thing tho",
   "created_utc": 1692813904,
   "score": 4,
   "submission_id": "15z45u3"
  },
  {
   "comment_id": "jxfpy8r",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15z45u3"
  }
 ]
}