{
 "submission_id": "15z9cri",
 "title": "If Trump gets disqualified from running for president before the election, what do you think would happen?",
 "selftext": "",
 "created_utc": 1692809273,
 "permalink": "/r/AskReddit/comments/15z9cri/if_trump_gets_disqualified_from_running_for/",
 "score": 43,
 "url": "https://www.reddit.com/r/AskReddit/comments/15z9cri/if_trump_gets_disqualified_from_running_for/",
 "comments": [
  {
   "comment_id": "jxfny0n",
   "message": "One of the other candidates will be the Republican presidential nominee.",
   "created_utc": 1692809726,
   "score": 207,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfn1yd",
   "message": "He'll insist that he's still running, and when he doesn't win he'll claim that there was a huge conspiracy against him.",
   "created_utc": 1692809407,
   "score": 155,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfs0mj",
   "message": "His supporters will still vote for him as a write-in.  Those votes will not count.",
   "created_utc": 1692811189,
   "score": 110,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfmsn3",
   "message": "Guess that depends on how crazy all our crazy uncles are.",
   "created_utc": 1692809312,
   "score": 57,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfqelu",
   "message": "More people will hate more people...",
   "created_utc": 1692810616,
   "score": 146,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfxjp0",
   "message": "Lyndon H. Larouche Jr ran for president from prison, so really the bar to make someone \"disqualified\" from running is high. So high that if anyone was truly disqualified there would be numerous  Supreme Court challenges to the legitimacy of that election.\n\nIf...on the other hand...he was removed from the Republican primary he would probably lose momentum and every claim that he was cheated will come across as being a sore loser.",
   "created_utc": 1692813124,
   "score": 146,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfucww",
   "message": "- DeSantis gets the nomination\n\n- Trump, in an effort to boost his own ego and hit back against perceived wrongs from the GOP, will encourage his followers to vote for him as a write in candidate \n\n- The Republican vote will be split guaranteeing a DEM victory\n\n- The DNC will think, “hey cool we can just support Biden again instead of a someone the country actually wants”\n\n- Four years later, Trump will be dead, and both parties will have to promote a candidate that people actually want as a leader instead of a candidate who gets votes because people hate their opponent more\n\n- America wins and elects competent leaders, and is once again respected on the world stage. An era of peace and prosperity begins. All nations live together in harmony. \n\n- Then everything changes when the Fire Nation attacks",
   "created_utc": 1692812004,
   "score": 103,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxglat6",
   "message": "All of the MAGA people will have to lower their truck flags to half-staff.",
   "created_utc": 1692821825,
   "score": 52,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxh14dw",
   "message": "Whether he is behind bars or allowed to roam free, he absolutely will still be running for president. In no way will he ever put his support behind somebody else. It has always been about the Trump brand for him, not actual politics. He'd rather burn the country to the ground than work with another candidate to ensure a party victory. He is the party - in all meanings of the word.",
   "created_utc": 1692827701,
   "score": 15,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfndak",
   "message": "His supporters will go wild and say that the democrats framed him for everything.",
   "created_utc": 1692809519,
   "score": 81,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxgxh3e",
   "message": "Probably another attempt at an insurrection knowing the kinds of lunatics he tends to attract. Jan 6th 2: Electric Boogaloo. I'm sincerely worried about his trials attracting violent protestors.",
   "created_utc": 1692826313,
   "score": 16,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfnf5q",
   "message": "Not much. He'll still be a \"king-maker\" for the Republicans. His fans will still like him.\n\nSomeone else will run for the Republicans, they aren't just going to not give a candidate. And Trump is super old so if he's out of this election he's basically done. But he'll still be powerful and his support for any candidate would be huge.\n\nI could also see his sons running soon, riding the wave.",
   "created_utc": 1692809537,
   "score": 43,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhgjkh",
   "message": "A lot of MAGA snowflakes would threaten civil war but go home and hide.",
   "created_utc": 1692833998,
   "score": 1,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxgxkep",
   "message": "So here's the thing; there is NOTHING in the constitution that mandates a primary election. That's essentially a courtesy to the party. And yes, it's a VERY wise idea to have primaries. It means each party ostensibly gets a stronger candidate, it's a vetting procedure. BUT, if they wanted to, the RNC and DNC could simply put some soulless smiling suit on a stage and say \"This is our guy, vote for him in November!\" and that would be that. No laws broken, no constitutional crisis. Depending on trial schedules, we MIGHT actually see the Republicans put that into action! If Trump should be convicted of a crime that precludes him from holding office too late in, or after the primaries, the RNC may just say, \"Fuck it, here's Mitt Romney, again...\" or something along those lines.",
   "created_utc": 1692826348,
   "score": 8,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfvhuy",
   "message": "What would disqualify him?   Convicted Felons are allowed to run for President.",
   "created_utc": 1692812402,
   "score": 33,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfrfau",
   "message": "Who would disqualify him?  How would they do it?",
   "created_utc": 1692810978,
   "score": 19,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxh7yik",
   "message": "Then I might actually make a thoughtful decision. If it keeps Trump out of office, so be it. However, Biden is the second on my list of shouldn’t be in office. Can we get a 35-40 year old candidate?",
   "created_utc": 1692830431,
   "score": 5,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhc7vw",
   "message": "He will turn into another Rush Limbaugh, another Alex Jones x1000, Trump, even without the presidency, its a danger to the USA Democracy.",
   "created_utc": 1692832193,
   "score": 3,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhdz9r",
   "message": "As a non American, I find it amazing that the Americans apparently cannot find anyone in the 18-55 age group to run for president. Like seriously, your current candidates should have been retired for decades at this point.",
   "created_utc": 1692832924,
   "score": 4,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfuluj",
   "message": "He will run as a third party candidate and/or tell his cultists to write him in. And a lot of them will. \n  \nThe result will be a massive landslide victory for Biden with Trump and the GOP ticket splitting their votes.",
   "created_utc": 1692812091,
   "score": 9,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfs1v2",
   "message": "I’m not sure what will happen at the national level but I almost certainly will be getting very drunk in celebration.",
   "created_utc": 1692811201,
   "score": 12,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfmy15",
   "message": "[deleted]",
   "created_utc": 1692809368,
   "score": 3,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxg2jiz",
   "message": "I think I’ll turn off the news for a while...",
   "created_utc": 1692814902,
   "score": 3,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxgywtn",
   "message": "I think it will make his followers all the more ardent in their support.\n\n...Is being 'disqualified' a thing that can happen? I'm not being snarky, I have no idea if that is possible under the American political system.",
   "created_utc": 1692826856,
   "score": 3,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxh4mzu",
   "message": "Trump wouldn't be president",
   "created_utc": 1692829088,
   "score": 3,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxh92dx",
   "message": "Civil War 2.0?\n\nAt least, that's what the MAGA nutjobs will probably try. And then they can say that storming the Capitol was a practice run.",
   "created_utc": 1692830884,
   "score": 3,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhcyij",
   "message": "He will still try and run anyway, or at least put the appearance that he is, so that he can get those juicy campaign donations. I guarantee that a load of red ballots will have to be disqualified because they had \"Trump\" written on them. Even out of the race he will haunt the republican party.",
   "created_utc": 1692832503,
   "score": 4,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhdjmc",
   "message": "He will probably ask for donations to change the law so he can run. Something outlandishly stupid that isn't even a thing.\n\nWhatever happens its Obama's fault. Obv",
   "created_utc": 1692832745,
   "score": 3,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhgsuy",
   "message": "Hogs will cry about it until the end of time, and business will continue as usual",
   "created_utc": 1692834106,
   "score": 1,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxg5n2g",
   "message": "Considering he's not nearly as popular now I don't think there will be a major uproar like people think. Yeah people will be mad but they'll either get over it and vote for the guy representing their party or they won't and they'll die angry and bitter",
   "created_utc": 1692816003,
   "score": 4,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxg3cbt",
   "message": "He will 100% continue to run, pulling votes from the actual republican nominee and hand Biden a second term and most likely lose the house and senate for republicans.  \n\n\u0026amp;#x200B;\n\nSounds like an absolute win to me.",
   "created_utc": 1692815183,
   "score": 11,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfx0in",
   "message": "DeSantis will get the nomination and lose the general election.",
   "created_utc": 1692812938,
   "score": 8,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxgk65k",
   "message": "I'll answer your question with a question: What and who would disqualify him?\n\nI think the closest he comes to being \"disqualified\" results in him still running and probably getting the nomination.",
   "created_utc": 1692821409,
   "score": 4,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfou7s",
   "message": "Nothing",
   "created_utc": 1692810049,
   "score": 6,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxg9564",
   "message": "The whole USA implodes like the Witch Kings helmet, slowly, painfully. Not quick and sudden like the Oceangate Sub.\n\nJokes aside, it would likely cause some turmoil, at least to begin with. And then hopefully it all blows over and this part of the USA just becomes history that no one wants to talk about.",
   "created_utc": 1692817276,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxgi7x9",
   "message": "The better question is, what you think will happen if he doesn't get disqualified and actually wins the election?",
   "created_utc": 1692820689,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxgqn0k",
   "message": "Mass celebration. Also a whole bunch of crying and whining, but not much else.",
   "created_utc": 1692823764,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxgy2rk",
   "message": "Best case scenario is the magas write him in and vote for him",
   "created_utc": 1692826543,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxgzv41",
   "message": "They'll vote for him anyways",
   "created_utc": 1692827220,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxh4bfs",
   "message": "Another republican would pick up the nomination, but  would expect a lot of people adding Trump as a write-in candidate",
   "created_utc": 1692828962,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxh4w00",
   "message": "Mostly peaceful protests",
   "created_utc": 1692829189,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxh6p4s",
   "message": "It’ll never happen, so I’m not going to think on it too much.\n\nBut I imagine his base would insist on writing him in, overwhelming Democratic victory, followed by a low key civil war, or maybe the fever finally breaks and they find a new idol.",
   "created_utc": 1692829920,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhbvx5",
   "message": " A ton of maga will write him in.  The Republicans will lose in a land slide.  The stolen election rhetoric will ramp up and we'll probably see some ex maga politicians going to jail for various crimes committed to changing the results.",
   "created_utc": 1692832054,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhbwmz",
   "message": "Trump will run anyway.  He must run to avoid prosecution.  Trump will claim Dems are trying to rig the election.  Conservative media and the MAGA faithful will say the Dems are trying to stop Trump and let the voters decide.  I'm confident of this as that is what is happening with the prosecutions Trump is facing now.",
   "created_utc": 1692832063,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhcn1w",
   "message": "Some other Republican gets trounced by Dark Brandon.",
   "created_utc": 1692832368,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhcwqa",
   "message": "Like all other things and events in the world... everybody will just go on about their business.",
   "created_utc": 1692832482,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhdr94",
   "message": "Nothing. The GOP will still crash and burn.",
   "created_utc": 1692832833,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhdzti",
   "message": "Biden will be elected.  Desantis will claim it's all rigged.   Trump will declare himself the winner and ask for donations to stop the steal... Again",
   "created_utc": 1692832931,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhf1jc",
   "message": "Justice.",
   "created_utc": 1692833367,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhf20p",
   "message": "He'd get a lot of write in votes, thus splitting the gop vote. The less evil grandpa wins a second term.\n\nHopefully this throws the gop into disarray, and their moderates do some soul searching and make more humane choices in the future.",
   "created_utc": 1692833373,
   "score": 2,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhg0om",
   "message": "Life will go on.",
   "created_utc": 1692833777,
   "score": 1,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhg100",
   "message": "He would have a marginally harder time to claim he won, but most of his followers would still believe him anyway.",
   "created_utc": 1692833781,
   "score": 1,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhg2ie",
   "message": "Justice?",
   "created_utc": 1692833798,
   "score": 1,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhha1k",
   "message": "There will be weeping and gnashing of teeth.  But not from me.  The man is a turd.",
   "created_utc": 1692834305,
   "score": 1,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhlz48",
   "message": "The world will be that much better off.",
   "created_utc": 1692836298,
   "score": 1,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfvwhe",
   "message": "I don’t think they will ever actually charge him with anything unfortunately. Seems like it’s all for show. Nothing will change.",
   "created_utc": 1692812544,
   "score": 4,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxg0qbx",
   "message": "same thing as if he doesnt. Biden wins a 2nd term",
   "created_utc": 1692814253,
   "score": 5,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxh6q6p",
   "message": "IM FUCKING SICK OF HEARING TRUMP THROW THE BASTARD IN PRISON ALREADY OH WAIT THEY WON'T DO THAT BECAUSE AMERICA IS A CORRUPT SHITHOLE AND WOULD RATHER LET KIDS GET RIDDLED WITH BULLETS AND EAT SHITTY LUNCHABLES FOR SOR SCHOOL LUNCH BECAUSE OF LOBBYING AND THEYD RATHER BUILD FUCKING TANKS INSTEAD OF FUNDING PUBLIC SERVICES",
   "created_utc": 1692829932,
   "score": 3,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxhghy5",
   "message": "I just put a Pride flag in front of my house….just hope one of those MAGA half wits in my neighborhood has something to say about it.",
   "created_utc": 1692833979,
   "score": 1,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxg3qvq",
   "message": "We'd have Joe Biden running again's Ron \"Pudding Fingers\" DeSantis. No matter who wins, America loses...",
   "created_utc": 1692815326,
   "score": 6,
   "submission_id": "15z9cri"
  },
  {
   "comment_id": "jxfvypi",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15z9cri"
  }
 ]
}