{
 "submission_id": "15z9i82",
 "title": "What older generation’s advice you found funny which later turned out to be true?",
 "selftext": "",
 "created_utc": 1692809594,
 "permalink": "/r/AskReddit/comments/15z9i82/what_older_generations_advice_you_found_funny/",
 "score": 139,
 "url": "https://www.reddit.com/r/AskReddit/comments/15z9i82/what_older_generations_advice_you_found_funny/",
 "comments": [
  {
   "comment_id": "jxfzumw",
   "message": "Freezing food always seemed so weird to me. Then I had to buy my own groceries and realized that I could buy meat when it's on sale/clearance and have a nice stockpile. When COVID first hit, it was so nice to have so much available food, and now that everything is super expensive it's great to go early in the morning, buy marked down meat and then freeze it for later.",
   "created_utc": 1692813936,
   "score": 124,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfpdlo",
   "message": "If it sounds too good to be true, it usually is.",
   "created_utc": 1692810246,
   "score": 220,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfu4lh",
   "message": "Teenagers are stupid.",
   "created_utc": 1692811922,
   "score": 82,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfyzvg",
   "message": "“The older you get, the faster time goes by.” I rolled my eyes every time I heard that. \n\nYeah…",
   "created_utc": 1692813632,
   "score": 214,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg93ap",
   "message": "I was a waiter in my early 20s and there was a grizzled old dishwasher who told me, \"Everything catches up to you. Everything.\" I blew him off because I was young and knew it all and was gonna be young forever. Or so I thought. I later found out he was absolutely correct for good or bad.",
   "created_utc": 1692817256,
   "score": 250,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg6b5n",
   "message": "“When you’re choosing who to marry, don’t focus on looks. Looks don’t last forever. Focus on voice, that does last forever and you’re going to be listening to that voice for the rest of your life.”\n\nDamn true.",
   "created_utc": 1692816240,
   "score": 12,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfz1qw",
   "message": "I'm 50 and I am finally starting to go blind\n\nStill no hair on my palms though",
   "created_utc": 1692813650,
   "score": 110,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgikba",
   "message": "The military will just chew you up and spit you out. —My Grandfather, USMC 1939-1946",
   "created_utc": 1692820815,
   "score": 177,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg5hy5",
   "message": "I thought I would have so many pets as an adult when I could do what I want. Turns out I love animals but hate taking care of them. Too much money and responsibility. Now I see why parents didn't want a bunch of animals.",
   "created_utc": 1692815952,
   "score": 251,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgii1d",
   "message": "The company only has your back if it’s in their financial interests",
   "created_utc": 1692820792,
   "score": 131,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgkmf6",
   "message": "My nan had 4 kids , when I was pregnant with my first baby my nan told me \"when you have been through labour and need a wee for the love of god bend over and grab your ankles\". I thought she was being weird and just laughed it off, now I tell all mums to be to grab Thier ankles for that first wee because urine and a stretched coochie does not mix well.",
   "created_utc": 1692821576,
   "score": 112,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfyf6t",
   "message": "That one of the students was actually a cop. Turns out he was a cop and busted one of the actual students for selling handguns in school.\n\nIf you thought 21 jump street was unrealistic think again. Cop was a 33 year old male and undercover for like half the semester.",
   "created_utc": 1692813429,
   "score": 143,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgm6wz",
   "message": " “the days are long but the years are short” advice received when I was a new parent",
   "created_utc": 1692822148,
   "score": 106,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgaaxi",
   "message": "It's cheaper to hire a professional to do the job than to try and save a couple dollars to do it yourself.",
   "created_utc": 1692817710,
   "score": 221,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgbg8c",
   "message": "Youth is wasted on the young.",
   "created_utc": 1692818141,
   "score": 210,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg2djq",
   "message": "Air out your home. \n\nMy parents did this obsessively. I thought it was insane. Turns out, indoor air quality is pretty bad to start with and gets worse with gas fires and people breathing.",
   "created_utc": 1692814843,
   "score": 191,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfz8ab",
   "message": "My dad used to say it doesn’t matter what job you have, and it doesn’t even matter if you like it. As long as you get some sucker to pay for your benefits (instead of you paying for them) you’ll always be doing very well in life.",
   "created_utc": 1692813713,
   "score": 29,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg7a4d",
   "message": "\"There's nothing sexier than a man with a 9-5 job.\" \n\n- Hank Hill",
   "created_utc": 1692816586,
   "score": 140,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgmn24",
   "message": "When you’re in your 20’s, you worry about what people think about you. \n\nWhen you’re in your 30’s, you don’t worry about what people think about you \n\nWhen you’re in your 40’s, you realize nobody ever cared or thought about you.",
   "created_utc": 1692822309,
   "score": 111,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfybn3",
   "message": "In high school: that the biology teacher was growing weed in the environmental lab. Supposedly he did it for 30 years without anyone noticing. No one could ever prove it though.\n\nLater on, I was assigned to be the agent taking care of some of his financial matters, so I went to his house to have him sign some paperwork. He had a hydroponic setup there, so I asked him about the environmental lab. It was like Han Solo in The Force Awakens.\n\n“It’s true. All of it.” Then he offered me a brownie.",
   "created_utc": 1692813394,
   "score": 122,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfnp6c",
   "message": "Don’t make a mountain out of a mole hill.\n\nThere’s not enough dirt, it’s physically impossible unfortunately",
   "created_utc": 1692809637,
   "score": 71,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfooye",
   "message": "Spend less time looking at the clock.",
   "created_utc": 1692809996,
   "score": 69,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg3rzc",
   "message": "In business there is no such thing as a free lunch",
   "created_utc": 1692815337,
   "score": 57,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxge6r5",
   "message": "keep a jacket in your car young lady",
   "created_utc": 1692819168,
   "score": 34,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg01l4",
   "message": "Don’t take a girl out for sushi unless you’re gonna marry her - ‘cause sushi is expensive.\n\n\nI took the girl out anyway and man, it was expensive as hell. We didn’t get married",
   "created_utc": 1692814006,
   "score": 149,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgme06",
   "message": "My great Uncle always told me \"never volunteer for anything.\"\n\nYears later I realised he was right because as soon as people know you are willing to help they always come to you first.",
   "created_utc": 1692822218,
   "score": 56,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfz4ef",
   "message": "Can confirm, as a former teenager who was once convinced I knew everything. Wisdom comes with age!",
   "created_utc": 1692813676,
   "score": 51,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgnvtv",
   "message": "Nothing good happens after midnight. As a former bartender, I ignored this rule for a decade. After working late nights, I 100% agree. It’s like a switch in people’s minds go off at 12.",
   "created_utc": 1692822761,
   "score": 60,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg2wdi",
   "message": "Learn when to keep your mouth shut.",
   "created_utc": 1692815027,
   "score": 22,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg9p91",
   "message": "“Happiness comes from within - it doesn’t matter what you have.”",
   "created_utc": 1692817485,
   "score": 28,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg8qja",
   "message": "Save old jars and containers to use as cheap/free Tupperware and storage",
   "created_utc": 1692817125,
   "score": 23,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgonw6",
   "message": "My grandfather told me not to fuck other people over, that I don’t do this is a genuine joy in my life",
   "created_utc": 1692823044,
   "score": 25,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgdskb",
   "message": " My grandpa always had this advice. \"If you want to make more money then change careers not job\".\n\nProbably makes more sense if your work in trade type jobs but I have been around long enough where I have seen people job jump for $.25 an hour and basically be financially in the same or worse position because they didn't realize something like healthcare premiums where cheaper or they weren't fully vested in there 401k when they left so now they lost a chunk of their retirement saving.",
   "created_utc": 1692819020,
   "score": 20,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg16hz",
   "message": "An older teacher of mine in high school taught if you ask enough people out eventually you'll land someone way out of your league. Even though I was an awkward nerd in HS that next year's homecoming I landed my now ex and there were lots of jealous guys with angry girlfriends with lots of attention on me and my date. I ran into her not too long ago, and I swear she could probably go be a Hollywood actor or make it as a Victoria's Secret model if she wanted to",
   "created_utc": 1692814414,
   "score": 72,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg1g2v",
   "message": "\"Don't trust the government!\" \n\nI used to think grumpy old men were just looking for someone to blame for their problems, but now I think they've got a point.",
   "created_utc": 1692814510,
   "score": 113,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfygo4",
   "message": "There was always a rumor that the head janitor was a huge pothead and would smoke with students in one of the storage sheds away from the main building. I always figured it was bullshit until my friend CJ sent me a pic of him and the janitor smoking weed while surrounded by folding chairs.",
   "created_utc": 1692813443,
   "score": 33,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgb5r6",
   "message": "Study hard now. You can play later!",
   "created_utc": 1692818032,
   "score": 26,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgsks7",
   "message": "If the women dont find you handsome they better at least find you handy",
   "created_utc": 1692824482,
   "score": 25,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfo0zf",
   "message": "Back then, me hating high school. My parents missing high school. They were telling me to appreciate it more, because the life would be harder after, and I didn't believe them. Turned out to be true.",
   "created_utc": 1692809756,
   "score": 97,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfyhys",
   "message": "In my Catholic (Jesuit) high school, one of the priests and one of the nuns were very close friends. We all loved them, and we could see that they were quite fond of one another (and they made a really nice looking couple). We used to affectionately kid them about \"meeting in the tunnel\" between the convent and the rectory. A few years after my class graduated, they both left their Orders, got married, and had kids. We're all happy for them.",
   "created_utc": 1692813456,
   "score": 96,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgckqy",
   "message": "You shouldn’t waste your money on possessions like clothing, jewelry and cars because they only lose value and no one is impressed by any of it. Yeah now I agree!",
   "created_utc": 1692818565,
   "score": 27,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgh1xp",
   "message": "Youth is wasted on the young. You had it right grandma",
   "created_utc": 1692820250,
   "score": 14,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgdbgq",
   "message": "You're free to wear sunscreen\n\nTake care of your teeth\n\nWork hard at school",
   "created_utc": 1692818844,
   "score": 13,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxga30b",
   "message": "Youth does not fear consequence.",
   "created_utc": 1692817630,
   "score": 21,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgo36l",
   "message": "Say nothing 'till you hear more.",
   "created_utc": 1692822836,
   "score": 13,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgy9ii",
   "message": "Mark Twain had a great quote (and I can’t recall the exact wording) that went something like this…\n\nAt 16, I realized my father was an idiot. By the time I turned 21, I was amazed at how much he learned in just five years",
   "created_utc": 1692826613,
   "score": 25,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxglvm9",
   "message": "Naps",
   "created_utc": 1692822037,
   "score": 9,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxh5aky",
   "message": "Watch what you wish for . The grass is always not always greener on the other side . Don't burn your bridges down.",
   "created_utc": 1692829351,
   "score": 8,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg41kp",
   "message": "When I was engaged, a few weeks before the wedding, my fiancée asked me to come to her parents house for a weekend barbecue. when I arrived, I went to the backyard and was surprised to find nobody there, so I knocked on the door. Her sister opened it, saw me there and said, “Just one second!” and closed the door.\n\nthen she called for me to come in, and she was completely naked. She said, “Everyone else just left to go to the store. We have 45 minutes alone. I know you’ll be married soon, so why don’t we have some fun while you still can?” Then she walked away to her room. I couldn’t help staring… her body is fantastic.\n\nBut then I realized I was about to make a terrible decision, turned around, and walked straight out the door down the driveway. My fiancée and her parents were there. She looked like she’d been a nervous wreck, but she ran up to me, hugged me, and told me that she knew I was a good man. Her father shook my hand and officially welcomed me to the family.\n\nI’ll never forget my grandfather’s advice that saved my relationship that day: “Always keep a pack of condoms in your car.”",
   "created_utc": 1692815433,
   "score": 72,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxglrsx",
   "message": "My very wise Grandmother always said “Don’t even think about getting married until you’re 30!”\n\nThanks Nana 🙌❤️",
   "created_utc": 1692821997,
   "score": 14,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgewzc",
   "message": "Time does make things feel better. You do just naturally and eventually get over shit",
   "created_utc": 1692819444,
   "score": 12,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxghhqz",
   "message": "“Tsk….there’s always something “",
   "created_utc": 1692820416,
   "score": 4,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgmzf5",
   "message": "\"You don't have to go to all of the parties\".",
   "created_utc": 1692822434,
   "score": 6,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxh2uws",
   "message": "Never trust a fart.",
   "created_utc": 1692828384,
   "score": 11,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxfnr9p",
   "message": "no fast food",
   "created_utc": 1692809658,
   "score": 10,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg1114",
   "message": "If it flies, floats, or fucks - rent it.",
   "created_utc": 1692814359,
   "score": 13,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgbgkc",
   "message": "Young people are particularly vulnerable to propaganda, misinformation and fake news. \nYoung people spend a significant amount of their time watching television, playing online games, chatting, blogging, listening to music, posting photos of themselves and searching for other people with whom to communicate online. \nThey rely heavily on information circulated online for their knowledge of the world and how they perceive reality.",
   "created_utc": 1692818145,
   "score": 19,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxg8swd",
   "message": "\"Don't run on the stairs, you will fall down.\"",
   "created_utc": 1692817149,
   "score": 5,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgdn00",
   "message": "You are what you eat.",
   "created_utc": 1692818963,
   "score": 8,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgzebk",
   "message": "“You look down, get some sunshine”\n\nI thought I had depression and anxiety… \nIt turned out I was medically diagnosed with vitamin D deficiency, and those were the symptoms.",
   "created_utc": 1692827042,
   "score": 10,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgqs1a",
   "message": "You know what the thing is? They may be 100% turn out to be true, but those adults rarely explain how to actually achieve the advice they gave you. Like, \"Just be yourself\" is a good one, but what exactly should you do for that? They never tell you. \"Learn to just ignore bad people\" — sure, it would be great. But how exactly do I? They can't explain.",
   "created_utc": 1692823816,
   "score": 7,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxh17cf",
   "message": "Opa (grandpa) used to tell me \"don't waste time with a girl who's fingernails are longer than thier fingertips.. they won't do thier 50% of a relationship\"\n\nAnd anecdotally it was very true. Every girl I dated with really long (or fake) fingernails, didn't know how to cook, wouldn't get dirty or clean, and would expect me to do all the household work..\n\nThanks Opa, found a girl with short fingernails and it's been 16 years of marriage",
   "created_utc": 1692827732,
   "score": 18,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgc9zj",
   "message": "All of it probably.",
   "created_utc": 1692818452,
   "score": 3,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgkoux",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxh1t76",
   "message": "People used to tell me all the time that eating bad would catch up with me. I didn’t believe it because even through my twenties I was stick thin and scrawny. That changed almost immediately on my 30th birthday",
   "created_utc": 1692827969,
   "score": 7,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxh1tnx",
   "message": "\"be careful lifting heavy things\" not even 30 and I got back problems. Turns out those old guys with fucked up backs were onto something.",
   "created_utc": 1692827974,
   "score": 6,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgzuyj",
   "message": "There’s nothing new under the sun.",
   "created_utc": 1692827219,
   "score": 5,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxh5wqq",
   "message": "If you fail to plan then you plan to fail.",
   "created_utc": 1692829603,
   "score": 5,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxhfev4",
   "message": "Good health is the crown only the sick can see",
   "created_utc": 1692833524,
   "score": 4,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxgvoe9",
   "message": "'You look like a clown' said my dad on viewing my ridiculous 70s outfit\n What did he know, the old square? Turns out he was right.",
   "created_utc": 1692825638,
   "score": 3,
   "submission_id": "15z9i82"
  },
  {
   "comment_id": "jxh35bj",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15z9i82"
  }
 ]
}