{
 "submission_id": "15zb4kk",
 "title": "Whats the one thing that makes you think \"I'm with the boomers on this one?\"",
 "selftext": "",
 "created_utc": 1692812976,
 "permalink": "/r/AskReddit/comments/15zb4kk/whats_the_one_thing_that_makes_you_think_im_with/",
 "score": 19,
 "url": "https://www.reddit.com/r/AskReddit/comments/15zb4kk/whats_the_one_thing_that_makes_you_think_im_with/",
 "comments": [
  {
   "comment_id": "jxgboui",
   "message": "Being on your phone constantly with company is rude. A quick polite check is fine, but just idly scrolling communicates that you're bored and theres things youd rather be doing.",
   "created_utc": 1692818231,
   "score": 30,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgnst4",
   "message": "Concerts should start around 5 pm and wrap up by 8 or 9.",
   "created_utc": 1692822731,
   "score": 135,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg254u",
   "message": "I don't want to use my phone at dinner. I don't want to scan a QR code. Give me a damn menu.",
   "created_utc": 1692814761,
   "score": 24,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg81vn",
   "message": "Not everything needs an app. It seems like they're trying to jam a connected app into every single product nowadays. It's ridiculous and unnecessary. I just want to buy a normal ass blender or whatever without having to deal with all that.",
   "created_utc": 1692816869,
   "score": 136,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxfzou2",
   "message": "Kids need to go outside more and get off of electronics",
   "created_utc": 1692813878,
   "score": 182,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg5k70",
   "message": "I'm a big fan of space exploration and civil rights, the boomers were pretty into those, too.",
   "created_utc": 1692815974,
   "score": 215,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxfy04k",
   "message": "Your music sucks",
   "created_utc": 1692813284,
   "score": 47,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg07rb",
   "message": "\"A time-out with a screen in their room is not a time-out.\"\n\nKids need to learn how to just sit and be quiet for long periods of time. And the best way to teach them is for the parents to also learn to just sit and be quiet for long periods of time.\n\nParents, if you don't want your kids addicted to screens, you too mustn't be addicted to screens.",
   "created_utc": 1692814068,
   "score": 127,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgfi11",
   "message": "airplanes should be comfortable",
   "created_utc": 1692819664,
   "score": 185,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg5loh",
   "message": "Read a book! Listen more!",
   "created_utc": 1692815989,
   "score": 189,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgpfbf",
   "message": "Stop moving everything at the grocery store every year, ugh.",
   "created_utc": 1692823320,
   "score": 12,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg553r",
   "message": "Being able to get a union job out of high school that a single person could use to buy a starter home should be something our generation also has.",
   "created_utc": 1692815826,
   "score": 39,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg3jw7",
   "message": "Men's business suits were better in the 40's, 50's and mid 60's. The bizarre 70's cut, the T-shirt with jacket from the 80's, the huge oversized suits of the 90's, and the skinny crap with huge shoes that make you look like Pinocchio today were all mistakes that should be erased from people's memory.",
   "created_utc": 1692815257,
   "score": 103,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg4720",
   "message": "You're not exhibiting a trauma response, you're just an asshole.",
   "created_utc": 1692815487,
   "score": 206,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg70zc",
   "message": "Why does everything have to be a fucking web video?",
   "created_utc": 1692816496,
   "score": 97,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgcwdy",
   "message": "Caps with a perfectly flat brim.",
   "created_utc": 1692818687,
   "score": 56,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgia43",
   "message": "Buying pants with rips already in them is stupid. You know how I got rips in my pants as a youth? Being a klutz.",
   "created_utc": 1692820711,
   "score": 103,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxggtda",
   "message": "QR codes for menus at restaurants.\n\nForeign entities/people owning land and houses.  Want to buy a house in USA, be a citizen.",
   "created_utc": 1692820159,
   "score": 158,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg9ha8",
   "message": "I'm not going to scan a damn QR code to read your restaurant's menu",
   "created_utc": 1692817401,
   "score": 112,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgqopv",
   "message": "For the love of God, pull your fucking pants up! I don't need to see your damn underwear when you're out in public.",
   "created_utc": 1692823781,
   "score": 58,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg8t50",
   "message": "I've noticed boomers don't give a damn if an artist they listened or a show they watched did something that can be deemed \"problematic\", and I'm in the same boat (within reason). Listening to something doesn't automatically affiliate you with the Bad Thing that person did. Hell, there's been times I've genuinely been out of the loop and didn't learn about the Bad Thing until later.\n\nDon't get me wrong, sometimes I'll distance myself because it tainted the music/media/whatever or if it's straight up harmful, but the guilty by association mentality lots of people have now is a bit too far.",
   "created_utc": 1692817152,
   "score": 158,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgt2lx",
   "message": "Hook-up culture ruined romance. Can’t stand what now defines a romantic relationship.",
   "created_utc": 1692824667,
   "score": 129,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgwvmu",
   "message": "The phones, man. It's not great for your mental health, but whenever you try to explain to someone that \"Hey maybe constantly being online reading about how everything is going to shit and you can't do anything about it is bad for your mental health\" they reduce it down to you saying the phone is the cause of everything bad in their life and ignore it",
   "created_utc": 1692826089,
   "score": 45,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxfxlwn",
   "message": "Learn to have a laugh and shake the small insignificant stuff off.",
   "created_utc": 1692813145,
   "score": 49,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxfy2sn",
   "message": "Having a good handshake. I always remember the terrible ones.",
   "created_utc": 1692813310,
   "score": 83,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgyikh",
   "message": "Don’t post every location, activity, and GOD FORBID your children on your public social media accounts.",
   "created_utc": 1692826706,
   "score": 71,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgzh4j",
   "message": "Not everything needs to be wireless/rechargeable. I hate having to remember to plug in everything before I go to bed every night.",
   "created_utc": 1692827071,
   "score": 183,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgig2j",
   "message": "Digital menus.\n\nSeriously, nobody wants to scan a damn QR code so they can look at your restaurant's menu on a 4 inch phone screen.\n\nGive us paper menus.  I'm with the boomers on this one.",
   "created_utc": 1692820772,
   "score": 67,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg4uzs",
   "message": "If you want to live in America permanently, you need to learn English. I don't have a problem with accommodating Spanish-speakers who are new to America or temporary expats by having signs and shit in Spanish too. Learning a new language as an adult is very difficult. But I can't imagine moving to a foreign country and not making any attempt to learn the local language. I think you're missing out on so much connection with other people in the area and you just can't ever really become a part of the main society. It's just lazy and disrespectful.",
   "created_utc": 1692815728,
   "score": 136,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxfyztf",
   "message": "Sorry not boomers, before that. We need to bring back respectful and consented duels to the death. Those generations knew how to settle a dispute and quickly move on.",
   "created_utc": 1692813632,
   "score": 68,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgluyu",
   "message": "The septum piercings. MOOO",
   "created_utc": 1692822030,
   "score": 65,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgf7fe",
   "message": "Well... As a person with MDD I feel like maybe I won't get AS killed for this lol\n\nWhen dealing with depression, you can't wait to magically feel amazing to get on with it. At some point you absolutely have to just go live your damn life. I've had days where I *couldn't* get out of bed and have had the bad ideation at times as well, and I'm not talking about those times. I'm talking about the fact that a lot of people cycle through 8000 meds waiting passively to feel better while they're lying on the couch watching Netflix and making no other changes. \n\nIt's not overnight. You need support to do it. Meds can absolutely be lifesaving. You probably have to tackle some problems you would rather ignore. But my point is that if you work on yourself, life can get better. If you don't, it's almost guaranteed not to. \n\nI know so many people who wallow in self-pity and point the blame at anyone but themselves, and then can't understand why they've strained every relationship they have and no one wants to talk to them. My brother in Christ, if everyone you know is an asshole...\n\nAnyway yeah the boomers are right that you have to bootstrap depression a little bit, and not that it's your fault you have it, but you have to work on yourself to make it better. It's easy to stay in that hole, but cut it out. Try harder to live while you're alive.",
   "created_utc": 1692819554,
   "score": 41,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgo2j3",
   "message": "Pull up your fucking pants. Nobody wants to see your ass and dirty underwear. Seriously, do you fucking people not know what a belt is??",
   "created_utc": 1692822830,
   "score": 16,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxghw7a",
   "message": "Young people should be able to buy a house before 30",
   "created_utc": 1692820569,
   "score": 64,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgsggg",
   "message": "Tiktok.",
   "created_utc": 1692824437,
   "score": 18,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgt175",
   "message": "Older cars are better than newer ones.",
   "created_utc": 1692824651,
   "score": 8,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg09uo",
   "message": "Progressive isn't synonymous with good.",
   "created_utc": 1692814089,
   "score": 59,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg7nbt",
   "message": "“Victim blaming” can be a good thing. If someone dies because they drove drunk and crashed into a tree without a seatbelt, I’m absolutely going to say that their shitty decisions lead to their death. If someone says “I got mugged and all I did was walk by myself in an unfamiliar sketchy area while holding my money and counting it,” then they’re an idiot.\n\n“Victim blaming” is bad when the implication is “the perpetrator deserves no blame”, but it’s GOOD when the implication is “the victim could have made different choices and had a different outcome.”  I don’t see it as much these days, but some young people act like we should get rid of OSHA because the regulations are written in response to someone being victimized.",
   "created_utc": 1692816716,
   "score": 80,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgpg2r",
   "message": "Black people using the n-word should be treated exactly as harshly as how everyone else using it are treated.",
   "created_utc": 1692823328,
   "score": 14,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgne20",
   "message": "People are too soft and entitled these days.  Their problems are trivial compared to what's going on in the rest of the world, or the problems the older generations faced.",
   "created_utc": 1692822582,
   "score": 14,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgx9q8",
   "message": "I totally agree that I should buy a house for $10000 in 1961",
   "created_utc": 1692826236,
   "score": 56,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgfr7p",
   "message": "The Beatles are great.",
   "created_utc": 1692819761,
   "score": 15,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgpej6",
   "message": "Working isn’t that hard and you’re all way too sensitive. Stop being lazy and learn to take a joke.",
   "created_utc": 1692823313,
   "score": 10,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgq37g",
   "message": "Social media is ridiculous and bad for everyone.",
   "created_utc": 1692823562,
   "score": 36,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg1md7",
   "message": "i'm with the boomers who say the recent generations are soft and entitled. egocentric \"gimme\" generations.",
   "created_utc": 1692814574,
   "score": 20,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg6x02",
   "message": "Having Medicare to fall back on when I'm older and not working anymore sure is a wonderful feeling!",
   "created_utc": 1692816456,
   "score": 23,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgnr8i",
   "message": "Kids need to ride skateboards in natural environments, not just skateboard parks.",
   "created_utc": 1692822715,
   "score": 2,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgplwl",
   "message": "ANYTHING that has to do with QR codes and talking to a machine when I need customer help, even if it's a cashier at a fast food place. I have questions and I don't wanna be touching the same screen hundreds of strangers have touched.",
   "created_utc": 1692823386,
   "score": 14,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgu213",
   "message": "It’s too dang loud in here",
   "created_utc": 1692825031,
   "score": 19,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxh188l",
   "message": "Give me knobs back for cars. I don't want to fiddle with your glorified iPad. I want the AC knob to always be exactly where I know it'll be and to have tactile sensations that let me feel how I've interacted with the knobs without looking at them.",
   "created_utc": 1692827742,
   "score": 138,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxh2d6b",
   "message": "Stop it with the QR codes for everything. I’m tired of it. \n\nThere are some kids who don’t respond to gentle parenting. Stop being their friend and start being their parent. \n\nDating apps have taken away the courage it takes to go up to someone and introduce yourself. \n\nWe don’t need all this extra technology in cars or appliances. I dont need my fridge or dishwasher to “sing” to me. \n\nPut your fucking phone away at a concert.",
   "created_utc": 1692828189,
   "score": 43,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgwc62",
   "message": "Everything starts later in the day than I’d prefer.  I don’t need dinner at 4, but I’m not going to a party that starts at 11",
   "created_utc": 1692825885,
   "score": 28,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgwlzh",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgs8xk",
   "message": "We deserve a reasonable pension rather than being forced to privately fund retirement",
   "created_utc": 1692824359,
   "score": 29,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgud9m",
   "message": "Work ethics",
   "created_utc": 1692825147,
   "score": 8,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg046o",
   "message": "Loan forgiveness is a sham",
   "created_utc": 1692814033,
   "score": 3,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgrojs",
   "message": "Music made from 1964-1994 is, across all genres, superior to what's being made today.",
   "created_utc": 1692824147,
   "score": 8,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgvoaa",
   "message": "This thread is mainly full of awful dogshit backwards takes.",
   "created_utc": 1692825637,
   "score": 3,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg8b8b",
   "message": "Student loan forgiveness is a travesty",
   "created_utc": 1692816970,
   "score": 0,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxfxi7v",
   "message": "When they certify the blast site is ready for the TNt",
   "created_utc": 1692813110,
   "score": 1,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgu0nc",
   "message": "I shouldn’t have to press 1 for English. You can marque el dos para Español.",
   "created_utc": 1692825017,
   "score": 1,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxg6sh7",
   "message": "General integrity and moral expectations,",
   "created_utc": 1692816412,
   "score": 1,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgwk82",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxh2gum",
   "message": "Does everything in your house *have* to be grey, from the couches to the laminate floors? Even the nursery and the toys in it? It just looks so...cold and sterile. There's not even a pillow or anything to add color. Maybe a plant (a foliage plant, no flowers), but that's it. Ugh. (And don't even get me started on that godawful open-concept floor plan and the tables and countertops that could slice someone in half.)",
   "created_utc": 1692828230,
   "score": 104,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgqvgq",
   "message": "Most concerts were general admission \u0026amp; affordable",
   "created_utc": 1692823850,
   "score": 164,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxh7btz",
   "message": "Tipping is appropriate for servers, valet, and delivery drivers and NO ONE ELSE",
   "created_utc": 1692830178,
   "score": 106,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxh17l7",
   "message": "Air Dryers in restrooms are bullshit. Paper towels every time",
   "created_utc": 1692827735,
   "score": 101,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxh6hqk",
   "message": "The world being ok with kids doing things unaccompanied or unsupervised was better. We as a society in general are not letting our kids go to the park, ride bikes, go to whatever random place is nearby to build a Fort etc. They learn to socialize and problem solve on their own that way. \n\nWe are doing them a disservice and it leads to the teenagers I see who can’t even order at a takeout window and hide behind their parents while it’s done for them. Either there’s startling amounts of crippling social anxiety or were enabling the shit out of them. I think the restrictions placed on kids at a young age so that everything is made to be organized and safe is not helping.",
   "created_utc": 1692829838,
   "score": 60,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxh797y",
   "message": "Rock n‘ roll needs to make a comeback.",
   "created_utc": 1692830148,
   "score": 26,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgwsmf",
   "message": "Wearing a hat indoors looks ridiculous.",
   "created_utc": 1692826057,
   "score": 5,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhcjvg",
   "message": "Work ethic",
   "created_utc": 1692832332,
   "score": 5,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhg5gk",
   "message": "Too much shit needs an account. You have to make a username and password for EVERYTHING. Reddit, reading the news, playing video games, paying any sort of bill, going to the doctors, the list goes on. Of course sometimes the password you commonly use doesnt work for some accounts or you need to think of a new one every 6 months or your email get obliterated by junk mail. I cant keep remembering new passwords.",
   "created_utc": 1692833832,
   "score": 136,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxh64x8",
   "message": "The same craftsmanship should be put into a website as it is with a fine piece of furniture.",
   "created_utc": 1692829693,
   "score": 17,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhh4b7",
   "message": "No need to speed down a residential street blasting music while revving the engine at night. No one cares you’re trying to impress the sneaky link.",
   "created_utc": 1692834239,
   "score": 68,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhi2b8",
   "message": "Get rid of these goddamn control panel screens in cars!\n\nBRING BACK SWITCHES AND BUTTONS!!!",
   "created_utc": 1692834631,
   "score": 165,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhjwvz",
   "message": "Tik Tok is a garbage fire",
   "created_utc": 1692835416,
   "score": 70,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgzy7r",
   "message": "It's stupid for the drive through employee to ask me if I'll be using the mobile app today.\n\nThis is a hill I'm willing to die on with the boomers while all the people in my generation tell me to stop being crazy and just scan the damn qr thingy.",
   "created_utc": 1692827254,
   "score": 28,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhkq3a",
   "message": "QR code menus",
   "created_utc": 1692835758,
   "score": 11,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhdic5",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhq894",
   "message": "Car lights are too bright",
   "created_utc": 1692838122,
   "score": 80,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhj8rc",
   "message": "I like clunky, clacky keyboards with deep travel. Get outta here with those thin keyboards with 1.5mm travel that bottom out as soon as your fingers brush up against the keys. And touchscreen keyboards ... Ugh.\n\nRelated: I hate autocorrect and autocomplete. I know what I'm typing.",
   "created_utc": 1692835128,
   "score": 46,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhr0kb",
   "message": "Early 30's here.\n\nPhysical Menu at restaurants. Give them to me.\n\nI don't want to whip out my phone, and scan a bunch of shit, and wait for it to load, and everything else.",
   "created_utc": 1692838458,
   "score": 30,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxh6ydw",
   "message": "I ain’t tippin counter service!!!",
   "created_utc": 1692830024,
   "score": 20,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhf918",
   "message": "People shouldn’t have personal electronics nearly out of the womb",
   "created_utc": 1692833455,
   "score": 17,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxgn35k",
   "message": "My love for New Balance sneakers",
   "created_utc": 1692822471,
   "score": 13,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhpfa5",
   "message": "I can turn light switches off on my own. I can use a metal key to unlock door. I know if I need to buy onions. I know where I left my keys, and my phone, and my everything else.",
   "created_utc": 1692837775,
   "score": 11,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhxrzf",
   "message": "Life was better before we carried a phone around with us all the time.  \n\nYour life doesn’t need an audience.\n\nSocial media is ruining our lives",
   "created_utc": 1692841377,
   "score": 18,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxh8xmq",
   "message": "I'll be dead before things get better.",
   "created_utc": 1692830829,
   "score": 9,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhgjgc",
   "message": "Get off my lawn!",
   "created_utc": 1692833997,
   "score": 11,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhaf1u",
   "message": "Texting in theaters",
   "created_utc": 1692831442,
   "score": 8,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhhah7",
   "message": "A new “updated” version of everything every year gets tiresome and often doesn’t result in improvements.",
   "created_utc": 1692834310,
   "score": 9,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhg6cj",
   "message": "The gym is for actually working out. No one will watch your video.",
   "created_utc": 1692833843,
   "score": 11,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxhjbzt",
   "message": "Mind your own business",
   "created_utc": 1692835166,
   "score": 7,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxi411k",
   "message": "Stop canceling people who made mistakes 10+ years ago (within reason). People change. I’m so tired of trying to keep up with everything.",
   "created_utc": 1692844153,
   "score": 11,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxh7qh8",
   "message": "Math. I saw my cousin's kid's grade 4 math homework and how they have to do it. I have never seen stuff made so needlessly complicated.",
   "created_utc": 1692830340,
   "score": 7,
   "submission_id": "15zb4kk"
  },
  {
   "comment_id": "jxig0lw",
   "message": "Privacy\n\nSorry but I don’t need social media using my info to optimize my ads. \n\nI don’t need to announce every tidbit of my life online or in person. \n\nI should be able to come here, look at silly things, and comment in peace.",
   "created_utc": 1692850332,
   "score": 8,
   "submission_id": "15zb4kk"
  }
 ]
}