{
 "submission_id": "15zfkz8",
 "title": "What’s something that happened on a first date that made you decide against a second date?",
 "selftext": "",
 "created_utc": 1692822378,
 "permalink": "/r/AskReddit/comments/15zfkz8/whats_something_that_happened_on_a_first_date/",
 "score": 46,
 "url": "https://www.reddit.com/r/AskReddit/comments/15zfkz8/whats_something_that_happened_on_a_first_date/",
 "comments": [
  {
   "comment_id": "jxgosx5",
   "message": "He took it out. \n\nAnd I don't mean this in a funny \"unexpected Seinfeld\" kind of way (although I suppose it IS that). \n\nI mean he leaned across the table and whispered \"I'm out.\"\n\nI said \"excuse me?\" For some reason my first thought was \"out of the closet.\"\n\nHe said \"out, under the table. Look under the table.\"\n\nAnd, like an idiot, I LOOKED.\"\n\nThen he said \"that's what you do to me.\"\n\nI said \"this is what you do to me\" and I left.\n\nI'm a people pleaser so, to this day, I'm proud of myself for walking away in the middle of dinner.",
   "created_utc": 1692823094,
   "score": 180,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgo08l",
   "message": "Guess I’ll repost this here. \n\nShe kept talking about the \"emergency dick\" she had stashed around the city.\n\nShe was like \"I've been really busy with [grad] school but I don't go without. I have plenty of emergency dick around town.\"\n\nAnd when I say she kept going on, I mean she KEPT GOING ON. She was telling me about the two guys downtown, three in the suburbs, one near campus, and two in her apartment complex.\n\nIt honestly sounded like I was new to town and she was giving me a rundown of all the best places to visit. \n\nJust weird.\n\n**EDIT:** She said she was looking to settle down into a relationship (whereas she had only been in situationships before). She also said she had a “virgin heart”.",
   "created_utc": 1692822806,
   "score": 72,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgp650",
   "message": "He tried to change my order with the waitress because I didn’t order what he’d recommended.",
   "created_utc": 1692823228,
   "score": 61,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgr8vn",
   "message": "A guy cracked a joke about feeding my cat arsenic. I didn’t even finish the date, just got up and left.",
   "created_utc": 1692823986,
   "score": 50,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgnh2h",
   "message": "Constantly checking their phone and not engaging in conversation.",
   "created_utc": 1692822612,
   "score": 33,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgycsi",
   "message": "I asked what she did for a living over nachos on our date. \n\n\"What?!! I don't work, I'm white!\"\n\nSaid that in a Mexican restaurant in front of our waitress. \n\nI apologized to the waitress and paid our tab. Walked out. I don't care if she got home safely.",
   "created_utc": 1692826646,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgrvms",
   "message": "He got us pulled over, car was searched and he had a brick of coke in the trunk. I almost got arrested. He finally vouched this was a blind date and I was innocent.",
   "created_utc": 1692824221,
   "score": 63,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgqupt",
   "message": "I met the future mother in law.",
   "created_utc": 1692823842,
   "score": 15,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgxcmy",
   "message": "Dude talked about going to visit and pet his dead cat in the woods.  He became upset when I said that might not be the most hygienic thing to do and retaliated by suggesting I don’t properly clean my jewelry.  Yeah…bye (almost ran out of the restaurant) \nETA he showed me pics of the dead cat.  Also to clarify:  He didn’t want me to go visit it with him (like for a second date lol).  Then I really would have taken off running.",
   "created_utc": 1692826266,
   "score": 16,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgn3gx",
   "message": "Telling me I'm not allowed a prenup",
   "created_utc": 1692822474,
   "score": 15,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh0536",
   "message": "He told me his 14 year old cousin seduced him when he was 21.  And it was somehow her fault he molested her becuase she was \"asking for it\", and she knew he hadn't had any in a long time. And, he had recently been released from prison for it.",
   "created_utc": 1692827326,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgyaj0",
   "message": "We went on a lunch date. I wanted to keep it casual, low stakes. Just a meet and chat.\n\nShe asked me back to her house after lunch. It was, like, 2:30ish? I thought, \"What the heck? Have a Coke, get a feel for who she is, chat a bit more. Sure. Innocent enough.\"\n\nTurns out, she wanted to enjoy conjugal relations with me. In her bedroom. With her 8 year old kid who had just gotten home from school watching TV in the living room.\n\nI declined the opportunity and left pretty abruptly. And that was that.",
   "created_utc": 1692826623,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgtt4e",
   "message": "I’ve experienced this too many times: guys who come home with you and, when they realize sex isn’t happening, they decide to take a nap in your bed. What are you doing??",
   "created_utc": 1692824939,
   "score": 10,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgudu9",
   "message": "This is NOT a joke. A good friend of mine set me up on a double date to see the movie Babel. What a downer of a movie... a terrible first date movie.",
   "created_utc": 1692825153,
   "score": 10,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgwwx1",
   "message": "He tried to control the whole date. What I dressed, ate, if I wore make up or not, how I wore my hair. \n\nHe had this long list. Let's just say I answered the door with bed head and baggy PJs. Told him to buy a blow up doll to control, don't contact me ever again and closed the door.",
   "created_utc": 1692826103,
   "score": 19,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgpu79",
   "message": "Pushing the sex stuff.",
   "created_utc": 1692823471,
   "score": 9,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgx89b",
   "message": "Casual racism from one. Another one only spoke about themselves and I felt like it was interviewing them",
   "created_utc": 1692826220,
   "score": 8,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxguudx",
   "message": "She started joking/talking about all the crazy conspiracy theories she believes in.  Nope. Not the one for me.  At first it was pretty lighthearted and she was talking about things in a joking manner, but it became more and more clear that she actually believed much of the nonsense she was spewing.",
   "created_utc": 1692825327,
   "score": 7,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgv1yn",
   "message": "His awful breath that kept bouncing off the table and invading my nasal passages.",
   "created_utc": 1692825406,
   "score": 7,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh47wg",
   "message": "While we were having lunch we ran into some friend of hers I didn't know and he stopped to say hi and their brief conversation somehow brought up that she owed the guy a meal because he'd paid for their last lunch together, so she offered to pay for his lunch to square it away and he agreed. He ordered something to go and they told the waitress she'd pay for it, they both said their goodbyes, and the guy left us alone to go wait for his lunch at some other table.\n\nSo far so good, though their conversation was a bit strange it did seem like it came up organically, it didn't needlessly drag on, and the guy was nice at all times and also polite enough to make himself scarce as soon as possible instead of inserting himself into our lunch date with the excuse that he was waiting for his food.\n\nSo we continued our conversation and everything seemed fine, until some time later after the friend had already left and it was time to settle our check, and I realized this girl obviously expected me to pay for the whole thing including the lunch she offered to pay for her friend as a way to pay him back for the favor he did her. \n\nNow, even if the friend hadn't ordered a pretty pricey meal that cost more than the rest of our check put together (and he had done exactly that), it didn't sit well with me how she had shamelessly decided to pay back him back with my money in what seemed like a deliberate scam.\n\nSo I paid for the whole thing in order to avoid making a scene, but later brought it up and told her that it wasn't cool. She made it clear that she saw nothing wrong with it and said I was being cheap and childish, so I thanked her for her honesty and told her we were done and I wasn't going to be calling her again, she tried to argue that I was overreacting but I held firm and blocked her a couple of days later because she insisted on texting me to convince me that I was wrong and we should go out again. Some people really live in an alternate dimension.",
   "created_utc": 1692828923,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgnzb3",
   "message": "They were very negative. I want to be with someone who is positive and upbeat because I know how draining it is to be around someone constantly complaining.",
   "created_utc": 1692822797,
   "score": 14,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgy632",
   "message": "Dude forgot we were supposed to go to lunch. Blamed it on being overwhelmed moving and lost track of time. We still met up and he was on his phone scrolling videos for the most part and even left the table to take a phone call from his roommate. He was hot, but not that hot.",
   "created_utc": 1692826577,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh05he",
   "message": "This was weird but years ago I went out on a date with a guy that voicefished(?) me. Like catfished with his voice. He had already sent me a video that he was talking in, but when I met him he sounded completely different with a slight lisp. Which I would have gotten over except he ended up taking me to a gas station to talk to his friend at the pump for 45 minutes. I faked an emergency and went home. I have much worse first dates than that but that one left me flabbergasted.",
   "created_utc": 1692827330,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh28ed",
   "message": "First red flag…he made me split a $15 check, second red flag…he kept insisting I follow him to his house after the bar, final red flag… He stole the $20 tip I left for the bartender out of the check book and pocketed it…absolutely disgusting.",
   "created_utc": 1692828136,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgpu7w",
   "message": "She called evil dead a stupid movie with shitty graphics",
   "created_utc": 1692823471,
   "score": 8,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgwi30",
   "message": "He happened to drive tractor trailer in the city and spoke with something close to delight about how he would use his vehicle to scare the poop out of people who were dumb enough to try and pass on the right during a wide turn.\n\nThis display of \"don't get mad, get even\" was a huge red flag.",
   "created_utc": 1692825946,
   "score": 4,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgymm3",
   "message": "Phone going off with messages from multiple other females which he showed me for some strange reason, felt like he was trying to make himself more appealing or me jealous on a first date weirdo. 🚩 \n\nAnd anyone that texts ‘u up’ in the middle of the night after a first date no thank ya ma’am.",
   "created_utc": 1692826748,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh25k1",
   "message": "After dinner in a nicer restaurant, she progressed our relationship to dating for a few years, living together, married, her expecting our first kid and then finding out I had been cheating, and loudly demanding to know why I’d do that. I just laughed and our waitress looked horrified, she’d been standing at the staff station for the entire thing. \n\nI excused myself to the bathroom, waitress followed cause she knew I wanted to get the hell outta dodge, paid with a very nice tip, and bailed. \n\nWe met at the place so I knew she wasn’t stranded. I’m not an AH.",
   "created_utc": 1692828104,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh3k8c",
   "message": "I asked about his hobbies and he said \"I play the bagpipes\". I thought that was really cool and asked him to tell me more. He says, \"Are you sure?\" I said \"Yes\"\n\nHe proceeds to go on about bagpipes for the rest of the night. How he felt playing the bagpipes was his calling in life, how he needed to carry his grandfather's legacy (who also played the bagpipes), how his dream was to play bagpipes for the queen, his favourite brand of bagpipes, the anatomy of bagpipes...every topic was somehow turned back to bagpipes.\n\nTo be fair, I did say yes to him telling me more. I hope he's doing well and found someone just as passionate about bagpipes.",
   "created_utc": 1692828658,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgsp5m",
   "message": "She wanted to have sex right off.",
   "created_utc": 1692824527,
   "score": 5,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgu2qr",
   "message": "She spit my cum back into my mouth.",
   "created_utc": 1692825039,
   "score": 9,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgxgly",
   "message": "Here voice sounded exactly like Janice from friends and somehow her face didn't match the voice worse than Janice.",
   "created_utc": 1692826308,
   "score": 3,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh3v86",
   "message": "The waitress was a lovely young black woman. He referred to her as being attractive for a ‘colored’. He touched her which is not ok. You don’t touch your waitress. \nMade aggressive ‘looks’ at another table where a family was dining (they were what looked to be Indian) and commented loudly that they were what was wrong with America. \nHad multiple tequila shots. \nHis cologne stank to high heaven. \nI was so embarrassed. \nI was raised to be patient \u0026amp; polite but finally I was like ‘wtf am I doing still here? I stood up and left leaving my half eaten meal on the table. \nHe yelled insults at me as I was leaving then when I was out the door texted me. \nPure trash.",
   "created_utc": 1692828781,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgzn3m",
   "message": "Went on a cute picnic date, then went to an arcade and had an amazing time. She took me back to her place and we went at it like animals. \n\nAfter the deed is done and we are laying in bed and breathing like we ran a 100-meter race, she looks over and says;\n\n\" I haven't had sex like that since doing meth with my ex.\"",
   "created_utc": 1692827135,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxguwwp",
   "message": "As a girl, I payed and their was no spark. Just awkwardness. We weren't friends after that. lol",
   "created_utc": 1692825352,
   "score": 4,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgzpy8",
   "message": "She had a weiner",
   "created_utc": 1692827166,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh0c4m",
   "message": "She said \"yeah, I'm not really feelin' it.\" Oh well. Can't please everyone",
   "created_utc": 1692827400,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh1774",
   "message": "I walked into the guys house and there was nazi shit all over his place, not in a collector kind of way but in a crazy kind of way, there was a mannequin wearing a kkk outfit in the corner! He was a satellite friend who i knew, but didn't know well. I've never come down with food poisoning so fast before, i got the fuck out of there, i was able to play sick for a couple days but it was super awkward ghosting him beings we had the same friends, for the longest time i didn't go places he was at.",
   "created_utc": 1692827730,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh1dp3",
   "message": "Very recent- asked when I would get a real career. I love what I do, I'm a union stagehand in a major entertainment city. I have been in my industry for over 20 years, toured the country, toured the world, make a comfortable living. Yeah- no. That's pretty demeaning and I'm out.",
   "created_utc": 1692827800,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh22ru",
   "message": "Me carrying the conversation the entire time, I just don't bother with a second if your answer is going to be \"yes or no\" without substance",
   "created_utc": 1692828073,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh2kmq",
   "message": "The date felt more like a job interview to fill a position, rather than an actual date. He gave off a vibe of someone who wasn't into getting to know me as a person, but just listed his wants and needs. So at the end of the date, he asked how I thought it went and I said I didn't feel a click / match. And he said, yeah, he was missing the 'wow-factor'. So I laughed my ass off (slightly offended) in the car home, Gosh, no idea I was auditioning for a contest.\n\nI was happy we only went for drinks, but even that felt a bit too long.",
   "created_utc": 1692828272,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh2t4w",
   "message": "She showed up drunk to a casual daytime first date, at a bar I frequented heavily. Proceeded to order a premium skinny rocks margarita and downed it. Ordered a second one. Conversation was all over the place, I was pretty much done. I went to the bathroom, came back, she had another margarita being served. She went to the bathroom after that and the bartender (who I was pretty cool with) flat out asked me, “Sea Vast, bro, is she your date? When she ordered the 3rd one I said she needed to slow down, she told me it’s OK, you were paying and you’d drive her home.” I told him I’m going to bounce, if she doesn’t pay her tab text me and let me know so I can pay it later. He was cool with that. So I did. \n\nShe did pay her tab. She randomly texted me a few days later and asked if I was doing OK. I did not respond.",
   "created_utc": 1692828365,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh2v7h",
   "message": "Waitress dropped a tray of drinks and she laughed at her.",
   "created_utc": 1692828387,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh33pb",
   "message": "He didn’t stand up to greet me when I arrived at the table nor did he stand up to say goodbye when I was leaving",
   "created_utc": 1692828479,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh3ki7",
   "message": "It was more of what didn’t happen for me. She was a perfectly nice girl and we had talked about getting dinner together at a place she liked because she said it was really good. \n\nThe issue was that the conversation just didn’t really flow. Everything felt really forced and she didn’t talk too much. It wasn’t anything against her but it didn’t feel natural so I figured it was a sign to move on. My current gf and I spent hours just chatting at a random bar we went to the first time we hung out. Literally chatting about anything and everything. The conversation flowed so naturally with her",
   "created_utc": 1692828661,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh40wp",
   "message": "Being told. “The welts on my crotch aren’t contagious”",
   "created_utc": 1692828845,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh4mut",
   "message": "The women lied about her weight complained I don’t earn enough based on my car and job at the time then teased me all night before getting cold feet \n\nI don’t mind if your body shape is not barbie but don’t lie about it and I don’t like playing mind games if your interested then your interested if your not that’s fine but layout expectations",
   "created_utc": 1692829087,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgxckq",
   "message": "\"Hmmm...? Sorry, what was that?\"",
   "created_utc": 1692826266,
   "score": 2,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgn3e6",
   "message": "She fatfished me. \n\nDid the whole sneaky camera angle thing and then showed up looking ten times bigger than the picture and just hoped I wouldn't notice?",
   "created_utc": 1692822473,
   "score": 3,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgz4vj",
   "message": "She never showed up.\n\nI’d say that’s a red flag, but I never got a chance to see what color it was.",
   "created_utc": 1692826940,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgq1d4",
   "message": "She bled all over my new jeans after fat fishing me. My fault for not asking for a full body picture. We made out, she bled in me and I left",
   "created_utc": 1692823543,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgnbah",
   "message": "i just dont feel that something that would make me want to go on the second one. we either dont vibe or i dont find myself seeing them anymore. nothing personal, i just see on the spot if someone fits me or not.",
   "created_utc": 1692822554,
   "score": 0,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgz3h6",
   "message": "She ordered a tuna melt. I paid for the meal. But no thanks.",
   "created_utc": 1692826926,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh2t0q",
   "message": "tHeY wERe rUdE tO wAItInG StAFf",
   "created_utc": 1692828363,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgvs5k",
   "message": "Talking with them felt like talking to a brick wall. Seriously, I could’ve had a more productive conversation with a brick wall by the end of that date.",
   "created_utc": 1692825677,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgz4ot",
   "message": "“I’m sorry, I can’t see what you’re talking about.”",
   "created_utc": 1692826938,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgzitq",
   "message": "Poor table manners",
   "created_utc": 1692827090,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh0hi7",
   "message": "She was about twice the size of her pictures. Made an excuse an left. Sorry not sorry.",
   "created_utc": 1692827457,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh0v25",
   "message": "He almost did not talk at all.",
   "created_utc": 1692827601,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh1xtf",
   "message": "I met her parents on the first date and she was terrified of me. Most awkward date ever.",
   "created_utc": 1692828020,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh31gk",
   "message": "Not me, but my friend went out with a guy who got drunk and shat his pants on the first date 😂😂🤣",
   "created_utc": 1692828456,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh3314",
   "message": "She ate liver and onions 😝",
   "created_utc": 1692828472,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh3pes",
   "message": "When he said “I took off work today to prepare for our date tonight”. Why did he need all day to prepare? What did he think was going to happen? It was very strange. Never saw him again.",
   "created_utc": 1692828715,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh532y",
   "message": "Guy told me he wrote away for a Russian bride. And ended up going to Russia with the intention of marrying some woman he didn’t know.",
   "created_utc": 1692829267,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh56aa",
   "message": "Anger. When I was looking to get married, I went on a lot of one-dates-and-we're-done.  There were a lot of angry women in their early 30s.\n\nMy wife says the same thing about her experiences with lots of angry men in their 30s.  \n\nFortunately, we ran into each other and have been together about 25 years now.",
   "created_utc": 1692829303,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh58fw",
   "message": "I was on a date with this dude, and his ex just showed up in the middle of our meal to give him his garage door opener. The guy clearly had no idea how the ex knew where he was, but the ex clearly knew we were on a date. It was really freaking weird. He was a nice dude, I really like him, but I dunno, it kinda just ruined it for me... I know thats not super fair, but it was just really weird. I'm pretty sure his ex was stalking him, and I don't need that in my life.",
   "created_utc": 1692829327,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh5bb8",
   "message": "He took an enormous belch and then snickered about it like it's funny. It's not Waffle House, bro. So gross.",
   "created_utc": 1692829359,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh5k80",
   "message": "Her kid called me Daddy.",
   "created_utc": 1692829460,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh5kvo",
   "message": "Her father used a wash cloth to wipe his ass",
   "created_utc": 1692829467,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh5u2x",
   "message": "A few of my favorite ones; from most recent to oldest. \n\n\"I don't really connect with animals. I don't want any pets, ever.\" Well, my profile has my two cats and a dog on it, so this isn't gonna work out. Not sure why she swiped right on me. Or didn't notice when she asked what I was doing and I told her I was out walking the dog, and we do an hour long loop of the neighborhood every day. \n\nThere was the one that had a profile of a physically fit attractive woman my age, but the person that arrived was 15 years older and 150+ pounds heavier. I decided to stay and not say anything about it because the texting conversation went well. But 5 minutes into the date she hit me with a series of slurs and racist opinions, and I only waited until she was done talking because the shit she said was so unhinged and not based in reality that I needed to hear the end of the rant before I left. (Only reason I stayed to the end of the rant was so that I could share with my friends later and laugh at her. We had some good times out of quoting her and laughing at how dumb she was.)\n\nAnd finally, I asked one about what she does at her job because it sounds interesting. When the date was over I hadn't said much of anything else. But I heard about her job, how she got into her job, her friends, her college experience, her high school experience, her family, her ex, her other ex, that car accident she got in when she was a teen, her three trips to Disney World, etc. Interestingly enough she was upset I didn't talk more and I thought \"When? You didn't take a single breath for 45 minutes straight, when was I supposed to squeeze in a word or two?\"\n\nThere was the one where she spent more time talking about Taylor Swift than anything else, and found a way to jam her into conversations where it didn't make sense. I figured she didn't want to date me, she wanted to date Taylor Swift, and got out of there. At this time I had heard of exactly one Taylor Swift song, and had basically no idea that the girl who put out Shake It Off was anything more than a one hit wonder.",
   "created_utc": 1692829572,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6d6j",
   "message": "He started discussing marriage.\n\nThis was a first date, I barely knew him (I did know that he was coming off a broken engagement).  He already had a trip to Aruba booked (would have been the honeymoon) and was talking about how great it would be to give me a ring there.\n\nI barely knew him.  He was nice enough but I was not at the stage in life (I was in college) to even have marriage on my mind.  (He was either 3 or 4 years older than me, I can't remember).  Not a bad person but we were at different points in life.",
   "created_utc": 1692829786,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6ibd",
   "message": "1) having to insist on going to my own place and almost jumping out of the cab cause he wanted me to go to his place\n\n2) we kissed after dinner and for the whole way home he was absolutely sticky and glued to me\n\n3) I think he roofied me...",
   "created_utc": 1692829844,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6jlj",
   "message": "While not on a date, as a bartender you see a lot of bad dates. \n\nThe most recent I witnessed was a military guy (made sure to bring it up) was talking about his previous marriage. Just cringy all around. He would later go on (in a quiet bar with 5 people max) about all the dates he goes on, his buddies hyping him up. Heard him interrupting his date, and constantly turning the convo back on himself. \n\nIdk what happened, but I closed them out on two separate tabs, they were both bad tippers, so maybe they deserve each other",
   "created_utc": 1692829858,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6ky3",
   "message": "Told me that aliens cause jet lag and that I have the ghost of a fisherman following me around named Samuel (on top of the 20 other batshit things she said at dinner. \n\nThis was last night.",
   "created_utc": 1692829873,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6otf",
   "message": "He was undressing every semi attractive women who walked into the coffee shop with his eyes, I was surprised he wasn’t slack jawed and drooling. But he wouldn’t make eye contact with ne",
   "created_utc": 1692829917,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6ps0",
   "message": "The date was going great but we were talking about family, friends, and all that and I realized that I’d slept with her sister. I didn’t really know what to do but you can’t just say “oh your family looks fun and I slept with your sister not too long ago. Show me more pics of your dog, is she a lab mix?” \n\nI cut the date short after dinner and hoped it’d just fizzle out, but they found out. It was cool though, just an awkward coincidence.",
   "created_utc": 1692829927,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6x2a",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15zfkz8"
  }
 ]
}