{
 "submission_id": "15zfkz8",
 "title": "What’s something that happened on a first date that made you decide against a second date?",
 "selftext": "",
 "created_utc": 1692822378,
 "permalink": "/r/AskReddit/comments/15zfkz8/whats_something_that_happened_on_a_first_date/",
 "score": 126,
 "url": "https://www.reddit.com/r/AskReddit/comments/15zfkz8/whats_something_that_happened_on_a_first_date/",
 "comments": [
  {
   "comment_id": "jxgosx5",
   "message": "He took it out. \n\nAnd I don't mean this in a funny \"unexpected Seinfeld\" kind of way (although I suppose it IS that). \n\nI mean he leaned across the table and whispered \"I'm out.\"\n\nI said \"excuse me?\" For some reason my first thought was \"out of the closet.\"\n\nHe said \"out, under the table. Look under the table.\"\n\nAnd, like an idiot, I LOOKED.\"\n\nThen he said \"that's what you do to me.\"\n\nI said \"this is what you do to me\" and I left.\n\nI'm a people pleaser so, to this day, I'm proud of myself for walking away in the middle of dinner.",
   "created_utc": 1692823094,
   "score": 134,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgo08l",
   "message": "Guess I’ll repost this here. \n\nShe kept talking about the \"emergency dick\" she had stashed around the city.\n\nShe was like \"I've been really busy with [grad] school but I don't go without. I have plenty of emergency dick around town.\"\n\nAnd when I say she kept going on, I mean she KEPT GOING ON. She was telling me about the two guys downtown, three in the suburbs, one near campus, and two in her apartment complex.\n\nIt honestly sounded like I was new to town and she was giving me a rundown of all the best places to visit. \n\nJust weird.\n\n**EDIT:** She said she was looking to settle down into a relationship (whereas she had only been in situationships before). She also said she had a “virgin heart”.",
   "created_utc": 1692822806,
   "score": 152,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgp650",
   "message": "He tried to change my order with the waitress because I didn’t order what he’d recommended.",
   "created_utc": 1692823228,
   "score": 18,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgr8vn",
   "message": "A guy cracked a joke about feeding my cat arsenic. I didn’t even finish the date, just got up and left.",
   "created_utc": 1692823986,
   "score": 19,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgnh2h",
   "message": "[removed]",
   "created_utc": 1692822612,
   "score": 42,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgycsi",
   "message": "I asked what she did for a living over nachos on our date. \n\n\"What?!! I don't work, I'm white!\"\n\nSaid that in a Mexican restaurant in front of our waitress. \n\nI apologized to the waitress and paid our tab. Walked out. I don't care if she got home safely.",
   "created_utc": 1692826646,
   "score": 236,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgrvms",
   "message": "He got us pulled over, car was searched and he had a brick of coke in the trunk. I almost got arrested. He finally vouched this was a blind date and I was innocent.",
   "created_utc": 1692824221,
   "score": 7,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgqupt",
   "message": "I met the future mother in law.",
   "created_utc": 1692823842,
   "score": 242,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgxcmy",
   "message": "Dude talked about going to visit and pet his dead cat in the woods.  He became upset when I said that might not be the most hygienic thing to do and retaliated by suggesting I don’t properly clean my jewelry.  Yeah…bye (almost ran out of the restaurant) \nETA he showed me pics of the dead cat.  Also to clarify:  He didn’t want me to go visit it with him (like for a second date lol).  Then I really would have taken off running.",
   "created_utc": 1692826266,
   "score": 191,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgn3gx",
   "message": "Telling me I'm not allowed a prenup",
   "created_utc": 1692822474,
   "score": 39,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh0536",
   "message": "He told me his 14 year old cousin seduced him when he was 21.  And it was somehow her fault he molested her becuase she was \"asking for it\", and she knew he hadn't had any in a long time. And, he had recently been released from prison for it.",
   "created_utc": 1692827326,
   "score": 196,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgyaj0",
   "message": "We went on a lunch date. I wanted to keep it casual, low stakes. Just a meet and chat.\n\nShe asked me back to her house after lunch. It was, like, 2:30ish? I thought, \"What the heck? Have a Coke, get a feel for who she is, chat a bit more. Sure. Innocent enough.\"\n\nTurns out, she wanted to enjoy conjugal relations with me. In her bedroom. With her 8 year old kid who had just gotten home from school watching TV in the living room.\n\nI declined the opportunity and left pretty abruptly. And that was that.",
   "created_utc": 1692826623,
   "score": 147,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgtt4e",
   "message": "I’ve experienced this too many times: guys who come home with you and, when they realize sex isn’t happening, they decide to take a nap in your bed. What are you doing??",
   "created_utc": 1692824939,
   "score": 143,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgudu9",
   "message": "This is NOT a joke. A good friend of mine set me up on a double date to see the movie Babel. What a downer of a movie... a terrible first date movie.",
   "created_utc": 1692825153,
   "score": 40,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgwwx1",
   "message": "He tried to control the whole date. What I dressed, ate, if I wore make up or not, how I wore my hair. \n\nHe had this long list. Let's just say I answered the door with bed head and baggy PJs. Told him to buy a blow up doll to control, don't contact me ever again and closed the door.",
   "created_utc": 1692826103,
   "score": 25,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgpu79",
   "message": "Pushing the sex stuff.",
   "created_utc": 1692823471,
   "score": 190,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgx89b",
   "message": "Casual racism from one. Another one only spoke about themselves and I felt like it was interviewing them",
   "created_utc": 1692826220,
   "score": 122,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxguudx",
   "message": "She started joking/talking about all the crazy conspiracy theories she believes in.  Nope. Not the one for me.  At first it was pretty lighthearted and she was talking about things in a joking manner, but it became more and more clear that she actually believed much of the nonsense she was spewing.",
   "created_utc": 1692825327,
   "score": 57,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgv1yn",
   "message": "His awful breath that kept bouncing off the table and invading my nasal passages.",
   "created_utc": 1692825406,
   "score": 142,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh47wg",
   "message": "While we were having lunch we ran into some friend of hers I didn't know and he stopped to say hi and their brief conversation somehow brought up that she owed the guy a meal because he'd paid for their last lunch together, so she offered to pay for his lunch to square it away and he agreed. He ordered something to go and they told the waitress she'd pay for it, they both said their goodbyes, and the guy left us alone to go wait for his lunch at some other table.\n\nSo far so good, though their conversation was a bit strange it did seem like it came up organically, it didn't needlessly drag on, and the guy was nice at all times and also polite enough to make himself scarce as soon as possible instead of inserting himself into our lunch date with the excuse that he was waiting for his food.\n\nSo we continued our conversation and everything seemed fine, until some time later after the friend had already left and it was time to settle our check, and I realized this girl obviously expected me to pay for the whole thing including the lunch she offered to pay for her friend as a way to pay him back for the favor he did her. \n\nNow, even if the friend hadn't ordered a pretty pricey meal that cost more than the rest of our check put together (and he had done exactly that), it didn't sit well with me how she had shamelessly decided to pay back him back with my money in what seemed like a deliberate scam.\n\nSo I paid for the whole thing in order to avoid making a scene, but later brought it up and told her that it wasn't cool. She made it clear that she saw nothing wrong with it and said I was being cheap and childish, so I thanked her for her honesty and told her we were done and I wasn't going to be calling her again, she tried to argue that I was overreacting but I held firm and blocked her a couple of days later because she insisted on texting me to convince me that I was wrong and we should go out again. Some people really live in an alternate dimension.",
   "created_utc": 1692828923,
   "score": 212,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgnzb3",
   "message": "They were very negative. I want to be with someone who is positive and upbeat because I know how draining it is to be around someone constantly complaining.",
   "created_utc": 1692822797,
   "score": 75,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgy632",
   "message": "Dude forgot we were supposed to go to lunch. Blamed it on being overwhelmed moving and lost track of time. We still met up and he was on his phone scrolling videos for the most part and even left the table to take a phone call from his roommate. He was hot, but not that hot.",
   "created_utc": 1692826577,
   "score": 128,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh05he",
   "message": "This was weird but years ago I went out on a date with a guy that voicefished(?) me. Like catfished with his voice. He had already sent me a video that he was talking in, but when I met him he sounded completely different with a slight lisp. Which I would have gotten over except he ended up taking me to a gas station to talk to his friend at the pump for 45 minutes. I faked an emergency and went home. I have had much worse first dates than that but that one left me flabbergasted.",
   "created_utc": 1692827330,
   "score": 214,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh28ed",
   "message": "First red flag…he made me split a $15 check, second red flag…he kept insisting I follow him to his house after the bar, final red flag… He stole the $20 tip I left for the bartender out of the check book and pocketed it…absolutely disgusting.",
   "created_utc": 1692828136,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgpu7w",
   "message": "She called evil dead a stupid movie with shitty graphics",
   "created_utc": 1692823471,
   "score": 0,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgwi30",
   "message": "He happened to drive tractor trailer in the city and spoke with something close to delight about how he would use his vehicle to scare the poop out of people who were dumb enough to try and pass on the right during a wide turn.\n\nThis display of \"don't get mad, get even\" was a huge red flag.",
   "created_utc": 1692825946,
   "score": 4,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgymm3",
   "message": "Phone going off with messages from multiple other females which he showed me for some strange reason, felt like he was trying to make himself more appealing or me jealous on a first date weirdo. 🚩 \n\nAnd anyone that texts ‘u up’ in the middle of the night after a first date no thank ya ma’am.",
   "created_utc": 1692826748,
   "score": 51,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh25k1",
   "message": "After dinner in a nicer restaurant, she progressed our relationship to dating for a few years, living together, married, her expecting our first kid and then finding out I had been cheating, and loudly demanding to know why I’d do that. I just laughed and our waitress looked horrified, she’d been standing at the staff station for the entire thing. \n\nI excused myself to the bathroom, waitress followed cause she knew I wanted to get the hell outta dodge, paid with a very nice tip, and bailed. \n\nWe met at the place so I knew she wasn’t stranded. I’m not an AH.",
   "created_utc": 1692828104,
   "score": 49,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh3k8c",
   "message": "I asked about his hobbies and he said \"I play the bagpipes\". I thought that was really cool and asked him to tell me more. He says, \"Are you sure?\" I said \"Yes\"\n\nHe proceeds to go on about bagpipes for the rest of the night. How he felt playing the bagpipes was his calling in life, how he needed to carry his grandfather's legacy (who also played the bagpipes), how his dream was to play bagpipes for the queen, his favourite brand of bagpipes, the anatomy of bagpipes...every topic was somehow turned back to bagpipes.\n\nTo be fair, I did say yes to him telling me more. I hope he's doing well and found someone just as passionate about bagpipes.",
   "created_utc": 1692828658,
   "score": 22,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgsp5m",
   "message": "She wanted to have sex right off.",
   "created_utc": 1692824527,
   "score": 5,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgu2qr",
   "message": "She spit my cum back into my mouth.",
   "created_utc": 1692825039,
   "score": 9,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgxgly",
   "message": "Here voice sounded exactly like Janice from friends and somehow her face didn't match the voice worse than Janice.",
   "created_utc": 1692826308,
   "score": 3,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh3v86",
   "message": "The waitress was a lovely young black woman. He referred to her as being attractive for a ‘colored’. He touched her which is not ok. You don’t touch your waitress. \nMade aggressive ‘looks’ at another table where a family was dining (they were what looked to be Indian) and commented loudly that they were what was wrong with America. \nHad multiple tequila shots. \nHis cologne stank to high heaven. \nI was so embarrassed. \nI was raised to be patient \u0026amp; polite but finally I was like ‘wtf am I doing still here? I stood up and left leaving my half eaten meal on the table. \nHe yelled insults at me as I was leaving then when I was out the door texted me. \nPure trash.",
   "created_utc": 1692828781,
   "score": 12,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgzn3m",
   "message": "Went on a cute picnic date, then went to an arcade and had an amazing time. She took me back to her place and we went at it like animals. \n\nAfter the deed is done and we are laying in bed and breathing like we ran a 100-meter race, she looks over and says;\n\n\" I haven't had sex like that since doing meth with my ex.\"",
   "created_utc": 1692827135,
   "score": 214,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxguwwp",
   "message": "As a girl, I payed and their was no spark. Just awkwardness. We weren't friends after that. lol",
   "created_utc": 1692825352,
   "score": 4,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgzpy8",
   "message": "She had a weiner",
   "created_utc": 1692827166,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh0c4m",
   "message": "She said \"yeah, I'm not really feelin' it.\" Oh well. Can't please everyone",
   "created_utc": 1692827400,
   "score": 197,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh1774",
   "message": "I walked into the guys house and there was nazi shit all over his place, not in a collector kind of way but in a crazy kind of way, there was a mannequin wearing a kkk outfit in the corner! He was a satellite friend who i knew, but didn't know well. I've never come down with food poisoning so fast before, i got the fuck out of there, i was able to play sick for a couple days but it was super awkward ghosting him beings we had the same friends, for the longest time i didn't go places he was at.",
   "created_utc": 1692827730,
   "score": 104,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh1dp3",
   "message": "Very recent- asked when I would get a real career. I love what I do, I'm a union stagehand in a major entertainment city. I have been in my industry for over 20 years, toured the country, toured the world, make a comfortable living. Yeah- no. That's pretty demeaning and I'm out.",
   "created_utc": 1692827800,
   "score": 142,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh22ru",
   "message": "Me carrying the conversation the entire time, I just don't bother with a second if your answer is going to be \"yes or no\" without substance",
   "created_utc": 1692828073,
   "score": 35,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh2kmq",
   "message": "The date felt more like a job interview to fill a position, rather than an actual date. He gave off a vibe of someone who wasn't into getting to know me as a person, but just listed his wants and needs. So at the end of the date, he asked how I thought it went and I said I didn't feel a click / match. And he said, yeah, he was missing the 'wow-factor'. So I laughed my ass off (slightly offended) in the car home, Gosh, no idea I was auditioning for a contest.\n\nI was happy we only went for drinks, but even that felt a bit too long.",
   "created_utc": 1692828272,
   "score": 197,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh2t4w",
   "message": "She showed up drunk to a casual daytime first date, at a bar I frequented heavily. Proceeded to order a premium skinny rocks margarita and downed it. Ordered a second one. Conversation was all over the place, I was pretty much done. I went to the bathroom, came back, she had another margarita being served. She went to the bathroom after that and the bartender (who I was pretty cool with) flat out asked me, “Sea Vast, bro, is she your date? When she ordered the 3rd one I said she needed to slow down, she told me it’s OK, you were paying and you’d drive her home.” I told him I’m going to bounce, if she doesn’t pay her tab text me and let me know so I can pay it later. He was cool with that. So I left. \n\nShe did pay her tab. She randomly texted me a few days later and asked if I was doing OK. I did not respond.",
   "created_utc": 1692828365,
   "score": 217,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh2v7h",
   "message": "Waitress dropped a tray of drinks and she laughed at her.",
   "created_utc": 1692828387,
   "score": 74,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh33pb",
   "message": "He didn’t stand up to greet me when I arrived at the table nor did he stand up to say goodbye when I was leaving",
   "created_utc": 1692828479,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh3ki7",
   "message": "It was more of what didn’t happen for me. She was a perfectly nice girl and we had talked about getting dinner together at a place she liked because she said it was really good. \n\nThe issue was that the conversation just didn’t really flow. Everything felt really forced and she didn’t talk too much. It wasn’t anything against her but it didn’t feel natural so I figured it was a sign to move on. My current gf and I spent hours just chatting at a random bar we went to the first time we hung out. Literally chatting about anything and everything. The conversation flowed so naturally with her",
   "created_utc": 1692828661,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh40wp",
   "message": "Being told. “The welts on my crotch aren’t contagious”",
   "created_utc": 1692828845,
   "score": 196,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh4mut",
   "message": "The women lied about her weight complained I don’t earn enough based on my car and job at the time then teased me all night before getting cold feet \n\nI don’t mind if your body shape is not barbie but don’t lie about it and I don’t like playing mind games if your interested then your interested if your not that’s fine but layout expectations",
   "created_utc": 1692829087,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgxckq",
   "message": "\"Hmmm...? Sorry, what was that?\"",
   "created_utc": 1692826266,
   "score": 2,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgn3e6",
   "message": "She fatfished me. \n\nDid the whole sneaky camera angle thing and then showed up looking ten times bigger than the picture and just hoped I wouldn't notice?",
   "created_utc": 1692822473,
   "score": 3,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgz4vj",
   "message": "She never showed up.\n\nI’d say that’s a red flag, but I never got a chance to see what color it was.",
   "created_utc": 1692826940,
   "score": 125,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgq1d4",
   "message": "She bled all over my new jeans after fat fishing me. My fault for not asking for a full body picture. We made out, she bled in me and I left",
   "created_utc": 1692823543,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgnbah",
   "message": "i just dont feel that something that would make me want to go on the second one. we either dont vibe or i dont find myself seeing them anymore. nothing personal, i just see on the spot if someone fits me or not.",
   "created_utc": 1692822554,
   "score": 0,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgz3h6",
   "message": "She ordered a tuna melt. I paid for the meal. But no thanks.",
   "created_utc": 1692826926,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh2t0q",
   "message": "tHeY wERe rUdE tO wAItInG StAFf",
   "created_utc": 1692828363,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgvs5k",
   "message": "Talking with them felt like talking to a brick wall. Seriously, I could’ve had a more productive conversation with a brick wall by the end of that date.",
   "created_utc": 1692825677,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgz4ot",
   "message": "“I’m sorry, I can’t see what you’re talking about.”",
   "created_utc": 1692826938,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxgzitq",
   "message": "Poor table manners",
   "created_utc": 1692827090,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh0hi7",
   "message": "She was about twice the size of her pictures. Made an excuse an left. Sorry not sorry.",
   "created_utc": 1692827457,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh0v25",
   "message": "He almost did not talk at all.",
   "created_utc": 1692827601,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh1xtf",
   "message": "I met her parents on the first date and she was terrified of me. Most awkward date ever.",
   "created_utc": 1692828020,
   "score": 70,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh31gk",
   "message": "Not me, but my friend went out with a guy who got drunk and shat his pants on the first date 😂😂🤣",
   "created_utc": 1692828456,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh3314",
   "message": "She ate liver and onions 😝",
   "created_utc": 1692828472,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh3pes",
   "message": "When he said “I took off work today to prepare for our date tonight”. Why did he need all day to prepare? What did he think was going to happen? It was very strange. Never saw him again.",
   "created_utc": 1692828715,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh532y",
   "message": "Guy told me he wrote away for a Russian bride. And ended up going to Russia with the intention of marrying some woman he didn’t know.",
   "created_utc": 1692829267,
   "score": 219,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh56aa",
   "message": "Anger. When I was looking to get married, I went on a lot of one-dates-and-we're-done.  There were a lot of angry women in their early 30s.\n\nMy wife says the same thing about her experiences with lots of angry men in their 30s.  \n\nFortunately, we ran into each other and have been together about 25 years now.",
   "created_utc": 1692829303,
   "score": 11,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh58fw",
   "message": "I was on a date with this dude, and his ex just showed up in the middle of our meal to give him his garage door opener. The guy clearly had no idea how the ex knew where he was, but the ex clearly knew we were on a date. It was really freaking weird. He was a nice dude, I really like him, but I dunno, it kinda just ruined it for me... I know thats not super fair, but it was just really weird. I'm pretty sure his ex was stalking him, and I don't need that in my life.",
   "created_utc": 1692829327,
   "score": 199,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh5bb8",
   "message": "He took an enormous belch and then snickered about it like it's funny. It's not Waffle House, bro. So gross.",
   "created_utc": 1692829359,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh5k80",
   "message": "Her kid called me Daddy.",
   "created_utc": 1692829460,
   "score": 172,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh5kvo",
   "message": "Her father used a wash cloth to wipe his ass",
   "created_utc": 1692829467,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh5u2x",
   "message": "A few of my favorite ones; from most recent to oldest. \n\n\"I don't really connect with animals. I don't want any pets, ever.\" Well, my profile has my two cats and a dog on it, so this isn't gonna work out. Not sure why she swiped right on me. Or didn't notice when she asked what I was doing and I told her I was out walking the dog, and we do an hour long loop of the neighborhood every day. \n\nThere was the one that had a profile of a physically fit attractive woman my age, but the person that arrived was 15 years older and 150+ pounds heavier. I decided to stay and not say anything about it because the texting conversation went well. But 5 minutes into the date she hit me with a series of slurs and racist opinions, and I only waited until she was done talking because the shit she said was so unhinged and not based in reality that I needed to hear the end of the rant before I left. (Only reason I stayed to the end of the rant was so that I could share with my friends later and laugh at her. We had some good times out of quoting her and laughing at how dumb she was.)\n\nAnd finally, I asked one about what she does at her job because it sounds interesting. When the date was over I hadn't said much of anything else. But I heard about her job, how she got into her job, her friends, her college experience, her high school experience, her family, her ex, her other ex, that car accident she got in when she was a teen, her three trips to Disney World, etc. Interestingly enough she was upset I didn't talk more and I thought \"When? You didn't take a single breath for 45 minutes straight, when was I supposed to squeeze in a word or two?\"\n\nThere was the one where she spent more time talking about Taylor Swift than anything else, and found a way to jam her into conversations where it didn't make sense. I figured she didn't want to date me, she wanted to date Taylor Swift, and got out of there. At this time I had heard of exactly one Taylor Swift song, and had basically no idea that the girl who put out Shake It Off was anything more than a one hit wonder.",
   "created_utc": 1692829572,
   "score": 164,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6d6j",
   "message": "He started discussing marriage.\n\nThis was a first date, I barely knew him (I did know that he was coming off a broken engagement).  He already had a trip to Aruba booked (would have been the honeymoon) and was talking about how great it would be to give me a ring there.\n\nI barely knew him.  He was nice enough but I was not at the stage in life (I was in college) to even have marriage on my mind.  (He was either 3 or 4 years older than me, I can't remember).  Not a bad person but we were at different points in life.",
   "created_utc": 1692829786,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6ibd",
   "message": "1) having to insist on going to my own place and almost jumping out of the cab cause he wanted me to go to his place\n\n2) we kissed after dinner and for the whole way home he was absolutely sticky and glued to me\n\n3) I think he roofied me...",
   "created_utc": 1692829844,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6jlj",
   "message": "While not on a date, as a bartender you see a lot of bad dates. \n\nThe most recent I witnessed was a military guy (made sure to bring it up) was talking about his previous marriage. Just cringy all around. He would later go on (in a quiet bar with 5 people max) about all the dates he goes on, his buddies hyping him up. Heard him interrupting his date, and constantly turning the convo back on himself. \n\nIdk what happened, but I closed them out on two separate tabs, they were both bad tippers, so maybe they deserve each other",
   "created_utc": 1692829858,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6ky3",
   "message": "Told me that aliens cause jet lag and that I have the ghost of a fisherman following me around named Samuel (on top of the 20 other batshit things she said at dinner. \n\nThis was last night.",
   "created_utc": 1692829873,
   "score": 35,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6otf",
   "message": "He was undressing every semi attractive women who walked into the coffee shop with his eyes, I was surprised he wasn’t slack jawed and drooling. But he wouldn’t make eye contact with ne",
   "created_utc": 1692829917,
   "score": 30,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6ps0",
   "message": "The date was going great but we were talking about family, friends, and all that and I realized that I’d slept with her sister. I didn’t really know what to do but you can’t just say “oh your family looks fun and I slept with your sister not too long ago. Show me more pics of your dog, is she a lab mix?” \n\nI cut the date short after dinner and hoped it’d just fizzle out, but they found out. It was cool though, just an awkward coincidence.",
   "created_utc": 1692829927,
   "score": 121,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh6x2a",
   "message": "He just kept making a weird amount of jokes about tapeworms?\n\nEdit: Wow, thanks for the upvotes! Also this happened while we were eating sushi, just incase anyone was wondering",
   "created_utc": 1692830010,
   "score": 95,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh9uyd",
   "message": "Went to dinner with a girl who I'd been crushing on for quite some time. It seemed to be going well, and we ended up back at her place, watching a movie or something. Out of nowhere, her boyfriend (of whom I was not aware) came back from out of town and stopped in unexpectedly. He and I had a super awkward conversation for a few minutes, then the two of them disappeared into another room for a minute or two.\n\nShe came back, and said something to the effect of, \"I don't have a place for you. I'm sorry.\" I just kind of got in my car and drove home, with one of the strangest feelings that I'd ever felt. At some point, a few minutes into the journey, I couldn't contain myself and busted out laughing.",
   "created_utc": 1692831212,
   "score": 9,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh8p25",
   "message": "She kept writing to her friends on WhatsApp a play by play of the date instead of listening to me, so I stood up, paid my dinner and left because I found it disrespectful af",
   "created_utc": 1692830730,
   "score": 52,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh7cpy",
   "message": "Said \"you're a really good kisser Amber\"\nMy name is Ashley",
   "created_utc": 1692830188,
   "score": 222,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhb021",
   "message": "[removed]",
   "created_utc": 1692831687,
   "score": 90,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh78ml",
   "message": "She tried to get me to puke in her mouth while we were having sex.\n\nFull story:\nWithout my consent she was being obnoxiously rough during sex, to the point of my face and back are bleeding and I'm getting angry because I kept telling her she was being too rough and she said \"stop being such a pussy\" so she then shoved her fingers in my mouth and then down my throat, I gagged and said \"you have to stop, youre making me gag\" and she said \"just go with it\" and was forcefully trying to shove her fingers in my mouth and I was like \"I don't like that please stop\" and she said \"STOP BEING A FUCKING PUSSY AND JUST PUKE IN MY MOUTH\" and I was like \"ughhhh what?!?!?\" And she said \"WHEN A BITCH TELLS YOU TO PUKE IN HER MOUTH JUST FUCKING DO IT\" this is all during sex btw.... So then I faked an orgasm and rolled over and pretended to sleep all night 😅 the next morning she woke up and looked at me all angry and said \"well.... OK I guess I'm gonna go now\" and she left.",
   "created_utc": 1692830142,
   "score": 53,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhnjps",
   "message": "I picked her up and she asked me if we could stop by her moms house so she could \"run in and grab something.\" I said sure.  Made the stop. She went inside. 5 minutes later she comes out hustling towards the car with a carseat and her mom chasing after her yelling. She opens the car door and throws the carseat(which i now see has a baby in it) and starts yelling at me to drive. I freaked and just turned my car off and took the keys out of the ignition. \n\nHer mom called the cops and they came and questioned all of us for a good while. Turns out she had lost custody due to drug use and was trying to use me as a way to get her kid back. We never made it to dinner and I just went home after the cops left.",
   "created_utc": 1692836969,
   "score": 136,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh7pq8",
   "message": "So many. But I’ll say the one where the guy was kind and polite, but wanted to move way too fast (not sex). Grabbed my chin and tried to turn my head for a kiss while we were watching a movie (Surrogates, with Bruce Willis, if you’re wondering), he didn’t try again after I pulled away though. Also mentioned he should get to know the state where I grew up and my family lived, since he’d be meeting them soon. He had also catfished with a pic of his older brother, which was sad to me since he was really cute himself. He insisted on walking me to my car (I had parked near the attendant in a garage, glad I made that decision), and while I was getting in asked if he could tell his mom he had a girlfriend (we were both in our early 20s). Poor guy.\n\nSince he was just over-enthusiastic and not an outright creep or jerk, I did email him telling him why there wouldn’t be a second date, saying he came on too strong, but wished him well. I hope he found someone. I also kind of wondered if there was a cultural thing I wasn’t aware of (he was Indian), but can’t say either way.\n\nETA: by “cultural thing” I meant if meeting families so soon was an expectation, not the trying to kiss or move fast part. Sorry for any confusion!",
   "created_utc": 1692830332,
   "score": 193,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhwmx6",
   "message": "He smoked a full pack of cigs during our 2 hour coffee date.",
   "created_utc": 1692840878,
   "score": 70,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhavge",
   "message": "This has been the most entertaining post with the greatest comments I have read in a long time. Thanks to everyone participating and putting me in a better mood.",
   "created_utc": 1692831633,
   "score": 139,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh9xbr",
   "message": "i was newly out, and i had had a crush on her for ages, so when she asked me out i was so excited. she was pretty, smart, very laid back, and had a great sense of humor, so things were going great initially. \n\nend of the date comes around, and she very casually drops the bomb on me that she’s a involved in an open investigation for vehicular manslaughter. she even hinted that it was purposeful and did not seem regretful. that was the end of that.",
   "created_utc": 1692831239,
   "score": 137,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh92ui",
   "message": "This story is always fun to tell\n\nBasically, we got back to her place after dinner and were getting slightly freaky on the couch. As things started escalating, she pulls out a giant glass jar (like the ones with the finger loop thing that pirates put rum in) half full of a clear liquid. My dumbass asked her if it was moonshine or vodka or something. She then proceeds to explain to me that it’s pure GHB and that she has a fetish about getting drugged off of it before having sex, and she said that with a completely serious face. For those of you who don’t know, GHB is a date rape drug. She then went to the restroom and I noped out of there so fast that I practically levitated off the couch. Never spoke to her again.",
   "created_utc": 1692830889,
   "score": 44,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh92ru",
   "message": "She showed me a picture of herself with some stripper and repeatedly talked about how beautiful his dick was… I’m not exactly lacking myself, but I’m certainly not that guy.\n\nIt felt weird and I felt like I’d be better off pursuing other options.",
   "created_utc": 1692830888,
   "score": 245,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh8fbd",
   "message": "He was clearly desperate to put a ring on ANYONES finger. Intensely overly romantic despite not knowing me really at all.\n\nPut on Etta James “Sunday kind of love” (date was a sunday btw) and tried to sing it at me while looking excessively earnest into my eyes. \n\nHe was also in the military and we were both like 19. Go figure.",
   "created_utc": 1692830621,
   "score": 99,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhajdc",
   "message": "She wouldn't stop going on and on about how much she wanted a baby. Called it \"her little creation\" and how she wanted multiple, tried to convince me to come back to her place for some fun, I dropped her off and dipped right away. She texted me every now and then after trying to meet up again, hell nah.",
   "created_utc": 1692831492,
   "score": 109,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh7o67",
   "message": "Bought her a whole meal and she didn’t take a single bite of her burger and ate like 2 fries and was just going to leave it there without taking it to go. I ate it myself and knew right there that there’s no way I’m taking this person out again cause I can not stand it when people waste food",
   "created_utc": 1692830315,
   "score": 220,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh7zor",
   "message": "He insisted on paying for our dinner instead of going Dutch, and then totally stiffed the server. I tried to leave a tip and he got pissed at me because he was paying and it was his decision to tip or not.",
   "created_utc": 1692830444,
   "score": 169,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhmcd4",
   "message": "Nothing obvious or overt but from the minute we sat down to eat the hair on the back of my neck stood up and I felt unsafe. He was polite, listened, very polished, but could not shake that feeling. I drove to the restaurant to meet so he did not know where I lived. After dinner he asked for another date and I just said no I don’t think we are a good match. Gave him money to pay for my half, said goodby when I got to the door turned around and he was staring at me with an expression I never hope to see again. I ran to my car, moved it to another spot, and waited until he left before I left so he could not follow.  Restaurant was on an isolated road so that was safer then having him catch up to me. Found out about a year later he was sent to prison for the assault and rape of 2 different woman . It happened on first dates. Never used a dating site again",
   "created_utc": 1692836457,
   "score": 138,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhepbc",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhmc5y",
   "message": "Two times:\n\nFarmer dude: (showing my age) added me on MySpace. Chatted awhile, I can appreciate a country boy. Seemed pleasant. Wanted to meet at McDonalds. Cool, I’m not hard to please, let’s get some Big Macs and chat. We talked for about 10 minutes and clearly it wasn’t gonna work - he was almost completely silent. Wouldn’t ask questions, wouldn’t eat. Just sat there. I told him it was nice to meet him, but I had to get home. Later that night I got about 20 messages telling me how he was into BDSM and wanted me to come over and “puke that Mac sauce all over his balls.” Yeah, that’s a block.\n\nCounting Crows dude: Met the guy on a Counting Crows online forum (lmao again, showing my age) and he happened to live 1/2 hour away. Cool, let’s grab drinks at [local bar] and see where it goes. I get there, can’t find him anywhere, figured I was stood up… then the lights dimmed and he walked out onstage, drunk as hell, slurring every other word/proceeded to play “Round Here” and stopped halfway through to vomit on himself. Now I can never hear that song without cracking up… *Maria came from Nashville with a suitcase in her hLLLLLLLLLLL (just throws up everywhere)*\n\nOdd that both instances involved puking to some degree.",
   "created_utc": 1692836455,
   "score": 53,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhch8h",
   "message": "\"...and that's why I've decided not to have my children vaccinated.\"",
   "created_utc": 1692832301,
   "score": 23,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhkcr9",
   "message": "Getting raped \u0026amp; beaten. 1982, I was 18, it was in the days before women were believed about date rape or really, any rape. Literally beaten within an inch of my life, treated at hospital ER for the contusions, zero police report, zero consequences. Minor league baseball player (went on to play in the majors.).",
   "created_utc": 1692835602,
   "score": 201,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhohq0",
   "message": " Went on a first date to an upscale restaurant and bar. We met at the bar first for a drink to get to know each other and then I was going to suggest moving over to the restaurant and get a table. It was a fairly large place with a large bar area. During our “drink” I kind of noticed that she was always looking across the bar at this older lady and the older lady was looking back- it also appeared they were communicating with facial expressions… I wasn’t sure, but it seemed very odd to me. After our drink we moved to a small booth in the restaurant area to get some dinner. We were getting along great, but I kept noticing odd facial expressions on the occasion from her, but the place had “mood lighting”so it was kind of dark so I wasn’t sure. After we finished our appetizer I excused myself to go to the bathroom.  - which was behind me- I noticed that the older lady from across the bar was sitting at a small table behind us.. she was trying to hide, but not doing such a great job. When I got back to the table I asked her if she know who the lady was, and that I thought they were “communicating”… she confessed that the lady was her mother and that she always brought her on first dates so she could give her an opinion and rate her date… so far I was doing well and her mother thought I was great. \n\nI asked for the check, paid the tab ( it included drinks and dinner for her mother) and cut my losses…. On the way out I told her to lose my number.",
   "created_utc": 1692837376,
   "score": 106,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxha9ok",
   "message": "The guy saying he was 6’2 on tinder and then when I met him he was short than me, I’m 5’7. I don’t mind that but why you lying about something so obvious LOL",
   "created_utc": 1692831381,
   "score": 142,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhnflv",
   "message": "We went to her place to watch movies and we chose Kung Fu Panda 2. From the moment it began she proceeded to cackle at every single joke. Anything that could even be perceived as mildly funny set her off like the wicked witch of the west. I know some people have interesting laughs and that wouldn't be so bad if it wasn't constant from beginning to end. After that she put on Iron Man and same thing, witch cackling the entire movie. There's a point in the movie where a characters phone goes off and the ringtone is an old iron man theme which made me chuckle, at which she turns to me and says: \"you laugh at all the weirdest parts!\" The second the movie was over I got out of there and did not see her again.",
   "created_utc": 1692836919,
   "score": 142,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxh8opk",
   "message": "While discussing our passions and hobbies, I was called a “murderer” because I love to fish.. “Do you know how much pain you inflict just for your selfish hobby!?” And this was right after we had finished eating a calamari appetizer..",
   "created_utc": 1692830726,
   "score": 25,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhas9i",
   "message": "We brought up the topic of exes, and he \"joked\" that his ex girlfriend was in his freezer.",
   "created_utc": 1692831596,
   "score": 63,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhixyr",
   "message": "Really nice guy, we hit it off. Talked on the phone for hours, had similar values, decide to meet up for lunch. He’s pretty massively overweight (400+), I am fat too (mid 200’s) so I didn’t really care. He also tells me he’s a diabetic which I’m leery of for late 20’s but we were getting along so well I thought it could be something I could be okay with. We sit down to lunch where be proceeds to order 3 cans of coke for himself, and the largest plate of food with extra sides. This was shocking to me because I’m actually really healthy for my weight, and it can be mostly attributed to childhood poverty and autoimmune disease. Like I’m fat but I’m trying my best to be healthy. I have perfect blood work, go to the doctor regularly, workout a couple times a week, cook most of my meals at home from fresh ingredients, etc. My concerns with him stemmed from the lack of care for himself, and the possibility of needing to care for him long term if I continued to see him. I wanted a partner, not someone who wasn’t making the changes after such a serious diagnosis as Type 2 diabetes. I told him after that I wasn’t feeling a connection, and honestly felt like I was betraying the fat community by rejecting him (my therapist heard a bunch about this), but I wasn’t attracted to his lack of care for himself.",
   "created_utc": 1692834999,
   "score": 173,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhjaod",
   "message": "for no reason he started laughing, attracting the attention of nearby tables. i said what's so funny. He said that he was just thinking of a joke. and then he laughed harder and harder until he was positively howling like a wolf. i decided no for a 2nd date",
   "created_utc": 1692835151,
   "score": 253,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhf0d9",
   "message": "He said nothing. I get he was nervous but I was engaging, I asked questions that should have led to at least a few sentences of conversation, but no, one word answers. It was dinner and a movie so our only opportunity to talk was dinner. It was like pulling teeth. No thanks, no second date.",
   "created_utc": 1692833354,
   "score": 151,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhj2di",
   "message": "She clicked her fingers at the waitress.  Stunning but vapid af",
   "created_utc": 1692835052,
   "score": 195,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhl8og",
   "message": "She took her hands off the wheel and said, “You think I’m craaazzyy?!” I literally jumped out at the next light.",
   "created_utc": 1692835978,
   "score": 114,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhqmrl",
   "message": "Met a girl at a friend’s party. We were both in our mid-20s. Ended up spending three hours talking, and she was so funny, charming, gorgeous, and carefree. I asked her out and got a wonderful “I would love to!” from her.\n\nI show up about four days later at the restaurant she picked, one within walking distance of her place. She arrived about five minutes later.\n\n“Nice place,” I say, as I get her chair for her. “Since it’s so close, do you eat here often?”\n\nShe scowls and responds, “You know, you ask too many f****** questions.”\n\nI was floored. Everything continued downhill from there. Within about 20 minutes, she just got up and left. \n\nI felt as if she had failed to tell me the other night that she had an evil twin, and that’s who showed up this evening.\n\nLater, when I ran into my buddy, I asked what the heck was up. \n\n“Oh yeah,” he said, “she’s a piece of work until she gets a few drinks in her. Then she’s adorable.”\n\nThanks. Thanks a lot, buddy.",
   "created_utc": 1692838294,
   "score": 236,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhkg40",
   "message": "He used his pocket knife to cut me a slice of cake, and later scraped some dirt clumps off of his shoe with the same knife. I asked him if he ever cleaned his knife, and he replied, \"no, why?\"\n\nHe also confessed that he was madly in love with me the same day. We had just met.",
   "created_utc": 1692835641,
   "score": 94,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhrh84",
   "message": "1)He tried to force a kiss.\n\n2) He tried to get me to agree to marry him the next week. No, he wasn't an immigrant. \n\n3) He said women were stupid and would believe anything he told them. I am a woman.\n\n4) He said it was OK to drown puppies. It was \"actually humane.\"\n\n5) He swore that it was impossible to get AIDS if you were straight. Found out a week later that he knew the whole time he was HIV positive. \n\nThat's just some of them...\n\nEdit to add:\n\nY'all have me laughing here! No, not all the same guy. These are various different men throughout my lifetime, and in no particular order. I was writing them down as they came to mind. Can't believe I nearly forgot the one on #5. Scariest of them all. He tried way too hard to get me to go home with him. Glad common sense won the day. I was 16, he was 18.",
   "created_utc": 1692838657,
   "score": 192,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxht958",
   "message": "I lived in NYC and she lived in the suburbs. We decided on a small chain restaurant (three locations in the city), and I said that the one close to City Hall was the best location for me. She agreed to meet me there.\n\nI arrived at the restaurant early and waited until a few minutes after our meeting time, then gave her a call. She told me she had no idea where she was, and needed directions.\n\nIn an era of smartphones, this is a puzzling thing to say, but I gamely tried to help. It was really hard to get her to look at the street signs for some reason, but once she did, it was clear she was in Midtown, several miles away and nowhere near City Hall. I asked, “didn’t we plan to meet at the one near City Hall?” and she angrily answered that she didn’t know where City Hall was. Again… how is that even possible with a smartphone, and why agree to go to a place if you have no idea where it is?\n\nShe said she wanted to take a cab to where I was, and asked me to pay for it. I decided to agree to this to keep the peace, since she was pretty much freaking out on the phone by this point.\n\nShe arrives, I treat her to dinner, then I take her to a cool late-night teahouse, then we walk along the river. I tried my best to make it a good experience, but all conversation fell flat. I finally asked her where she’d like me to walk her back to for the night. I was expecting to take her to a subway station, because her suburb is quickly reachable by commuter train at all hours.\n\nNope — she needed me to walk her back to a parking garage back in Midtown where she was when I’d called her at the start of the evening. I’d had no idea she’d driven to the city; people usually don’t drive from her town because the train is so much easier and cheaper than paying for Manhattan parking. Luckily, our nice walk along the river had gotten us halfway to the garage, so I offered to walk her the rest of the way, and she happily accepted.\n\nHere’s where it goes from inexplicable to insane. When we got to the parking garage, she asked me when our next date would be. Trying to be polite (instead of immediately replying “never”), I said we could figure that out over the next few days. She immediately turned hostile and demanded to know why I wasn’t agreeing to a date right away — what was wrong with her that made me not want one? I replied I wanted to think a little before making more plans.\n\nShe drove away, and I thought that was it. Oh boy.\n\nThe next day around noon, she texted me:\n\nHer: “You’re supposed to text ‘I had a nice time last night’ the morning after a date.”\n\nMe: “I didn’t realize that was a rule.”\n\nHer: “It is. I can’t believe how rude you are. You need to pay for my parking garage because you sent me to the wrong place.”\n\nMe: “I don’t think so. I paid for the taxi, but that’s all I’ll be doing. I didn’t know you were even driving, and I told you which restaurant we were going to. If you didn’t know where City Hall was, you could have asked for a specific address.”\n\nHer: “I am going to tell [employer] how you treat people.”\n\nMe: “…reasonably?”\n\nI then blocked her and am glad to say I never heard from her again (not even from my employer).",
   "created_utc": 1692839425,
   "score": 148,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhv83m",
   "message": "Told me the wounded knee massacre was \"exaggerated \" and \"not that big of a deal\". He didn't know anything about this particular historical event mind you, he was just very sure that I didn't know what I was talking about and that Native Americans were just blowing things out of proportion. I don't even remember how the topic came up, but man. What do you even do with that.",
   "created_utc": 1692840266,
   "score": 194,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhvbtu",
   "message": "He asked me how big my baby was and if I birthed him vaginally or had a c-section. His explanation was that he'd never slept with a mom before and had heard a baby can stretch out a vagina. I excused myself to the bathroom and promptly left the restaurant.",
   "created_utc": 1692840310,
   "score": 217,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhx0rf",
   "message": "I went on a breakfast date once. Date orders two sunny side up eggs. \n\nProceeds to take two straws, poke one in each yolk and suck the yolk up. \n\nDon’t even remember his name",
   "created_utc": 1692841045,
   "score": 52,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhgnw5",
   "message": "I didn't realize I was on a first date until we were half way through it.  When it hit me, I was really embarrassed and wanted to crawl into a hole and die.  I thought it was just a friendly outing.",
   "created_utc": 1692834047,
   "score": 82,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhmxjx",
   "message": "He referred to every woman as a cunt and we aren’t in a country where that is common and harmless. \nHis ex was a cunt, his aunt was a cunt, some random author he was telling me about for some reason was a cunt, etc. \n\nCunt doesn’t really bother me but the way he said it was very aggressive and angry. \n\nAfter that he decided to argue with me about sports and politics and berate me for my choices in those areas. \n\nNo need for a second date after that!",
   "created_utc": 1692836706,
   "score": 121,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhnpww",
   "message": "As I reached for the check, she very loudly said, “Are you sure? I make waaaayy more money than you!”",
   "created_utc": 1692837043,
   "score": 30,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhoecl",
   "message": "It was my first date. I was 17, working as an office assistant's helper. The guy (20) also worked there. I don't remember what his job title was.\n\nHe asked me to the drive-in movies. He came to the house, and met my mom. Did the whole song and dance to her about taking good care of me, get me home on time, bla bla bla, all that crap. I was still nervous though, so I arranged with 2 friends to go to the same movie in their car. My date didn't know.\n\nThey parked 3 cars down from us. After we parked, the guy is telling me to relax, he just wanted company for the movie, he respected me. So I'm thinking cool. The movie started. I don't think the opening credits had finished and he was all over me. It was like he grew 4 extra arms in seconds! I push him off me and say WTF!? \n\nHe apologized and said he was sorry. He thought I'd like it and he couldn't help himself because I was so cute (whatever). I told him I didn't like it and to keep his hands to himself. I get maybe 2 drinks of my soda down and he tries again. Now I'm pissed! I get out of the car, throw my drink at him, and walk off. \n\nI go to my friends car and get in. The guy didn't see where I went because he was dealing with dripping soda on him and his car. My friends and I left. \n\nThe following Monday at work was really awkward and he avoided me like the plague. This is why to this day I've never again dated anyone I've worked with.",
   "created_utc": 1692837336,
   "score": 148,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhs86g",
   "message": "This is back before the term “catfishing” was a thing.\n\nLilly was supposed to be a 22yo woman, with me being a 24yo guy at the time and used to being surrounded by quirky people, so her online messages never set off any major flags.\n\nI drove by her place to pick her up at night, so i never saw her til she was in my car.\n\nFirst, Lilly informed me she preferred to be called by her demon name, Lillith.  Lillith was 50% demon, 40% vampire, 5% werewolf, 3% human, 2% other.\n\nShe was also super tiny, under 100llbs/45kg. And instead of being 22, she just had her birthday last week and turned 17.  Also, was suuuuper pregnant, 7 months along, which made her belly bigger than the rest of her.  With child #3.\n\n\nThere are so many other details, but those are just the bits from her self-introduction.",
   "created_utc": 1692838987,
   "score": 239,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhdhzd",
   "message": "He was super pushy about me having a third drink and got mad when I refused.\n\nETA: I totally see why lots of people are replying saying he probably drugged my drink, but I do not think that is the case, as I never left either of my first 2 beers unattended and he had been pestering me to order a third beer, which is what I refused. \n\nI am fairly sure he was trying to get enough drinks into me to lower my inhibitions, not to drug me himself, but regardless his behaviour was inappropriate and a huge red flag. The fact that he got angry when I refused to drink more was the reddest flag.",
   "created_utc": 1692832725,
   "score": 113,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhq4nc",
   "message": "His card was declined for $11 at a coffee place he suggested (which he had me drive 6 miles to get to because he wasn’t comfortable going out of his neighborhood). When I offered to pay for it he insisted on swiping the card a second time, for the same result. He was terribly embarrassed the rest of the date and it was just very uncomfortable. \n\nOr there’s that time that composer at the Houston orchestra who also fancied himself a home chef invited me to a lavish dinner party with his close friends which was an extraordinary meal and just really lovely… only for him to present me with some “gifts” afterwards: a leash and a gradient set of butt plugs. I had no idea a gentleman could ruin an evening so deftly til then.",
   "created_utc": 1692838078,
   "score": 78,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhrowo",
   "message": "I met this girl on the apps and we're talking and she invites me over hours after matching. Alright sure, things are alright through text. Her mom is there and is FUCKED UP, like mixing pain killers and alcohol fucked up, she's at the table just mumbling and dozing off and asking me fucked up stuff. Then her sister and her BF is there and they're drunk and having a screaming match fight while we're all this just talking and hanging out at the table. She seemed more normal than the other 3 and most of the time she's just talking about her daughter and she's older about 9 or 10 and is complaining about how she lives in another state and she's never had custody of her and complaining how we lived in a screwed up state that always gives custody to the fathers. (Which is a lie, I live in CO and I never met any divorced dads with full custody unless the mom straight up left and even lived with my mom after my parents divorced when I would've been better off with my dad)\n\n\n\n So I leave and she asks me about a second date and I tell her \"Sorry to be blunt but that was a shitshow and I was very uncomfortable and I don't think we'll align.\" She goes off on how \"Everyone has a crazy mom, it's normal\" and how \"Drunk people fight, it's what they do\" and how I sound like CPS and that I was a \"fucking weirdo\" and started hurlng insults at me and then said I should've disclosed my \"medical condition\". I have no clue what she was talking about.",
   "created_utc": 1692838750,
   "score": 71,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhadd8",
   "message": "She asked if I could clean her pet rat cage or hold her rat while she cleans it. Also listed a number of handyman tasks she needed me to tackle...",
   "created_utc": 1692831423,
   "score": 169,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhdm0q",
   "message": "One time I went on a date with a girl and during the date she  starts talking about future plans with me. She was talking about how we are going to have kids together and how we were going to go on trips with my brother and his wife. \n\nI was in my mid 20s and had just started my career when this happened so of course this freaked me out. \nWho jumps to those kind of conclusions during the first date?\nIt was super awkward after because she worked with my mom and kept asking about me",
   "created_utc": 1692832773,
   "score": 112,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhffet",
   "message": "She showed up with her friend(ok, I guess), already buzzed and offered me weed. Admitted that she wasn't divorced about 30 minutes into it. Had me take her to a dance club where she promptly fucked off for 20 minutes to talk to \"someone\" (she was a regular I found out and knew EVERYONE).  I drove her back to her car and told her to get out.",
   "created_utc": 1692833531,
   "score": 100,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhmh22",
   "message": "He manhandled me, instead of speaking to me like a person with agency. We were at a popular hotel with two stairs to choose from to go down, I started going right and he pretty much picked me up and moved me to the left. \n\nThen we were talking, I didn't see a group of people all trying to squeeze in at the bar as they were behind me. Instead of pointing it out, he grabbed me and moved me again. Huge red flag",
   "created_utc": 1692836512,
   "score": 23,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhnuqq",
   "message": "When a guy told me I was pretty but I would be unbelievably gorgeous if I lost 20lbs 🤔",
   "created_utc": 1692837101,
   "score": 147,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhtrbg",
   "message": "He told me him and his dad intentionally ran over the stray cats in the neighborhood and there was more they were plotting against.",
   "created_utc": 1692839645,
   "score": 45,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhywr2",
   "message": "One was the time I took this girl to dinner and she could not stop staring at our waiter. I'll grant her one thing - I'm a guy and can admit this guy was probably totally hot for anyone who prefers men. Square-jawed and muscled college athlete type. I get it.\n\nBut I didn't appreciate that she literally craned her neck every time the kitchen door swung open to see if he was walking out. Eventually I gave her enough cash to pay for my part of the meal, told her I'd noticed (as though I couldn't have), suggested to her that she could get his contact info when she paid the bill, and left.\n\nEdit - thanks for the awards everyone, this was a first date I hadn't thought about in decades and now I get awards for it at least. Cheers everyone, and may all your first dates go more smoothly.",
   "created_utc": 1692841869,
   "score": 36,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhk9nh",
   "message": "The guy told me he would still be together with his kids mum if she had apologized for what she did wrong. Out of curiosity I asked what she did wrong? Was expecting something like she cheated, ya know something that actually needed apologising for. \n\nNope. Apparently she kept nagging one day and wouldn't shut up, so, he tied her to a computer chair and went out for three hours and left her there. \n\nI said it doesn't sound like she was the one who needed to apologize and left.",
   "created_utc": 1692835566,
   "score": 171,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhqe6k",
   "message": "Went on a date with a woman from the office. Thought we had good chemistry and got along well. She couldn't find her phone so I tried calling it and someone from the restaurant answered. I went back in for her to get it and the waiter showed me I was saved in her contacts under \"Free Food.\"",
   "created_utc": 1692838194,
   "score": 83,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhsic4",
   "message": "We agreed to meet at a beach bar. When I stepped out of my car, he basically ambushed me in the parking lot. His dating profile said he was 5'11. In reality he was shorter than me. First red flag: if he lied about something so obvious, what else was he lying about? He also had an NRA sticker on his car, an affiliation he had not disclosed. I was already uncomfortable but felt too awkward to turn around and leave.\n\nWe got seated and ordered drinks. Then he began to interrogate me. When I say interrogation, I'm not kidding: \n\n\"Your dating profile said you work in 'animal care'. So what specifically do you do in the 'animal care' field? [*I was working at a dog daycare at the time.*] How many dogs are under your supervision? Only dogs, no other species? And how satisfied are you with this line of work? Do you plan to continue this as a career? Do you plan to go on to grad school? [*My answer: I don't know, maybe, maybe not*] So you don't have any drive or ambition, then? You feel you'd be competing with other students and they'd have an advantage over you? Do you like living here? What drew you to this place? How is this town is different than where you went to college? [*Answer: it's full of yuppies and old people; whereas Gainesville is a college town.*] So, when you say 'yuppie', what is your definition of that term? When you say 'college town', what *specifically* do you mean by that? Have you ever been to Jacksonville or Tallahassee? How recently did you go there? What specifically did you do or see while you were there? [*I went to the zoo.*] So you like zoos, then? Did you like Jacksonville? [*Answer: I don't know.*] So you hated it? Are you an only child? Any cousins? What do your parents do? Do they live in the area? Do you have a good relationship with them? Are they conservative? Do you consider yourself a conservative person? [*No.*] So you rebelled against your parents? Do you have any religious affiliation? What are your parents' religious affiliations? [Regarding the bar band:] How would you describe this type of music? What *adjectives* would you use to describe this music? Do you live in an apartment? Do you have any roommates? Just you and the dog? Are you training your dog to be a guard dog and attack people? [*Uh...no?*] So he's docile, then? [*This line of questioning creeped me out a little.*] How long have you lived in Florida? Have you ever been outside the state of Florida? What other states have you visited? Have you ever left the country? What other countries have you visited? Which one do you have the fondest memories of? Would you like to live there? Why? Just because of the scenery? How did you feel about the people? Did you interact with the locals? Have you ever been to New England? Is it on your list of places to go? [*No, not really*] So you hate it, then? You want to see it nuked?\"\n\nWHAT.\n\nAfter nearly an hour of nonstop questions and my vague, non-committal answers, he finally starting asking me what was wrong. Again, I really wanted to be honest but I didn't have the courage to tell him to his face that he was an irritating douchebag. Finally he said \"C'mon, I'm just trying to get to know you, baby, and have a good time!\"\n\nThat was it. Him calling me Baby was the trigger that finally broke my awkwardness about walking out. I pretended to go to the bathroom and ditched him.",
   "created_utc": 1692839109,
   "score": 64,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhgok6",
   "message": "Forcibly kissed after I said no.",
   "created_utc": 1692834056,
   "score": 1,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhm11o",
   "message": "He'd given me a fake name and was still in love with his ex. Who was 17. He was 29. No thanks dude.",
   "created_utc": 1692836322,
   "score": 31,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhh9xg",
   "message": "He told me that he’d been kicked out of his church for being caught in bed with an underage girl (but it totally wasn’t what it looked like).",
   "created_utc": 1692834303,
   "score": 144,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhmwjx",
   "message": "She looked nothing like her photos. Smelled of cat piss covered taquitos. We were at a park and saw some girls playing softball and she said \"those girls look special ed with those helmets.\" Like fuck I'm always down to give someone a chance but just yikes. I made an excuse to leave. My car smelled for like 2 days after that.",
   "created_utc": 1692836694,
   "score": 143,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxidjc2",
   "message": "He was making suggestions for what he thought we should be doing right there in the restaurant that were so inappropriate that the random couple sitting at the next table over asked me if I needed a safe ride home… during one of the numerous times he left the dining room.\n\nIt was a NYE. I was home by 9 PM.",
   "created_utc": 1692848933,
   "score": 196,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhkcmo",
   "message": "This girl and I had an amazing time mini golfing and shit down the bar we went to. It was not until the end when she casually mentioned she homeschooled her four kids, three of whom had different dads. I'm all for living your life how you see fit, but I didn't want to be the fourth father to the fifth kid, and she really should've mentioned that in the messaging leading up to our date. Like, \"I don't want to be dishonest; I have four kids from previous bfs\". I don't want kids, so that wouldn't be a good match for me.",
   "created_utc": 1692835601,
   "score": 175,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxi10it",
   "message": "The girl who spent the first half of the dinner date talking about her irritable bowel syndrome and then switched to her love for god after the main course.",
   "created_utc": 1692842795,
   "score": 222,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxi3ql3",
   "message": "I matched with a girl on tinder and we decided on drinks downtown and a walk around a popular park to chat.\n\nLast minute she messaged me to meet her at her place instead of the restaurant that was like 3min from my subway stop. Fine, I have to get off the subway and walk 20min in the opposite direction of the restaurant, but I'm a nice guy so whatever.\n\nI show up at her place and she invites me in as she needs to finish getting ready. I sit on the edge of her bed as she gets ready, and all I can hear is people having sex through the walls. She tells me its her roommate and her new boyfriend like its totally casual. She then asked me if I wanted to \"compete\" with them to make her roommate jealous. I said no cause politely and said I was starving and wanted to go eat. I didn't tell her I wasn't expecting any action and didn't have protection. We walk to the restaurant and she proceeds to talk about all her exes and how they ruined the relationships. Whatever, I can deal with it. Who hasn't complained about an ex? Right? So dinner actually went pretty well, mostly cause I had a few drinks to relax and it was a chill restaurant. After dinner she said she's tired and asked if I could walk her home. No problem. I already had a feeling this wasn't going anywhere so I was excited to leave early. We get back to her place and the roommate is in the kitchen getting drinks and she straight up calls her a whore and tells her to stop fucking her ex so loudly in the next room while she's on a date. That's right, the roommates boyfriend she was loudly fucking earlier was the ex of the girl I was on a date with. The roommate then made a comment about how I'm next and they started a screaming match. I told her I was going for a smoke so they could hash it out and the second the door closed behind me I basically jogged like 3 blocks towards the subway to get the fuck out of there. I texted her when I got home and said I had fun getting to know her but was not interested as we didn't have much in common. No response. A week later she sent me a nude and asked me to come over. I never thought I'd hear from here again so I blocked her and that was it.\n\n\u0026amp;#x200B;\n\nWorst part is the restaurant was a sick Mexican place that she said she frequented so I never went back out of fear of running into her again lol",
   "created_utc": 1692844019,
   "score": 183,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhqrji",
   "message": "Took her to dinner and then took her to a late night car meet. Upon arriving to the meet, she started shit with several other girls she had beef with in high school. And hasn’t talked to since high school.\n\nWe were well into our 20s. She was even older than me.\n\nI don’t get how some people make high school beef their entire personality for years.",
   "created_utc": 1692838351,
   "score": 28,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxi43o5",
   "message": "She ordered a $100+ steak and lobster meal and got shitfaced, I had to pay for the whole thing because she didn't even bring her purse. Almost made me crash while driving back to hers because she was horny and wanted me to finger her while I was driving so she put her leg across me and accidently kicked the steering wheel (and pouted when I told her to wait.) Threw up when we got to her place. Told me to sleep on the couch (wasn't expecting to stay the night at all). \n\nSo I snuck out in the middle of the night and texted her saying thanks but no thanks, and she proceeded to insult and berate me, then switch to saying she's willing to work it out if I am, then switched back to insults again when I still said no thanks. \n\nShe was 10 years older than me but acted like she was fresh out of highschool...",
   "created_utc": 1692844188,
   "score": 24,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxifo7t",
   "message": "My very first date was when I was super young. I don’t even know why she said yes, but I had a crush on this girl for the longest time and everyone knew.\n\nWell, we picked a date and time and the plan was to hit up the local pizza place and then watch a movie. I wish I remember the movie because it would remind me exactly when this was but I digress. \n\nSo my lanky, stinky middle school self gets all dolled up and ready. My mom drove me to her place and I awkwardly wait around for her to get ready. It’s then revealed to me that she’s bringing a friend. We get into the car and make our way to the movies, and the entire trip is super silent and awkward. My mom was the one trying to make small talk with everyone and it was certainly not helping. \n\nShe dropped us off at the pizza place, which was directly across the street from the theater. I ordered 2 pizzas. 2 large pizzas. Idk how much these ladies can eat, ok? My brain hadn’t (and feels like it still hasn’t) developed, alright… \n\nSo we got these 2 large pizzas, and I’m sitting across from 2 girls who are also very nervous and not the most social people. You’d think the 3rd person would make it easier to have a conversation but absolutely not for a bunch of teenagers. \n\nThey each have 1 slice of pizza, and I tried to make up for the difference and ate like 4. We had to throw out some slices and I wound up giving a whole pizza to these random people in the restaurant on our way out. Idk what I would have done with a whole ass pizza before going into a movie theater. \n\nWe went and watched the movie, and still hadn’t really spoken a whole lot at this point. When we got out, we waited around for my mom to pick us up. \n\nSO WHAT DOES THE TEENAGE BRAIN THINK IS THE NATURAL NEXT STEP OF OUR DATE??? The kiss of course!!!\n\nI hadn’t asked my dad about this specific situation, but the conversation had come up a while before. I don’t remember how it came up, but basically I remembered my dad saying I should ask if I could kiss a girl before doing it…\n\nSo back to our date… we were waiting around and I had to find a way to make my move where it’s just the two of us. At least I had the foresight to not do this in public. Anyways, we walked over to the town’s covered bridge and I asked her if she was enjoying herself, she said yes (of course), and I leaned in and asked if I could kiss her. She was obviously super nervous and she just goes, “No thank you.”\n\nSo I had to reverse the lean-in technique to make it look like I was just trying to reposition myself. I said ok, and we made our way back to the parking lot of the movie theater. The car ride home was exactly as awkward and silent as the ride there. We still acknowledged each other’s existence at school, but whatever I thought I had for her in my lil emo heart was completely replaced with, ‘Well damn, son, I think I’ll hold off on the dating think for the rest of my life’. \n\nIt’d be funny to hear her perspective now that we’re older but I left the whole thing thinking that dates weren’t really my thing. It wasn’t until I was 17 when a girl was into me and made it obvious that I even thought about being in a relationship. That one lasted 5 years so I don’t even know what the moral of my story is. Just laugh at my suffering, please.",
   "created_utc": 1692850130,
   "score": 240,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhp5ww",
   "message": "Within five minutes of sitting down to meet me, he decided to comment that I have “huge tits” and mostly talked at my chest while I tried to finish my food and get the hell out of there (I really liked the food!). Right after the date he sent me an unsolicited pick of him naked, cupping his junk then demanded I returned the favor because he sent one. Blocked.\n\nAnother guy and I met at a bar for food and drinks. Eventually it got incredibly rowdy so we decided to talk in his car for a bit since it was still daylight. At least, that’s what I assumed since it was too hard to hear much in the bar for a while. He lunged himself across the center console almost immediately to kiss and grope me. That was a quick exit and block. \n\nMost of the rest were just standard no connection or attraction in person after meeting online. Nothing crazy, just super boring people.",
   "created_utc": 1692837663,
   "score": 109,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxjh7jm",
   "message": "On the first date, she took her teddy bear with her and started talking to him as if he was alive. Throughout the date, she turned to the bear, asked his opinion and even offered him food from her dish. It was so weird and awkward.",
   "created_utc": 1692877330,
   "score": 119,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhnpsr",
   "message": "I went on a date with a man who I'd previously met on a night out. He seemed nice so I was looking forward to the evening.\n We went for a meal first and as we were talking I kept noticing he kept doing this weird shoulder twich. I don't know if he was even aware he was doing it but it quickly started to be annoying as I couldn't keep my eyes off his shoulder.\nHe then started telling me a story of how he used to be in the army and his wife, who was also in the army, had been murdered. They had a child together and he had brought her up on his own. This was a horrific story and sat in stunned silence as I just didn't know what to say other than I was sorry that had happened.\nAfter the meal we went to have a drink in a pub across from the restaurant. He immediately picked out a bloke in a red top and started saying he shouldn't be around here because it wasn't his territory. He then pulled a knuckle duster out of his pocket and put it on his hand all while staring at this bloke who was just having fun with his friends and hadn't once looked over. \nThe red flags were literally smacking me in the face so I made some excuses and left. I only dared tell him by text that I didn't want another date.",
   "created_utc": 1692837041,
   "score": 50,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxhxlzl",
   "message": "He threw a temper tantrum because the restaurant he wanted to go to was closed due to the tropical storm that was going on. \n\nSad because I was having a great time walking around Manhattan while the storm raged. I had every intention on going home with him, until tantrum.",
   "created_utc": 1692841304,
   "score": 102,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxi0ns6",
   "message": "Happened to my sister but- found out the guy had the same uncommon last name as her. Then when she asked where he was from, it was the same small town that our great grandparents are from. They awkwardly laughed and just immediately ended the date",
   "created_utc": 1692842639,
   "score": 116,
   "submission_id": "15zfkz8"
  },
  {
   "comment_id": "jxho93a",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15zfkz8"
  }
 ]
}