{
 "submission_id": "15zg0b6",
 "title": "Cops of Reddit, what’s the most illegal thing you’ve seen someone do and been like “screw it. I don’t have time for this.” And let them go about their business?",
 "selftext": "",
 "created_utc": 1692823277,
 "permalink": "/r/AskReddit/comments/15zg0b6/cops_of_reddit_whats_the_most_illegal_thing_youve/",
 "score": 213,
 "url": "https://www.reddit.com/r/AskReddit/comments/15zg0b6/cops_of_reddit_whats_the_most_illegal_thing_youve/",
 "comments": [
  {
   "comment_id": "jxhthcd",
   "message": "Every time they see a motorcycle going double the speed limit.",
   "created_utc": 1692839524,
   "score": 158,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxgzdya",
   "message": "Not a cop but cop-adjacent. A story I heard first-hand.\n\nSeptember, Friday night, 3 blocks from a college. 3 underage girls stopped by a cop for drinking in public. One of the girls (who turned out to be 17) decided to mouth off at the cop and assaulted (swung her purse drunkenly at) him.\n\nHe told the other girls \"Tell your friend, when she sobers up, that the only reason she's not in jail is because I don't feel like doing the paperwork for arresting a minor female.\"",
   "created_utc": 1692827037,
   "score": 44,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxhk29z",
   "message": "Went on a ride along. It was at the end of the officers shift. Car full of kids made an illegal turn. While we sat behind them at a light they were ducking down and obviously stashing something under the seats. He laughed and said “I’m not gonna turn on my lights until their drugs are hidden. I’m writing a ticket but I don’t have time to do a drug bust.”",
   "created_utc": 1692835478,
   "score": 245,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxgst1e",
   "message": "In Australia we have this weird thing going on atm where there are a TON of black market tobacco shops all over the place. They CLEARLY are black market, mostly accept cash only, their vapes are advertised as not having nicotine, and their smokes are literally 25% of \"normal\" grocery store prices. You can literally buy a  pack of smokes for $5 (normal is $25-30) and buy half a pound bags of tobacco for $100.  I have a police detective friend and I asked about them, and he said they're just like weeds, if they took the time taking them down more just pop up, and ultimately its \"just tobacco\" and efforts are being focused on harder drugs/gang activity.",
   "created_utc": 1692824567,
   "score": 145,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxhv8ab",
   "message": "Obligatory not a cop, but I work with them every day at my job. I can't speak for elsewhere, but typically cops here aren't on the \"lookout\" for crime to solve. They have to respond to calls and complaints, and sometimes they're stuck on traffic duty. If you're doing something relatively harmless, like smoking pot on the sidewalk, a cop won't bother stopping you here unless someone complains about it. They're not looking to add more work to their days unless you're being a real danger or nuisance. This has been especially true since covid.",
   "created_utc": 1692840268,
   "score": 82,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxhsh2w",
   "message": "Not a cop, but was stopped by them with an entire gang of drunk, underage guys on ATVs.  We told them where we were staying.  It wasn’t far and they followed us there and left us go with nothing on paper.",
   "created_utc": 1692839094,
   "score": 34,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxiivt0",
   "message": "Damn near every comment, \"not a cop, not a cop, not a cop, not a cop, not a cop, not a cop\"",
   "created_utc": 1692852073,
   "score": 48,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxi0ekt",
   "message": "Domestic disturbance call, our shift ended in about 30 min. Mom calls claiming she was assaulted by her daughter. We get there, daughter is drunk as a skunk. Daughter punches the mom right in front of us calling her a liar. We detain the daughter and convince her to go to the hospital. Daughter leaves in the ambulance, Im home within 15 min. Mom didnt want to press charges.",
   "created_utc": 1692842526,
   "score": 30,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxhx7l2",
   "message": "Not a cop. I was 14/15 yo. My bike was stolen one night and I had to pick it up from the police station after school. I had my full backpack and a duffle bag of stuff so I couldn't ride. I had to walk 3 very awkward miles with heavy stuff and guide my bike. The officer said they were slow so he would give a ride. On the way we saw a drug deal go down. He turned to me in the back seat and said \"I would arrest them but you're here, maybe next time\".",
   "created_utc": 1692841128,
   "score": 48,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxidqd0",
   "message": "Not a cop, but I once saw a squirrel jaywalk and thought to myself, 'Screw it. Nature has its own laws.'",
   "created_utc": 1692849041,
   "score": 20,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxi4fzi",
   "message": "Well, this one time in Uvalde, Texas…",
   "created_utc": 1692844346,
   "score": 66,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxikdqx",
   "message": "If the answer isn’t shoplifting I don’t know",
   "created_utc": 1692853028,
   "score": 4,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxiq5d4",
   "message": "Not a cop but - Weed is legal in Canada now but way before it was legal there were many weed shops all over Vancouver with big signs out front. There was even a phone app to tell you where the nearest weed shop was (which was unnecessary because there was one every few blocks).",
   "created_utc": 1692856968,
   "score": 5,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxiszfr",
   "message": "Not really a cop or have really anything relevant but this was a fun read the other day: https://www.reddit.com/r/pettyrevenge/comments/15xe1m6/entitled_lady_tries_to_force_me_to_leave_a_public/\n\nIt's about a cop who \"doesn't have time\" to report his fellow officer's law breaking.",
   "created_utc": 1692859080,
   "score": 4,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxiaxiv",
   "message": "Apparently, the gangs riding dirt bikes and ATVs around cities are immune to traffic laws.",
   "created_utc": 1692847541,
   "score": 5,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxgpj3y",
   "message": "San Francisco",
   "created_utc": 1692823358,
   "score": 48,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxgvnde",
   "message": "They aren't going to answer this truthfully because their fellow officers are the ones doing the really heinous shit with no charges.",
   "created_utc": 1692825627,
   "score": 39,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxhk4r0",
   "message": "I'm not a cop, but one time me and two friends went to Taco Bell after day drinking a fifth of Woodford. Apparently, we were being loud in the restaurant because someone called the cops and reported us and being belligerent. I honestly don't think we were being out of control at all. Anyway, the rollers catch us at the door as we are walking out to leave. Tell us what is going on and we are all confused, again, because we weren't being crazy at all.\n\nHe sits us all down in the parking lot. At some point askes us if we have been drinking and we tell the truth. He breathalyzes us all, to which we each fail miserably.\n\nHe makes some threats about taking us to jail and I'm not sure what happened, but he was just like \"ya'll calm down next time and have a nice evening.\" He knew we drove there. He knew we were gonna drive out and he obviously knew we failed  the breathalyzer tests.\n\nHe just left and so did we. My guys house was only a couple blocks away, but absolutely no idea what happened. Like, the cop didn't leave in a big hurry for some other serious call. He just let us drive out drunk as hell?",
   "created_utc": 1692835508,
   "score": 17,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxh8mft",
   "message": "I once drove 170km/h not sure what the miles comparison is on the highway between Palm Springs to Vegas for EDC drove past 3 parked cop cars on the highway at different points decided 3 times lucky and slowed down after that point not one chased me. Guss they were looking for people doing 200km/h \n\nAnd before people say Americans drive in miles I had a rental Hyundai and it had both Km and miles on the speedometer",
   "created_utc": 1692830701,
   "score": 7,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxhx9hk",
   "message": "This was a roommate of mine, but our freshman year of college he was crossing the street with a flask on the way to a party. Undercover copy jumps out of a Prius and walks right up to him, the ticket following behind. Just before he gave the MIP to my friend, coo gets radio’d and jumps back in the car no ticket in hand. \n\nSide story: 7am Taco Bell run ended with three of us getting jaywalking tickets upwards of $500. I didn’t get handed a ticket, and my stoned dumbass asked the cop if I should have",
   "created_utc": 1692841151,
   "score": 3,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxgq6xb",
   "message": "[removed]",
   "created_utc": 1692823600,
   "score": 3,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxhk4il",
   "message": "Has anyone said \"shit my co-workers do daily\" yet?",
   "created_utc": 1692835505,
   "score": 4,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxgpuc8",
   "message": "[deleted]",
   "created_utc": 1692823472,
   "score": 255,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxiuraj",
   "message": "Bro a fckn 50gram of port royal in nz went from about 53 buckd just 8 years ago to now just over 140$\n\n\nWHAT THE FUCK",
   "created_utc": 1692860469,
   "score": 0,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxgrcie",
   "message": "i had a group of friends that actively did drugs (never included me or offered me some because i was like a younger sister to them). soon enough i realised that the only reason they did that was because they were utterly unhappy with themselves and their lives. in the end exactly that is what they bonded mostly over. i was also there because i was unhappy and new to the city i currently live in and didnt know any better",
   "created_utc": 1692824022,
   "score": 217,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxizino",
   "message": "Former EMT here. The cops around my county had a favorite song: \"You go to the hospital or you go to jail.\"\n\nOne call in particular stands out, where we got called out for a drunk 20something in the middle of the day. We get there first, and cancel the fire department, but police keep rolling.\n\nShe's belligerent, and we are trying to explain that \"You're medically fine. If you just walk away now, the cops won't look for you. You just can't stay here. But once they get here, you're drunk in public and you're going to get arrested. Just go.\" She wouldn't, though, and after several very long minutes, PD arrived.\n\nCop got in her face, she got in his, and he sang that old classic.\n\n\"You go to the hospital, or you go to jail,\" he told her.\n\n\"*FUCK* you. Take me to jail.\"\n\nThat caught him by surprise. Didn't expect her to call his bluff. But then...\n\n\"...no.\" And he pretty much body slammed her onto the gurney.",
   "created_utc": 1692864339,
   "score": 1,
   "submission_id": "15zg0b6"
  },
  {
   "comment_id": "jxizzxu",
   "message": "I'm not doing the paperwork for weed or weed seeds. The person in charge of our evidence room was also our FTO and would bitch about having to fill out all the paperwork and keep weed seeds in the evidence room because of how everything single thing has to be accounted for every week or so. I'm not a cop anymore but before I was I was a big time stoner so I never really gave a shit about finding weed. I'd just throw it in the trash and give a warning. Not worth fucking up some teens or young adults life with a possession charge or anyones tbh. I feel like that's alot harder to get away with now with how the body cams work. Some are linked to the car and start recording as soon as you turn on the lights. I still think body cams are a good thing though",
   "created_utc": 1692864732,
   "score": 1,
   "submission_id": "15zg0b6"
  }
 ]
}