{
 "submission_id": "15zkymr",
 "title": "If you’re on here anonymously, what is a secret you’ve never told anyone that you really need to get off your chest?!",
 "selftext": "",
 "created_utc": 1692834194,
 "permalink": "/r/AskReddit/comments/15zkymr/if_youre_on_here_anonymously_what_is_a_secret/",
 "score": 119,
 "url": "https://www.reddit.com/r/AskReddit/comments/15zkymr/if_youre_on_here_anonymously_what_is_a_secret/",
 "comments": [
  {
   "comment_id": "jxhnfgz",
   "message": "There are several blank spots in my childhood memories and I’m too scared to think about it.",
   "created_utc": 1692836918,
   "score": 222,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhhbi2",
   "message": "My balls have started to sag to a frightening level as I've aged. I actually have to support them now.",
   "created_utc": 1692834321,
   "score": 97,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhruas",
   "message": "I have a bad back and from time to time it goes into a full spasm.\n\nOne day I was getting out of bed, and as my foot hit the floor I went into a full spasm. I have no idea how, but a perfectly formed turd fell out the leg of my shorts and landed on the floor. Due to my spasm, I fell and landed right in the poop.\n\nThe commotion woke up my gf at the time, and she ran over to check on me.....\n\nI blamed the dog.\n\nI've never actually told anyone this before.",
   "created_utc": 1692838816,
   "score": 223,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhhp5u",
   "message": "My gaming friends don't think I have a microphone but I really do. I'm just very shy about speaking.",
   "created_utc": 1692834479,
   "score": 209,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhp8uj",
   "message": "I graduated w/ Joe. He married Jane 1 week after HS. 18 months later, Kim was born.\n\nAt 12 yrs old, Kim gave birth to a baby. That dad was a well known local cop (Tom)who liked little girls.\n\nOne day, skeletal remain of Tom found in local swamp full of gar, carp, etc--carrion eaters.\n\nToms house, w/ his mom inside, burnt to the ground. Remains of 2 other little girls found buried in basement. Mom's spinal rods and screws found in ashes, so she did burn.\n\nJoe \u0026amp; Jane, along w/ kim and baby, never seen again.\n\nBut every so often, Ill get a postcard from a country known for non-extradition.\n\nI know where joe is. And I wont say anything.\n\nDEAR LAW ENFORCEMENT:  No 'proof' it's joe sending, as he never signs. Just a brief note. (\" Kim graduated today.\" \"We had a boy.\" \"Hot here.\").  And it's been 7+ yrs since Ive heard from him.",
   "created_utc": 1692837698,
   "score": 80,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhipy1",
   "message": "theres a weird thing that i do that i have no idea what it is, \n\ntl:dr: hand equality \n\nso basically, i have this funky little thing where i make things that my body touches equal, for example: i touch an object with my hands, it doesn't matter which hand, and i touch the same object with my other hand, but i didnt use enough pressure to stamp my hand down, so i try it again, but that hand had more touches then the object more then the other hand, so i do this rhythm multiple times until it is perfect, there is no more things i can point out, or any criticisms i can make, so i move on with my day.\n\ni have told, at most, 2 people (my mom and sibling) and it is probably a nasty habit i need to get rid of.",
   "created_utc": 1692834906,
   "score": 93,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhto2x",
   "message": "I gave up ages ago due to  sickness but it's easier to pretend I'm cool than to keep hearing the \"you've got so much to live for\" spiel from people over and over again.",
   "created_utc": 1692839606,
   "score": 82,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhrs8b",
   "message": "I know I'm not the only one, but in Canada, I'm scared that I'll be homeless pretty quick here. And can't express my concern without being shamed or blamed for my decisions",
   "created_utc": 1692838790,
   "score": 77,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi8f89",
   "message": "I came home super drunk one night after going to a bar with my roommates. I fell asleep on the couch. Sometime in the middle of the night I peed my pants, woke up, and stumbled into my bedroom, I guess not realizing what had happened. \n\n\nThe next morning I was last to wake up. I went into the living room where my roommates were waiting. They told me one of my cats had peed on the couch but not to worry, they had started cleaning up already. \n\n\nAll of a sudden the memory came back. I was mortified. I pretended I was just worried about my cats. I obviously took over the cleanup at that point and silently thanked my cats for covering for me.",
   "created_utc": 1692846252,
   "score": 39,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi0brm",
   "message": "I still have thoughts of suicide. They never went away yet i have to tell people im fine",
   "created_utc": 1692842490,
   "score": 72,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi4ymm",
   "message": "I don't know if this is a secret but the future of the cost of living crisis really worries me and keeps me up at night at times. Everything is drastically increasing (rent, housing, groceries, transportation costs). Hard to stay positive knowing how bleak the future can be\n\nP.S I live in Canada",
   "created_utc": 1692844586,
   "score": 66,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhx4a5",
   "message": "I beg for death almost every day now. it will not come...",
   "created_utc": 1692841087,
   "score": 29,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhkd7y",
   "message": "I (black female) lost my V card to a man who was racist.",
   "created_utc": 1692835607,
   "score": 43,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi2ea3",
   "message": "I have two buttholes.",
   "created_utc": 1692843410,
   "score": 23,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhvs11",
   "message": "I’m the one who wiped his ass on the towel as a kid, let my sister take the fall and everyone still believes it’s her 😈",
   "created_utc": 1692840504,
   "score": 21,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxibrw4",
   "message": "When I was in college, there was a bad storm in my neighborhood. While driving home in it, my vehicle hydroplaned off the road and through the wooden fence of someone's house.\n\nBy whatever miracle, there was no damage to my vehicle so I left the scene and went home. But their dog escaped, and to this day, I don't know if it was ever found.\n\nBecause it was early afternoon, I'm assuming the owners weren't home, and because of the storm, there were no cars on the road, so I'm guessing no witnesses.\n\nLast year, I met the owners at a house party thrown by a mutual friend in that same neighborhood. Husband was friendly enough, but the wife was extremely rude and snobby to everyone. Made me feel a little less guilty about what happened.",
   "created_utc": 1692847978,
   "score": 18,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxidm32",
   "message": "I'm like 90% sure I have some form of two different types of cancer (a lump in my testes and a wet cough/pain in my lungs that I've had for a year). My wife doesn't know, and I don't think I ever will tell her. I really do want to get them checked out, but I'm American",
   "created_utc": 1692848975,
   "score": 17,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhpeo6",
   "message": "One time while out trick or treating I took two candies from a bucket with a sign that said to take one.\n\nThe guilt has been eating me alive for years...",
   "created_utc": 1692837767,
   "score": 49,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhr7l1",
   "message": "Mom never let me go to slumber parties with my friends and classmates, so I've only ever had sleepovers with one person, only problem is that said person was the cousin who abused me mentally, physically, *and* sexually...\n\n\u0026amp;#x200B;\n\nIn fairness, I was too scared to tell until about three years ago, so that's when she finally found out.",
   "created_utc": 1692838541,
   "score": 43,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhi3su",
   "message": "I am gay...",
   "created_utc": 1692834648,
   "score": 68,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxibc1x",
   "message": "I feel like a failure .... used to be the best student at my school and ballet dancer of my town .... until my dad passed away , switched schools , covid came , had an eating disorder, depression ..... I have 0 friends and my family does not seem to care about me now that I am no longer something that they can brag about . I wish I had the courage to move far away , forget everything and everyone , and start over , without the pressure of being \"extraordinary\".",
   "created_utc": 1692847753,
   "score": 15,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi0saz",
   "message": "My uncle had a breakdown and self-exited himself, he kept his demons pretty well hidden so I had no idea it was coming\n\nMy cousin had 2 young kids and had a heart attack and died at one of their baseball games, they lived several states away.\n\nFor some reason, I feel an extreme amount of guilt that I wasn’t there to stop either of their deaths, even knowing there’s really no way I could have. They’ve both been gone for a few years now and this feeling of guilt still comes up in my brain a lot.",
   "created_utc": 1692842696,
   "score": 24,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi0ogg",
   "message": "This is actually pretty recent but it's whatever. I have a 8 year old pitbull mix that I got around 2 years ago from a woman who was moving away. Now, for some context, this woman has not only \"raised\" (I say this because of reasons I will discuss soon) this dog from being a puppy to being a middle aged dog. Both her and her boyfriend abused this wonderful dog severely, first by beating him to \"turn him into a guard dog\" which he was NOT bred for (he likely wasn't bred very well either) then did not train him at all (this is a 70+ lb dog I'm talking about here. Him being trained meant life or death and unfortunately the latter is what is about to happen) and finally, for the last probably five years of his life, locked him outside or in a crate and gave him a human adult's worth of Xanax every. Single. Day. Now onto the current problem. You see, when I got the dog, I wasn't sure exactly what I was getting into aside from his initial behavior when I met him to see if he was a good fit for our home, since the lady we got him from decided not to disclose his previous abuse and neglect or even the fact that he had an entire Xanax script for his anxiety to us at all, and only mentioned that he just \"hangs outside most of the day.\" He didn't really show any signs of being trouble so I said yes, and he started living with me the next day. And that's when the trouble began. First night, we placed him in his crate with blankets and gave him one of two provided Xanax bars that were meant to keep him calm in the time he was meant to adjust to his new home. Not even an hour later, after my mom and I had gone to bed, we hear metal and plastic scraping coming from the office where he was sleeping. We both go check it out and low and behold--the dog is sitting outside of his crate, which was completely broken from the bent metal wiring on the door of the crate. This dog, on enough Xanax to knock an adult out, BENT THE METAL BARS OF HIS CAGE TO ESCAPE. And that's not where it ends. This dog has destroyed two different couches, countless pillows, blankets, shirts,  headphones and chargers in the span of two years. Hell, this dog has nawed at my school computer. He destroyed almost all of our Christmas presents the first year we had him. Destroyed part of our Christmas tree the next. He's eaten at least two pairs of my shoes. Not to mention the random aggression towards my mom's boyfriend. Growling, barking, even lunging towards him. And then there's the most dangerous part, the part that, no matter what I or anyone else does, will cost him his life. The escaping. So, so many times, has this dog torn through doors, or dug holes under fences, or gone through the window cover for my AC to leave the house. Now, I live in a decent neighborhood, but, it's also Texas. There are so many times where I've feared that I'll come home from school or going out somewhere to find my dog dead from any number of things, whether it be dead on the road or being shot by someone who thought he was a threat, or even eating something he isn't supposed to and dying slow, confused, and in pain, which are the last three things I'd ever want for him, ever. I love him, so, so much, he is such a wonderful loving and goofy dog aside from his behavioral issues. He's shown me so much love and loyalty over these past two years, and what's awful is how he doesn't understand why he can't run around freely and why I have to do what I'm about to do on Friday. I only see this going a few different ways: Let him live and keep him locked up like a criminal to keep him safe, and watch him slowly deteriorate (as he is elderly now, especially for a bigger dog) and forget who I or my mother are, subjecting us both to aggression and fear of being attacked, Give him to someone else, which would confuse and scare him, and who will likely put him down in a less humane way because of his behavior, or spend his last days giving him love, care, and peace,as well as making good last memories for both of us before euthanizing him for not only his sake but my other dog's sakes as well, since we do have another younger dog who has often followed him outside and has risked meeting an unfortunate fate as well. I hate that I have to do this to a dog that has been there through the hard and the good times I've had these past few years,  but what I hate more is the woman who took a dog who had so much potential to become an amazing family dog that would live a long and happy life, and stole his chance at a normal life away because she couldn't take the time to properly take care of him or give him to someone who could properly care for him when he still had the chance to be well socialized and a normal functioning dog. And worst of all, it feels like none of the people around me understand what it's like to have to make this choice, much less how difficult it has been to dwell over it and wonder if I really am making the best choice I can for him and the others who live in my home.",
   "created_utc": 1692842648,
   "score": 30,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhh7t7",
   "message": "I peed in the pool",
   "created_utc": 1692834279,
   "score": 20,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi84mm",
   "message": "Friend of mine claimed his house got broken into and a bunch of his possessions were stolen. Including a nice tv I sold him and a couch I gave him.\n\nBut no, it didn't take long to figure out he sold/traded/pawned it all to buy pills in the desperation of addiction. I didn't call him on it, I just tried to help him get off that shit.\n\nJoke's on whoever got that couch; there was a period blood stain on the underside of one of the cushions  from an old girlfriend of mine.",
   "created_utc": 1692846106,
   "score": 10,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxieenk",
   "message": "I get moments where I need to obsessively clear my throat. It seems to come and go. Months will go by where I don’t have this urge, then for a few weeks I annoy the shit out of everyone because there is this “feeling” in my throat, and I need to get rid of it. I’ve gone hoarse from it. \n\nIdkwtf it is. But it’s annoying, and annoys the fuck out of everyone around me, but I feel like it’s a compulsion. I *have* to do it.",
   "created_utc": 1692849414,
   "score": 9,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi7bk9",
   "message": "Well, idk if its too much of a secret, more just something that bothers me sometimes when im alone, i have never been complimented in my life, like other than idk, my mom saying that my hair looks nice when i just cut it i dont remember ever receiving a compliment, only insults really, its hard for me to see anyone ever wanting to be with me because it just doesnt make sense to me, it feels like everything related to me is either irrelevant or wrong and i dont know what i have to do to change it",
   "created_utc": 1692845711,
   "score": 17,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhpfwk",
   "message": "I can’t keep my mouth shut, genuinely don’t think I have a secret at least one friend doesn’t know",
   "created_utc": 1692837783,
   "score": 9,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi4j6o",
   "message": "I was pregnant in 2010 and miscarried after a few weeks, maybe a month, and I remember just being really sad and scared and stressed all year and when i lost it i remember grieving my heart out and i had to keep the entire story quiet. Rip I.J.M. I hope ur in heaven and i will meet you one day! I bet you would’ve have been a beautiful daughter. Maybe i would not have been a great mom, but it would’ve been cool to know i could hypothetically had kids despite having severe pcos",
   "created_utc": 1692844388,
   "score": 14,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhtx0o",
   "message": "Ha, Nice try FBI",
   "created_utc": 1692839714,
   "score": 12,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhq09y",
   "message": "Removed that \"Do not remove tag\" from my matress. Will they now come for me?",
   "created_utc": 1692838027,
   "score": 17,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhvlad",
   "message": "I had a couple islander friends back in the day, Micronesians to be exact. They had invited me over to a family get together. Lunch time came around and they pulled out the mats for us to sit on and eat. I was enjoying the new cultural experience and suddenly they pulled out a plate with what looked like raw chicken that had been mildly seasoned. In my head I thought cool they about to throw it on the grill but nope. They all just started reaching out for a piece and eating it raw. I was shooketh and started grinding my gears at the possibility of them being cannibals. From that day on every time they invited me I always looked for an excuse not to go. I wasn’t trying to be racist or anything I was just afraid of being their next victim or some.",
   "created_utc": 1692840423,
   "score": 16,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhvpzn",
   "message": "I... am... sad... that I peed. I I I'm sad that peed in class instead of a toilet.",
   "created_utc": 1692840479,
   "score": 12,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxie3x6",
   "message": "When my son was a new born maybe 1 yr tops. I needed my caffeine fix so I put him down for his nap and drove down the road to the gas station and got my energy drink. Wife was at work and to this day I feel that was the most selfish thing I've ever done.",
   "created_utc": 1692849247,
   "score": 15,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi986i",
   "message": "i have been having very bad suicidal thoughts, it feels like there’s a whole other person in my brain trying to convince me so hard to kill myself and it makes me feel like i’m losing my fucking mind",
   "created_utc": 1692846658,
   "score": 5,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxinidi",
   "message": "Quick Backstory, My mom dated this guy who treated her and my brother like gold but abused, starved and beat me regularly because I was the only white one in the house and I'd fight back but I was 10 so he easily overpowered me and seemed to enjoy it. \n\nHis car accident wasn't an accident.... Oops.",
   "created_utc": 1692855123,
   "score": 4,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi6w7g",
   "message": "I’ve only been in relationships with men but the only kind of porn I love to watch is lesbians",
   "created_utc": 1692845508,
   "score": 9,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxif9j5",
   "message": "I’ll probably delete this in the morning. I don’t know who my daughter’s father is. I was dumb at 17. Hopped from one guy to the other in 2 weeks. They both know, so does she. I eventually told her when she was 18. Neither guy has been involved in her life and both refused DNA tests(for fear of child support) Now that 23\u0026amp;me is a thing she won’t do it because she’s afraid it’ll ruin our relationship if she finds out. \n\nIt weighs on my mind everyday. She wouldn’t have had a positive life life with either but at least she’d know. My dad left when I was 2 and died when I was 8 so I understand part of it, but at least I know who it is. She acts tough but I know this must bother her.",
   "created_utc": 1692849899,
   "score": 12,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhv2zf",
   "message": "I've spent fifty years trying to wank myself to death ! maybe I'm immortal ?",
   "created_utc": 1692840206,
   "score": 4,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi1x68",
   "message": "I've had an addiction to pornography since I was 12 years old. I want to stop, but I just can't without something tangible motivating me to. I don't want to tell anyone, and I've never had somebody in my life who I've wanted to better myself for (no significant other or anything like that). Because of that, I've often resorted to injuring myself every time I relapse just to try to \"get the point across.\"",
   "created_utc": 1692843197,
   "score": 3,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi5770",
   "message": "Oh no, just no and nope.",
   "created_utc": 1692844697,
   "score": 4,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi79ug",
   "message": "i pick my nose but not in the way a 5 year old does, i do it in the bathroom or shower because sometimes blowing it doesn't feel like enough. i do it in the bathroom so i can just wash my hands after.",
   "created_utc": 1692845687,
   "score": 4,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxig6ep",
   "message": "I'm far too old to still be dependent on my parents, but I still am. I have mental illness out the wazoo but should be able to support myself by now. I'm more stable now than ever really in my adult life... I was hospitalized 4 years ago for SI and that was definitely the start of a journey in recovery. But yeah, I'm honestly just a fuck up of an adult. I'm endlessly lucky to have the love and support of my family, and there's no real \"reasons\" in my life that justifies any depression and anxiety, I just have really fucked up brain chemistry. But my gratitude for my family is immense. I don't take it for granted for a second. Even being able to receive the medical care i do is a massive blessing and i would def not still be here otherwise. But yeah, i guess I'm terrified to be more independent yet absolutely hate myself for it. I never talk about it with anyone cause I sound so spoiled, and honestly I am. I definitely don't deserve the blessings I have",
   "created_utc": 1692850427,
   "score": 4,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxijde9",
   "message": "It wasnt a cat. Its never been the cat. im doing better now, i hope to never have to blame the cat again.",
   "created_utc": 1692852383,
   "score": 3,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxijm8u",
   "message": "I want to smell your panties. I will obviously buy them first.",
   "created_utc": 1692852538,
   "score": 4,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhnui3",
   "message": "I eat crayons. A lot of crayons.",
   "created_utc": 1692837098,
   "score": 6,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhynuj",
   "message": "Nice try FBI.",
   "created_utc": 1692841762,
   "score": 6,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi241a",
   "message": "This one time, had a worse day than usual. People were very hateful to me for little or no reason. I came home and didn’t bother to fix supper. I went to my bedroom to lie down and didn’t even undress. My sheets had been washed but not put on the bed. I sat there for some time. Finally I picked up a large knife from my dresser. I had been contemplating something for some while. I looked down at the mattress and saw this damned tag with its mocking message. And I took that knife…",
   "created_utc": 1692843283,
   "score": 9,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxihhw7",
   "message": "I was so severely abused as a kid that I can’t function in society today because of the lasting damage. Doctors can’t make sense of my symptoms because nothing adds up but I can’t remember half the abuse so I can’t say what caused what. I ended up homeless for a bit and now still feel like a failure because I’m a bartender barely making a living even though I’m only a few credits shy of a degree. I can’t finish school because I can’t afford it. My parents have vacation homes.",
   "created_utc": 1692851213,
   "score": 7,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxiixoh",
   "message": "I am a lesbian and I am dating a girl without anyone (except you guys) knowing",
   "created_utc": 1692852104,
   "score": 7,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxibvt9",
   "message": "Epstein didn’t kill himself",
   "created_utc": 1692848036,
   "score": 6,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhms7a",
   "message": "[deleted]",
   "created_utc": 1692836643,
   "score": 3,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxikkzz",
   "message": "I think about suicide frequently although I'm to scared to go through with any plan.. i feel like everyone is centric and only cares about what I can provide them... Maybe I'm projecting my own feelings about myself. I feel very negative about most things in my life and I can't think of any way to change it.\n\nI'm a 26m and have never had a girlfriend. I am extremely awkward and anxious whenever I am presented with any person I find attractive. Last time I had sex was 7ish years ago. She said it was the fastest sex she's ever had... After all the shame I can only laugh at myself. I feel like a failure.\n\nI'm addicted to weed and distraction and others approval. I lost God 😂 and even started praying to the universe or God for some sort of redemption. I'm pathetic and dumb and a coward and pretty ego centric as well. I want death of my current circumstances. I want courage and power to be better.\n\nAm I lame? Immature? I have been to therapy for about 10 sessions where my therapists suspected I may have autism.\n\nSorry for rambling",
   "created_utc": 1692853162,
   "score": 3,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxikndw",
   "message": "I'm a pretty open book with basically anyone. I don't tend to hide a lot of things, however, one thing I have never told anyone (until this point, I guess.) is that I was molested as a child. By 2 different people. One was an older boy I used to play with when I lived in Ireland, who took advantage of my naivety and lack of knowledge. The other, the worse one, was my older sister. I'm living proof it absolutely does happen to guys too.\nI remember watching scary movie when it came out with my family, and I remarked that the pubic hair chainsaw scene resembled my sisters downstairs region. She was incredibly flustered and said I must have walked in on her in the shower. She still tells that story, finding it hilarious. That tells me she remembers what she did and it disgusts me.",
   "created_utc": 1692853206,
   "score": 3,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jximuon",
   "message": "I had another reddit account that was about 11 years old. Had build up some friendships and connections in my city's subreddit.\n\nI ended up spending too much of my mental resources (modding, chatting/commenting, socialising) on the subreddit instead of IRL with people who really matter.\n\nI deleted the account and just disappeared. I'm no longer subscribed to that city's subreddit now.\n\nI suddenly have so much more mental capacity for better work (and doing my own work on the company's time when work is slow), relationships with my family and being present in my life.\n\nI didn't know I was addicted to reddit, but I was.",
   "created_utc": 1692854675,
   "score": 3,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhxkm5",
   "message": "I shot a man in Reno........just to watch him die",
   "created_utc": 1692841287,
   "score": 11,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxi526m",
   "message": "I had an affair with my brother's wife and there's a very good chance that his youngest daughter is biologically mine.",
   "created_utc": 1692844632,
   "score": 4,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxigtsd",
   "message": "I was sexually abused as a child by my mother’s friend’s nephew. He was like 5 years older than me when I was like 7… I think. I spent many years trying to forget about the whole situation, and it only really came back to my mind after my ex wife started making up fake rape stories about me because she left me for another man and everyone sided with me… so telling people I raped her is her attempt to get people to side with her.",
   "created_utc": 1692850808,
   "score": 2,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxijq6u",
   "message": "I'm not doing well",
   "created_utc": 1692852608,
   "score": 2,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxil0wv",
   "message": "My family doesn’t know that I love doing small bits of cocaine instead of coffee, it’s better In my opinion",
   "created_utc": 1692853452,
   "score": 2,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxilwjv",
   "message": "Nice try mom.",
   "created_utc": 1692854039,
   "score": 2,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxiovav",
   "message": "Every night I obsess over how the world is slowly dying and what the future would look like long after I’m gone and how we are just parasites of this earth that the earth is trying to rid itself of. And I look around and see people stuck in their own little worlds only concerned about their looks and fashion and pointless material items. \nThere’s so many fires in Canada that the NWT had to evacuate, and now Hawaii. The ice caps are melting and the polar bears are dying of exhaustion because they have to constantly swim because of lack of resting places (ice bergs) animals are becoming extinct, the ocean is heating up to dangerous levels that are sending deep sea organisms to the surface alive/dead.\n\n\nThe rise in crime in my city as well as every other city, the fentanyl and Xylazine epidemic.\nDon’t forget the ongoing Covid and it’s variants.\n\nThe price of eating and living with shit wage.\n\nIt’s taking a toll on my mental health. \n\nAnd I just have to pretend everything is fine everyday. That these thoughts I have don’t run through my head everyday that I step foot outside my door. That I sit and talk w my friends about their relationship and how much followers they got on tik tok. Like what the actual fuck",
   "created_utc": 1692856067,
   "score": 2,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxixfry",
   "message": "Nice try FBI",
   "created_utc": 1692862617,
   "score": 1,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhl6bv",
   "message": "I got off to a desk when I was around friends bjt no one knew cause I’m known to be fidgety. Unless like someone saw my leggings being a bit wet idk but it’s like embarassing now cause I was like 15",
   "created_utc": 1692835951,
   "score": 3,
   "submission_id": "15zkymr"
  },
  {
   "comment_id": "jxhl33x",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15zkymr"
  }
 ]
}