{
 "submission_id": "15ztw0d",
 "title": "What is the craziest medical condition you've ever heard of?",
 "selftext": "",
 "created_utc": 1692859369,
 "permalink": "/r/AskReddit/comments/15ztw0d/what_is_the_craziest_medical_condition_youve_ever/",
 "score": 205,
 "url": "https://www.reddit.com/r/AskReddit/comments/15ztw0d/what_is_the_craziest_medical_condition_youve_ever/",
 "comments": [
  {
   "comment_id": "jxiv8xg",
   "message": "Fibrodysplasia ossificans progressiva (FOP) is a rare muskuloskeletal condition where, after birth and progressively through life, muscles and tendons are gradually transformed into bone (a process called ossification). This creates a second “skeleton” of extra bone, which makes movement impossible.",
   "created_utc": 1692860851,
   "score": 136,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxixfbk",
   "message": "Knew a woman who couldn’t conceive with her husband.\n\nHe could theoretically get another woman pregnant, and she could theoretically get pregnant from another man, they just couldn’t conceive together.\n\nHe donated blood (maybe marrow) to her while she was being treated for cancer. This somehow made her body immune to his sperm.\n\nThey wound up adopting a couple kids.",
   "created_utc": 1692862607,
   "score": 124,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjh8ja",
   "message": "The Capgras delusion: the person becomes inalterably convinced that someone close to them has been replaced by an imposter who has disguised him/herself so cleverly that they look identical to the replaced person. \n\n\"Yes, this woman looks and acts just like my wife and knows everything my wife would know. ...But she is an imposter disguised to fool me and I will have nothing to do with her.\"\n\nIt's funny to think about in some ways but would be absolutely terrifying to have.",
   "created_utc": 1692877346,
   "score": 187,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj7kno",
   "message": "Body integrity disphoria: people who desperately want to cut off a part of their body, a limb for instance. They have always been thought of as insane until someone decided to have a look at their brains and realised that the limb in question isn't registering in their brain. To them, it feels like an alien appendage was sewn to their body. I find that so fascinating.",
   "created_utc": 1692870916,
   "score": 88,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxiviad",
   "message": "That disease that ages people at an insane rate that often kills it’s sufferers before they turn 16. I think it’s called progeria.",
   "created_utc": 1692861057,
   "score": 25,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj9qgc",
   "message": "Fatal insomnia. It's a pretty rare condition, but horrible as hell.\n\nBasically, it starts with casual sleeping problems which worsen over time. In the end, it leads to total insomnia, which results in various symptoms as dementia, coordination issues, paranoia and hallucinations until you die. There is no cure.",
   "created_utc": 1692872560,
   "score": 252,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxiybkr",
   "message": "I met a guy who practically had eggshells for bones. He broke them about 50 times or so doing simple things like just sitting on a couch or brushing his teeth.",
   "created_utc": 1692863348,
   "score": 210,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj0fm8",
   "message": "[Auto-brewery syndrome](https://en.wikipedia.org/wiki/Auto-brewery_syndrome)\n\nor gut fermentation syndrome is a condition in which ethanol is produced through endogenous fermentation by fungi or bacteria in the gastrointestinal  system\n\nPatients with auto-brewery syndrome present with many of the signs and symptoms of alcohol intoxication while denying the intake of alcohol",
   "created_utc": 1692865091,
   "score": 119,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj55jo",
   "message": "That baby which didn't grow up. Years later she was still a baby. Her name is Gabby Williams.",
   "created_utc": 1692868980,
   "score": 198,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxiwsl3",
   "message": "[Alice in Wonderland syndrome](https://en.wikipedia.org/wiki/Alice_in_Wonderland_syndrome)  \n  \nI experienced this when I had a high fever as a kid, and was happily delirious, playing ball with Pink Panther at the foot of my bed. We tossed this invisible ball back and forth, and sometimes it was enormous and light, and then it would shrink and become impossibly small and heavy. It was fun.",
   "created_utc": 1692862086,
   "score": 10,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxiyw1p",
   "message": "Allergy to water. It's extremely rare, last I researched it I believe there were less than 10 documented cases. And yes, they are allergic to themselves. They can't drink straight water, typical hygiene is a huge no go, and even humidity can trigger bad reactions.\n\nEdit: I went and hunted out a more updated video on the allergy. This is a really great summary, and evidently there's just under 50 people now that have been diagnosed, and for some reason diet soda seems to be one of the least reactive drinks. \n\nhttps://youtu.be/OH2HzmnwRLk?si=tmuu5Wt0u5ODZ_qt",
   "created_utc": 1692863816,
   "score": 252,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjlifx",
   "message": "[There are conjoined twins (the Hogan sisters) who are attached at the head and their brains are attached.](https://www.youtube.com/watch?v=VGslJPaxbD8) Each one can see through her sister's eyes.  Each one can taste the food the other one is eating.",
   "created_utc": 1692879640,
   "score": 112,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj25ba",
   "message": "munchausen syndrome by proxy",
   "created_utc": 1692866492,
   "score": 51,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxiwfce",
   "message": "Alien hand syndrome for sure.",
   "created_utc": 1692861783,
   "score": 99,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjev3j",
   "message": "The disorder where you cannot recognize people by their face, even if you've known them for years, I forget what it's called",
   "created_utc": 1692875968,
   "score": 94,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjbf3g",
   "message": "Exploding head syndrome. Sudden short, loud auditory hallucinations when falling asleep or waking up. Not a particularly crazy condition I suppose, but the name makes it sound pretty brutal.",
   "created_utc": 1692873751,
   "score": 248,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxje3qq",
   "message": "Not craziest but most awful I think. Ever wondered how people die of dementia? \n\nThey forget how to swallow or breathe or heal from illness/infections etc. \n\nFuuuuurk that.",
   "created_utc": 1692875505,
   "score": 224,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxitwh2",
   "message": "Allergies. People can be allergic to anything. When I was in college I had a math prof who was allergic to her own hair.",
   "created_utc": 1692859800,
   "score": 51,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj760w",
   "message": "Fatal familial insomnia. It’s a very uncommon, genetic disease that stops you from falling asleep. Leads to dementia and eventually, within a few months to a few years, death. Has no known cure.",
   "created_utc": 1692870601,
   "score": 254,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjfsqg",
   "message": "Locked in syndrome gives me the creeps just the thought of it.\n\nMy sister in law the paramedic told me about Lazarus syndrome. Fuuuuuuuuck.",
   "created_utc": 1692876521,
   "score": 136,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj5x6b",
   "message": "Epidermodysplasia verruciformis, or \"tree man syndrome\"",
   "created_utc": 1692869604,
   "score": 54,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjfq7x",
   "message": "Visual agnosia.  A perceptual problem not involving blindness.  Covered (among other cool things) in [The Man Who Mistook His Wife for a Hat](https://en.wikipedia.org/wiki/The_Man_Who_Mistook_His_Wife_for_a_Hat).",
   "created_utc": 1692876478,
   "score": 55,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjhzax",
   "message": "A dwarf developing gigantism\n\n\nOnly happened once in recorded history",
   "created_utc": 1692877760,
   "score": 57,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj3p8z",
   "message": "Aortic dissection/delamination. I worked at a tissue bank when i found out about this one.  Apparently the layers lining your aorta spontaneously separate. It blew my mind to find out that people survive this.",
   "created_utc": 1692867780,
   "score": 144,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjc4pz",
   "message": "If I'm not mistaken, a woman in India grew a horn on her forehead.",
   "created_utc": 1692874234,
   "score": 55,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj9tqc",
   "message": "Not the craziest in this sub, I'm sure, but my father has a combination of medical conditions that makes healing him a nightmare...\n\nHe is badly allergic to all aluminium compounds and to two molecules that are used in most desinfectants. He is litterally allergic to hospitals, as they use a lot of desinfectant. And a lot of medication have some kind of aluminium compound as excipient.\n\nFor example, he can't treat a bad case of eczema because all of the creams on the market in our country have aluminium. He can't be vaccinated for the same reasons (except COVID19 as the vaccine don't have aluminium).",
   "created_utc": 1692872625,
   "score": 100,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjlz9r",
   "message": "Huntington's chorea.\n\nIt affects the centre of brain that controls voluntary movements and causes people to develop involuntary dance like movement.",
   "created_utc": 1692879877,
   "score": 51,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjfk8y",
   "message": "Synesthesia. A condition where your brain mixes up sensory signals.\n\nWith this condition, one might be able to taste words, or certain numbers will always appear a specific color, or you might literally see music or smell something and feel as though you're being touched.",
   "created_utc": 1692876379,
   "score": 125,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjp8th",
   "message": "Abby and Brittany Hensel. A very extreme case of conjoined twins where they look like one body with two heads. What makes it seem crazy to me though is how not problematic it seems to be for them. They are extremely high functioning and have no problem walking and moving like normal. They even were on the volleyball team in high school.",
   "created_utc": 1692881476,
   "score": 38,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjadhl",
   "message": "Maple Syrup Urine Disease…look it up, it’s a defect in metabolism that can cause brain damage and causes your urine to smell like maple syrup",
   "created_utc": 1692873020,
   "score": 74,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxiu8ba",
   "message": "Nutmouth/pine mouth\n\nSome people have a metal taste in their mouth for upto 2 weeks after eating pinenuts",
   "created_utc": 1692860057,
   "score": 95,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjhtju",
   "message": "Güevedoce is a rare medical condition found in the Dominican Republic, Papua New Guinea and Turkey where an inability to metabolize testosterone for embryonic development results in infants being born with female genetalia. However when puberty begins at age 12, their body is flooded with testosterone resulting in a natural biological sex change to male. \n\n\nSource: https://en.m.wikipedia.org/wiki/G%C3%BCevedoce",
   "created_utc": 1692877670,
   "score": 63,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjjc74",
   "message": "That woman posting that she didn’t speak infront of her child for years because it’d scream and cry every time it heard her voice.",
   "created_utc": 1692878496,
   "score": 66,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxk9qw5",
   "message": "Harlequin ichthyosis \n\nIt is a genetic disorder that results in thickened skin over nearly the entire body at birth. The skin forms large, diamond/trapezoid/rectangle-shaped plates that are separated by deep cracks.These affect the shape of the eyelids, nose, mouth, and ears and limit movement of the arms and legs.Restricted movement of the chest can lead to breathing difficulties.These plates fall off over several weeks.\n\nGoogle it if you’re interested but do know it is graphic.",
   "created_utc": 1692889924,
   "score": 34,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjaq4y",
   "message": "Research this when you want a good nightmare.\nPseudomyxoma peritonei AKA jelly belly.\n......which leads to 'the mother of all surgeries'\nBasically, cut you open top to bottom, carve you up like a turkey (a little bit of your lung, little bit of your liver, etc), then soak your entire body in warm chemo drugs",
   "created_utc": 1692873271,
   "score": 60,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjjuos",
   "message": "Spontaneous pneumothorax. It's funny how a hole can randomly appear in your lungs.\n\nYeh, I got that and broke the record at the hospital for having the largest one. Not the record you'd want to be breaking...",
   "created_utc": 1692878772,
   "score": 62,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjiuc1",
   "message": "Fatal familial insomnia. Any prion diseases really.",
   "created_utc": 1692878227,
   "score": 29,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjc1lr",
   "message": "Apparently, there’s an EXTREMELY rare disease where your muscles turn into bone over time (not sure how that works).\n\nVery scary stuff",
   "created_utc": 1692874175,
   "score": 25,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjdvu6",
   "message": "That one where they brew beer in their stomach. My coworker was a hypochondriac and came up with a new disease she had daily. She was convinced she had that one and that's how I found out about it.",
   "created_utc": 1692875368,
   "score": 23,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjjqyt",
   "message": "People waking up from surgery and having an authentic foreign accent.",
   "created_utc": 1692878717,
   "score": 22,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxkgzcy",
   "message": "1. Parasitic twins ( it’s when you have a conjoined twin that’s feeding off of you and is trying to kill you)\n\n2. Kuru disease ( It’s caused by cannibalism specifically caused by the consumption of human brain it first causes random laughing fits, than they loss control of their emotions, than they start to shake uncontrollably and eventually they lose completely control of their body) \n\n3. Naegleria fowleri ( Brain eating amoeba)\n\n4. Elephant Man syndrome \n\n5. There’s a medical disorder that causes people not to be able to feel pain\n\n6. ( This one I suffer from it’s caused by poor blood circulation) it’s called Renards syndrome it causes your fingers to turn sickly yellow or blue and you can cold very easily too and it feels like your hands are turning into ice at times but normally it just looks scary and it’s not painful through sometimes it’s extremely painful. Even the slightest bit of causes my fingers to turn yellow and I also lose feeling in my fingers too. It’s very common through \n\n7. Down syndrome I just find it crazy how one little error in the cell division can cause so much damage I know multiple people who have this disorder but they are in good spirits despite their disorder and they don’t let it stop them from achieving their goals. \n\n8. Autism ( I have autism and it’s not necessarily the symptoms that I find weird about but the fact that it’s a wide spectrum disorder and it’s a very mysterious disorder as their isn’t much information on it despite it being so common)",
   "created_utc": 1692892591,
   "score": 19,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxixcax",
   "message": "My next door neighbor's vasectomy didn't work, it just changed the baby skin color... Weird",
   "created_utc": 1692862538,
   "score": 136,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjg2mh",
   "message": "Locked in syndrome\nYou are essentially in a coma but are completely alert and aware of everything that happens to you, sounds and all. It's like sleep paralysis but always.\n\nTree man syndrome, a condition where your skin grows like tree bark or something like that.\n\nStiff-person syndrome (SPS) condition where your muscles or something get stiffer and stiffer until you eventually are locked in whatever position you were in towards the end.\n\nHyperthymesia allows people to remember nearly every event of their life with great precision.",
   "created_utc": 1692876682,
   "score": 39,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjgibo",
   "message": "In the past, I was a student nurse.  \n\nProbably one of the \"craziest\" (honestly, most awful) conditions that I've ever read about is Anecephaly (a baby is born without a portion of its skull, and their brain is exposed).  The baby is usually stillborn, but if they are born alive, they usually die very soon after birth (anywhere from hours to days).  It's heartbreaking.",
   "created_utc": 1692876934,
   "score": 43,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjehzk",
   "message": "Not the craziest per se but Mine. I have severe sun sensitivity . I haven’t met anyone like me in my 33 years of life. \n\nI have to use a parasol/wear long sleeves etc starting from early spring already. I get terrible rashes or hives if I’m exposed to the sun for even 2 minutes without any kind of protection. \n\nThe rashes/hives are itchy as hell, and sometimes painful. I’ve even had a fever from being in the sun for “too long” (or a normal amount for normal people). \n\nI don’t burn like a regular person and my skin doesn’t peel off. I get rashes or hives that usually last a few hours and come on suddenly. \n\nIn the winter and fall I’m ok. I can be out in the sun no problem. \n\nI have yet to see a doctor about this, because I’m scared they won’t believe me.",
   "created_utc": 1692875747,
   "score": 36,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjk6t6",
   "message": "Not the craziest, but I have geographic tongue. Certain foods will burn a hole or canyons in my tongue. Usually it's lemon, walnuts, and eggplant for me. The burning starts within a minute. Only dairy products help the pain.",
   "created_utc": 1692878948,
   "score": 15,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjmn01",
   "message": "Prader Willi syndrome. https://www.mayoclinic.org/diseases-conditions/prader-willi-syndrome/symptoms-causes/syc-20355997\n\nETA: intrahepatic cholestasis of pregnancy.  Pregnancy hormones elevate liver enzymes and bile, causing jaundice, insane fiery total body itching, and can result in stillbirth. Aka, why I'm done having kids.",
   "created_utc": 1692880209,
   "score": 15,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjn2co",
   "message": "That one where your muscles and ligaments slowly transform to bone, effectively turning you into a statue. Fibrodysplasia ossificans progressiva (FOP)\n\nThat's nightmarish.",
   "created_utc": 1692880422,
   "score": 12,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjul3w",
   "message": "Xeroderma pigmentosum\n\nBasically you react the same way to sunlight as a vampire. Kid in my neighborhood growing up had it. All the windows had wood covering them.",
   "created_utc": 1692883890,
   "score": 12,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxk5u6g",
   "message": "I think it's called foreign limb syndrome. Basically for some reason, that I don't know, your limbs will move on their own, without you trying to move say your arm. \n\nI saw a showing this where the people that had this syndrome, had to sleep with one of their arms, the one affected by the syndrome, handcuffed to their bed. Otherwise they would wake up because their own hand would be choking them!\n\nTerrifying to me. Your own body literally trying to kill you.",
   "created_utc": 1692888439,
   "score": 12,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj9p7h",
   "message": "Methemoglobinemia, which can turn your skin blue. There is/was a family in Kentucky who is affected by that (The Blue Fugates).",
   "created_utc": 1692872534,
   "score": 47,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjm3uv",
   "message": "I had a teacher that went on a cruise and while she was below deck her brain decided that her balance system was broken because it didn’t match what she was seeing. So for the rest of her life her internal balance systems didn’t work and she’d get nauseated from simple tasks",
   "created_utc": 1692879941,
   "score": 27,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjmm2c",
   "message": "Certainly some stranger ones in here, but the one I’ve heard of in my line of work is Charles Bonnet syndrome. Basically people who have lost parts of their vision, the brain hallucinates different images into those spaces of vision loss. It’s not mental health related in the slightest, it is just the brain filling in the gaps!",
   "created_utc": 1692880196,
   "score": 12,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj7ns2",
   "message": "Morgellons\nA controversial condition involving skin lesions and the belief that the skin is infected by bugs and other objects like string.\nThe condition is relatively uncommon and the cause isn't fully understood. Testing for infection by bacteria or parasites is usually negative.",
   "created_utc": 1692870984,
   "score": 33,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj8bak",
   "message": "Cotard Delusion",
   "created_utc": 1692871496,
   "score": 37,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj91wx",
   "message": "Whatever that syndrome is that makes people suddenly develop an accent. Lol.",
   "created_utc": 1692872062,
   "score": 32,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxj43rv",
   "message": "Tardive dyskinesia. And now I have to take a 8000 dollar a month med because I take too many meds",
   "created_utc": 1692868115,
   "score": 43,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxjipax",
   "message": "What was the name of the disorder that french dude Tarrare had where he had the insatiable appetite? That whole story is crazy...",
   "created_utc": 1692878151,
   "score": 10,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxk40t1",
   "message": "I met a lady on a Nordic cruise that is severely allergic to UV.  She walks around 100% covered all the time and only visits low UV areas ( like the Arctic).  She dressed like a pink ninja with sunglasses and a big sun hat and always wore an ankle length coat and gloves.  Didn’t look very fun.",
   "created_utc": 1692887739,
   "score": 10,
   "submission_id": "15ztw0d"
  },
  {
   "comment_id": "jxivkfq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15ztw0d"
  }
 ]
}