{
 "submission_id": "15zxxo9",
 "title": "What is the worst lie you caught your parents telling?",
 "selftext": "",
 "created_utc": 1692872467,
 "permalink": "/r/AskReddit/comments/15zxxo9/what_is_the_worst_lie_you_caught_your_parents/",
 "score": 161,
 "url": "https://www.reddit.com/r/AskReddit/comments/15zxxo9/what_is_the_worst_lie_you_caught_your_parents/",
 "comments": [
  {
   "comment_id": "jxjaniv",
   "message": "That my mother was schizophrenic. I was 15 and knew she had been battling depression for years. Schizophrenia runs in our family and as an angsty teenager it was very easy for me to believe that she was crazy. She was completely convinced that my father had a secret second family. She was diagnosed and medicated for years. He did have a second family.",
   "created_utc": 1692873220,
   "score": 82,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxj9w9j",
   "message": "\"I won't get mad at you.\"",
   "created_utc": 1692872676,
   "score": 228,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjc3sw",
   "message": "[removed]",
   "created_utc": 1692874217,
   "score": 5,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjaowu",
   "message": "They told me if I was lying there would be bubbles on my tongue. So when they asked me something and they thought I was lying they'd tell me to stick out my tongue. If I knew I was telling the truth, I'd open my mouth confidently and show off my bubble-free tongue. If I was lying, I'd try to scrape the bubbles off with my teeth.\n\nI now use it on my son. Still works.",
   "created_utc": 1692873247,
   "score": 192,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxje0x4",
   "message": "[removed]",
   "created_utc": 1692875455,
   "score": 37,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjck6l",
   "message": "That Santa Claus exists",
   "created_utc": 1692874519,
   "score": 50,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjdyls",
   "message": "[removed]",
   "created_utc": 1692875416,
   "score": 36,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxj9pdn",
   "message": "Driving with the interior lights on in the car is illegal and dangerous",
   "created_utc": 1692872537,
   "score": 108,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjc2us",
   "message": "\"I love you\"",
   "created_utc": 1692874199,
   "score": 74,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjbczi",
   "message": "[removed]",
   "created_utc": 1692873711,
   "score": 220,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjezg0",
   "message": "that they knew how the world worked",
   "created_utc": 1692876041,
   "score": 59,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjezr6",
   "message": "That they cared about me",
   "created_utc": 1692876046,
   "score": 119,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjabwp",
   "message": "They told me the burnt pizza was just brown cheese….",
   "created_utc": 1692872988,
   "score": 109,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjak9j",
   "message": "My dad told me that every pickle you eat adds 5 minutes on your life. I was like 5 and damn did I ever take that to heart.",
   "created_utc": 1692873154,
   "score": 133,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjd0mt",
   "message": "They told me god was real.\n\nStill do sometimes in their old age.",
   "created_utc": 1692874823,
   "score": 3,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjdx46",
   "message": "My dad tried to tell me that cars were run by hamsters on wheels under the gear shift, and they knew to run because the stick ended in a block of ice that would go on their backs. I was eight and asked him wtf he was talking about. He had been told this by his uncle and believed it, and was disappointed it didn't work on me.",
   "created_utc": 1692875389,
   "score": 3,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxje2er",
   "message": "A friend told me their parents would take them to “the toy museum” aka FAO Schwartz, and nothing is for sale there, they just display the toys.",
   "created_utc": 1692875482,
   "score": 3,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjf1yz",
   "message": "They lied to me about my dog going to school, but it turns out he's dead😔",
   "created_utc": 1692876082,
   "score": 107,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjg21y",
   "message": "Jesus will always watch over you. I guess he could be watching over me, he just doesn't do shit.",
   "created_utc": 1692876673,
   "score": 3,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjhbqq",
   "message": "Jesus is real",
   "created_utc": 1692877396,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjenus",
   "message": "Fat old geezer breaks into the house, eats the decent snacks, empties his sack in the living room, then fucks off to another kids house",
   "created_utc": 1692875846,
   "score": 46,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjgy3j",
   "message": "My mom tried to tell my daughter, at my dinner table infront of my husband and I, that I had wanted to get married in her backyard. This was an attempt to validate her taking over my wedding (and ruining it for me) and to 'back me into a corner and agree with her.' Hubs and I shut that down real fucking fast.",
   "created_utc": 1692877181,
   "score": 194,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjhxf2",
   "message": "That I was the most important in moms life. But if my stepfather would've apologized back in the day she would've run to him without any second thoughts(stepfather was abusive and what not). I found this out few weeks ago but it hurt. Mom died before stepfather apologized. F",
   "created_utc": 1692877731,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjinyd",
   "message": "One day before Christmas I found there Recipt for the Presents they bought me. When I told them they said they where \"Helping\" Santa Claus with some of the gifts. The day of Christmas all of the Gifts in the recipe where below the tree. That's how I knew Santa Claus wasn't real😀👍",
   "created_utc": 1692878130,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjjqu3",
   "message": "You can become anything you want when you grow up. We where poor. I'm still poor. Nothing has changed.",
   "created_utc": 1692878715,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjki0z",
   "message": "That I was planned.",
   "created_utc": 1692879112,
   "score": 2,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjkonz",
   "message": "Up until I was 8 years old, they told me that daddy was away at college. We would go see him on weekends. Found out later that he was in prison. I wondered why we could only talk to him behind glass on a telephone...",
   "created_utc": 1692879209,
   "score": 170,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjfh0l",
   "message": "I love you",
   "created_utc": 1692876326,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjdudl",
   "message": "My dad told me that every pickle you eat adds 5 minutes on your life. I was like 5 and damn did I ever take that to heart.",
   "created_utc": 1692875343,
   "score": 253,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjagmd",
   "message": "You will break the PC if you touch the mouse during boot.",
   "created_utc": 1692873083,
   "score": 68,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjdvrn",
   "message": "I was told that Star Wars was real. Didn’t take too long to figure that one out.",
   "created_utc": 1692875366,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjfdko",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjfhqg",
   "message": "Can't go to the water after eating a light lunch, you have to wait 2-3 hours.\n\nGod, so much time wasted.",
   "created_utc": 1692876338,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjfj7j",
   "message": "That Santa is real. I’m 53 and still traumatized.",
   "created_utc": 1692876363,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjg0sy",
   "message": "That I'm smart.",
   "created_utc": 1692876653,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjgo70",
   "message": "We still love each other but daddy is moving out for a few months..",
   "created_utc": 1692877026,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjgsav",
   "message": "That I ate a candy bar and hid the wrapper under a plate in the trash...just got gud and never got caught after that 😑",
   "created_utc": 1692877091,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjgv8m",
   "message": "We won't break up",
   "created_utc": 1692877137,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjhmz2",
   "message": "My mom told my dad who was asking for money for a haircut, that we don't have money just  after I gave her half my salary",
   "created_utc": 1692877569,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjhxnx",
   "message": "When my sibling and I were young, we were tossing toys around that the Easter Bunny had left for us. My mom started yelling at us, “I did not buy those for you to treat them like that.”",
   "created_utc": 1692877735,
   "score": 35,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjj31t",
   "message": "My dad smoked for like 2 decades. My mom never knew. He always lied and hid it. He's got lung cancer now \"out of no where\".",
   "created_utc": 1692878358,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjjb1t",
   "message": "Ask my mother. I've never verbally attacked someone like the way I attacked her over the phone that night. She deserved all of it. I haven't trusted her since. Her word is mud.",
   "created_utc": 1692878479,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjjcgw",
   "message": "I am in fact not a diamond that fell from the sky...",
   "created_utc": 1692878500,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjjkw3",
   "message": "I found a bunch of my clothes my mom didn’t like cut up in the trash outside the house and to this day she apparently didn’t do it.",
   "created_utc": 1692878626,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjjtil",
   "message": "dad will be home soon",
   "created_utc": 1692878754,
   "score": 15,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjk0g3",
   "message": "Nothing too outrageous, but my mom would tell me some things were a sin if she didn't want me to do them for some reason. Including going to the bathroom before eating in the morning.",
   "created_utc": 1692878855,
   "score": 22,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjkojd",
   "message": "That I had two strikes against me just because of two things beyond my control. I grew up differently and was told because of it my life would be forever hard. I work in a non-traditional industry (for who I am) and am generally the only one that looks like me in the room, and have been treated nothing but nice. Thank God.",
   "created_utc": 1692879207,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjkp7o",
   "message": "My whole childhood was a lie orchestrated by my mother. She didn't like the family or background that she came from so she tried to raise me under false pretense which really messed me up as a teen",
   "created_utc": 1692879217,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjktlu",
   "message": "If you pee in the pool water around you will turn blue and everyone will know what you did.",
   "created_utc": 1692879282,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjkx53",
   "message": "That they loved each other",
   "created_utc": 1692879331,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjkz81",
   "message": "my mom said that snails cant slide on wood",
   "created_utc": 1692879361,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjl3o0",
   "message": "You kid of love. Its not accident.",
   "created_utc": 1692879426,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjl9r1",
   "message": "That I will do great in life",
   "created_utc": 1692879515,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjlrq0",
   "message": "My mom trying to steal money from me telling she was charged twice while she wasnt when i asked her to buy me a videogame",
   "created_utc": 1692879771,
   "score": 1,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjmwu9",
   "message": "One night I went downstairs to ask my mother something. My dad was a light sleeper and would get really pissed if anyone woke him up, so I whispered, \"Mom! Mom!\"\n\nAll of a sudden my dad sat up and yelled at me to get lost. They told me I should never sneak up on them because they had a gun and my dad thought I was an intruder and almost shot me.\n\nThey scared the beejeezus out of me. Sometimes when I tried to get to sleep I'd remember how my dad almost shot me. For years. Even after I moved out.\n\nDecades later, I mentioned it to my mom. She started laughing and told me they were having sex. There was no gun.",
   "created_utc": 1692880346,
   "score": 201,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjn6zt",
   "message": "Hiding an older half-brother from my sister and I.",
   "created_utc": 1692880486,
   "score": 22,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjpuw3",
   "message": "That they couldn’t afford to pay for college. So I took a job during the day and paid my way through night and weekend school.\n\nTurns out I had a decent trust fund from my grandfather. I could have graduated and started working for a higher wage 4 years earlier. I tell myself that graduating in 2008 wouldn’t have been a good idea anyway.",
   "created_utc": 1692881764,
   "score": 72,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjo4fs",
   "message": "That the 2K I earned at my summer job would be safe in my mom's savings account until I wanted to withdraw it later.  Never saw that money again.",
   "created_utc": 1692880936,
   "score": 83,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjtyvg",
   "message": "Found out when I was 25 I have a sister one yr older than me that they gave up for adoption, I'm 37 and been searching for her for the past 10 yrs.",
   "created_utc": 1692883621,
   "score": 115,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjqy0z",
   "message": "....This is going to hurt me more than it will hurt you....yeah, right.",
   "created_utc": 1692882265,
   "score": 95,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjr04w",
   "message": "After my mom died, my dad fell into drugs hard, mostly crack. My brother is autistic and he would get both Disability and SSA by check (this was before the Direct Express cards). Several times a year he would go to cash the checks, stay gone all day and then come home and claim his wallet was \"stolen\". Then the next day his wallet would *miraculously\" reappear with everything in it except the money. I'm not even sure how in the world he managed to pay our rent or if he wasn't, why our landlord never kicked us out. We certainly didn't have electricity on (legally) most of the time, nor a phone or internet and what little food we had was through food stamps and me babysitting for my neighbor. I suppose you could claim he was using the money to pay the rent but the rent was only $350 (our landlord was a slumlord) and my brother got about $900 each month. I eventually got to the point where I didn't believe the \"stolen wallet\" story.",
   "created_utc": 1692882293,
   "score": 27,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjsiu6",
   "message": "That kids in africa are dying if i don’t eat my whole plate",
   "created_utc": 1692882983,
   "score": 132,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjq63s",
   "message": "My Mother lied to me about wanting to divorce my Father. Long story short, he molested me as a child and I didn’t come out about it until I was an adult. After a very long and drawn out legal process he finally went to jail in March of this year.\n\nMy mother said “When it comes down to it I will always choose you. I told him I wanted a divorce.” just for me to find out she calls him on an almost daily basis while he is incarcerated. I firmly believe she lied to me to make me feel better and has no intention of leaving him.",
   "created_utc": 1692881908,
   "score": 104,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjoeh4",
   "message": "That my parents split up cos they was young.  At 13 I found out that my dad had \"cheated\" on my mum and she couldn't forgive him. I then found out that this \"cheating\" had resulted in a 12 year old boy (yes they split when I was 5 weeks old) who both my parents knew about but I didn't. \n\nAt 21 I found out my father was raped. Men being raped by women, especially in the military, didn't really happen 30 years ago. No one thought anything of the barmaid serving my dad free drinks all night and insisting on taking him to his room. \n\nMy dad woke up the next morning to 4 things\n\nA note from the woman telling him she had a good time\n\nMy mums engagement ring from when she'd caught him\n\nA hell of a custody battle on his hands which he lost\n\nA lifelong alcohol addiction. \n\nJust a side note - when my dad eventually told my mum as adults that he didn't consent to the \"cheating\" and he sought help she was really understanding and they are now good friends and coparents",
   "created_utc": 1692881072,
   "score": 213,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjo532",
   "message": "This lie was told by all parents in this town.  Mainly they told their children that if you got a venereal disease then your life is ruined.  The goal was to scare the kids into not having sex.  But it had tragic consequences.  \n\nIn my home town, a 17 year old kid put a shotgun under his chin. It blew off his jaw and everything below his eyes. He survived and about 10 years ago I was in town and saw a very thin guy with no jaw and a cloth covering his face. I think it was him at about 45 years old.\r  \n\r  \nThe reason he did it was not reported at the time. But many years later my mom told me that he tried to kill himself because he had a wet dream and thought the emission was a sign of venereal disease. His parents, like all parents around here, had always told him that if he got VD then his life was ruined. There was no internet to answer our questions back then so without being able to get any other information about what happened, he decided to kill himself. The parents of that town knew what happened but they decided not tell any of their kids the truth because it was better to risk more suicides than to provide any sex education.",
   "created_utc": 1692880946,
   "score": 108,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjrp7c",
   "message": "They had no idea what that weird smell was in the basement when I was a kid. From around 8 years old to about 16, my mom would go down to do laundry and my Stepdad would go down to talk to her. I thought for the longest time it was just their little adult gathering place. They would even had their friends go down there as well. When they went down, a few minutes later, I would smell this odd smell.\n\nAs I got older, and got in high school, I had a more \"rebel\" sister. I finally found out what the smell was through her.\n\nIt was marijuana...lol. Oddly enough, going through D.A.R.E and all that, I always thought it would basically rot your brain and turn you into  some type of zombie. That was a lie.",
   "created_utc": 1692882611,
   "score": 113,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxk53f7",
   "message": "one year I made an agreement with my mom for my holiday present. I would pitch in $100 and she'd pitch in $100 and she'd get me a nice $200 laptop. Which was decent enough for a teen at the time.\n\nInstead, she took my $100, and bought my brother and I each a shitty $50 notebook style laptop with no battery, no wifi, and a barely functional mouse ball. I was disappointed when I saw what she got and immediately suspicious. This was NOT a $200 piece of tech. I found the receipt from her order and had the receipt from the withdrawal and demanded to at least get my money back if she was going to reneg on our deal. She denied ever making such a deal, ever taking money from my account, and said I should be thankful I got anything at all.\n\nFor reference my family was by no means poor. My mom had a second antique car she drove in the summer. Dad had a boat, motorcycle, and ATV all high end bought new. And they took 2 vacations a year without us kids minimum. While I struggled to have lunch money on a consistent basis. This was the moment that solidified my  belief that my parents didn't give a single fuck and I needed to *never* rely on them again.",
   "created_utc": 1692888154,
   "score": 164,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjv3li",
   "message": "That because of my 3.2 high school GPA I may have to \"go back\" to the German equivalent of high school — even though I had graduated and was in my first semester of college — if I moved there when my family did.\n\nMy Dad's company was transferring him to Germany in 1990. I had graduated high school in 1989 and was in my first year of community college (at the time).\n\nTruth is they just didn't want me to come along because I was 19 and to them I should be on my own already. So they made it sound like I would have a very hard time getting into college in Germany because of their very high educational standards.\n\nI knew my situation was weird because I was an adult and Germany's education (especially higher) system works differently, but I know plenty of young adult peers who followed their parents over when they got transferred (I came from a town where the company employed just about everybody, so a lot of families continued to be friends overseas). I bumped into two people I went to school with when I would visit them, and their GPAs in high school had been lower than mine.\n\nThe result is that my kid brother got the best education someone might get, while I ended up trying to make ends meet and lived in a drug den for 6 months after my attempt at the military failed. That's not jealousy or envy, I say these things to show what the results of believing or making up BS stories instead of just being honest can do. I actually don't regret the path I've taken, but I do wonder how my life would be different if I had been able to live over there with them for a while, and it does make me angry to think my parents would make up something like that just out of some notion that a 19 year old adult son barely out of high school would be \"dead weight\" for them.",
   "created_utc": 1692884114,
   "score": 64,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjot0r",
   "message": "\"We are going to denmark for only a month\" we are still here after 4 years",
   "created_utc": 1692881265,
   "score": 199,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjtvlc",
   "message": "*\"if you go to a private college, we'll pay all your tuition.\"*\n\ngot accepted to an amazing private college, handed them the bill and...\n\n*\"no, not like that!\"*\n\nneedless to say, I did NOT go to that amazing private school. 23 years later and I'm still bitter about it.",
   "created_utc": 1692883580,
   "score": 197,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjp6ia",
   "message": "That’s normal sibling rivalry.\n\nNo it wasn’t normal.  You guys just didn’t want to deal with shit and the shit you caused by setting up a situation where you pitted my older sibling against me and then punished me when I fought back.",
   "created_utc": 1692881446,
   "score": 148,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjuj3x",
   "message": "My Dad used to tell me that he learned all of his cool tricks and skills in \"Daddy School.\" I'm now 28, married and still have not been enrolled.",
   "created_utc": 1692883866,
   "score": 46,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjrxqx",
   "message": "That we (4 kids) would inherit about $9k each when our grandmother passed. There was some loophole my dad exploited (he said with his mother’s blessing) where he got all of the money (almost $40k, on top of whatever she gave him otherwise) and that giving it to us was a lie just so he didn’t have to pay taxes on it. At that point, why even tell us? I don’t think he really was meant to take that money.\n\nI’d still be salty about it BUT he did pay for the first couple years of college for all of us (and my one brother’s entire Bachelor’s degree from Rutgers), so I guess it doesn’t matter in the long run. Still, shitty lies were told.",
   "created_utc": 1692882718,
   "score": 85,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjqo39",
   "message": "My mom told me that it would take a million days to drive from Minnesota to New Hampshire.",
   "created_utc": 1692882140,
   "score": 42,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjtng1",
   "message": "I would hide in the pants 👖 displays at Walmart as a child.  My mom told me “you know how they make shorts 🩳 don’t you?  A man comes by with a chainsaw and cuts the pants into shorts.  \u0026amp; if your inside the rack.  He will cut you in half.",
   "created_utc": 1692883481,
   "score": 41,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjorqx",
   "message": "The whole story about Sinterklaas (the Dutch equivalent of Santa)\nWhen I was 8yo I was devastated when they confirmed my suspicions he doesn't really exist. Not so much because of the fact he isn't real (I had figured that out on my own) but because they had lied to me!\n\nFor years I couldn't believe how parents can justify it to themselves to blatantly lie to their own children and promised myself I would never do that!\nBut then my daughter was born and I happily told her the same 'lies'.\nOh the hypocrisy 😆",
   "created_utc": 1692881248,
   "score": 75,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxk6ei9",
   "message": "The worst lie? I was diagnosed with a chronic cancer at 16, and my mum got drunk and told all of my friends that my doctor had told her that I only had a year to live. \n\nFound out through my friends when they started giving me excessive condolences. \n\nEmailed my doctor, he never said that. Still don’t know why mum did that, my main theory was that she was scared.",
   "created_utc": 1692888654,
   "score": 75,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxkwjf6",
   "message": "Oh man. That's a hard one to thin down to just one answer.\n\nI'd have to say mine is this: my mom says I \"started a fight\" so that I could move out of her house. In reality, she tried to tell me that I couldn't go camping with my then 3 year old child (I was 18-19) and that she would call child protective services on me if I did. We got into a big fight, she told me to get the f- out of her house, so I grabbed my kid, some toys for her, some of her clothes, and my laptop -- and I left. If you ask my kid, who is now 14, what her earliest memory is, she will respond by telling you something along the lines of \"my grandma holding my mom against the door by her throat\".\n\nIt was great 🙄",
   "created_utc": 1692898378,
   "score": 72,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjxnku",
   "message": "When I turned 5 my mom told me that my dad sent me money to buy a bike from prison for my bday present.  He didn't, she just didn't want me to forget him so she gave him credit for it.",
   "created_utc": 1692885191,
   "score": 32,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxk7z8t",
   "message": "We moved when I was 4, and we didn’t bring my parent’s 5-year-old cat with us. When I asked, they said they put her in a shelter and she’d be fine, some little old lady would probably adopt and coddle her.\n\nThey euthanized her. She was perfectly healthy, and they didn’t even give her up to the shelter. They just straight-up had her killed because she sometimes had hairballs.",
   "created_utc": 1692889251,
   "score": 31,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxju2h5",
   "message": "Forced me to go to college when I didn’t want to.( did horribly btw) and told me that they had no money for a deposit to secure my place in housing. … and then went out and bought $500 worth of decorations for the house. \n\nThereeeee was much underage drinking that night.\nI drank so much wine from being so angry.",
   "created_utc": 1692883664,
   "score": 51,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjt5pa",
   "message": "[deleted]",
   "created_utc": 1692883267,
   "score": 28,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxkc4g0",
   "message": "My family had a specific bad habit that caused me lots of issues as I grew and after I became an adult.\n\nMy family is fairly tight knit, there are tonnes of us also. To give an idea, every generation prior to my grandparents had kids numbering in the double digits, and most of them went on to have kids themselves. Of my grandparents one grandmother was 1 of 7, the other three grandparents were one of 3 or 2. So as you can imagine there are SO MANY COUSINS! \n\nAnd many continue to live in the same part of the country, hell many the same town.\n\nNow whenever ANYTHING happened, everyone would be on the phone updating the various relatives. It meant I as an only child pretty much had my entire life narrated around the family tree from birth. School picture day? Mum and dad would buy the biggest photo packet the school did, probably like 30+ copies of the same picture in different sizes, cause all the cousins had to see how big I had got! \n\nThis has an unintended result of to me, random adults approaching me in the street and grabbing me/hugging me or just otherwise touching me. I ended up developing a dislike of being touched at all, but especially by people outside of my immediate 7-9 members of my family, namely parents, grandparents and my uncle/his kids. I’d freak out, run away, fight, cry anything when these situations kept happening. Eventually my mum was able to spread around the family my dislike, and most of those ‘random’ adults at least began speaking to me, introducing themselves and explaining who they are before trying to initiate contact, but some of them never did and even seemed to make it a game to be able to grab at me before I could spot them and run. It wasn’t fun, like at all. It didn’t fully stop until my mid teens, when I quite literally would scream at the top of my lungs in public, usually alone the lines of ‘Who the hell are you!?!’ And actually began kicking people to hurt them. I gained a rep as the ‘unfriendly’ kid in some family circles, but luckily the majority had respected my dislike once they knew about it, and knew I was a friendly kid if you just talked to me first. \n\nA related issue with this chain network of updates on everything a family member did, was how my parents and grandparents worked together to catch me in little lies or misbehaviours as a young kid. Let’s say I was naughty at home, I’d go to visit my grandparents a few days later, and it would be ‘A little birdie told me you were very naughty, I don’t think naughty girls should get treats from Nan/grandpa.’ Like this would happen after I’d already had whatever punishment my parents gave, and all would be forgiven at home. I genuinely wasn’t a naughty kid overall, I disliked my parents being mad/disappointed in me so I followed rules and behaved well excluding typical tantrum stuff from those ages. But that feeling of any mistake I made never being forgotten/forgiven? That any singular punishment wouldn’t be the end of it even when the adults dealing with the issue we’re happy again? \n\nThat has stuck with me over the years. I still really struggle with failure, I’m often terrified of getting anything wrong, because everyone will know and will never forget. Even small mistakes, I convince myself that as more people find out, the judgement and reproach won’t end, that it’ll keep getting bigger and eventually no one will want anything to do with me. I’ve developed a number of problems with accepting mistakes, and not trying to hide them or pretend they never happened without dealing with the consequences or fallout. I’ve even nearly ended up in debt because I was too terrified to tell my family during a period I was struggling to support myself. My family is full of lovely people, and my immediate relatives would give me the world, I know this, but the fear of the never ending disappointment paralyses me. \n\nIm getting better, but it’s a hard road to unlearn things I’ve believed for more than 2 decades.",
   "created_utc": 1692890808,
   "score": 50,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjpjr7",
   "message": "\"We have McDonalds at home\"",
   "created_utc": 1692881619,
   "score": 46,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjsgq1",
   "message": "More of an omission: I was shooting the shit with my grandmother, I can’t remember what she was talking about but she related it to my mother’s fight with breast cancer the year prior……..what fight with breast cancer?!?! I just nodded like I was in the loop. I guess it makes sense why I’m so reluctant to open up to people, look who built me lol",
   "created_utc": 1692882957,
   "score": 75,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjukhw",
   "message": "When i was 4 We had a dog called Tilly, my mom said that she gave her away to a boy who couldn't speak and she died while saving him from drowning in a river\n\nYears later when i was around 13, my mom was on the phone to her friends and they were talking about their pets that passed away, turns out that tilly died because my mom was drunk and let her out the house, she ended up getting hit by a car",
   "created_utc": 1692883883,
   "score": 21,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjw0iv",
   "message": "My dad went into the ER with stroke-like symptoms. He ended up having a severe brain bleed that required immediate and major surgery. While he was laying in the ICU, my mother, who opened their computer to get insurance info, found messages on his linked in page, that he’d left open earlier that morning before I took him to the ER, from a woman he was engaged to in college. They had been having an affair for over a year.",
   "created_utc": 1692884506,
   "score": 18,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjryft",
   "message": "“None of this will matter in 10 years.” 20 years later, it still fuckin matters.",
   "created_utc": 1692882727,
   "score": 18,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjuiqu",
   "message": "My mother inadvertently confessed to me that she read my sister’s diaries to catch her in a lie, but that she could never let my sister know she did it because it would destroy their trust.  \n\nYears later I asked her if she’d ever read any of her kids diaries, after I realized she knew something about me she couldn’t have known otherwise. She gave me a puzzled look and said she’d never snoop through her kid’s stuff because it would break their relationship if she got caught. I reminded her of how she did it to my sister. She looked very nervous and said “I didn’t think you’d remember that..” and quickly changed the subject.  \n\nSo, not confirmed but I’m mostly certain my mom has read through my journals as a kid and went through my room when I wasn’t home .  \n\nNot the worst lie, but yeah.",
   "created_utc": 1692883862,
   "score": 15,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxkzdo5",
   "message": "When I was young me and my siblings had to go to this babysitter after school, and she would basically ignore us while her children harassed us and tried to destroy any belongings we happened to have to bring with us, either by setting them on fire or cutting them up with scissors. My little kid brain thought that we had to go to this babysitter because my father worked afternoon shifts, so I would often try to run home as fast as I could from the bus stop in order to catch him before he left so I could ask permission to go to a friends house instead.\n\nTurns out, he wasn't working afternoon shifts. He wasn't employed at all. He just moved his car around the corner and turned all the lights off and locked the doors. He was depressed and not working, and our mom was pulling 12 hours shifts trying to make ends meet. He couldn't even be bothered to drive us to a babysitter, so we had to stick with the garbage one that happened to be within walking distance.",
   "created_utc": 1692899414,
   "score": 10,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxl03yp",
   "message": "that the dog I had since I was born ran away. I was like 5? might’ve been older I don’t really remember. my dad for a week told me he’ll come back and that it’ll be okay. I cried for weeks. \nthem bitches told me at 18 years old that returned him to the shelter (it was a good shelter tho) because he was crazy. I love them, but god I do not forgive them. I’m about to turn 20 and I still bring it up at least once a week so they’ll know i haven’t forgotten nor forgiven them.",
   "created_utc": 1692899677,
   "score": 11,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxk7xzw",
   "message": "I can think of three things off the top of my head. \n\n1. The time my mom swore up and down it was her golden drop necklace because \"her parents gave it to her as a birthday gift\" and i asked my grandma and she said no, she didn't. That added to the fact that the rest of my missing jewelry was sitting in different boxes in a drawer in mom's bedroom leads me to think that yes, she was lying and it was in fact the becklace my dead grandma had been so proud of giving me and I'd been absolutely devestated to loose ten years earlier.\n\n2. The time she told me she'd help me get my cat to the vet, but then called to tell me she couldn't change a shift and unfortunately couldn't come. I would absolutely have believed her if it wasn't for the fact that my younger brother had called literally two hours before this to gloat about the fact that he'd talked my mom out of giving me a ride because it was only \"2 km\" and \"the cat doesn't need it, it's an uneccesary visit\". She called the day before so I couldn't get another ride in time, which meant i had to walk those 2 km with the cat carrier. For anyone who is curious, this was three weeks ago and my cat is still recovering.\n\n3. That time she told me my little brother was coming to live with us again. Actually, this is more an omission than a lie, I guess, because he was coming to live with us. She just neglected to tell me it was because she'd ordered my stepfather to kidnap him first.",
   "created_utc": 1692889238,
   "score": 32,
   "submission_id": "15zxxo9"
  },
  {
   "comment_id": "jxjueb0",
   "message": "Every time a tooth fell out, a fairy would buy it for 50p, providing I left it under my pillow. I always wondered what these fairies did with all these teeth. My dad said they eat them because they need lots of calcium to make their wings work.",
   "created_utc": 1692883808,
   "score": 10,
   "submission_id": "15zxxo9"
  }
 ]
}