{
 "submission_id": "15zye5d",
 "title": "What killed your feelings for someone you were once madly in love with ?",
 "selftext": "",
 "created_utc": 1692873847,
 "permalink": "/r/AskReddit/comments/15zye5d/what_killed_your_feelings_for_someone_you_were/",
 "score": 188,
 "url": "https://www.reddit.com/r/AskReddit/comments/15zye5d/what_killed_your_feelings_for_someone_you_were/",
 "comments": [
  {
   "comment_id": "jxjk34v",
   "message": "He just didnt seem to actually give a shit about me. Unless I was doing something for him or making his life easier.",
   "created_utc": 1692878894,
   "score": 224,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjizbx",
   "message": "I killed someone’s love for me when I got too comfortable yelling at them. \n\nBeing sweet and kind 99% of the time doesn’t outshine being mean and awful the other 1%.",
   "created_utc": 1692878303,
   "score": 199,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjbpyi",
   "message": "[deleted]",
   "created_utc": 1692873955,
   "score": 208,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjisuc",
   "message": "When he left me for someone half my age. Btw I was 29",
   "created_utc": 1692878205,
   "score": 114,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjlnfb",
   "message": "He stopped meeting my needs. I noticed he would bend over backwards for anyone else but neglected me all the time.  Any small thing i asked was just too much. If he did ask me if i wanted anything from the store etc, he would come back with everything everyone else asked for and he would forget mine.  He peed on the toilet seat so many times and refused to be considerate and wipe after use.  The final straw was when I lost my brother recently. He just left me to grieve and didn't really give me any emotional support, no hugs, no asking if I'm alright. He became irritable and moody and now I've just lost whatever was left.",
   "created_utc": 1692879709,
   "score": 105,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjbq8y",
   "message": "She cheated on me.",
   "created_utc": 1692873960,
   "score": 183,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjm955",
   "message": "Fucking constant daily criticism of everything I do, every little thing!!’",
   "created_utc": 1692880013,
   "score": 88,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjkfvf",
   "message": "\"I'm just...better than you.\"  \n\n\nSaid to me the night after I finished my first degree in music.  Apparently, I wasn't a \"hard science\" major, so all her friends convinced her that I wasn't as good as them...or her.  \n\n\nAh well.  Could have been worse.",
   "created_utc": 1692879081,
   "score": 67,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjfkjf",
   "message": "In secondary school had a crush on a close friend, we were close as friends but nothing more. I eventually (after probably 4 years of showing hints, getting her gifts and asking her out to meals and dates) told her exactly how I feel, and asked her if how she feels...\n\nShe knew, she wanted me to keep trying but she didn't want to be with me, she enjoyed having someone follow her around and dote on her. She then proceeded to have a relationship with every bloke in a friendship group.\n\nNGL I was broken for a good while, but several relationships later, I haven't spoken to her in several years, but keep up with our old friend groups - she is desperately lonely after doing this with several other guys and now no one wants anything to do with her.....\n\nBut yeah being told she knew and that nothing was going to change killed all sorts of feelings in me for a long time",
   "created_utc": 1692876384,
   "score": 105,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjmwaq",
   "message": "Borderline Personality Disorder. I almost lost my sanity while doing so.  2 years later and I’m still trying to find my balance again.",
   "created_utc": 1692880339,
   "score": 22,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjmm8e",
   "message": "She hit me in the head with a glass bottle",
   "created_utc": 1692880198,
   "score": 20,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjhrdu",
   "message": "The lying, cheating and stealing.\n\nPlus all the accusations against me cheating and lying. And false allegations when I didn't react to the drama. Physically and emotionally abusive but I'm the male so no one cares.\n\nLol that kind of does it. It's sad tbh.",
   "created_utc": 1692877638,
   "score": 36,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjlg2o",
   "message": "Realized he was a man-child, that treated me like a toy.",
   "created_utc": 1692879606,
   "score": 58,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjllzl",
   "message": "She, her sister, and father conspired and killed the fathers mother. The family collected millions in inheritance and all three walk the streets today.",
   "created_utc": 1692879689,
   "score": 46,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjnd6a",
   "message": "Treated my like shit while I was going through cancer treatment",
   "created_utc": 1692880569,
   "score": 15,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjxk6o",
   "message": "Awareness of my own false overhyped perception of her and realised that I have been overlooking her flaws because I was desperate to be with someone",
   "created_utc": 1692885151,
   "score": 30,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjrdjk",
   "message": "He cheated on me and told me it's not his problem so I should solve it alone and come back to him once I let go of things.\nLeft him the next day.",
   "created_utc": 1692882463,
   "score": 22,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjjy1s",
   "message": "She was a cheating lying vile evil manipulating insidious thieving narcissistic b***h.",
   "created_utc": 1692878820,
   "score": 82,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjf38u",
   "message": "Disrespect'll do it.",
   "created_utc": 1692876102,
   "score": 12,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjo1i5",
   "message": "Bi polar schizophrenia and refusing to seek treatment. The delusions, accusations, violence took its toll.",
   "created_utc": 1692880898,
   "score": 10,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjtxqz",
   "message": "When he told me exactly which dumpster he was going to put my dead body in",
   "created_utc": 1692883607,
   "score": 11,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjtyr7",
   "message": "Loss of trust does it every time.  There can be no love without trust.",
   "created_utc": 1692883620,
   "score": 9,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjotad",
   "message": "not caring after i had two miscarriages and continuing to party and act like everything was normal and ok",
   "created_utc": 1692881269,
   "score": 10,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk62d5",
   "message": "Many things, but one of the first was discovering how bad their porn addiction was. \n\nThe other main thing before the emotional abuse and eventual cheating was they didn't defend me in arguments or even attacks from other people. Usually they sided with the other person, or told me not to be dramatic or angry....despite being the type of man to rage over a Reddit comment.",
   "created_utc": 1692888526,
   "score": 9,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjbrey",
   "message": "the way they talk to their mom",
   "created_utc": 1692873983,
   "score": 19,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjc385",
   "message": "Mostly smellz",
   "created_utc": 1692874206,
   "score": 21,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjnit8",
   "message": "i found out he was into kids",
   "created_utc": 1692880645,
   "score": 20,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjykkg",
   "message": "Realizing he was a selfish asshole who only cared about himself. I only existed for him when it was convenient.",
   "created_utc": 1692885566,
   "score": 9,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk3pez",
   "message": "Mostly it was the banging her coworkers. It’s like..my one rule.",
   "created_utc": 1692887617,
   "score": 8,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjfg7i",
   "message": "She was great to me basically perfect in my eyes. Dating about 8 months and we are going to a concert with friends.\n\nIts the 2 of us, another couple, a guy and girl friend of hers.\n\nWe are all staying at her place and the single girl friend told me the single guy friend was into her but she’s not into him and she’s feeling weird. So I say no problem I’ll go talk to him. GF says no she will handle it.\n\nI hear her by the door tell her friend “Johnny took the day off of work to meet you and go to the concert, least you can do is give him a blowski”\n\nNow I’ve never heard her or anyone else ever use the term blowski before or after that but I was done. I drove the girl home and hat was the end of it.",
   "created_utc": 1692876313,
   "score": 28,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjksd7",
   "message": "Emotional infidelity (hers), along with BPD (hers).",
   "created_utc": 1692879263,
   "score": 6,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjcb5e",
   "message": "Subtle racist remarks that snowballed into blatant racism. Hopefully they have changed for the better.",
   "created_utc": 1692874350,
   "score": 32,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjbtuz",
   "message": "Her personality lmao",
   "created_utc": 1692874030,
   "score": 22,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjf3x4",
   "message": "I just wait them out and those feelings always go away eventually. Usually I just have to shut up and try not to think about it and in one or two months, its gone.",
   "created_utc": 1692876114,
   "score": 7,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjk3hr",
   "message": "Whisky. He turned into hedonistic sloppy drunk.",
   "created_utc": 1692878899,
   "score": 5,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxju0lt",
   "message": "The put downs , the insults disgisied as jokes, constant derision, threats of cheating, laziness, greed, not caring about what they look like( wanting you to be in tip top shape all the time, while they gain and get heavier and heavier). They look down on you, treat like a child or worse. Treated like a servant....or a slave. I could just carry on, but I could just give a few examples of my own experience. But you've read my rant long enough to get what I am saying.",
   "created_utc": 1692883642,
   "score": 7,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk7zec",
   "message": "she said she used to make out with guys in nightclubs when she was with her ex but only cause her ex was toxic. i did what my dad did after that and disappeared from her life.",
   "created_utc": 1692889252,
   "score": 7,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjk2ez",
   "message": "She said no and then came back a few days latter saying actually yes, why not. Yeah no, you had one chance baby and you blew it.",
   "created_utc": 1692878883,
   "score": 56,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjf792",
   "message": "Happened a few times (although i was not 'madly in love'. I loved them/pictured a happy ever after together, but I do not 'fall in love').\n\nThe kicker was, I'd say, when he told me he was in love with his sister and expected me to pretend to be her. As in: dressing more like her, using the same perfume, and letting him call me by her name in bed.\n\nThat, and I have been left for someone else repeatedly. The second he utters those words, all feelings for him are gone then and there. Not the feelings for inadequacy and self doubt, mind you. But the love? Certainly!",
   "created_utc": 1692876167,
   "score": 31,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjldkm",
   "message": "She had the dumbest/worst giant tattoo I've ever seen that her brother gave her.\n\nAnd she seemed a little \"too close\" with her brother.\n\nEdit: I was married to her for 10 years.",
   "created_utc": 1692879571,
   "score": 5,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjq29t",
   "message": "He kicked me and our daughter out of the house",
   "created_utc": 1692881858,
   "score": 7,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjta0z",
   "message": "Time. Only time.\n\nThere has never been a single event that cause my feelings to suddenly stop. I never gained that superpower.",
   "created_utc": 1692883319,
   "score": 6,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk5ywo",
   "message": "I can only describe it as intense emotional manipulation. I have never met someone who lied so easily and about such serious things. He ran the gauntlet of terrible things: cheating, verbal abuse, domestic assault, and substance abuse. \nYou go dead after a while",
   "created_utc": 1692888489,
   "score": 6,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkce4p",
   "message": "His lying. Even the little stupid stuff like his social media.",
   "created_utc": 1692890908,
   "score": 6,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjnzol",
   "message": "Being obligated to attend too many major holidays and events with her late husband’s family and resenting me when I didn’t want to go.",
   "created_utc": 1692880874,
   "score": 10,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjm4ir",
   "message": "She was a ho",
   "created_utc": 1692879950,
   "score": 10,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjbo22",
   "message": "Cheated on me",
   "created_utc": 1692873921,
   "score": 5,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjlm3t",
   "message": "When I saw how he treated our kids",
   "created_utc": 1692879691,
   "score": 5,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjpfhi",
   "message": "he cheated on me with my best friend the second month we we're together",
   "created_utc": 1692881563,
   "score": 6,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjtjf7",
   "message": "When I figured out she wasnt just playing dumb",
   "created_utc": 1692883432,
   "score": 6,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjx3zf",
   "message": "The relationship was still in the very early phases but she turned out to have some past trauma and constantly kept saying but what if you do this to me and what if you do that to me and no matter how much I assured her she wouldn't stop",
   "created_utc": 1692884966,
   "score": 5,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjywoh",
   "message": "Had a girl admit she got a dude drunk so he would “loosen up” and sleep with her. I started imagining how quickly I’d be thrown in prison if I said the same thing out loud. There wasn’t a second date after that.",
   "created_utc": 1692885704,
   "score": 6,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxka3dw",
   "message": "Called me a filthy Jew",
   "created_utc": 1692890057,
   "score": 4,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkrwwi",
   "message": "Beautiful woman, smart, funny, kind, witty, young and vibrant.... but she said it with a hard \"R\"... we were both white.",
   "created_utc": 1692896671,
   "score": 6,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkkdl9",
   "message": "He jumped onto the counter at the gas station and tried to deadeye stare the clerk down because she asked for his id. \n\nCompletely sober. \n\nI pulled his ass off the counter and he slapped me in the face. I walked outside because I knew I was so mad I'd do something I'd regret. When he came out he said \"that lady is a demon. I know them when I see them. I was trying to pull it out of her until you pulled me away. You're lucky I didn't put the stare on you or you'd be dead. Take me to another station so you can buy me cigarettes before I slap you again.\"\n\nDone. \nI beat his scrawny dweeb ass in the parking lot and left before the cops got there.\nHe went to jail that night. \nI still don't regret it.",
   "created_utc": 1692893849,
   "score": 8,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjwj0u",
   "message": "I realized he put zero effort into our relationship. Never planned dates, made reservations. Only wanted to smoke weed and hang out.",
   "created_utc": 1692884720,
   "score": 4,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjxhs9",
   "message": "Chronic alcoholism.",
   "created_utc": 1692885124,
   "score": 5,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjyhoe",
   "message": "I realized over time that she was stupid. Kind person for sure but just not bright and not intellectually challenging or interesting.",
   "created_utc": 1692885534,
   "score": 4,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk08uk",
   "message": "When I realized I was only a trophy for him. Everything was about him, I was only there to make him feel and look good.",
   "created_utc": 1692886253,
   "score": 4,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkajg4",
   "message": "Time\n\nShe didn’t have the same feelings for me as I did for her, it took me a while to accept it.  I just wanted to make her happy. . . we both eventually just went our separate ways.  We still live I. The same town together and cross paths every now and then, but we now have totally different lives than when we were together.",
   "created_utc": 1692890223,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxko82x",
   "message": "His mother was involved in every decision he made. She also didn’t like me.\n\nWhen she demanded he move back home after university he just went with it. That’ll put a dampener on any relationship.",
   "created_utc": 1692895290,
   "score": 4,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjfd1p",
   "message": "Ugly feet",
   "created_utc": 1692876262,
   "score": 10,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjjlsg",
   "message": "used me for my body, said the hard r and tried to excuse it by saying he grew up with puerto ricans, skinny shamed me, and flirted with my best friend (who was much skinnier than me) and my online friend since 2020. he also cheated with my best friend when i got back with him out of pity and told me we werent really together when i finally ended it off for good.",
   "created_utc": 1692878641,
   "score": 6,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk7eiz",
   "message": "I was an ROTC cadet in college and she said she didn't want to be a military wife.\n\nI ended up traveling the world as a young bachelor officer.  It worked out quite well for me.",
   "created_utc": 1692889032,
   "score": 6,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjknfr",
   "message": "Dated for 9 months, 8 and a half months into the relationship I had to move away and we promised to stay in contact (had phone numbers and a few game accounts)... She never messaged. I ended it whilst using her twin sister to tell her (i am still friends with said sister) found out 4 or 5 months with a deep conversation with my bsf that she cheated twice",
   "created_utc": 1692879191,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjmcrv",
   "message": "After a month of chatting she turned out incapable of speaking better than a chatbot. Come on, I can download Eva AI, it's cheaper than actually having a girlfriend.",
   "created_utc": 1692880064,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjroef",
   "message": "She constantly accused me of cheating on her.\nFor over 3 years, I would get home and it would just be a shit show. I really hope she gets the help she needs for her mental. Great girl, just wasn't ready for a relationship",
   "created_utc": 1692882601,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjrv5t",
   "message": "Out of the blue said : \"If you cheat on me, do so with a prostitute, ok? Because they won't try to steal you\". In a casual tone.",
   "created_utc": 1692882686,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjt2ik",
   "message": "She became a complete and utter fruitcake.",
   "created_utc": 1692883228,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjt7pv",
   "message": "Aren't you a little old for me? (Age diff: 1 year 9 months)",
   "created_utc": 1692883291,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxju7lc",
   "message": "Realizing I wasn’t madly in love with that person, but wildly infatuated with obligation I felt towards that person. Once I realized that, and figured out why I felt that way, I let go and I met someone I truly fell head over heels for. Live hits different when it’s for the right reason.",
   "created_utc": 1692883726,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjumq6",
   "message": "She figured out I liked her. Told everyone she knew and they all made fun of me.",
   "created_utc": 1692883910,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjvjif",
   "message": "He \"slept\" with a minor (15) at 25.",
   "created_utc": 1692884307,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjvt24",
   "message": "When she dumped me on New Year's Eve.\n\nAll feelings dissipated when I realised she was abusing me for about half the relationship",
   "created_utc": 1692884419,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjwna4",
   "message": "It wasn’t one thing. She changed, bit by bit, from someone I adored into someone I abhor. In addition she began, bit by bit, to put it euphemistically, be unkind to me. She is now more or less the opposite of the woman I married.",
   "created_utc": 1692884770,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjyj9t",
   "message": "She is a liar, cheater, selfish, manipulative, and controlling wreck of a person. She only did what made her happy. She alone was the problem but would never do anything to change. So i left.",
   "created_utc": 1692885552,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjyn02",
   "message": "She went to college, and I wrote her letters for a year and she never wrote back or called.",
   "created_utc": 1692885594,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjyz0k",
   "message": "She apparently didn't have feelings for me on my birthday",
   "created_utc": 1692885731,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjzjpm",
   "message": "He kinda just became a bit of a dick? Infatuated all through school so like 6-7 years but he didn't reciprocate. We were really good friends tho.\n\nThen the last couple years there he started socialising with a different group and went from a mostly quiet bookworm to a guy who pranked people and shit like that.\n\nI mean, if he'd asked I still would have and I still think about him sometimes all these years later, but he lost a lot of the magic.\n\nI saw him once after school ended, drinks with another old friend. With those \"bad influences\" gone it was like old times.\n\nHaven't heard from him, or anything about him, in about 15 years. Last I heard he'd quit uni in the first year.",
   "created_utc": 1692885970,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjzo1v",
   "message": "He manipulated me and emotionally neglected me.",
   "created_utc": 1692886019,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk065h",
   "message": "She cheated on me, then lied to my face about it after I caught them and confronted her.",
   "created_utc": 1692886223,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk0b7s",
   "message": "Sexting with multiple other men. The part that crushed me the most wasn't that. It was the way she portrayed me to the other men. 12 years together, raised her kids like my own. Thank goodness after the divorce, they still are in my life.",
   "created_utc": 1692886279,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk0fgs",
   "message": "She went from asking me to kiss her and giving me very clear indicators that she was ready to get serious to rebuffing my efforts to be romantic and acting cold towards me literally within a week.",
   "created_utc": 1692886328,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk0ht6",
   "message": "He was an asshole, a greedy and petty bastard who was also an abuser with an inflated ego.",
   "created_utc": 1692886354,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk0inp",
   "message": "She fought the police - not the first time, apparently - and got herself put in jail. She's there *now* and has more stuff pending in the next county.\n\nNot gonna see her for a year or more and I'm over the whole thing (and most of all, HER).\n\nI am not, nor was I, impressed with her behavior.",
   "created_utc": 1692886363,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk1d3v",
   "message": "She treated me with the utmost love and care; made me feel like I was the most important person in her world... She lifted me up to the highest of highs... Then, she simply let go. After the crash I soon learned she never really cared and only needed me to pass the time while she convinced her ex-boyfriend to get back together. I still think about her sometimes. I suppose I was a moth to her funeral pyre... Got too close and burned.",
   "created_utc": 1692886700,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk1ydp",
   "message": "That I suddenly became an option, and got thrown away.",
   "created_utc": 1692886933,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk20cj",
   "message": "I came to realize that he was never going to love me in any way that I could recognize as love and there was nothing I could do to change it.",
   "created_utc": 1692886954,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk27gn",
   "message": "He got mad at me for picking a college that wasn't near him, which was what we had discussed two years prior. I told him that I was choosing my college for my own sake. We stopped talking. I briefly spoke to him 5 years later after finishing college, and boy I'm glad we stopped talking... dude got even more weird.",
   "created_utc": 1692887032,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk31wi",
   "message": "He insulted me many times and said that he was throwing this love to trash can because I couldn't meet him when he wanted (This happened a few hours ago lol)",
   "created_utc": 1692887364,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk3buu",
   "message": "I saw an interaction between her and a friend of ours on Facebook where they were publicly minimalizing the opinions of women who weren't as attractive as them. Not about fashion or makeup or fitness or anything even tangentially related.  Just about something random.\n\n\"These women don't even get to have an opinion bc they're so ugly. Lol. Like why are you even discussing this with me when I'm so much prettier than you?\"\n\nYeah... Good luck with that Kaylee.",
   "created_utc": 1692887472,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk3g6p",
   "message": "Always being blamed for everything, gaslighting, being pushed, shoved to the ground and jerked around my my arms and legs, told I’m a worthless loser who can’t do anything right and basically being made to feel inferior and less than. \n\nA small amount of love is still there but it’s on its deathbed.",
   "created_utc": 1692887518,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk3ixk",
   "message": "watching everything i loved about her fade away in an endless downward spiral\n\nthrowback to when i was in high school. she was the prettiest girl in the grade level. everyone wanted to be friends with her, and every boy wanted to be with her. she was a real angel back then. she knew she was gorgeous, but she didn't use it to her advantage. she was always nice to everyone, openly telling everyone that she wasn't looking for someone. she was the class representative, and probably the most authentic and yet down to earth girl i've ever met. she broke up fights, helped those who we're bullied, and always reported our usual shenanigans to the head principal. she was also popular with the teachers, because she was so honest and caring. \n\nit was the end of the school year, and she went into the summer holidays as the angel everyone knew, walking around with cat ears, smiling at everyone. but when she came back to school after the summer holidays, she was like a completely different person. she always wore black, used tons of make-up now and always looked rather angry and aggressive. she neglected every class, every duty and every friend. she started hanging out with the boys in the higher grades, and quickly separated herself from the most people who she knew. she started hanging out with suspicious people, disrespecting teachers and students, trying to mark herself as the only women in the school. once i got to talk to her again for the first time after the holidays, i realized that there's no way she was the same girl i once loved more than myself. she had turned into what she used to report to the head principal. she started being mean to the socially weaker students, and seducing teachers, more or less coming to school in underwear in the summer. that was the first time i felt my heart break. i didn't even recognize her anymore. she was still gorgeous, but now a drug-addicted, chain smoking, arrogant 'lady' who felt too good for everyone. \n\ni haven't really talked to her or seen her since i graduated. i don't even know if she made it. all i know is that she was in a relationship with the male counterpart of her, and they both started supplying half our city with drugs and every illegal substance that you can think of.",
   "created_utc": 1692887547,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk3l83",
   "message": "She said she didn't trust me because Im a phone addict. \nThere was never another woman. It was Reddit and Wordles.",
   "created_utc": 1692887572,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk577y",
   "message": "Constant criticism about everything.",
   "created_utc": 1692888194,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk5f90",
   "message": "that no matter what i did, how much i helped, how much i tried to be there for them, i was a second option and never a priority, never reciprocated\n\nthe feelings are still there, just slowly withering away as i face reality day by day\n\nEDIT: for all who support and are in the same boat, hopefully time will help and i wish you all the best in your endeavours ^^",
   "created_utc": 1692888281,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk6fcl",
   "message": "She had been living with her parents a few years after her divorce, over three hours away from where I lived. So, for me to see her, I'd have to drive and spend the weekend with her family. Towards the end, her mom was going through some things that made her start acting really weird and rude to me, which eventually resulted in her parents kicking me out 20 minutes after I arrived the last time. I had to get back in my car and drive home, and her reaction to it was that I was just another person abandoning her.\n\nThere were a lot of things that were dysfunctional about us, but that was the one that really made me see that I was giving way too much for a relationship that, at times, I don't think she really wanted all that badly.",
   "created_utc": 1692888663,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkafhm",
   "message": "he has no emotions, he’s always indifferent, he’s a man whore who lies and manipulates and sluts around lol. i was very blinded for so long",
   "created_utc": 1692890182,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkc6p7",
   "message": "I was nominated for an award at work and was on a high. Not three hours later, I found out that the woman I lived with and was meant to be marrying was having an affair. To be honest, the relationship was on the rocks anyway due to her erratic behaviour, overspending, shit behaviour towards me and disappearing, so her affair wasn't a surprise, and made a lot of things add up. \n\nBut even that didn't kill feelings. Just because someone is horrible to you or \"changes\", doesn't mean your feelings switch off. \n\nBut the two steps that did finally kill my feelings were relatively innocuous things. First - she brought home cakes from a bakery she likes (and therefore EVERYONE has to like, just because she does). She offered me one and I said no, simply because I wasn't hungry. She started to get pissed off, presumably because I wasn't, in her eyes, being compliant. \n\nThe final straw, and what DID kill my feelings stone dead, was the fact she was - yet again - late back from wherever she was. In itself not a massive issue, but given the circumstances, and given the fact that her constant lateness and unwillingness to do anything about it pissed me off. I challenged her about it, we were in the car at the time as we'd arranged to go out shopping. She told me not to have a go because it was Sunday. I told her not to be ridiculous - she just kept screaming at me that it was Sunday. \n\nI turned the car around and went home. The following morning, I packed a bag and left, finally sick of the treatment I was getting from her.",
   "created_utc": 1692890831,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkcvat",
   "message": "In high school The girl I dated went to Hawaii for her school trip. During the trip she was texting me and telling me everything other guys were telling her while they were at the beach and the same people knew we had been dating. Well one name kept popping up over and over again. To make a long story short 3 weeks after the trip I was closing at my job and she called me to tell me she cheated on me with the guy she told me not to worry about while they were “studying” for a final exam for courses he didn’t even take",
   "created_utc": 1692891087,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkd953",
   "message": "This person I was seeing used me as a personal therapist. I felt that I was walking on eggshells half the time, and I should've cut her off way earlier.",
   "created_utc": 1692891230,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkdggw",
   "message": "I wish they were gone but sadly not, she made me feel like I was everything and then dropped me for no reason and wouldn't talk to me, leaving me with zero closure. I did get the line 'it's me and not you, you are perfect'.......so I guess that was........nice.",
   "created_utc": 1692891305,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkejbs",
   "message": "Chronic unemployment? Hoarding? Financial irresponsibility? Anger issues? Treating me like crap, despite everything I did for him? Refusing to help himself (as a veteran) when he has access to PLENTY of FREE resources that regular civilians normally pay thousands of $ for? \n\nI have my reasons for filing for divorce.",
   "created_utc": 1692891700,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkek44",
   "message": "I realized that I spent too much energy trying to fix her problems without any return or progress, instead of fixing my own well being.",
   "created_utc": 1692891708,
   "score": 3,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjbn6k",
   "message": "I found out his true nature.",
   "created_utc": 1692873904,
   "score": 6,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjf8du",
   "message": "Friend I loved more than anything got with the sleaziest guy I had ever met, despite everyone telling her it was a bad idea.\n\nShocked pikachu face when he ends up cheating on her, she comes crying and whining to me, again. By that point I had honestly lost count of the number of guys who had cheated on her or abused her over the years, despite the whole circle of friends telling her they were bad news in the first place.\n\nI had enough of being the one to pick up the pieces for someone who, at that point, was doing it on purpose to get some attention. I held out as long as I could, hoping that she would wake up and stop getting into horrid relationships with the worst of the worst, and realize that she deserved better. (not me, never me, we would have been a disaster together, but anyone who treated her with basic decency would have been alright with me.)\n\nA month later, she was back with sleazy.\n\nI gave her the number to a good therapist and washed my hands off of that dumpster fire.",
   "created_utc": 1692876186,
   "score": 8,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjo5nd",
   "message": "Chlamydia",
   "created_utc": 1692880953,
   "score": 4,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk9ftl",
   "message": "I would ask about their day and they respond \"it was good\" and explain how everything went wrong in the day for 3 hours, in monotone, everynight.  \n\nLater, red flags popped up. Random numbers messaging him and he saying he was home when his mom said he wasn't.  \n\nCalling their mother horrible names constantly, and I got water one night and heard their mom crying in her room about it. \n\nThe kicker... I lost nearly 100lbs on keto and exercise and they weren't supportive through the journey. Even got friends involved and told me how disgusting the diet is and I should stop.  (He was a chub chaser).  \n\nI essentially cut him out on my birthday as a birthday wish to myself.",
   "created_utc": 1692889809,
   "score": 5,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjlpw7",
   "message": "He did not defend me or try to protect me when another man got in my face screaming and acting violent.",
   "created_utc": 1692879745,
   "score": 10,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjpmhd",
   "message": "Cheating scumbag.",
   "created_utc": 1692881654,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjpt9y",
   "message": "Yelling at my father",
   "created_utc": 1692881745,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjpux3",
   "message": "He cheated.",
   "created_utc": 1692881765,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjvecq",
   "message": "Consistent and repeated emotional abuse. A lovely flow of degrading comments. Simple",
   "created_utc": 1692884245,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjvmh5",
   "message": "Silence",
   "created_utc": 1692884341,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjx742",
   "message": "He gust didn't like me back like that-",
   "created_utc": 1692885002,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjxis7",
   "message": "she was a hypocrite",
   "created_utc": 1692885136,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjxyec",
   "message": "They were rude, fake.",
   "created_utc": 1692885313,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjyfc3",
   "message": "Realized she cheated on everyone she was with.",
   "created_utc": 1692885507,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjz3ob",
   "message": "She was way too easily manipulated and insecure for a trustworthy relationship",
   "created_utc": 1692885785,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxjz7og",
   "message": "His lack of drive, along with having jealousy over how my life is versus his. If there wasn’t work for two/three days he would wait until his friend called him about a new job instead of looking himself(he worked in tile) sometimes it would be almost two weeks no work and he just would focus on his social media(which he doesn’t even get paid for it). If I went somewhere for vacation or had something good happen to me, for sure for a week he would act up with me and treat me like extra. If it was going bad for me he was all sorts of energy and having great days. And overall just the fact that he needed the attention from women and even one day when he was drunk told his cousin he liked when the girls he messed with had boyfriends because he got that ego boost of her choosing him even though she has a man. Like he said in his words “she wants ME, even though she HAS a man.” He was just so self absorbed and always victimized himself.",
   "created_utc": 1692885832,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk09t8",
   "message": "Ignorance",
   "created_utc": 1692886264,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk0nrg",
   "message": "I'm stupid and still have feelings for him even though he cold shouldered me. So I would say Disrespect.",
   "created_utc": 1692886418,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk11si",
   "message": "cheated on me with someone who had the same name and birthday as me... just of the opposite sex",
   "created_utc": 1692886575,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk1lc9",
   "message": "When my fiancée fucked my brother",
   "created_utc": 1692886792,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk24yq",
   "message": "she punched me in the face and then faked a pregnancy",
   "created_utc": 1692887005,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk2g45",
   "message": "She told my sister she looked like a fat cow.",
   "created_utc": 1692887125,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk56kq",
   "message": "He couldn’t give me a solid commitment, on anything.",
   "created_utc": 1692888187,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk6bqe",
   "message": "Lying straight to my face... more than once.",
   "created_utc": 1692888625,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk7xjo",
   "message": "She was a terrible mother",
   "created_utc": 1692889233,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxk95lo",
   "message": "She told me dinosaurs weren’t real 🤷🏻‍♂️",
   "created_utc": 1692889699,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkaark",
   "message": "Physical abuse. Happened twice with two different women.",
   "created_utc": 1692890132,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkfy57",
   "message": "The idea that she had cheated, never discussed acknowledged or even hinted at, on me but was too much of a coward to communicate that with me like an adult.  Possibly because she had lost any respect she once held for me, though again she was too much of a coward to communicate that fully as well.\n\nCan you stay in love with a coward who doesn't respect you?  Were they ever really your true partner to begin with?",
   "created_utc": 1692892217,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkh0y9",
   "message": "They sucked my friends dick...",
   "created_utc": 1692892607,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkhyt9",
   "message": "Relationship not dead.\nBut she's very hot headed. Quick to shout, or snap at me.\nUsed to drink too much and pushed me a few times, this hasn't happened since I told her it's not on. Drinking is now way down\n\nI've told her that 99% of the time I love her as much as my own mother, father, and sister. But the 1% of heated, anger fuelled moments, where she'll hurt me with a single phrase which cuts right to a sensitive place, its just killing the spark.",
   "created_utc": 1692892954,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxkku9y",
   "message": "Realizing I deserved to be treated a lot better.",
   "created_utc": 1692894021,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxksbi4",
   "message": "he made racist jokes, and wouldn't stop.",
   "created_utc": 1692896821,
   "score": 2,
   "submission_id": "15zye5d"
  },
  {
   "comment_id": "jxlcjou",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15zye5d"
  }
 ]
}