{
 "submission_id": "15zzvmy",
 "title": "What did the person you were interested in do to completely make you lose interest?",
 "selftext": "",
 "created_utc": 1692878199,
 "permalink": "/r/AskReddit/comments/15zzvmy/what_did_the_person_you_were_interested_in_do_to/",
 "score": 103,
 "url": "https://www.reddit.com/r/AskReddit/comments/15zzvmy/what_did_the_person_you_were_interested_in_do_to/",
 "comments": [
  {
   "comment_id": "jxk2fac",
   "message": "Told me I was an okay safe bet and they knew I wasn't going anywhere, so they wanted to play the field as much as possible and see if they could do better, before settling on me.",
   "created_utc": 1692887117,
   "score": 110,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkalfm",
   "message": "Long time ago, started seeing a very rich person.\n\nSent a photo of dinner I had ordered on a completely average restaurant on a completely average/popular neighbourhood. Got a reply saying \"if you ever took me out to eat there, I would never see you again\".\n\nWell, indeed never saw the person again.",
   "created_utc": 1692890244,
   "score": 30,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxka5m3",
   "message": "Every story she told me was about some argument/conflict/drama, and in every story she considered herself to be the paragon of virtue and honesty while everyone around her would be vindictive, cruel, and \"out to get her\". I recognized the behavior because my mom does the same thing and I hate that kind of constant self-victimization.",
   "created_utc": 1692890080,
   "score": 25,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjzot9",
   "message": "Talked about himself for 2.5 hours straight. I was hoping a disruption like the food being served, orders being taken or even a story ending would remind him to let me get a word in, but he would just go back to another story with \"so.... yea I was saying...\"",
   "created_utc": 1692886028,
   "score": 19,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjkrx0",
   "message": "Told me about his gambling problem. Only told me because he was losing his house.",
   "created_utc": 1692879256,
   "score": 198,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk9h5k",
   "message": "Every time she texted me and I didn't respond within 5 minutes she would send a question mark. It was incredibly annoying.",
   "created_utc": 1692889823,
   "score": 227,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkna22",
   "message": "Litter.\n\nWe were on a walk, things were going great, I was totally smitten, and then she threw her empty Starbucks cup in the bush.\n\nThis not only turned me off, but evoked an instant bad reaction, and I of course picked up the cup and threw it away in front of her while borderline insulting her character to her face.\n\nI probably over reacted but regardless, I have never gone from interested to disgusted like that before, or since.",
   "created_utc": 1692894932,
   "score": 136,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk1rxz",
   "message": "She slapped me in the face once in public and I have zero tolerance for that outside the bedroom.",
   "created_utc": 1692886863,
   "score": 9,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjp0dn",
   "message": "They would spend all day making TikToks and IG posts but couldn't spare 5 seconds to at least say hi to me. We were dating at the time so I think I deserved at least the tiniest bit of attention.",
   "created_utc": 1692881364,
   "score": 65,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk1nkn",
   "message": "I said this within another thread recently, but on a first date, a gal that I was interested in asked me for $300. No, thank you (to both the request AND her).",
   "created_utc": 1692886816,
   "score": 217,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjlakm",
   "message": "I listened to her issues and troubles. So many of them were clearly self-inflicted. Poor choices, money management and it's never her fault? Nah, I can't have those problems become my problems.",
   "created_utc": 1692879527,
   "score": 101,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjz1dw",
   "message": "I saw her interact with her kids. she was and is a terrible mother. last year i ran across her eldest, he is now in his early 20s. we were talking about life, he was telling me how his mom wasn't a good parent, and I confirmed his opinion. he seemed to like the fact that someone else saw, even if I couldn't have helped beyond having been someone he could talk to during his teen years.",
   "created_utc": 1692885758,
   "score": 169,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk06sp",
   "message": "bad-mouthed their ex a lot and most of the conversations we had were one sided",
   "created_utc": 1692886230,
   "score": 49,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjmirt",
   "message": "Cheated on me again, after spending the previous 7 months faking the *previous cheating incident* as a rape.",
   "created_utc": 1692880149,
   "score": 175,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjjrpo",
   "message": "Being on his damn phone on social media 24/7 during meals during conversations etc like come on.",
   "created_utc": 1692878728,
   "score": 73,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkd9ud",
   "message": "She would text back and showed interest. But when it came time to plan a meet up - there was always something going on in her life.\n\nI've since learned that a woman will make time for you if she really wants to.",
   "created_utc": 1692891237,
   "score": 96,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjm4fe",
   "message": "I went to her apartment and she had poster size pictures of herself (like 5) She made me dinner and the chicken was seriously under cooked  (raw) and the frozen vegetables were still frozen. Then the icing on the cake (there was no cake) was that she left room and came back in wearing slippers, that she mentioned she's  \"had forever \" that smelled, from across the room, of funky feet....",
   "created_utc": 1692879949,
   "score": 254,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk5tkr",
   "message": "The girlfriend moved into a new apartment and dropped her cat off at the pound.\n\nCat was a sweetheart, she had him for five years, and when I found out she dropped him off at the pound after asking about him, her comment was, \"What's the big deal? I can always get another one.\"\n\nThat was a big wake-up call I didn't want to spend any time with that person. Pretty much said I was done and got the hell away from her.\n\nAdopt animals for life, you are their caretaker, and they are your best friends for life.",
   "created_utc": 1692888433,
   "score": 103,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjq0c8",
   "message": "His clothes smelled like he let them to rot in the washing machine and that was such a turn off.\nHappen 2 times with another guy his clothes smelled funky one day and I lose interest.",
   "created_utc": 1692881834,
   "score": 233,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk13js",
   "message": "Things were nice and consistent for four months and then they ghosted me. \nI didn't know sad anger could be such a strong emotion...",
   "created_utc": 1692886594,
   "score": 94,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjosrl",
   "message": "Out on a blind date set up by friends with a ballerina. She is very pretty, even by bunhead standards. Dinner going nicely, and then she starts telling me how the Holocaust was faked and it's all the Jews' fault. Check, please! Goodnight!",
   "created_utc": 1692881262,
   "score": 230,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkd6a7",
   "message": "I realized I didn't actually like her, I just liked the idea of being with someone.",
   "created_utc": 1692891200,
   "score": 111,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk0qa8",
   "message": "Told me that the idea of intimacy with me made her nauseous",
   "created_utc": 1692886447,
   "score": 110,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjsbtc",
   "message": "Told me I was playing “N-word games,” when I didn’t drop everything in the middle of the afternoon and answer his barrage of drunken texts. Hard R, too.\n\nI’m Black; he isn’t. I was both amused and appalled, and I pretty much blocked him then and there.",
   "created_utc": 1692882896,
   "score": 248,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk32de",
   "message": "By saying no to me when I asked her (a common friend) out and then suddenly showing interest in me when I didn't pay any more extra attention to her.\n\nIf I wanna play games, I'd use my PC instead of asking her out.",
   "created_utc": 1692887369,
   "score": 23,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxko0qq",
   "message": "Blanked me and played games with me under the advice of her friends to make me “want/fight for her more”. I realised quickly after she was about as interesting as a wet carrot so I’m not that bothered. Met my soul mate shortly afterwards and been together nearly a decade now",
   "created_utc": 1692895213,
   "score": 14,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjnhu7",
   "message": "Bragged about losing their virginity at a family reunion.  It was not to some outsider who tagged along with another family member.",
   "created_utc": 1692880632,
   "score": 205,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkaei5",
   "message": "Inconsistency. Was open and able to talk about his own problems and I was willing to be there and listen.. but the rare time when I needed someone to talk to he either didn’t know what to say or just ignored me and left me on read.",
   "created_utc": 1692890172,
   "score": 57,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkkt44",
   "message": "We went to a parade together with a bunch of his friends after having been on 3 or 4 dates. Turns out these “friends” were other people he was dating the same time as me. He had brought us all together for a mega-date to feed his ego and didn’t tell any us! Instant turn off.",
   "created_utc": 1692894009,
   "score": 0,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk0kz2",
   "message": "When they start giving excuses like past trauma for their bad behaviour and refuse to change for better.",
   "created_utc": 1692886388,
   "score": 65,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjorwv",
   "message": "They copy people too much to the point were it's annoying like they had no personality at all",
   "created_utc": 1692881250,
   "score": 119,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxka92o",
   "message": "We were having a normal conversation and literally out of nowhere bro went \"if they can bleed they can breed\" i had to ask if he was serious. He was.",
   "created_utc": 1692890115,
   "score": 182,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkdr9a",
   "message": "Treated me as an option and would openly be texting with other girls from dating sites while we were spending time together. When I confronted him about it, he said we weren’t committed and I shouldn’t be so jealous cause I was the one he was actually hanging out with. Like he was gracing me with his presence lol",
   "created_utc": 1692891415,
   "score": 196,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjuk08",
   "message": "Hating on everyone behind their back. Girl got more issues than vogue.",
   "created_utc": 1692883877,
   "score": 83,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk07do",
   "message": "He had asked me a question while we were at a convention. The presenters were presenting. I answered the question and then he “susshed” me. Like okay, nope.",
   "created_utc": 1692886237,
   "score": 11,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkcmou",
   "message": "She told me on our first date that she will never text me first and she expected me to always pay for everything\n\nThose I can tolerate but the deal breaker was she chewed with her mouth opened",
   "created_utc": 1692890997,
   "score": 78,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkrolk",
   "message": "He was very attractive and nice and we had things in common.\nBut he complained about everything- work, people he knew, food and service at restaurants, etc. Also when he drove he would pulse the gas pedal instead of steadily holding it. Made for a jerky ride and was insanely annoying. We only dated for a month and I had to jump ship.",
   "created_utc": 1692896585,
   "score": 101,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxlzfds",
   "message": "Spent more time talking to the two women at the next table than to me on our third date. He was trying to make me jealous, but all he did was make them visibly uncomfortable and me completely uninterested.",
   "created_utc": 1692912851,
   "score": 109,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjj0bj",
   "message": "He was always disrespectful to his mom",
   "created_utc": 1692878318,
   "score": 65,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk1n1i",
   "message": "He told me he was specifically into younger girl characters getting assaulted :| so. I dipped after that lmfao",
   "created_utc": 1692886810,
   "score": 214,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkm1r7",
   "message": "I witnessed first hand my first \"Fridge is a Bitch\" moment. Left him that day.\n\n\u0026amp;#x200B;\n\nFor some background, apparently my boyfriend at the time had a tantrum habit. Like full blown incel meltdowns that I was never around for, nor were they mentioned to me as anything other than in passing as a joke. This entire friend group lived in one house except for me. One time some mutuals were over and the mom had to change her baby's diaper before everyone left the house. She deposited it in the trash bin while she cleaned everything else up. My ex, who didn't sleep much the night before, opened the trash, saw a diaper, and started screaming at the top of his lungs calling everyone in the room a bitch, screaming about there being a baby and dirty diapers in the house, hurling insults everywhere. Everyone just kind of sat there and waited for him to finish. After like 30 seconds of dead silence, the dad goes \"damn bro you gonna call the fridge a bitch too?\" I was not there for this situation but it coined the term for his specific type of tantrums.\n\nThis friend group had a way of minimizing the severity of his tantrums and talked about them in a joking manner so I didn't think they we're actually like... bad. Needless to say when I saw him have one because my other friend was too short to keep up with the group and I was staying back with her, I was OUTTY... and gave my friends a good scolding on minimizing verbal abuse.",
   "created_utc": 1692894468,
   "score": 13,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjkwv7",
   "message": "She broke up with me.",
   "created_utc": 1692879328,
   "score": 167,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkot27",
   "message": "I was on a second date with a guy who seemed really solid emotionally and I was attracted too.  After dinner we took a walk outside.  The guy out of nowhere turned his head and took the biggest spit ever. It hit a lady. He didn’t stop to apologize to her or to me for being so disgusting.  I said something and he felt spitting in public was normal.   He didn’t want to accept the fact that where we live it isn’t plus he didn’t care he aimed at someone.   End of date.",
   "created_utc": 1692895511,
   "score": 203,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxlmob5",
   "message": "Went to her place to hang out. Noticed that her dog’s crate in her room had poop in it. Not a fresh one that just hadnt been picked up in time. Not just one old one either that maybe some how went unnoticed for the day. Multiple piles of poop from multiple days. Fuck that.",
   "created_utc": 1692908023,
   "score": 112,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjmfkc",
   "message": "One worded responses, playing this stupid game of \"I don't care about you until I'm drunk\"",
   "created_utc": 1692880104,
   "score": 9,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkouzo",
   "message": "When I googled him from the restroom (armed with new info - his last name), I found newspaper articles about his time in prison. 😳 (Statutory rape.) Check, please! Buh-bye now.",
   "created_utc": 1692895531,
   "score": 198,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk3qfv",
   "message": "She wasn't as supportive/serious as I wanted my partner to be.\n\nI had been looking for a job for about a month and finally got an interview. I texted her to let her know how excited I was to which she replied with a stonecold \"Good job, u want a medal?\"\n\nReally bummed me out, thought she was joking so I let it slide. Nope. She didn't congratulate me or anything. It turned me off and I eventually cut things off with her after a few more instances where she couldn't be serious and threw snarky comments my way when I was feeling euphoric and shared amazing news with her.(in my eyes amazing news, I get giddy over small things).\n\nMoral of the story ladies - Please be happy for us because us men don't hear a \"good job\", \"I'm proud of you\" etc.. often, if ever. If we're excited about something, it's for good reason. Don't ruin it for us.",
   "created_utc": 1692887628,
   "score": 176,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxln9tm",
   "message": "His best friend asked me to have a threesome with them in front of him. I froze face flushed confused and uncomfortable af. Looked at him expecting him to say literally anything. Nothing. Told his friend he’s got jokes assuming he had to be kidding. His friend asked again. He still says nothing. I lightheartedly said no thanks I’m good off that. Stepped outside “to smoke” so I could cool down and process wtf just happened. Thought they must’ve talked about it but couldn’t figure out why he wouldn’t have brought it up to me himself like why tf would his friend be the one to ask instead of him talking to me. He comes out a few mins later mad af accusing me of hooking up with his friend. Scary mad. Told him I didn’t have the slightest interest in his friend and it was fucked he didn’t speak up. Made it through the night til I could get back to my car and blocked everything. Didn’t want nothin to do with any of that ever again.",
   "created_utc": 1692908246,
   "score": 87,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkf0th",
   "message": "My middle/high school crush, never worked up the courage in middle school to ask her out. She started dating one of the guys from my friend group freshman year, they broke up and she started dating an upperclassman that she dated up until she took off for college.  The first summer back from college I said fuck it, it’s now or never she’s single so I  took my shot and she said yes for a date.  First date went terrible she’s was incredible boring and didn’t offer up much for conversation the only saving grace was we were both stoners and I was able to get really good bud that summer.  The next couple dates were the same not much interaction from her just always turned into us having to smoke weed to save the date or for her to seem interested.  On the fourth date I was determined to make it work and she finally opened up but it involved her telling me about  all the men she screwed her first year at college and all her different sex-capades  she had.  She went into detail on some of them.  I dropped her off and realized she was only using me for free smoke ups.",
   "created_utc": 1692891880,
   "score": 199,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxnujsh",
   "message": "Cheated on me with 3 other girls before I found out",
   "created_utc": 1692945770,
   "score": 59,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk05q8",
   "message": "She turned out to be an avid follower of Gwenyth Paltrow level woofuckery. Healing crystals, magical herbs, potions, and lotions from \"natural supplement stores.\" Despised medical science as conspiracy to depopulate the planet or control people. Started selling her woo as well. Possibly some MLM bs. Still went to the hospital when her appendix blew up, though...",
   "created_utc": 1692886219,
   "score": 145,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjnbn5",
   "message": "I was visiting my hometown and hanging out with an old friend and a girl he worked with. It was a little flirty between her and I but then while we were hanging out at his place she stood up and said “hey I got something for you “ and farted at me.",
   "created_utc": 1692880548,
   "score": 85,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkayos",
   "message": "Went to the movies. She made fun of the disabled employee ripping the tickets.",
   "created_utc": 1692890383,
   "score": 116,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkdox4",
   "message": "Years ago, when I was single, I had an account on plenty of fish.   I was talking with this woman, cute in her pictures, seemed pretty cool ...then I asked what brought her to my city from her home state.  And in the course of telling me, she revealed that she had a seven year old child who she left behind in her home state, and she hadn't had a very compelling reason for moving here, in my opinion.  Instant deal breaker.  Who just up and leaves their young child behind to move across the country?",
   "created_utc": 1692891391,
   "score": 166,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjywkg",
   "message": "She was an asshole towards her parents. When I mentioned it to her she was just like “oh well that’s just how we communicate lol!” Uhh no. It wasn’t a “giving them a hard time” type of assholery. It was a “I don’t respect you” type assholery.",
   "created_utc": 1692885702,
   "score": 88,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxl35ex",
   "message": "Talked to this girl for a bit, went on a couple of dates and all was well. I asked her if she wanted to be my girlfriend, but that's when she told me...\n\nShe was going on a camping trip with a guy she had known for a few years. She would confess to him, and if he rejected her, then she would be my girlfriend, but she just had to give it a shot. \n\nI told her don't bother. I'm not anybody's backup plan. He ended up rejecting her, so she ended up alone.",
   "created_utc": 1692900813,
   "score": 108,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxju9hy",
   "message": "I planned our first date (picked the time, date, location, etc), we had a good time and agreed to go out again, and then the dude completely spiraled when I suggested he pick the place for the second date. He was waffling, saying \"Oh I'm so bad at planning\" and literally COULD NOT decide any of the details of what we should do or when we should meet. (For reference I'm talking about a grown man in his thirties who was a small business owner.) This happened a lot with the men in my city when I was doing online dating, for whatever reason they ALWAYS seemed to expect me to plan our dates from beginning to end and it was hellish nudging them to take some initiative with the planning, even when we were actually into each other. It became a colossal turn-off for me over the years.\n\nThe wonderful man I'm with now always takes initiative to propose fun things for us to do, and I always tell him how much I appreciate it. And when I plan our dates he THANKS me and acknowledges that planning takes effort. I love him so much.",
   "created_utc": 1692883749,
   "score": 216,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkfy8e",
   "message": "Bully a special needs kid",
   "created_utc": 1692892218,
   "score": 43,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxklixq",
   "message": "Dated a bodybuilder once. We had exactly three dates. All he talked about was either his sport or food. The first two dates were in a restaurant. For the third one we met in the city and for whatever reason went grocery shopping. He bought a 24 pack of *frozen* donuts. By the time I was home (about one hour after we left the grocery store) he texted me that we need to go to this store again soon because he already ate ALL the FROZEN donuts already. I cringed and politely told him that I’m no more interested in meeting again. \nWeirdest behavior I ever saw. On top of that he still lived with his ex girlfriend and well let’s say I’m not sad about how it went.",
   "created_utc": 1692894274,
   "score": 61,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkscfq",
   "message": "She begged a random dude for money. When he gave her some, he walked away with smile on his face. As soon as he was out of earshot she started bragging to her friend how she’s hot and guys will just do stuff for her. Yeah that immediately killed any attraction.",
   "created_utc": 1692896831,
   "score": 57,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxo050d",
   "message": "She constantly remembered her ex and compared me to him. No one wants to be in the shadow of a past relationship.",
   "created_utc": 1692950147,
   "score": 42,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjnjjj",
   "message": "Canceled dates. Basic flakiness and disrespect",
   "created_utc": 1692880655,
   "score": 186,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxknlhg",
   "message": "Not clean up after herself.\n\nShe was a beautiful pig 🐖.",
   "created_utc": 1692895054,
   "score": 89,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjmb7r",
   "message": "She got a boyfriend",
   "created_utc": 1692880042,
   "score": 130,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk3b07",
   "message": "I was dating a woman who was absolutely gorgeous. Unfortunately she was well aware of this and was constantly posting selfies and photos of herself on social media. On dates she would frequently request I take photos of her, never of us together, and post them on Instagram during the date. I noped out of that pretty quick. I have no desire to be an Instagram husband.",
   "created_utc": 1692887462,
   "score": 205,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjnkdu",
   "message": "He said he ideally wanted 6 biological children. No adoption, they had to be his. I want to give birth to zero children.",
   "created_utc": 1692880666,
   "score": 216,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjjw6d",
   "message": "Got way too into zodiac signs and horoscopes.",
   "created_utc": 1692878793,
   "score": 6,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk2gfk",
   "message": "After about 8 months of me always hosting. Cooking dinner, cleaning up giving her nice massages, breakfasts lunch depending how long she lingered. One morning I had plans with my friend and it was agreed that she would leave in the morning. Leading up she started leaving overnight bags and she started not leaving till the afternoons sometimes even not leaving.  Anyway one morning where it was agreed she’d be on her way she didn’t. I was busy preparing for my plans and as she was finally leaving said something like “next time maybe offer me breakfast if something in the morning”\n\nI thought like ‘at least once maybe you can offer me a coffee or something’ nope not even a glass of water when she getting one herself \n\nI coined it as princess syndrome and ghosted her.",
   "created_utc": 1692887129,
   "score": 238,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjv5c4",
   "message": "She said, she is not interested. So i stopped, not like others.",
   "created_utc": 1692884135,
   "score": 95,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkkzum",
   "message": "Revealed that they thought my comments about being childfree weren't sincere and that I'd change my mind after being with them for a short period. Completely put me off within seconds.",
   "created_utc": 1692894078,
   "score": 99,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjplz5",
   "message": "Bragged about how much money he came from. Eg.) told me paid an XYZ amount of money to have his current phone number (because he likes the number pattern) \nYucky.",
   "created_utc": 1692881648,
   "score": 148,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkwpwp",
   "message": "after message \"What a save!\" in rocket league",
   "created_utc": 1692898445,
   "score": 113,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxllo1i",
   "message": "Pushed my cat off the bed, hard enough her claws were ragged across the cover. That bed is hers, not yours. Know your place, dude.",
   "created_utc": 1692907644,
   "score": 61,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkdiib",
   "message": "This was over a year ago now, but the first time he and I had sex, he didn't try to touch me at all. He wanted a blowjob, so I did, and then he grabbed me and flipped me over for doggy. I had been seeing this person for 4 months and we had known each other before that for about a year, so it's not like I had only met him 2 weeks ago. \n\nI had been by his side through multiple family crises at that point and had been sleeping at his apartment regularly. He told me I was perfect, so calming to be around, so sweet, etc. and I thought he really cared about me. I was shocked that he didn't want to actually interact with me while we had sex. It actually felt so shitty that it brought back some bad memories, even though I had consented. I left his house at 6 AM the next morning and went home to cry about it.\n\nTo make matters worse, he got super defensive when I brought it up to him. Didn't want to talk about it at all or work on communicating better. It broke my heart a little. \n\nThen he tried coming back after playing the field for a little because he \"missed me so much 🥺\" so I told him to suck my dick.",
   "created_utc": 1692891326,
   "score": 123,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk2849",
   "message": "I liked him, he was interesting. Took adventurous Trips and was really good at telling stories about them. Finally when we met at a Party for about the 10th time, I found the Courage to ask him if he had a girlfriend. His Response:\"Yes... but that doesn't matter.\" He had that Kind of Look on his face that made me know what he wanted. I totally lost interest in him. \n\nBest thing, that ever happened. I think 2 weeks after that I started dating another guy. That guy has been my husband for 6 years now.",
   "created_utc": 1692887039,
   "score": 185,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk2nzt",
   "message": "Not be able to hold any conversation to any extent",
   "created_utc": 1692887212,
   "score": 60,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxjkoht",
   "message": "Purposefully give their baby a contact high.",
   "created_utc": 1692879206,
   "score": 101,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkh03l",
   "message": "He was a sweet guy. Smart. Such big dreams, and he absolutely could have realized them, but he couldn't get out of his own way. Lots of drinking and drug use to the point it had a negative impact on his daily life and relationships. \n\nIt was a real shame. \n\nI saw where he was heading and told him very plainly it wasn't the direction in which I wanted to go in my life. He said he'd change, that he wasn't \"That Guy,\" didn't want to be \"That Guy.\"\n\nY'all know exactly where this is headed.\n\nThe moral of the story: When someone shows you who they are, believe them the first time.",
   "created_utc": 1692892598,
   "score": 28,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkl6wt",
   "message": "When she said is mainly into guys in suits and not jean wearing guys...",
   "created_utc": 1692894150,
   "score": 32,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxk0jif",
   "message": "He told me all my friends were overweight and lazy and that I should pluck my eyebrows and shave my legs before each intimate moment.",
   "created_utc": 1692886372,
   "score": 242,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxll7a4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxlmw8d",
   "message": "After we had sex, he looked me dead in the eye and told me that if we were to move forward with dating, he needed me to know that he is a “narcissistic, manipulative, asshole”. I said thanks for the heads up, never saw him again",
   "created_utc": 1692908105,
   "score": 38,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxmsvty",
   "message": "In college, I asked a guy if he'd like to go on a date with me.  On our date, he spent the whole time talking about how women don't like men under 6ft.  When presented with the fact that he was literally on a date with with a woman who liked him, his answer was that I would dump him if I found someone taller.  Mind you, I am short af and he was a full 6 inches taller than me.  When asked why he'd say yes to a date if I was just going to do that, he said it might be the only chance he'd have to get laid.  Can you guess why he thought there wasn't a 2nd date?",
   "created_utc": 1692925149,
   "score": 34,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxkkibf",
   "message": "I remember i was talking to this very pretty Asian girl that i had a huge crush on for a while. She started talking to me after we graduated high school. But i grew up poor and she grew up not poor lol. She said \" why are you working so much, you should be going to college \" but i was giving all my money to my mom to not get evicted. She didnt understand that i didnt have my own money and how i was just trying have a home. We got in a small argument and she tried to convince me to just say no and go to school. Anyways... i kinda blew a fuse and told her something mean i can really remember and ghosted her. Eventually we did get evicted and my life spiraled and i hit rock bottom. Really glad she wasn't there to witness any of that 💀😂",
   "created_utc": 1692893898,
   "score": 55,
   "submission_id": "15zzvmy"
  },
  {
   "comment_id": "jxlfhjy",
   "message": "She told me about our wedding plans and what she wanted to name our kids and how I needed to convert to her religion.",
   "created_utc": 1692905356,
   "score": 29,
   "submission_id": "15zzvmy"
  }
 ]
}