{
 "submission_id": "1601r82",
 "title": "What is the most mature or intelligent thing you have ever heard a young child say?",
 "selftext": "",
 "created_utc": 1692883147,
 "permalink": "/r/AskReddit/comments/1601r82/what_is_the_most_mature_or_intelligent_thing_you/",
 "score": 82,
 "url": "https://www.reddit.com/r/AskReddit/comments/1601r82/what_is_the_most_mature_or_intelligent_thing_you/",
 "comments": [
  {
   "comment_id": "jxk2415",
   "message": "My brother took my (then) 5yo nephew hunting. They had many conversations about what would happen, why it would happen that way, and what the result would be. \nThe time came to pull the trigger and my brother asked, “now, you know what’s going to happen when I pull the trigger, right Buddy?”\nNephew replied, “We’re going to take it away from everything that it loves.” 😭",
   "created_utc": 1692886995,
   "score": 91,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk0bm0",
   "message": "My 4yo niece after a friend's grandfather passed away: \n\n**\"I just wish bad things didn't happen in life and we were always happy. But that's not life. Life is life.\"**",
   "created_utc": 1692886284,
   "score": 134,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk3q2k",
   "message": "During COVID my son's kindergarten class was held online, live streaming video, distopian nightmare. Anyways one day the teacher's stream freezes up and all the kids start going nuts: laughing, shouting, shaking their Chromebooks like chimpanzees. \n\nThen one of the kids, a real man of a kindergartner, takes control of the whole class and calms everyone down and explains that the teacher will rejoin the room shortly so \"let's all just sit tight.\"\n\nAnd then the whole class just waited patiently for the teacher to arrive. It was nuts. I would've been proud if it were my kid, but mine was one of the ones going ape shit.",
   "created_utc": 1692887624,
   "score": 134,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkgopd",
   "message": "Foster child that stayed with us. Six years old. Just out of the blue says. “You know, I understand my life is better here.  But I miss my Mom.”. I tear up just writing it. He was so aware if what was going in around him.  He could be so mature about some things and really underdeveloped in other areas.  He did get to go home, graduated high school and just got his driver’s license.",
   "created_utc": 1692892481,
   "score": 55,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk4wzt",
   "message": "My 5 year old son was half asleep in the car after a long day of playing and school and whatever. He’s staring out the window with heavy eyes and goes:\n\n“Daddy, being a person makes me tired. I have to remember too much and be friends with lots of people. Squirrels don’t. They just get their food, and try not to get hit by cars. I could do that better than being a person.”\n\nAnd he fell asleep shortly after. Considering about 90% of what he normally talks about is Roblox, some random argument with his brothers or penis/poop “jokes”…i was actually taken aback by that blurb of reality in his little brain.",
   "created_utc": 1692888085,
   "score": 143,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk03kg",
   "message": "Out for a walk with my middle son who was about 8.  We stopped on a village green in the Yorkshire dales to eat out sandwiches.  I had a pint of beer from the pub and he had a large orange and lemonade.\n\nAs we sat in the sun he looked at me with a big smile and said:\n\n“It doesn’t get much better than this, does it dad?”",
   "created_utc": 1692886195,
   "score": 159,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxjyb09",
   "message": "2.5 yr old struggling remembering word for tights\n\"....my...my...sockpants\".  Descriptive, novel word combo.\nGood job, kid.",
   "created_utc": 1692885457,
   "score": 44,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkczuf",
   "message": "I picked my son (7-8ish years old at the time) after a rough day. About halfway home I realized I was in my own head and hadn't really been talking to him like we normally do. So I apologized for being so quiet. He replied with, \"what's wrong with being quiet?\". My relief and pride were immeasurable.",
   "created_utc": 1692891134,
   "score": 39,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkevl1",
   "message": "I’m pretty stoic and do my best to put my head down and plow ahead.  Lotta reasons for that.  But I guess a lot of stressors were backing up on me and I guess it started to show.  \n\nOne night, after doing the kids prayers in their their bedroom, my then 9-10 year old son said to me “dad, you wanna see something awesome?”  And I said “buddy, right now I NEED to see something awesome”.   When he was like 4, he would tell me something similar and then show me a giant poop in the toilet.  Boys.\n\nSo I was ready for anything as he walked me to the kids bathroom.  He pointed at the mirror and said “look, there is an awesome dad” \n\nHe then walked back to his room and went to bed and I headed to mine and almost cried.  \n\nI did need that.",
   "created_utc": 1692891826,
   "score": 42,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxjxea6",
   "message": "My 5 year old: \n\nAfter Han, Luke, Leia, Chewie climb out of the trash compactor.... \"why aren't they dirty??\" \n\nIn 2+ decades I've never noticed or seen another adult notice that detail. Yet she did her first watch. \n\nAnd star wars fans lovvvvveeeee to rip things apart",
   "created_utc": 1692885084,
   "score": 83,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxjvdvk",
   "message": "\"Why do adults say things they don't mean?\"\n\nKid was asking real questions I wasn't quite prepared for.",
   "created_utc": 1692884239,
   "score": 76,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkdxyh",
   "message": "I told my toddler his shoes were on the wrong feet. He looked confused for a couple seconds and then explained to me \" but these ARE my feet\"",
   "created_utc": 1692891483,
   "score": 36,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk46my",
   "message": "My youngest brother once asked my other younger brother if he wanted a soda. He said yes and my youngest brother said \"how does it feel to want?\"",
   "created_utc": 1692887803,
   "score": 34,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkhisb",
   "message": "\"Who the fuck thinks the earth is flat?\n\n- A classmate of mine in 2nd grade",
   "created_utc": 1692892789,
   "score": 34,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk5mc5",
   "message": "My son once said \"Dad, what if the big bang created God?\"\n\nIt's 3 in the morning dude...",
   "created_utc": 1692888355,
   "score": 62,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxjzzwl",
   "message": "Like 8yo boy i met in a Park randomly looked at me, told me he doesnt want to work until Hes old and nearly dead out of the blue, heavily sighed, proceeded to hand me his walking cane shaped stick and ran off into nowhere.",
   "created_utc": 1692886154,
   "score": 26,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkc878",
   "message": "I would occasionally tickle my little girl to help her wake up in the morning. We'd make a whole game of it, like \"uh oh, wiggle worms (my fingers) are coming for those pits (her arm pits)!\"\n\nOne morning she said, \"You can't get my pits!\"\n\nI said, \"Oh? Why can't I get your pits?\"\n\nShe said, giggling, \"Cuz my pits are in Mexico!\"\n\nShe was three. I was like, HTF do you even know what Mexico is?!?! I about fell over laughing though.\n\nAnd of course I had to settle for tickling her feet. Her pits were in Mexico. What could I do?",
   "created_utc": 1692890847,
   "score": 26,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkcdw6",
   "message": "My son was 8 at the time and he had a friend whose parents were going through a divorce.\n\nOne day as I'm putting him to bed, he looks me straight in the face and tells me \"You know, me and my sister (4), we'll be okay if you and mom ever get divorced.  You don't have to worry about us.\"\n\nI stared blankly right back at him for a few seconds before responding, \" That is good to know, son.  Thank you.\"\n\nMy wife and I are still astounded by that one even now, 10 years later.",
   "created_utc": 1692890905,
   "score": 23,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkdice",
   "message": "My wife emigrated from Vietnam as a child a few years after the war ended. When our son was small we were telling him the story of how we met and about the person that introduced us. One of us said, “So you could say that (person that introduced us) is the reason you are alive now.” He responded, “No, the reason I’m alive is the Vietnam War.”",
   "created_utc": 1692891324,
   "score": 16,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkhgco",
   "message": "Working at Walmart, kid, about 7 I think, was telling his mom that the \"rude cashier\" (only heard *her* screaming, obviously) was probably just tired.\n\nWhile probably true, I think rationalizing perceived behavior is more mature than batching about it.",
   "created_utc": 1692892764,
   "score": 15,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkun7y",
   "message": "My kid when he was about ten (this is quite roughly translated): \"We are growing up and learning to act friendly towards each other. Many of my friends grew up during the summer and act better now. Do you think grandma just never had the chance to grow up and learn these things?\"\n\nMy mom's an alcoholic who hurts people around her and we try to teach boundaries with empathy, but my kid put it simpler than we could have.",
   "created_utc": 1692897682,
   "score": 11,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk4r17",
   "message": "My boy is 4, my siblings are 3 and 2. The oldest convinced the middle that spider eggs are inside grandma's garden rocks. I walk out to the older two trying to smash rocks apart and the youngest says \"they're just trying to cause chaos.\"",
   "created_utc": 1692888019,
   "score": 9,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkhhkx",
   "message": "I asked my 2 year old Neice what she did in her last life. She calmly replied that she was truck driver. Everyone became very quiet and my brother scolded me.",
   "created_utc": 1692892777,
   "score": 11,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxjz1pt",
   "message": "\"Everyone dies one day. Everyone. Even wolves. But not books. Not words. Words don't die.\"",
   "created_utc": 1692885762,
   "score": 43,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkl16j",
   "message": "My wife and I went to our son's third grade parent-teacher conference. My son absolutely loved his teacher and talked about her ever day he came home. When we meet her we found out she was black. Obviously didn't bother either my wife or me. When we got home we asked our son why he didn't tell us she was black? He said \" What does it matter?\"",
   "created_utc": 1692894092,
   "score": 8,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkrcnr",
   "message": "My daughter, when she was 5, when I was telling her it was time to get into bed. \n\nDaughter: “My body isn’t ready for bed yet.”\n\nMe: “Ok, but it’s 8:30 and time to get into bed”\n\nDaughter: “My body isn’t ready for bed. YOU worry about YOUR body. I’LL worry about mine”. \n\n\n\nMe:",
   "created_utc": 1692896459,
   "score": 8,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk296p",
   "message": "When discussing taxes, my niece said “no one should take and spend someone else’s money”",
   "created_utc": 1692887051,
   "score": 22,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk8rd1",
   "message": "Feverishly browsing for r/thathappened content...",
   "created_utc": 1692889550,
   "score": 6,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk8wd4",
   "message": "\"Fuck you dad!\"",
   "created_utc": 1692889602,
   "score": 8,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkpp66",
   "message": "After asking me if she could use a swear word, my at the time 9yo niece who was staying with us temporarily (it’s a long story) goes “Whoever in this house who doesn’t like Gravity Falls, get the fuck out.” So there’s that.",
   "created_utc": 1692895845,
   "score": 8,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk1e75",
   "message": "\"And I say to thee prithee, I go hither and dither, yet stand here, my breeches soiled\" - Said by random three year old outside a gas station at 4 am.",
   "created_utc": 1692886713,
   "score": 16,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkag5f",
   "message": "I let my 3 yo nephew play burnout on my psp (PlayStation portable, yes I’m old) \n\nHe was doing pretty decent for his age. But I noticed the boost meter was full. \n\nSo I asked him. \n\nWhy don’t you use the boost to go faster? \n\nHe said it was so he doesn’t crash.",
   "created_utc": 1692890189,
   "score": 6,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkdyni",
   "message": "My son, when he was 4, wanted to become funny.  He studied jokes for a couple of months.  We were out one day and he told a joke one time.  We both laughed.  He told the same joke again to a less enthusiastic reaction.  He paused in thought and then said, \"It's not funny anymore\".  I still chuckle at that.",
   "created_utc": 1692891490,
   "score": 4,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkl5nk",
   "message": "Y’all some liars 😂😂😂",
   "created_utc": 1692894137,
   "score": 9,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk65tg",
   "message": "\"Please leave this room.\"",
   "created_utc": 1692888563,
   "score": 4,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk9j30",
   "message": "In town on a late spring day, sunny and low 70s. National day (not US). Four jetfighters roar by as part of the parade. We're between buildings, so just a patch of sky. My oldest son, then 5: Dad, why did I see the airplanes before I could hear them?\n\nThat's a pretty profound observation for a 5yo.",
   "created_utc": 1692889843,
   "score": 5,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkb4j6",
   "message": "So I umpire baseball.  One game about 2 years ago I'm umping 11 and 12 year old kids.  The game isn't close, one of the team's pitching staffs just couldn't throw strikes.\n\nMiraculously in the 5th inning they manage to get 2 strikes on the batter.  The little catcher calls time and waddles out to talk to the pitcher.  He barks in his ear for a second and comes back to the plate.  Play resumes.  The next pitch is a perfect center cut pecker high fastball for strike three.  I'm blown away.  I lean forward and say to the catcher \"Hey, what did you tell your pitcher?\"\n\n12 year old catcher turns to me and says \"A magician never reveals his secrets.\"",
   "created_utc": 1692890441,
   "score": 5,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxknbua",
   "message": "A story from a friend visiting Ireland:\n\nA little girl is eating with her family at a restaurant and spills some soup on her shirt. She looks up and says, “for fuck sake, I can’t take meself anywhere.”\n\nI would have lost it if I heard that.",
   "created_utc": 1692894951,
   "score": 4,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkudvt",
   "message": "My partner’s four year old had just broken a small toy car I treasured and he came up to me and said “I’m so sorry, but I have a sad surprise…”",
   "created_utc": 1692897588,
   "score": 3,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl5uq0",
   "message": "My oldest daughter asked why I skipped a song and I  said because of swear words. She said, you send us to public school on the bus. What do you think will happen? Made me think more about what and why I choose to keep from them.",
   "created_utc": 1692901816,
   "score": 4,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk86ly",
   "message": "When my son was 6 he got home from an early dismissal day and I asked how was your short day of school? To which he replied: \"\\*sigh\\* long\"",
   "created_utc": 1692889329,
   "score": 3,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkb8g1",
   "message": "i called my niece a dork with a capital L (my older sister used to call me that) and she said uno reverse card. i will never live it down",
   "created_utc": 1692890481,
   "score": 3,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkj3zo",
   "message": "I forget, but I think it had something to do with wolves dying",
   "created_utc": 1692893378,
   "score": 3,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkjjy9",
   "message": "Mature and dark. My friends little brother was an actual psycho. He was maybe like 4, would say things like “Watch out I will stab you!” Then laugh hysterically. I told my friend I’m like bro get this kid away from me, and he just laughed like haha no he’s just playing. Like no he’s not lol.",
   "created_utc": 1692893543,
   "score": 3,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkobh3",
   "message": "Shut up I’m watching loony toons . \n\nWords to live by",
   "created_utc": 1692895326,
   "score": 3,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkweqi",
   "message": "When my kids were younger they went through a phase of calling me by my first name instead of Dad.\n\nOne day during this phase I was mad about something that wasn't important, and they told me in sibling stereo:  \"Mike, let it go.\"",
   "created_utc": 1692898330,
   "score": 3,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkwhmp",
   "message": "Well I don't know if I can say this here. I'll try to moderate it. When I was in my last year at school and some of us were visiting a primary school, I used a toilet there and overheard an amazing conversation between 2 girls I would say were 5 or 6. One said something like \"y'know boys have like a little finger there\" and the other said, without a hint of irony, \"I know THAT! That's their brain\". I thought How can a 5 year old be so knowledgeable?",
   "created_utc": 1692898360,
   "score": 3,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl4ogv",
   "message": "5yo: \"You're old!\".\n\nMe: \"I'm not that old (with a slight tone of indignation). How old do you think I am?\".\n\n5yo: \"The last number.\"",
   "created_utc": 1692901384,
   "score": 3,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl952v",
   "message": "My 8 year old cousin had a birthday party and she and her friends were in the house being loud kids. Her 10 year old brother came out to me and my parents and said “it’s getting loud in there, can I sit here with you?”",
   "created_utc": 1692903023,
   "score": 3,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxlmavy",
   "message": "I jokingly told my daughter if she swallowed watermelon seeds they would grow in her belly and she rolled her eyes and replied “No they won’t, seeds need sun to grow”",
   "created_utc": 1692907884,
   "score": 3,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxke3kk",
   "message": "Dad if God is so powerful why he doesn’t t get rid of the devil that creates so much trouble?",
   "created_utc": 1692891540,
   "score": 2,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkhkri",
   "message": "There was a kid who's mom said, \"Watch where you're going.\".  \nThe kid said, \"Thanks for reminding me about that.\"",
   "created_utc": 1692892809,
   "score": 2,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl2jqn",
   "message": "My son, he was probably 2 or 3.  I can't remember what he did, but I playfully called him a little shit.  He got serious, looked me dead in the eye and said \"I not a little shit, I a big shit!\"",
   "created_utc": 1692900586,
   "score": 2,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxjyqyb",
   "message": "My kid at age six:  \"Why do we have to die?\"\n\nBroke my heart that somebody at that age is already thinking in those terms.",
   "created_utc": 1692885638,
   "score": 4,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk1758",
   "message": "Once she burst into tears after a trifling quarrel with her husband.\r  \n\r  \nThe youngest son, still very young, hugged me and said:\r  \n\r  \n\\- Mommy, don't cry. Your children are alive and they are with you.\r  \n\r  \nGod, how embarrassing. And proudly: what a person is growing!",
   "created_utc": 1692886634,
   "score": 4,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxjwuil",
   "message": "I want to drive that plane",
   "created_utc": 1692884855,
   "score": 3,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk408b",
   "message": "Girl 1: Boys can’t marry boys and girls can’t marry girls\n\nMe (Their bisexual teacher in a conservative country): 👀\n\nGirl 2: That’s not true, you can marry whoever you want!\n\nGet et, ghorrl ✨",
   "created_utc": 1692887734,
   "score": 4,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkomnc",
   "message": "Any time I'm really overwhelmed or frustrated my 5yo son tells me \"It's okay Mommy. Don't get upset, just take a breath and count to 5.\" And then he'll rub my arm.\n\n\nSometimes I feel like I'm doing a good job.",
   "created_utc": 1692895444,
   "score": 2,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk04d4",
   "message": "Out for a walk with my middle son who was about 8.  We stopped on a village green in the Yorkshire dales to eat out sandwiches.  I had a pint of beer from the pub and he had a large orange and lemonade.\n\nAs we sat in the sun he looked at me with a big smile and said:\n\n“It doesn’t get much better than this, does it dad?”",
   "created_utc": 1692886204,
   "score": 5,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxjw1iw",
   "message": "My nephew once said \"We all gonna die one day, lets do something which make other remember us\".",
   "created_utc": 1692884517,
   "score": 4,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxjvvng",
   "message": "\"When I grow up. I'll make my mother proud\"",
   "created_utc": 1692884449,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxjzc21",
   "message": "[deleted]",
   "created_utc": 1692885883,
   "score": 0,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkj2ka",
   "message": "I heard a 6-year-old cuss someone hard",
   "created_utc": 1692893363,
   "score": 0,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxjygwo",
   "message": "I don't think i belong here on this post because i can't say something i have said is mature or intelligent, becsuse i am not the one who judges what is mature, just sometimes quietly if someone definitely isn't.",
   "created_utc": 1692885525,
   "score": 251,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk1x1y",
   "message": "„It is okay to be sad“",
   "created_utc": 1692886919,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk6qcq",
   "message": "https://youtu.be/3r4rS0yzQ1M?feature I always think of this clip from Man With Two Brains when this question is asked.",
   "created_utc": 1692888779,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxk7mqt",
   "message": "That's not nice!",
   "created_utc": 1692889120,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkaljx",
   "message": "Eat my shorts",
   "created_utc": 1692890245,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkbmr7",
   "message": "anything that comes out of Young Sheldon’s mouth",
   "created_utc": 1692890628,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkj9m5",
   "message": "My grandson. \"Skyrim is for the Nords\".",
   "created_utc": 1692893436,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkjf3e",
   "message": "“I don’t want to grow up. Being an adult doesn’t sound fun.” - My 4 year old",
   "created_utc": 1692893493,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkkhm8",
   "message": "When i was a kid in preschool (maybe i was 8-9 yrs old), my teacher takes a nap in our class while we're taking an exam and i asked her with pure innocence and respect \"mam flores? Why r u sleeping while my papa and mama paying you our taxes?\"\nOn the next day, my parents and teacher talked about what happened and my father is not scolded me, instead, he's still laughing and he tell all his friends about it.",
   "created_utc": 1692893891,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkkmwi",
   "message": "\"Gramma is crazy\"",
   "created_utc": 1692893946,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkkxju",
   "message": "\"I'm going to save it for later so I have something to think about.\"",
   "created_utc": 1692894056,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxklp5y",
   "message": "Dad, you're an idiot!",
   "created_utc": 1692894338,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkm14h",
   "message": "I can't remember exactly what but my 8yo son explained how something with Jupiter worked.",
   "created_utc": 1692894462,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkml1x",
   "message": "When I was in 5th grade, I explained one homework assignment with college level physics. I don't remember where I learned it exactly, but I checked my answer years later when we actually had that lesson in the school. I was in right, I calculated the needed force, velocity and all that for piece of an eraser that get to launched in the air and made an essay with proof that what I said was true.\n\nIt was easier to search it from online and calculate stuff than try to understand what the hell was written to our book, even then I knew that most of the stuff in there was either obsolete or wrong.",
   "created_utc": 1692894669,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkoa0r",
   "message": "Me and my son just left my ex husband and was living with my mom for about a year when my nephew called me crying and upset my sister and her boyfriend was fighting. And that he didn’t want them to break up because her bf is a good dad for him. My son asked to talk to him and at this point he’s about 7 and my nephew 10 and my son said it’s okay.. my mom just left my dad too but at least we have each other. It was so heartbreaking that because of irresponsible and unstable adults (including myself) they have to have these mature thoughts and feelings. It was something that made me want to be a better parent and auntie.",
   "created_utc": 1692895311,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkokxp",
   "message": "Any time my 5 yr old daughter starts a sentence with \"oh Daddy. . . .\" But in a kinda melancholy way",
   "created_utc": 1692895426,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkour7",
   "message": "\"The accident was 10 years ago, dad. It's time to let go.\"",
   "created_utc": 1692895529,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkpixc",
   "message": "Your heart is in my heart, and my heart is in your heart.  He was like 3",
   "created_utc": 1692895781,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkqjeb",
   "message": "5 year old nephew said recently \"*my first name* is always sad\" a few weeks ago. I think about it every day.",
   "created_utc": 1692896156,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkrdjq",
   "message": "My daughter asked me how much I love her. I said, “I love you infinitely. I am willing to give my life for yours.”\n\nShe (7yo) said, “I don’t want you to give your life for mine. If the situation comes up, you should give your life for my sister’s life. I’ve lived longer than her and enjoyed more of life than her.”",
   "created_utc": 1692896468,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkrgaw",
   "message": "niece told my sister, \" i dont want this dinner and you know if i cry you will make me a new dinner\" haha so wrong yet so hilarious.....",
   "created_utc": 1692896497,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkrzs7",
   "message": "“It’s not fair.  I didn’t do anything, but now I’m here and I’m afraid to die”\n\nMy mom told me I said this at age 4 and it struck such a nerve she brings it up every so often.",
   "created_utc": 1692896702,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxktbpf",
   "message": "Crocodile doesn’t start with a k dummy",
   "created_utc": 1692897195,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxktsqz",
   "message": "When my daughter was 4 ish she had a medicine prescription for something I can’t remember. She knew she couldn’t open it herself but saw that I could. She asked why. I explained that it was a child proof cap. So kids couldn’t open it themselves for safety reasons because medicine can also be dangerous. She thought for a beat and then asked “How does it know I’m a kid?”\n\nMight not seem smart at first but actually some pretty good critical thinking.",
   "created_utc": 1692897371,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkxdxl",
   "message": "At the time, I was a 20ishF with a pixie cut. Little cousin (3F) asked if I was a boy because I had short hair. Before I could answer, her 6F sister jumped in and firmly said \"no, she's a girl. Girl's can have short hair and boys can have long hair, anyone can have any kind of hair that they want!\" Their parents did (and are still doing) a phenomenal job.",
   "created_utc": 1692898687,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkxhgr",
   "message": "In reference to my nephews Dad, serving life in prison. Nephew was about 12.   \n\n\n*\"He's my Dad, I will always love him. But I will never like him. Maybe he did it, maybe he didn't, but he was still gonna hurt us or someone else in the end, God knew he needed to stay in prison, it's the only way for him to be a good person\"*",
   "created_utc": 1692898722,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkxhvj",
   "message": "Not sure if it counts cos t came from an email that made the rounds years ago but... When asked what love is, a child said it's when their name is safe in your mouth. (paraphrasing).",
   "created_utc": 1692898726,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkxmuv",
   "message": "why can't grownups just get along??",
   "created_utc": 1692898776,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxky2hq",
   "message": "When my youngest was two, she would say “I don’t know yet” whenever she didn’t know something. I loved that and still say it to myself sometimes.",
   "created_utc": 1692898935,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxkz562",
   "message": "\"Ruthkanda\"",
   "created_utc": 1692899329,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl0ak2",
   "message": "I don't even remember what the conversation was about specifically but I had said \"Early bird gets the worm!\" and my 6yo said \"but the night owl gets the snake.\"\n\nTf did he get that from?",
   "created_utc": 1692899744,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl0xz9",
   "message": "“hmm”\n\nkids aren’t very mature or intelligent so thats probably the most mature thing i have heard a kid say",
   "created_utc": 1692899984,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl15qj",
   "message": "\"I'm gonna jump.\"",
   "created_utc": 1692900063,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl173u",
   "message": "My buddy was teaching his daughter how to ride horses...she was probably 5 at the time,I asked her if she was scared of getting bucked off,she said \"No,I just close my eyes and wait until I hit the ground\"",
   "created_utc": 1692900077,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl2q1q",
   "message": "When my son was 5 (or so), he and his cousin were telling jokes back and forth. Variants of “Why did the chicken cross the road”. My son comes up with: “Why did the dinosaur cross the road? Because the chicken didn’t exist yet!”\n\nWe’d been reading about evolution, but I was still surprised by that one.",
   "created_utc": 1692900652,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl3dul",
   "message": "My nephew was 2. We were decorating the Christmas tree and the family dog was a bit nervous, because of the whole situation. My nephew said: \" No [dog's name], you can't help, for you have no hands! One needs hands for this!\" ( German original: : \"Nein [Name], du kannst nicht helfen, weil du keine Hände hast. Man braucht Hände dafür!\")",
   "created_utc": 1692900902,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl3kk8",
   "message": "Don't break heart ❤️",
   "created_utc": 1692900972,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl4qi7",
   "message": "Driving down a steep hill I said to my then 4 year old \"sometimes I like to pretend I'm on a roller coaster when we go downhill\". She replied \"sometimes I pretend I'm riding a ferris wheel made of bones\".",
   "created_utc": 1692901404,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl65s0",
   "message": "Was at a mother and toddler group about 30 years ago with my son playing with building blocks when another toddler joined us and started putting them together I asked if he was making a house with his bricks he replyed \" don't be silly i'm doing a detached building \"",
   "created_utc": 1692901929,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl78hl",
   "message": "My 6 year old daughter on more than one occasion asked why do we need to work and it’d be better if everything is free.",
   "created_utc": 1692902324,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxl84cx",
   "message": "A few years back at a particular low depression point, my daughter (then around 6 or 7) took my hand and told me she felt sorry for me.",
   "created_utc": 1692902649,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxlavr2",
   "message": "My 3 year old Brother Back then ii n the 2010s school really is fun.  You learn you meet your friends you have lots of vacation.",
   "created_utc": 1692903658,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxlesy1",
   "message": "Haha, kid's got his priorities right! Cheers to simple pleasures!",
   "created_utc": 1692905105,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxli3to",
   "message": "A 3 year old saw me crying and she came over to me, gave me a hug, wiped away my tears and said “it’s ok, you’re ok, everything is going to be ok. It’s ok to be sad sometimes, it’s ok to cry.” I’m a teacher by the way, it may not seem like much but… it was.",
   "created_utc": 1692906331,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxlk6er",
   "message": "I’m here for the r/wokekids material…",
   "created_utc": 1692907092,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxll5la",
   "message": "I’m here for the r/wokekids material…",
   "created_utc": 1692907456,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxlonh8",
   "message": "When my son was in 1st grade, he had a teacher that parents had raved about.  But my son (my \"easy\" kid who loved school!) did not seem happy.\n\nI finally asked \"*I'm so glad you're doing great in first grade! But--I don't hear you say much about Mrs. L !?\"*\n\nHis reply: \"*Mrs. L  is only NICE when grown ups are around. When they aren't, she doesn't smile and she doesn't help the kids who need help. I don't like that.\"*",
   "created_utc": 1692908762,
   "score": 1,
   "submission_id": "1601r82"
  },
  {
   "comment_id": "jxls17x",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1601r82"
  }
 ]
}