{
 "submission_id": "160bjfv",
 "title": "People of Reddit, what is the dumbest reason you got bullied for in high school?",
 "selftext": "",
 "created_utc": 1692905120,
 "permalink": "/r/AskReddit/comments/160bjfv/people_of_reddit_what_is_the_dumbest_reason_you/",
 "score": 144,
 "url": "https://www.reddit.com/r/AskReddit/comments/160bjfv/people_of_reddit_what_is_the_dumbest_reason_you/",
 "comments": [
  {
   "comment_id": "jxlfw3y",
   "message": "Because my mum died. Happened on the same day she died.",
   "created_utc": 1692905506,
   "score": 29,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlvz2j",
   "message": "For being quiet and kind.",
   "created_utc": 1692911532,
   "score": 211,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlr3v3",
   "message": "Having dark skin",
   "created_utc": 1692909685,
   "score": 96,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlwg67",
   "message": "I liked to wear cowboy hats for a while, then Brokeback Mountain came out and so did all the homophobes.",
   "created_utc": 1692911713,
   "score": 89,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlj7ya",
   "message": "Being kicked out and abused by my parents. Admittedly my sister (the 'golden child') was the primary reason. But still, yeah I got tormented because I was clearly the fuck up, even though I got straight A's in honors classes, and tutored several other students.",
   "created_utc": 1692906739,
   "score": 58,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxltgda",
   "message": "Cute you think there has to be a reason.\n\nAs far as I could ever tell, it was because they decided to.",
   "created_utc": 1692910571,
   "score": 165,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxluyzz",
   "message": "I got bullied for having black eyes from being bullied. It seemed unnecessarily recursive.",
   "created_utc": 1692911148,
   "score": 36,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlzg1l",
   "message": "For being sexually assaulted by the school jock.  Apparently me not liking being assaulted and threatened with rape meant I was gay. Those kids made my life a living hell until I moved away.",
   "created_utc": 1692912858,
   "score": 35,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxljblx",
   "message": "For \"being gay\". I'm not actually gay, my \"friends\" that started high school with me just carried that stupid rumor with them to high school and everyone believed it without question. I was called the F slur all the time, mostly online because these people were cowards.\n\nThis one is less stupid, more flat out cruel but I was struggling with my mental health and was mocked to the point where I decided to bottle it up because it was less exhausting to deal with than the bullying.",
   "created_utc": 1692906776,
   "score": 34,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxm5k9d",
   "message": "Having meth addicts for parents\n\n\nLike cool home was hell and school was hell\n\nNever got a damn moment of peace",
   "created_utc": 1692915292,
   "score": 31,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlkz2q",
   "message": "Not so much bullied, but I was teased by another Black kid because I was smart and got good grades. He used to run through the halls yelling that I “think I’m White”, even though I’m darker than he is. He was so full of self-hatred that he associated academic success and proper use of the language with being White. It didn’t bother me because I was also a really good athlete and well-rounded student. My self-esteem was solid. His opinion of me was irrelevant. Fast forward 40+ years. He’s now doing life in prison for murdering his former jail boyfriend and I’m an administrator in the very prison system under which he’s an inmate.",
   "created_utc": 1692907388,
   "score": 103,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlhj06",
   "message": "For being poor and not speaking English well. My mom packed these cheap microwaved weiners to school for me (only 2) and that was my lunch for a year. I was made fun of for eating \"dog food\". I also had only 2 outfits to wear to school so was made fun of wearing the same clothes over and over again.",
   "created_utc": 1692906115,
   "score": 26,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlwegk",
   "message": "My eyebrows.  4 years later my slightly thinker eyebrows were in style and I had people constantly saying \"I wish I had your eyebrows\" . At that point I realized how dumb fashion was. Now as a woman in my twenties I wear dad sandals and what ever shirt I happen to find that day in the clean clothes. I'm like super fashionable now.",
   "created_utc": 1692911696,
   "score": 23,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlndbn",
   "message": "Not bullied, but occasional comments like, “why are you so quiet? Why don’t you ever smile?”  Because I’m stuck here with you assholes.",
   "created_utc": 1692908283,
   "score": 55,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlyouw",
   "message": "Being a dwarf.  Not much I could do about it really.",
   "created_utc": 1692912565,
   "score": 36,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxltffa",
   "message": "Having numerous freckles all over my face, arms and body. It made gym class really painful. I was also into computers and games, and could care less about sports so they called me the f slur (I was not gay just not into sports).",
   "created_utc": 1692910561,
   "score": 17,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxm28he",
   "message": "There was no reason, no reason is required. I was weak, so I got bulliet, essentially for being me.",
   "created_utc": 1692913947,
   "score": 15,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlxqke",
   "message": "i was the weird kid. my still friend from high-school says i got along with everyone, except the bullies. im still really weird at 34.",
   "created_utc": 1692912199,
   "score": 15,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxls6kb",
   "message": "My race. Didn’t really go on for long but it happened",
   "created_utc": 1692910089,
   "score": 12,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlv3vh",
   "message": "In middle school some dumb redneck was trying to bully me for some reason, don't really know why he picked me but he kept ragging on me how poor I was.  I wasn't really reacting to him but finally a friend of mine was like \"Dude, I've been to his house, it's nicer than yours so STFU!\" and that was the end of it.",
   "created_utc": 1692911200,
   "score": 11,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmnlk8",
   "message": "I shared the same name as this bully. She insisted both of us couldn’t have that name and tried to intimidate me into asking our teachers to refer to me by my middle name. I told her off and of course that didn’t help. She only stopped after a laid back well liked teacher wrote her up for harassing my friend and I. She never even spoke to me after that.",
   "created_utc": 1692922861,
   "score": 11,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxm3a1n",
   "message": "I was from a poor family attending a middle class high school, made fun of my clothes",
   "created_utc": 1692914362,
   "score": 10,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlfgt2",
   "message": "I wore a snowmobile suit because I thought guys would like it. Other girls just roasted me for it",
   "created_utc": 1692905348,
   "score": 21,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlqmsv",
   "message": "Someone accused one of my friends of SA and was lying. Got flack for it for a month. Then everyone realized she was lying and people apologized to me.",
   "created_utc": 1692909505,
   "score": 8,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlyv3l",
   "message": "Oh I have one for this!! \n\nI got bullied by 3 of the popular girls in my middle school for being ‘too skinny’ (note the leader of these girls was very clearly anorexic, so I was more confused than anything) \n\nSame group also decided I was clearly born a boy because I was so thin that you could (just barely) see my voice box which was ‘clearly’ an Adam’s apple. I was like … 13 at the time? So barely in puberty, no development. I used to eat like I had never seen food before so I too was confused by my own rail thinness.",
   "created_utc": 1692912632,
   "score": 10,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxm3ns9",
   "message": "Because I was poor and couldn’t afford designer clothing and shoes",
   "created_utc": 1692914514,
   "score": 8,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmc7fb",
   "message": "I was a punk rock guy with a mouth FULL of braces. I had to wear headgear to school for the first couple of months. It sucked",
   "created_utc": 1692918019,
   "score": 9,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlf6uf",
   "message": "Not me. But girls at my school got tormented for having big boobs like isn’t that a good thing? I don’t get why",
   "created_utc": 1692905245,
   "score": 16,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmk8m5",
   "message": "I made varsity swimming my freshman year, actually never had to try out, just made varsity on previous times alone. The school changed the rules for me, as only juniors and seniors could be on varsity at the time. Of course, these 17-18 year olds couldn't have some puny, prepubescent kid absolutely smoking their times, so they did everything in their power to get back at me. Everything from exclusion to hopping into other lanes to putting Icy-Hot in my Speedos to derogatory comments, you name it. I didn't really care because I knew they were just jealous, but boy howdy did coach give a shit when he found out. He sat the whole team down and read them the riot act with me present and pulled to his side. It was an insufferable twenty minutes, but the ridicule stopped. Fortunately, for my even faster younger brother, things were way more relaxed when he swam his way onto varsity his freshman year a couple years later.",
   "created_utc": 1692921415,
   "score": 8,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlzvew",
   "message": "Because my voice has a nasal tone so I was called gay despite not being gay.",
   "created_utc": 1692913021,
   "score": 6,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlpx3s",
   "message": "Had a bully try to bully one of my friends... **for being a boxer.**\n\nit came to a close when the bully squared up and threw a fake punch in the hallway, He didn't realize the bully was faking him, slipped and just fucking DRILLED him in the side of the head.\n\n\u0026amp;#x200B;\n\nIt was quite bad actually, broken knuckle, bully got slept, blood in the hallway.\n\nand the sound... it was probably the cleanest contact I have ever head, every single molecule of my friends knuckle connected with that dudes head.\n\nThe bully fully deserved it though, maybe not at the time but he later S/A'd a girl I used to know",
   "created_utc": 1692909237,
   "score": 12,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlgqg1",
   "message": "For early years mustache but I’m a man.",
   "created_utc": 1692905819,
   "score": 6,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlwz1q",
   "message": "I have no idea. Just my demeanour I guess. I’ve always been different and kinda weird so people would talk about that.",
   "created_utc": 1692911912,
   "score": 7,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxm9va9",
   "message": "Reading books. Wtf.",
   "created_utc": 1692917051,
   "score": 5,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxma266",
   "message": "Wearing thrift store shoes (drug store shoes) on the bus by a guy",
   "created_utc": 1692917131,
   "score": 6,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxn3oyi",
   "message": "Having a vocabulary.",
   "created_utc": 1692929942,
   "score": 6,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmalbg",
   "message": "Being Mexican even though my family is from Spain...",
   "created_utc": 1692917353,
   "score": 5,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmb57x",
   "message": "I went to one of those Catholic private schools that made you wear uniforms most days, and on the last day of school for freshman year we were allowed to wear street clothes.\n\nNow, this was the early 90's and I wore what I normally wore at home, which meant I looked like an extra from the \"Smells Like Teens Spirit\" video. A group of mostly girls I'd known for literally 10 years decided to make fun of me for my torn jeans because according to them that meant I was poor.\n\nI said to them, \"Are you kidding me? Even if there was something wrong with being poor that justified making fun of someone for that, you've literally been to my house, you fucking morons.\" They clutched their metaphorical pearls and walked off in a huff.\n\nGranted, most of their families were way wealthier than my own middle-class family, but it seemed so stupid and pointless to try to make me feel bad because my clothes had holes in them.",
   "created_utc": 1692917580,
   "score": 4,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmkf45",
   "message": "This speaks to my age but we didn't have bullies waaayyyy back then.  (If kid did that, principal would call  his/her home and dad would be waiting with suitable punishment when kid got home!)  \n\nIn addition, parents/teachers taught that someone who wanted to behave as a bully was a straight up low-life!  Who wanted to identify with that!",
   "created_utc": 1692921493,
   "score": 6,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmkvo2",
   "message": "Not having designer branded clothes. Or what I had I wore constantly. Once washed it’d be hung by the fire to dry for the next day. I used to tell people I had two lots of same stuff.",
   "created_utc": 1692921692,
   "score": 6,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmme21",
   "message": "For being Jewish. The bullying was exclusively from Christian kids and their parents. Not only was I called a dirty Jew but a kid pulled my hair as his friend punched me straight in the nose to \"fix my Jew nose\". The worst was when I wore a skirt to school and 3 boys decided to rip it off as we were all getting off the bus to get to school. They decided to do it to see if my vagina was \"hairy like a Jew\". After that my parents pulled me out of school and I got my GED years later. I just remember crying about it for almost a year because those kids never got in trouble for it. Instead they were just forced to apologize which meant nothing because they were snickering the entire time. Their parents even said I deserved it because I was probably a dirty slut anyways. Let's just say I no longer practice the religion or even bother to follow the cultural stuff anymore.",
   "created_utc": 1692922342,
   "score": 5,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxllfdi",
   "message": "Wearing the same pair of jeans a few days apart. They tried to use that as an excuse to call me dirty. My response was, don’t you have the money to own a washing machine? \n\nMy friend got bullied for being born on February 29th In our friend group we made a big deal of their 4th birthday for their 16th. It was all in good fun. But someone else heard us and decided to try to bully her for being 4 years old. It was so stupid they didn’t last long with that either",
   "created_utc": 1692907556,
   "score": 5,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxltg6w",
   "message": "I sat in front of a bully",
   "created_utc": 1692910569,
   "score": 5,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlv5or",
   "message": "My nationality",
   "created_utc": 1692911219,
   "score": 4,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlvv6q",
   "message": "My birthmark on my neck",
   "created_utc": 1692911491,
   "score": 5,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlztz8",
   "message": "Existing",
   "created_utc": 1692913006,
   "score": 4,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlzuhg",
   "message": "I got bullied for saying I didn't like a lot of Eminem's music.",
   "created_utc": 1692913011,
   "score": 5,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxm138q",
   "message": "Just sitting there reading. For some reason this group of girls found this offensive and harrassed me for several lunches, escalating to throwing food trash at me.\n\nFinally one of them grabbed my book and threatened to tear it up. I stalked up to her, slammed a hand on her chest hard enough to slam her into the wall and hear her head bounce off of it, gently took the book from her and walked away. They still called insults at me after that, but never did anything physical again.",
   "created_utc": 1692913498,
   "score": 5,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxm832y",
   "message": "My hair, my ears, my nose, my height... They really didn't need a reason some people just pick on people because they feel so shitty about them themselves",
   "created_utc": 1692916316,
   "score": 4,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmg8pt",
   "message": "Maybe not the bullying we all picture in our minds, but I was alienated by this group of girls who I thought were my besties in the years prior. They full out ignored me when I talked to them, made group plans in front of me making it clear I wasn't invited, would very obviously talk about me in code words in front of my face. I heard them giggling to each other one time that the color of my new shoes looked like \"puke.\"\n\nI didn't really have anyone else so I still tried so hard to be their friend. Plus, our families were family friends and our parents all assumed we all got along together and I didn't want to be the one to ruin that perfect image. But yeah, that was probably the loneliest time of my life! \n\nAfter 2 years of this, they finally came to their senses and apologized to me. I remember running out of the cafeteria and crying with relief that finally! I have friends! Turns out I was too \"peppy\" and \"nerdy\" for them, which makes sense because they were all really into emo stuff, were starting to get into weed, and thinking not doing homework was cool. They were in their teen angst phase and I was still very much in the camp of I like my life, I want to do good in school, I want to make my immigrant parents proud. \n\nIn retrospect maybe I was that big of a noob back then, but I still don't think I deserved to have been treated that way because I was leading my life differently.",
   "created_utc": 1692919714,
   "score": 4,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlkspa",
   "message": "Because I was “on fire.”",
   "created_utc": 1692907321,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmaz8a",
   "message": "I was openly queer.",
   "created_utc": 1692917510,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmc23l",
   "message": "bro i get\nbullied bc i can play alot of instruments my fault for being musically inclined maybe if you’d put down the penjamin and pick up a hobby you would have a future",
   "created_utc": 1692917957,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmck8r",
   "message": "I have a large rack. You'd be surprised how many people are upset by this.",
   "created_utc": 1692918169,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmjcwi",
   "message": "Because I wore \"weird\" clothing. All of which has become so normalized no one would even believe me- Nirvana/Nine inch nails/Tool Tshirts, cut off jean shorts, \"weird\" tights aka colored tights. This was in the 90s. You would think these stereotypical \"alternative\" outfits would've been fine, but most of the girls bullied me relentlessly.",
   "created_utc": 1692921040,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmjdcb",
   "message": "For not knowing my pants size. For being skinny. For refusing to be racist. For growing up on a farm.",
   "created_utc": 1692921045,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmk3ij",
   "message": "I was having a hard 7th and 8th grade year with my “mother” already, as some mornings she would make me cry before entering the building. I never cared enough about how I looked, as long as I didn’t look so badly like a homeless hobo or something. Lot of the time, I just wore regular skinny jeans and a plain T or a hoodie. I never did anything with my hair, mainly cuz all the appliances were “my mothers” and “wasn’t allowed to touch them”. Same went with makeup, but I didn’t want to use it anyway cuz I had some minor acne issues on my forehead. ANYWAY, girl in my grade would legit go out of her way to make my last class of the day miserable. Would pick on me for my hair not being done (kinda a frizz mess, but again couldn’t touch the straightener), no makeup. She’d say “there’s no effort to your appearance”- like GURL, there’s no need or reason for me to give a shit about it, *I WAS 13-14 YEARS OLD*. She moved away sometime in 8th grade year, so I was content and able to move on a little bit lol",
   "created_utc": 1692921354,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmkmvd",
   "message": "Being a freshman.",
   "created_utc": 1692921587,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxml8ze",
   "message": "Pre puberty for being ugly and skinny;post puberty for being skinny. Midwestern US has a weird thing about making fun of skinny people.",
   "created_utc": 1692921852,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmmjfc",
   "message": "For being fat. By the other fat kid.",
   "created_utc": 1692922406,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmni3u",
   "message": "Red hair,  freckles, chubby, didn't have the name brands , you name it....\nAnd Jenny, you can fuck off",
   "created_utc": 1692922822,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmqzbx",
   "message": "Never bullied, but I laugh now when I see the school dickheads on social media thinking that they’re some sort of positive, progressive, humble person. Like fuck off, mate.",
   "created_utc": 1692924318,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxn2bkm",
   "message": "I have a list. Let's start in elementary school. \n\n1. For being tall: They accused me of being trans and said I was ugly for being tall\n\n2. For my parents divorce: I lost all of my friends because they were fed BS by their parents. One of my best friends came up to me and said \"you're going to hell because your parents got divorced, and I can't be friends with people who are going to hell\". \n\n3. Having a freckle on my right shoulder: yeah. I don't know what that was about. They accused me of keeping a piece of poop on my shoulder. \n\nMiddle school:\n\n1. For being \"trans\": I'm not. I never identified as trans ever in my life. Because I was tall, skinny, and liked rock music instead of fucking Taylor swift, apparently that meant I was trans. They bullied me relentlessly to the point where boys would try to pull up my shirt to see if I had boobs. \n\nHigh School:\n\n1. For being talented: people accused me of being a spoiled brat that didn't deserve the roles I got despite their own nepotism in the department I was in. I got made fun of for being a good singer, a good dancer, and a good actor. Like not just lightly teased, but full on harassed, cyberbullied, and physically intimidated. \n\n2. For dating my boyfriend: funnily enough, the popular kids at my school actually started being nice to me when I started dating my boyfriend. My friend group turned on me and made fun of me for dating someone who wasn't \"like us\". These were really close friends too.\n\nI could go on, but I don't want to cry",
   "created_utc": 1692929322,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxn4uoi",
   "message": "Aren’t they all dumb reasons",
   "created_utc": 1692930481,
   "score": 3,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlf3xl",
   "message": "being feminine",
   "created_utc": 1692905215,
   "score": 6,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxm3fyn",
   "message": "Had long hair",
   "created_utc": 1692914428,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxm9g3b",
   "message": "Having ginger hair. But jokes on them! Red hair is cool now!",
   "created_utc": 1692916877,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxma19s",
   "message": "Everything.\nSpoke fluent proper English.\nSpoke a different language.\nBeing naturally hairless.\nBeing short.",
   "created_utc": 1692917121,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmazlj",
   "message": "I got my period unexpectedly and bled through onto a chair",
   "created_utc": 1692917515,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmb7cp",
   "message": "Freaking out because my girlfriend attempted suicide. \n\nGot told that \"I'd try to kill myself, too, if I were dating you.\"",
   "created_utc": 1692917605,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmebjp",
   "message": "One time a girl told me I was just pretending to know who Robert Plant was and that I was too “plain looking” to know any of his songs. She said she “knew for a fact” I was pretending and that she could prove it. Lol. She never was able to provide proof.",
   "created_utc": 1692918910,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmft78",
   "message": "I got bullied in the fifth grade for being two things fat and Irish. When I was a little kid, I used to celebrate Saint Patrick's Day and be proud of my Irish heritage. Well, one particular St. Patrick's Day. I was telling everyone about how I was Of Irish descent and because I was a bit overweight people would call me leprechaun because I was fat and I was Irish. They did this for months and teachers did nothing about it back and I did try to get it to stop, it eventually led me to being depressed about my weight and I almost got sent to the mental institution for it, Now I laugh at the reason and I think it was silly",
   "created_utc": 1692919531,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmknml",
   "message": "Because they chose to",
   "created_utc": 1692921597,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmpgdi",
   "message": "Was super freaking nerdy and then suddenly got cute. 2 girls (and their friends) started bullying me because their boyfriends noticed me. \n\nOne girl put me in a headlock and tried to poison me in chemistry class by rubbing some random shit in my mouth. Good times.",
   "created_utc": 1692923656,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmpttm",
   "message": "I'm Mexican so I used to sport what they call the cow lick ( hair slicked back with tons of gel so it wouldn't move )",
   "created_utc": 1692923817,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmpzqe",
   "message": "Being fat, I mean I was a tubby lumpkins so i did laugh at some of the things they said.",
   "created_utc": 1692923888,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmq3q6",
   "message": "People called me stupid for asking philosophical type questions or spiritual type questions such as the meaning of life, etc... I got branded an idiot. People called me \"Forrest\" as in forrest gump. Then I went off to college and figured out I was actually fairly intelligent and built a reputation on campus amongst my professors. I always thought I was dumb until my professors gave me confidence. I then became that asshole in college who prevented a curve on every test because I would get 100 on every single test. It was a good feeling, a comeback story sort of. Teenagers are little pieces of shit",
   "created_utc": 1692923936,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmqnsn",
   "message": "Because kids smell anything different then them and decide to go against them. \n\nIn my case it was Asperger's and ADHD. \nSpent my whole life thinking i was doing something wrong. I got the diagnosis 3 months ago and it's been a wild journey of self acceptance for me.",
   "created_utc": 1692924179,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmqxxq",
   "message": "I didn't like a popular kid because he bullied me in 7th grade so I refused to speak to him and because he was able to get a bunch of people to make fun of me",
   "created_utc": 1692924302,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmt1ii",
   "message": "Not me but when my good friend used to sweat he would smell like maple syrup",
   "created_utc": 1692925216,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmvigu",
   "message": "For selling weed \u0026amp; being a whore... I was just a quiet kid who was a virgin \u0026amp; didn't try pot well into my 20's.",
   "created_utc": 1692926305,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmx9ux",
   "message": "Being pale. I'm not even *that* pale, just standard Irish pale. Got the nickname \"casper\" and \"ghost\" by grade 5, it stuck around all the way through high school.",
   "created_utc": 1692927082,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmy6do",
   "message": "I didn't swear.\nIt all came to ahead when a bunch of girls circled me and pushed me around chanting \"say bitch!\" \nAfter a few good shoves from them I grabbed a girl and bit her real hard. She screamed and yelled out, \"She's crazy! Run!\" And they all scattered and left me the fuck alone. Oh. But I do swear now.",
   "created_utc": 1692927482,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxn1hcr",
   "message": "Got called lesbian for all of my youth because my last name was Leslein….. lol makes no sense",
   "created_utc": 1692928947,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxn2n0k",
   "message": "Having pale skin with freckles.",
   "created_utc": 1692929463,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxn5m0v",
   "message": "For having really pale skin. Kids would call me Casper, a vampire or a ghost. They would also hold their arm up to mine to see the stark difference between skin tones and laugh. Constantly asked why I don’t just get a tan and explaining I just burn and fake tan makes me look like an Oompa Loompa. Snide comments yelled out by older high schoolers about never seeing the sun in my life.  Surprisingly wasn’t bullied for anything else despite being a rawr XD type of scene kid who wore ridiculous clothes and was pretty shy.",
   "created_utc": 1692930839,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxn6w4v",
   "message": "Because some people are just assholes",
   "created_utc": 1692931451,
   "score": 2,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmdvdi",
   "message": "Being fat.",
   "created_utc": 1692918720,
   "score": 0,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmfnr6",
   "message": "I had this really huge penis.  Everyone bullied me about how huge it was.  😪 worst experience of my life.",
   "created_utc": 1692919467,
   "score": 252,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxmt9gv",
   "message": "This couple threatened to sue me for harassment all because of me cussing and if I ever joked about anything, then they’d tell me opI’m offensive when I wasn’t. I also didn’t like the boyfriend because he’s very creepy and he was a junior and his girlfriend was a freshman and I think if you date someone, you should be in the same grade",
   "created_utc": 1692925312,
   "score": 255,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlexre",
   "message": "[removed]",
   "created_utc": 1692905152,
   "score": 1,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlhbms",
   "message": "Having gym at the same time as some 250lbs guy that was about 3 - 4 inches taller than me.",
   "created_utc": 1692906038,
   "score": 1,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlm0dp",
   "message": "Because my dog killed my cat",
   "created_utc": 1692907773,
   "score": 1,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxlu1rd",
   "message": "Wearing Walmart clothes",
   "created_utc": 1692910797,
   "score": 1,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxluvua",
   "message": "Because I sat on someone's bench when I just transferred to the school. You could've just asked me to move?? Be a decent human??",
   "created_utc": 1692911116,
   "score": 1,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxm0ffs",
   "message": "Being Asian?",
   "created_utc": 1692913240,
   "score": 1,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxm0vrj",
   "message": "Literally just existing",
   "created_utc": 1692913417,
   "score": 1,
   "submission_id": "160bjfv"
  },
  {
   "comment_id": "jxm0xa9",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "160bjfv"
  }
 ]
}