{
 "submission_id": "160cu4t",
 "title": "What is your most expensive mistake?",
 "selftext": "",
 "created_utc": 1692908088,
 "permalink": "/r/AskReddit/comments/160cu4t/what_is_your_most_expensive_mistake/",
 "score": 37,
 "url": "https://www.reddit.com/r/AskReddit/comments/160cu4t/what_is_your_most_expensive_mistake/",
 "comments": [
  {
   "comment_id": "jxlnjc9",
   "message": "Not buying a house when I was in the 3rd grade",
   "created_utc": 1692908345,
   "score": 245,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlnem2",
   "message": "Marriage",
   "created_utc": 1692908297,
   "score": 138,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm0elw",
   "message": "Student loans",
   "created_utc": 1692913231,
   "score": 158,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlumhj",
   "message": "In my early 20's I lived in a college town's downtown. My apartment was a six minute walk to my place of work and a five minute walk to my favorite bar. My favorite bar was right across the street from a massive parking garage that you could just drive out of after 10 pm without paying anything and because there was a severe lack of free on-street parking near my apartment I would often just leave my car in this garage for days at a time.\n\n\u0026amp;#x200B;\n\nWell one night I got off work around 4 in the afternoon and headed to my favorite bar and started drinking. By 9 pm I was doing shots of absinthe with my bartender friend at a different bar after he got off work. The next day I woke up with a massive hangover and was confused because I had obviously retrieved some things from my car at some point in the evening but had no memory of doing so. I walked to the garage to grab something else out of my car and couldn't find it. I walked all four stories of the garage multiple times and then eventually reported the car stolen.\n\n\u0026amp;#x200B;\n\nThe cops found it in a different parking garage one block away, parked and locked, and impounded it. I'll never know what actually happened but I'm pretty sure that instead of walking the five minutes home I got in my car, drove it out of the parking garage, realized how stupid it was to be driving as completely shmammered as I was, and parked it at the second garage. It cost me over $500 to get it out of impound.\n\n\u0026amp;#x200B;\n\nI don't drink anymore and I'm well aware how lucky I am to have not killed someone or myself and that $500 is nothing compared to the cost of a DUI.",
   "created_utc": 1692911016,
   "score": 85,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm8uqh",
   "message": "I stuck my dick in the bread slicer at work. It cost me my job and hers.",
   "created_utc": 1692916631,
   "score": 114,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlna50",
   "message": "Not getting a handle on my mental health when I was younger.",
   "created_utc": 1692908250,
   "score": 162,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlneld",
   "message": "I don't know if this is still a thing, but back when I was a kid, there were these \"talent agents\" that would \"hire you\" because you had the looks/talent to be a star. This was just a scam for you to pay them a bunch of money ( i think it ended up costing my parents around a grand) for acting classes that weren't real classes and other random fees.",
   "created_utc": 1692908296,
   "score": 56,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlr1kw",
   "message": "Drugs",
   "created_utc": 1692909661,
   "score": 28,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlopum",
   "message": "My ex",
   "created_utc": 1692908786,
   "score": 16,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlncbm",
   "message": "I bought a house in Colorado(I am European) because I thought I was moving in with someone I loved immensely. \n\nNot only did I not move in with said person, even after 4 months of trying to get him to, he never showed up. \n\nSo now I have a fully furnished and stocked home in a state I visit at will and whe´ my daily life back her in Europe allows.",
   "created_utc": 1692908272,
   "score": 18,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlnzaf",
   "message": "Bought a VR Headset",
   "created_utc": 1692908509,
   "score": 8,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm2rcl",
   "message": "Getting into high interest debt",
   "created_utc": 1692914153,
   "score": 9,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmng0y",
   "message": "I don't feel comfortable telling you the names of my kids",
   "created_utc": 1692922797,
   "score": 35,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxls6lv",
   "message": "I had a crew of 6 men run 120 feet of 6 inch cast Iron pipe for storm drains from the roof, before I looked again and instead of 6\" the blueprints said 8\".\n\nthis was hung from the ceiling off of scissor lifts.\n\nall the hangers and pipe had to be taken down and replaced with 8\".\n\nluckily they hadn't hung the who 300+ feet before I caught my mistake.\n\nI bought a pair of reading glasses and a magnifying glass the next day.",
   "created_utc": 1692910089,
   "score": 19,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlt811",
   "message": "Wife #3",
   "created_utc": 1692910483,
   "score": 12,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlp7gm",
   "message": "Being born",
   "created_utc": 1692908971,
   "score": 6,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlr9f6",
   "message": "Fucking up a paid of MOD Night vision. I didn’t pay due to their fault but the gen 3 I think would’ve costed around 30,000-40,000 to replace",
   "created_utc": 1692909744,
   "score": 3,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxltiyk",
   "message": "Bitcoin... I don't think I need to say more. I was young and stupid.",
   "created_utc": 1692910600,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmd5jx",
   "message": "My most expensive mistake is existing. Way too expensive.",
   "created_utc": 1692918418,
   "score": 5,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmety4",
   "message": "I joke that my wife and I both have an expensive mistake that we own up to.\n\nMy wife's mistake:  Me circa 2013, \"Hey, we have a spare room and I have an old gaming computer.  People are doing this internet money thing and it could be fun.\"  Wife, \"Thats dumb.\"  Me, \"Yeah, I'll just drink a beer instead.\"\n\nTo be fair I probably would have sold when they were worth a few dollars and thought myself a genius.\n\nMy mistake: Wife, \"They are selling the two story down the street.  We should buy it.\"  Me, \"That lady is an animal do-gooder.  I'm sure those walls are soaked in piss.  I'd have to pull out all the drywall and maybe the subfloors.\"  Wife, \"Yeah, I guess so.\"  The price?  120k.  It sold most recently for just over 500k.  That's yacht money.",
   "created_utc": 1692919124,
   "score": 43,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmfnye",
   "message": "Marrying my wife.\n\nShe's like tropical storm - came wild and wet, and when she left, she took the house and the car.\n\nI wish that was a joke, but wasn't.",
   "created_utc": 1692919469,
   "score": 94,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmlvbr",
   "message": "In 2009 (or so, can't remember the date, but sometime between 2008-2011) my buddy got really into Bitcoin.\n\nIt was back when bitcoin cost like, $5 per coin.\n\nI didn't understand it, I still don't really understand it. But back then, I had no desire to learn about this thing that seemed like a fad/scam.\n\nHe did, however, convince me to invest, if only to shut him up. \n\nSo I threw $50 his way and told him to get me 9-10, and he set me up with the bitcoins, and put them on a USB for me. Which, again, is another thing I didn't really understand or care about. \n\nSo I tossed that usb in a box and didn't give a shit about it. \n\nWhen I later moved, I was packing things, and came across the usb I had labeled with something stupid. I still didn't care about bitcoin, and offered it to the guys I was living with. \n\nI remember one of them saying \"dude, are you sure, bitcoin is at 10$.\" \n\nI truly didn't care enough to learn about bitcoin, or even what to do with the usb to get the bitcoins off of it (or whatever you do with it) to bother figuring out how to recoup my $50 so I shrugged, tossed it at him, and moved out. \n\nQueue... the years that followed when I learned that my apathy and laziness had me give away what could have been today, something like $350,000cad, or closer to $850,000 at it's peak. \n\nSo, yeah. \n\nMy biggest financial mistake was giving away that $50. Could have really used that $50 over the years.",
   "created_utc": 1692922119,
   "score": 225,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmmpyh",
   "message": "Thinking that Bitcoin was a tech fad wayyyy back when a single Bitcoin was $1",
   "created_utc": 1692922486,
   "score": 15,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmn0vk",
   "message": "My ex",
   "created_utc": 1692922616,
   "score": 3,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmn95v",
   "message": "Fucking up college",
   "created_utc": 1692922716,
   "score": 5,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmo0kj",
   "message": "Having a car repossessed a few years ago.  When this happens, you're not excused of the debt and still have to pay whatever is left after they auction your car off.  So, you still have a car payment, but no car to show for it.  I ended up still having to pay $8,000 and because I couldn't afford the monthly payments I ended up going to court and having my wages garnished.  I told them what I could reasonably afford to pay, judge ended up setting it at a rate of 25% of my earnings which is MUCH higher than I could afford, but I said fuck it let's just deal with it.  Was a very lean year until I got that damn thing paid off.",
   "created_utc": 1692923037,
   "score": 11,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm1l55",
   "message": "Trusting someone with an \"investment.\"\n\nBitch took everything.",
   "created_utc": 1692913693,
   "score": 6,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlqkyb",
   "message": "Going to the good college I got into instead of my local state school. Fuck student loans. You really don't appreciate how much of an anchor on your life and psyche it's going to be until it's too late.",
   "created_utc": 1692909486,
   "score": 12,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlrt5d",
   "message": "Built a house too low",
   "created_utc": 1692909949,
   "score": 3,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlnbtd",
   "message": "$2000 for a certificate that’s only good at the place I work at and I can no longer get the job that required it.",
   "created_utc": 1692908267,
   "score": 6,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxln265",
   "message": "[deleted]",
   "created_utc": 1692908167,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxltbc7",
   "message": "failed my first semester of college because i didn’t ask for help\n\nlost all my scholarships that paid 90% of my cost of attendance, wasted tens of thousands of dollars in student loans that semester and the next semester, had to pay extra loose fees for required remediation courses that had to be taken on top of (not instead of) my retakes that next semester that i had to take even more loans out for to make up for the lost scholarships",
   "created_utc": 1692910518,
   "score": 4,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlww06",
   "message": "My ex…",
   "created_utc": 1692911880,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlzk2z",
   "message": "All the alcohol and drugs.",
   "created_utc": 1692912901,
   "score": 4,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlno78",
   "message": "RUST, 20 bucks non refundable and only to find out my computer didn’t have enough ram after waiting 4 hours to load into a server, only for it to crash 😔",
   "created_utc": 1692908395,
   "score": 6,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm2ab9",
   "message": "Not pulling out of my ex",
   "created_utc": 1692913967,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlo42x",
   "message": "Just ripped the awning off the camper yesterday- I’m thinking that’s gotta be up there",
   "created_utc": 1692908559,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlwnuh",
   "message": "Destroying a public restroom's sink.",
   "created_utc": 1692911795,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm1tft",
   "message": "College",
   "created_utc": 1692913783,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlqozx",
   "message": "Hennessy xo bottle drop.",
   "created_utc": 1692909528,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlrl5g",
   "message": "This one time I was going to buy 100 bitcoin but I didn't because I was bidding on a rental property and $1200 was a bit much to spend on bitcoin right then. I did win the house auction and the house is worth more now but is isn't worth 2.6 million today.",
   "created_utc": 1692909865,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxltll6",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxly9l2",
   "message": "I work for a hospital and have done ambulance authorizations before. Couple of fixed wing aircraft ambulance rides denied due to a few different mistakes because I was new. Easy $500k down the drain.",
   "created_utc": 1692912402,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlybs3",
   "message": "Buying a car in Singapore",
   "created_utc": 1692912426,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlz2ew",
   "message": "Options trading.\n\nIt was late July and I had been closing out trades early because it’s better to have 50% and be certain than having to exit a trade.\n\nI decided not to close the trade on Thursday with 30% of the possible 100% because it was 1 day to wait and most or all the ones I got out early, I didn’t need to.\n\nWell, I forgot to check when earnings were coming in and it was Thursday night.  Pre-market looked real bad.  I didn’t think I would be in danger, but.\n\nI ran the calculations and there was plenty of risk if it kept going down.  I exited (bought my options back)\n\nWiped out my entire year to date earnings on my trades and I was up 54%.  That hurt but reinforced that a win, even small is a win",
   "created_utc": 1692912711,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlzv6m",
   "message": "Driving our 8 seater suburban through our garage into our house (When I was 15).",
   "created_utc": 1692913018,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlzz8s",
   "message": "All my takes are worth the same… 2 cents",
   "created_utc": 1692913062,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm12nd",
   "message": "Not me but my parents. Not putting a single cent away for long term medical care, no insurance for that, just a horde of money. Current count for that is about $32000.",
   "created_utc": 1692913491,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm1qhi",
   "message": "One toxic friend costed me my mental health. The most expensive “I allowed you too close” I’ve ever made",
   "created_utc": 1692913751,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm22wz",
   "message": "Married a gold digger",
   "created_utc": 1692913886,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm30xh",
   "message": "Girl friends",
   "created_utc": 1692914260,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm3lzt",
   "message": "Closing on the sale of my house in Feb 2020 while I was renting an apt in another state.\n\nOnly planned on renting 6-12 months. Completely missed out on house appreciation from the beginning of the pandemic today. The damn place was all paid off. Instead of renting for just a few months I now will feel lucky to just be out of the least at the end of the year. Found a house to buy but now in debt again. So yeah, this has been at least a 6 figure mistake. I wasn't trying to be a big deal, just wanted to not be miserable.",
   "created_utc": 1692914494,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm5898",
   "message": "The first time I towed a fully loaded trailer of lumber, I over corrected coming out of a turn and put my bosses 4 runner in the ditch and simultaneously destroyed the trailer.",
   "created_utc": 1692915154,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm5lmt",
   "message": "I bought a florist shop. Two years later we had a recession and I lost it and all the money that went into it. Flowers are a luxury item and people don't buy flowers in recessions.",
   "created_utc": 1692915307,
   "score": 8,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm5yn0",
   "message": "Law school.",
   "created_utc": 1692915453,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm7sft",
   "message": "marijuana addiction for 3 years. california dispensaries  have gotten a lot of money from me",
   "created_utc": 1692916196,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm8hdl",
   "message": "Doordash",
   "created_utc": 1692916479,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm8x43",
   "message": "Student loans for art school. What an expensive hobby...",
   "created_utc": 1692916658,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm9941",
   "message": "Buying a used Land Rover. Nothing but major issues and thousands spent on repairs",
   "created_utc": 1692916797,
   "score": 4,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm99r9",
   "message": "I worked for a marketing firm one time and accidentally spent an entire year’s Google Ads budget for one of our clients in one day.",
   "created_utc": 1692916804,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmcipq",
   "message": "Getting a dog.  One time I added up how much I have spent on our dog and had to quit when I started getting into the 30k range.  Between food, day care and walkers, vet bills, and on and on.  I could have both my cars paid off and have saved a chunk for retirement which would be worth far more than face value with interest.  All for a dog that groans when I make him get off my side of the bed so I can go to bed.  All said and done, probably a 6 figure mistake that I'm hoping to not do again.",
   "created_utc": 1692918151,
   "score": 8,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxluf5z",
   "message": "Exchanging sex from a 19F for her to use my car ever night, overnight. \n\nShe crashed the car after 90 days. It's been 13 months since I lost my car. I have a [Unagi Voyager](https://unagiscooters.com/all-access/checkout/original/?promo=SUMMERSIZZLER23\u0026amp;summerSizzlerBundle=1) which I love, and I've always love trains for public transit use. \n\nHowever.\n\nI'm still hurt by it all.  Every time i tell this story on reddit. I get murdered in the comments and the dislike button  since i'm a man, and she did nothing wrong because she was 19F while I was 29F at the time. As a result, i just stopped expressing this story and the pain from it all. \n\nShe crashed my car and got away with it because she is a woman andi i'm the villain because i am a man. \n\nThe financial cost was over $2000\n\nThe emotional cost was falling into depression and a lost of my social network. \n\ni lost my bbf in the world due to the constant fighting between my former bff and i. We fought because the 19F was using me and I told my BFF she didn't know what it was like to be lonely since she is a woman and has no idea what its like to be lonely. I meant that. I still mean it today. \n\nMy relationship with my mom is  still worst now due to my mom had to bail me out from the previous financial cost. \n\nand i am angry against all women as a result.\n\nJust a mess all around,",
   "created_utc": 1692910939,
   "score": 250,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm6jdx",
   "message": "Parking a car under a tree. It was the only spot left in my apartment complex’s parking lot, at 10pm. Cost me $450 for the broken window. (the insurance deductible was $500. Sigh.). A few weeks later, the management sent out a notice that crews were working to trim weak and dying trees.",
   "created_utc": 1692915686,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm73p5",
   "message": "Marriage",
   "created_utc": 1692915912,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm7xia",
   "message": "Last week I tried to drill a drain hole in my $600 air conditioner.  I accidentally hit some of the tubing, and released all the fluid.",
   "created_utc": 1692916252,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm8kgg",
   "message": "Trusting an accountant. Trusting a financial advisor. Going to college. And not trusting my gut to have a boat winterized. Record low of 17 in the last week of September. Had to replace the engine. That’s was dumb.",
   "created_utc": 1692916514,
   "score": 3,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm8o6k",
   "message": "Grad school",
   "created_utc": 1692916557,
   "score": 0,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm9685",
   "message": "My son.\n\nBut I love my dude.",
   "created_utc": 1692916763,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm96q8",
   "message": "Getting into cars",
   "created_utc": 1692916769,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlwi63",
   "message": "College",
   "created_utc": 1692911735,
   "score": 255,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm6qoq",
   "message": "Having a child (I joke I joke), yeah reddit is gonna downvote the shit out of this comment....  \n\n\nIn all seriousness forgetting the password to a stock trading program decades ago that my father put $1500 into and I was going to put that money into Lockheed Martin before they got the contact for the F-22, I knew they were going to win, the writing was on the wall.  \n\n\nFrom there I was going to invest in Boeing which was on its way to serious money with the 777, and then Nvidia. I have tracked what I COULD have made, its in the ball park of $100,000 easy. Which would have come in handy in 2015 when I was telling people to buy stock in AMD as Jim Keller was working on ZEN, people said I was stupid then... got the last laugh at least.",
   "created_utc": 1692915765,
   "score": 255,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxlnkhe",
   "message": "$1m into Amazon 40x rather than maximal $5m",
   "created_utc": 1692908357,
   "score": 254,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm0w1p",
   "message": "Kind of a first-world problem but was still expensive.\n\nHad our driveway resurfaced without prior HOA approval, cost $6,000.  HOA fined us $1,000 and refused to approve the change even though  three other houses on our street have the exact same resurfacing (apparently they filled out the request form first).  HOA threatened to fine us an additional $100/day until we removed the resurfacing, which would have meant tearing up and replacing the entire driveway and sidewalk.  Lawyer wouldn’t touch the case.  Ended up putting in a request to replace the driveway with brick pavers, HOA approved so we had it done.  Cost was another $7,700 for a total of $14,700.  Most expensive form I never filled out 🙄",
   "created_utc": 1692913420,
   "score": 13,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm9epj",
   "message": "Buying a PS4 even tho I would owe money for rent(which is a big no-no for me, even WAYY back then, but back then I was so impulsive and I didn't think I would save the money for one. It was soooo dumb)\nRent, bills, debts(no debt anymore thankfully!) but any money shit gets done first. Just a solid, set rule I always make sure to abide by. Never borrow money and if you do, always, always get it back asap.\nAnd it was only 25$ but I have severe ADHD and I just can't trust myself when it comes to money so big set rules go first.",
   "created_utc": 1692916861,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxm9t9i",
   "message": "Selling my condo 8 years ago to move in with my now ex gf.",
   "created_utc": 1692917028,
   "score": 12,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxma752",
   "message": "Fell flat on my face while over served at a wedding and broke my front tooth. Couple thousand dollars and probably a couple years to feel normal again.",
   "created_utc": 1692917188,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmak3m",
   "message": "Totaling my car",
   "created_utc": 1692917339,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmatjo",
   "message": "Buying a KIA",
   "created_utc": 1692917446,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmaul3",
   "message": "I rolled my first Saturn onto its side and totalled it because I couldn't see the curve in time due to some asshole's highbeams. It was raining and my car didn't have anti-lock brakes :/",
   "created_utc": 1692917457,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmbe8t",
   "message": "Buying a Mac for programming and then discovering that it’s very limited especially if you wish to have a program that works under windows and other platforms or processors.\n\n- it was a power mac.",
   "created_utc": 1692917684,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmbg2u",
   "message": "bought a balenciaga bag for 2k+, wasnt even worth the price for what it is, [Here it is](https://www.net-a-porter.com/en-gb/shop/product/balenciaga/bags/cross-body/le-cagole-small-studded-crinkled-leather-shoulder-bag/33258524072144139?cm_mmc=sea\u0026amp;vtp00=GOOGLE\u0026amp;vtp01=SEAU\u0026amp;vtp02=19744289666\u0026amp;vtp03=146059823226\u0026amp;vtp04=\u0026amp;vtp05=\u0026amp;vtp06=pla-1959203519250\u0026amp;vtp07=\u0026amp;vtp08=9045882\u0026amp;vtp09=\u0026amp;vtp10=g\u0026amp;vtp11=m\u0026amp;vtp12=649632376550\u0026amp;vtp13=\u0026amp;vtp14=pla\u0026amp;vtp15=702774963\u0026amp;vtp16=3074457345623142296\u0026amp;vtp17=GB\u0026amp;vtp18=en\u0026amp;vtp19=1959203519250\u0026amp;gbraid=0AAAAADRhZntlp1ChNYdogbPJuwr4DtT3F\u0026amp;gclid=EAIaIQobChMIvICK1rH2gAMVFfDtCh2FMgmlEAQYASABEgKBJ_D_BwE)",
   "created_utc": 1692917704,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmbnfc",
   "message": "Not taking better care of my teeth and drinking too much soda. They are in decent shape now but I've had to spend thousands getting them there.",
   "created_utc": 1692917788,
   "score": 15,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmc1c6",
   "message": "College",
   "created_utc": 1692917948,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmd8e5",
   "message": "Parking my car without looking for any signs and coming back from the beach watching it get towed",
   "created_utc": 1692918451,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmdoo3",
   "message": "Being born",
   "created_utc": 1692918641,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmdpdq",
   "message": "Getting married and divorced. Twice.",
   "created_utc": 1692918650,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmdzqs",
   "message": "I have kids",
   "created_utc": 1692918772,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmeggu",
   "message": "I spent about a year in this internship at one of those places that does, among other things, those DNA ancestry tests. I went to put a batch of test samples into a PCR machine which basically makes a bunch of copies of segments of DNA so that we can separate these cloned segments as a way of testing for specific genes. However, you have to add what’s called a PCR cocktail into the sample tubes otherwise it’s like putting a tray of cookie dough in the oven and then not turning it on. I forgot to add the most important ingredient when I made the PCR cocktail and then threw it out thinking what I had was just excess. This stuff is like $500 for a 10mL bottle and I just threw it out and ruined the samples.",
   "created_utc": 1692918967,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmehcm",
   "message": "Marriage",
   "created_utc": 1692918978,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmek4i",
   "message": "Bought a van from my father in law. Leave it there.",
   "created_utc": 1692919011,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmf1nt",
   "message": "Marriage",
   "created_utc": 1692919211,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmfodt",
   "message": "Bought a car with payments attached to it.  Ugh. Learned my lesson the hard way.  Never ever ever buying a car with a payment ever again.",
   "created_utc": 1692919474,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmg0xe",
   "message": "Co-signing for an ex gf's apartment.",
   "created_utc": 1692919623,
   "score": 3,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmg25v",
   "message": "My little brother was kinda new to snowboarding by the time I got really good. \n\nSo one day we were going down the mountain when we ended up going down a trail a little too difficult for him by accident. \n\nI thought about turning around… but decided it would be a good “trial by fire” situation which would only make him better in the long run. \n\nWell he made it all the way through the trail, and we were about 800 feet from the bottom of the mountain when our trail merged into another trail. \n\nWhere it merged was sorta a ledge about a foot high maybe. And my brother didn’t see it because I barely saw it and I was right in front of him.\n\nWell he went right off it, caught the front end of his snowboard and went face first into the ground. He didn’t move at all for a good 2-3 minutes before I took my board off and ran back up the hill to him. \n\nKid was all flushed in the face and disoriented, couldn’t even talk clearly and much less stand up and make it to the bottom on his own. \n\nSo we got the ski patrol to take him down the mountain and they called a ambulance. Turned out he had a bad concussion and they wanted to airlift him 150miles away to the nearest adequate hospital. \n\nThat… is…. Expensive… 30,000$ to be exact. Insurance only covered a little less than half, and that’s not even including the ambulance bill and the hospital bill. Luckily he only stayed overnight once before my aunt took him home\n\nMoral of the story: if you get a concussion… suck it up.",
   "created_utc": 1692919637,
   "score": 18,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmg7hc",
   "message": "My ex",
   "created_utc": 1692919699,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmgazn",
   "message": "Married the wrong person.",
   "created_utc": 1692919740,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmgcja",
   "message": "\"Friends\"",
   "created_utc": 1692919758,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmgh8h",
   "message": "Cashing out $9000 from my retirement. We were trying to buy a house. House fell through, my ex got injured at work and we used the money. Got rid of the cheating, lying, ex. To buy it back now would be almost $40K. Stupid love.",
   "created_utc": 1692919814,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmhaya",
   "message": "Wasting money on a huge wedding where barely anyone remembers anything. Should have saved it for a house.",
   "created_utc": 1692920167,
   "score": 7,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmhp32",
   "message": "Buying NFT's",
   "created_utc": 1692920333,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmhqq8",
   "message": "College.",
   "created_utc": 1692920353,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmhrgw",
   "message": "Marrying the cunt that is my ex wife",
   "created_utc": 1692920361,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmi98i",
   "message": "Currently shorting NVDA lol",
   "created_utc": 1692920572,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmib4k",
   "message": "Buying a house because it was in my new (now ex) boyfriend’s son’s school district.",
   "created_utc": 1692920593,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmim5j",
   "message": "Working the same dead-end job for 14 years.",
   "created_utc": 1692920723,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmintt",
   "message": "Agreed to Reno (finance) a house with a guy from church.",
   "created_utc": 1692920743,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmiwny",
   "message": "I was born in Turkey",
   "created_utc": 1692920847,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmj39l",
   "message": "I moved in with the wrong people and lost 95% of my posessions. It's a long fucked up story but basically they changed the locks while I was at work and I couldn't get to anything that proved I lived there and then they moved everything in a day with a moving service.. I can't even track them down because they were using false names and were apparently subletting instead of owning and they used false names when they rented the property. It was the most fucked I've ever been in my life.",
   "created_utc": 1692920925,
   "score": 54,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmj3wc",
   "message": "Paying for my live in boyfriends bills for twenty two month's because he didn't want to go to work and blamed it on his addiction to alcohol while he had a girlfriend behind my back. His half of the rent was a little over $8000. It felt like a good idea at the time to stand behind him and his addiction. I still have a hard time with this one.",
   "created_utc": 1692920933,
   "score": 8,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmj95w",
   "message": "Getting two advanced degrees in ministry.",
   "created_utc": 1692920996,
   "score": 6,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmja20",
   "message": "Divorcing a cheater. But worth every penny.",
   "created_utc": 1692921007,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmjnix",
   "message": "I took a leave of absence from massage therapy school. They said if you DONT call within 3 months to say you’re not coming back, you have to pay full tuition (10k and this was 2010). Well, guess who didn’t call within three months. The reason I even took the leave of absence was because I had attempted suicide. So I just wasn’t in the right headspace. Anyway, I finally got it all paid back a few years ago, but with no massage license to show for it.",
   "created_utc": 1692921165,
   "score": 16,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmjpfc",
   "message": "Marriage",
   "created_utc": 1692921187,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmjqwa",
   "message": "Refinancing my house at the beginning of 2008",
   "created_utc": 1692921204,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmjsyw",
   "message": "Liberal arts college degree.",
   "created_utc": 1692921229,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmk36n",
   "message": "DUI",
   "created_utc": 1692921349,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmk6ax",
   "message": "Always has been- trusting the wrong people! It’ll be my downfall. I think I’m starting to get overly paranoid and pushing people away. Not sure if that’s good or bad at this point 🫤",
   "created_utc": 1692921388,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmkbrc",
   "message": "Going to a 4-year State University straight out of high school. Cost me $11,000+ to get an 8-month education in alcoholism and depression before dropping out and going home. Those loans have ruined my credit for the last 30 years because I was too poor or too immature to pay them back in a reasonable manner until recently. I don't own a home yet because of it, and now my basic retirement plan is to die at my desk. That decision made a big hole to dig out of.",
   "created_utc": 1692921453,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmkhoz",
   "message": "Taking out a 4,000 euro loan while in the grips of a manic episode. Still paying it off nearly 2 years later. May not seem like a huge debt to some people but I still cringe when I think of it. The restrictions/isolation of Covid 19 had me literally going insane and it culminated in a huge spending spree in a desperate bid to feel something other than crushing anxiety.\n\nI'm thankfully on a more even kneel mentally these days but every time I look at my Nintendo Switch Lite I get reminded of my own idiocy. Fortunately, the repayment rate is not too bad- 40 quid to the Credit Union each week is a small price to pay. I'll be tied to the debt for a total of around 5 years but I always pay my dues.",
   "created_utc": 1692921524,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmkmrd",
   "message": "College",
   "created_utc": 1692921586,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmkn8z",
   "message": "Becoming addicted to Honkai star rail",
   "created_utc": 1692921592,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmkvg2",
   "message": "Wasting 12 years of my life on a degree and career that did literally nothing for me but took everything it could.",
   "created_utc": 1692921690,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxml9k1",
   "message": "My ex",
   "created_utc": 1692921859,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmld4h",
   "message": "Mentioning back pain to my doctor",
   "created_utc": 1692921901,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmlnxj",
   "message": "Bought a house in 2012 that was a complete money pit. Mold. Asbestos. You name it. Put over 100k into that house and then sold it years later for just about what I paid. Still kick myself but learned a lot.",
   "created_utc": 1692922031,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmnlcg",
   "message": "Continuing to exist.",
   "created_utc": 1692922859,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmnli8",
   "message": "Mitsubishi Galant.  Worst car ever.",
   "created_utc": 1692922861,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmnme7",
   "message": "stonks",
   "created_utc": 1692922871,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmo82e",
   "message": "$60000 of student loans when I could’ve got away with 2/3 of that at most.",
   "created_utc": 1692923126,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmodck",
   "message": "Sallie Mae",
   "created_utc": 1692923190,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmokgu",
   "message": "Mine isn't as bad as the others here but might as well share my dumb mistake. Quite a while back I bought a car from a state auction, it was 2006 Lincoln Zephyr, which is the same thing as the MKZ but they named it different for that year. Well anyways it was a police impound and at the state auction I was able to get it for 2K. Since it was a auction you don't really get much time to look it over and..  well it wasn't in bad shape. Long story short I ended putting more money than I wanted into it and when I finally sold it I barely got the 2k back. Regret that one lol",
   "created_utc": 1692923275,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmou5l",
   "message": "Getting my car towed twice in less than a week🥴",
   "created_utc": 1692923391,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmoula",
   "message": "Study overseas without a scholarship. I went to a country that have higher currency than mine in a hope that I can stay permanently in that country. Very expensive mistake.",
   "created_utc": 1692923396,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmox8b",
   "message": "I've made some pretty poor car choices, hard to pin point which one was the worst.",
   "created_utc": 1692923427,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmp7bm",
   "message": "You...",
   "created_utc": 1692923548,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmp7bp",
   "message": "Didn't change mailing address when I moved.  So I didn't receive certified letters from debt collectors.  Lost two houses and had to buy them back from collections agencies for approx $80k.  One was for a $12.50 HOA fee from over four years ago (2019).",
   "created_utc": 1692923548,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmp8sx",
   "message": "Breaking a dental hand piece😭😭😂😂",
   "created_utc": 1692923565,
   "score": 1,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxn0o8m",
   "message": "Chasing girls and relationships in my teens , twenties,  and early thirties out of immature neediness. Burned a lot of bridges and hurt a lot of people. That and just being brutally immature to begin with.",
   "created_utc": 1692928582,
   "score": 8,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxnc56u",
   "message": "Divorcing a cheater. But worth every penny.",
   "created_utc": 1692934094,
   "score": 5,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxnb5rj",
   "message": "My piece of shit college degree",
   "created_utc": 1692933579,
   "score": 3,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxnjj3e",
   "message": "Dating the wrong girl....for too long....and not having the self respect to end it when I should've...",
   "created_utc": 1692938270,
   "score": 3,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxn2gmf",
   "message": "Probably accidentally winning something stupid in an auction that I shouldn’t have bought, that was several thousand US dollars. A few years later I was able to sell it for about half of what I paid, which was actually more/easier than I was expecting, but it still cost me a few thousand. \nAlso more recently, I made reservations at a hotel that I meant to cancel for last weekend. I usually set reminders to cancel when I do stuff like that, but for some reason I didn’t set a reminder and forgot that I booked the hotel. I didn’t realize until I was charged for the first day. I was able to cancel the subsequent days, but I still had to pay around $700 for the first day for 2 hotel rooms and I was very upset that I didn’t remember or didn’t have a reminder to cancel it ahead of time.",
   "created_utc": 1692929384,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxn3alg",
   "message": "Spending a few thousand dollars on trade school only to give up and flunk out",
   "created_utc": 1692929760,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxn409b",
   "message": "trusring my ex",
   "created_utc": 1692930086,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxn5pad",
   "message": "My marriage. Divorces are hard and expensive",
   "created_utc": 1692930883,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxnf09z",
   "message": "university",
   "created_utc": 1692935645,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxnh27c",
   "message": "drug addiction",
   "created_utc": 1692936811,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxno8cc",
   "message": "Picking the wrong partner",
   "created_utc": 1692941259,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxn6ciz",
   "message": "Thinking an old ass white judge would understand or listen to a young black woman. This probably goes for politicians as well.",
   "created_utc": 1692931192,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxnb8fn",
   "message": "2 DUIs. You're talking over 20k after it all adds up.",
   "created_utc": 1692933617,
   "score": 2,
   "submission_id": "160cu4t"
  },
  {
   "comment_id": "jxmt5a3",
   "message": "Not me but everyone else I’ve seen: kids",
   "created_utc": 1692925261,
   "score": 1,
   "submission_id": "160cu4t"
  }
 ]
}