{
 "submission_id": "160i22y",
 "title": "Men, what was the most awkward thing to happen at the urinal?",
 "selftext": "",
 "created_utc": 1692919777,
 "permalink": "/r/AskReddit/comments/160i22y/men_what_was_the_most_awkward_thing_to_happen_at/",
 "score": 246,
 "url": "https://www.reddit.com/r/AskReddit/comments/160i22y/men_what_was_the_most_awkward_thing_to_happen_at/",
 "comments": [
  {
   "comment_id": "jxmh4y1",
   "message": "Old dude (like really old) fumbled his belt at the urinal and his pants dropped to the floor. Then he farted so nasty I swear he shat himself.",
   "created_utc": 1692920096,
   "score": 20,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmkfk5",
   "message": "Not sure this qualifies because the other person was in a stall while I was at the urinal. But anyways, one day at work I go to the urinal and start pissing, a few moments later I hear the sound of a woman moaning followed by the dude in the stall exclaiming “God Damnit” while he dropped his phone on the floor with the porn still going.",
   "created_utc": 1692921498,
   "score": 224,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmgj32",
   "message": "Locking eyes with the other guy for a split second. It’s customary to always look forward but it just happened.",
   "created_utc": 1692919836,
   "score": 128,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmkktu",
   "message": "I was in a club once and saw a guy I knew at the end urinal(there were three I went to the opposite end of course) he was ridiculously drunk, so drunk he didn’t see me come in or say ‘Hey[guys name]’ and what he proceeded to do shocked me to this day. My man stood there eyes closed urinating, took his left hand and put his hand down the back of his jeans, swiped his butt like a credit card, then sniffed hard on this fingers. You might think that’s bad however he then took the same hand, squeezed it down the front of his jeans and sniffed even harder. The worst part was that on each grand inhale he was groaning incredibly loud. He managed all of this whilst peeing by the way, didn’t spill a drop. \n\nTo this day he doesn’t know I saw it, he most likely still does it, and I get a great big kick out of seeing him knowing what I know, seeing what I have seen",
   "created_utc": 1692921562,
   "score": 44,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmo92k",
   "message": "I work in IT. \n\nIdiot strolls up to the urinal next to me and starts to aske about some ticket he had submitted.\n\nFuck off, Ron. Neither the time nor the place.",
   "created_utc": 1692923138,
   "score": 225,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmma8v",
   "message": "A lady came in to change her toddler's diaper because the line to the women's restroom was long.\n\nShe was offended at anyone who even glanced in her direction and also seemed offended that the men in the stalls wouldn't stop pooping so loudly. \n\nAnd the longer she was there and the more angry glances and disapproving grunts she gave, the more the men in that packed bathroom kept awkwardly staring back.\n\nFinally, as she left, she mumbled loudly at how the Men's bathroom didn't have a couch to rest on, but she wouldn't want to stay anyway because it smelled like poop in there. \n\nAnd that's how I learned the women's bathroom there had a couch.",
   "created_utc": 1692922296,
   "score": 29,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmguf5",
   "message": "No dividers, splashing a dude in flip flops 💦",
   "created_utc": 1692919970,
   "score": 151,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmntch",
   "message": "some guy complimented my watch while I was holding my johnson.",
   "created_utc": 1692922952,
   "score": 63,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmjgo2",
   "message": "I was at a Rolling Stones concert and looked at the urinal next to me. There was a girl sitting on it taking a piss. She happily says \"Hello!\" to me and I just shrug and laughed. The line for the women's room was insanely long and I admired her gumption to take care of her business.",
   "created_utc": 1692921085,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmlvix",
   "message": "People who try to start a conversation. What the fuck man.",
   "created_utc": 1692922121,
   "score": 41,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmrtzj",
   "message": "I was at the far left urinal. There were six urinals. He came to the one next to me and peed. Inexcusable.",
   "created_utc": 1692924687,
   "score": 187,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmr6uw",
   "message": "Las Vegas casino. Drunk guy in a suit and tie stumbles up to the urinal, let's fly with a horse piss and a huge sigh of relief, rhen proceeds to loudly \"wet shit\" his pants. \n\nEveryone starts laughing, including him. Then he tries to zip up, but stumbles backwards and lands on his ass. Which made him laugh harder and the result was more wet shitting. \n\nGot out of there quickly and saw a drunk woman in a dress asking every guy leaving the restroom if her husband passed out in there.  \n\nYeah, that marriage was off to a wonderful start! 😄",
   "created_utc": 1692924409,
   "score": 69,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmks84",
   "message": "med student dropped a (cadaver's) penis into the bowl and says \"not again \"  : edit :  okay y'all want the story.. 'associate' of mine in med school was doing \"gross anatomy\" iow learning how to cut open dead bodies,  he smuggled a penis out of the lab, went down to the public and,,, the screaming was heard outside (note: this was decades ago,and I don't think he finished school)",
   "created_utc": 1692921651,
   "score": 228,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmn5or",
   "message": "Getting pissed on from behind because drunk ass mofo didn't realize the urinal was already being used.",
   "created_utc": 1692922674,
   "score": 55,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmgq5q",
   "message": "I farted. It echoed.",
   "created_utc": 1692919919,
   "score": 254,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmopwt",
   "message": "My brother was 20 years old, and he knew our dad was a few seconds behind him going into a grocery store bathroom. So my brother quickly pulled his pants and underwear all the way to the floor, with his bare ass hanging out while using the urinal, just to fuck with Dad. Dad was not behind him. It was a stranger, who saw what seemed to be a fully grown, half naked mentally disabled man at a urinal.",
   "created_utc": 1692923340,
   "score": 235,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmsdoe",
   "message": "This wasn't awkward but pretty awesome, so I have to share. I was at a Polyphia show, and the bathroom was completely full. While I was at the urinal, someone started singing the Halo theme. Next thing you know, the entire bathroom was singing it in perfect tune, and with the ambient reverb of the bathroom, it was epic.",
   "created_utc": 1692924925,
   "score": 186,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmnqma",
   "message": "I was at a work training a number of years ago, and had been taking notes on a netbook (10 inch laptop). During a break I stopped at the restroom. While I took care of business, a colleague approached the urinals, and after a brief hesitation he asked, “how do you get anything done with that little thing?” I looked down, shrugged, and said “I don’t know, I guess you just get used to working with what you’ve got.”\n\nI flushed, washed my hands, and just as I was about to open the door, it hit me. “You were asking about the computer, right?”\n\n“Sure,” he says.\n\nI brought a bigger laptop on the next day of training.",
   "created_utc": 1692922920,
   "score": 130,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmpg4d",
   "message": "Got pee on my feet and I was wearing sandles,  worst part was I didn't start peeing yet...",
   "created_utc": 1692923653,
   "score": 222,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmrl9a",
   "message": "Guy told me my watch was off by 5 minutes.",
   "created_utc": 1692924583,
   "score": 111,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmgt9p",
   "message": "Some dude beside me was super wasted and this was a urinal that didn’t have those little “walls” separating each one and he stumbled sideways and almost knocked me over mid-pissing. Miraculously I somehow didn’t piss anywhere but in the urinal, drunk guy pissed all over himself however",
   "created_utc": 1692919956,
   "score": 93,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmlt0k",
   "message": "The year was 1981 and I was 7. I was at a Winnipeg Jets hockey game with my dad (first game I'd ever gone to and I still have the ticket stub somewhere). \n\nDuring an intermission I had to go pee. Dad and I walked to the men's room and he stood in the corridor waiting for me.\n\nI walked in and went up the troughs (they didn't have proper urinals) and proceed to have a pee. Suddenly a man in drag runs in like his life depended on it, pulls up to the trough right next to me, lifts his dress and let's out a huge gasp of relief as he had a piss.\n\nI can't recall any other guy I've ever stood next to for a piss, but trust me, I'll never forget this guy.",
   "created_utc": 1692922091,
   "score": 250,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmi7lq",
   "message": "I'm a 27 year old female with no boy parts and no children. I work in a group home with three disabled men whom I am legally required to accompany into bathrooms... Probably the time there were no stalls available and my client needed to pee. It was just urinals open. I wasn't even aware he didn't know how to use his fly because there were always stalls for him to use. I shit you not, he dropped his pants AND underwear... Right there... Hairy ass and all 🤦‍♀️",
   "created_utc": 1692920553,
   "score": 51,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmoan7",
   "message": "If I am next to a friend of mine and random civilians I ask my friend “Does this rash look normal?”",
   "created_utc": 1692923157,
   "score": 53,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmp3w3",
   "message": "Seeing poop in a urinal. Some people are fucked up.",
   "created_utc": 1692923506,
   "score": 220,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmk6ww",
   "message": "Omg my aim was totally off at a Starbucks washroom once and I peed on someone's foot, so embarrassing :)",
   "created_utc": 1692921395,
   "score": 24,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmqhbt",
   "message": "Old men who do the arm lean while pissing and rip farts that can blow out an eardrum",
   "created_utc": 1692924100,
   "score": 124,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmw6qm",
   "message": "I got all liquored up, went to piss, didn't take my dick out and pissed my pants.",
   "created_utc": 1692926600,
   "score": 195,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmwa1d",
   "message": "I was at a bar at one of those damned piss troughs, and some guy a lot more confident than me unleashed a stream so intense that I swear the majority of it splattered onto my legs and feet. I was wearing shorts.",
   "created_utc": 1692926641,
   "score": 147,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmo0ak",
   "message": "Guy asks to snort a line of coke off my erect penis. It was awkward as hell, especially for the guy already snorting a line off my penis.",
   "created_utc": 1692923034,
   "score": 64,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmmyx3",
   "message": "I was twenty years old. It was at the bowling alley.  It was one of those little ones mounted kind of low.  I was wearing khakis.  I had to pee so bad it hurt.\n\nI let the stream loose and was immediately met with piss splashing all over the fucking place.  It got all over my pants.  I took a step back but it didn't help.  I was already doused by the time I figured out what the fuck was going on.  Some asshole put a penny under the edge of the plastic mat.  That creates a little lip which causes all sorts of splashing.  It sucked a lot.",
   "created_utc": 1692922592,
   "score": 84,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmuvzl",
   "message": "There was a public restroom in an old local theater that had rows of urinals mounted back to back on a knee wall that was only about 4 feet high. So as you stood there doing your business if you looked up, you'd be face to face with another guy doing the same thing.  Weird.",
   "created_utc": 1692926029,
   "score": 183,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmkgho",
   "message": "A reacharound",
   "created_utc": 1692921510,
   "score": 11,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxml5o5",
   "message": "Dropping the damned phone in.  Rattle, splash, Oh Shit.  Awkward.",
   "created_utc": 1692921813,
   "score": 58,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmxfv3",
   "message": "Me and my friend drove across country once for a concert when we were 16. We were stuck outside waiting in line, and we were clearly the youngest people there by a good 5 years, so we were trying to act super mature in conversations and stuff.\n\nWe went across the street to take a piss in a grocery store bathroom with a bunch of other concert goers, and some massive gangster looking motherfucker walks in (picture Thundercat mixed with Ving Rhames), goes \"Damn, gotta piss like a muthfuka,\" and when he gets up to the urinal next to me, he lets out the squeakiest little fart that lasted like 15 seconds, went through 7 different octaves, and echoed through the entire bathroom. I swear I tried to hold it in, but eventually the guy on the other side of me started cracking up and I did too. Everybody in there left that bathroom cry laughing.",
   "created_utc": 1692927158,
   "score": 225,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn4acw",
   "message": "I was at the piss troffe at Tiger Stadium on a very cold night. I was trying to navigate my way through my layers of pants, long johns and underwear and I noticed the dude next to me kind of give me a weird look. I immediately said.. I found the neck I just don't know witch way to go to get to the head.....",
   "created_utc": 1692930216,
   "score": 70,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmotv8",
   "message": "I was taking a piss.\nSome lads are arguing behind me. A scuffle breaks out.\nI'm trying to finish quickly and GTFO of there without pissing all over myself.\nSomeone hits someone.\nI look down and that someone is laid unconscious at my feet.\nI finish up, step over sleeping guy while others are screaming and holding each other back.\nI leave, dry.",
   "created_utc": 1692923388,
   "score": 234,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmpaj6",
   "message": "Was at a bar with my brother and friends. I decided to go use the bathroom when 2 drunk girls walked in to peek at every guys member. They were completely wasted and kicked out after that.",
   "created_utc": 1692923586,
   "score": 59,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmpk0h",
   "message": "Not the urinal but, was sitting on the toilet finishing up, when the stall next to me closes and I hear a lady jabber. We walk end up walking out at the same time and she was BEET RED. Saw her in the parking lot later, crying, and thought saying something but couldn't think of anything to say.",
   "created_utc": 1692923700,
   "score": 27,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmrg40",
   "message": "At Burning Man, at a trough style and a woman in fishnets comes in, turns around, drops the fishnets, bends forward and pees backwards into it just like it was nothing at all. Guys on either side look at her, look at each other and we just decided it was not really a big deal.\nThat one's on my mental highlight reel.",
   "created_utc": 1692924522,
   "score": 32,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxms44x",
   "message": "When Star Wars, Episode 1 came out I was in High School. My friend and I made a plan that we would prank someone at the urinal afterwards...\n\nHe went on the left of an old man, I went on the right. I said:\n\n\"C'mon, Eli, you know I can't pee if you didn't...\"\n\nHe groans, \"Ugh! FINE! Doo dooooo **doooo** d-d-dooooo dooooo\"\n\nI start peeing, saying \"Pew! Pew!!\"\n\nThe old man between us starting laughing so hard he had to stop peeing and move to another urinal.\n\n🧡👍🏻",
   "created_utc": 1692924809,
   "score": 7,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmt2qq",
   "message": "I don't use those. Even if I gotta piss, I'll go into a stall.",
   "created_utc": 1692925230,
   "score": 4,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmzntp",
   "message": "Any time I've ever had to use a trough urinal was more awkward than anything else.",
   "created_utc": 1692928138,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn0moa",
   "message": "Its always awkward when you roll up and the first guy hasnt started yet, cant start now, and you have to pee knowing he hasnt peed, then he pretends to jiggle, wash his hands and leave in shame. \n\nLike dont worry about it dude. Just stand there until you do pee i dont care 🤷🏼‍♂️",
   "created_utc": 1692928562,
   "score": 61,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn3mwu",
   "message": "At a concert, the line for the women was so long that the ladies that were either drunk or didn’t care went into the men’s, turned around, either hiked their skirt up, or pants down, and went. So when it was my turn I’m standing there doing my business, I’m next to a really hot girl with her skirt pulled up taking a leak just having casual conversation with her.",
   "created_utc": 1692929917,
   "score": 75,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmgrt3",
   "message": "Crossed streams.",
   "created_utc": 1692919938,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmznyf",
   "message": "At a rest stop when I was a teenager. Older guy just kinda hanging around the bathroom. Some friends and I were on a trip home and friends boyfriend and I had to go. The rest stop was empty other than us. We walk in and this guy follows us in. I whip my dick out and start pissing and realize this guy is at the urinal next to me. I then feel his gaze on my penis, look over and this dude is staring at it like he’s trying to make it levitate. I was so uncomfortable lol. I was not great at advocating for myself at that age so I just zipped up and hurried out of there. \n\nWell, my buddy was taking a shit in a stall. He told me once we were in the car that he realized when I left the bathroom he thought “fuck, I hope this guy isn’t peeping through the crack of the stall looking at me”. So he fixed his eyes to be able to see out of that thin area the cheap American stalls have and sees this old grey beard just licking his lips watching him shit. When they made eye contact the dude got spooked and ran out of the bathroom. \n\nThe experience didn’t weird me out that much consciously, but for years after I got stage fright every time I had to use a urinal when someone else was next to me. If it was a crowded event and the bathrooms were packed, forget about it.",
   "created_utc": 1692928140,
   "score": 137,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmlzbx",
   "message": "I had some guys kid trying to look at my...thing...the dad screamed at him and I quickly got out of there.",
   "created_utc": 1692922166,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmotdk",
   "message": "“It’s so thick my wife would love you, we’re swingers do you want to….”",
   "created_utc": 1692923382,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmv70b",
   "message": "Guy next to me said....\"Nice watch\"",
   "created_utc": 1692926165,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmpmfc",
   "message": "I thought i had a big cock…8 inches…a bunch of us co-workers went to a Nascar race, drinking having fun.  between segments we all went tomthe bathroom….just a long trough on the wall. Our coworker who has a black dad and lilly white mom pulled outmhis dick to pee and said loudly “there ismis motherfuckers!”  We all looked over because he raised his voice.  He had 12 inches at least hanging out, soft….\n\nwe were all intimidated as Hell.",
   "created_utc": 1692923728,
   "score": 254,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmhz68",
   "message": "When the person next to you says, “I don’t have one of those.”",
   "created_utc": 1692920451,
   "score": 0,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmx7ln",
   "message": "My best friend held my dick as I peed and I held his. We were both 22 and very drunk at a convention. We did it to weird out the teenagers in the bathroom.",
   "created_utc": 1692927054,
   "score": 0,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn0bkn",
   "message": "I am 67 years old. Nothing awkward ever happened.\n\nPull your dick out and piss.\n\nYou are awkward.",
   "created_utc": 1692928428,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmj4gu",
   "message": "Two sissies walked up on either side of me and started pissing too in the same urinal",
   "created_utc": 1692920939,
   "score": 245,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmj2kc",
   "message": "At least most places have dividers now but it's always awkward.",
   "created_utc": 1692920917,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmoi67",
   "message": "A guy beside me was complaining that the water was cold...take it how you will",
   "created_utc": 1692923247,
   "score": 2,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmpdo0",
   "message": "It hasn't happened yet, but one of the local restaurants has the urinal right in front of the sink, which of course has a full mirror in front of it.  The urinal has no divider between the urinal and the sink/mirror.\n\nI've only needed to use that urinal a couple of times, and by chance, no one else has been in the bathroom at the same time, but I'm sure it has happened to other guys where one is at the urinal, and one is at the sink.",
   "created_utc": 1692923623,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmprvj",
   "message": "I was offered my first full time legal job at a urinal.  I walked away thinking, “Did that really just happen?”",
   "created_utc": 1692923794,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmpvxr",
   "message": "I was working at Target at the time. Stopped to take a piss, same restroom customers use. As I was peeing I saw something from the bottom right corner of my eye. I looked, and a boy, probably 10-11 years old was straight up leaned in watching my dick piss. He looked scared I was gonna yell at him or something once I caught him. I walked out bewildered, guess he was super curious idk.",
   "created_utc": 1692923842,
   "score": 150,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmr0ov",
   "message": "I peed in a really low urinal at the movies and it bounced back onto my pants and I never noticed until I walked back out",
   "created_utc": 1692924334,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmr52d",
   "message": "At a minor league baseball game, a really drunk old dude stood right next to me at the trough, even though there was plenty of space, and started talking to me.  He asks me some question, forgets that he's midstream, and turns towards me to hear the answer.  I realize what's happening just in time to jump back. For a horrible moment he was pissing parallel with the trough onto the floor, my stream was going under his into trough on the ground, and he's staring right at me with an inquisitive look waiting for me to answer how I thought the Dodgers were going to do or some shit like that. Almost crossing the streams with that guy is probably the worst bathroom experience of my life.",
   "created_utc": 1692924387,
   "score": 168,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmru98",
   "message": "The stupid urinal on campus can be seen from a cafe lobby if the door opened all the way and someone used the handicap door opener while I was using it so the whole cafe saw me taking a piss, nothing wrong with it but damn who designed it like that????",
   "created_utc": 1692924690,
   "score": 61,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmsdoc",
   "message": "This kid talks about an awkward urinal moment in his video diary entry\n\nBehold: the pee fight\n\nhttps://m.youtube.com/watch?v=bybmhr8REkM",
   "created_utc": 1692924925,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmshex",
   "message": "When there is no dividers and people just look at others dick for no reason. Are you tryna compare yours to mine or something?",
   "created_utc": 1692924972,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmsjb2",
   "message": "Hey, I like your peepee",
   "created_utc": 1692924995,
   "score": 5,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmsmgj",
   "message": "First time visiting home city in many, many years, I didn't think anyone else was in the diner's restroom with me, and I involuntarily blurt out \"fuckin' \\_\\_\\_\\_\\_\\_\" (insert city name there where I was back at). \n\nGuy in the shitter, who I didn't know was in there, pipes in with extra things to say about it, we have a nice conversation about it, and then I wash up and leave.  Never saw the guy, don't know what he looks like - and I'm sure he was left guessing who he was speaking with when he stepped out of the bathroom.",
   "created_utc": 1692925034,
   "score": 28,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmstz7",
   "message": "Someone tried to share my urinal. She made a mess of things.",
   "created_utc": 1692925125,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmsvdv",
   "message": "One of the standard asshole moves that people would pull in my catholic grade school was to grab a guy by the shoulders mid-stream and spin him sideway so he would soak the guy next to him.  Fisticuffs would often follow.  Eternal vigilance was a necessity.",
   "created_utc": 1692925143,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmsyrz",
   "message": "I was at a baseball game, line of wall mounted urinals. The kind that don't go to the floor. Some random guy announces we should have a Piss Contest and starts backing away, mid stream. He probably gets 4 or 5 feet away continually hitting the urinal. I couldn't stop watching the display of accuracy and pressure. I look right and the guy next to me raises his eyebrows in agreement. The human body is capable of impressive things!",
   "created_utc": 1692925183,
   "score": 92,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmt1gg",
   "message": "He looks over the barrier and says: nice cock bro.",
   "created_utc": 1692925215,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmt2es",
   "message": "I had a guy masturbating LOUDLY in a stall at the North Station, in Boston. I brought my kid in there (he's 11, so old enough to know what the Hell was going on). \n\nThe guy was making a fuck-ton of noise in there, and by the time we realized what was happening, it was too late to turn around. As I entered the bathroom, a guy in his 70s came walking out wide-eyed and gave this, \"what in the fuck\" look (which makes me laugh a little bit when I think about it)\n\nMy kid was in the urinal next to me and kept laughing every time the guy made a noise. I was like, \"SHHHHH!\", because the last person I want to have to fight, is some homeless psychopath that is masturbating in a train station bathroom.",
   "created_utc": 1692925227,
   "score": 36,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmt2ls",
   "message": "The CIO of my company walked in with a cookie in his mouth, slapped me on the shoulder, said “Hi” and then started talking about the size/flavor/texture of the cookie.",
   "created_utc": 1692925229,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmt5b2",
   "message": "Mfs who feel the need to drop their pants completely or lift their shirt up and expose their bellies. WHY!? you're a grown ass man why are you peeing like a toddler.",
   "created_utc": 1692925262,
   "score": 10,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmtyf8",
   "message": "Working as a bouncer, I commonly got asked if I had cocaine, or knew where to get some, while taking a piss break. Idk if that counts, but it's more memorable than any specific interaction, and it's ALWAYS awkward.",
   "created_utc": 1692925617,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmtzxa",
   "message": "Peed in myself.",
   "created_utc": 1692925636,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmu3r1",
   "message": "Once an old supervisor in my building used the one next to me. This guy chewed tobacco and like other guys, spit in the urinal. Sometiems when you chew you ger bits of tobacco on your tongue or lip so youll notice them spitting a lot to get it off. So he was doing this aggressively with his dick out while he cussed at his own dick and grunted painfully. Im like 95% sure now that he had stones or an enlarged prostate and was tired of the ordeal of just pissing, but icwas 19 and didnt know about any of that. I knew it had nothin to do with me so i left quietly. Im certain he didnt even notice me he was so in the dick rage zone",
   "created_utc": 1692925682,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmu79q",
   "message": "I had a guy put his hand on my shoulder while I was mid piss. I’m gonna go with that.",
   "created_utc": 1692925724,
   "score": 53,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmuhb5",
   "message": "Um there was a fight back in highschool in the bathroom and while they were grappling they pushed me against the urinal while i was using it. My dick touched that cold, cold ceramic and everyone got a little bit of my pee on them.",
   "created_utc": 1692925847,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmuiip",
   "message": "Either the time at the gay dance club where a guy in leather pants and a leather vest stood perpendicular to me and just starred me up and down.\n\nOr the time at a gas station where a guy looked me up and down because I'm very tall and apologized and made it even more awkward.",
   "created_utc": 1692925861,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmuwsa",
   "message": "Might not be that bad in the eyes of others, but *people starting conversations.*\n\nIf I got me ol' chap in my hand I don't wanna be conversing with a bunch of old dudes.",
   "created_utc": 1692926040,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmv3qd",
   "message": "I once had a split stream go sideways and I peed on the guy next to me.",
   "created_utc": 1692926125,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmv7kp",
   "message": "Peeing in a crowded bathroom and having to share a dividing wall with anyone over 6’1",
   "created_utc": 1692926172,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmvcnk",
   "message": "*Joe Wilkinson has entered the chat",
   "created_utc": 1692926234,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmvjff",
   "message": "Basically finding a Lego minifigure in the urinal today",
   "created_utc": 1692926317,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmvplf",
   "message": "there were shrimp in the urinal watching me",
   "created_utc": 1692926394,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmvpol",
   "message": "I always say, “Oh my god. That burns.”",
   "created_utc": 1692926395,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmvss8",
   "message": "dude was grabing another dudes ass in an empty spot in the shopping bathroom. they stoped and stood ankwardly together when they noticed me.",
   "created_utc": 1692926432,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmvxp4",
   "message": "Guy beside you takes a drink from your stream",
   "created_utc": 1692926491,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmw9zc",
   "message": "Guy in his mid 30s looked at me and said “Hm, big enough..” (I was around 13-14 at the time), dude next to him punched him since I was a minor and he was just laying knocked out on the bathroom floor with his dick out.\n\nEdit: Dude who punched him was a complete legend, this happened at the movies and he bought me some chocolates and a Tango Ice Blast for the movie after the incident.",
   "created_utc": 1692926640,
   "score": 220,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmwm2e",
   "message": "Guy next to me didn't try to hide the fact he was trying to be a pecker checker",
   "created_utc": 1692926788,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmwno3",
   "message": "Whenever you’re talking to the guy next to you, then you instinctively turn his direction and piss on his leg. 🤣",
   "created_utc": 1692926808,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmwtop",
   "message": "I guess just starring and smiling and wash your hands then smile again then leave like you ain’t never gonna see him till your next life",
   "created_utc": 1692926881,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmwxig",
   "message": "Went to the urinal at a restaurant and a kid around 12-13 that may have been on the spectrum greeted me while we both used the urinal and then proceeded to invite me to his house to play Minecraft and gave me his full address.",
   "created_utc": 1692926930,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmx1dg",
   "message": "I once was working on a project that a number of colleagues and I were stuck on and had a breakthrough while at the urinal. I said out loud “Wow, that’s incredible!” while shoulder to shoulder with someone else….",
   "created_utc": 1692926978,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmx4rc",
   "message": "Stood at the urinal.\n\nPooped.\n\nConfused.",
   "created_utc": 1692927020,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmxbqz",
   "message": "I feel like I should have a rancid memory to plug here, but I must have suppressed them all.",
   "created_utc": 1692927106,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmxf5u",
   "message": "No weird stories for me, but I get lots of compliments about my wristwatch.",
   "created_utc": 1692927149,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmxng9",
   "message": "Looking at my phone, tried to do the flip from vertical to horizontal, botched it, trying to catch it and ended up grabbing dudes leg next to me, phone hit the floor, luckily dude understood, \"fumble\", \"illegal use of hands\" he laughed, I laughed I dried my pants under the air dryer",
   "created_utc": 1692927254,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmxp77",
   "message": "Had a very large, extremely flamboyant twink dude look over and say in a terribly creepy voice, \"I could break a tooth off on that!\" I've never wanted to viciously attack somebody more in my life. But he was genuinely far too large in stature. And I wasn't about to get my ass kicked by a big dude wearing sparkle fairy wings. (I was at the bar Gay 90s in mpls during an event with friends)",
   "created_utc": 1692927275,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmxywi",
   "message": "Paul Lynde on tip-toes trying to see my c*ck and giggling in that creepy way did on television.",
   "created_utc": 1692927392,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmxz0j",
   "message": "Accidentally dropped an E Into the trough. Had to scoop it out and scrape off the wet stuff. Still worked though, happily.",
   "created_utc": 1692927394,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmy2lu",
   "message": "I was at the urinal at a Barnes and noble. Some weird dude was massacring the toilet. He got done, stood up, let out a massive burp came over to the other urinal to pee on the floor, farted, then left. It was bizarre. One of those \"this isn't really happening\" moments.",
   "created_utc": 1692927437,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmy3uw",
   "message": "There was a \"tink\" sound that made me and the guy next to me believe one of us had passed a stone without realizing it... But neither of us felt anything. Weird convo to have during and while washing hands.",
   "created_utc": 1692927453,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmycsb",
   "message": "I was in my late teens, don't remember why but we had gone to have lunch at a BBQ place, with my parents. While I was peeing, a younger kid comes in, takes the next urinal to the side, looks my way and says \"hey, how come your penis is that big?\".\nAwkwadest thing that has ever happened to me, to date.",
   "created_utc": 1692927561,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmyfql",
   "message": "Bootcamp. Night watch patrolling the barracks. RDCs came in and demanded a tour of the barrack room. Get to the bathroom and this dude from somewhere in Africa was bare foot washing his feet in the urinal, scrubing with the cake. RDCs were trying to act tough but were mostly just bewildered and cracking up telling him to knock that shit off. Next day our Chief clowned him in front of the whole division. I'll never forget you Alibi.",
   "created_utc": 1692927597,
   "score": 51,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmyhdt",
   "message": "So I got into a fight in high school over a urinal. It was an old school that had like 12 urinals in a row. I was at the last one in a corner. This kid comes into the bathroom and comes to the urinal next to me instead of the farthest away like anybody else would do. Words were said and punches were thrown. Fucking urinals",
   "created_utc": 1692927618,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmyhxn",
   "message": "That I went into the men's room and no one expected it.",
   "created_utc": 1692927624,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmyhyc",
   "message": "I drunkenly peed on the feet of the guy next to me. \n\nHe was so drunk he didn't care that much, luckily. I bought him a beer and we were good!",
   "created_utc": 1692927624,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmyjpu",
   "message": "“Nice day ain’t it?” \n\nDawg, even as a bbq-and-chicken-wing-eating southerner, there’s a time and a place to be southern. The bathroom ain’t one of them places.",
   "created_utc": 1692927646,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmylfx",
   "message": "The water was so cold I got frostbite",
   "created_utc": 1692927668,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmynrq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmyq91",
   "message": "Stuck at the door",
   "created_utc": 1692927727,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmyypw",
   "message": "Some dude came up to the urinal next to me and just dropped his pants and underwear, I was in Jr High at the time. Wtf man.",
   "created_utc": 1692927829,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmz0je",
   "message": "One time, I was peacefully taking a shit at work. I hear the door open. Someone gets in the stall next to me. I hear the door open again, and the guy in the stall starts dropping the biggest, wettest, loudest shit I believe is possible, and the guy at the urinal said, \"C___ is that you?? I haven't seen you in years!\" The man stopped mid shit pulled his pants up, and they gave each other a hug and left the bathroom without washing their hands. Also, I'm 99% sure he didn't wipe at all.",
   "created_utc": 1692927851,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmz1nv",
   "message": "In an airport bathroom. Old dude a few stalls away looms at me, smiles...all while stroking himself. Nope...zipped up real quick. .outta here.",
   "created_utc": 1692927865,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmz47y",
   "message": "I had to go pee after a long journey from Florida to Georgia and back to Florida so we stopped at a gas station and I found the bathroom do I went in and found the only urinal and I did my business and when I flushed and went to wash my hands and then I realized my brand new 250 dallor shoes where being squirted on faster then a of model by urinal water and my piss I had to look the cashier with the straightest face in the eyes as I walked out I was like 13 or 14 at the time",
   "created_utc": 1692927897,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmz4uh",
   "message": "I don't typically get \"stage fright.\"  But one time I had just stepped up to the only urinal in a Burger King bathroom (I stopped in because I had to pee).  A guy came in with a little boy on his shoulders.  Where he was standing the boy could see past the privacy screen right at my business.  I just froze.  Couldn't do it.  The little boy went \"Daddy, that man can't pee.\"  Zipped up and hustled out head down.  Had to stop at the next fast food restaurant so I could finally pee.",
   "created_utc": 1692927904,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmz6rd",
   "message": "2019 and I was finally going to take that dump after a week and 3 surgeries. I wasn't allowed to go alone so I hit the call button and a woman I went to school with 20 years ago was my nurse. Instantly recognized each other and stood there like \"what now?\" I hopped out of bed, said \"long time no see\" and limped my way over to the bathroom and she was like, Oh yeah, job stuff. I finally blasted ass and it was glorious. Haven't seen my shitmate since.",
   "created_utc": 1692927927,
   "score": 120,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmz8n0",
   "message": "Literally had the dude at the urinal next to me shamelessly look over the divider between us so he could get a good look at my junk. I was working at a hotel and using the bathroom there when this happened. So I just finished my business and walked out. I used another bathroom close by to wash my hands then I went and notified security. Shit was really awkward.",
   "created_utc": 1692927950,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmzdok",
   "message": "At a baseball game, stream came out an at unexpected angle, ricocheted directly onto the leg of the guy next to me.",
   "created_utc": 1692928012,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmzno1",
   "message": "Sophomore year of high school, went to go take a piss and ended up seeing some kid with his bare ass out while he drained his lizard",
   "created_utc": 1692928136,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmzq4x",
   "message": "I decided to stay over one more night at my girlfriends house before driving back to my college town Monday morning for class.  I got up Monday morning, jumped in my car, drove five hours nonstop to my little college town, parked my car, ran up a hill then five flights of stairs, and - with just minutes left before the start of my class - dove into the bathroom.  I unzipped and started to relieve myself in the urinal when everything went black.  Next thing I know, our Chinese exchange student was shaking my shoulder as I lay on the floor with my penis hanging out of my pants and a wet patch running down my pant leg.  The poor guy hadn't learned the right words for this  situation... I said thank you and sheepishly snuck into class.\n\ntldr; drove 300 miles before running up a mountain and passing out mid-stream in front of exchange student.",
   "created_utc": 1692928166,
   "score": 38,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmzqp3",
   "message": "I walked into the men’s room at a movie theater to find a young girl seated on a urinal, using it as a toilet. I pulled an Abe Simpson and walked right out, haha.",
   "created_utc": 1692928174,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmzr7u",
   "message": "My son (4yrs) and husband using side by side urinals and my son looks over at my husband and says \"wow dad how do you hold that thing up its huge\" my husband came out of the bathroom laughing so hard",
   "created_utc": 1692928180,
   "score": 66,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmzs0j",
   "message": "At a rock concert at Winterland in San Francisco, must have been 1977-78.  Bathrooms were notorious.  Taking a leak and two women come in and vomit all over the place, including on my dick.",
   "created_utc": 1692928189,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxmzsf9",
   "message": "Was in a crowded bathroom with one guy who seemed to be a drug addict (dressed in sort of a hip hop style with Tupac bandana covered in sores) who was high on something. He kept talking very loudly to anyone he could trap. As I was finishing up he said \"gonna get laid tonight that's for sure.... but is it gonna be chick's or dudes\" haha made me soooo uncomfortable",
   "created_utc": 1692928195,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn03nt",
   "message": "Old people that walk in, two stalls already in use out of three with the bro code Middle stall not being used. Old guy walks in “is this where all the dicks hang out” as he shamelessly parks up",
   "created_utc": 1692928332,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn03yh",
   "message": "“Nice watch.”",
   "created_utc": 1692928335,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn055d",
   "message": "had an old dude stare at my wang",
   "created_utc": 1692928350,
   "score": 1,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn055z",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn6dpq",
   "message": "some dude comes up to the urinal right next to mine, even when the second one over was free.  starts pissing with one hand on his meat, from about a foot away from the urinal, twig and berries on full display. leaning back too, not even remotely trying to shield himself from my view.  i finish first and go to wash my hands while wide eyed at the sheer confidence of this guy, only for him to rip a dubious fart at full volume. not a word spoken the entire time, that guy couldn't give a shit. i left the bathroom laughing my ass off at the sheer power of this guy. a very fond memory of mine.",
   "created_utc": 1692931207,
   "score": 101,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn9d21",
   "message": "I was on a road trip with three buddies going through Virginia when we decide to stop and take a piss at a rest stop. To our surprise the rest stop was extremely busy, I’m talking old dudes everywhere, gotta wait in line for the urinals kinda deal. It’s silent in there except for people pissing and my buddy and I get urinals right next to each other. We start pissing and my buddy looks over at me and meets my eyes, and then loudly exclaims “woah dude, nice cock”. Needless to say you could hear a pin drop in there. I genuinely don’t think I’ve laughed harder and been more mortified at the same time.",
   "created_utc": 1692932661,
   "score": 249,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn6fa0",
   "message": "1) in Jr high another kid offered me candy\n\n2) ozzfest Frisco, TX the one year ozzfest was only one concert instead of a tour. the line was hella fucking long to take a piss. I finally get to the front of the line to see every other urinal is empty. I straight up turned around and yelled at the line! EVERYOTHER URINAL IS EMPTY AND THEY ARE ALL HOMOPHOBES. \nI led the charge to piss in between two dudes and everyone in line followed suit. I wasn't about to miss Metallica over standard rules",
   "created_utc": 1692931228,
   "score": 51,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn8h8f",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn1cmx",
   "message": "I was hitting up the bathroom after a movie, standing at the urinal doing my thing. I hear some one come in behind me the stand right next to me. I look over and it’s a little kid no more then 5yo all alone and he has wiener out but he’s on his tippy toes leaning against the urinal and resting resting his wiener on the lip of urinal… i mentally screamed and felt so much internal conflict. Do I help him? Or do I mind my business… I chose the latter. \n\nI didn’t need this kid walking out telling his family. “That man helped me with my peepee”",
   "created_utc": 1692928888,
   "score": 140,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxnbwe1",
   "message": "I was going piss and a woman with huge tits came in, peeled her pants off and took a piss in a urinal. STANDING.",
   "created_utc": 1692933963,
   "score": 6,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxna88e",
   "message": "A friend of mine told me a story where he was taking a pee at a urinal and another guy walks up to the urinal and says \"Hey man! How've you been?!\"\n\n\"...uhhh...fine?\"\n\n\"Nice, nice! Awesome! So how's the family? It's been a while...\"\n\n\"...uh...do I...know you...?\"\n\n\"...hang on one second...\"\n\n*Turns to reveal a Bluetooth headset*\n\n\"...I'm sorry, did you say something?\"",
   "created_utc": 1692933099,
   "score": 6,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn5ay5",
   "message": "1 i was at Walmart and a old fat guy that worked there came in and drop his pants to the floor wearing dirty whitey tighties to piss… 2nd incident was going to a college football game i was peeing and some frat boy looks over, and says nice cock bro…😂😂",
   "created_utc": 1692930693,
   "score": 21,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn6ypj",
   "message": "I took the stall next to my friend and asked \"Pissing by yourself, stranger?\"\n\nHe pretended not to know me and called me a freak. He then beat me up outside the bathroom and threw me through the window. When I got back in the building, he had changed his clothes and race and asked me why I was outside and all bloody.\n\nGreat prank.",
   "created_utc": 1692931486,
   "score": 5,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn8nfu",
   "message": "Old man next to me farted and then made a groan that sounded like a death rattle. I was like seventeen at the time, that is, the age of giggling at everything. Had to bite my lip and get out of there.",
   "created_utc": 1692932304,
   "score": 31,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn9bpb",
   "message": "I was at work and someone came up to the urinal next to me. Shortly after, he started yelling “NONONONO AWW FUCK” and he quickly walked into one of the stalls. While I was washing my hands, he came out with his underwear in his hands and he threw them in the trash. That’s when I realized he shit himself while peeing.",
   "created_utc": 1692932641,
   "score": 151,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxnafyw",
   "message": "Just today somebody at the gym was just pissing under the urinal and peeing on the floor for like 5 seconds, before going \"oops\" and then adjusting. Like how are you a grown adult and you miss the entire toilet?",
   "created_utc": 1692933211,
   "score": 10,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn6m7g",
   "message": "Stepped up to the urinal - looked to my right “holy shit! You’re Bernie Kosar”\n\n“Yes I am”",
   "created_utc": 1692931319,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn7y8a",
   "message": "People fucking in the stall near me .",
   "created_utc": 1692931962,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn7zp9",
   "message": "Went to Buffalo Bills game, took my beer to the washroom, set it on the ledge beside me and took a pee in the  pee trough (Slightly traumatic). Looked over when done and my beer was gone. Left and looked a glimpse into the shitter stall.. there was a cooler/lunch bag hanging out of the toilet. I barfed in the parking lot. 10/10 would Bills game again.",
   "created_utc": 1692931981,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn7zzr",
   "message": "In 8th grade I was taking a leak between classes and a guy leaned over and said \"nice cock bro\" and I've been a proud stall pisser ever since",
   "created_utc": 1692931985,
   "score": 70,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn81uy",
   "message": "You know those pee wall urinals? Basically a wall you pee on with a trough and drains at the base?  \nWell I was in a dive bar pretty late, doing my business when someone comes up and starts theres a few feet over.  \nI notice em moving a fair bit in my peripherals so I look over and it's a woman. Pants down and butt cheeks pressed against the pee wall.  \nWe make eye contact briefly and she does the nod. I nod back, finish up, wash my hands then go to pay my bill.\n\nDidn't see her on my way out",
   "created_utc": 1692932010,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn83oh",
   "message": "Having a pee at a urinal, bloke walks up, unzips, looks down and across and says \"nice cock\"\n\nI was just so taken aback I just lost it and was laughing so hard I had tears, like awkward as fuck but just utterly hilarious for no reason \n\nIt's been like a decade or more, still can't think of a fitting comeback for that situation... \"yeah, you too\" just doesn't cut it",
   "created_utc": 1692932035,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn88bi",
   "message": "Not so much awkward as super funny when a boy like ten years or under drops his pants down to his ankles to use the urinal. And i swear they are looking around wondering what it is they are doing differently.",
   "created_utc": 1692932099,
   "score": 21,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn8bco",
   "message": "Threw a chewing gum from my mouth to the urinal. It bounced and got stuck on my dick.",
   "created_utc": 1692932140,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn8km6",
   "message": "I saw a kid, 6-7ish he took a huge ass dumb inside the urinal. I just stood there.",
   "created_utc": 1692932265,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn8yeg",
   "message": "At one of my old workplaces there was a guy who took shaking the tip to a whole new level.\n\n Normal etiquette dictates the chap should be held between thumb and forefinger+ middle finger, given a few good shakes and maybe a squeeze or two and that should be sufficient.\n\nThis guy would stand shoulder to shoulder with you and flick it with such effort that his whole arm was moving, it looked like he was trying to rip the head off it. He would do this for up to 20seconds.\n\nI also once saw an older coworker whip out a handkerchief after pissing,  use it to dab his tip, then put the handkerchief back in his pocket.",
   "created_utc": 1692932454,
   "score": 28,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn91fr",
   "message": "Sometimes you think you are done... then you whip it back into the pants and somehow a short stream still oozes out and you get a wet patch.\n\nOr, you really need to pee, but somehow also got an unwanted boner and try to awkwardly aim, also hoping no guy beside you sees the boner.",
   "created_utc": 1692932497,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn9644",
   "message": "When I was a kid in grade school, another kid came in, dropped his pants, and took a shit in the urinal in front of me.",
   "created_utc": 1692932562,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn98ya",
   "message": "There was a poorly laid at bar that from the outside you could see straight to the men's trough if the door was opened. The ladies line often went past the door. Eveey time there'd be some deunk lady \"I'm watching you pee!\" - as if using a trough isn't degrading enough.",
   "created_utc": 1692932602,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn9d5w",
   "message": "Some guy was doing bumps and didnt offer me any. Rude",
   "created_utc": 1692932662,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn9efz",
   "message": "At a concert with a drunk friend. They had an open circular urinal. My buddy thought it was a sink and tried washing his hands in it.",
   "created_utc": 1692932680,
   "score": 3,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn7zg7",
   "message": "Am I the only one who has never had an awkward interaction at the urinal? I'm genuinely shocked how many stories there are lol. I'm 30, and as far as I can remember, it's always just been piss, zip, wash hands, leave...",
   "created_utc": 1692931978,
   "score": 2,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn812j",
   "message": "When they challenge you to a duel and your stream is both weaker and shallower.",
   "created_utc": 1692932000,
   "score": 2,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn81aw",
   "message": "Not hearing the guy beside you pissing due to the tension.",
   "created_utc": 1692932003,
   "score": 2,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn81ku",
   "message": "Early in my career I had a director who never spoke to me, unless we were in the bathroom together standing at the urinal.  I would literally see this guy 3 days a week and never a word, but if I happened to have my penis in my hand he wanted to be my best friend.  😳",
   "created_utc": 1692932007,
   "score": 45,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn834e",
   "message": "I like going to the neighbor stall no matter what then just saying, “hey cool watch”. \n\nSo me.",
   "created_utc": 1692932027,
   "score": 2,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn87bs",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn89pq",
   "message": "A short , young guy started using the one next to me, I glance over and saw the longest dick I had ever seen . It was so big I almost said something to him.",
   "created_utc": 1692932118,
   "score": 60,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn4m3b",
   "message": "Guy with the biggest dick I’ve ever seen, and half hard too, whipped it out while standing a good foot from the urinal. He idly waved it a little back and forth as he peed. When he was done he was too hard to stuff it back into his fly, so he undid his pants, pointed it upwards, and refastened them about midway up his joint. Hell yes I stared.",
   "created_utc": 1692930368,
   "score": 104,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxnsetk",
   "message": "Once had a guy pissing next to me let loose a lengthy and booming fart that echoed, he boldly says after: “No rain without thunder, heh.”\nDead and awkward silence after that until I left.",
   "created_utc": 1692944202,
   "score": 37,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn1j74",
   "message": "I was taking rifampin for a meningitis exposure. Intermission at a play in NYC, I’m standing there pissing deep orange smelling like I ate 5 pounds of asparagus and breathing over my shoulder. Another dude steps up, starts to unzip, pauses, makes a stink face and leaves. I kinda chuckled, a little embarrassed groan under my breath “ehhhhh ffffuuck”.\n\nAfter the show I see him point me out to his wife. Her face aghast.",
   "created_utc": 1692928970,
   "score": 56,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn658p",
   "message": "I had a Scottish guy in the stall yell over to me \"that's a mighty stream y've got brother!\"\nScrambled my brain.",
   "created_utc": 1692931094,
   "score": 34,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxo5n0u",
   "message": "I CAN FINALLY TELL THIS STORY HOPE IM NOT TOO LATE.\n\nSo, anyway, I just finished a class and went to the comfort room before going to the next one. I washed my face first before going to the urinal. As I was peeing two guys walked in, they were talking about this newly opened coffee shop that just opened near our uni. There were like 8 or so urinals and I occupied one in the middle and one guy peed on my left side a urinal away and the other guy on the furthest one to my right. They continued their conversation about the coffee shop which is awkward enough with me peeing in the middle but then all of a sudden the dude on the left ask very sheepishly “do you wanna go there tomorrow?”. The other dude replied “are you asking me out on a date?”. Reluctantly the first dude said “yeah I guess so”.\n\nSo they asked each other out on a date on a random peeing trip with a guy emptying his bladder in between them. I wish them the best regardless though!",
   "created_utc": 1692954611,
   "score": 59,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxomuy2",
   "message": "I was once at a urinal and a colleague came in. His partner had recently had a baby and it was the first time I'd seen him since, so I wanted to enquire about his offspring's well being. Trouble is, I couldn't remember whether he'd now got a son, or a daughter...so I had to ask more generally.  \n\nOf course, I should've said \"how's the new baby?\" or \"how is fatherhood?\" But no, my brain chose to utter the words \"how's your little one?\". To a man standing at the urinal. \n\nCue a long pause....before he said \"I do hope you're talking about my son\". \n\nCringe.",
   "created_utc": 1692965799,
   "score": 33,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxnhcs7",
   "message": "When I was younger about 14 I was peeing beside this older guy (about 30 or 35) at a college football game. The game was tight and towards the end so everyone was out watching it but I needed to pee and didn’t care so I went to the bathroom. It was just me and him in the bathroom and I walked up next to the urinal beside him to piss because that was the closest to me. \n\nHe was kind of grungy sounding and looking and had a very loud stream. Without really thinking I looked over and saw an absolutely massive cock. I at the time was still going through puberty, and was a bit of a late bloomer but either way I’ve always been average. I was totally flabbergasted at what I had just seen and unfortunately made the mistake of looking up and making eye contact with the guy who was staring right at me while I was staring at his huge cock. He gave me this crazy look, and said in a deep, low voice. “Oh yeaaa” I forced myself to stop peeing, stuck my dick back in my pants, which still streamed a little bit of pee into my jeans and rushed out of the bathroom while he laughed behind me like some kind of orc from the lord of the rings.",
   "created_utc": 1692936981,
   "score": 24,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxnucns",
   "message": "Had to pee in a subway station in vienna after a party at 3am. I had a look in the separate restroom for pooping and since there was shit all over the place I decided to  go to the urinals.\n\nWhen I walked in 3 of 4 urinals were already taken. After starting my business it took several seconds for me to realize that there were no peeing noises from the other men.\n\nHaving a look around I realized all 3 of them were masturbating 😱 Quickest piss of my life.\n\nThe best thing was:\nSome months later at the same station I had to piss again. I hesitated but went in anyway and sure enough someone was masturbating again.\n\nIf you're in Vienna (which is lovely), maybe skip the restroom at U3 Mariahilferstraße 😅",
   "created_utc": 1692945621,
   "score": 24,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn5fi8",
   "message": "This old dude took the urinal right next to me, Even though all the others were free, complimented my stream. Told me it was very impressive and to be proud and cherish it. Because one day it will be gone he said. This was 5 years ago, I still think about it almost every time I go to the urinal.",
   "created_utc": 1692930753,
   "score": 20,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxn2xii",
   "message": "On a business trip to Riyadh, Saudi Arabia and on my way back at the airport, needed to pee. So went to the urinal and got to business when a friendly gentleman politely tapped me on my shoulder to tell me I am actually peeing in the bathroom’s basin. \n\nTurns out that the urinal and basins look similar and almost exactly the same height. I thought I was using the kiddy urinal.",
   "created_utc": 1692929594,
   "score": 22,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxngbli",
   "message": "Dude comes in talking about what stock moves he's going to make for the person on the line with them in the mall. Walks up to the urinal, takes half a piss, sharts lots enough to hear from the food court, turns and walks cheeks clinched into the stall and proceeds to unload a mass of diarrhea into the toilet. All while sustaining the conversation perfectly",
   "created_utc": 1692936383,
   "score": 20,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxnoomc",
   "message": "Me and guy next to each other at the urinals. I finish peeing first, zip up my pants and walk away. Behind me I hear \"hey man, you need to drink more water\". He looked at my apparently very yellow piss and decided to give me some advice.\n\nIt was so awkward it stuck with me. I make sure I'm well hydrated now.",
   "created_utc": 1692941576,
   "score": 21,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxns88h",
   "message": "Not sure this counts because it wasn't awkward at the time (though it definitely should have been). I was really drunk at a bar, celebrating my 25th, many years ago. I get pee shy occasionally and standing at a urinal in this tiny, totally packed out restroom, I just couldn't go. I knew a bunch of people were queuing to go, and that just made it even worse. \n\nAnyways, this guy who starts using the urinal beside me notices what's happening (don't ask me how he noticed, but he was as drunk as me.) After he finishes up, he starts encouraging me to pee. It starts with some words of encouragement like \"you got this\". But it quickly escalates... Soon he's chanting. The whole restroom knows what's going on and starts joining in. Some guy comes up and does this little massage on my shoulders and tells me to relax. All while I'm standing at this urinal. You can't make this stuff up.\n\nAnyway, we're all so drunk this becomes absolutely hilarious. I'm crying with laughter and do actually start relaxing. Long story short, it worked. Would have been a very different (awkward) story without the beers!",
   "created_utc": 1692944070,
   "score": 20,
   "submission_id": "160i22y"
  },
  {
   "comment_id": "jxojpgb",
   "message": "I was 13 or 14 and I was one of the last guys to get to the bathroom after a movie. I'm mid flow when I hear an odd set of shoes enter with unusual haste. I look over my shoulder and see a young woman see the 2 stalls locked and approach the urinal immediately next to me in heels and a cute summer dress.\n\"The ladies line is always so long, don't you agree?\" She says, as she dropped her panties to the ground and stuffed them into her crossbody purse. She lifted her dress, adjusted, and emits a sigh of relief as she clearly had practiced this before. \"Yeah...\" I say with a flummoxed expression, trying to allow my adolescent brain comprehend what I'm seeing. She proceeds to converse with me about how she had too much to drink before the movie but it was so good she couldn't leave her seat. I finish up, off to wash my hands and I hear her again, \"Could you hand me a paper towel? I was too rushed when I came in to remember. As I washed my hands, I built up the courage to confront the situation my early teenage self had been presented with. I finish up, dry my hands, grab a few paper towels and walk them her way. \"How did you learn to do that?\" I ask. Her reply, \"I wanted to be popular in college and it worked, but for the wrong reasons.\" She blots, throws the paper towel in the trash, washes her hands and then chats with me out the door of the movie theater. My dad is smoking a cigarette, talking to my brother about the movie as we walk out. \"It was good to meet you\" she says as she grabs the arms of some other well-dressed girls and walks off. My dad says, \"Who was that?\" I reply, \"I met her at the urinal. She was nice, but really chatty.\" As my brother and father exchange disbelieving glances at one another, my dad shakes his head and says,\"Doesn't she know? No one talks at a urinal.\"",
   "created_utc": 1692964149,
   "score": 20,
   "submission_id": "160i22y"
  }
 ]
}