{
 "submission_id": "160jpur",
 "title": "For those that dropped out of college, what made you decide to drop out?",
 "selftext": "",
 "created_utc": 1692923808,
 "permalink": "/r/AskReddit/comments/160jpur/for_those_that_dropped_out_of_college_what_made/",
 "score": 89,
 "url": "https://www.reddit.com/r/AskReddit/comments/160jpur/for_those_that_dropped_out_of_college_what_made/",
 "comments": [
  {
   "comment_id": "jxmvj7s",
   "message": "Went to college because everyone around me was doing the same. I was miserable for a year while I was there. I dropped out and started back at my job I left. After nearly 10 years I am now deep into the antique industry selling items several hundred years old at a time. Today I played with a barn find 1975 AMC Pacer and got it running after 25 years sitting. Every day I come across something interesting and it makes me excited for what I will find next",
   "created_utc": 1692926314,
   "score": 71,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmsfm0",
   "message": "I was going for a computer science degree but I had already learned so much on my own that starting from \"Hello World\" felt like taking a huge leap backwards.",
   "created_utc": 1692924949,
   "score": 40,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmtdqv",
   "message": "Did not want to be there but was pressured into going",
   "created_utc": 1692925363,
   "score": 24,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmu7do",
   "message": "I never liked school to begin with. Felt that it was stupid having to take classes that had nothing to do with the major I wanted.",
   "created_utc": 1692925725,
   "score": 13,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmu364",
   "message": "I was 19, and I'd been going to school on a regular basis for most of my life.  I was burning out quickly, trying to maintain grades, work, and have some kind of social life.  I also had no real direction for my future, so I was spending money I didn't have on a future I couldn't foresee.\n\nI got a full-time job, made some friends, started feeling good about myself again.  After a couple of years, I was pretty content with the life I had, and I don't look back on it with regret.\n\nIn hindsight, I might have done better to go to a trade school (HVAC would have been the right choice) but I'm still generally content.",
   "created_utc": 1692925675,
   "score": 15,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmv19e",
   "message": "I was poor and couldn't afford college. Between that and having a surprise child it was an easy transition.  I do very well without a degree now.",
   "created_utc": 1692926096,
   "score": 7,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmw3a8",
   "message": "Didn't want to be there to begin with. Only reason I went at all is because my mother forced me to, which she did because she wanted to keep getting child support for me. It took me a few months to get up the courage to quit and I got $10,000 worth of debt to show for it. But sadly, that wasn't the last - or even the worst - financial mistake I would make at my mother's behest. That woman is a monster and I'm glad I've finally cut her out of my life.\n\nI would eventually go back to college a few years later when I was actually ready and willing to  put in the effort. That made a world of difference.",
   "created_utc": 1692926558,
   "score": 6,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmuait",
   "message": "I failed 3 courses in the span of 3 quarters I had others things I was focused on",
   "created_utc": 1692925764,
   "score": 3,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmuh3e",
   "message": "I was working another adult job banking close to $1k a week",
   "created_utc": 1692925845,
   "score": 3,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmux6d",
   "message": "my 4yr degree suddenly had a mandatory 5th year added + 2nd child",
   "created_utc": 1692926044,
   "score": 4,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmvqw4",
   "message": "I hated it and no one wanted me around.",
   "created_utc": 1692926410,
   "score": 3,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmw2kw",
   "message": "I dropped out because I was so depressed I couldn’t even make it to class. I’d walk to the area and just stand there, unable to go in. It was severe and crept up on me, I just started sleeping more and more and eating less and less. \n\nWhen I realized what was happening (and that I’d never pass a class that semester), I arranged to withdraw so most of the money would get back to my parents for that semester. I took a year off, got some help and came back and finished college. In the end, I believe it was the right decision for me but my parents were livid at the time, convinced I’d never go back and finish school.",
   "created_utc": 1692926550,
   "score": 10,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn1b9y",
   "message": "I went to college because it was expected of me by my family.  I was abusing alcohol and drugs and ended up feeling like that was more important.  Partying was more fun and college got in the way so I dropped out.",
   "created_utc": 1692928871,
   "score": 5,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn23uv",
   "message": "It was at the end of the Vietnam war; I reckoned I wouldn't be able to get into law school . I thought I'd work for a couple of years and maybe be a teacher. Worked at a stable/ polo club for 5 years, then moved into a perverse McDonald's/brokerage firm/commodity firm/legal department progression. 5 time dropout. Pushing 70, single,  lonely, and almost hopeless. Beautiful fucking life.",
   "created_utc": 1692929226,
   "score": 4,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmtw0i",
   "message": "COVID online instruction made me drop out. \n\nPaying thousands of dollars for quarter-assed classes in which I still had to teach myself the material just made me feel like I was being scammed.",
   "created_utc": 1692925588,
   "score": 5,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmq7cw",
   "message": "Girl started getting people against me, and the stress of being harassed forced me to leave.",
   "created_utc": 1692923980,
   "score": 4,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmylb0",
   "message": "I developed schizophrenia while in college, and \"treated\" it with drugs. By the time I had to leave, I was taking a class I literally never went to -- ever -- and had spent my rent money on an eight ball and an ounce of weed. I had a month to go. That's how fucked up things were.",
   "created_utc": 1692927666,
   "score": 2,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmrdui",
   "message": "I know a dude who dropped out because he wanted to travel to Alaska and live in the wild just like in 'Into the Wild'.\n\nHe was...not smart.",
   "created_utc": 1692924495,
   "score": 2,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmt6m5",
   "message": "parents didnt have alot of money so i dropped out , got my ged , and started working fulltime (this was in the 90s)",
   "created_utc": 1692925278,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmqugk",
   "message": "Deciding to drop out of college is a significant decision that should be carefully considered. Some reasons people might consider dropping out include:\n\n1. **Financial Constraints:** High tuition costs and student loan debt can become overwhelming, making it difficult to continue education.\n\n2. **Personal or Family Health Issues:** Health concerns for oneself or a family member might require a break from college to prioritize care.\n\n3. **Change in Career Goals:** Shifts in career interests and goals might make current coursework feel irrelevant or unnecessary.\n\n4. **Entrepreneurial Pursuits:** Some individuals have strong business ideas and might opt to focus on building their own ventures.\n\n5. **Personal or Family Responsibilities:** Family obligations or personal circumstances could necessitate taking time off from college.\n\n6. **Lack of Interest or Motivation:** If a student is uninterested in their chosen field of study, they might consider leaving to explore other options.\n\n7. **Success Without a Degree:** Some individuals might find that their desired career path doesn't require a college degree to achieve success.\n\n8. **Educational Alternatives:** The availability of online courses, vocational training, or certification programs might make traditional college seem less essential.\n\n9. **Work Opportunities:** Immediate job opportunities that align with career goals might lead someone to pause their education.\n\n10. **Personal Growth and Exploration:** Some individuals might feel that taking time off will allow them to explore personal interests and grow in non-academic ways.\n\nIt's important to weigh the potential benefits and drawbacks, consider long-term consequences, and explore alternatives before making a decision. Dropping out should be a well-informed choice that aligns with one's goals and circumstances. Seeking advice from mentors, career counselors, and trusted individuals can help in making an informed decision.",
   "created_utc": 1692924260,
   "score": 249,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmu8sj",
   "message": "Medical withdrawal. I developed a chronic illness my first time in college and had a flare-up that lasted for months.",
   "created_utc": 1692925743,
   "score": 4,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmv1ud",
   "message": "It was a waste of time and money. I was not in the right school or program or headspace. \n\nLeft worked for 2.5 years went to a dofrent better school. Learned some stuff and graduated.\n\nIt's all about if it's the right place for you. And you are in the right place for it.",
   "created_utc": 1692926103,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmvd6w",
   "message": "Professor was terrible at teaching, school volunteered my entire class to do community service when we had time restricted assignments that needed to be done, they had a nurse on site for 2 hours every other day when the nearest hospital was an hour away. Food was shit and my ex GF was a manipulator who didn’t want to let go of me. Oh and the fact you couldn’t breathe in your dorm because the AC blew in this nasty mist that stuck to everything that may have been asbestos",
   "created_utc": 1692926240,
   "score": 3,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmvj79",
   "message": "I got my certificates for Culinary. But I didn't finish to get my AA. I was tired of school, I wasted money going to two different Universities before I decided to go to community College and pursue culinary arts, which was like the one thing in life I was at least halfway decent with. It was rough, but it was probably the happiest I've ever been in school, the proudest ive ever felt was when my group set the bar for what was expected, my chef telling me he'd actually use the recipe instructions and order documents i had written, and that he was very proud of my improvement during the final. Landed my first job, and honestly I preferred working. I didn't want waste money on school. And covid hit towards the end I just straight up felt done with school I couldn't take another semester even though I only needed a little bit more.\n\nI keep telling myself I wanna go back to school to take up art, writing, animation, some music, voice acting everything you'd need to create your very own animated show. And I even want to go to learn a bunch of languages. Something to make me feel better about myself other than just that one that can speak only English  in a kitchen of people that can speak 2 languages and pays minimum wage.\n\nBut honestly I just can't bring myself to go back to school, I hate spending money on school, and I need as much as I can get.  And the last thing I want to do is sell my soul, get a loan and cut my hours.",
   "created_utc": 1692926314,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmvsdv",
   "message": "Sexually assaulted in a welding booth",
   "created_utc": 1692926428,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmvwxn",
   "message": "I was working full time and going to school full time and was burnt out.",
   "created_utc": 1692926482,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmw1e6",
   "message": "Cost.",
   "created_utc": 1692926535,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmw5te",
   "message": "I was no good at it",
   "created_utc": 1692926590,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmwnsb",
   "message": "Was going for graphic design, while I loved and still love being creative and making art the idea of dealing with people and sitting at computer began to eat away at my desire. I was also coming to quickly realize that it didn’t pay enough for how competitive the market was. This was mid 2000’s. I make a comfortable living now as a lineman and love my work.",
   "created_utc": 1692926810,
   "score": 3,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmxfb6",
   "message": "I make more doing electrical work than I would if I finished my degree, I cannot work in an office environment, and I would’ve had to take student loans for my junior and senior year",
   "created_utc": 1692927151,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmxgug",
   "message": "When I went to class, I already knew all of the information, so I spent the class time helping others. I was creating projects that were way ahead of what we were on, but the teacher still wanted me to work on things that were well below my skill level. If I was being paid for helping others and completing projects, that would be great, but I'm not *paying* thousands of dollars to do it.",
   "created_utc": 1692927171,
   "score": 3,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmxhwi",
   "message": "I didn't have any major that I was actually interested in.",
   "created_utc": 1692927184,
   "score": 4,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmxkdq",
   "message": "After two and a half years of city college I felt disillusioned with my “plan” as far as schooling and decided to go to work. I got a job in a cabinet maker’s shop and wound up installing cabinets and other woodwork in Manhattan. Because I had to be in a union in New York City, I was forced upon a local carpenters union. I had plenty of work in the mid-eighties and did that for six years making twice as much as my college buddies. I think I did alright.",
   "created_utc": 1692927215,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmy30f",
   "message": "Drugs",
   "created_utc": 1692927442,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmzc05",
   "message": "Mom went blind. Nobody was going to take care of her.",
   "created_utc": 1692927991,
   "score": 5,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxmzscz",
   "message": "Didn’t have a choice. Financial aid fucked me over. I’m too poor to go to college and I don’t have family to help me out so.",
   "created_utc": 1692928194,
   "score": 2,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn0gvk",
   "message": "I never went to class. I had a lot of growing up to do. I got a real job and leaned what it is to show up on time when I was supposed to and take care of my responsibilities. After a few years I returned to school and ended up getting two degrees.",
   "created_utc": 1692928493,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn0jy8",
   "message": "The school cancelling my aid in the middle of a deans list caliber semester",
   "created_utc": 1692928530,
   "score": 7,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn0ko4",
   "message": "Went to college hated the experience. It felt like I was back in high school. I dropped out and went to a trade school instead. Best decision I ever made.",
   "created_utc": 1692928539,
   "score": 3,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn0nh7",
   "message": "Money. The lack thereof.",
   "created_utc": 1692928572,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn0oi9",
   "message": "Great career opportunity and now I'm 18 years in running my own business and living my dream , for the most part",
   "created_utc": 1692928586,
   "score": 2,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn145j",
   "message": "My mom was getting sicker and was having a tough time making ends meet. I ended up picking up a full-time job to help support her and I felt overwhelmed trying to balance work and school. My original plan was to go back once things calmed down, but they never really did, and eventually my work history spoke for me more than my education ever could.",
   "created_utc": 1692928784,
   "score": 4,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn18bo",
   "message": "Got stuck, fell behind, took a toll on my mental health so I just decided I couldn't continue.",
   "created_utc": 1692928835,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn22l9",
   "message": "Moved to San Diego and got into the beauty industry in corporate sales that paid more than teaching.. music scholarship and all..",
   "created_utc": 1692929211,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn25l1",
   "message": "Decided I wasn't going to study what I'm not interested in.",
   "created_utc": 1692929247,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn2ggh",
   "message": "The failing grades",
   "created_utc": 1692929382,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn2xd6",
   "message": "Not having an academic foundation to actually pass the important subjects. Long story",
   "created_utc": 1692929593,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn2y4a",
   "message": "I was going for a degree in history, got an internship that ended up being kinda in the tech industry and got my foot in the door and a full job offer, I was making more than I would with a history degree. No reason to continue college, beyond that I was struggling with mental health and college was killing me with that, working helped me out oddly enough.",
   "created_utc": 1692929601,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn3fro",
   "message": "I changed my major every semester. I had no idea what I wanted to do and every time I changed my major I had to take different general studies. I went to college for 2 years and not once got a credit towards any of the majors I was pursuing. I saw how much my student loans were after 4 semesters and how I had *nothing* to show for it. I just couldn't do it anymore.",
   "created_utc": 1692929825,
   "score": 5,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn3l35",
   "message": "Grades sucked, no more financial aid available, didn't want to take out another loan, started working and liked it SO much better than school.",
   "created_utc": 1692929893,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn43k2",
   "message": "I was going to have to take 2nd semester organic chemistry over again, despite having the 2nd highest grade in my lecture class, and the top grade in any of the labs. Ancient and tenured profressor thought grading on the curve was wrong, and stuck with his original standards from the 1960s, making my grade a C, when moving forward would have required a B. \n\nTo put that into perspective: the grad student (AKA \"adjunct professor\") who taught the labs was a good buddy of mine, and I literally wrote and graded all the tests for him. \n\nShortly after, I got my first job offer in video game development, and that cemented the decision for me. \n\nMore than 30 years later, my career is still going quite strong, and I have zero regrets. \n\nIn the earlier portion of my career, it was very common to joke in job interviews about our educational backgrounds, because there were no related degrees yet. We were all self-taught. \n\nNow, I interview young whipper-snappers, fresh out of school and in huge debt, with Master's degrees in the field I have successfully worked in for decades, and they barely have the skills to qualify for entry-level positions, while somehow expecting to be put in charge.",
   "created_utc": 1692930128,
   "score": 3,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn4js2",
   "message": "I didn't stay dropped out, but I got my Associate's in Criminal Justice and just couldn't do it anymore. The stress and the work load was getting ridiculous and I wasn't even in law school yet. I just wanted to help people and lawyers don't really do that. \n\n I reevaluated what I wanted out of work, my strengths and weaknesses, and looked into the job market then transferred to a college with a funeral service department. \n\n Now I'm a mortician. Currently looking into a full time position because right now I'm only on gig hours with another adjacent job with reliable hours.",
   "created_utc": 1692930338,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn4o18",
   "message": "My pregnancy.",
   "created_utc": 1692930393,
   "score": 2,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn4rrt",
   "message": "Born and raised in America with decent grades out of high school, went for nursing and they were like you need to take English. Got into the class and passed with a low B. Said \"You need to take more English but like basic.\" Sorry nope. My family and I are white white and have been in this state for over 100 years and I \"need\" English. I'm not wasting money on non relevant classes.",
   "created_utc": 1692930442,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn502q",
   "message": "Anxiety and the realization I didn't want to pursue a career in my field of study. It's been ten years but I recently met someone who works in the field I'm actually interested in and he gave me a bunch of info on both the job and college, so I'm planning on saving to go back.",
   "created_utc": 1692930552,
   "score": 2,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn538h",
   "message": "I had no idea what I wanted to do or study, so I decided I would work and save up money until I figured I had a better sense of direction. I was also completely burned out on school and struggling with mental health. About 2 years later I enrolled at another college and got a degree that's not very useful and totally irrelevant to my career lol.\n\nIn hindsight I wish I'd gone to community college for my general classes and then transferred to a university. I wish I'd let myself take a break from school without feeling embarrassed or trying to go back as soon as possible. My parents and school were very \"go to college right after high school.\" Anything else was looked down on.",
   "created_utc": 1692930593,
   "score": 3,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn548w",
   "message": "I dropped out the first time because I wasn't mature enough, I hardly went to classes or put any effort in. I ended up playing more wiffle ball then going to some classes. \n\nI went back a few years later and I did allot better, managed 3.9 GPA. Even though I was only 4-5 years older than most of my classmates, I was way more mature than most. I was like them but now I want interested in partying and goofing around, I was trying to get my life moving\n\nI think allot of young people need some time to mature, then again we need to push that NOT going to college is not a bad thing",
   "created_utc": 1692930605,
   "score": 3,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn59dn",
   "message": "My parents wouldn’t pay for a big school tuition. I wasn’t about to take out a student loan. I couldn’t make up my mind about what I wanted to do for the “rest of my life”. Now I work in insurance and wish I’d just stayed and got a bs bachelor just to have one. Seems like a lot of jobs or promotions will just scrub you if you don’t have one irregardless of it is relevant to the job.",
   "created_utc": 1692930672,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn59yw",
   "message": "I bounced in and out of art schools and would basically surf scholarships. I couldn’t afford to go otherwise and I have to say 30 years later I got a LOT out of being in college. Rarely do people ask me about my degree and if they do I tell them the truth. I’ve had a long and successful career and often had people with masters degrees reporting to me. \n\nI think college is incredibly valuable for the things you learn and the connections you make (some of whom I’m still connected to). I don’t think you need to earn a degree to have a positive college experience.",
   "created_utc": 1692930680,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn5kll",
   "message": "Lack of funding,  rising costs.",
   "created_utc": 1692930820,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn5m55",
   "message": "Teaching Assistant’s went on strike for 3 months and in the meantime I was offered full time work at my job. I took the salary.",
   "created_utc": 1692930840,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn5si2",
   "message": "I was doing a second degree with my own savings.\n\nThe quality of the college felt subpar for what I was paying. One of the teachers literally only gave us an e-book, told us to read it and he would upload homeworks to the platfom. He didn't bother to explain what was on the book. The rest of the teachers were better but the content felt like something I'd learn in highschool. Also, asked the college if I could pay the tuition on installments and was told I could, but if I withdrew after the first 2 weeks of a semester I'd have to pay the full term regardless.",
   "created_utc": 1692930925,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn61ae",
   "message": "I started and did well enough my first semester.  And then I went to Iraq.  And then I came back and got married and re-enrolled.  I was trying to work full time and go to school part time and it just wasn't clicking.  Bought a house.  My stepdad started a business and I went to work for him for a while. Tried again and it still wasn't clicking again.  Went back to Iraq and came home to the beginning of a fracturing marriage (lied to myself about it at the time).  Wanted to have a kid and the economy was taking a shit (2008) so I got a steady job with decent pay and good benefits.  Just decided to stop chasing bad money with good.  I've never made more than 70K a year (decently cheap cost of living area)...but also haven't had a student loan for over a decade.\n\nYou can get a decent government job if you know how to write well and show up on time.  Life is too short to act like everybody's job is going to change the world.",
   "created_utc": 1692931042,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn6c5v",
   "message": "Wasn't motivated to continue because people.\n\nThe silver lining is I talk to people with doctorates and people who will never go to college with the same amount of respect. \n\nEducation and intelligence are not the same and people who get degrees tend to look down on people without degrees. \n\nAnyone can repeat information they learned somewhere else.",
   "created_utc": 1692931187,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn6g38",
   "message": "Money. Couldn’t afford to live and pay tuition.",
   "created_utc": 1692931239,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn6owt",
   "message": "I was going to college and working full time plus odd jobs to make extra cash, my dad found out he had cancer and eventually I had to drop out to help take of him on top of working full time, after he passed I just never went back to school because I was always working.",
   "created_utc": 1692931355,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn6wj5",
   "message": "I attempted to go back in 2020 and lasted 1.5 semesters. I got a dumb brain that CAN’T do difficult math. Basic algebra, totally fine. I was put in trig or something and was told I had two or three more higher math classes before I could get the degree. I lost it and dropped out completely lol\n\nWhich is really frustrating because I am pretty good at science, reading, etc. the degree seriously had no use for that math!!!",
   "created_utc": 1692931457,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn6z6b",
   "message": "My dad had a heart attack and someone had to support the family.",
   "created_utc": 1692931493,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn7dji",
   "message": "I just find it bullshit that for 6-8 graders you can't drop out until youre 16 years old or some shit,that's BS",
   "created_utc": 1692931686,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn7uqx",
   "message": "Girls \nThey’re so much more fun to do than math \nBad plan",
   "created_utc": 1692931915,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn80nq",
   "message": "I was having a major mental health crisis that resulted in me failing an entire year of classes because I just couldn't get myself out of my room to go. Happened in the fall, went home for Christmas, went back, same thing happened. Should have dropped out and maybe salvaged my GPA or saved.aome money, but didn't.\n\nEventually got back and finished after a few false starts.",
   "created_utc": 1692931994,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn8534",
   "message": "I was going to school to become a teacher, and I found out what they actually pay teachers. And I was already married at the time and had a kid on the way, and had responsibilities that being a teacher on a single income household wasn’t going to cover. And suddenly my dream of being a teacher was a luxury I couldn’t afford. So I got a job with my father-in-law doing HVAC.",
   "created_utc": 1692932055,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn8ipb",
   "message": "Grades. But I went to 2 sessions of summer school, made the deans list in both, and graduated with a B.S. in psychology the next year, just in time for the hiring freeze on government employees. Yay.",
   "created_utc": 1692932240,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn8lhd",
   "message": "Wasn’t really a choice. I had no support, no money to my name, and didn’t even know what I wanted to do with my life. $10k in debt for a single year of school",
   "created_utc": 1692932277,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn8n6r",
   "message": "How is anyone \"miserable\" in college??",
   "created_utc": 1692932300,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn8ycc",
   "message": "The draft slowed down and I got classified 1H.",
   "created_utc": 1692932453,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn8yr2",
   "message": "Found out a close friend of mine died when he went. Not going was the best decision of my life.",
   "created_utc": 1692932459,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn97co",
   "message": "The school.",
   "created_utc": 1692932580,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn9efx",
   "message": "Psychosis, didn't want to drop out but at the same time I was in no position to learn anything",
   "created_utc": 1692932680,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn9kzu",
   "message": "I was pressured into starting college when I was 18. I dropped out at 22 after having made no real progress, and my mom had also just died. It's been 5 years, but I'm doing a lot better mentally and am getting the money together to go back and get my business administration degree.",
   "created_utc": 1692932773,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn9lsk",
   "message": "Spanisch educational system",
   "created_utc": 1692932784,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn9ssl",
   "message": "Drugs. Got clean and went back after three years or so to finish up. Graduated in 2015.",
   "created_utc": 1692932881,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn9th9",
   "message": "I thought my degree/career choice was “too selfish”. Lol. Now I’m back in it 10 years later…",
   "created_utc": 1692932891,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxn9wqp",
   "message": "diagnosed as a type 1 diabetic, realized i had chosen the wrong school, never went back.",
   "created_utc": 1692932937,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxna8r3",
   "message": "Having to work 60 plus hours a week just to put a roof over my head and having to do a full course load because I was a dumb kid who didn't know any better at the time.",
   "created_utc": 1692933107,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnad6u",
   "message": "Had a nervous breakdown. I’d still like to go back but it’s very expensive",
   "created_utc": 1692933171,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnae2w",
   "message": "It hit me how much of a scam it all was, I finished my associates and left, never looked back. Why am I paying for classes that have nothing to do with my major? I will never use anthropology in a computer programming context yet it’s required for a degree. There is no reason to buy a brand new 500$ text book every class, every semester. All of these obvious traps and scams and I knew there wasn’t a job for me when I graduated, just debt. It’s a horrible investment of time and money for so many people",
   "created_utc": 1692933185,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnai6y",
   "message": "I didnt drop out of college i just applied then decided not to go before i signed up for classes and it was because every time i told people they were super excited for me and i didnt give a shit",
   "created_utc": 1692933243,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnalju",
   "message": "I signed up for a community college around 2010 to take some graphic design classes. I had some experience, but didn’t feel I was ready to do it professionally yet like I wanted to. The first day, I was surprised to be in a regular classroom not a computer lab. Got the syllabus and found out our projects would involve cutting and gluing construction paper and nothing digital. Looked at my semester schedule and realized every class was in that same room. Dropped out the next day.",
   "created_utc": 1692933291,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnarj6",
   "message": "Money. It was too expensive",
   "created_utc": 1692933376,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnavxy",
   "message": "Because I realized it wasn’t necessary for my career and I was just wasting time and money. A lot of people don’t realize experience is way more important than education in most fields.",
   "created_utc": 1692933440,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnaym9",
   "message": "I was studying linguistics and hanging drywall sounded better than a phd.  Turns out it is.",
   "created_utc": 1692933477,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnb5ak",
   "message": "Had my first daughter and had to make money",
   "created_utc": 1692933573,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnb6ed",
   "message": "I went to work in Yellowstone after freshman year. I wanted a longer season thinking I would make a career there so I dropped out to start earlier in the spring than school allowed for.",
   "created_utc": 1692933588,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnbkoi",
   "message": "My ex decided he wanted more kids and that it was cheaper on him to keep me at home raising them, than it would’ve been to put them in daycare so I could continue my schooling and working. He promised I could go back, but it never happened.",
   "created_utc": 1692933791,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnbl0f",
   "message": "I was a goody two shoes. Being the only sober person in a dorm full of drunks gets old fast.",
   "created_utc": 1692933796,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnbmwv",
   "message": "Late 1990s, dropped out after 1 semester.\n\nI checked out all the books on what I was interested in, and then took the cert tests for A+, MCSE+I, Cisco, etc. Having all those certs, which took me 3 months and about $500, got me in the door for virtually every tech job to be had at the time.\n\nAs the joke went in Good Will Hunting, \"... better education for $1.25 in library fines.\"\n\nThis really isn't possible, now, and I do not understand why we're not fully subsidizing at least a 2-year program for everyone. Should be 4-year.",
   "created_utc": 1692933824,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnbx9m",
   "message": "Went to a private university with most of it paid through scholarships and FAFSA.  Was very down and  unmotivated through it.  I commuted to so didn’t really feel like I was living the college life and some of my grades were dropping.  I found some comfort and social interactions when I got hired at a grocery store and a cashier, later promoted to team leader.  I still was passing every class but when 3rd semester came around, I no longer was eligible for FAFSA help and happily decided not to go back to that university.  Still wanting an education, I chose a community college.  Right before starting community college, I got a job as a part time assistant manager in a footlocker type shoe store near by.  In community college I didn’t feel pressured to make friends or live some “college lifestyle” cuz I would just go to my classes.  I was knocking my core classes out with As and Bs like I was used to getting.  At work I was also really loving the hours I got as an assistant manager, 5 days a week 25-30 hours.  I was saving up a lot of money and using it to fund my next college semester.  Then Covid hit and my classes all became online which I loved.  I still passed them while working 30-35 hours a week.  The following fall semester,I did either one on campus class or all online classes so that I could keep working a lot of hours. At this point I knew that I was prioritizing work over school but since I was still passing I didn’t care.  Also, after the fall semester w would be over I would only need 7 credits(2 classes) to get my associates.  I was already applying to a university I was planning to transfer to, I knew I would get a minority scholarship, and had work enough that I had the money to pay the difference.  Towards the end of November, my family bought a house in Texas and I tried as hard as possible to make enough money and get a place to stay( picked up a second job where I was getting about 25-30 hours) but that wasn’t enough so I ended up having to move with them.  I was able to finish up that semester.  Upon arriving to Texas, I had to buy myself a new car as my old one stopped working and I no longer could comfortably afford out of state tuition, amongst feeling unmotivated and upset again, i decided not to reenroll for my last 7 credits.  That is when I “dropped out.”  I barely regret it tho.  I transferred to the same retail company but this store was massive compared to my old.  It was a store predicted to sale $3 million while my old one peaked at $750k.  I got a $0.50 raise and worked 30-35 hours with no worries about finishing my assignment or essay and I was able to save a lot of money for a 20-21 year old. I am still with the same company except now I have been promoted to a store manager and took a store that was projected to make $500k into a $620k store in my first year.  I am on my second year as a store manager and my store is not projected to make $700-800k.  I have won three quarterly awards with the company; 1st and 2nd place in sales growth for my region and 4th place in sales growth in the company.  And most importantly, I found something I’m passionate about/love; customer service/helping people! I’m gonna finish out the year with the same company(I want to prove that I can beat my own numbers) afterwards, I’m gonna apply to the job I can see myself retiring from; car sales(wo)men.  The only regret I have is getting so close to that associates degree cuz without it, I basically threw away all that money I spent on classes.",
   "created_utc": 1692933976,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxncbb6",
   "message": "I always struggled in school. I was in remedial every thing since elementary school. It’s a miracle i graduated high school. I have no idea why i thought college was a good idea. \n\nI mostly went because it’s what my mom and sister expected of me to do next as my sister was an honors student all her life. I lasted two semesters and failed with flying colors.\n\nI still hear about it to this day from them and I’m 32 years old now.",
   "created_utc": 1692934184,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnccca",
   "message": "Money",
   "created_utc": 1692934199,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxncio1",
   "message": "Discovered that is actually totally possible to get through life without having to work very much and figured that being poor is actually less painful than working my entire life.",
   "created_utc": 1692934293,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxncqf8",
   "message": "2 years into grad school, 2 more to go and a one year non paid internship after. I needed money",
   "created_utc": 1692934409,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxncz78",
   "message": "My sister’s murder. The fall out and stress was too much. It’s many years later now and I never went back.",
   "created_utc": 1692934539,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnd1iy",
   "message": "It wasn't the path I wanted to walk. I was pressured into it by basically everyone else just because I was good at school. Covid hit and forced me to take a step back, and I chose not to go back.",
   "created_utc": 1692934574,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnd2do",
   "message": "My brother died unexpectedly not long after my mom had died.  Being the last one standing was too much and I couldn't continue.  I'm restarting in 4 days.",
   "created_utc": 1692934588,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnd5dh",
   "message": "I decided to drop out and focus on building a company I started. I moved to Albuquerque, New Mexico, with a friend of mine, Paul, to set up our first office and began working on our first software product, Altair BASIC.",
   "created_utc": 1692934631,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnd7bs",
   "message": "I enrolled in a biology graduate program right after graduating from undergrad and dropped out after taking a job in my field at the end of the first semester. Thesis based graduate programs are a scam. I enjoyed going to class and learning, but literally the entire world of every student in the program revolved around their thesis. It’s also all they wanted to talk about in social situations. I also began realize that there were no legit job opportunities beyond that program other than academia. I also realized that niche research (e.g. collecting microbes inside some berry that a particular endangered species of bird is eating) was really boring, and what’s more, you had to secure your own funding to do said research.",
   "created_utc": 1692934661,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnd7gz",
   "message": "Social anxiety",
   "created_utc": 1692934662,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnda9m",
   "message": "I was so positive i knew what i wanted to do and chose a major that on the surface doesn't seem that hard but is apparently one of the top 10 hardest degrees to get, up there with Physics and Engineering degrees in courseload and challenge. Music Education.\n\nI was that kid who slept through high school and graduated with a 3.85, never needed to study, only ever cared about band (our HS band was pretty good and super serious, won USSBA nationals once and marched the Macy's parade a few yrs after i graduated) and just coasted.\n\nThen i got to college and at our school of music orientation, was told most Music Ed majors don't graduate in 4 years, usually it's 4.5-5 years. and that my course load was 9 classes a week for only 17 credit hours. Some classes were literally 0 credits but mandatory for the major.So on top of mandatory marching band taking up most of my time, 3 rehearsals a week, entire saturdays dedicated to performing at the football game/rehearsing beforehand, memorizing drill charts, learning music for a new show every home game, missing 1-2 days of class for travel to away games, rehearsing other music for other bands and classes like 3 hours a day. I never felt like i had the time or energy to do the work for the other 4-5 classes i had. Like my Gen Eds and theory and musicology and percussion methods.\n\n\u0026amp;#x200B;\n\nlong story short, I burned out hard, got extremely depressed, started doing drugs heavily to cope, stopped going to all my classes except for concert band and lessons, because i at least enjoyed performing and didn't wanna let the band down. and effectively failed out willingly.\n\nkids, if you're considering being a music education major, you better REALLY fucking mean it, because i was so sure for 5 years that's what i wanted and it took all of 3 months for me to realize i wasn't cut out for that major.\n\nfor a little context, there were like 8 other music ed major freshman with a focus on the same instrument as me, only 2 actually ended up graduating with music ed degrees. some ended up like me, some saw what happened to me and others and changed majors after a semester or two.",
   "created_utc": 1692934705,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxndjcz",
   "message": "I was making more in 2 months than I would have in a year in the field I was majoring in.",
   "created_utc": 1692934843,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxndn15",
   "message": "Because I created Microsoft. 🤣",
   "created_utc": 1692934898,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxndtd5",
   "message": "Was pressured into it by family, realized I was wasting my time when my electrical engineering professor, one of the senior professors, did not even know Ohm's Law.",
   "created_utc": 1692934995,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnedhp",
   "message": "went to college.  they wouldn't let me test out of classes.  literally had a class where they spent 3 weeks teaching people to point and click a mouse.\n\nsome classes were very challenging and i loved those. other classes were required and you can tell the professors didn't care.\n\nwas a very expensive school.  dropped out to go get all the general education courses finished at a community college.  do that for 2 years, go to enroll in regular state university and they won't accept any credits from the community college.\n\nso i said fuck it.  went to vocational school instead.  ended up getting a job unrelated to it.  its been my career ever since and nothing i studied in university, community college, or vocational school has anything to do with my field.  so fucking weird.  could have saved so much money if i just started in my career field instead.\n\na decade later they reformed all the community and state universities and made them accept the credits.",
   "created_utc": 1692935301,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxneg1f",
   "message": "Enrolled when I didn't have my own car because the girl I was seeing wanted me to attend with her. Then she changed her mind and decided she didn't want to be around me in any capacity, so I wasn't able to get there.\nIt felt terrible.",
   "created_utc": 1692935341,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnepuw",
   "message": "A boy. \n\nThat’s a lie. I was lazy. I’m not a morning person. Getting high was more fun. It felt like a treadmill. \n\nMy husband and I had similar academic backgrounds. For US folks: We were both National Merit Scholars. He went on to higher education lasting into his 30s and I dropped out at 19. We joke about who made the better decisions.",
   "created_utc": 1692935486,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnfgo9",
   "message": "So student housing was arranged by my school. I was living in a little shack in a guy's backyard. There were squirrels and raccoons living in the walls, the bathroom was completely rotted out and had severe insect infestation, the walls were falling apart from mold and humidity. We had mice. And the old guy I was sharing the place with was a heroin addict. When the school called me before they end of my final semester to ask whether I would recommend the place for a different student the next year, I said \"hell no\" and listed the reasons. \n\nWell, the school called the landlord and let him know they wouldn't be placing a student there the following year. I came home the next day and all my stuff was thrown out into the front yard, he called me a son of a bitch, and told me to get the fuck out. I ended up living in hallways and outdoors for a little while. Obviously I had nowhere to live and had no money to pay first and last month rent anywhere... so I got a job as a programmer, and never bothered going back to finish my final semester.\n\n25 years later, looking back, it was pretty fucked up, but I wouldn't have wanted my life to turn out any different than it has. So I'm good with it",
   "created_utc": 1692935897,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnfrc5",
   "message": "I worked full-time and liked partying. \n\nStarted and stopped many times the previous 15+ years. Past couple of years I’ve continually gone and am now in my upper division classes for a software engineering degree at 37yrs old.",
   "created_utc": 1692936063,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnfw3q",
   "message": "When I was in second year, one of my parents was diagnosed with a terminal illness and deteriorated and died very quickly. I basically had what in retrospect I recognise was a total breakdown, began failing everything, stopped attending classes. I now know, with the benefit of 20 years of hindsight, that it wasn't just the trauma of the death (he was also an teacher at this institution so just being on the campus was painful memories everywhere) but a bunch of undiagnosed and very comorbid mental illnesses greatly exacerbated the situation. After another year and a bit of trying and still failing everything, I dropped out, was a dysfunctional walking disaster for a while, then got a steady job that I didn't require a degree for. And then I got used to being able to pay bills and keep a roof over my head, and never went back to university.",
   "created_utc": 1692936138,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxng8oc",
   "message": "burnout, depression, anxiety and disappointment...Had fun at community College got 2 associates then went to a college my older siblings attended to. Fork in the road was go to culinary school or go to this college. Picked that college with a difficult degree. Less than a year left an advisor told me I would be start paying out of state tuition and I would need to work for a doctorates to be competitive in that feild. Had a horrible panic attack after that and left...",
   "created_utc": 1692936336,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxngg1b",
   "message": "Results",
   "created_utc": 1692936454,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnggho",
   "message": "My ex GF mom started attending the same classes as me on purpose and made sure ro Say Hi and tried to hug me whenever she could. Eventually I said fuck this weirdo shit and left one class shy of my degree.",
   "created_utc": 1692936461,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxngir3",
   "message": "Because I realized that I could actually be making money by going to work instead of spending money to go and sit somewhere that I had no interest being there.",
   "created_utc": 1692936498,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxngnh6",
   "message": "My mom had cancer and needed me 💔",
   "created_utc": 1692936574,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxngspf",
   "message": "Depression. Sought help, but it never really improved. Figured out how to make a good living without a degree. It only cost me my soul.",
   "created_utc": 1692936658,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxngtw1",
   "message": "Laziness and lack of direction. I didn't have anything I wanted to do in particular. I was just going because I thought I should. I didn't apply myself properly and kept failing classes, so I dropped out.",
   "created_utc": 1692936676,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnh6qk",
   "message": "I realized I was wasting my time. I didn’t want to be there, and was just passing by the skin of my teeth. I was winging it. I only have a year left. Now that I’m a little more mature, I might finish.",
   "created_utc": 1692936884,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnhyaz",
   "message": "Cost, lack of direction/progress, plus family tragedies.",
   "created_utc": 1692937326,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxniig2",
   "message": "Partly I had discovered girls, parties and socialising. Partly I had grown tired of school and this just felt like more years of school. And a large part that I couldn’t stand the other students who all seemed incredibly pretentious and immature. \n\nDropped out, got a job as a junior in an industry I’d never though about, went through the motions for over a decade but gaining experience both of the job and also real life. Then got engaged, realised I didn’t want to be stuck in a rut, and began climbing the ladder through management positions.\n\nFunny thing is that today I’m doing very well and, unless I got to the very top of the field I was  supposed to study, getting paid better than I would have done had I graduated and worked in the field I was originally interested in.\n\nOne thing I remember is a couple of years into the job, a graduate started with the company. I noted two things -\n\nI) She seemed immature. In those years I had really grown up by entering the real world and working with adults. It seemed like her growth had been stunted by several extra years at what was basically another school environment.\n\nII) Whatever knowledge she gained was clearly not as useful as the experience I had gained by doing the actual job.\n\nOverall, I’d say I’m probably in a better position now than I would have been if I had stuck to the plan.",
   "created_utc": 1692937654,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxniovn",
   "message": "When I realized modern college was not in fact for expanding your mind and horizons but instead was a brainwash center and it's all a farce to be in you have to fit in. Not my cup of tea lol",
   "created_utc": 1692937761,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxniowc",
   "message": "It’s what I thought I was supposed to do. I was a gifted honors student, so the next step was college. The problem is that I built my entire identity around grades and burnt myself out by the time I graduated high school. I didn’t last a full semester before I had enough. I’d spent enough of my life drowning in schoolwork and needed to find fulfillment in better things. \n\nIt’s been a year since I dropped out, but now I’m considering going to community college part time. I realized that I can be a student without it consuming my entire life. I don’t need to go the traditional route to get what I want out of college.",
   "created_utc": 1692937761,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxniph5",
   "message": "Well Spielberg did it and he succeeded, so I thought I’d give it a try",
   "created_utc": 1692937771,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxniqej",
   "message": "College isn't for everyone, nothing wrong with getting in to a good paying trade",
   "created_utc": 1692937787,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxniylz",
   "message": "wasn’t ready, i guess. was still emotionally distraught and unstable from a tumultuous youth and just couldn’t handle it. these days i’m much more stable and would love to further my education. just need the money and time…",
   "created_utc": 1692937922,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnj05l",
   "message": "I had just finished 4 years in the Air Force and thought I'd use my GI bill. My wife and I decided to move back to California from New Mexico, and I just never went back.",
   "created_utc": 1692937948,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnj2vf",
   "message": "The cost.  Quit my masters half way through because half the classes were useless and they added up to a lot.  Was going to cost me $30K for 5 classes to finish the program.  Was just stupid.",
   "created_utc": 1692937994,
   "score": 1,
   "submission_id": "160jpur"
  },
  {
   "comment_id": "jxnj8ij",
   "message": "Knowing everything in the first six months worth of reading in fist year philosophy, coming back for the last semester and realising I was 8 books behind where my reading needed to be.",
   "created_utc": 1692938090,
   "score": 1,
   "submission_id": "160jpur"
  }
 ]
}