{
 "submission_id": "160r9gk",
 "title": "Hey iPhone users, what are the main reasons why y'all don't really switch over to Android?",
 "selftext": "",
 "created_utc": 1692945501,
 "permalink": "/r/AskReddit/comments/160r9gk/hey_iphone_users_what_are_the_main_reasons_why/",
 "score": 105,
 "url": "https://www.reddit.com/r/AskReddit/comments/160r9gk/hey_iphone_users_what_are_the_main_reasons_why/",
 "comments": [
  {
   "comment_id": "jxnu9c4",
   "message": "Apple ecosystem, I’ve been indoctrinated",
   "created_utc": 1692945552,
   "score": 160,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnu9la",
   "message": "Mainly the fact that I’ve gotten so used to the controls and setup of Apple phones.",
   "created_utc": 1692945558,
   "score": 229,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnvjg1",
   "message": "I used Android when I was younger because I liked flashing custom ROMs and hated feeling restricted with iOS. Then I started to value consistency and simplicity in design/user interface and haven’t thought about switching back since. Also, I really enjoy iMessage.\n\nThe difference in hardware these days is also mostly negligible, which is what initially made Android phones appealing to me years ago.",
   "created_utc": 1692946518,
   "score": 203,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnubsn",
   "message": "Ecosystem, easy privacy features that probably don’t work but make me feel better",
   "created_utc": 1692945603,
   "score": 81,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnui1d",
   "message": "Its still working, when it dies we'll see that the next one will be.",
   "created_utc": 1692945732,
   "score": 28,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnuep5",
   "message": "Company gave me iPhone and pays my bills. Not gonna switch just to pay my own bills. If my company offered androids, then I’d switch",
   "created_utc": 1692945663,
   "score": 28,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnuiw6",
   "message": "1. It’s easy\n2. I know what to expect from every iPhone\n3. My wife would kill me if my messages suddenly went green",
   "created_utc": 1692945751,
   "score": 110,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnvk6w",
   "message": "They really give a shit on user experience. Even the littles things and features you don’t normally use, they make sure it’s on brand and I appreciate that so much.\n\nEdit: Also it’s already iPhone 14 era but my old iPhone 6 is still working. Worth every penny for me.",
   "created_utc": 1692946534,
   "score": 60,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnuex6",
   "message": "Makes it easier to Airdrop files, photos and transfer what I have open on my web browser to my MacBook.\n\nI had a S5 until 2018. I found it annoying having to upload pictures onto my Google Drive app and then opening them on my laptop—especially if it was a few files that took a while to upload. I then got the iPhone 8 Plus and it made everything so much easier.",
   "created_utc": 1692945667,
   "score": 32,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnuuat",
   "message": "Because accessibility features are much better on iPhones.",
   "created_utc": 1692945991,
   "score": 26,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnunrs",
   "message": "To each their own.",
   "created_utc": 1692945855,
   "score": 12,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnx3f0",
   "message": "~~chick likes iphones better~~   \nBecause my company uses apple products, so I live in the ecosystem",
   "created_utc": 1692947715,
   "score": 4,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnukt5",
   "message": "I think people prefer one of the either due their adaptation to one's operating system. I personally use Android. I can obtain all of my programs, music, and other items without having to use a system like iTunes. Android smartphones follow my instructions. Your iPhone will direct you.",
   "created_utc": 1692945791,
   "score": 24,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnvh8a",
   "message": "I don’t trust Google with my personal data.",
   "created_utc": 1692946469,
   "score": 23,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxo7u6o",
   "message": "I literally switched to an iPhone just last week...\n\nI was a strong 'fuck apple' type for a while. Android served me for years... I've gone through countless Android phones over the years.\n\nBut you know the problem with Android phones? They get slow... Things stop working... push notifications stop working... screen gets laggy... plus android auto pales in comparison to apple Carplay.\n\nEvery single android phone (my last one.. which I still have in the drawer is a Samsung A52s) just got slower and slower. People say \"you can clean files\" \"you can uninstall X\" \"you can go to these settings etc.\"... but I shouldn't have to.\n\nYet, my wife has had an iphone for years, and never once did she have the same problems I had with my android phones.\n\nI've had a mac for some time now as well for work. This thing has never slowed down, and continues to be incredibly responsive... I never shut it down either.\n\nThe iphone just works. Sorry to say, but it does. Granted, you don't have the customisability of Android... But I use the phone not for the ability to root it, customise it or anything... I use it to make and receive calls, a few utility apps, camera and messages/ emails. iphone just rocks these functionalities without issue.\n\nAnd for apple carplay... I recently got a new car and the iphone integration to my infotainment is far superior to android. The android one was slow and painful to use on my samsung. Laggy screen in the car, plus map directions don't replicate to my digital cockpit.\n\nThe apple carplay is much faster, smoother... apple maps? The directions it gives over voice is WAY better than google maps or waze (waze's voice sounds patronising). Instead of \"now turn left\" when there are 2 exits... Apple maps say \"take the exit after the next set of lights\" giving much more precise information.\n\nPlus it replicates the directions to my digital cockpit.\n\nAll around, the iphone is already impressing me, it's much better than my android phone.\n\nAt the end of the day, it's each to their own. For what I need a phone for, the iphone delivers on a much better level than my samsung.",
   "created_utc": 1692956340,
   "score": 14,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnuvzw",
   "message": "It’s my preference.",
   "created_utc": 1692946026,
   "score": 8,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxo1nyv",
   "message": "I’m super lazy, and there has been no reason that apple has given me to switch back.",
   "created_utc": 1692951387,
   "score": 3,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnufdz",
   "message": "The scrolling it’s just different",
   "created_utc": 1692945676,
   "score": 8,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnuqtx",
   "message": "I saw someone’s non iPhone (some type of Motorola) display ads on their Lock Screen. That’s the top of the list right now.",
   "created_utc": 1692945918,
   "score": 16,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnuw6p",
   "message": "I’m a problem solver. What problem does this solve for me? If I can’t answer that I’m probably not going to bother with it",
   "created_utc": 1692946029,
   "score": 6,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnuly3",
   "message": "I switched from android to iphone since it's just cleaner",
   "created_utc": 1692945816,
   "score": 16,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxo57pr",
   "message": "People will make fun of me and call me broke",
   "created_utc": 1692954278,
   "score": 10,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxo77yh",
   "message": "I still feel that Android lags behind in update/support, and repair. \n\nA new iPhone will get 5/6 years of support/updates, but only Samsung will provide 4/5 years of support/updates, and Google itself only offer 3/4 years of support/updates. Why would I want a phone to be worthless in 3 years?\n\nAn iPhone can be repaired in a lot of places. Third Party Places. Sure Apple will do a bunch of bull crud to try to software lock repairs, but at least the option is there. You can also purchase Apple Support especially with theft, and loss. Meanwhile most Android companies don’t even offer the theft, and loss option, and if they do it’s even more expensive than Apple. \n\nEven if I purchased protection, or not I can bring my iPhone to any Apple Store for repairs, but I would have to ship an Android phone back to the manufacturer if I want it repaired. It is a big hassle. Especially if you need your phone. If you don’t want to do that then you will have to bring it to Third Party Repair, and that’s only if they offer it. This is a waste of time.",
   "created_utc": 1692955865,
   "score": 4,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnw5wz",
   "message": "Apple is less problematic with apps and payments, I found.",
   "created_utc": 1692947003,
   "score": 8,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnvqts",
   "message": "Quite the contrary. I don't want to go back. \n\nI had 3 Androids. They all shit the bed on me. Ran hot, battery drains quick, and the phone simply stops working reliably...all within 6 months. Looking for help told me I needed to hard reset the phone every 6 months. F that hell no that is BS. I went to iOS. I have never had one single issue at all going on about 10 years now. Upgraded twice, once for a bigger screen, and another for 5G capability.",
   "created_utc": 1692946675,
   "score": 9,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxo232l",
   "message": "Variety. I can get different phones in different styles with different functions with Android. I still have my old OnePlus 6t because it has an excellent camera and a light operating system (a modded version of android, I believe). With apple, you are stuck with a closed environment on a closed phone, only variation you getvis if you buy a new one, and Apple makes damn sure to come out with a new phone every year, which I will admit many android phone companies do now too.",
   "created_utc": 1692951725,
   "score": 2,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxo1wws",
   "message": "Universal back button. It's always there when and where I need it. I had an iphone a long time ago and every app had its own back button in different locations.",
   "created_utc": 1692951587,
   "score": 4,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnvpuc",
   "message": "Probably the same reason I won't switch *from* Android. You make your choice early on and tend to stick with it.",
   "created_utc": 1692946654,
   "score": 5,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxo498q",
   "message": "I'm going to speculate based on my experience as a non-iPhone user with a social circle that's almost entirely iPhone users.\n\nThe amount of bitching about my texts being a different color, or my contact profile not being supported by the default group text stuff - it's real, and they actually complain about me not being on iPhone.\n\nHow they justify spending $1500 every year on the slightly different version of the same phone they already have, and being excited to do so, I don't know, but Apple people are everywhere.\n\nAnother friend couldn't believe that my $1200 laptop with an i9, DDR5, and 3070ti was infinitely more powerful than their $2500 Macbook that had an M1, no dedicated GPU, and 8gb of old ass RAM. \n\n\"But it's a Macbook Pro!? How could your ASUS be 3x faster for 1/2 the price? Is it even a pro model?\"\n\nWish I was making this up.",
   "created_utc": 1692953500,
   "score": 6,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnvdj3",
   "message": "The user interface is different and I don’t feel like figuring another gif out in this life",
   "created_utc": 1692946391,
   "score": 3,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnxaw1",
   "message": "I have both an Android and iPhone. I prefer the customization of Android. I don’t hate my iPhone, but if my employer didn’t pay the service I wouldn’t buy one voluntarily.",
   "created_utc": 1692947877,
   "score": 4,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnzfbd",
   "message": "Apple password storing system. That’s why I began using my own passwords and just storing them on iCloud. I don’t use iPhone generated passwords anymore!",
   "created_utc": 1692949569,
   "score": 3,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnuiml",
   "message": "I've used both, I prefer the Android.  IPhone is too 'caged' into their own ecosystem",
   "created_utc": 1692945745,
   "score": 11,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnudl7",
   "message": "More people I can share charging cables with",
   "created_utc": 1692945640,
   "score": 4,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxo4nx5",
   "message": "Because at this point I’m not an Apple user, I’m a hostage.",
   "created_utc": 1692953831,
   "score": 4,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxo62qg",
   "message": "I’m a sheep, baaaa",
   "created_utc": 1692954962,
   "score": 6,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnv9hl",
   "message": "I don’t like the android ui and I like the apple ecosystem.",
   "created_utc": 1692946307,
   "score": 4,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnv9u7",
   "message": "Because there are no good reasons to switch over to Android.",
   "created_utc": 1692946315,
   "score": 5,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnx3j1",
   "message": "The last two Iphones have both been running for several years without any problems. Don’t remember my androids being so sturdy.",
   "created_utc": 1692947718,
   "score": 4,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnvfaf",
   "message": "Samsung is out here trying to convince us flip phones are a new thing. Freaking if I wanted a flip phone I’d buy a real one",
   "created_utc": 1692946429,
   "score": 3,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnw3fo",
   "message": "For some reason(s), I live in an Apple eco-system. iPhone, iPad, MacBook, Apple desktop. I’ve been assimilated and can’t find a way out. I don’t think I need to at this stage.",
   "created_utc": 1692946949,
   "score": 2,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnwi55",
   "message": "Been using iPhone for most of my life and when I see Android’s UI I just don’t like it 🤷‍♂️",
   "created_utc": 1692947256,
   "score": 2,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnxodt",
   "message": "I went from Android to iPhone cause I was tired of my phone breaking and wanted to try something different.\n\nSwitched to iPhone and immediately noticed the quality of the apps. Seemed much more responsive. Had the same iPhone for 5 years and not one issue. Every Android I had prior had some issue within a few years. So, iPhone has yet to give me a reason to leave like Android did",
   "created_utc": 1692948168,
   "score": 2,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxohvir",
   "message": "Blue vs. Green",
   "created_utc": 1692963133,
   "score": 1,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnxn89",
   "message": "I used to have Android (Samsung Galaxy) phones but their batteries always went to shit, and they became slow after a couple of years. Then I got an iPhone from work and it just stayed good. So yeah, I’ll stick to iPhone for now.",
   "created_utc": 1692948142,
   "score": 1,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnwjnv",
   "message": "Easy transfer, I have both and am used to the apple features and how they behave, I put do not disturb on an iPhone I get notifications I missed, Samsung they are a faff to see",
   "created_utc": 1692947289,
   "score": 1,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnxne3",
   "message": "it's a bigger pain in the ass than just getting another iphone",
   "created_utc": 1692948146,
   "score": 1,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxo08zj",
   "message": "Because I prefer my iPhone",
   "created_utc": 1692950235,
   "score": 1,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxonf6d",
   "message": "Because Android is made by Google, perhaps the largest advertising company in the world, and nearly everything they do is to improve how they can sell ads to companies. I'm not married to iPhone but there simply is no alternative. And as both a software developer AND someone who did some online advertising courses before bailing out due to the immorality of it, I am very well aware of how deep it all goes.\n\nAnother bonus is how long Apple keeps updating iPhone software. Again as a software developer with a heavy web application specialization, leading to me needing to implement internet security features, I would never use a phone for anything serious after they stop getting security updates.",
   "created_utc": 1692966085,
   "score": 1,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnxe54",
   "message": "Privacy. Because Apple apps are sandboxed from the start. But android is getting there.",
   "created_utc": 1692947946,
   "score": 255,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnw37l",
   "message": "Lol because it’s android.",
   "created_utc": 1692946945,
   "score": 255,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnxctj",
   "message": "Android and partners don’t support their products. And it’s buggy as hell.",
   "created_utc": 1692947918,
   "score": 254,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnvgbw",
   "message": "I’m still young and my dad won’t let me",
   "created_utc": 1692946450,
   "score": 0,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnzvqu",
   "message": "iMessage",
   "created_utc": 1692949936,
   "score": 0,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxohj2f",
   "message": "Something about android users thinking they’re software developers because they own an Android since the UI is more complex (actually more cluttered and very clumsy) when they don’t even know how to do basic coding. Correlation does not equal causation in this case.",
   "created_utc": 1692962930,
   "score": 0,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnuorj",
   "message": "I just switched from Android to iPhone",
   "created_utc": 1692945876,
   "score": 254,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnxkxb",
   "message": "I don’t trust Google. At all. \n\nAt least Apple gives the illusion that my data is private.",
   "created_utc": 1692948093,
   "score": 251,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnvll0",
   "message": "Don’t want to learn a whole new phone and Ive always had the perception that android is the inferior phone and takes shitty pictures. Plus no iMessage for wifi texting",
   "created_utc": 1692946564,
   "score": 253,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnw5kj",
   "message": "It comes without undeletable 3rd party bloatware",
   "created_utc": 1692946995,
   "score": 254,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxoiy7y",
   "message": "Every single time I’ve touched an Android phone i’ve found the following facts;\n\nIt’s sluggish interface even the 2023 models.\n\nConfusing interface.\n\nThe camera is not great and filters the hell out of faces (airbrush look)\n\nBad app store with little to offer.\n\nToo much Google (and or Vendor) bloatware",
   "created_utc": 1692963734,
   "score": 1,
   "submission_id": "160r9gk"
  },
  {
   "comment_id": "jxnyst0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "160r9gk"
  }
 ]
}