{
 "submission_id": "160vwat",
 "title": "What ruined religion for you?",
 "selftext": "",
 "created_utc": 1692960989,
 "permalink": "/r/AskReddit/comments/160vwat/what_ruined_religion_for_you/",
 "score": 25,
 "url": "https://www.reddit.com/r/AskReddit/comments/160vwat/what_ruined_religion_for_you/",
 "comments": [
  {
   "comment_id": "jxoee8s",
   "message": "The other people",
   "created_utc": 1692961024,
   "score": 31,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxohh4p",
   "message": "I love the message behind Catholicism. Do unto others, forgive and forget, confess your sins to lighten the load. Its great, and the charity aspect of church is actually quite astonishing. They should get way more credit for what they provide. \n\nBut the stand up, kneel down, pray to your Lord and master and live this way or fuxking else!!! \n\nThat bit annoys me. I can't listen to someone telling me to subject myself to a master. \n\nReligion is a beautiful thing. The solace in believing we will see loved ones again is comforting in the hardest of times. \n\nBut preachy McPreach down there can go fuck himself.",
   "created_utc": 1692962899,
   "score": 34,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxogmve",
   "message": "The hypocrisy of religion, love everyone except those that don’t believe!",
   "created_utc": 1692962410,
   "score": 26,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxofto9",
   "message": "God .... never really replied.... it felt like it was all one sided",
   "created_utc": 1692961922,
   "score": 64,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxog77x",
   "message": "Being raised in it.",
   "created_utc": 1692962150,
   "score": 14,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoelco",
   "message": "Their followers and the Churches. Most I've met are extremely judgemental and mistreat those who do not follow their own religion. As for the Churches, most aren't honest with their money.",
   "created_utc": 1692961152,
   "score": 11,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoho6p",
   "message": "The Inquisition, witch trials, brutal punishments, child abuse, opulent churches and collections of wealth on the backs of the parishioners, elevating the pursuit of political power over adhering to God's Law.",
   "created_utc": 1692963014,
   "score": 17,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxofdim",
   "message": "Religion is designed for people control. There is no redeeming quality to ruin. Spirituality on the other hand, is amazing.",
   "created_utc": 1692961647,
   "score": 25,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoesa8",
   "message": "The extremists in my religion.",
   "created_utc": 1692961277,
   "score": 7,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoespw",
   "message": "religious trauma",
   "created_utc": 1692961285,
   "score": 6,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxofew5",
   "message": "Religion.",
   "created_utc": 1692961671,
   "score": 7,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxofxv8",
   "message": "My sister talking shit about how god hates gay people",
   "created_utc": 1692961993,
   "score": 5,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoipve",
   "message": "To a large degree, the gay marriage debate. I had had a gay dorm mate in a religious school who had explained to me all the ways that bring gay was misrepresented by later interpretations, but really not such a bad thing in the bible. During the gay marriage debate it was pretty well argued to me that the apologetics about being gay being consistent with my religion didn't really work. In my religion, God doesn't like the gays. The concept that God made people gay and then bans them from living their lives is just so against my personal values that I found myself in a moral argument with God in which I didn't think God had a acceptable position. It was a real crisis.\nThere are other things too, of course, but that was a big one.",
   "created_utc": 1692963608,
   "score": 6,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxokd3e",
   "message": "Being a 14-year-old Catholic and being expected to worship a God who didn't want me to masturbate.",
   "created_utc": 1692964496,
   "score": 6,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoidvw",
   "message": "The people that twist religion into their own benefit",
   "created_utc": 1692963420,
   "score": 4,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxolfzw",
   "message": "I used to regularly get into trouble in Sunday school for asking too many questions\n\nEg. How did that tiny amount of fish and bread feed 5000 people? How did Noah get the animals on the boat? Etc. \n\nImagine having a child that was interested in something and totally stunting their interest by refusing to engage with them?\n\nSoon as I turned 14, and could legally stay at home, I chose to stay at home and watch cartoons and eat cereal. Much better choice.",
   "created_utc": 1692965070,
   "score": 5,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxofhfy",
   "message": "Convent boarding school",
   "created_utc": 1692961714,
   "score": 3,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxogsq6",
   "message": "Getting religion forced on you can deteriorate the spirituality you initially had. Someone trying way less for religion is okay as long as they are trying from pure mind. You force them to do more and they've lost it.",
   "created_utc": 1692962504,
   "score": 4,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoigvy",
   "message": "It's nonsensical nature. Though I can see the sense in many of their moral teachings, some of them are patently ridiculous.",
   "created_utc": 1692963467,
   "score": 4,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxonxgl",
   "message": "Just how insanely badly women are treated - everyone, but the rich old men, really, and the mindboggling hypocrisy of the institution, their vile crimes and the bullshit that \"gods only do shiny shit, the rest is not their fault\"...  \n\nFor Christianity, specifically, that babies who died at birth and had not yet been baptised, did not have the right to be buried as people. As if the mother hadn't had the worst experience one can have, she now needs to think her poor baby didn't deserve to go to heaven. Just... insanely vile.",
   "created_utc": 1692966337,
   "score": 5,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoi1gk",
   "message": "The church I used to go and my parents' extreme faith",
   "created_utc": 1692963228,
   "score": 3,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoiged",
   "message": "Ministries where the congregation is poor but the people running it are ridiculously rich, flying around in private jets, bathing in cash, living in mansions and trying to guilt poor people in giving them money to sustain that lifestyle with fake promises and the fear of what will happen to them in the afterlife if they don’t pony up.",
   "created_utc": 1692963459,
   "score": 3,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxok9bi",
   "message": "1) God always left me on read \n2) Gods workers sticking dicks in altarboys",
   "created_utc": 1692964441,
   "score": 3,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxokogd",
   "message": "Inconsistency",
   "created_utc": 1692964666,
   "score": 3,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxon39m",
   "message": "Too many cults that are nothing but a money-vacuuming-system. And Mercedezs in the every garages of monks and their way too younger porn-like wives.",
   "created_utc": 1692965918,
   "score": 3,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoryys",
   "message": "On request of my mother i was preparing for some random religious ritual which required to take one year of lessons.\nIn one of the lessons the question came up: \"what does good come from?\" This was asked by one of the children.\nResponse: \"this is a question you are not allowed to ask!\" I was 14 years at this point and knew they are blatantly lying to us and telling us some fairy stories.",
   "created_utc": 1692968271,
   "score": 3,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxok36a",
   "message": "No matter the question, the answer was to \"believe and behave\".\n\nPutting a toe over the line was a ticket to damnation.\n\nOnly, they kept moving the line back to the point where you're caged.\n\nI decided that I'd rather be a free spirit doing things than spend my life in guilt for thinking about them.",
   "created_utc": 1692964351,
   "score": 2,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxokg81",
   "message": "All the wars and conquests in the name of a higher being. Hide behind it so you are forgiven very easy for causing pain, death and other sins. So you can do all of it again and again. Also it's a lot of ego in it, like it's my beeing and only mine. That can not be a good entity, it's pure evil, if you look closely.",
   "created_utc": 1692964543,
   "score": 2,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxokw4e",
   "message": "Science, common sense and the fact that the church can't torture and kill you for questioning them anymore.",
   "created_utc": 1692964779,
   "score": 2,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxolreo",
   "message": "Religious people.",
   "created_utc": 1692965233,
   "score": 2,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxom7br",
   "message": "Genocide, child molestation.",
   "created_utc": 1692965462,
   "score": 2,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxom7sm",
   "message": "Everyone being so damned preachy.",
   "created_utc": 1692965468,
   "score": 2,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxom8ru",
   "message": "Actually studying it",
   "created_utc": 1692965482,
   "score": 2,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxose8s",
   "message": "Church",
   "created_utc": 1692968466,
   "score": 2,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoeh61",
   "message": "Christians, mostly.",
   "created_utc": 1692961076,
   "score": 4,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoin17",
   "message": "Being gay and witnessing a UFO",
   "created_utc": 1692963563,
   "score": 2,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoo251",
   "message": " The Short answer? MTV’s Head bangers ball, skateboarding, 420, 2 live crew and pussy. Been an misfit ever since.",
   "created_utc": 1692966401,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoszub",
   "message": "Christians being fascists and dictating what others do based on the bible, even if said person doesn't follow it.",
   "created_utc": 1692968740,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxogsvg",
   "message": "No games of rock 'em sock 'em deities \n\nI think certain implicit promises were made and have not been fulfilled",
   "created_utc": 1692962506,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxomrp8",
   "message": "Honestly, just the fact that we will literally never truly know. Also the fact that translations have undoubtedly become incorrect or misinterpreted throughout millennia.",
   "created_utc": 1692965752,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxonafs",
   "message": "The fact that it's not true.\n\nIt's not an emotional investment that ended up fruitless, or any kind of vehement disdain towards it on my part. I just don't believe in things that aren't true.",
   "created_utc": 1692966020,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxonkii",
   "message": "Science and observable phenomena",
   "created_utc": 1692966158,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxonyy6",
   "message": "Being gay, researching the sex scandals and how they were covered up, the misogyny, the realisation that it’s basically a cult, and generally thinking it’s all bs",
   "created_utc": 1692966357,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoo7kv",
   "message": "I feel discomfort with other people in church. I have a feeling that I'm not in targeted audience and it's not for me. Something like annoying Facebook ads.\nStill believe in God",
   "created_utc": 1692966476,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxooeyr",
   "message": "Other believers",
   "created_utc": 1692966580,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxooorq",
   "message": "If it's organized religion I'd say the priest sexual assault of children in the Catholic Church and how it was ignored for decades.",
   "created_utc": 1692966714,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxootpy",
   "message": "Honour killings, pedophilia among priests, blatant hypocrisy, the crusades, puritans, extremist groups like the Taliban, all of the various persecutions, the manipulative side of all major religions, racism, homophobia, sexism, lynchings, the kkk, blind loyalty and the associated evils that come with it, the inherent judgemental tribalism. The list goes on and on\n\nAnd to be clear I am talking about all major religions in a general sense, specifically the more conservative aspects and denominations of them",
   "created_utc": 1692966780,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxootul",
   "message": "People",
   "created_utc": 1692966782,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoovlo",
   "message": "Right wing evangelicals and critical thinking.",
   "created_utc": 1692966805,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxooxq9",
   "message": "The whole bullshit thing,  yeah, religion, basically.",
   "created_utc": 1692966835,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxop6z2",
   "message": "Hmm let's pick a few from the multitude of answers I can give...\n\n- My grandfather being a pastor and constantly preaching, while at the same time, molesting me between the ages of 11 and 12\n- Realizing that the majority of religions are meant to manipulate the gullible and are mostly power trips of the few at the top\n- My kids suffering from the fact that their father chose his religion over spending quality time with them\n- My Muslim ex BIL disowning his daughters for not being straight\n- Losing a close friendship because they decided to join one of those tinfoil hat religions with some BS about a rapture or whatever (still so bitter about this one)\n\nI used to believe that most religions had a good foundation in their teachings and it was those who practiced who made them suck. Now I just hate all religions equally and indiscriminately as they all boil down to the same bullshit manipulation and division of humanity.\n\nFuck religion.",
   "created_utc": 1692966959,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxopbph",
   "message": "The pastor s\\*x crimes, and the fact that most are Right-Wing.",
   "created_utc": 1692967022,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxopr9e",
   "message": "Logic. Reason. Being honest with myself.",
   "created_utc": 1692967228,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoq9xs",
   "message": "Hypocrisy.",
   "created_utc": 1692967477,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoqaxi",
   "message": "Religious people",
   "created_utc": 1692967490,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoqepc",
   "message": "That it seems more like religious people are hating on anything not-religious when I see religion as something, people want to have faith with\n\n\nIt shouldn't be about hate, it should be about faith\n\n\nPlus they use their god as an excuse",
   "created_utc": 1692967540,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoqg7m",
   "message": "I had to keep apologizing for shit I didn't understand -- like existing -- in a tiny dark room alone with an old smelly man. Eventually I just told my mom I'm not sorry for anything anymore.",
   "created_utc": 1692967561,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoqmnj",
   "message": "The explanation of The Rapture. Terrified me as a 7 year old and made me doubt everything.",
   "created_utc": 1692967646,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoqx6q",
   "message": "When I was seven, my grandad was very sick. He was dying. I was told that praying would heal him, and take away my family’s pain. So I prayed and prayed and prayed…..and he died anyway. I was told praying would help my family not be so sad. But it didn’t. We were still sad, and empty words did nothing.",
   "created_utc": 1692967783,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoqxfq",
   "message": "Priests raping children .",
   "created_utc": 1692967786,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxor6m5",
   "message": "Probably all the pedos!",
   "created_utc": 1692967906,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxorekf",
   "message": "Studying theology",
   "created_utc": 1692968008,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxorlkm",
   "message": "Grew up in a pretty religious family, and as a kid thought religion seemed pretty legit. \n\nWas on the fence about it all as I got older anyways, but was open to it all still.\n\nlost an infant son, and that sealed the deal for me. I was out.",
   "created_utc": 1692968099,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxortke",
   "message": "Science. \n\nWell, and other religions - current or past - I learnt about. They all seemed so similar, and equally fairy-tale-ish, and the existence and distribution of their believers so much more dependent on power structure than truth.",
   "created_utc": 1692968201,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxortnw",
   "message": "Meta-religion. Eris is a helluva Goddess",
   "created_utc": 1692968202,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxos10a",
   "message": "I grew up with non-denominational Christianity. I was indoctrinated until 16 years of age, when my parents let me make my own decisions. I always had a problem with a God that based the fate of your ENTIRE ETERNITY on a few short years on Earth. That makes absolutely no sense unless heaven is like Japan and has too many people and not enough space...\n\nEdited for grammar.",
   "created_utc": 1692968297,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxos11b",
   "message": "When I learned about the numerous times in history when God could have intervened but didn’t. I think the two major events were the Holocaust and the Rwandan Genocide. They were so inhumane but God let them happen.",
   "created_utc": 1692968298,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoseg1",
   "message": "Truth",
   "created_utc": 1692968469,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxosjzq",
   "message": "The stale crackers. All that loot from the crusades, and we couldn't get anything with frosting at snack time? Bullshit.",
   "created_utc": 1692968538,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxostkr",
   "message": "The whole idea of religion in general was flawed from the start",
   "created_utc": 1692968661,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxosvb4",
   "message": "Religion",
   "created_utc": 1692968683,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoswby",
   "message": "The obsession people have over it",
   "created_utc": 1692968696,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxot3p9",
   "message": "Protestantism emphasis on truth. That kills the religion for you if you follow through with it.",
   "created_utc": 1692968788,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxot4ra",
   "message": "being intelligent and questioning anything being prescribed?  \n\n\nit is a nice moral compass but fuck anyone who is following literal translations as fact.",
   "created_utc": 1692968802,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxotb7u",
   "message": "Religion",
   "created_utc": 1692968882,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxotjgb",
   "message": "Deus Vult",
   "created_utc": 1692968985,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxotjv8",
   "message": "Hypocrisy.  The Bible teaches to love thy neighbor, yet the majority of people I know and even don't know, but clearly profess to follow the scripture hates anybody and everybody different from them, be it if they're of a different faith, nationality, or their skin color is different.",
   "created_utc": 1692968990,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxotwpo",
   "message": "I have a memory from Sunday School that is forever burned into my mind. I was maybe 10 or 11 years old and the preacher is talking about heaven and hell. What they're and how you end up in either one. He hyped up heaven and emphasized how bad hell is. When he got to the point that my default option is to go to the worst place imaginable, I became disillusioned. I wondered if an omnipotent god is so cruel to send people to enternal damnation if they don't believe in this one faith. What about the people who were too young to accept the sky daddy as their savior? What about the people who otherwise lived a good life, but believed in something different.\n\nA couple years later I tried another church that was awesome, but I never felt the holy spirit or whatever gets people to go to church every Sunday.",
   "created_utc": 1692969149,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxou6n6",
   "message": "Religion mostly.",
   "created_utc": 1692969271,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxouacm",
   "message": "Being in the corner, and the spotlight.",
   "created_utc": 1692969316,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxouawz",
   "message": "never believed any of it, fits into the same tin dragos unicorns and pixies.\n\nwhen i found out how much stock ppl put into it, i realised how dumb ppl could be, i was still very young, baffled me.  Still does.\n\n its pure mental illness.",
   "created_utc": 1692969323,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxougfc",
   "message": "The concept of universal sin. \n\nI mean, whoever I was, I start from the shitlist, and somehow have to work, behave and beg towards forgiveness for something I didn't even commit is a fucked up idea in itself. Like motherfucker, I've been good, I haven't committed any of the sins against the ten commandment, yet I somehow am still guilty because my ancestor ate a fucking apple off a tree?",
   "created_utc": 1692969390,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxouj0a",
   "message": "The people.",
   "created_utc": 1692969422,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoultb",
   "message": "I'm too rational for spirituality and faith.",
   "created_utc": 1692969456,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoumx3",
   "message": "Religious people",
   "created_utc": 1692969470,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoupst",
   "message": "\"faith\" = trust me bro",
   "created_utc": 1692969505,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoust1",
   "message": "*The ancient Poets animated all sensible objects with Gods or Geniuses, calling them by the names and adorning them with the properties of woods, rivers, mountains, lakes, cities, nations, and whatever their enlarged \u0026amp; numerous senses could perceive.*  \n*And particularly they studied the genius of each city \u0026amp; country, placing it under its mental deity.*  \n*Till a system was formed, which some took advantage of \u0026amp; enslav'd the vulgar by attempting to realize or abstract the mental deities from their objects; thus began Priesthood.*  \n*Choosing forms of worship from poetic tales.*  \n*And at length they pronounced that the gods had orderd such things.*  \n*Thus men forgot that All deities reside in the human breast.* \n\n\u0026amp;#x200B;\n\nWilliam Blake",
   "created_utc": 1692969541,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxov761",
   "message": "Realizing preachers were just dudes who ramble.",
   "created_utc": 1692969713,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxov9hb",
   "message": "It’s followers.",
   "created_utc": 1692969740,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxovdkn",
   "message": "Islam, I cannot leave as my family would disown me. Some may try to murder me for leaving. There is other stuff too like treatment of women and violence. Everyone shit talks Christians but no one says a word about Muslims",
   "created_utc": 1692969788,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxovkpp",
   "message": "I never felt right believing any fantastical religious assertions as literal truth..",
   "created_utc": 1692969874,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxow3e9",
   "message": "people",
   "created_utc": 1692970102,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxow7vt",
   "message": "Nothing.  Learning more about Catholic teachings and their history, as well as the state of the world and the continued degradation of morals and values has actually made my faith stronger than it used to be.",
   "created_utc": 1692970154,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxowcse",
   "message": "Religion began to fall apart for me when I realized that the supposed inerrant word of God said things that we know are not true. For something that is supposed to be inspired by an all-knowing God, it sure contradicts itself a lot.\n\nOn top of that, the simple idea that an omniscient diety would create me, already knowing every detail of my life, knowing every choice I will ever make, never reveal themselves to me, and then send me to hell for that is pretty fucked up and evil.\n\nReading the Bible made me see that the God of Abraham is truly one of the most evil characters in all of fiction.",
   "created_utc": 1692970212,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxowk57",
   "message": "Rational thought.",
   "created_utc": 1692970300,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxox819",
   "message": "Science is superior because when you can prove a theorie is wrong, the theorie gets adjusted. Religion (and alternative medicine etc) do not tolerate criticism; what is written is fact. Forever. Fuck that.",
   "created_utc": 1692970589,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxox8l3",
   "message": "Critical thinking... Gaining consciousness really",
   "created_utc": 1692970596,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoxa33",
   "message": "When I read the Bible cover to cover and god reminded me of a couple extremely toxic exes. I had given up church already because of other “christians” behavior and believed myself to be some kind of deist. Final nail in the coffin was actually reading the scriptures with an analytical mind as I would anything I was wanting to research. \n\nAll I did was read the Bible with the same kind of mind as when I research what kind of headphones I should buy. It falls apart immediately with just the slightest amount of concentrated analysis.",
   "created_utc": 1692970614,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoy621",
   "message": "the religious people",
   "created_utc": 1692970990,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoygt8",
   "message": "I was fairly devout. At times I spent countless hours in my church (altar server, bible study, went to conferences, etc.).\n\nMy first push away was when we got a new priest, and the focus of every homily/sermon was how those in the community needed to give more money to the church. I waited for change, but it never came. The church seemed like it always wanted money, but wasn’t willing to do more in the community. \n\nMore recently, it occurred to me that many of the most active members of my church, and other fairly “religious” people that I knew, were some of the most vile people I’ve ever come into contact with. They used religion as a cover to be hateful to any population that didn’t fit their mold. \n\nI’ve never looked back.",
   "created_utc": 1692971115,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoymbq",
   "message": "Religion was never “ruined” for me. But I definitely stopped believing in it from a traditional sense once I got to high school.\n\nNow I still “believe”, but it’s kind of my own take, mixed with other stuff I suppose.",
   "created_utc": 1692971177,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoywsg",
   "message": "\"Religious\" people who just use it as a way to hold other people down.",
   "created_utc": 1692971297,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoyyh4",
   "message": "Common sense",
   "created_utc": 1692971316,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoyyn6",
   "message": "The constant bulling by the clergy (priests and nuns) and CCD teachers because I played Dungeons and Dragons.  (and this was in the mid 1980's).",
   "created_utc": 1692971318,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoyyvq",
   "message": "God didn't pick up the phone. Then prayed to Jesus and Mary and they didn't pick up till I was suicidal. But then one day prayed to Athena and she answered IMMEDIATELY. Needless to say I'm pagan now",
   "created_utc": 1692971321,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoyzxy",
   "message": "It’s all about brainwashing simple fucks and money. Look at these churches just collecting, not paying taxes and buying property/assets.\n\nAlso I personally think most people that go to church only do it because they fucked up so bad that they think this will be their get out of jail free card as if they’ve “turned a new lead”. People don’t forget and praising god won’t make you a better person.\n\nIt’s a joke and it’s sad.",
   "created_utc": 1692971334,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoz7of",
   "message": "The truth. It really does set you free...",
   "created_utc": 1692971425,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoz7rz",
   "message": "People using religion as a screen or even a mechanism for their own hypocrisy and corruption.\n\nIn my church community growing up, our first pastor stole prescription medications from the congregation during home visits. Another pastor had a long-term affair with the secretary. During my most formative years, the church ousted a lesbian couple because the couple wanted to become official members. They also ousted the pastor who was going to \"allow\" it. That's when I decided that kind of community did nothing for me.",
   "created_utc": 1692971426,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxozcba",
   "message": "Religious people",
   "created_utc": 1692971478,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxozgcw",
   "message": "The book of Job. I'll never forget being about 11 in Bible study hearing them trying to spin that shit in a good way. The fuck outta here.",
   "created_utc": 1692971524,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxozhf8",
   "message": "living under the Islamic regime of Iran.",
   "created_utc": 1692971536,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxoznjn",
   "message": "I didn't understand why people went to church every Sunday. It was too much of a chore for me.\n\nPlus, most people I knew were b\\*tchy all week, and then all of a sudden were holy- sainty on Sunday. Messed up my perception of people and Christianity.",
   "created_utc": 1692971606,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxozqcf",
   "message": "Religion.",
   "created_utc": 1692971637,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxozrh0",
   "message": "8th grade science class. The lazy fuckers at church either straight up lied about how and why natural phenomena occurred or were too stupid to understand it",
   "created_utc": 1692971649,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxozx8c",
   "message": "I was raised in a religion but just found the answers to my questions to be unsatisfactory. Eventually that turned in to a lack of faith over time, which lasted 5-10 years and eventually admitted to myself that I did not believe.\n\nSo I guess time and unsatisfactory answers.",
   "created_utc": 1692971715,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxozy26",
   "message": "American chattel slavery. Using slavery to pacify slaves, making versions of the Bible specifically for slaves.  You can't tell me an all knowing, all powerful, benevolent God loves you and then subjects you to being black in America.",
   "created_utc": 1692971725,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxozzdt",
   "message": "I had been Catholic most of my life. I went to Catholic grade school and high school. Church every Sunday, every holiday, and every Wednesday during school. Our church did great things for the community- food drives, fund raisers for neighborhood restoration, caring for sick parishioners, Christmas gift giveaways for the poor...our church was like a neighborhood superhero.\n\nIn 2002, I learned at least 1/3 of all of the money we were giving to the church was going to fight sexual abuse lawsuits...including two in our own church. Nothing was every said until a news report exposed it. Even then it was met with denial. \n\nAfter that, I left the church. I couldn't get past the hypocrisy. I'm a very science and fact-based person so I didn't believe the mysticism of church dogma anyway, but I liked the message of helping. Now I just do that on my own without having to follow 2000 year old rules.",
   "created_utc": 1692971740,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp01n3",
   "message": "I was forced to go to Catholic School for grades 1 and 2.  By the time I was done with 2nd grade I was thoroughly 100% against ALL religions.    \n\n\nDo I believe there is something beyond this consciousness? Yes.  \nDo I believe it has anything to do with the stories we created as humans?  Absolutely not.  \n\n\nIF there is anything other than \"nothing\" when we die, it is something we cannot comprehend on any level until we \"get there.\"  \n\n\nParaphrasing George Carlin;  \"Religion is like a pair of shoes.  Find a pair that fits you, but don't try to force me to wear your shoes.\"",
   "created_utc": 1692971766,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp04d3",
   "message": "I never lived in a religious house but at school, about 4 or 5 years old they started teaching us about Jesus and all this stuff he did. They never presented it as religion but rather history and a fact that it is all true. I then heard my Dad mention he didn't believe in Jesus and when I asked him about it he explained not everyone believes in it.\n\nI basically realised then it was all bullshit",
   "created_utc": 1692971796,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp05a9",
   "message": "The outlandish, ridiculous nature of all the stories. I remember growing up and watching TV or reading books with my parents and them going explaining to me the difference in things that were real and make-believe. Then we'd go to church and hear all this stuff that clearly sounded like make-believe, but they'd tell me it was real.",
   "created_utc": 1692971806,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp06k1",
   "message": "All the pedophilia.",
   "created_utc": 1692971821,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp06uq",
   "message": "The Catholic Church",
   "created_utc": 1692971824,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp08wv",
   "message": "God's love was entirely conditional, even though he says he loves us all the same. If god's love was truly unconditional there wouldn't be a hell, nor would he have created evil or the people who commit evil unto others.\n\nThat, and realizing that God sacrificed himself to stop himself from him destroying us... and to me that just seems not so smart for a 'god' figure to do. \n\nIf there is any theory that I believe that involves a god figure, it's the Egg theory.",
   "created_utc": 1692971848,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp09ed",
   "message": "Not neccessarily ruined it since iam still religious but being punished every year in school because i didn't study this or that (We have a subject about the religion of our country which i believe in (which is islam))and get punished back at home wasn't fun as a child",
   "created_utc": 1692971853,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp0b47",
   "message": "Systemic child rape in the Catholic church.",
   "created_utc": 1692971872,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp0e3s",
   "message": "The fact that so much of it is based on bullshit\n\nWe are supposed to see god as a paragon of all that is good\n\nI’ve heard that in the Old Testament he really wasn’t perfection itself\n\nBut people just made a new canon and say the Old Testament was wrong",
   "created_utc": 1692971906,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp0fs1",
   "message": "Logic",
   "created_utc": 1692971924,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp0gy9",
   "message": "I’m an atheist now, but I used to be a very faithful brainwashed Christian boy. Until I started asking the important questions and seeing just how ugly religion was. Although, two passages that always stuck with me for years and comforted me, were the Lord’s Prayer and the 23rd Psalm.",
   "created_utc": 1692971937,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp0nxi",
   "message": "When the nailed a nice Jewish bloke to a cross cos he thought it would be a good idea to tell people to be nice to each other",
   "created_utc": 1692972015,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp0vo0",
   "message": "Logic.",
   "created_utc": 1692972102,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp0voq",
   "message": "Answering questions with weasel words over and over again. No answers, only more mysteries. Also, the congregation was full of hypocrites.",
   "created_utc": 1692972102,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp0xp1",
   "message": "Judgmental ppl",
   "created_utc": 1692972125,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp10b9",
   "message": "I was raised in church. \n\nI \"believe\" in the doctrines of the Christian Church the way most well-educated modern and liberal Christians do: not literally, but as symbols for how we should live our lives and behave toward one another.\n\nBoth my wife and I came from families with many generations of Lutheran missionaries and pastors. I did not go to seminary but might as well have: I taught adult Bible study and gave sermons and did baptisms when my congregation needed someone to fill in. \n\nNaturally, since my wife and I grew up in pastor's families, we took our obligation to financially support the church seriously. I volunteered on the board and counted the money. Most of its budget came from me and my wife. We supported our church with our time, our money, our administrative expertise, and our knowledge of Lutheran history and traditions.\n\nThen the church got a new pastor. He was an arrogant prick. He wasn't very smart or well-educated. He lacked administrative or practical skills. He often got Lutheran dogma laughably wrong, and insisted on displaying the Baptist \"Christian\" flag next to the altar. But he thought lay leaders of the church should defer to him in everything. He even told a master electrician in the congregation how to make electrical repairs.\n\nMy mom (herself a retired pastor) calls his type \"Herr Pastor\". In the early days of the Lutheran Church in America, most of its leaders came from Germany and had very high opinions of themselves. They considered themselves the upper class. Perhaps equivalent to insisting on being addressed as \"sir\", they wanted to be called \"Herr\". This did not go over well in egalitarian America. \n\nBut this new guy was so ignorant that when I started calling him \"Herr Pastor\" to his face he thought I was being respectful. \n\nThen \"Herr Pastor\" told us that we could not sit in the front pew anymore, because our small children were \"disruptive\". \n\nThat was the last straw for me. If it was no longer welcoming for little children, I could no longer pretend that the Church I grew up in still existed. \n\nI gathered my family and left. And took our money and support with us, along with the next generation of little Lutherans. The place still exists but looks run down. Like many Lutheran churches, its congregation is aging. It will be gone in a generation.",
   "created_utc": 1692972155,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp11i3",
   "message": "Ruined implies it used to be fine.\n\nIt never was.",
   "created_utc": 1692972169,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp17zn",
   "message": "My father was in his early 30s when he served some time in the CDC working as a surgeon's assistant in Afghanistan. His stories of his \\~3 months there were always about how they had to keep recovering patients heavily sedated else they'd try to kill the other people OF OTHER RELIGIONS. The outfit constantly had to ration sedatives  **to keep the patients from murdering each other.** Two of his stories always stuck with me as horribly tragic.\n\n\\~\n\nOne sweltering summer day, on one of the days they'd run out of sedatives, my father was on watch duty \u0026amp; passed out from exhaustion. While he napped, one soldier --who had recently been maimed by a mine blast--wriggled out his arm from his restraints an crawled over to a sharps box and PRIED IT OPEN. He took a scalpel and though he was a 1-legged, 1-armed wreck, maimed and/or killed 7 other patients. The soldier, bleeding this entire time, nearly faints from bloodloss, waking up my father. The soldier puts up horrible racket--summoning several other  nurses that had been nappin nearby. The soldier, screaming about how they had to kill the defilers of Christ \u0026amp; decided to struggle themself to death rather than live with the horrible life they were facing.\n\nTurns out the soldier had, several weeks prior, been on patrol, for his outfit. He saw locals peeing on his outfit's makeshift cross several hundreds of yards away. Blinded by rage, the soldier had run straight towards them but also into a minefield; when he came to, the first thing he associated the other patients with was the people who had defiled the outfit's cross.\n\n\\~\n\nAnother story: A young soldier, on road-construction detail, gets waylaid by locals herding their goats and making a ruckus. The soldier snaps. He took a combat knife \u0026amp; stabbed several CIVILIANS. The civvies, once brought to the surgery outfit, claimed the kid was a \"muslim-hating jew.\" According to the psych-evaluation they processed a week later, the kid was a Jewish-Russian soldier and was dismissed from their tour. This same week, the same injured civilians-on a stroll after nearly a full recovery--attack the *Allah-hating Christian fucks* in a temporary quarantine nearby (again, more civilians) but also exposed themselves to Measles. All of the civilians were given a shot, except for one elderly person who slipped the notice of the overworked staff. The man was later found \u0026amp; confronted in their village, but because the local mullah refused to let the person get a shot, *over 20 children died from a 100% preventable disease*.\n\nThe stories went on and on. No wonder my father suffered horrible trauma from his time as a surgeon's assistant in Afghanistan.",
   "created_utc": 1692972242,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp181d",
   "message": "I prayed to god when i was little, asked him for proof that he existed and I would dedicate.all my life on him, nothing happened, stopped.believing in him",
   "created_utc": 1692972243,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp19om",
   "message": "Religion itself did. It's a dogma that doesn't match reality, and when questioned it rejects reality for autocratic worship. Fuck that, fuck that straight out of existence, because that's where it belongs. Reality and truth don't mind being questioned, indeed the opposite, they beg you to question so you can understand. But a religious mind will never learn, instead they double down, triple down, etc. until their ignorant deaths.",
   "created_utc": 1692972262,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp1cj3",
   "message": "I was not raised religious. My mom took me to a CCD class when I was 5 or so, and I asked “if god loved his son so much, why did he let him die?” And I wasn’t invited back!",
   "created_utc": 1692972293,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp1f9m",
   "message": "Clergy fucking children and a supposedly loving god did fuck all about it.\n\nThere is either no all-seeing, omnipotent god or he's into viewing child porn.  There is no third option.",
   "created_utc": 1692972324,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp1ltb",
   "message": "The unrealistic story line.",
   "created_utc": 1692972398,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp1rfs",
   "message": "people using it to put others down like its some kind of excuse to be hateful.",
   "created_utc": 1692972462,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp1uhr",
   "message": "The idea that the other religions are just silly nonsense.",
   "created_utc": 1692972495,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp1uod",
   "message": "The predictionssss",
   "created_utc": 1692972497,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp212r",
   "message": "Being able to use my brain.",
   "created_utc": 1692972568,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp21x1",
   "message": "The story of Job, and how everyone ignores that his first wife and children got wasted for a bet.\n\n\u0026gt;But he got new ones?\n\nBut they got dead. For nothing, because Big G is all-knowing and already knew he was going to win the bet before he made it. Everyone focuses on Job getting new and better stuff for being faithful, and not all of pointless collateral damage to people around him.",
   "created_utc": 1692972577,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp29df",
   "message": "Having a fanatical dad who opts to live in the middle of the mountains on a compound of like minded people. Religion gives shit ptsd",
   "created_utc": 1692972659,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp2a6m",
   "message": "Bad luck",
   "created_utc": 1692972668,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp2c9r",
   "message": "Love Jesus.  Love his message.  Not too big on his fan club.",
   "created_utc": 1692972691,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp2fru",
   "message": "It had been a downward slope for years but what really made me shut down and completely remove myself from Christianity was when I came out to my mom and she said, \"God doesn't weigh sin, and it doesn't sit right with me that you're feelingg like this. Being gay has the same amount of sin as being a murderer, you know.\"\n\nReally put it in perspective, like \"Is this really what I want to stay in?\" And the answer was that I value myself more than some sky daddy LMAO",
   "created_utc": 1692972730,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp2gks",
   "message": "Religious people",
   "created_utc": 1692972739,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp2jhj",
   "message": "A cover to cover gander at the bible. I had questions before. After that it was over.",
   "created_utc": 1692972771,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp2ko7",
   "message": "Never enjoyed it enough to have it ruined for me in the first place",
   "created_utc": 1692972784,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp2lkz",
   "message": "Found out about the Holocaust.",
   "created_utc": 1692972794,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp2otv",
   "message": "Aggressive preachers and hypocrites",
   "created_utc": 1692972831,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp2p7k",
   "message": "Define religion",
   "created_utc": 1692972835,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp2qfv",
   "message": "Religious people.  The extreme hypocrisy.  And critical thinking.  I was raised in a born again Christian household with cult culture that Christian people dont seem to realize is Christianity is a cult. By definition and one that was kicked out of Europe by older Religious organizations. It became clear at a young age for me. Christians were the sole reason for my eye opening realization. And now in the information age it just become more and more obviously brainwashed masses following the lemming in front of them throughout generations of unknowing sheeple. It not my job to debate facts against beliefs nor am i interested in enlightening people who are relatively happy in their ignorance.  I find comfort that idiots out there arent doing bad things because they believe someone is watching and judging them at all times. Alot of people out there would do horrible things without it.",
   "created_utc": 1692972849,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp2tbe",
   "message": "There were two points in my life. One, as a young tot I noticed the world was sorta screwed up and if this God fellow was so great, nice and powerful as they claimed he was in the church I attended, why isn't he doing something about it? I just didn't believe it to be true. This was further cemented in my mind as I learned about basic science, just verifying shit with evidence and facts, it just made the whole religion thing seem unreasonable. \n\nNext was in college, I had the Epic of Gilgamesh and then the Bible as required reading. Both books read similarly, and are also similar in how outlandish they are yet one is religious text the other is just some old ass book. Shortly after that I had a Religious Studies class where I learned about hundreds of different religions and I was able to surmise with total confidence religion is just a way to explain unknown phenomenon, and in today's world of information no sane person can employ religion rationally. Also! And this is my favorite theory...religion was used by people in power to control larger groups of people within their sphere and it was at this point in human history, coupled with the advent of agriculture, that humans went from living in small bands to much larger groups and eventually cities! Religion kept people fearful and honest, so religion became a tool of consequence. Its fearmongering helped create civilization as we know it. Fascinating!",
   "created_utc": 1692972880,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp2v51",
   "message": "People that act mean because their religion dictates it. Just be kind..",
   "created_utc": 1692972901,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp2vaq",
   "message": "I was raised Catholic. Once I reached the age of reason and realized Catholicism is full of sexism against women and pedophile priests, I left and never went back.",
   "created_utc": 1692972903,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp300l",
   "message": "I was never really religious from the start. What made me leave my church behind was the publication of way to many SA cases within the catholic church in Germany. Yes this is bad but what broke the camels back was the church trying their hardest to hide it and have been hiding it for decades. I will not financially support a company filled with child molesters. I can have faith in a religion which allows and hides its members doing such awful things they themselves \"claim\" being bad.",
   "created_utc": 1692972956,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp32tg",
   "message": "Manipulation of innocent children",
   "created_utc": 1692972986,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp37h3",
   "message": "I learned that religion was an early way to explain the world, but now we have other ways so religion has no use to me anymore",
   "created_utc": 1692973036,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp37zb",
   "message": "Outgrowing imaginary friends.",
   "created_utc": 1692973042,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp39uy",
   "message": "All the pedophile priests.",
   "created_utc": 1692973063,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp39vf",
   "message": "Whenever I asked something I didn't understand when I was a kid  (like why are women and men different, or how did we go from monkeys to humans, kid questions), they'd just say \"(insert god) did it, don't question it\".\n\n\u0026amp;#x200B;\n\nOh, also basically saying \"fuck any other religion\" that all religions have.\n\nSeriously, whenever I talked with a christian/jew/muslim about christianity/judaism/islam, they'd keep saying those are \"not real believers\", mostly seen it with muslims to be honest.",
   "created_utc": 1692973063,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp3dat",
   "message": "People.",
   "created_utc": 1692973100,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp3fv3",
   "message": "The people",
   "created_utc": 1692973128,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp3j1z",
   "message": "All of them",
   "created_utc": 1692973163,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp3jgf",
   "message": "church",
   "created_utc": 1692973168,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp3jud",
   "message": "Originally it started off as spite for my life circumstances. Over time I actually did see contradictions in the Bible and after reading every single book (even what is considered non canonical) yeah no thanks that’s a little to whacky for me to follow",
   "created_utc": 1692973172,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp3k6y",
   "message": "The idea that God forgives all sins, except being born into the wrong faith.",
   "created_utc": 1692973175,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp3o3h",
   "message": "Our priest got arrested. Not for the normal thing, but taking advantage of dying widows and having them rewrite their wills giving their money to him and the church. \n\nMultiple felony counts when it came out, he did a short time in jail and then was transferred to another parish across the country.",
   "created_utc": 1692973217,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp3sa6",
   "message": "It was never ruined for me because I never believed in any despite being forced to practice it as a kid. Seeing what religion does to people now makes me even more distant from it. Catholic Priests becoming pedophiles, people being killed in the middle east for not practicing or even believing in Allah, cows not moving off the road in India when people just try to get to work, etc.",
   "created_utc": 1692973261,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp3zta",
   "message": "Religion.",
   "created_utc": 1692973341,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp41iq",
   "message": "Christian Nationalism, Mormons, Baptists and evangelicals.",
   "created_utc": 1692973360,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp42f0",
   "message": "The hypocrisy of organized religion being greedy and judgmental",
   "created_utc": 1692973369,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp44a6",
   "message": "I don’t dislike religion but it’s fans are terrible",
   "created_utc": 1692973389,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp44nj",
   "message": "\"If it wasn't for christians, I'd be a christian.\" Mahatma Gandhi",
   "created_utc": 1692973392,
   "score": 1,
   "submission_id": "160vwat"
  },
  {
   "comment_id": "jxp46zu",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "160vwat"
  }
 ]
}