{
 "submission_id": "160zgap",
 "title": "People who wear glasses how did you know you needed them with no one else’s vision to compare to?",
 "selftext": "",
 "created_utc": 1692970376,
 "permalink": "/r/AskReddit/comments/160zgap/people_who_wear_glasses_how_did_you_know_you/",
 "score": 168,
 "url": "https://www.reddit.com/r/AskReddit/comments/160zgap/people_who_wear_glasses_how_did_you_know_you/",
 "comments": [
  {
   "comment_id": "jxoy7l8",
   "message": "I don't think the street signs are supposed to be blurry until you're right up on them",
   "created_utc": 1692971009,
   "score": 242,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoxryp",
   "message": "Having to squint to read the blackboard in school is usually a give away",
   "created_utc": 1692970826,
   "score": 127,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoyuld",
   "message": "My dads girlfriend had a rule that we started when I was 12, everyone goes to the optometrist, then every 2 years after that! Found I needed glasses first visit. I didn’t know.",
   "created_utc": 1692971272,
   "score": 199,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoxqsy",
   "message": "I started squinting more in 3rd grade to see the chalkboard, developing headaches as a result, which lead my mother to take me to the eye doctor.",
   "created_utc": 1692970812,
   "score": 103,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoxspm",
   "message": "Family was pointing at planes in the sky, planes I could not see.",
   "created_utc": 1692970835,
   "score": 28,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoxduu",
   "message": "Tried on my dad's glasses, things looked clearer.",
   "created_utc": 1692970657,
   "score": 75,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoze1m",
   "message": "Was out for a walk with my da, thought I saw a load of sheep in a nearby field, only for my da to tell me those are swans not sheep.",
   "created_utc": 1692971498,
   "score": 23,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp0xzc",
   "message": "I was about 20 I think, and I was driving a lot on the highway. This was in the days before GPS so you had to read the signs to know where you were going. I recall there was a major exit from one highway to another. I knew it was coming up, but this was the sign era - you had to read it. Had my girlfriend at the time in the car with me, and as was usual for me, I couldn't see the sign until I was almost on top of the exit, at which point I'd haul off and there you go. Normal driving.\n\nMy gf said, could you really not see that sign? I said, of course not. Why, could you? And she said, yeah, about 20 seconds ago.\n\nOh...\n\nGot glasses soon after that.",
   "created_utc": 1692972128,
   "score": 221,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp0b5u",
   "message": "I flat-out couldn't see- nearsighted in one eye, farsighted in the other, and legally blind in both to boot 😂",
   "created_utc": 1692971873,
   "score": 96,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoyg1v",
   "message": "Migraines.. a lot of migraines and I could feel my eyes hurting/getting tired",
   "created_utc": 1692971106,
   "score": 143,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp0zz9",
   "message": "Standard vision test during 8th grade. It was the first time I couldn't clearly see all the letters on the chart, and it was kind of devastating because I really wanted to be a commercial airline pilot up until then.",
   "created_utc": 1692972151,
   "score": 79,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxozbem",
   "message": "Because my vision was fine when I was younger and slowly got worse \n\nFor people born with poor eyesight well everyone is recommended to get their eyes tested every so often just like going to the dentist for a check up so I guess that’s when they find out",
   "created_utc": 1692971468,
   "score": 47,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoy1jx",
   "message": "In Year 3 we started sitting in alphabetical order of surnames instead of first names. I went from sitting right near the front to sitting at the back, and immediately began failing every subject. When my parents asked why, I said that the teacher’s handwriting was too small and I couldn’t see what she had written on the board. They took me to the optometrist and it was determined that I was shortsighted as fuck",
   "created_utc": 1692970938,
   "score": 64,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp057h",
   "message": "I didn't, we had a medical thing at school and I had to read what I saw on the board\n\nTurns out I got the words wrong and was referred to an opticians\n\nI can't remember how long my vision was impaired for, I thought it was normal",
   "created_utc": 1692971806,
   "score": 28,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp1yzd",
   "message": "My elementary school did regular vision and hearing screenings. I was caught in 2nd grade.",
   "created_utc": 1692972545,
   "score": 47,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxowz4o",
   "message": "I don't know the blurry vision, probably what clued me in.",
   "created_utc": 1692970482,
   "score": 45,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp0f6k",
   "message": "The subtitles on the shows I was watching were white text on a black box background and the white text was like...shooting upward? I don't know how to describe it well. I would have to squint to make it stop. \n\nI got my eyes checked and found out I have a pretty decent astigmatism. Turns out lighted objects shouldn't be sending off long-ass light rays.",
   "created_utc": 1692971917,
   "score": 38,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp1i08",
   "message": "When i stabbed my child while cutting his sandwich",
   "created_utc": 1692972355,
   "score": 18,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxowx51",
   "message": "When alot of stuff turns fuzzy you should visit a doc",
   "created_utc": 1692970457,
   "score": 9,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp202q",
   "message": "When I went to get a driving license. There is an eye test and it was determined that I needed glasses. I didn't think that was true until I got the test glasses and suddenly the world was in 8k HD",
   "created_utc": 1692972557,
   "score": 80,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp3c5j",
   "message": "I didn't until I was about 14. Then a teacher noticed me squinting and had my parents do an eye test. Immediately after that my grades went from Cs to straight As.",
   "created_utc": 1692973087,
   "score": 10,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpa488",
   "message": "How about comparing your current vision to the vision you used to have????",
   "created_utc": 1692975683,
   "score": 14,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpcoib",
   "message": "Think about it for a min …..",
   "created_utc": 1692976649,
   "score": 5,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoxlpj",
   "message": "Blurry vision",
   "created_utc": 1692970752,
   "score": 5,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp3elb",
   "message": "My school did eye tests for every student each September",
   "created_utc": 1692973115,
   "score": 6,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpfe81",
   "message": "Regular appointments with the eye doctor",
   "created_utc": 1692977656,
   "score": 16,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoz47g",
   "message": "I got the advice from my opticians...",
   "created_utc": 1692971385,
   "score": 3,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoz7sc",
   "message": "Not being able to read anymore was a pretty big clue",
   "created_utc": 1692971426,
   "score": 9,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxozaka",
   "message": "6th grade. The board was blurry from the last row, but I noticed my friends didn't have any trouble reading it.",
   "created_utc": 1692971458,
   "score": 8,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp1pmm",
   "message": "Walking on the street and almost passing friends until they hailed me. I realised I was looking at the ground and not looking up at all.",
   "created_utc": 1692972441,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp26sm",
   "message": "When I almost rear ended two cars in traffic while squinting when I was 18. Told my mom, told me I had bad vision and got glasses soon. No cars were damaged.",
   "created_utc": 1692972631,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp2wan",
   "message": "I wasn’t entirely sure my eyesight was still good enough to drive without them.\n\nI was right, annoyingly.",
   "created_utc": 1692972914,
   "score": 5,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp3ez2",
   "message": "My face had to be like 6 inches away from the tv screen in order to actually see what was on.",
   "created_utc": 1692973118,
   "score": 7,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp49hp",
   "message": "\n\nI knew in grade 7, where I couldn’t see the chalkboard clearly I was getting headaches and blurred vision. I kept it to myself until I get to grade 9 and my marks were getting horrible. By grade 10 I was wearing glasses.",
   "created_utc": 1692973444,
   "score": 3,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpfbc9",
   "message": "Having them since 13 y. Pupils are tested yearly.  \nAs an adult, I would probably realise that other people can read stuff I cannot?",
   "created_utc": 1692977626,
   "score": 5,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpgz5e",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxph004",
   "message": "couldn’t see the whiteboard in school when my friend sitting beside me could.",
   "created_utc": 1692978244,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxplu18",
   "message": "Because you _can_ compare it to someone else’s vision. If you’re sitting in a classroom and people next to you and behind you can see the board, but you can’t, then your vision is worse than theirs.",
   "created_utc": 1692980009,
   "score": 33,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxplwiz",
   "message": "Regular optometrist visits. You go every 1-2 years and they use trial lenses to see if any of them improve your natural vision. Eventually, they did.\n\nTrees a good distance away still having individual leaves now was pretty crazy.",
   "created_utc": 1692980035,
   "score": 5,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpnl7p",
   "message": "At 12 I started having trouble reading the blackboard.",
   "created_utc": 1692980659,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpnm2t",
   "message": "because i couldn’t see the board in school. \n\ni remember getting glasses for the first time and seeing how distinct the leaves were on trees. they had always been a green blur to me lol",
   "created_utc": 1692980667,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoz6ks",
   "message": "There's this thing called an eye doctor. \n\nThey spend years learning how to tell if someone has vision issues or not. They become experts on it. \n\nSo I went and saw an expert, and they showed me how the glasses would allow me to see better. \n\nAnd, guess what? *I fucking listened to the expert on the matter.*",
   "created_utc": 1692971412,
   "score": 252,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpfm9d",
   "message": "I realized in 7th grade science class when my table mate could see the board and I couldn’t.  I was usually in front of the class so the teacher could keep an eye on me",
   "created_utc": 1692977737,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpa1s8",
   "message": "If you can read this, you don't need glasses!",
   "created_utc": 1692975657,
   "score": 255,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoy6vu",
   "message": "Well when the teacher tells your parents you’re squinting, you have to get those annoying things.",
   "created_utc": 1692971000,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxoyjf5",
   "message": "I couldn’t read written words on a page.",
   "created_utc": 1692971144,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxozemo",
   "message": "When you start trying to read and it gets more difficult and blurry",
   "created_utc": 1692971504,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxozf4p",
   "message": "Sat towards the back of the classroom one day, couldn't read anything on the chalkboard, girlfiend sitting next to me could.\n\nEdit:  Girlfriend, not girlfiend.  She was a not a fiend.",
   "created_utc": 1692971510,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxozht2",
   "message": "Either you were fine whem you were younger and noticed your vision get worse. Or you were a kid and ypur parents noticed you bumping into shit",
   "created_utc": 1692971540,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxozq8x",
   "message": "My mom took me for regular eye exams as a kid- suddenly in 7th grade, I needed glasses.",
   "created_utc": 1692971636,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxozzan",
   "message": "I was in school the chalkboard was harder to read.",
   "created_utc": 1692971739,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp0bit",
   "message": "In 3rd grade I started having to go up to the front of the class to copy the chalkboard.  My teacher told my mom, who then scheduled an eye appointment.",
   "created_utc": 1692971877,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp0f1j",
   "message": "I actually found out on my mock driving test when my instructor asked me to read a license\n\nplate from 20 meters away.",
   "created_utc": 1692971916,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp1c1d",
   "message": "I had an eye test aged 11 and they said my eyesight wasn't perfect but not bad enough to make glasses worthwhile. When I got my eyes tested a few years later before starting to learn to drive, they said I was technically within the legal limit to drive with uncorrected vision, but it was right on the borderline, and they recommended glasses. My eyesight has got a bit worse since, and while I definitely benefit from glasses, I can get by without for most everyday tasks.",
   "created_utc": 1692972287,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp1ipg",
   "message": "People’s faces started getting blurry",
   "created_utc": 1692972363,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp1nca",
   "message": "Other people could see the whiteboard much more clearly than me.",
   "created_utc": 1692972415,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp1tdf",
   "message": "Pokemon came out and I started playing a lot of Gameboy. Couple weeks later I started getting crazy headaches from squinting to see it.",
   "created_utc": 1692972482,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp1yc4",
   "message": "Eye test as a regular physical when I was 15. Had no idea things were a little blurry til I got my first pair. That was a pretty exhilarating moment.",
   "created_utc": 1692972538,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp2hs4",
   "message": "I had been prescribed glasses as a pre-teen for reading, but never wore them.  In my very early 20s I started working manufacturing springs and working with very small tooling and wire I would have a severe headache after work and into the evening.  After several months someone at work suggested I get my eyes checked.  Started wearing glasses at work and no more headaches.",
   "created_utc": 1692972752,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp2i55",
   "message": "My teachers kept having me move to the front of the classroom to see better",
   "created_utc": 1692972756,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp2sb2",
   "message": "I guess my mom noticed that I read with the book or magazine pretty close to my face.\nSie then took me to have my eyes checked, and bingo - I needed glasses.",
   "created_utc": 1692972869,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp2ttu",
   "message": "Can't see writing or faces  at a distance ..it's all blurry.\n\nAlso [astigmatism](https://www.insightvisioncenter.com/what-does-astigmatism-look-like/)  tho for me it's less than half as bad as the first picture , it's a bit worse when it's raining . I figured this one out after comparing my vision with my mom's ,she wears glasses.",
   "created_utc": 1692972886,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp2u3z",
   "message": "I sat at the back of the classroom, and I had to squint really hard to see. Other classmates in the same position could write what was on the board just fine. I began suspecting something was wrong, et voilà.",
   "created_utc": 1692972889,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp2yzt",
   "message": "My left eye sucks ass and I can't see shit out of it",
   "created_utc": 1692972944,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp2zbm",
   "message": "Lol. I always thought it was normal to see 3 moons. Realized I needed my eyes checked once my brothers told me they only saw one. They also told me to just focus on the moon in the middle 😂 after that I was more observant of how blurry things were. Now I can hardly read signs that are 6 feet from me! SMH",
   "created_utc": 1692972948,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp33jq",
   "message": "I had an eye injury in the 8th grade because I caught a handball with my face, which led to my dad taking me to see his ophthalmologist. He determined that I was nearsighted, so I got glasses that helped me see the chalkboard better. \n\nBy the time I was in my mid 20s, I was already wearing bifocals, because I inherited terrible eyesight from my dad (who himself was legally blind without corrective lenses).",
   "created_utc": 1692972993,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp348t",
   "message": "Headaches, motion sickness, and bumping into things. One of my eyes is a full power weaker than the other, so my depth perception is not great without me really straining to focus. University classes did me in, and I began wearing glasses full-time.",
   "created_utc": 1692973001,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp34nq",
   "message": "When I had to keep increasing the text size on my phone so I could read it clearly.",
   "created_utc": 1692973006,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp3e2o",
   "message": "I couldn’t read the road signs until I was right on top of them. I also noticed one eye was better than the other. I couldn’t drive like that, so I had to get them.",
   "created_utc": 1692973109,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp3h8r",
   "message": "I got glasses at 18 years old. Had perfect vision my entire life until that point, then my eyes rapidly went to shit and I developed double vision.\n\nI knew I needed them since I knew what 20/20 vision looked like for most of my life. I could see multiple copies of everything, too, which is pretty easy to notice.",
   "created_utc": 1692973144,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp3n4o",
   "message": "I was in the back of the class struggling to see. In second grade we all had our eyes tested. I needed glasses really bad. I have a degenerative disease messing with my entire body, but also my eyes.\n\nEvery year my eyes get slightly worse. But it's slowing down. I haven't needed a new prescription for 5 years now.",
   "created_utc": 1692973207,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp3vg8",
   "message": "Started to get unexplained headaches. Turns out my right eye was picking up slack for my left eye.",
   "created_utc": 1692973294,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp3wd2",
   "message": "Tons of things can tip you off: your vision seems worse that your own vision was before, you can’t see things clearly but other people can at the same distance, when you’re a kid you have regular checkups that your parents take you in for and the doctor tests your vision.",
   "created_utc": 1692973304,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp3zor",
   "message": "When I was in the 3rd grade, my mom suspected my eyes were bad and asked me to count the telephone wires behind the house.  I told her that they were like 50 feet away and there was no way to do that.  I thought I had normal vision.  She had my vision checked.\n\nI vividly recall getting my first glasses and looking out the optometrists 2nd floor window into the town and marveling at everything I could see.\n\nWhile not literally true, imagine being blind, not knowing it, and then being cured.",
   "created_utc": 1692973340,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp3zvo",
   "message": "I was a carpenter. Got so that I couldn't see millimetres!",
   "created_utc": 1692973342,
   "score": 3,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp4073",
   "message": "When I ran into the wall",
   "created_utc": 1692973346,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp418p",
   "message": "When my mother first got glasses when she was 7 she said that the thing that amazed her was that all trees had individual leaves. Everything far away was just a blur to her.",
   "created_utc": 1692973357,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp4738",
   "message": "Funny story, I did not realize I needed glasses until my 20's sadly enough, I was clued in when my wife then girlfriend mentioned it's not normal to have to squint at road signs at night.",
   "created_utc": 1692973418,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp48g8",
   "message": "I knew the moment I could no longer read the scoreboard at Busch Stadium w/o binoculars",
   "created_utc": 1692973433,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp4b2v",
   "message": "I wanted to buy a house.\n\nI had an expired drivers license\n\nfailed the vision exam\n\nneeded to get glasses to pass the vision exam to get a valid drivers license to buy a house.",
   "created_utc": 1692973461,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp4bce",
   "message": "When I was doing my driving lessons and my instructor pointed out I cannot fucking see.",
   "created_utc": 1692973464,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp4fg6",
   "message": "I had trouble seeing the blackboard when I was 12 years old.  I didn't have trouble previously.",
   "created_utc": 1692973508,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp4j4i",
   "message": "My teacher in eight grade saw me struggling while reading the book he assigned to us.\n\nHe asked how long I had dyslexia and when did I notice my vision starting to fade.\n\nI had no idea I was suffering from any of those things so I was blown away.\n\nHonestly wished I had met that teacher earlier.",
   "created_utc": 1692973549,
   "score": 6,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp4rel",
   "message": "In school, I would have to walk up to the board and squint to take notes. My parents would have to read billboards to me as a kid because my vision was so bad, and I needed to know what the cartoon parot was saying.",
   "created_utc": 1692973638,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp4t7q",
   "message": "They thought I had a learning disability. Then first day of 2nd grade, one of my classmates started school with new glasses. Mom took me to the eye doc. Turned out I just couldn't see!",
   "created_utc": 1692973658,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp4uma",
   "message": "Couldn't read shit on the whiteboard at high school. Complained \"why do I have to sit where I can't see what you're writing?\" thinking everyone saw like I do. Turned out I needed glasses.\n\nApparently my glasses aren't very strong, vision isn't terrible, just can't focus for shit. If I squint really hard, I basically see normally without glasses.",
   "created_utc": 1692973674,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp52tm",
   "message": "I went to an eye doctor as a kid and he told me I eventually would need glasses. It was not until college that I couldn't see what the professor was writing on the board that I made an appointment and have been using them since.",
   "created_utc": 1692973763,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp5366",
   "message": "Nobody else seemed to have trouble reading the whiteboard. Then I found out you’re supposed to be able to see detail further than arms length away and that pretty much sealed the deal.",
   "created_utc": 1692973767,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp53q1",
   "message": "I knew when I couldn't make out street signs while driving until I was almost on them.",
   "created_utc": 1692973772,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp587m",
   "message": "I remember in school in maybe 2nd grade, the school nurse said that kids often learn they need glasses because they have trouble seeing what's on the chalkboard. I remember thinking that sounded impossible. How could someone not be able to read that giant chalkboard?\n\nThen we got a new teacher in 4th grade. I remember coming home from school one day early that year and my mom asked me how I liked the new teacher. I said, \"He's okay, but I don't like the way he writes on the chalkboard. It's like he doesn't make the letters dark enough. I can never read what he writes on there.\"\n\nEven as the words were coming out of my mouth, I remember thinking, \"Oh, no...\" remembering that school nurse. And my mom said, \"Yeah, we should probably make an appointment with an eye doctor.\" And the rest is four-eyed history.",
   "created_utc": 1692973821,
   "score": 3,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp5cuh",
   "message": "I’ve had glasses since before kindergarten, so I barely remember life without them. They caught it at my pre-k health screening. I do have a vague recollection, though, of just feeling confused all the time as a young child. I was so nearsighted that not only were shapes blurry, it was hard for me to differentiate colors at a certain distance. Glasses switched a flip on in my brain, like “okay I can function properly now.”",
   "created_utc": 1692973871,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp5d3h",
   "message": " So I have 1 good eye and one bad eye, I got them looked at like 7 years ago when I was 25 and the doctor said that I should be fine since I don’t get headaches and the fighter pilot quality eye balances out the blurry one. \n\nI spend my day these days looking at screens and I know I could be straining from them being so close or blue light messing with me, but something tells me it’s being amplified by my shitty eyes idk. Like my light sensitivity and eye pain is much worse than anyone else’s. (My gf works the same job in the same house as me, and she is fine with it).\n\nShould I go to the doc? I’m literally wearing sunglasses right now because I woke up with eye pain.",
   "created_utc": 1692973873,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp5dkb",
   "message": "Headaches and squinting",
   "created_utc": 1692973878,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp5fus",
   "message": "I was working as a bartender and over the course of one week I could no longer read anything on the back bar. Tuesday service, not an issue; Saturday completely blurred. I’ve worn glasses daily since.",
   "created_utc": 1692973903,
   "score": 1,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp5fwi",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpaor2",
   "message": "“Mom, my grades are bad because I can’t read the board at school.”\n\n“No, you’re just lazy.”\n\nAnd then the school did an eye test.",
   "created_utc": 1692975899,
   "score": 10,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxq8q72",
   "message": "I didn't! I found out I could get an eye test for free, so I went in for a laugh.\n\nAnd came out with a prescription.\n\nFor the first few days of glasses I was really dizzy, but now I can't get over how much fewer headaches I get, and how not-overwhelming it is to go grocery shopping. Happy days!",
   "created_utc": 1692988566,
   "score": 7,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpax7p",
   "message": "short answer: headaches. massive headaches. and school eye screening. \n\nlonger answer: little like 5 year old jeynespoole failed the school vision screening. So did little 6 year old jeynespoole, little 7 year old jeynespoole, little 8 year old jeynespoole, little 9 year old jeynespoole. I also got pretty regular headaches, more as the school work got more academic and vision-based. And every year my mom would take me to the eye doctor, and the eye doctor would say that he didnt want to give me glasses because my \"eyes would become dependent on them, and there's no way the kid's vision is giving them headaches\" So then by 5th grade, we moved across the state, I was getting massive migraines by lunchtime every day, But since we had moved, my mom took me to a different eye doctor who was like WHY THE HELL DOES THIS CHILD NOT HAVE GLASSES YET?! and then I got glasses and the headaches magically stopped!",
   "created_utc": 1692975986,
   "score": 9,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpplkv",
   "message": "In 9th grade a friend said \"look at those hot cheerleaders across the gym\". I could not see the pretty girls, which was unacceptable at 15 and made me figure out why.",
   "created_utc": 1692981407,
   "score": 8,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpbnv7",
   "message": "I was at a sports bar and everyone at my table was reading the small text on the bottom of a tv on the wall.  I asked how they were able to read it from where we were sitting, and they were all surprised I couldn't read it.\n\n I went to the eye doctor soon after. He told me I had probably needed glasses for years. The first time putting them on was mind blowing. Seeing individual leaves on trees was crazy to me.",
   "created_utc": 1692976265,
   "score": 5,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp5knc",
   "message": "The stars were disappearing.",
   "created_utc": 1692973954,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp79lm",
   "message": "My psychologist told me is was very concerning how angry I always was and that I could not acknowledge that I actually was angry. How everybody in the room could see that I was angry and that I should learn to recognize my own anger before starting group therapy. I realized that all the writing and reading an  watching thinfs on a screen gave me terrible headaches and told em that and they said it was me being angry. I went, got glasses en never heard I was angry again until I needed new glasses.",
   "created_utc": 1692974607,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp7a4h",
   "message": "Born crosse eyed so I don’t remember life without glasses",
   "created_utc": 1692974613,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp9te7",
   "message": "In my experience it’s not the child or person who notices they need glasses. It’s the teachers and family and friends in their life who do.",
   "created_utc": 1692975569,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpakgd",
   "message": "I (21M) got my glasses recently when I started doubting my vision at work, needing to squint at weird distances which I am certain I used to see clear in, than I talked to  a 70 Y/o acquaintance who immediately told me that's worth glasses, took a test and was SHOOK at how crisp everything was.\n\n1 week later I had my glasses and I wear them while at work or outside, I can see pretty good with -1 vision in both eyes but it helps make everything more crisp, also driving is waaaay better since I can actually read the signs and license plates",
   "created_utc": 1692975854,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpc84l",
   "message": "I was in the military all my life, passed all the eye tests without problems etc.\n\nRecently left and the opticians told me I have pretty extreme astigmatism, I've worn glasses for a year now and it is genuinely life changing. \n\nSeeing my daughters face clearly, reading signs etc.\n\nIm 37.",
   "created_utc": 1692976476,
   "score": 4,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxprj99",
   "message": "I tested my vision against my own eyes. I could see the board clearly with my right eye, but it was blurry with my left",
   "created_utc": 1692982136,
   "score": 3,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpttjm",
   "message": "Things on my left were blurry. Things on my right clear",
   "created_utc": 1692982977,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpvnvw",
   "message": "My left eye has been bad for decades, but my right eye was always good.\n\nI had a digital clock that sat 10ft away from my bed for about 5 years. \n\nRealized one day I could not see it with my right eye.",
   "created_utc": 1692983668,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpy8cg",
   "message": "Had problems seeing the chalkboard so my parents had my eyes tested, so I've been wearing glasses since the 1st grade.",
   "created_utc": 1692984615,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxpzvho",
   "message": "First grade the board isn’t supposed to be fucking blurry",
   "created_utc": 1692985223,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxq3b39",
   "message": "Bruh, you can’t see..what do you even mean…. 😱🫤🫨🙄🤔😵‍💫😵",
   "created_utc": 1692986508,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxq3c31",
   "message": "When I stopped being able to read things I used to be able to read",
   "created_utc": 1692986518,
   "score": 2,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxq8q5h",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxqey7b",
   "message": "I didn't know I needed them. My mom had a coupon for a buy one get one free eye exam. My sister had been complaining of headaches, so the exam was for her. I had no complaints but went along because it was free.\n\nI needed glasses, my sister did not not. I was 14.\n\nI had NO IDEA that when you went to a fast food place you could read the menu behind the cashier. I did not know you could see branches in trees. I did not know people could read street signs. I did not know people could look down the hallway at the mall and know what stores were coming up. I always always sat in the front row to see the blackboard. I thought the kids in the back were goofing around because they couldn't see.\n\nSo yeah, I didn't know what I didn't know. Total lark that I even went to eye doctor.",
   "created_utc": 1692990920,
   "score": 7,
   "submission_id": "160zgap"
  },
  {
   "comment_id": "jxp7n6z",
   "message": "I ran into walls. My adoptive mom took me to my first optometrist appointment. I really needed glasses. I still run into walls but it's not because of my glasses.",
   "created_utc": 1692974750,
   "score": 2,
   "submission_id": "160zgap"
  }
 ]
}