{
 "submission_id": "1610uia",
 "title": "People of Reddit, what was some thing about someone you didn't find out until the bedroom?",
 "selftext": "",
 "created_utc": 1692973709,
 "permalink": "/r/AskReddit/comments/1610uia/people_of_reddit_what_was_some_thing_about/",
 "score": 112,
 "url": "https://www.reddit.com/r/AskReddit/comments/1610uia/people_of_reddit_what_was_some_thing_about/",
 "comments": [
  {
   "comment_id": "jxp7r9n",
   "message": "The super friendly, kind and considerate guy is **EXTREMELY** dominant in the bedroom. Andmaybeabitofasadist...",
   "created_utc": 1692974792,
   "score": 207,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxptxdr",
   "message": "I was having wild sex with a guy, and I kinda yanked on his hair, and the whole wig moved under my hand.  I just put it back and pretended like I didn't notice.",
   "created_utc": 1692983017,
   "score": 205,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxp580w",
   "message": "My gf out the bedroom: shy as anything\n \nMy gf in the bedroom: a porn star lol",
   "created_utc": 1692973819,
   "score": 164,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxp5ulm",
   "message": "That my fiancée has a huge rack. I still don't understand how she hides those puppies so well.",
   "created_utc": 1692974062,
   "score": 118,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpk9y6",
   "message": "Things are not always symmetrical",
   "created_utc": 1692979434,
   "score": 247,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpgvwh",
   "message": "A girl I dated was very Type A and reserved.  She was her class valedictorian and...I wouldn't say nerdy but just very quiet and studious.\n\nI was her first.  And when we started having sex, I unleashed a monster.  She was the exact opposite:  very confident and sexy, willing to try just about anything, and would turn into an absolute savage in bed.  It was like Dr. Jekyl and Mr. Hyde.",
   "created_utc": 1692978202,
   "score": 96,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpgs5c",
   "message": "We were just friends all through high school. But one Tuesday morning when we were in college, some stuff happened. So, I (M, 20 at the time) looked over at her (19 at the time) and was like \"You thinking what I'm thinking?\"\n\nSo, we got back to my room, still making out, I took her pants off and... idk what the deal was. Did she have a health issue or something like that going on? No idea. But the stink almost made me get sick. It was just too much to handle.\n\nWhat a way to spend 9/11, you know?",
   "created_utc": 1692978164,
   "score": 219,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpab85",
   "message": "That he was a coke addict! We were both naked and getting into bed and he pulled out a bag of cocaine and started doing lines. I stopped hooking up with strangers after that.",
   "created_utc": 1692975756,
   "score": 113,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpw1lw",
   "message": "How ridiculously strong he was. I was 220lbs easily when we met, and he wasn’t much taller but he was fit. We were doing cowgirl and he lifted and flipped me in one move.",
   "created_utc": 1692983808,
   "score": 0,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpmqc9",
   "message": "Always thought guys with big things would be loud and boastful so I was pretty shocked when a guy I was seeing who was kind and shy pulled that thing out.",
   "created_utc": 1692980346,
   "score": 108,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxq339n",
   "message": "I hooked up with this guy on Grindr. Dude was like 5'5, 130lbs, but he had the absolute biggest dick I've seen in my life. At least nine inches. It's always the skinny guys",
   "created_utc": 1692986425,
   "score": 118,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpcg3x",
   "message": "Not the bedroom but couch. I have no idea where she was hiding those thing in her top but they just kinda exploded boob. \n\n In the bedroom from the scar pretty sure she was born with a vestigial tail, during anal that was the cum button. Put some pressure on it with your thumb and the guttural sounds and grinding went in to overdrive.",
   "created_utc": 1692976560,
   "score": 176,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpan1b",
   "message": "Brought a date home, went to the bedroom, turned out to be two kids on top of each other in a big trenchcoat.",
   "created_utc": 1692975881,
   "score": 23,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxq1nq2",
   "message": "I once dated a friend who developed feelings for me and she dressed super frumpy, in baggy clothes. I was dating her because we got along pretty well and I had assumed that she had kind of a pear-shaped body. It turns out that under those clothes she was basically a bikini model. My mind was kind of blown. She was also quite kinky and had a very high libido. It was nice in many ways, though she was looking for kids and I wasn't, and there were some personality issues (she was immature, not supportive at all and she couldn't deal with her anger in a healthy way).",
   "created_utc": 1692985888,
   "score": 45,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxq70w9",
   "message": "She only enjoyed doggy, and her back was covered in those cheap, ugly, $20 tattoos that some shops offer. I knew she had tattoos, and I'm cool with that, but she put all the crap ones on her back, and she looked like someone sticker bombed her. It was so distracting that I couldn't stay hard.",
   "created_utc": 1692987922,
   "score": 167,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpf3ly",
   "message": "That my GF was into being choked",
   "created_utc": 1692977545,
   "score": 104,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpb7ti",
   "message": "That some women like to be completely shaved.\n\nHaving come to sexual age in the late 80s shaving wasn't really a thing. Some would trim, some would just shave their bikini line, but we were still in full bush mode. Until around 96 I had my first encounter with a woman (my Ex-Wife) who was shaved smooth. It was mind blowing at the time.",
   "created_utc": 1692976096,
   "score": 99,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpyag0",
   "message": "That demure school teacher? The one who has kids follow her around like ducklings because she's so kind and patient? That's a disguise y'all! A sex crazed, loud fiend lives in that costume and I'm now a bit...what's a mix of horny and frightened? I'm that!",
   "created_utc": 1692984636,
   "score": 216,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpmgcc",
   "message": "That she had a latex allergy. We had been involved for months, taking things slow since it was her first relationship, she proposed we make things more physical then said \"Oh, the condoms are latex? I'm allergic...\" and not in a sexy \"We'll have to go without ;)\" kind of way. The closest store was 15 minutes away and she was too nervous to go in with me in case her parents or grandparents were shopping at the same time. \n\n\u0026amp;#x200B;\n\nWe're getting married in 8 months.",
   "created_utc": 1692980243,
   "score": 88,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxp5pck",
   "message": "Not all black guys have a BBC.",
   "created_utc": 1692974004,
   "score": 15,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpih8f",
   "message": "He only had one testicle. \n\nHe never shared he was a testicular cancer survivor and he was incredibly self-conscious about it. It wasn't even the first time we had sex, but the first time he just pulled it out through his fly and I rolled with it.",
   "created_utc": 1692978780,
   "score": 85,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxps8g6",
   "message": "I didn’t know I had REM Sleep Behavior Disorder until an ex told me about it\n\nI would throw my hands and elbows around and most commonly I would close my fists and ‘claw’ at my face. I was messing with the window 3 stories up one time apparently also.\n\nI eventually learned it was either caused by excessive drinking or the sleep medicine I used. It’s been a long time since my last episode",
   "created_utc": 1692982390,
   "score": 216,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxp7oz6",
   "message": "That breast play didn't do much for her.  Implants decrease sensitivity in that area.",
   "created_utc": 1692974769,
   "score": 169,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpd4dj",
   "message": "Yeast infection.",
   "created_utc": 1692976812,
   "score": 247,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpg5fk",
   "message": "I used to think everything on the human body was proportionate. So like tall dude… things would like match? \n\nNope. It’s more arbitrary than that. \n\nLive and learn. \n\n(Not that I mind just got my assumptions challenged)",
   "created_utc": 1692977932,
   "score": 201,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpe9i7",
   "message": "They saw my small penis and my manboobs.",
   "created_utc": 1692977235,
   "score": 105,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpp5je",
   "message": "There are very few things as equally shocking and satisfying as having a woman squirt for the first time. I felt like a dog biting at the water spraying out of a sprinkler.",
   "created_utc": 1692981241,
   "score": 210,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxq1dl5",
   "message": "That my very quiet, reserved just blends into the background guy is actually like a wild animal in the bedroom, \n\nwhat a shock to the system that was for me as I always seen myself as the very outgoing adventures type but this husband of mine got me acting like a novice lol 😆  \n\nI was most definitely on the back foot when he unleashed, he has opened up all these new doors, typically bdsm, and now I'm utterly obsessed with him and my new found sexual lifestyle.\n\nNote.... don't judge a book by its cover lol",
   "created_utc": 1692985783,
   "score": 192,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpx0v6",
   "message": "Prosthetic leg",
   "created_utc": 1692984168,
   "score": 70,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqc2z9",
   "message": "I have only ever had sex with one person, and I’m still dating him to this day (two days ago was our 2 years!), so I only really have one person to go off of. Anyway, when we did it for the first time (and mind you it was my first time EVER), I was very skinny. TMI but you could literally see the bulge in my stomach when he put it in, to which we both found extremely amusing in a strange way. As weird as it sounds, we would push it up and down and just…. Laugh. Anyways I didn’t expect my first time to be pleasant, as I’ve heard from many people that it’s not pleasurable on your first time. He genuinely made me feel comfortable and was very gentle with me, he made it enjoyable, and he still does to this day. He’s very rough in his personality but gentle with me during the saucy times and that’s part of what made me absolutely fall in love with him. I’m lucky to say that my first time was enjoyable because of him.",
   "created_utc": 1692989830,
   "score": 255,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxq1tw0",
   "message": "Some women can fake their orgasms with a *much* greater sense of authenticity, than others.",
   "created_utc": 1692985952,
   "score": 182,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpqgdl",
   "message": "Girlfriend does NOT like Colonel Angus",
   "created_utc": 1692981732,
   "score": 39,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpdjrm",
   "message": "my sister snores, never knew that until i went to her bedroom",
   "created_utc": 1692976968,
   "score": 86,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxq4h5j",
   "message": "Nerdy undersppken short skinny guy had always shown interest. But j have a type... He was cute though well one day I decided why the hell not and asked him to come over... The man was a literal tripod were good friends now lol.",
   "created_utc": 1692986953,
   "score": 50,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpifbc",
   "message": "I made a throwaway for this one…\n\nThe someone is me. I didn’t realize that I was circumcised wrong. I have always had this dorsal fin in the middle of my shaft, and I was certain that it was normal. \n\nEvery partner I had never said anything about it… and it wasn’t until my wife asked me “what’s this?” that I even began to suspect it. \n\nI told her it was my “shark fin” and that every guy had it…. 🤦‍♂️",
   "created_utc": 1692978761,
   "score": 48,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpumg4",
   "message": "Minute man",
   "created_utc": 1692983280,
   "score": 26,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpipdv",
   "message": "The hourly rate",
   "created_utc": 1692978862,
   "score": 75,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxps7ve",
   "message": "That she had a condition that made it that she didn’t experience a lot of sensation on her skin. She wet the bed that night and didn’t seem to notice when she got up to go to the restroom in the morning. I switched the sheet and waterproof cover and pretended nothing happened when she got back.",
   "created_utc": 1692982385,
   "score": 93,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxq14jo",
   "message": "Hemorrhoids",
   "created_utc": 1692985689,
   "score": 7,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxp5ova",
   "message": "A guy I went on a few dates a while back...\n\nHad a piercing. 😶",
   "created_utc": 1692973999,
   "score": 55,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpmhd4",
   "message": "That I had a larger than average penis.\n\nWhen I was in highschool, the first girl who gave me a BJ said it was \"average I guess\". The first girl I had sex with just said that her ex was bigger and I was just \"average\". These \"averages\" implied I was on the smaller side. So with this information, I was very self conscious until I got to college where I was actually getting compliments and even complaints about being big. \n\nI also didn't realize I had such an interest in buttholes till a girl told me to put a thumb in hers. Blew my mind away.",
   "created_utc": 1692980253,
   "score": 11,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpttxa",
   "message": "Got really drunk on Halloween night, went with friends to a club where they had good music. Drink until life feels less heavy and everything is nice, met this really cute Asian girl and started talking and bought her a drink and then we were kissing. Things getting hot and I decide to ask if she wanted to come to my place, taxi back to the batcave and leap on the bed getting clothes off while my hand were constantly grabbing her ass. Help the girl taking the clothe off her ad the steam pressure kept rising, she drops the skirt and the underwear and surprise she had the pipi. I stopped and started laughing then proceeded to more sexy things. Even the morning after when the alcohol effect was gone, I couldn't tell she wasn't a girl, way too feminine and good looking. I had a very good night and regret not having asked her for the phone number.",
   "created_utc": 1692982981,
   "score": 80,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxq4v2b",
   "message": "They didn’t have their sense of smell (they told me while we were taking our clothes off because I made a comment along the line of “I hope I don’t smell)…. I didn’t think anything of it…. However, It was apparent in the aroma of their genitals.\n\nEdit: a word",
   "created_utc": 1692987099,
   "score": 62,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxq5oiq",
   "message": "How many pillows my now wife had the first time I visited her bedroom. Like, it was more pillows than bed. Does it still count as having sex on the bed?",
   "created_utc": 1692987411,
   "score": 210,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqjzay",
   "message": "I found out that she folds instantly to kisses on the neck. I found out that I do too.",
   "created_utc": 1692992822,
   "score": 17,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxq9vrd",
   "message": "Learned something about myself - that my penis is actually well-above average size. I was always self conscious as a teenager that maybe I was too small. When I lost my virginity at 19, she told me it was the biggest she ever had. It took 4-5 more sexual partners confirming the same thing to varying degrees. I'm basically average length....but it turns out I get real thick at full erection. I thought it was typical to be too big for those wide-mouthed Gatorade bottles.\n\nAlso, it's extremely hard for me to cum from a BJ. A woman will die of thirst, starvation, boredom, or the rapture before I finish from a blowjob. I mean, I love them but it just takes me forever.",
   "created_utc": 1692989001,
   "score": 9,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpvizu",
   "message": "She's as juicy and drippy as a ripe mango.  NOM NOM NOM!!!",
   "created_utc": 1692983617,
   "score": 15,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpwojs",
   "message": "Didn't find out an ex from high school was still a virgin until a very awkward winter break hook-up.",
   "created_utc": 1692984043,
   "score": 4,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxq7mkp",
   "message": "I was surprised at how much she liked to fuck.",
   "created_utc": 1692988151,
   "score": 29,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqhfl0",
   "message": "I have a warm body. It's always warm and I'm kinda skinny. I thought others have it too. Nope, not always. I might have heating leakage problem with my body lol.",
   "created_utc": 1692991853,
   "score": 213,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpblci",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxp6n7a",
   "message": "They had a penis",
   "created_utc": 1692974369,
   "score": 10,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpw3ds",
   "message": "I dated a girl briefly when I was in high school who’s parents happened to be out of town one weekend.  We ended up at her house and in her bedroom where she promptly took off her shirt and bra.  Much to my surprise, her areoles had 1 1/2”-2” hair growing all around the other portion.  Threw me off at first, but we still had a lot of fun.",
   "created_utc": 1692983827,
   "score": 30,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqcvfj",
   "message": "When the panties came off, that nice, sweet girl seemed to have horrible hygiene. I have never encountered a smell that bad again in my life. 😉",
   "created_utc": 1692990132,
   "score": 6,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxq0jof",
   "message": "She took her shirt off and had cuts all over her stomach. Was quite shocking but I made no big reaction and she seemed glad of that.\n\nShe told me later she was shocked that I did not walk out on her.",
   "created_utc": 1692985473,
   "score": 135,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqduhx",
   "message": "the quiet boy was actually really freaky",
   "created_utc": 1692990505,
   "score": 21,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqinut",
   "message": "She was being annoying during the day to provoke me in the bedroom. So I learned that \"being a brat\" is a very different thing when you're an adult.",
   "created_utc": 1692992323,
   "score": 107,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxptu9f",
   "message": "This is gross, but queefing. My sex ed was, er, insufficient.",
   "created_utc": 1692982985,
   "score": 9,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpxezz",
   "message": "That my dad liked kids",
   "created_utc": 1692984312,
   "score": 7,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxpsgpn",
   "message": "Ex gf was very type A and dominant control freak. Wanted to control everything and have the say of everything. We’d get into arguments often. However in the bedroom, she let me to be the dominant one wants me to take control of everything. Also was into choking and hair pulling.",
   "created_utc": 1692982475,
   "score": 22,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxp6mje",
   "message": "That his d is even bigger than I thought",
   "created_utc": 1692974362,
   "score": 8,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqc5af",
   "message": "My first time was completely disappointing. We were each others firsts and together for almost 5 yrs. He took down his pants and boxers and I just stared at it hoping it would get bigger. He was fully erect at approx 3 inches. I said ok well maybe it won’t be so bad. Afterwards, he blamed me and said what we did was sinful. I broke up with him and met my current husband shortly after that :)",
   "created_utc": 1692989854,
   "score": 6,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqclnu",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqnsgc",
   "message": "That she has no gag reflex. That just doesn't come up during day to day life",
   "created_utc": 1692994239,
   "score": 51,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqo9pz",
   "message": "I thought she was an innocent girl but start slobbing on my knob like corn on the cob",
   "created_utc": 1692994416,
   "score": 60,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqdjo8",
   "message": "My wife is into pain and is being dominated. Like more hardcore than usual. That caught me way of guard. 10 years later, and i still have a hard time hurting her",
   "created_utc": 1692990391,
   "score": 24,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqooro",
   "message": "In college I had a class with this girl and we quickly became friends. We were both in relationships at the time. Flash forward to finals and we were both single. She invites me over to her apartment to study. \nWe started making out and it’s getting hot. I start to undress her and she has more hair on her body than I did. Armpits, legs, bush, \nIt was the hottest damn thing I’d ever seen. We had sex 3 or 4 times that night.",
   "created_utc": 1692994574,
   "score": 49,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqmmw5",
   "message": "The quiet girls are usually demons in the sack.",
   "created_utc": 1692993812,
   "score": 29,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqu3m7",
   "message": "Tiny penis. Like a baby finger. HUGE OVER SIZED GIGANTIC TESTICLES.",
   "created_utc": 1692996593,
   "score": 9,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqyx85",
   "message": "So, I met a girl at a bar, and we seemed to be hitting it off. Her clothes were a bit on the baggy side, so I really didn't have a good idea of what things might be like under them, but I wasn't too worried.\n\nWe went back to my apartment and had a couple of drinks. We start making out, starting heavy petting, the clothes start coming off... and the next thing I know, she says, \"*I need about tree fiddy.*\"\n\n\u0026gt;!It wasn't a girl. It was that damn Loch Ness Monster again.!\u0026lt;",
   "created_utc": 1692998448,
   "score": 43,
   "submission_id": "1610uia"
  },
  {
   "comment_id": "jxqmwhf",
   "message": "More of a general thing but the first time I tried to finger a girl we were sitting side by side and I didn't realize how far back everything is I was elbow deep in her jeans like \"babe perk up real quick\"",
   "created_utc": 1692993911,
   "score": 9,
   "submission_id": "1610uia"
  }
 ]
}