{
 "submission_id": "1613zyy",
 "title": "What is the dumbest thing a customer has gotten mad at you about that was not your fault?",
 "selftext": "",
 "created_utc": 1692980922,
 "permalink": "/r/AskReddit/comments/1613zyy/what_is_the_dumbest_thing_a_customer_has_gotten/",
 "score": 241,
 "url": "https://www.reddit.com/r/AskReddit/comments/1613zyy/what_is_the_dumbest_thing_a_customer_has_gotten/",
 "comments": [
  {
   "comment_id": "jxq1i00",
   "message": "Not me but a friend of mine worked customer service for a credit card company.\n\nShe said a young guy called and asked why he couldn't use his card. She told him because he had exceeded his $15K limit.\n\nDude was like **\"yeah but that was for last month. Don't I get another $15K limit this month?\"**",
   "created_utc": 1692985828,
   "score": 189,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq30gj",
   "message": "They asked me to cut a blind. When I asked for the dimension they wanted it cut to, it was larger than the original blind length. Said I can't make it longer, only shorter and she lost her shit.",
   "created_utc": 1692986396,
   "score": 135,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq9ghv",
   "message": "Back when I worked at Target, some guy came in about 30 minutes before we closed, and wanted to buy a laptop. He wanted to run some obscure software on it for laser tag and got really nettled when I told him I was unfamiliar with the software and so I couldn't give a definitive answer. \n\nThen he started going on about how much he made in a week compared to my paycheck. So I told him something along the lines of, \"Well then buy this laptop and if it works, it works. If it doesn't, it won't hurt your wallet.\"\n\nHe really didn't like that and after some colorful language, was escorted out of the store. \n\nIn an odd twist of fate a few months later the mother of one of my best friends bought his laser tag arena because he ran it into the ground.",
   "created_utc": 1692988841,
   "score": 105,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq92yc",
   "message": "\"Man, ya'll don't know how to treat customers. It's why you all losing money. I'm going to Lowe's.\"\n\nFrom a customer yelling at customer service, in a Lowe's.",
   "created_utc": 1692988699,
   "score": 67,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq2x7e",
   "message": "Had one customer who routinely would come in about 10 minutes before close and then stand at self check out on the phone with his \"boss\" going back and forth about things until 30 minutes after close. The head cashier told me that he had been pushed out the door a couple of times without having to scan/pay for everything just so they could close. So it became a routine scam for him. And then I showed up. As soon as I would see him walking up I would make eye contact, wave and say \"10 minutes until registers close\". He would do his thing and show up 10-15 minutes after the store was closed, to SCO. Not my problem dude. The registers are closed you're going to have to come back in the morning. Tried to get into arguments. I just didn't care. It took about a month of this before he finally realized that when he saw me inside he would just turn around and walk back to his truck. I was FES at that point and encouraged the front end to do the same when I wasn't there. Dude hated my guts.\n\nI still don't care.",
   "created_utc": 1692986362,
   "score": 61,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpof40",
   "message": "That we did not have any Big Macs... I worked at Wendy's",
   "created_utc": 1692980968,
   "score": 135,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq4wgb",
   "message": "I did returns at a department store. You know when you buy a new comforter/duvet cover and it comes in those clear plastic bags with a zipper? An old lady ordered one online and some genius at a warehouse somewhere just slapped a shipping label on that clear plastic bag and sent it out. It arrived at her house with the plastic all torn and fucked up, and the blanket stained and ruined. \n\nShe and her husband brought it to the store to return it. No problem, normally. But this lady was enraged. She and the husband both went off on me, screamed at me and acted like I was the idiot who shipped the damn thing out. No matter what I said they talked over me and insulted me. It was a busy Sunday afternoon, I was alone with no backup and a line of customers watching the whole thing. It was humiliating. A two minute return turned into a ten minute ordeal because she just kept going off.\n\nI tried all my usual ways of placating upset customers, offered to exchange for a blanket of equal value, offered to help her order a new one from our kiosk in the store, offered to call the online sales customer service and get her free shipping on a replacement. Nothing helped. \n\nWhen she left and I went to put the blanket in the returns bin, I hid back there and cried for a minute. Only time that ever happened. Fuck you Myrtle or whatever your name was, I've never hated an elderly person but you are an exception.",
   "created_utc": 1692987113,
   "score": 39,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq8nt7",
   "message": "Customer got mad at me because I could barely hear her over a bad connection. I was on a landline, she was not. After disconnecting the call because it was going nowhere, she immediately called back and complained about the asshole she'd just been talking to, saying, \"He said I was bad at making connections. Why the fuck was he talking about my love life?! You are much more helpful, though.\"",
   "created_utc": 1692988541,
   "score": 34,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxprcx8",
   "message": "When I was younger I worked at a place that hosted children's birthday parties. It also had mini golf which the public would access alongside the birthday party groups. The hosts spaced out the kids so the public wasn't totally overrun with kids running about through their holes.\n\nWe offered party favors as part of the birthday party package but for this particular party the birthday kid's mom made and brought her own favors for her kid and their friends. Happened all the time.\n\nOne of the party hosts would stand at the end of the 18th hole to collect the kids golf balls and clubs before handing them their party favor and game card for them to hit the arcade. \n\nI was one of the hosts for this particular party. I as in the party room (across from where guests exit the 18th hole) cleaning up and preparing the cake to eat after the kids finished in the arcade. I was one of the hosts, so I knew who the kids were and what most of the parents look like.\n\nThis woman and her 2 young kids (maybe 5 and 7) pop into the room to check it out for a mini tour. I greet them and ask if they have any questions about the room. She asks some questions, I answer, blah blah all is fine.\n\nI notice her 2 kids were holding 2 of the favors from my children's birthday party. They were NOT a part of this party for sure. Still being completely polite, I ask the kids and mom something like \"I noticed you have some treats! May I ask where you got them from?\" fully aware where they are from. The mom says something like \"they were just sitting over there on the counter\" pointing to where the other hostess should be, but I can see the hostess went over to drop off a handful of clubs/balls she was carrying. So this mom just saw them there and figured maybe they were free for anyone. I get that.\n\nI said \"I'm so sorry but those are actually for the birthday party that we are hosting right now, I'm afraid I'm going to need those back.\"\n\nThe mom angrily says \"REALLY? You're going to take these out of my children's hands!? They're CHILDREN\" I said \"I'm sorry for the misunderstanding but yes. These favors were provided by our party mom for her children and their friends. She paid for them herself and we cannot just hand them out to everyone.\"\n\nThe mom (not party mom) was PISSED and angrily handed them back to me and said \"We're leaving!\" I thanked them and apologized but she was still mad that I wouldn't let her kids steal from the party I was hosting.\n\nTLDR; Lady accidentally mistakes birthday party favors for free gifts for the public and gets mad I wouldn't let her children keep them after explaining they were paid for and provided by someone else.",
   "created_utc": 1692982070,
   "score": 53,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq1ohs",
   "message": "Customer insisted I give her a Mario game for her son's xbox. Ma'am it doesn't exist.  GET ME THE MANAGER!!\n\nManager comes and is furious with me for not helping her. Tells Customer I am obviously wrong and looks it up in the computer, says he sees that we are out of copies but we will order her one. ( watched him use the computer. He searched for Mario on Xbox but found no results, so he lied. ) lady gives me this exquisitely smug look. I later got wrote up for not helping the customer. \n\nBut whatever, I ended up working there for another six months. I used to change the skus of full price games and sell them for five dollars. I'd change them and take them outta the case and put them in the bargain bin. So a shit ton of people got wii, 360, ps3 games for like 5 bucks. It was great.\n\nFuck K mart.",
   "created_utc": 1692985896,
   "score": 57,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq9bsv",
   "message": "I worked at Millie’s Cookies while I was studying at uni. Our store’s set up was a wide counter with all the goods on display, great for customers to be able to see all the flavours but a nightmare for queuing as people tended to just crowd around the counter.\n\nOne shift a small boy, about 8, arrived at the counter as I was finishing someone else’s order. He had a £1 coin to buy himself one cookie. An older couple arrived at another part of the counter about 2 minutes after him, so naturally I turned to him next. The older woman proceeded to say loudly “oh I guess we’re not getting served then” to which I replied “this young man was here before you”.\n\nYou would’ve thought I’d told her to eff off, because she then went on to rant about how rude I was, how rubbish at customer service and, randomly, how she hoped I never went into a caring profession because I clearly have no manners and don’t know how to relate to people… from the woman who wanted to push in front of an 8 year old boy… incidentally i’ve been a healthcare professional for the last 6 years and no complaints so far!!",
   "created_utc": 1692988792,
   "score": 27,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq3fhk",
   "message": "I worked at a small retail chain down the road from my house when I graduated high school. \n\nAt the time it was in the height of covid. And my store didn’t carry paper or plastic bags, customers had to bring their own. \n\nA guy walks up with a cart full of canned goods, unrefrigerated drinks and 5 boxes of k-cups filled with 50 per box. \n\nThe sign on my register clearly says “unfortunately we do not carry bags at this time, sorry for the inconvenience.” Written in bright red lettering in all caps.\n\nSo thinking this guy knew this and could understand English. I cashed him out, ringing up everything. The total came out to almost $250.\n\nWhen out of the blue, the guy asks, “Hey why didn’t you bag my stuff?” \n\nI told him “sorry, we do not carry any bags at this time.” Thinking he might’ve not read the sign.\n\nBy this point, I had already cashed him out and handed him a receipt. And he stood there absolutely dumbfounded for 30 seconds before saying, “what kind of store doesn’t carry bags?”\n\nAnd I said very nicely: “Sorry sir, but there are signs all over the front of the store, and even a sign right here at my register, sorry for any confusion.”\n\nBy this point, all 4 checkout lanes were wrapping around the corner of the store. And my co-workers were trying to cash out everyone as quickly as possible.\n\nAbout 10 seconds go by, when he says: “Are you sure you don’t have any bags in the back?”\n\nI say: “No sir, Once again I apologize for the inconvenience.”\n\nBy this point, people in my line, we’re starting to get mad. \n\nThe guy, noticing this, proceeds to demand for the manager, like throwing full blown adult temper tantrum.\n\nNow people are pulling out their cellphones and starting to record everything. \n\nI call my manager down, who is immediately jumping to defuse the situation. \n\nThat’s when the guys wife comes in who had been sitting in her car waiting for him this whole time. \n\nMy manager was trying to explain to him that because of Covid, company policy prohibits us from giving or selling bags of any kind and that he should’ve known this before coming in. \n\nThe guy was now full blown losing his shit.\n\nThe wife now comes in to the conversation, telling the guy that the way he is acting is fucking ridiculous. And that we need to leave now. \n\nThe guy protests by sitting on my register counter refusing to leave without bags. \n\nAnd by this point my manager has lost her shit. \n\nShe tells me to wait there and goes up to her office and calls the cops. \n\nWhen the cops got there, his wife had given up at this point and said, “Have fun spending the night in jail Keith.” And drove off in her SUV.\n\nThe guy realizing he fucked up. Leaves peacefully and the entire store claps in celebration. \n\nBy the time I had gotten to my next customer, I had already worked longer than my shift hours. And my manager said she would extend my pay hours so that I could help finish the now mile long line of customers.\n\nI put in my two weeks 3 months later and still have good contact with my manager who does most of my job references now.",
   "created_utc": 1692986554,
   "score": 47,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq8l1p",
   "message": "i worked at buffalo wild wings and i had a customer get extremely upset at me because our traditional wings have gotten “smaller.” i asked him what he wanted me to do about it since i’m only a server and have no control over what size our wings are. he just stared at me and had nothing else to say. \n\ni didn’t get a tip but i didn’t care. i just wanted him to realize how ridiculous he was sounding",
   "created_utc": 1692988513,
   "score": 21,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq92dq",
   "message": "Sold TVs for a couple years around 2010. Customer accused me of selling him a lemon TV because it wouldn’t turn on. Swearing and yelling at me that he would get me fired, blah, blah, blah. Troubleshooting with him on the phone I ask if it’s plugged in. He said yes it was to the wall outlet, he’s not an idiot. I ask it’s plug into the back of the TV. Long silence, followed by it’s working now, and click. No apology, and when I decided I needed a career change.",
   "created_utc": 1692988693,
   "score": 18,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxps6nc",
   "message": "I worked for Comcast as a tech. I also ran escalations for my shop, so I have a lot of source material to work from here...\n           \nCustomer gets installed in 2008. Service presumably works perfectly for 3 years. No records of calls on his account. No service calls. This guy has literally never reached out to Comcast with a problem with his service since install. Customer loses channels on one TV. Instead of calling customer service, customer puts in FCC complaint about missing channels.\n         \nThat complaint bounces around the FCC for a few days, gets sent to Comcast corporate, and from there it takes two weeks to both get down to the local level, and get a service call scheduled. The policy in our shop was basically to send a tech out (me) and document fucking everything. His appointment is in the middle of my route, but I look up his stuff as soon as I came in that morning. His modem levels were great. His node (basically the network built within his neighborhood) was one of the best I'd seen. Noise floor was low, low ingress hitting the node. I scan through his account, and notice that some rate codes were missing on one box. \n         \nRate codes are what tells the equipment what channels are authorized on your account. You have things like B1 (local channels), B2 (higher tier of local channels), starter packages, premiums (HBO, Cinimax, Stars, etc), adult, etc. These are (or at least were) manually set up through customer service, and mistakes happen. And honestly, they can happen both ways. Sometimes the customer gets more channels than they're paying for, but most of the time they are missing stuff. And the system at the time could run for years with bad rate codes until some random security check de-authorized any that weren't set up properly, which is what happened to this guy. Had the customer called in to customer service, any brain-dead CSR should have been able to catch this and have it fixed within a couple minutes. The funny thing is, even though I could see it, I couldn't fix it. So I let my dispatcher know what was up, and asked her to fix the codes but not send the refresh signal. \n          \nI run through my route, and get to the house. I get screamed at for 10 minutes about how unreliable we are, and how we're so incompetent that customer had to complain to the FCC about it. I let him know I'll start working on the issue, and start checking basically every connection from the mains to that box. I document it all. Took me about 30 minutes or so. I finally get to the TV, and the customer asks me what's taking so long.\n         \nME: \"Oh, per policy, I need to ensure your installation is good and there are no problems with the signal before I can fix the issue.\"         \nCustomer: \"Well what's the problem then!? You've been at it a while!\"        \nME: \"Your account had a small mistake on it. Just a moment.\"          \n         \nI send the refresh signal through my handheld, the missing channels pop right in.\n            \nME: \"There you go. I had dispatch fix that this morning. In fact, customer service would have been able to fix that for you when it first occurred, and had this not been an FCC complaint I would have just called you this morning to verify the channels popped back in and saved you the visit. Sign here please.\"\n           \nMy ratings were generally trash, because almost every call I ran was cleaning up some other tech's mess, so his low rating really didn't affect me much. Because of course it's my fault he chose the nuclear option instead of just calling customer service like any normal person...",
   "created_utc": 1692982372,
   "score": 55,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxppphl",
   "message": "Worked at a flower shop. Customer came back two days later saying they were upset their roses died so quickly and wanted a refund. I apologized and we had a set of questions to ask before issuing a refund. I asked if they had cut and placed the roses in water, and the woman responded “The roses had to be in water?” 💀",
   "created_utc": 1692981448,
   "score": 49,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqfgjm",
   "message": "I do utility vegetation management. I can't count the amount of people that have threatened to shoot me, sue me, or just screamed at me because I told them I had to cut their redwood, the tallest tree species on earth, that they planted directly under a 40' tall 115kv power line, which they signed easement papers for when they purchased their property. \n\nPro tip, don't purchase property with power lines running through it if you don't want the utility company dictating what you can do on part of your property!",
   "created_utc": 1692991111,
   "score": 13,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq0b0i",
   "message": "They were mad at me because they ran into the back of a stationery car at 60mph+ and wanted to argue it wasn't their fault, it was the fault of the other driver who was correctly stopped at a red light, and I told them they were at fault for the accident. Apparently I wasn't \"fighting their corner as their insurance company\" because I told them they can't hit stationery objects and hold them liable.",
   "created_utc": 1692985382,
   "score": 25,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpynwl",
   "message": "I worked for a shredding company at the time. A customer called early (7am) to make sure we were still coming to get his shred bin that day. He then proceeded to yell at me for calling him so early.\n\nBro, you called me.",
   "created_utc": 1692984776,
   "score": 20,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq4vkp",
   "message": "Was a mgr at a Walgreens and an older (but not elderly) man swore that we were stealing money from his bank account out of atm. When questioned he admitted he sends his nephew to the store to pick up his meds with his debit card. Still thought it was us stealing from him. He went so far as to call the police.  That was a confounding situation.",
   "created_utc": 1692987104,
   "score": 9,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq8o1g",
   "message": "When I was a delivery driver at a pizza place in college we had this customer and she would order every Tuesday after her yoga class.  Nobody liked delivering to her because it was the same story every week.\n\nShe'd order a half hoagie, which was like $6.  There was a minimum order for delivery, which was I think 10 bucks.  Every week, she'd call in and try to order a half hoagie for delivery and every week we'd tell her she needs to order a minimum of $10 for delivery, and every week she'd yell at whoever was on the phone that it was bullshit before adding cheesesticks or something to the order.  And not only that, you'd go to deliver her food and she'd yell at the delivery driver and try to get out of paying for the extra food, and she'd refuse to tip.\n\nAnd this wasn't some poor person trying to get one over or anything.  She lived in a nice house in the rich neighborhood in town.  She was just an entitled asshole.",
   "created_utc": 1692988543,
   "score": 8,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq2gbt",
   "message": "Got yelled at for ruining his family’s vacation at Disney world because the rides shut down due to the storm",
   "created_utc": 1692986184,
   "score": 8,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpxffb",
   "message": "Did an oil change on his jeep, he blamed me for his phone not reading texts to him from his radio. Anyways he caught me in the parking lot after my shift to rip into me, I started out with a customer service voice but after I explained I didnt change anything on his radio I just told him straight \"you have no fucking clue how this infotainment system works do you?\" Then I called a salesman over to show him how to use his radio so I could go home.",
   "created_utc": 1692984316,
   "score": 15,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpuln6",
   "message": "Her card got rejected. Got pissed at me and actually went back to customer service to complain and say she was never going to shop there again.",
   "created_utc": 1692983271,
   "score": 20,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqa2ww",
   "message": "In the ‘60s I worked at a gas station that also did repairs. A customer drove in with a flat right rear tire and no spare. I pulled out the nail and plugged it. She was good to go and left happy. She drove in about 2 months later with a flat left front tire. I pulled out a screw and plugged it while she screamed that I should have checked it last time she was there.",
   "created_utc": 1692989077,
   "score": 7,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpylu1",
   "message": "I was in phone tech support for desktop company.  IT head of a school was trying to return 200 dead units after they got fried in a lightning storm.  I told him \"this isn't a manufacturing defect, I think this falls under Act of God\" and he got really offended and said \"well what if I don't believe in god?\" and I'm like bro, it's a legal term.\n\nFelt bad for him, but no way we're eating the cost on 200 units when he should have just paid the extra grand to put in (better?) surge protectors.\n\nWe also had this customer in India that started calling in 20+ times per day to complain about our lack of Linux support.  We eventually blocked his number in the phone system, but he started switching to new Skype numbers to keep calling us, so we eventually just had a whiteboard in the office to keep track of \"Nikhil Numbers\"\n\nLots of great tech support stories.",
   "created_utc": 1692984755,
   "score": 13,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq142s",
   "message": "Somewhat my fault. \n\nAs a waiter I once went back to check on a table and they were upset that I had placed the plates of food in front of the wrong person and that they had each eaten the other’s food. The two meals looked nothing like each other. \n\nI was so flabbergasted that I couldn’t even apologize.",
   "created_utc": 1692985684,
   "score": 14,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq09yt",
   "message": "Asking them not to allow their underage kids to handle alcohol in the store- guy freaked out and started yelling about his taxes ( that don't support the liquor store) and screaming about how he pays my salary. ( he doesn't).",
   "created_utc": 1692985371,
   "score": 12,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq9daw",
   "message": "When I was 18 I worked on a cigarette counter in a chain newsagents in the UK. This old lady came up and pointed to the display of 100s of different packs telling me she wanted ‘that one’. I had no idea which one she was pointing at as it was just a finger in the general direction of where she was looking. After about 5 ‘that ones’ she decided to freak the fuck out and start screaming at me. I’m like wtf I’m defo not putting up with this so I told her to fuck off outa the shop. Little did I know the store manager was listening on an intercom underneath the counter. Next thing I know I’m out of a job!  Dumb, because also she had to do was tell me the brand rather than getting mad at me.",
   "created_utc": 1692988808,
   "score": 6,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpv4mq",
   "message": "A woman came in screaming about some ice cream she bought,I tried to tell her but she wouldn't let me speak,after a couple mins I told her that's co-op ice cream not tesco!wrong shop bitch!",
   "created_utc": 1692983466,
   "score": 12,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq6920",
   "message": "I worked at a Music Store in a mall around Christmas. A lady came in and wanted to get the album of whatever was playing at the store she was in earlier. She got mad when I didn’t know what music they played in other stores.",
   "created_utc": 1692987627,
   "score": 4,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqdfft",
   "message": "A long time ago I serviced someone's Internet connection at their house. When I left, my supervisor called to let me know that I had been accused of theft at this house. This crazy lady thought I stole a handset for her landline phone, not even the base with it, just the handset. She called later to report she found it in between her couch cushions.",
   "created_utc": 1692990346,
   "score": 5,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqf2vj",
   "message": "I was refusing her a refund on a kids' duvet set. This woman threatened my colleague, so I (manager) stepped in. Protocol states we had to check and repack before giving a refund, so I took it to the stock room only to find that she had folded it back into the packaging, complete with the vomit chunks!",
   "created_utc": 1692990970,
   "score": 6,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq9zh6",
   "message": "Not me, but the flight attendants at Dallas Fort Worth airport. All flights were grounded because of severe thunderstorms. People were SHOUTING at the attendants who were trying to rebook flights because of the weather. It wasn't just one, it was a whole line of people pissed off that they can't take off in a thunderstorm. I was like, what the f is wrong with these people?",
   "created_utc": 1692989041,
   "score": 5,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqah1j",
   "message": "ISP tech support, customer ended up cancelling because I couldn't resolve his issue.\nHis issue? He couldn't remember his Skype password (maybe didn't know the username either). Also, someone else originally set it up for him so he didn't know the email to attempt password recovery.\n\nAlso, customer service for cable TV we had a lady call in and throw a fit (don't remember if she cancelled) because she had already seen this episode.....",
   "created_utc": 1692989226,
   "score": 3,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqczhy",
   "message": "I wasn't even working at this shop, I was just another customer. I didn't even wear a shirt similar to an employee's.\n\nA woman comes up to me and says, \"Excuse me, do you work here?\" But before I can say no, she asks where something is.\n\nShe sounded polite enough so I responded just as politely, \"Sorry, I don't work here. The people with the blue shirts do.\"\n\nShe got slightly upset and said someone else had pointed at me when she asked for a worker. I look to my side, and literally less than a couple feet away, there was an actual worker. I told her \"I think they meant that guy right there.\"\n\nShe then completely lost her cool, screaming various things at me and calling me all sorts of names. The employee tried to intervene but she just kept screaming. She eventually stops with, \"I want to see your manager!\" \n\nI told her to fuck off. The employee laughed and she stomped off, then I just went back to shopping. Didn't see her again that day",
   "created_utc": 1692990175,
   "score": 4,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq3mad",
   "message": "That I could not fix her bent-in-half broken finger, I am a receptionist at a dentist office.",
   "created_utc": 1692986627,
   "score": 3,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq9g0s",
   "message": "I had a call back on a house where I did the plumbing.\n\nthe lady that had bought the house said that the hot and cold water was backwards on the garden tub.\n\nshe sat on the rim of the tub and said \"see, they're backwards.\"\n\nI replied, \"yes, but if you were ***in*** the tub, they're right.\"\n\nshe got mad at me for proving her wrong and told me to \"get the hell out!\"",
   "created_utc": 1692988836,
   "score": 3,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqcnj8",
   "message": "I worked at a movie theater. We had a regular, this old man roughly 500lbs and confined to a wheelchair. He was a little brash but seemed to like me, and I would usually help wheel him into the auditorium or carry his snacks. I didn’t mind it, really. He was funny and it meant I got a break from my usual duties.\n\nHe eventually started coming with his “Nurse”, an old lady who was a raging bitch. She’d cuss at the teenagers and always demand we give her discounts because “your ad in the paper said so”. We didn’t even run ads.\n\nNow my job ALSO included helping him in the bathroom, although she would come in to wipe him off. She’d demand I stand at the door and not allow anyone in while she was in there.\n\nOne day, their movie was in a bi-level auditorium. The ramp to get from the lobby to the theater was long but within ADA guidelines. She came out and raised a HUGE fuss with me, saying that the ramp was “too steep” and we were trying to kill her for rolling him up the stairs. So, guess who got the honor? I’d done it a few times before, so that wasn’t the issue. It was the way she went about it. Bitch, ain’t you his nurse?\n\nOnce in a while they’d come with a teenaged girl, the guy’s granddaughter. As I’m wheeling up the ramp backwards, they’re a few steps back. I hear the girl say something like “you shouldn’t be making him do that”\n\nShe responded with “it’s his *JOB*!”\n\nThe urge to let the guy go and rollback down, knocking her out like a bowling pin, was strong.\n\nAfter that he didn’t come back as often. When he did, he wasn’t with her. Apparently they came back when I wasn’t there and tried to rope in someone else- they flat out refused. \n\nI think he was secretly embarrassed by her, because of the shit she put us through.",
   "created_utc": 1692990047,
   "score": 3,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqco5v",
   "message": "Customer called one year later. Camry they bought was in the shop with a blown engine. It was apparently our fault because we know when things are going to break. Investigated a little further and the shop explained there was no oil on the dipstick. What was in the pan was like tar. She had performed exactly 0 oil changes in a year and 45k miles.",
   "created_utc": 1692990054,
   "score": 3,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqcqke",
   "message": "So, I worked at a chocolate shop in Boston MA.\n\nSomeone called to place an order, for shipment, to Florida.\n\nI said,' okay, we do require next day shipping and an ice pack on shipments to Florida, so the chocolates don't melt. The shipping Will be $30 and the ice pack and insulated packaging will be an additional $8.'\n\nIts my standard spiel. \n\nThe person's like 'the chocolates only $22. No. I'll pay for the shipping but not the ice pack. It will be fine.' \n\nYadda Yadda warning. Yadda Yadda. When it shows up melted it won't be our fault I'm noting it in the system. \n\nSo, what phone call does my manager get 2 days later?\n\nOh? Person got melted chocolate? Oh it's our fault is it? \n\nBut look? There's a note in the system they refused to pay for an icepack. WOMP WOMP. \n\nDid I warn them the chocolate would melt? Yes I did. \n\nDo they now have nothing for mothers day? No they dooooont. \n\nPoor them.",
   "created_utc": 1692990080,
   "score": 3,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpr2vx",
   "message": "When I worked at little Caesars, a woman got *extremely* mad that the prices of the pizza increased from $5.41 to $6.48. I let her yell at me in the drive-through for a good 2 minutes before I closed the window and let my manager deal with it. Bitch.",
   "created_utc": 1692981967,
   "score": 5,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpyihz",
   "message": "I wouldn't make them a Whopper\n\nI worked at McDonald's",
   "created_utc": 1692984720,
   "score": 5,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq754i",
   "message": "I’m a dog groomer primarily. \n\nA Pomeranian once came in with very tight matting behind it’s ears that needed shaving out. The client then proceeded to raise hell about why i removed the dog’s “extra set of ears growing in.” No i am not kidding. \n\nAnother time a client asked me to leave off cologne because it made the dog smell “too good for too long”.\n\nAnother client asked for a refund because i told them their female dog was a girl and they were pissed. \n\nAnother time someone came in my salon and became VERY disgruntled i wouldn’t neuter their boy dog on the spot. \n\nLast example (i literally have hundreds some people have asked me to write a book because it’s like eccentricity just finds me) and by far the most common because didn’t you know, groomers always cause ear infections? \n\nA client called me and said she refused to come back because i wouldn’t pluck her dogs ear hair and he got an ear infection 2 weeks prior. (Side note: the dog was a schnauzer with the thickest ear hair I’ve ever seen and it would’ve caused significant pain to remove by the root. The vet actually needed to sedate him to do so. I have no idea what she thought i could’ve done.) The kicker though? I hadn’t seen the dog in 6 months. Even if I’d plucked it bald it obviously wouldve grown back by then. When the dog was coming in regularly and it was maintained there were no issues….weird right?",
   "created_utc": 1692987966,
   "score": 4,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqcpnd",
   "message": "Had a customer who was 2 minutes late making a payment. \n\nThem: \"Why are you billing me a late fee? I was only two minutes late.\"\n\nMe: You were only two minutes what? \n\nThem: \"Late\" \n\nMe: Right.",
   "created_utc": 1692990071,
   "score": 3,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpoqph",
   "message": "Some piece of shit in a computer lab years ago deleted his own files and blamed me as the administrator. I hope that fucker deleted much more important shit later and destroyed his career.",
   "created_utc": 1692981087,
   "score": 5,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq3icl",
   "message": "Their application for a Kohls charge not going through. \n\nThis was the biggest reason why I fucking HAAAATEDDDDDDD pushing people to apply.",
   "created_utc": 1692986585,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq4ru3",
   "message": "Selling chainsaw chains.  He got mad that his chainsaw chain stretched and came off the bar.  Apparently he’s been working forestry all his life.  Chains don’t stretch according to him.",
   "created_utc": 1692987065,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq5etn",
   "message": "Because I didn't agree with his view that 3D TVs were going to be the next big thing. \n\nThis interaction took place in 2017.",
   "created_utc": 1692987308,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq8mxg",
   "message": "The hotel I worked at (not owned or held a stake in or had any part in planning or designing for the fact  that it had existed for a full decade before I even applied) did not have an elevator for the mind numbing height of its two stories. Sorry 'bout that.",
   "created_utc": 1692988532,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq90f7",
   "message": "\"HEY I asked for light lettuce!\"\n\n\"Oh sorry.\" remakes sandwich \"Here you go.\"\n\n\"...I don't get all the rest of my order for free?\"\n\n\"What? No.\"\n\nShe ordered for herself, her mom and two sisters. She was honestly shocked she wasn't getting 4 full meals free from a small mistake.",
   "created_utc": 1692988673,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqatfj",
   "message": "Two winters ago...\n\nWoman calls threatening to call the police because we won't deliver her furniture.  \n\n\nProblem, we are an A/V install shop.\n\nI was holding the phone away from my ear and the entire office, including my hard-of-hearing office manager, could hear her clearly. Finally, I told her to call the cops and hung up.",
   "created_utc": 1692989357,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqbir5",
   "message": "When you call sales because Customer service has a long hold time. We can't help you and don't have a secret way to get you over there.",
   "created_utc": 1692989619,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqbo2t",
   "message": "I got screamed at at 5:30am for not having any blueberry muffins",
   "created_utc": 1692989675,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqcvph",
   "message": "That the coupon they were trying to make me use was for a grocery club. We were a used bookstore.",
   "created_utc": 1692990135,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqddct",
   "message": "Running out of quarters. \n\nWorked at Coldstone back in the day, and the entire group of students and their families from a middle school theater performance came in after their show ended.  They showed up 10 minutes before closing.  I was working the closing shift myself because it was typically dead, and had to stay open almost an hour late to finish serving everyone.  Ran out of quarters at the end of the night, and a lady yelled at me about it.\n\nWas a real slap in the face after I felt like I was being nice accommodating this group alone well after our closing time.",
   "created_utc": 1692990324,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqed1y",
   "message": "I've been scolded a few times for deliveries arriving early, I have absolutely no control once it's in the courier's hands",
   "created_utc": 1692990698,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqevjt",
   "message": "Waiting tables I had a couple who insisted that margaritas are supposed to be served with lemons not limes. I was happy to give them lemons if that was what they wanted but I told them that they’re typically garnished with a lime. They left and the husband came back in and handed me a $5 bill, and said “she didn’t want me to give you a good tip because you were wrong about the lemon thing but you did a good job…”",
   "created_utc": 1692990892,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqf0ns",
   "message": " Caller got mad because she couldn't get off for the solar eclipse and wanted us (a science museum) to reschedule it for one of her off days. \n\nAnswering the phone is party of my job and I've got some doozies. I'm jotting them down in a book and when I retire I will publish them.",
   "created_utc": 1692990947,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqf5ac",
   "message": "The lady was upset because the paper her receipt was printed on gave her a paper cut and now we are liable.",
   "created_utc": 1692990994,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqha8j",
   "message": "Worked at a deli at the grocery store. Woman wanted a pound of the turkey on sale. Great. Oven roasted or honey smoked? She rolls her eyes and says she doesn't know and has to call. I stand there with many customers waiting while she calls someone on her cell, asks them about the turkey, and then hangs up.\n\nI ask, \"...so which one are we having?\"\n\nShe tells, \"WHAT?!?! DIDN'T YOU HEAR HER?!?!?\"\n\nI was like ...no? \n\nShe was so pissed and proceeded to call the person back and then was rude, shitty, and demanding to me about the other things she needed.\n\nYes, she screamed at me because I didn't hear the other side of her phone conversation.  \n\nMy manager let me go in the back for five minutes and kick the wall after that one. I was so angry, I literally changed color. He was like \"I have never seen your face get so red.\"",
   "created_utc": 1692991797,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqhl6v",
   "message": "I once witnessed someone try to return a shirt to JCPennys that was gifted to them in a JC Pennys box, and get slightly annoyed when the cashier told them it didn’t seem like a JCPennys item - until they showed them the tag which clearly said ‘Ross.’\n\nI was this customer.",
   "created_utc": 1692991913,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqi0e2",
   "message": "That the greenhouse smelled like dirt. Sir, we have plants in pots of dirt.",
   "created_utc": 1692992076,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqj6pi",
   "message": "I did tech support for an antivirus company, which was mostly guiding boomers through the installation process, and basic troubleshooting.\n\nOne guy joins the support chat and is absolutely livid, ranting about how we've put a block on his antivirus. I check his file, no blocks anywhere in his profile, not subscription nor software.\n\nWe do a remote session, and it turns out his internet came from one of those ancient usb stick modems.\n\nI told him the problem was that his slow internet connection was unable to handle the software download properly.\n\nHe got even more furious, because the error was totally not on his end, and demanded we gave him a new subscription for free. I told him, again, his subscription was working fine, his internet was the problem.\n\nHe kept arguing, so I told him even if we gave him 50 new subscriptions, it wouldn't matter, unless he upgraded his internet.\n\nOver the next 20 minutes he joined chat support like 5 times, ranting about how we were violating his human rights by denting him computer protection.\n\n\nI could write a book about all the idiots I've encountered during my years in callcenters, but this guy is in my top 5 list of absolute morons I've dealt witj",
   "created_utc": 1692992522,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqk6vt",
   "message": "I worked at Panera for my first job, and a lady ordered a cup of soup. But we were out of clean cups, so I gave her a bowl, which was bigger and had more soup. All for free, mind you. But when I brought it to her and explained, she said, \"That's pathetic. I ordered a cup,\" and continued to give me dirty looks even after I told her it was free soup. And offered her a pastry for her inconvenience. \n\nAnother time at Panera, a woman was sitting in a booth waiting for her food and asked me to turn the AC down because she had the flu. 😷",
   "created_utc": 1692992900,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqlbjr",
   "message": "I guess technically this was my fault. But a customer once demanded to speak with my manager because I was smiling too much. She said no one should be happy working in retail so I had to be smiling to make fun of her.",
   "created_utc": 1692993318,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqlv0l",
   "message": "We had a sale on a TV that was on Saturday and Sunday\n\nGuy came in on Friday and wanted to deal. I told him I couldn't do it because it wasn't in the system, so there was nothing I could do\n\nHe started by pushing to get the deal, clearly not understanding that it was out of my control, then he told me;\n\n\"Take the money, make the sale on Saturday then he'd be back on Monday to pick it up\"\n\nObviously I can't just take someone's money for a future sale, as he would have no guarantee that I wouldn't just put the money in my pockets and I would look like I was stealing if I just took the money\n\nThat's when he starts going off, telling me that I made his sick father wait in the car for an hour in the heat for nothing (Wtf? don't leave your sick father in the car) and that I would make his kids cry because he promised them a new TV (maybe don't promise your kids something you cannot afford)\n\nHe then went ballistic, telling me to come outside so he could beat my ass and all that. So I call the police and when they get in the store THEY CALLED HIM BY HIS FIRST NAME RIGHT AWAY\n\nSo clearly it wasn't the first time the guy had problems with the cops. They told him to never come back to the store and told me to call them if he ever came back",
   "created_utc": 1692993521,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqmm5z",
   "message": "I briefly worked at a sunbed salon about a decade ago. There was another completely unaffiliated sunbed salon in the same village that abruptly closed. One day when I was working we had a lady come in with her membership card to the other sunbed salon and she got mad that we would not honor it. \n\nAfter explaining to her that our salon was completely unaffiliated with the place she had a membership for, we offered her a discounted rate for our salon's memberships, but she wouldn't hear of it. She stormed past our cleaning attendant and went into one of the private sunbed rooms and locked the door. We could hear her trying to turn the sunbed on, but our salon had everything computerized, so you could not manually turn the sunbed on. After multiple negotiations, the police had to be called to remove her.",
   "created_utc": 1692993804,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqmqfx",
   "message": "Worked at a burger joint in an upscale part of a city. We were next to a winery that charged $45 for a burger but our burger chain wasn’t exactly fast food but wasn’t upscale either. Anyways a woman came in and yelled at me that I single-handedly ruined the class I was of the neighborhood because I was working at a burger joint. Hope she stepped on a lego",
   "created_utc": 1692993849,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqnhfl",
   "message": "Serving sizes\n\nI was working at a hospital cafeteria, my manager showed me the amount of eggs I’m supposed to give each individual \n\nWell this one nurse decided to argue that she was allowed to get more without paying for two servings. I politely explained that I was told to only give the amount I had given her, \u0026amp; she tried to tell me that it was fine. She spoke to the higher ups, \u0026amp; that she had “special permission” to get extra without paying \n\nShe was also holding up the line, she asked me to get my manager, which I did, \u0026amp; he told her the exact same thing I did. That if she wants a double serving, she needs to be willing to pay for it.\n\nShe was not happy to say the least",
   "created_utc": 1692994125,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqnyn9",
   "message": "He returned something we know for a fact he stole for store credit. Then tried to buy a pack of cigarettes with said credit. You weren’t allowed to buy alcohol or tobacco with store credits. He called me a b!tch and said fight me here. I said I like my job and don’t want to embarrass you. So he left.",
   "created_utc": 1692994303,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqog9a",
   "message": "I worked for a farm and fleet store we had a rival store that was called a fleet farm store. It was stupid, people were aways confusing them.\nAnyway, I worked hardware and had just finished all the price changes for the day. I get a call from a guy wanting to know about our chainsaws that are on sale (ours weren't), I go to the front and grab one of our flyers just to be sure I didn't miss anything. Sure enough, not us. As I am still on the phone with this guy telling him this he is very insistent that I am wrong. I walked over to to chainsaw display and even though he can't see it I informed him that \"Sir, I am standing directly in front of the chainsaws. They not on sale you have us confused with fleet farm.\" At which he proceeds to scream that he wants to speak to a guy because women have no idea what they are doing when it come to this stuff (not the first time I've heard that, won't be the last). \nAnother time at the same job I got yelled at in Punjabi, because I didn't know if the store even sold something. I think it was housewares or clothing related, it would have been  on the other side of the store and the only departments that couldn't help people in.",
   "created_utc": 1692994485,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpoze7",
   "message": "I used to work in a grocery store and every once in a while there would be a shortage of something from the warehouse and they would lose their minds when I didn't know why. They didn't understand that that's like...a completely separate business and we just get deliveries from them. Then again, they would also freak out when we pulled something because of a recall. I guess people should be allowed to e. coli lettuce if they really want to?",
   "created_utc": 1692981177,
   "score": 4,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpx8mu",
   "message": "I was a customer service representative for an auto and home insurance company. We offered “roadside reimbursement” for drivers in certain states. A woman was screaming at me because I could not send her a tow truck for free. I had to explain at least 10x that as a reimbursement service, she finds her own provider and she can submit the paid invoice, and we will send her a check. \n\nShe told me to have a blessed day and hung up on me.",
   "created_utc": 1692984246,
   "score": 3,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpyyth",
   "message": "Not speaking spanish",
   "created_utc": 1692984889,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpzhfo",
   "message": "The Eggplant Parmesan had too thick of eggplant skin.\nUmm sorry? I didn't grow it or sell it to Sysco.",
   "created_utc": 1692985079,
   "score": 3,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpze9r",
   "message": "I worked at a movie theater in the concession stand when I was in high school. Customers would get mad at me all the time over prices and long lines.",
   "created_utc": 1692985049,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq1ec5",
   "message": "Working checkout and having their credit card declined. I have no control over that ma’am.",
   "created_utc": 1692985790,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqcyqt",
   "message": "Mask requirements during high COVID",
   "created_utc": 1692990167,
   "score": 2,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxponlf",
   "message": "As a worker in a supermarket who has to open extra checkout lanes on occasion when it's busy, I love when old people who refuse to take their 4 items through the self serve proceed to be mad at me for being slow to abandon my own responsibilities to open a checkout to serve them because they're lazy and refuse to exert minimal effort to get their shopping done in a reasonable amount of time.",
   "created_utc": 1692981055,
   "score": 0,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq56lx",
   "message": "When I was working in a Walgreens as a teen-there was a customer, never saw her in my life, brand new cashier of only a week or so-her coupon wouldn’t scan at the register.  She became upset and rude and demanded to speak to the manager. \n\nso she complained about me to the manager saying I was always rude and giving her trouble whenever she came in. \n\nThanks lady.",
   "created_utc": 1692987221,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqdw7b",
   "message": "They thought I said the word \"power\" with a weird accent, and kept trying to tell me that I should work on my speaking if I'm going to be talking with customers. I just gave her the thousand yard stare. She made a complaint to my manager about it even, and my manager just laughed at her and just said \"Ok.\" Minimum wage was not near enough to listen to that weird bullshit.",
   "created_utc": 1692990523,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxr4lkn",
   "message": "I worked at CFA. We stopped serving breakfast at 10:30. A regular customer started using the mobile ordering app when it was starting to take off. For some reason the app allowed her to order breakfast at 10:45. She sends her daughter in \u0026amp; I kindly explain to her that we don’t have the breakfast items available for her order. The daughter very shy \u0026amp; unsure what to do goes back to the car. The mom, (a large heavy set woman who funny enough works alongside my parents at a Christian theater) comes in and start angrily shouting at me for not having her order. Claiming that a different CFA in our area does it so it should work here. By that point my manager gets involved \u0026amp; I leave it alone. People go crazy for their CFA though. Got to be a little bit crazy to wait in a line that wraps around a building I guess.",
   "created_utc": 1693000775,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq6nrp",
   "message": "When I was working at Subway,a 24/7 subway. \n\nWe were the only subway not selling wraps yet.\nC: hey are you guys selling wraps?\nMe: no sir,we don't have wraps yet.\nC: of fucking course you don't,that's just some god damn bull-shit!\nM:Sir! You can order a sub on white,wheat,or Italian herb and cheese. Those are your options,now,you can drop your attitude and pick something,or you can leave!\nC: oh...umm...can I get steak on Italian herb and cheese,please?\nM: Absolutely sir,how's your night going for you?\n\nThe other time was the grape jamboree,a local wine festival,It was 3rd shift,I was the only one there...I had to serve at least 75 customers all by my lonesome...they were drunk...I kicked atleast 12 customers out,because I was on the cusp of a mental breakdown,from being called fat,slow,dumb,and getting screamed at for being the only one there. \n\nGood times. That was the day I swore I'd rather shove cactus spines down my piss hole rather than go back to customer service.",
   "created_utc": 1692987781,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqa18g",
   "message": "Long time ago I worked at some retail store and a bomb threat was called in. \n\nWe evacuated, blah blah blah.\n\nWhile outside, someone wanted to go in and buy the newest piece of junk they heard about. Not gonna happen, pops!\n\nThey yelled at the staff, saying bomb threats should only be called in when the store was closed for the night.",
   "created_utc": 1692989059,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq66be",
   "message": "Our POS died and we had to rush a new one. It wouldn’t take gift cards from the old one, I explained to the lady the situation and she said “why did y’all sell me this GC I can’t use it” and I said “we didn’t know our old one would die” her husband told her to be quiet and walk away.",
   "created_utc": 1692987599,
   "score": 0,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqd7q2",
   "message": "Had one customer who routinely would come in about 10 minutes before close and then stand at self check out on the phone with his \"boss\" going back and forth about things until 30 minutes after close. The head cashier told me that he had been pushed out the door a couple of times without having to scan/pay for everything just so they could close. So it became a routine scam for him. And then I showed up. As soon as I would see him walking up I would make eye contact, wave and say \"10 minutes until registers close\". He would do his thing and show up 10-15 minutes after the store was closed, to SCO. Not my problem dude. The registers are closed you're going to have to come back in the morning. Tried to get into arguments. I just didn't care. It took about a month of this before he finally realized that when he saw me inside he would just turn around and walk back to his truck. I was FES at that point and encouraged the front end to do the same when I wasn't there. Dude hated my guts.\n\nI still don't care.",
   "created_utc": 1692990264,
   "score": 0,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqj970",
   "message": "Asking (pleading) for people to wear a free damned face-mask, as I passed them out, at the front door of a business, at the height of the Covid pandemic with literally dozens of hospital-fatalities from people unable to recover on a daily basis.  Fools, all.",
   "created_utc": 1692992549,
   "score": 0,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqbln2",
   "message": "We wouldn't let this trans-woman steal pampers, so she threatened to suck my coworkers dick. He declined. Proceeded to call her an \"it.\"",
   "created_utc": 1692989650,
   "score": 250,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxpoysl",
   "message": "You’re literally a Russian spy",
   "created_utc": 1692981171,
   "score": 251,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq2j8d",
   "message": "Price changes on deli items. \n\nMade a guy a sandwich, got upset because it was expensive and he wanted store brand even though he didn't specify and wasn't even that much more, but whatever. \n\nGetting upset because I couldn't hear them over a loud environment and have hearing loss. 😑\n\nGetting mad because you don't understand what \"this\" is when they point at glass with rows of food they could possibly want.\n\nI could keep going, but yeah. Haha",
   "created_utc": 1692986214,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq33r3",
   "message": "A customer cussed me out because we don’t keep all orders up at the service desk and he had to wait for me to go get his order in receiving",
   "created_utc": 1692986430,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq3cx4",
   "message": "Some people who have WIC (With Infant Child - a food assistance program).\n\nIt tells you EXACTLY what to get.  It's not hard and the process is really quick and easy if you get what is on your list.\n\nIf it says a half gallon of 2% store brand milk - you get a half gallon of 2% store brand milk.\n\nNot whole milk.  Not name brand milk.  Not chocolate milk.  Not a gallon.\n\n**A half gallon of 2% store brand milk.**\n\n.. and they always get mad over it (note: the only exception was if the item was out of stock, which rarely happens).",
   "created_utc": 1692986527,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq3fnr",
   "message": "Booked airline reservations in a call center. An older couple called because they had an issue booking to a certain city. \nI quickly determined that they were using the incorrect airport code on our website, and gave them the correct one. They argued and shouted at me, stating that our info is incorrect.",
   "created_utc": 1692986556,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq54gx",
   "message": "Customer: Who orders the toothbrushes?!\nMe: Corporate does all that.\nCustomer: WELL, I DONT LIKE WHAT YOU HAVE!!",
   "created_utc": 1692987198,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq5rh6",
   "message": "That the price of a two four of beer increased by $0.05… due to a government tax.",
   "created_utc": 1692987442,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq74qk",
   "message": "Literally anything in IT.  Everyone treats IT like the problems are made by the IT support people.",
   "created_utc": 1692987962,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq7ej6",
   "message": "my shift was ending so i turned off my light and let the customers that were already in line stay. i told people joining the line (after my light was off) that i was closed and my next customers say “we were already here and we’re not leaving”\n\ni wasn’t even talking in their direction.",
   "created_utc": 1692988066,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq7kq4",
   "message": "I used to work as a manager in an electronics store. Long story short, guy came in with his family wanting a printer and we only had one of the one he wanted. It was an open box clearance and I let him know before bringing it out. Opened it and the entire printer was covered in leaking toner, plus with the wrong cables. I ofc apologized to him, RMA'd it, and offered to give him a similar one or see if another location had it but he instead went to another manager which tried to do the same thing I did (sell him a comparable printer). He declined and next thing I know is that he blasted me on Yelp, saying that I was trying to \"make a quick buck\" and it was somehow my fault that the exploded toner thing was my doing.\n\n*shrug*",
   "created_utc": 1692988131,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq9hjx",
   "message": "Their corn dog fell off its stick. --snack bar worker",
   "created_utc": 1692988852,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxq9pe8",
   "message": "Not the customer, but a colleague (sales), recently was annoyed with me, for doing something that’s exactly what I’m paid for to do.\n\nThere’s a company that always pays too late, think 30 days beyond term and more. So to try to combat this, I’m reminding them of the due date, the day before the ultimate due date. And follow up frequently. The sales person found this to be a too harsh and abrupt. Mind you, I warned the sales person beforehand about this, and my manager let them know we’d stop deliveries, if they don’t improve. And I’m always business-polite. \nWe’re a multinational, the customer is a slightly smaller multinational, so for context, we’re not some big company pestering a small individual.",
   "created_utc": 1692988935,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqa37b",
   "message": "Shipper shorted product on a load and receiver was going ballistic on me . It really pissed him off that I wouldn’t fight back. Just kept telling him to call shipper and finally just walked away from him .",
   "created_utc": 1692989080,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqar8u",
   "message": "Wet letters during a thunderstorm.",
   "created_utc": 1692989333,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqay58",
   "message": "Not a customer, but a patient.\n\nShe was pissed her insurance wouldn’t cover cosmetic surgery. Happens all the damn time.",
   "created_utc": 1692989406,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqb8h9",
   "message": "I had a guy get mad at me for trying to help him after he FUCKING ASKED FOR HELP!",
   "created_utc": 1692989512,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqbrgl",
   "message": "All sales being final at a clearly advertised and well marketed “All sales final” spring time sale.",
   "created_utc": 1692989711,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqbs4a",
   "message": "So I used to sell the little square readers that go on phones. I had a guy get mad at me because he didn't have a smart phone and wanted to use a credit card swiper that attached to his phone with his old Nokia or whatever.",
   "created_utc": 1692989717,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqc9kj",
   "message": "Got bitched out by an old lady that the Jimmy John’s app wasn’t working right (I was the delivery driver) and after ranting for like a full minute about how inconvenient it was to call us she asked me what we were going to do to fix it and I said “ummm I don’t do any of the work on the app” and she was like “okay well please have your manager fix it” and I lost my patience and said “yeah it’s funny you say that she actually is the app developer and just manages a Jimmy John’s on the side because she likes it.” And this dumbass lady goes “wait…. seriously?” And I say “no” and start laughing. She called and complained and I got written up. Lol",
   "created_utc": 1692989900,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqdfrd",
   "message": "A long time ago in my hellish retail days I worked as an area specialist for a large retailer. Lady came in and asked if we 'had any in the back.' Explained we don't warehouse product. If there is any product available it's either on the rack or in a box being prepared to be hung on the rack. \n\nShe asked me if i could check. I explained 'there is no back, ma'am. We receive the shipment \\*pointed to the product I'd been delivered for the day still in boxes behind me\\* and then we hang them or steam them then hang them and put them on the display racks.' She asked for my manager. Told her, for the department, I was the top of the food chain. Asked to speak with the store manager and I told her to fill out a comment card and put her contact information down and he'd call her as soon as he saw the comment card.'\n\nShe filled the card out and I told her to take it to customer service and they'd make certain he saw it. She told me she wanted me to deliver it and I said 'okay.' Leave it on the cash wrap and I'll deliver it. She left...and I delivered it...straight to the circular suggestion box.",
   "created_utc": 1692990349,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqerv9",
   "message": "Customer was angry that a shelf was empty because we had sold out of a random toy. Mind you they had no idea what previously had been there.",
   "created_utc": 1692990854,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqew9d",
   "message": "The went to Quest to get blood work and screamed at the Labcorp employee why they didn't have their results.",
   "created_utc": 1692990900,
   "score": 1,
   "submission_id": "1613zyy"
  },
  {
   "comment_id": "jxqfewz",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1613zyy"
  }
 ]
}