{
 "submission_id": "16150vb",
 "title": "If you’ve been with your SO for 5+ years, how often do you have sex?",
 "selftext": "",
 "created_utc": 1692983268,
 "permalink": "/r/AskReddit/comments/16150vb/if_youve_been_with_your_so_for_5_years_how_often/",
 "score": 163,
 "url": "https://www.reddit.com/r/AskReddit/comments/16150vb/if_youve_been_with_your_so_for_5_years_how_often/",
 "comments": [
  {
   "comment_id": "jxqbxrr",
   "message": "With each other? Monthly. Her with other people? Weekly\n\nEdit. I wasn’t aware until yesterday.",
   "created_utc": 1692989775,
   "score": 25,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpvby6",
   "message": "We’ve had definite dry spells over the decades but about 3 times a week now.",
   "created_utc": 1692983543,
   "score": 192,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpuxt9",
   "message": "23 plus years and As often as we can when schedules and desires lineup . 2-3 times a month",
   "created_utc": 1692983397,
   "score": 255,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpx8u2",
   "message": "Once or twice a month. It’s lovely each time so I don’t mind the waiting.",
   "created_utc": 1692984248,
   "score": 18,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpusvi",
   "message": "Sadly like once a month, if that.",
   "created_utc": 1692983346,
   "score": 64,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqa8ad",
   "message": "almost 41 years.\n\nwhenever I can get it up.\n\n\nnot often",
   "created_utc": 1692989133,
   "score": 28,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpwybi",
   "message": "Been with my wife for 25 years. We still do it 4-5 times per week. I’m lucky I guess.",
   "created_utc": 1692984142,
   "score": 75,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpwptw",
   "message": "It’s all about keeping it fresh, every relationship is different. Sometimes it’s boring 2-3 times a week, sometimes it’s 1-3 times a month. It’s all about the healthiness of the relationship. I noticed I’m my personal relationship with my spouse, when we struggle, our sexual relationship struggles as well but when this are good we are more active with each other. Remember things change with time as well as with age. Mostly time though. It’s about bonding not contact.",
   "created_utc": 1692984056,
   "score": 92,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqcq40",
   "message": "Fifteen years, it ebbs and flows. \n\nI'd say we have some sort of sex twice a week, and full-on intercourse less because it takes more time and preparation. \n\nAnd, quite frankly, I think when you're with someone for a long time you're less hung up or getting the PIV goal all the time. It's special and all, but there are a lot of ways to get your rocks off and have fun.\n\nSometimes it's nothing for a week or two but if we're on vacation or just in a zone, it's every day for a while.\n\nHonestly, the biggest influence is our sleeping schedules and stress. When we have relatively little stress and we are going to bed and getting up at the same time, it's all the time. So it's really more of a practical issue than libido, waning passion, or over familiarity.\n\nEDIT: I feel like I should add we are in our late 40s.",
   "created_utc": 1692990075,
   "score": 91,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqugt5",
   "message": "30 years. We were on a nice pace (twice month) until she started a new med, now looks like once every 3 months now. Not complaining , rather she be healthy than horny",
   "created_utc": 1692996729,
   "score": 76,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxputfi",
   "message": "2-3 times a week",
   "created_utc": 1692983352,
   "score": 97,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpzrqn",
   "message": "I’m 40 and my wife is 45, we average 1-2 times a week, but it can change up or down based upon what’s going on in life.",
   "created_utc": 1692985185,
   "score": 25,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpz1nc",
   "message": "We've been married for 35 years, typically 4-5 times a week.  Sometimes more, sometimes a bit less, but rarely less than three times.  We dig each other, it's always awesome.",
   "created_utc": 1692984919,
   "score": 114,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxq06zg",
   "message": "Togethet for about 25 years. Sex on average once every 2-3years. NOT by my choice.",
   "created_utc": 1692985340,
   "score": 78,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxq13ib",
   "message": "We've been together for 8 years, and it's infrequent. We might have dry spells of a few weeks sometimes, and then we might have times where it's every day for a few weeks. \n\nIn some weird way, our libidos are synced. During the dry spells neither feels like it but each time it breaks it is absolutely wonderful. It just feels so passionate and loving it's hard to describe. I just get a warm, fuzzy feeling inside",
   "created_utc": 1692985678,
   "score": 48,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpyeah",
   "message": "1.5 times per week, I’d say. We usually see each other on weekends and have sex once or twice.",
   "created_utc": 1692984676,
   "score": 14,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpyuf4",
   "message": "Only during a full moon. Wham bam, she turns into a bat and leaves.",
   "created_utc": 1692984843,
   "score": 36,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpw566",
   "message": "I’ve been with my woman for over 7 years now. She’s amazing apparently, we have sex 2 to 3 times a week.",
   "created_utc": 1692983845,
   "score": 33,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpydsb",
   "message": "Together for 13 years, married 4. Depends. At least once a week, sometimes several times a week or more",
   "created_utc": 1692984671,
   "score": 11,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqg93k",
   "message": "Oh man! We talk about having sex 2-3 times a week! But she usually falls asleep shortly after we put the kids to bed and so then I go downstairs and rub one out by myself.  So it's actually pretty rare, but luckily I am quite good at masturbating thanks to decades of practice.",
   "created_utc": 1692991409,
   "score": 25,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqgj6f",
   "message": "6 plus years, still most nights",
   "created_utc": 1692991515,
   "score": 12,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpyu7h",
   "message": "What's sex?",
   "created_utc": 1692984841,
   "score": 27,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqfdt3",
   "message": "Been with my wife for about 19 years now.\n\nBefore we had a kid, it was a minimum of 3 times per weeks, sometimes multiple times per day.\n\nAfter we had a kid it went way down because she was busy child-rearing during the day while I was at work and would be exhausted.  But now he's much older.  I'd say we do it about 2-3 times a month.  But my wife generally has a much lower libido than I do anyway, and she's susceptible to her libido going into the toilet any time she's stressed out, which with her work is often, unfortunately.  Her job or any household stress has cock-blocked me more times that I can count.",
   "created_utc": 1692991083,
   "score": 16,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpxfqz",
   "message": "Every other day",
   "created_utc": 1692984320,
   "score": 8,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpzrxs",
   "message": "Been together for 10 years. Both late 20s.\n\nAt least 3 times a week but usually not more than 5.",
   "created_utc": 1692985187,
   "score": 14,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpx9ov",
   "message": "with each other?",
   "created_utc": 1692984257,
   "score": 27,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpvdwz",
   "message": "Unfortunately like maybe 3-4 times a month",
   "created_utc": 1692983564,
   "score": 9,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqlizh",
   "message": "Married 11 years. 3-5 times a week",
   "created_utc": 1692993396,
   "score": 5,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqsjtk",
   "message": "Using throwaway because my wife knows my account.\n\n22 years.\n\nSex once a month if that. She acts like shes being generous. We had sex twice last month and i think she feels she doesnt have to this month.\n\nShe makes me so miserable and insignificant. Leaving her will financially destroy me so i will pretend i am happy like i am supposed to. All men are terrible after all.",
   "created_utc": 1692996009,
   "score": 42,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpxpat",
   "message": "Been with my wife 8 years now. At first we had a great sex life. 4 montha ago we had our first child and now we're on a long dry spell. I'm sure we'll eventually get in a new routine so I haven't lost hope.",
   "created_utc": 1692984419,
   "score": 12,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxpz6ob",
   "message": "Twice a week.",
   "created_utc": 1692984970,
   "score": 5,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqghob",
   "message": "3 times a week during routine. 4-5 times a week during Summer break. Everyday on vacation. \n\nMy wife is the limiting factor. I'd go everyday even when I'm sick or if someone died.",
   "created_utc": 1692991499,
   "score": 9,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqhimg",
   "message": "If he's home, every day at least once",
   "created_utc": 1692991885,
   "score": 4,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqj8sl",
   "message": "Together for 15 years, married for nine, still have sex 2-5 times a week.",
   "created_utc": 1692992545,
   "score": 4,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqmayk",
   "message": "13 years, once a week.  Thursdays are date night.",
   "created_utc": 1692993687,
   "score": 7,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqn790",
   "message": "Married 10 years. 1-2 times per week. Sometimes once a week. But only because I’m a new mom and he’s a resident. So both a bit exhausted.",
   "created_utc": 1692994021,
   "score": 7,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqnf6g",
   "message": "Married for 12 years.  2-3 times per month.  Wish it were 2X per week.  Our libidos are different, we both work demanding full time jobs, own a house and are raising 2 kids.",
   "created_utc": 1692994102,
   "score": 6,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqg69d",
   "message": "Been married almost 31 years. We generally do it 3-4 times a week, but if we're both off work for a week, we'll do it every day. We are very...compatible that way...lol",
   "created_utc": 1692991380,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqhxwa",
   "message": "30 years, so im currently a virgin 2.0. Opened the marriage and apparently im too gross to have sex with.",
   "created_utc": 1692992049,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqn6ly",
   "message": "1-2 a week.",
   "created_utc": 1692994014,
   "score": 4,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqo6it",
   "message": "31, 11 years in, MAYBE once a month.",
   "created_utc": 1692994384,
   "score": 6,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqptvg",
   "message": "15 years.  \n\nAnd, as often as the 2, 5 and 7 year olds allow. So, weekly?",
   "created_utc": 1692994999,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxr1o7l",
   "message": "20+ years and 2-3 (average) times per week. \n\nI hit the jackpot because I think she's hornier that I am.",
   "created_utc": 1692999565,
   "score": 5,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxrmc5v",
   "message": "Rarely.  Came up in conversation once, sex isn't good enough to want it more. I'm the only 1 she's been with.. so  I stopped asking for it.  She asked me why I don't initiate anymore , explained why. She told me not to take it personally.. that I misinterpreted it.. wtf\nTold her if she wants, to come to me.. says she feels weird initiating..together over 20 years.\nThere is definitely no cheating going on. 100% positive",
   "created_utc": 1693008584,
   "score": 14,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxrwy1j",
   "message": "Coming up on 19 years. The number doesn’t matter. Whether you’re both happy with the number is what matters. \n\nEach season of life has been different. We both try to make sure that the other one isn’t feeling deprived, all things considered. \n\n(Weird schedules, illnesses, and injuries are all things to be considered.)",
   "created_utc": 1693013461,
   "score": 12,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqkv09",
   "message": "Probably like 7-10x a week. Not every day, but multiple times on the nights we do. We are both 40, have a kid, and together for 9 years. Guess we are just two horny old people, but at least our sex drives match perfectly!",
   "created_utc": 1692993146,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxryxcy",
   "message": "1-2x a week.",
   "created_utc": 1693014406,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxryzuh",
   "message": "I'd say maybe twice a month on average",
   "created_utc": 1693014439,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxq32nu",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxq4m1e",
   "message": "Been together for about 8 yrs and 3 kids later and it’s gone from 3-5 times a day in the beginning to about 1-2 a day daily. \n\nThings that help: \nNo porn or masturbation \nCommunication \nLooking at the physical intimacy as a way to bond\n\nAlso, we made a promise to communicate if things get too dull",
   "created_utc": 1692987004,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqmtp1",
   "message": "At least 3x a week 🐇",
   "created_utc": 1692993882,
   "score": 1,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqe82t",
   "message": "3 times a week or so, more on vacations. We've been together 11 years. Get on our level, figure out why you people can't fuck more.",
   "created_utc": 1692990647,
   "score": 0,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqao8w",
   "message": "We do oral and hand stuff a couple times a week. Sex about every other weekend. We'll have days where we have sex like 3 times a day. If one of us isn't in the mood, the one who is will watch porn and masturbate while the other watches.",
   "created_utc": 1692989302,
   "score": 1,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqmjxy",
   "message": "In March we'll be 12 years together, 10 years married.\n\nThe honest answer is that sex frequency waxes and wanes. Some weeks we go at it almost every day. Some weeks we might get in 1-2 sessions. There have been few instances where we've gone 10+ days without.\n\nSometimes libido just doesn't sync up. Sometimes one or the other is stressed, injured, or ill. Sometimes (especially during the summer) one or both of us is utterly exhausted from yardwork or training and we simply don't feel like it. My wife also travels for work occasionally so during longer travels we obviously don't have any sex at all.\n\nIt's okay for things to vary. That's part of what makes it fun. When we go on vacation--especially if staying in a nice hotel--then usually we go to town on each other. Last time in San Diego I think we had sex like 3 or 4 times both days, then almost daily when we went to Hawaii after.\n\nOn average we are a 2-3 times weekly couple, especially if you include oral, hand play, and/or toy play. It doesn't always need to be P in V.",
   "created_utc": 1692993781,
   "score": 1,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxruyfz",
   "message": "So, me and my wife, we're actually having a serious addiction to sex ever since a few months after COVID, as we were using sex to cure boredom, then it slowly turned into this pleasure reliance to relieve stress and boredom, and now we're literally just getting it on every morning like we were drinking coffee. We've seen a few therapists about it but they just think it's honeymoon phase reigniting. Is anyone having the same issue? I'll really appreciate some reassurance that it's not a problem.",
   "created_utc": 1693012516,
   "score": 1,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxr2epc",
   "message": "Married 13 years... We average 7-10 times per week.",
   "created_utc": 1692999868,
   "score": 255,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxr5gnm",
   "message": "I'm into my 5th year with my husband and we have intercourse once or twice a day. Sometimes 3 if we have the time. As far as oral, it's mostly me doing it but I love to do oral sex it about 3-6 times a day. I have a very high sex drive though and my husband takes it like a champ. I now look to add other girls to our sex life because that's a turn on for me personally so hopefully we can do more but for us sex is a very high priority in our relationship.",
   "created_utc": 1693001134,
   "score": 255,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxq7xhl",
   "message": "Been together 7 years. Used to be almost every day then dropped to 1-2x a week then to every few weeks. Then I started having memories of sexual trauma and now we haven’t had sex in months. I just need space to heal. Sex has been giving me panic attacks. It’s been really hard on both of us but I just don’t want to have sex and don’t want to force myself to..",
   "created_utc": 1692988266,
   "score": 0,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxr5ds7",
   "message": "3-5 times a week",
   "created_utc": 1693001101,
   "score": 0,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxq0qyk",
   "message": "Every day in the beginning. Dropped off to about twice a week until recently. Now more like once a week.",
   "created_utc": 1692985549,
   "score": 1,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxq1at8",
   "message": "Together 7 years married for one. Probably 2-3x a week on average. Maybe once a week if we’re busy or stressed.",
   "created_utc": 1692985754,
   "score": 1,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxq4475",
   "message": "30+ years married sex life was 4+ times a week until menopause. now less than 4 times a year",
   "created_utc": 1692986815,
   "score": 1,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxq4zoi",
   "message": "Some weeks it's every day, then a week or so off, then back at it a week.",
   "created_utc": 1692987147,
   "score": 1,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxq6sdz",
   "message": "20+ years together.  About 3x week? Perhaps a bit routine at time as we have to fit time in where we can ( work schedules, busy kid schedules) but I say 3x week average.",
   "created_utc": 1692987830,
   "score": 1,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxq7caw",
   "message": "40 years,once a week",
   "created_utc": 1692988042,
   "score": 1,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxq8w54",
   "message": "When we first dated it was constantly. Our record was 6 times in a day and 15 times in a week.\n\nNow we’ve been together for 8 years and married for 2.5 years. Before she was pregnant it was 2x/wk, now that she’s pregnant it’s maybe 3x/month because she’s so uncomfortable. We’re trying to find different ways/positions to increase that though.",
   "created_utc": 1692988628,
   "score": 1,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxq8y61",
   "message": "About 6x per month. Sometimes 3 times in a week, sometimes once in three weeks",
   "created_utc": 1692988649,
   "score": 1,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqa4mo",
   "message": "2-3 times/month",
   "created_utc": 1692989095,
   "score": 1,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqb7hh",
   "message": "Something in the range of 2-4x a week is probably average.",
   "created_utc": 1692989502,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqor3k",
   "message": "Were in our mid-50's and we've been married for 23 years. We average probably weekly. It's very romantic too, it starts with someone screaming \"I require servicing!\" throughout the house.",
   "created_utc": 1692994598,
   "score": 13,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqfqx3",
   "message": "Married 10yrs....it's about once every 6 months.",
   "created_utc": 1692991218,
   "score": 11,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqm7hj",
   "message": "Been together 7 years. Went from very frequently to like once every 3 months.",
   "created_utc": 1692993651,
   "score": 5,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqrnp5",
   "message": "Once or twice a week, I also take care of myself when I need to (daily at least) instead of getting frustrated.  \n\nBeing open and just saying \"hey I'm gonna go jack off\" and not worry about being walked in on or trying to hide it has been solid for us.  \n\nThere was a period where I felt like I couldn't do that and had to rely on her for everything which just frankly was not possible. We worked it out and I am extremely happy and satisfied in the sex department. 🤠",
   "created_utc": 1692995679,
   "score": 6,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxs8ck6",
   "message": "We have sex almost every day. Almost Monday, almost Tuesday, almost Wednesday...",
   "created_utc": 1693019108,
   "score": 11,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxr23sa",
   "message": "Somewhere between 3 or 4 times a year. Yeah, I know. :(",
   "created_utc": 1692999742,
   "score": 5,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxrb086",
   "message": "For roughly the first 3 years it was three or four times a day. About 4-8 it was three or four times a week. Around 9-15 years it was three or four a month. 15-20 it turned into three or four times a year. 20-30 it has been once every three or four years.\n\nNow, \"It's been 84 years.\"",
   "created_utc": 1693003521,
   "score": 4,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqwp6v",
   "message": "Not often enough. But as I’ve commented before, lexapro is definitely not helping me.",
   "created_utc": 1692997576,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxr0p51",
   "message": "Unfortunately not enough, like once a month maybe.",
   "created_utc": 1692999166,
   "score": 4,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxrooj3",
   "message": "Been married 14 years.  Connecting during sex has always felt....dIfficult?  Impossible perhaps?  Due to repetitive SA by her sibling when she was young.  Our frequency has been declining precipitously for the last 5 years.  At this point I don't feel like she cares about my needs and I sincerely doubt she's ever cared.  It has frequently been a struggle for me for many years.  And I felt like I shouldn't speak about it due to the sensitive subject.  She seems to be deeply angry and rageful person.  She's definitely made the attempt (in whatever way she could) for many years but we haven't had sex in almost a year now and at this point and I'm just done with asking for something she clearly despises anyway.  Do I want to get angrily glared at like some kind of criminal while having completely consensual sex?  No fucking thanks.  She just doesn't want me, and at this point I'd be glad to find someone that actually does.  Probably gonna be divorced within a year or less.",
   "created_utc": 1693009633,
   "score": 4,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxs0q2i",
   "message": "Twice in 20 months lmaoooooooooooooooooooooooooo",
   "created_utc": 1693015262,
   "score": 4,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxsen61",
   "message": "18 years and almost daily so far...",
   "created_utc": 1693022650,
   "score": 4,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxs4fqy",
   "message": "About once a year at this point.... It fucking sucks.\n\nDon't worry, she's \"working on herself\". I'm sure it will be rainbows and sunshine any day now.",
   "created_utc": 1693017084,
   "score": 7,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxs6sd3",
   "message": "Twice in the last 12 months... due to wife's medical issues..\n\n\nFuck, typing this made me depressed..",
   "created_utc": 1693018288,
   "score": 8,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxrr2kz",
   "message": "I hate to admit it but we have had sex once in the last year. Been together for 10. I thought I was going crazy, I thought it was me, and at some point my sadness about it just kind of set in.",
   "created_utc": 1693010708,
   "score": 6,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxru3nm",
   "message": "Welp, it's been almost a year. We've been together almost 10. It's been a hell of a dry spell.",
   "created_utc": 1693012105,
   "score": 6,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqqdop",
   "message": "Been married 11 haven't got in in 7 FML",
   "created_utc": 1692995205,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqxkk1",
   "message": "15 here. Last time it was 6 months. Now on for 3.",
   "created_utc": 1692997917,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqzj8h",
   "message": "Been with my partner for 6 years. He has a drinking problem, and hasn’t gotten himself the help he needs. It’s take an emotional toll on our relationship to the point where it’s affected my sexual desire. He smells like booze, doesn’t regularly shower or brush his teeth, and he smokes cigarettes- the odors are always on his mustache and beard. \n\nI have tried really hard to work past it but I am failing and I feel awful about it. I have asked him many times to please stop drinking to the point of being buzzed everyday and to please practice better hygiene but he doesn’t do it. So we have sex 1-2 times month, and he gets hand jobs. Idk where to go from here.",
   "created_utc": 1692998693,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxriug0",
   "message": "Once or twice a month and I'm good 😁",
   "created_utc": 1693007012,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxrj7fn",
   "message": "Paradoxically significantly more since she told me she wanted a divorce",
   "created_utc": 1693007173,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxrkjsh",
   "message": "Almost every day.   Almost Monday, almost Tuesday...",
   "created_utc": 1693007777,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxru5al",
   "message": "Like once a month or so. It sucks",
   "created_utc": 1693012127,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxrw9t2",
   "message": "Together 6.75 years. Married since October 22. \n\nHaven't had sex since our wedding night. \n\nBefore then was over 2 years. His choice, not mine. And no, he's not cheating. He's has a porn (video game porn) addiction and death grip syndrome. \n\nBut weirdly enough, I'm not necessarily bothered by it like people expect me to be. I kind of cut out my expectations of sex with him. So when I don't expect it, I'm not disappointed.",
   "created_utc": 1693013138,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxs9n89",
   "message": "25% of American marriages are sexless. The high losses of divorce are why men don't end it. 25% of women are completely content with their choice of sexless marriage.",
   "created_utc": 1693019803,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxscsk7",
   "message": "He hasn't had sex with me in the past 2 years so I finally dumped his ass recently.",
   "created_utc": 1693021571,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxsdh7w",
   "message": "20+ years.  Sex, I’ve heard of it.  Sounds fun.",
   "created_utc": 1693021968,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxsdi8y",
   "message": "First 20 years about 7-8 times a week. last few years? About 1 maybe 2 times a week",
   "created_utc": 1693021984,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxsdk39",
   "message": "Married 20 years. When the kids are around, 4 or so times a month. When the kids are at sleep away camp or at the grandparents, like twice a day.",
   "created_utc": 1693022014,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxsepbk",
   "message": "15 year yearly average every other day.",
   "created_utc": 1693022685,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxses9u",
   "message": "Been together almost 20 years and we try for every day, but with life and kids, it's more like every other day.",
   "created_utc": 1693022734,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxsf6t9",
   "message": "15 years.... Hardly ever now. Always too tired, problems everywhere and just the busyness of life gets in the way. \n\nWe both feel the same so it's not a situation where one is against the other.",
   "created_utc": 1693022977,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxsh5f8",
   "message": "Average twice a week. But it comes and goes. Sometimes more, some times less. \n\n10 years married, 15 years together",
   "created_utc": 1693024169,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxskkpi",
   "message": "We’ve been together for 8 years….Almost never, less than 5 times this year, I realized this year that we only have sex if I initiate and she’s only ever initiated when she was drunk, last time being two years ago.  This has led me to be less inclined to initiate.",
   "created_utc": 1693026358,
   "score": 3,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqgzwg",
   "message": "Been with my husband for almost 8 years. About 3 to 5 times a month? He has a broken L4 and L5 and he's got chronic pain. Some days are better than others, and some months he even goes beyond our usual if he's really feeling good.\n\nI'm just grateful that I get to spend the time that I have with him. 😊",
   "created_utc": 1692991688,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqheco",
   "message": "It's Friday. Make it happen!",
   "created_utc": 1692991840,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqjfyb",
   "message": "A.B.R. - Always Be Ready - thats the motto I live by",
   "created_utc": 1692992620,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqnx3f",
   "message": "Once a year\n\nExcept leap years, we miss that year",
   "created_utc": 1692994286,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqoz3w",
   "message": "Anytime she wants it. So, about 4 times a year.",
   "created_utc": 1692994680,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxqps38",
   "message": "There is nothing happening. She has a few health issues that picked up a year or two ago so our adult life died.",
   "created_utc": 1692994981,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxquxf2",
   "message": "Couple times a year.",
   "created_utc": 1692996905,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxr9htf",
   "message": "My wife and I are 1 month from our 10 year (dating) 2 months from our 7 year (wedding) anniversaries. We have sex 1-2 times a week. She and I both want it more, so I often go down on her randomly through the week because I have a heart condition, and my meds sometimes make things difficult for me.",
   "created_utc": 1693002856,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxrb1e4",
   "message": "1-2 times a month",
   "created_utc": 1693003536,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxrcdtg",
   "message": "Both 25, have been together 7 years. Right now probably twice a month, used to be a lot less. it’s taken a lot of communication and working on things together to get to this point",
   "created_utc": 1693004137,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxrow84",
   "message": "Every 6-8 weeks. Married 10 years. Together 16 years. In a new quarter though so data might change",
   "created_utc": 1693009730,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxrp8l5",
   "message": "Been together for 17 or 18 years. Started keeping track almost 5 years now after having countless arguments over how often we were doing it. First 4 years were 34-45 times. Currently at 33 this year and still have 4 months so might break that 45 record.... If anyone is wondering, keeping track actually helped a ton with the arguments, for both of us.",
   "created_utc": 1693009885,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxrsebw",
   "message": "Not nearly often enoug.",
   "created_utc": 1693011312,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxs8xeb",
   "message": "Not enough 😭",
   "created_utc": 1693019414,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxsdmd5",
   "message": "Pretty much everyday.",
   "created_utc": 1693022051,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxse38u",
   "message": "Been together for 7 years. Sometimes we might go a week or more without sex, sometimes we fuck like rabbits. It all depends on moods, stress, and life in general. There are nights I wake her up fingering her, there are mornings I wake up with my dick in her mouth. Life is unpredictable, and so your sex life might be as well. As others gave said, the key is communication.",
   "created_utc": 1693022327,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxsi0a9",
   "message": "Been married 5 years and have 3 infants and we do it about 2-3 times a week... make the time!",
   "created_utc": 1693024701,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxskgx7",
   "message": "Put a jar in the bedroom, every time you have sex in the first three years of your marriage, put a penny in that jar. After three years, every time you have sex, take a penny out. Chances are you will never run out of pennies.",
   "created_utc": 1693026290,
   "score": 2,
   "submission_id": "16150vb"
  },
  {
   "comment_id": "jxsoptx",
   "message": "2/3 times a week. Going on 12 years.",
   "created_utc": 1693029246,
   "score": 1,
   "submission_id": "16150vb"
  }
 ]
}