{
 "submission_id": "1618b8p",
 "title": "Do you agree that morbidly obese people should be forced to purchase 2 seats on a plane if they take up more than 1 seat? If not, why?",
 "selftext": "",
 "created_utc": 1692990848,
 "permalink": "/r/AskReddit/comments/1618b8p/do_you_agree_that_morbidly_obese_people_should_be/",
 "score": 246,
 "url": "https://www.reddit.com/r/AskReddit/comments/1618b8p/do_you_agree_that_morbidly_obese_people_should_be/",
 "comments": [
  {
   "comment_id": "jxqii2r",
   "message": "I'm morbidly obese. \nSouthwest will refund your second seat ticket if the flight doesn't sell out. I buy 2 seats by default so I have personal space and then of the flight isn't full get refunded for my fat seat.",
   "created_utc": 1692992261,
   "score": 240,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqsjbf",
   "message": "You pay for each seat you take up.",
   "created_utc": 1692996005,
   "score": 37,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqjfgv",
   "message": "I've had a broad guy (not heavy) sit next to me his butt was in his seat, but his shoulders were in mine. Can we just make all seats a little wider? Maybe 50 inches. That should fit just about everyone with some expectations.",
   "created_utc": 1692992615,
   "score": 174,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqftdu",
   "message": "\nThe onus is entirely on the airline to make sure that everybody who bought a ticket has a full seat to sit in. I don't really care how they do it. If they want to charge somebody who takes up two seats the cost of two seats and reserve them for that person, that works for me. If they just want to hold an extra seat at no charge for someone who takes up two seats, that's fine too. It's not my problem to figure out. I just know that if I purchase a ticket, I want the full seat that I paid for available to me and me alone.",
   "created_utc": 1692991244,
   "score": 203,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqgxsx",
   "message": "There's no force.\n\nThe trade is essentially a price for a space on the plane, and the idea is that you need to fit into that space.\n\nIf you can't fit into that space, and you need more space, you need to pay more to take up more space on the plane.\n\nThis isn't complicated.",
   "created_utc": 1692991665,
   "score": 79,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqfqo0",
   "message": "And concerts.\n\nWithin the last few months I have been to two concerts where the person sitting next to me had to be like 400 pounds, and I honestly had to lean way over in my seat in the opposite direction, not to avoid touching them, but just to fit, because they were taking up part of my chair.\n\nLook, I sympathize with being overweight, and I think that everyone deserves dignity. I am not going to say that being overweight is a personal failing or that significantly overweight people deserve shame or blame(and I know that depression, anxiety, and hormones affect metabolism and/or hunger), but this is interfering with other people being able to use what they've paid for.\n\nEven up to about 300 pounds, you can probably fit within one seat, but if you are above 300 pounds, yeah, you probably need to be purchasing enough seats so that you're not spilling over into other people's seats.",
   "created_utc": 1692991215,
   "score": 63,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqs6bp",
   "message": "If you physically take up two seats, you pay for two seats.",
   "created_utc": 1692995869,
   "score": 10,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqfaz5",
   "message": "Yes. It’s not fair for someone to take up someone else’s seat space for any reason.",
   "created_utc": 1692991054,
   "score": 46,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqjkqu",
   "message": "Yes and it is not ACTUALLY a controversial move to charge someone for a 2nd seat...no matter what social media tries to tell you.  \n\nWhatever the reason may be, if you can't fit comfortably into a certain space and you encroach on others, you should be charged for an additional space.  It is not your neighbors' burden that you can't fit into your paid space.",
   "created_utc": 1692992671,
   "score": 26,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxql732",
   "message": "My 2 cents worth.i recently flew to the states next to a woman who was huge. She asked for a seatbelt estension straight away. She then lifted up the armrest to get in and then couldnt put it down meaning that half her bulk was on my chair.\nThe flight was full and I quickly told the steward that it was against regulations to take off without it down. \nI promptly was moved to business class. I am sorry but if you cant fit in the seat then you should pay for a business class seat with extra room",
   "created_utc": 1692993272,
   "score": 28,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqf5rx",
   "message": "yes 100%",
   "created_utc": 1692991000,
   "score": 31,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxql36g",
   "message": "Yes. I paid for *my* space on that flying tin can. I shouldn't have to sacrifice my comfort that I *paid* for because someone else is obese.",
   "created_utc": 1692993231,
   "score": 15,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqiilw",
   "message": "Absofuckinglutely they should! Why should anyone else have to pay for a seat and lose half of it because a morbidly obese person won't pay for the 2 seats they know they need!",
   "created_utc": 1692992267,
   "score": 24,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqssou",
   "message": "UPS and FedEx charge by weight and size. Airlines should too.",
   "created_utc": 1692996101,
   "score": 6,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqw9j9",
   "message": "Absolutely. Not only are their grotesquely fat bodies a nuisance for anyone riding next to them but airplanes have to be very careful about their weight. A few fat people may seem like a small deal but these small differences can really matter.",
   "created_utc": 1692997411,
   "score": 4,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqjo1p",
   "message": "Sure thing, and while the airlines are doing so they can scrape up all the tax money they have received to keep operating and give it the fuck back to the taxpayers.",
   "created_utc": 1692992705,
   "score": 9,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqphme",
   "message": "Yup. Either that or the people who have to sit next to them get a discount.",
   "created_utc": 1692994871,
   "score": 3,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqsgk2",
   "message": "Yes, for obvious reasons. Take up two seats, you must buy two.",
   "created_utc": 1692995976,
   "score": 5,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqwkz9",
   "message": "Yea absolutely",
   "created_utc": 1692997531,
   "score": 5,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqgx07",
   "message": "Hell yes.",
   "created_utc": 1692991657,
   "score": 9,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqiyo2",
   "message": "Bill Burr had a funny bit talking about a guy who sat next to him who was so fat Bill was next to him and behind him at the same time",
   "created_utc": 1692992437,
   "score": 10,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqkkrm",
   "message": "Actually all tickets should be sold not only by seats used but also weight.\nWeight is an important factor for fuel consumption, and why should a 130lbs woman with 6lbs hand luggage pay the same as a 240lbs man with 14lbs hand luggage?\nShe is subsidizing his fuel.",
   "created_utc": 1692993044,
   "score": 6,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqsved",
   "message": "What sucks, is they will often \"take\" the 2nd seat if the flight is full, and sell it to another passenger anyway. The airline did it to my uncle. He bought two, and then when he got on the plane, someone else was sitting in one of his seats. When he complained to the flight attendant, they offered to refund the 2nd seat. They do this, too, with people who buy a 2nd seat for a music instrument, for example.",
   "created_utc": 1692996130,
   "score": 6,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqlrs8",
   "message": "Of course. If you're familiar with the golden rule you shouldn't be against that.",
   "created_utc": 1692993487,
   "score": 3,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqqq4e",
   "message": "Absolutely. On top of that we have to pay extra for baggage thats too heavy, why do we ourselves get an exemption for that weight limit? Extremely heavy passengers is less cargo the plane can transport, which makes the flights more expensive for everyone.",
   "created_utc": 1692995331,
   "score": 3,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqsuds",
   "message": "You’re damn right they should.",
   "created_utc": 1692996119,
   "score": 3,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqv8xc",
   "message": "Maybe there should be a couple of fat seats on a plane if they could be put in if there is extra space. \n\nIf not then yeah they should pay for extra seats. \n\nOn a flight from KC to Minneapolis I was basically trapped in my seat  by two large fat people on either side of me. Their arms basically held my shoulders in place against my seat back. I basically kept my arms/hands in my lap the whole flight.  Thankfully it was a short flight. My next leg of my trip was from Minneapolis to England and I'd've lost my mind if I had to be trapped behind flabby arms the whole flight.",
   "created_utc": 1692997025,
   "score": 3,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr1fuq",
   "message": "Yes absolutely. You are paying for cubic feet of space, and you don’t get some of mine because you can’t fit in your allotment",
   "created_utc": 1692999468,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr3jwh",
   "message": "If I was morbidly obese I would be buying two seats just so that I would be comfy. You wouldn’t have to force me. I don’t want to spend any period of time cramped and uncomfortable next to a total stranger.",
   "created_utc": 1693000343,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr57dn",
   "message": "Not just seats. In case of emergency they are actually serious safety threat to dozens of other passengers.",
   "created_utc": 1693001028,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxql3zy",
   "message": "Weight costs fuel. We should all have to be weighed before flight and our rates scaled accordingly. Luggage included.",
   "created_utc": 1692993239,
   "score": 5,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqmjdr",
   "message": "If they're that obese, they need to pay for two seats or not fly. The airline is a private agency, not a social service, and has the right to require this.",
   "created_utc": 1692993775,
   "score": 5,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqp1g1",
   "message": "Yes if u want extra space pay for it.",
   "created_utc": 1692994705,
   "score": 6,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqk9e6",
   "message": "I think the bigger problem that airlines have to solve is that they tend to overbook their flights and then come up with bullshit excuses why you can't board the flight you bought a ticket for.",
   "created_utc": 1692992927,
   "score": 9,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqkf41",
   "message": "If someone is the size and weight of two people, then for an airline where that sort of thing can make a difference it would seem fair that paying for the space and fuel that they use via ticket prices would be fair. From the airline's point of view they are losing money transporting one person when they could be taking two.",
   "created_utc": 1692992986,
   "score": 5,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqldhr",
   "message": "Yes 100% Why should the person beside them have to share their purchased space with someone.",
   "created_utc": 1692993338,
   "score": 5,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqlln9",
   "message": "You pay for your seat,  if you take up two seats,  you pay for two seats.",
   "created_utc": 1692993422,
   "score": 3,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqolp2",
   "message": "Yes, because you're paying for the seat. The same reason I'm not going to tolerate someone sticking their feet out and laying on my lap.\n\nI'm not paying for a seat to have some obese man or woman spill into half of it and make my ride miserable.\n\nIt isn't \"discrimination\", I fucking paid for the thing and it's not reasonable to expect otherwise.",
   "created_utc": 1692994542,
   "score": 4,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqp9kq",
   "message": "Not just morbid but any Trump-215er.  Just buy the second seat pal.",
   "created_utc": 1692994789,
   "score": 3,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqq146",
   "message": "I agree. You pay for the service you use, if you use two seats, then you should pay for them. It doesn't matter if it's because you're fat or you just don't want to sit with anyone. \n\nIf you eat two meals at a restaurant, you pay for both of them. If you need a big house, you pay for the whole property. So why shouldn't you pay for the extra seat that you need?",
   "created_utc": 1692995074,
   "score": 5,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqq6bl",
   "message": "As a fat guy, yeah. It's not fair to someone else if I take up their space and it's more comfortable for me any way",
   "created_utc": 1692995128,
   "score": 4,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqndwa",
   "message": "Some airlines will require people over a certain size to buy 2 seats. Just depends.",
   "created_utc": 1692994089,
   "score": 2,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqt7wj",
   "message": "The product is space on an airplane if you are requiring the space of two then you need to purchase the space of two",
   "created_utc": 1692996260,
   "score": 2,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqy1r9",
   "message": "I’d go a step further. Stop charging for baggage and simply charge everyone for their gross weight. Weight = fuel = cost",
   "created_utc": 1692998105,
   "score": 2,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqymlx",
   "message": "Sell seats by the pound....",
   "created_utc": 1692998333,
   "score": 2,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr2qo9",
   "message": "I had a middle seat between two body builders a few years ago.  They weren’t very tall and their asses fit fine in the seats but literally had about 12 inches to squeeze in between their shoulders.  Full flight and no other seats available. No bueno.",
   "created_utc": 1693000006,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr6270",
   "message": "It's a tough thing though, should really skinny people get a discount?",
   "created_utc": 1693001382,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr6ut8",
   "message": "Yes.\n\nBut airlines need to stop being greedy assholes and give all people more space",
   "created_utc": 1693001721,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr72oe",
   "message": "Yes, because they take up more than one seat.  Maybe the airlines could have a couple of \"obese\" seats for a less the price of two?  idk.",
   "created_utc": 1693001815,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr8qfk",
   "message": "Yes. They take up more space and impede their fellow travelers.",
   "created_utc": 1693002529,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr8s7y",
   "message": "110% yes. If you are oozing into my space, whether you’re obese or just unfortunately very broad, get a second seat or don’t fly. I paid for my seat and I don’t want you in it. I also drive a Corolla and the seats are about the same size. A bit snug? Yes. Not unreasonably small. But I am 5’5 130-140lbs, bottom heavy, and I don’t even come close to hitting the perimeters of even the tiniest coach seats.\n\nAnd to those who say to increase seat size: that will come with a proportionate price increase. The planes will not hurt their profits for the size increase and the aisles can’t get any smaller. Unfair to people like me (the majority) who don’t need a second seat. Flying is a privilege, not a right.",
   "created_utc": 1693002551,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr8xqf",
   "message": "Look I have to pay full price for my children who don’t take up a full seat.  So obese people should have to pay for the extra space they take",
   "created_utc": 1693002617,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr99d5",
   "message": "Yes if you’re taking up two seats. Because you’re taking up two seats. But the two seats should be automatically next to each other without having to pay extra to select seats. I’ve never seen this happen, but it seems like something they would do.",
   "created_utc": 1693002756,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqkfs6",
   "message": "every airline should require a \"width\" question before ticket is purchased.",
   "created_utc": 1692992993,
   "score": 4,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxql7m0",
   "message": "Yes, I do.",
   "created_utc": 1692993277,
   "score": 3,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqm81p",
   "message": "Of course. Are there people who don’t agree with this?\n\nIf I pay for a seat, I pay for a seat. I shouldn’t have somebody else taking up my seat.",
   "created_utc": 1692993657,
   "score": 3,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqufm3",
   "message": "Big guy here (6'2\" 320lbs).\n\nYes. Everyone needs to pay for the number of seats they occupy. I don't know why this is difficult for other large people to understand.",
   "created_utc": 1692996718,
   "score": 3,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqgjzz",
   "message": "Airplane seats shouldn’t prioritize squishing as many people on one plane as possible and only accounting for a small amount of body sizes. I know people who are just really tall and their leg size reflects that and they can still barely fit in one seat",
   "created_utc": 1692991523,
   "score": 7,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqgvzv",
   "message": "If we want to be fair, volume isn't as much of an issue as weight in terms of carrying something on an aircraft. Make everyone pay by the pound and assign them space proportional to that.",
   "created_utc": 1692991646,
   "score": 3,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqg90g",
   "message": "I think the airplane company has to bear some of the responsibility. They cram the jet with tiny seats so instead of fitting 80 people they fit 140 all to give the customer a cheap airfare. \n\nThe seats on the airlines are so small Victoria Beckham “posh” spice the skinniest woman alive couldn’t sit comfortably",
   "created_utc": 1692991408,
   "score": 5,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqoeoq",
   "message": "I think they should be forced to purchase two even if they never wanted to purchase one and have no intension of flying. It will be a fat tax, making them purchase airline tickets and will give them an incentive to lose weight.",
   "created_utc": 1692994469,
   "score": 2,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqeugw",
   "message": "Forced how?",
   "created_utc": 1692990881,
   "score": 3,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqotzh",
   "message": "Make bigger seats so that everyone has more room. Stop trying to optimize everything.",
   "created_utc": 1692994628,
   "score": 2,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqqgds",
   "message": "Yes, they should. \n\nWhy? Because they require two seats. \n\nI also would like to have 2 seats to myself. I can also purchase two seats for myself. \n\nBut i dont. Because I don't need two seats to fly and I can endure the flight duration with that level of comfort.\n\nI pay for the comfort I want.\n\n\nSame rules apply. A morbidly obese person has the right to that lifestyle. \n\nIf the plane oh so chooses. Then make morbidly obese seating.\n\nFly first class.\n\n\nOr go on a diet and listen to your doctor.",
   "created_utc": 1692995232,
   "score": 2,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqukc2",
   "message": "For everyone saying “make the seats bigger like they used to be”, are you also willing to pay the fares as they used to be? We send a confusing message as customers when people keep being willing to sacrifice comfort to save $20 but then want comfort.",
   "created_utc": 1692996766,
   "score": 2,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxquy33",
   "message": "Just give them a whole other airline, like a rollercoaster you must be this tall to ride the ride, except you must be this fat to get on the plane. Fat air, we will call it fat air.",
   "created_utc": 1692996912,
   "score": 2,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqn6gb",
   "message": "Yes and skinny people should be able to bring free luggage.",
   "created_utc": 1692994012,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqnkeb",
   "message": "LOL. Or, you could be obese - like me - pre-pay for 2 seats - like I did - have difficulty getting tickets issued for both seats (they did this by having one seat have my middle name first) - \u0026amp; then have both other passengers \u0026amp; the airline try to sit other people in the seat you bought \u0026amp; paid twice as much for, so you wouldn't be touching or inconveniencing anyone else. When it became clear to everyone around me that I'd bought the second seat I caught such attitude! Was a busy cross-country flight but not my fault, I planned ahead. Unreal. Damned if you do, damned if you don't.",
   "created_utc": 1692994156,
   "score": 2,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqn71d",
   "message": "Yes. Someone's choice to eat excessively shouldn't force someone else to be crowded in their seat.",
   "created_utc": 1692994018,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqtavi",
   "message": "Not sure about that but I do think when someone buys a ticket and clicks that they will have a dog on the plane with them, the other passengers should be informed and given options. I have horrible allergies and one flight cross country there were six (if not more) dogs on our flight. Apparently our timing wasnt great as orlando had some kind of major dog show that weekend and some were heading out when we were heading out. Six-hour flight with my eyes burning and itchy the entire time. I know this number is rare, but it does seem every time i fly the last handful of years there's at least one pet on the flight.",
   "created_utc": 1692996292,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr0yti",
   "message": "They should charge people by weight.",
   "created_utc": 1692999274,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr1kyq",
   "message": "There needs to be a massive revolution in air travel etiquette that goes beyond obese people. We need hard and fast rules pertaining to:\n- actually enforcing carry-on luggage sizes\n- the middle person gets 2 armrests\n- boarding needs to change to be more efficient (all windows, all middles, all aisles, and all of those back to front)\n- if we see your bare feet you get flogged\n- if you piss all over the lavatory we whip your nuts with a car antenna\n- the plane should be equipped with oversized seats for passengers of more ample carriage\n- fix the deplaning clusterfuck somehow (maybe the reverse of the above suggested boarding procedure)\n- if you cause an unnecessary disturbance everyone within reach of you gets 4 hits\n- if we can hear your music/movie at any time, all who were forced to hear it get 4 hits\n- if you’re a sleeper you must have a window seat; if you sleep in the aisle/middle seat you will be awakened in a way that’s guaranteed to give you pinkeye",
   "created_utc": 1692999528,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxql4ma",
   "message": " the decision involves balancing factors such as passenger safety, comfort, fairness, inclusivity, and respect for individual circumstances. Discussions surrounding this topic should focus on finding solutions that address the concerns of all parties involved while promoting understanding and respect.",
   "created_utc": 1692993245,
   "score": 0,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqsq5l",
   "message": "If they have proof from a medical professional that their weigh is not their fault.\n\nOtherwise, the cost of being unhealthy should motivate you to regulate your diet.",
   "created_utc": 1692996075,
   "score": 0,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqhakx",
   "message": "That would be illegal discrimination.",
   "created_utc": 1692991800,
   "score": 246,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqfzvr",
   "message": "No, because they're human like the rest of us. They should not have to pay more for their size, especially since you never know whether their size is due to a medical or a mental health condition. However, I'd argue that people who are morbidly obese typically aren't entirely at fault for the way they are, because to get to that weight in the first place you've got to have at least something that's causing it (like trauma, depression, etc.). Just because they're a different size, doesn't mean they need to be degraded in their humanity.",
   "created_utc": 1692991312,
   "score": 243,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqpt1i",
   "message": "How about the airlines just made bigger seats and wider aisles so everyone could be comfortable?  \n\nIt used to be so much better.  They keep making the seats smaller, whereas people (at least in the US) are getting bigger.  There has to be a better plan than this.\n\nDo the airlines not want big people to fly with them?",
   "created_utc": 1692994990,
   "score": 254,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqlpav",
   "message": "Would it be illegal in this scenario for an Airline to request a passengers weight? Like if you were over x weight you could only purchase two tickets? \n\nThen when you arrive at the airport you get weighed again to confirm you are who you say you are.",
   "created_utc": 1692993462,
   "score": 0,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqmnen",
   "message": "What's funny about this is the title -   \n\n\n'Do you agree that people who take up more than 1 seat should be required to purchase additional seats as necessary?'  \n\n\nBTW, I'm not the fat guy, I easily fit in 1 seat, but I don't understand the logic behind the redundancy behind 'morbidly obese' and 'take up more than 1 seat'",
   "created_utc": 1692993817,
   "score": 0,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqn782",
   "message": "Could we just have bigger seats? I’m not morbidly obese and I rarely feel as though I have a seat to myself. I have to compress my shoulders to avoid brushing my neighbors and I can’t remember the last time I got to use an armrest",
   "created_utc": 1692994020,
   "score": 0,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqoij8",
   "message": "Yes, at time of booking. However, if the plane - at time of takeoff - had a minimum of a certain number of empty seats, say 4 or 5 as an example, the passenger would be refunded the price of the extra seat.",
   "created_utc": 1692994508,
   "score": 0,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqw83r",
   "message": "I'm not here with answers and this is just a related issue but my brother isn't morbidly obese and he has to purchase, or rather chooses to purchase, 2 tickets because of his size. He could certainly lose 10 maybe even 20 pounds if he really wanted but it wouldn't change his seating requirements. He seems to think it's a fair arrangement. Our issue is always leg room.",
   "created_utc": 1692997395,
   "score": 0,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqztmt",
   "message": "No, I think airlines should be more accommodating.",
   "created_utc": 1692998809,
   "score": 0,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr0c44",
   "message": "Maybe just make the seats large enough for big people.",
   "created_utc": 1692999019,
   "score": 0,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr6wfn",
   "message": "No I don’t. The airline can afford to work this out and choose not to in order to squeeze every penny. Having said that if you’re really big be prepared the person sitting next to you may not be to happy with you.  Too bad it has to be like this but that’s capitalism for you.",
   "created_utc": 1693001741,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxr7m30",
   "message": "because \"morbidly obese\" is a weird and scale, some morbidly obese people do not take more than one seat confortably. so how do you make the difference? you measure people before entry and force people to buy another seat?",
   "created_utc": 1693002046,
   "score": 1,
   "submission_id": "1618b8p"
  },
  {
   "comment_id": "jxqf4sq",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1618b8p"
  }
 ]
}