{
 "submission_id": "161cwdg",
 "title": "What societal norm is completely bullshit in your own opinion?",
 "selftext": "",
 "created_utc": 1693001513,
 "permalink": "/r/AskReddit/comments/161cwdg/what_societal_norm_is_completely_bullshit_in_your/",
 "score": 51,
 "url": "https://www.reddit.com/r/AskReddit/comments/161cwdg/what_societal_norm_is_completely_bullshit_in_your/",
 "comments": [
  {
   "comment_id": "jxr7vr6",
   "message": "People acting like being wrong is some awful, embarrassing thing.\n\n(Edit: AND people who act like someone else being wrong is gleefully juicy gloating material.)\n\n1) Nobody gets it right all of the time.\n\n2) How is that *more* embarrassing than fucking up while everyone has to awkwardly pretend you're not? \n\n3) Do we *really* want to live in a world where people are encouraged to never admit they're wrong? Every problem takes 2x longer to fix. \n\nIt's egotistical and stupid.",
   "created_utc": 1693002160,
   "score": 140,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxr9pzp",
   "message": "The expectation to always be busy and productive, neglecting the importance of rest and self-care",
   "created_utc": 1693002953,
   "score": 73,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxr72ka",
   "message": "The 40 hour work week",
   "created_utc": 1693001813,
   "score": 81,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrbgb2",
   "message": "Lack of pockets in women's attires 😒",
   "created_utc": 1693003721,
   "score": 52,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrekd5",
   "message": "Tipping can fuck right off.",
   "created_utc": 1693005108,
   "score": 65,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrdmfe",
   "message": "Paying tax when you buy something with money you already paid tax on, then getting a tax bill every 6 months for a house you already paid for.",
   "created_utc": 1693004686,
   "score": 38,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrho92",
   "message": "Having kids. Totally fine if somebody wants to have them, but it shouldn't be expected. There's unfortunately a lot of people who are parents that didn't want to be.",
   "created_utc": 1693006485,
   "score": 24,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrb809",
   "message": "That couples who live together should always share a bedroom. \n\nSome people just don't have matching sleep styles, snore, work nights, or just like to have the opportunity to sleep alone without questions. It's not a sign of a bad relationship.",
   "created_utc": 1693003618,
   "score": 51,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrhwas",
   "message": "Tipping. Pay your GD workers you MFers",
   "created_utc": 1693006585,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxr76jj",
   "message": "Just touching small children without their consent - pinching their cheeks, patting their heads, grabbing them for a hug, kissing them, etc.   Absolutely wild.\n\nAlso, talking to small children about their 'boyfriend' or 'girlfriend', or calling them 'ladykillers', or 'future heartbreakers'.   Stop being gross about kids, people.",
   "created_utc": 1693001861,
   "score": 31,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxr6g7a",
   "message": "Respect to the riches",
   "created_utc": 1693001548,
   "score": 21,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxr7wu4",
   "message": "Well, it's really quite weird what body parts we choose to censor in the west. Like on Naked and Afraid they show bare asses, but no boobs or penis. On YouTube you can see everything as long as it's deemed educational, like \"Duh, here's how you shave your pussy, or put a condom on a real dick\" lol.\nThen whenever I watch a foreign film sometimes the lead actress will just take her love interest's dick out and start giving him oral for real, like it's just part of the scene.\nSo we censor nudity in the west, but then we change together fully naked in the locker rooms. I just don't know who comes up with all the inconsistent rules surrounding nudity and what's acceptable.",
   "created_utc": 1693002173,
   "score": 26,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxr8bl5",
   "message": "Not being able to swear in office jobs. Having to act professional.",
   "created_utc": 1693002350,
   "score": 26,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrbtn3",
   "message": "Dress code, it’s for the girls, cuz us showing shoulders or STOMACHS is distracting?",
   "created_utc": 1693003884,
   "score": 18,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrfsuf",
   "message": "That somewhere between the ages of 18 and 22 you should pick a career. And then you should work only in that career/industry until you're ready to retire. \n\nLife is way too long to not explore your options every 15-20 years.",
   "created_utc": 1693005660,
   "score": 11,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrejhc",
   "message": "College = successful",
   "created_utc": 1693005097,
   "score": 4,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrhhnn",
   "message": "Show graphic violence, no problem. Insinuate a woman's nipple, all hell breaks loose.",
   "created_utc": 1693006402,
   "score": 5,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrfou5",
   "message": "Anything lawn related. Fuck that. Grow food and trade with your neighbors",
   "created_utc": 1693005612,
   "score": 14,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrbdzu",
   "message": "Children being told not to swear by parents who do it all the time. It’s a way of self expression. I can understand the ones who are too young to understand the words but really are adults any better? “Losing my shit right now!” Shit, is shit, you know, poop?! Or being told it’s disrespectful to swear in front of adults, but they can do it in front of you? What?!",
   "created_utc": 1693003692,
   "score": 10,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrjjom",
   "message": "Stupidity, dumbfuckery, lying and dishonesty is not just a \"difference of opinion\".",
   "created_utc": 1693007329,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrkbej",
   "message": "Baby showers.     \n\n\nIf you can't afford all the crap your baby is gonna need, to the point that you have to depend on other people to buy it for you, don't have a baby.",
   "created_utc": 1693007673,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrkl65",
   "message": "* Leaving an abusive relationship? THATS GREAT!\n* Ending a friendship with a shitty friend? You're better off!\n* Going NC with your toxic parents? But they're your parents! Family is everything!",
   "created_utc": 1693007795,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrbdru",
   "message": "Could be more of a UK thing, but when going out with friends drinking alcohol. And you'll often get people trying to use peer pressure towards someone who may not want to consume it... Like if they don't want to, leave it be. They may have struggled with alcoholism or genuinely just don't want to consume Alcohol.",
   "created_utc": 1693003689,
   "score": 13,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrd8ce",
   "message": "Dating around hook up culture. This is stupid, why are we running around hurting each other",
   "created_utc": 1693004514,
   "score": 10,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxr798i",
   "message": "Men can be shirtless in public but women can't",
   "created_utc": 1693001894,
   "score": 14,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrcdvt",
   "message": "I truly am annoyed by people who insist on filming any concert, show, or sporting event. \n\nLike, what ever happened to \"enjoy the moment?\" Why would you subject yourself to filming an entire concert/show through a meh-quality camera on a smart phone for hours on end? I just don't get it. \n\nNote: I'm 26. Not a boomer. Got accused of that last time I responded to a similar question like this.",
   "created_utc": 1693004137,
   "score": 14,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrg446",
   "message": "Religion.",
   "created_utc": 1693005797,
   "score": 6,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrfwah",
   "message": "Accepting something as fact just because it is popular.",
   "created_utc": 1693005702,
   "score": 3,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxri900",
   "message": "Not accepting the fact that what you consider the societal norm  is in fact the societal norm. It may be the societal norm where you live and among the people you know, but it's not going to be the societal norm everywhere and if you move somewhere else to live, you will discover what you believe makes you the odd person out. You will discover that as you think, so goes the rest of the nation is totally untrue. You may say to-mah-to, but others will tell you \"Fuck you!\"",
   "created_utc": 1693006744,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrlemv",
   "message": "People who go all out on gender stuff\n\nMen who don't affectionately touch their friends or talk about emotions, and only talk about cars/sports/money. I hate the grindset chasing the bag thing with a burning passion.\n\nWomen who only talk about fucking emotions and other people, do the whole bestie thing, and get grossed out super easily.\n\nNeither of these are the natural state of things. General close-mindedness rubs me the wrong way.",
   "created_utc": 1693008165,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrmuem",
   "message": "The forty hour workweek. How someone decided after a commute, basic life activities (making and eating food, shower, grooming, errands, etc) that we’d somehow have time to focus on all the other health categories is beyond me. Oh, that’s right. That’s capitalism. Keep them distracted with an invisible carrot, maybe they won’t realize how much happier they’d be if we just shifted things ever so slightly so that people are still contributing but in a less prison feel way (ie perhaps a 30 hour work week, or asynchronous working, etc.). There’s got to be a better way. But we just simply exist in the system and often don’t consider these things until it feels too late (ie if only the education system taught us to invest properly at a young age that resonates instead of creating worker bees, for example).\n\nDon’t even get me started on hustle culture. *sigh*",
   "created_utc": 1693008811,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxratzu",
   "message": "Saying The Pledge of Allegiance.\n\nIt dates from another time. It's fine to love your country. But to have to take a public pledge about it is another thing altogether.",
   "created_utc": 1693003445,
   "score": 12,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxregpu",
   "message": "Smashing a kid's face into their birthday cake",
   "created_utc": 1693005063,
   "score": 7,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrf66n",
   "message": "40 hour work weeks",
   "created_utc": 1693005380,
   "score": 5,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrhr6h",
   "message": "Handshake as a greeting. I hate it so much.",
   "created_utc": 1693006522,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrjgik",
   "message": "Guys basically can't wear any accessories except for watches and crucifix chains. I grew up idolizing punk rockers who wore all kinds of different accessories and jewelry but society has gone decidedly norm-core. People think something's wrong with you as a guy if you even dare to go out with a bracelet or something.",
   "created_utc": 1693007288,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrkdgz",
   "message": "The fact that anything 2010 and before is completely erased from history. It's too political for me to talk about, but simply put, the modern era is the one and only era people embrace.\n\nWTF PEOPLE",
   "created_utc": 1693007699,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrln0q",
   "message": "Hair at workplace. Having blue hair doesn't suddenly make you forget how to do your job. Man not allowed to have long hair, but females get to have long hair? Hair lengths don't affect your work. Just let people get the hair they want to get and move on, is not that serious!",
   "created_utc": 1693008270,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrm5az",
   "message": "Slots you can see through in bathroom stalls",
   "created_utc": 1693008498,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxroccd",
   "message": "Men NOT cleaning up after themselves.",
   "created_utc": 1693009480,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrczrc",
   "message": "That we should expect a good result from repeatedly having our government spend more then is collected in taxes, funding the difference with debt, such that we are a net debtor going deeper and deeper into debt over any meaningful time period.\n\nTruly - we do that for decades, and people are in a total state of shock at what it does to our standard of living.",
   "created_utc": 1693004410,
   "score": 4,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrj81z",
   "message": "Banks, doctors, etc being closed on the weekend",
   "created_utc": 1693007181,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrcvr8",
   "message": "Conform to the mold,\nQuestion not what's deemed \"normal\",\nTruths often unsold.",
   "created_utc": 1693004360,
   "score": 2,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrdb0g",
   "message": "Dress codes for work.  We'd all be happier in shorts and t-shirts during the hot summer.",
   "created_utc": 1693004547,
   "score": 4,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrj6rm",
   "message": "A woman changing her surname to her husbands after marriage. And why is it frowned upon for him to change his to hers?",
   "created_utc": 1693007165,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxriada",
   "message": "Wearing a tie. Because, in a world where mens' mental health is shit, society thinks a man is professional by *wearing a noose.*\n\nSource: I tried to kill myself using my tie. Then I realized I should not be wearing ties.",
   "created_utc": 1693006760,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrivnf",
   "message": "I'm autistic so a lot of them are bullshit to me, but particularly the expectation to be just fine with people telling you to do something, \"because I said so\". I don't really like most authority figures because of this. also the expectation for me to constantly be smiling and happy, when I have a naturally deadpan expression and it's hard for me to change my expressions. I could be happy as Larry, literally ecstatic, and my face would only have a small smile. I can't smile on command either so most people think I'm faking it, I swear I'm not, I'm just not a naturally smiley person.\n\noh, and the idea that gender is some definite thing, until you do something seen as \"unmanly\" or \"unladylike\", then suddenly it's a status or rank that others can strip from you. it's insanely funny how transphobes will go \"if your boyfriend likes dancing, you have a girlfriend\" then turn around and yell about the genitals of children and deny human intersexuality.",
   "created_utc": 1693007027,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrflir",
   "message": "Monogamy. \nI don’t think it’s wrong as a choice, but the fact that ethical non-monogamous relationships are deified the way they are is wrong.",
   "created_utc": 1693005571,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrb4k1",
   "message": "Napkins in laps",
   "created_utc": 1693003575,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrdvfz",
   "message": "Wearing clothing",
   "created_utc": 1693004798,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxre4vt",
   "message": "People in cars smoking who discard their cigarette butt out the car window onto the road. There's cctv everywhere (well, here in the UK). Instant fine \u0026amp; driving ban for the registered keeper. (Unless proved beyond reasonable doubt their car was stolen, etc etc...). Pisses me right off it still happens.",
   "created_utc": 1693004916,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrikhq",
   "message": "The entitled kids who think that the bare minimum effort deserves recognition and praise.",
   "created_utc": 1693006887,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrko9z",
   "message": "Skinny jeans specially if you fat",
   "created_utc": 1693007835,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxr9a6w",
   "message": "The expectation to adhere to societal norms in the first place",
   "created_utc": 1693002766,
   "score": 255,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxr8ipf",
   "message": "Watching porn",
   "created_utc": 1693002437,
   "score": 255,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxr7qa8",
   "message": "Society itself. We live in a society that lives on these ideals such as...law, order, empathy...there's no chaos, there's no song of The Universe...no sheer willingness to accept what humanity is...animals, sheer egoistic animals. The biggest BS norm of society...is society.",
   "created_utc": 1693002095,
   "score": 252,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrgihx",
   "message": "Getting married",
   "created_utc": 1693005973,
   "score": 255,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrhar4",
   "message": "Porn. All of it",
   "created_utc": 1693006318,
   "score": 255,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrinbb",
   "message": "Probably an extremely unpopular take, but holidays where you lie to your kids about an imaginary man who brings presents or a bunny that hides things, or even the tooth fairy. Sure, celebrate the holiday, but don't lie to your kids. We play the Santa game or the Bunny game, but we don't let them think that shit is real. We also tell them not to spoil the games for other kids because other houses have different rules and some don't know how it works yet, and that that's half the fun. We aren't out to ruin other people's holidays. I just can't lie to them about that for some reason. I just can't do it. I feel like everyone does it because that's what you're supposed to do because everyone else does.",
   "created_utc": 1693006923,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrb7j9",
   "message": "Drinking alcohol",
   "created_utc": 1693003612,
   "score": 255,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrgdhh",
   "message": "Putting kids in daycare",
   "created_utc": 1693005911,
   "score": 255,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrcxf4",
   "message": "Age gaps in adult relationships and the notion that age means anything about your maturity etc.. Honestly, we live longer and longer, and are on the verge of longevity with AI... Is a 250 year old woman only supposed to date people 2 to 3 years above and below her? Love is love, and after gender, the next bigotry of society to fall is age and all its bullshit attached to what age means. I know 65 year olds who no more mature than a 10 year old, and I've met 18 years olds when I was in the military I'd trust with millions of lives. Age has nothing to do with it, and as we live longer and waaaayyyy longer, I think this is going to become painfully obvious. EDIT: This opinion of mine always gets downvoted as if that justifies the bigotry of age and you think I'm going to change my opinion... XD You watch, you are 100% guaranteed to be on the wrong side of history on this one.",
   "created_utc": 1693004380,
   "score": 253,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxri18g",
   "message": "Every single one of them, let us all go back to hunting and gathering",
   "created_utc": 1693006647,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrm0y4",
   "message": "Wearing Crocs in public.",
   "created_utc": 1693008444,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrdulh",
   "message": "Being overdressed/being extra",
   "created_utc": 1693004789,
   "score": 255,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxriowk",
   "message": "Pornography. Basically any kid can access visions of women doing any depraved thing they can imagine and more. Then they’re a consumer for life",
   "created_utc": 1693006942,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrkknw",
   "message": "Countries. Borders and hating those people born on the other side of them. Calling a human being \"an illegal\" for crossing that border in an effort to improve their lives... or save them.",
   "created_utc": 1693007789,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrci2p",
   "message": "Driving.",
   "created_utc": 1693004189,
   "score": 254,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrd1fe",
   "message": "Being skinny or healthy weight",
   "created_utc": 1693004431,
   "score": 251,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrbla7",
   "message": "Pants.",
   "created_utc": 1693003783,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrhqk0",
   "message": "Women’s clothes. No pockets. Sizes wildly different from brand to brand. Jeans are made of crappy thin material. Shirts are see-through, too short, flimsy. Bigger sizes cost exponentially more. Bigger sizes can’t be bought in the same patterns as smaller sizes. \n\nAnd don’t even get me started on the stupidity of heels, which exist to make your leg look nice and just damage your feet, which you will need for your whole life to be able to carry you around.",
   "created_utc": 1693006514,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrif1b",
   "message": "Having to wear clothes.",
   "created_utc": 1693006818,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrj63k",
   "message": "Men can go topless but women can’t.",
   "created_utc": 1693007157,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrl2dv",
   "message": "Shaking hands should have been abolished as soon as we understood the germ theory of disease.",
   "created_utc": 1693008014,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrl7t3",
   "message": "Drinking alcohol without getting drunk. I don't understand why people want to drink alcohol so much even though they know it's poisonous for the body. It's a norm in society and it's associated with having fun.\n\nSoda is not better for health though, but tea or water should be more encouraged by the movie industry.",
   "created_utc": 1693008081,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrlzh3",
   "message": "Eating with Spoons and forks. Somehow eating with your hands is uncivilized or for lower classes.",
   "created_utc": 1693008427,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrm4yi",
   "message": "Most of them to be honest.",
   "created_utc": 1693008494,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrmave",
   "message": "It may be (hopefully) not a societal norm anymore, but it seems to be taking too long to move in the right direction: \n\nThe idea that men can’t be fathers or caregivers of children. Or it’s like “weird” or “creepy” for them to be with or around children, even if they’re their own kids. The idea that women are the only ones who should get full custody in courts or are the “main” parent. I mean it’s great women are getting access to all the things they didn’t have 50 years ago (or less), but we’ve moved so far in the other direction, that men are now not even able to exist around children. \n\nAnd I’m saying this as a cis woman.",
   "created_utc": 1693008568,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrmlbp",
   "message": "Having children. It should be a well thought and heartfelt decision not a norm.",
   "created_utc": 1693008699,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrmsq2",
   "message": "Men paying for everything on a date, even a first date. It’s basically prostitution without the guarantee of sex.",
   "created_utc": 1693008790,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrmuzh",
   "message": "Bras. Full stop.",
   "created_utc": 1693008818,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrmvq9",
   "message": "The fact that today’s society is completely entitled, is bull shit.",
   "created_utc": 1693008827,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrn2ao",
   "message": "Paying Bills \nMy check does not say pay to the order of other motherfuckers. \n\nWhy the fuck are they charging for natural resources!!!! \n\nThe fuck is a water and gas bill???\n\nHow the fuck and when the fuck did it become normal???",
   "created_utc": 1693008909,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrnfhu",
   "message": "Wiping boogers on the bottom of the table instead of just flinging them at people. I mean, come on.",
   "created_utc": 1693009075,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrnie4",
   "message": "Private Property. Somewhere along the way, every inch of land was taken by force or con going all the way back to that very first caveman or tribe that started claiming area with a club or spear and saying who could stay or was evicted",
   "created_utc": 1693009111,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrnlpy",
   "message": "Men always having to make the first move",
   "created_utc": 1693009152,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrnp76",
   "message": "Influencers",
   "created_utc": 1693009195,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrnqz5",
   "message": "mowing lawns",
   "created_utc": 1693009216,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrnupj",
   "message": "Pants. Thanks to some God damn horses 1,000 god damn years ago, I have to wear pants even in the Summer because shorts aren’t professional or fashionable and dudes can’t wear skirts. Even in the Winter it’s ridiculous because I spend 99% of my day indoors, but people give you weird looks because I guess they don’t understand that indoor heating exists",
   "created_utc": 1693009261,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxroxme",
   "message": "Undressing in front of people in locker rooms.",
   "created_utc": 1693009748,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrp6ek",
   "message": "All of them",
   "created_utc": 1693009857,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrp7qh",
   "message": "Walking around, and especially driving, with your face all but glued to your phone. Put the damn thing down and watch where you're going, Kevin!",
   "created_utc": 1693009875,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrpfqd",
   "message": "Being nice. Let me be a snide asshole to people who deserve it.",
   "created_utc": 1693009975,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrpi2u",
   "message": "Health insurance tied to employment. Such bullshit.",
   "created_utc": 1693010005,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrpjz1",
   "message": "I don’t know if this counts because it’s more of an internet thing I feel like but Karen’s.  I know several ladies names Karen who are honestly great people and don’t deserve to have their name be trashed because some people thought it was funny to call all the bitchy women in the world Karen’s.",
   "created_utc": 1693010029,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrpkhq",
   "message": "Meat for every meal.",
   "created_utc": 1693010035,
   "score": 1,
   "submission_id": "161cwdg"
  },
  {
   "comment_id": "jxrpmid",
   "message": "Giving religious beliefs a free pass from ridicule.",
   "created_utc": 1693010060,
   "score": 1,
   "submission_id": "161cwdg"
  }
 ]
}