{
 "submission_id": "161l686",
 "title": "What's a small, seemingly insignificant decision you made that ended up having a surprisingly major impact on your life?",
 "selftext": "",
 "created_utc": 1693024350,
 "permalink": "/r/AskReddit/comments/161l686/whats_a_small_seemingly_insignificant_decision/",
 "score": 43,
 "url": "https://www.reddit.com/r/AskReddit/comments/161l686/whats_a_small_seemingly_insignificant_decision/",
 "comments": [
  {
   "comment_id": "jxshsvk",
   "message": "Accidentally took the train a few stops too far. Got off and went to a store before getting back on the opposite direction just because..  why not?!\n\nI met my partner in the checkout line. We just celebrated 5 years! 🤘🏼✨",
   "created_utc": 1693024573,
   "score": 102,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsi90s",
   "message": "Talked to a janitor about how i wish i was in med school instead of cleaning floors. He said apply n i did. Now a specialist with a full blown private practice",
   "created_utc": 1693024853,
   "score": 70,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxshvs6",
   "message": "Hit up a buddy from college on Facebook to look at my MRI, I’d be dead if I didn’t.",
   "created_utc": 1693024622,
   "score": 36,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxshn4y",
   "message": "Where to sit in my first university classes, hugely impacted my friend groups",
   "created_utc": 1693024474,
   "score": 28,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxshntb",
   "message": "I drove a different way to work randomly. Got in a car wreck. Totaled me car.",
   "created_utc": 1693024486,
   "score": 22,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsoffc",
   "message": "Worked delivering pizza the summer after college a long time ago. An order comes up the same time a cook throws a half-burnt pizza on top of the oven (where they become fair game to employees for free, and if you get to them first you get an unburnt piece) I decided to stay for a slice and let my coworker take the delivery, I'll just take the next one I thought.  \n\n\nNext delivery comes up and I head out 3 XL pizzas and a full belly.  3 minutes later a 81 year old lady blew a red on the highway and changed my life forever.  Couldn't walk for a year, my diploma that I had just received a month prior was useless as it demanded some physical work. Sports, gone. Life trajectory and overall attitude completely altered. All because I wanted a free slice of pizza.   \n\n\n6 years later I received my settlement and was able to buy a house though.",
   "created_utc": 1693029042,
   "score": 24,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsibbe",
   "message": "2007, sent a MySpace friend request \u0026amp; message to a (now former) coworker's former coworker...we got married in 2010. I lost her to cancer 1/28/2023.",
   "created_utc": 1693024893,
   "score": 41,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxslw5x",
   "message": "All these stories about how you met your partners. I'm inspired to get out there",
   "created_utc": 1693027258,
   "score": 15,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsm1wt",
   "message": "When I started college, I decided to do something I never do and approached a random stranger dining alone in the cafeteria and asked if I could join him. Over the next 4 years, he and I became close friends. He introduced me to who would become the best man at my wedding, and was instrumental in meeting my wife. We even roomed together for a year. I can only imagine how vastly different my life would be if I had decided not to say hello.",
   "created_utc": 1693027367,
   "score": 15,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsiziw",
   "message": "I didn't call my dad on his birthday - I figured I'd see him a couple of days later on the weekend, so i sent a generic bullshit text. But then I got the call that he died. I should have called him to wish him a happy birthday.",
   "created_utc": 1693025322,
   "score": 14,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsjvw8",
   "message": "When I was a kid, I had awful eczema - as do 90% of children. As long as it isn't unbearable, it can largely go untreated. My mom wasn't even pushing too hard for me to get treatment because everyone in our family had it - you just lather yourself in lotion and creams and move on with your day. \n\nBut my mom decided to take me to a dermatologist just in case. They generally take your vitals when you first walk in. When they took my pulse, it was at 180 bpm. This was highly unusual since i had been sitting in the waiting room for half an hour, and the resting heartbeat of a child is usually between 60-80 bpm. They thought the 180 reading was an accident, but the results freaked me out and my bpm shot up to 200. I immediately got sent to the ER and was ultimately diagnosed with an arrhythmia. \n\nWhat's funny in retrospect is that I had those heart problems throughout my childhood, but no doctor could ever catch it when it was actually taking place, so I went ~10 years of my life without any sort of diagnosis. It's because of that random dermatologist appointment that I was diagnosed properly - and i had a corrective heart procedure last summer! So I'm all fixed now!",
   "created_utc": 1693025906,
   "score": 33,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsqsh3",
   "message": "Decided to go in when called in to work in my day off, 30 minutes after I get there I get a call... My house burned down and I lost everything, my belongings, my family heirlooms, my dog and all of her eight puppies...\n\nFound out later a neighbor had saw the smoke start coming out of a faulty window unit AC that I'd turned on as a last minute decision heading out the door to keep the dogs cool in that shitty rented trailer well before the fire even started and had been banging on the doors thinking I was home.\n\nIf I had been home, the AC unit would not have been on, but even if it had been, I had several fire extinguishers in the house and if nothing else, the only thing between me and the front door was my dog and the puppies.\n\nI spent two years homeless, living in a tent or vehicle and showering at the gym and just trying to survive while remaining employed and trying to get back on my feet. It's been a long road and I'm still not there yet but at least now I'm in much better paying field and have really nice rental house. But it's not the same.",
   "created_utc": 1693030788,
   "score": 29,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsku50",
   "message": "Downloading a dating app at one night because i was bored and my friend was like let’s scroll through the app and make jokes about people and judge them.. lol..\nI met the love of my life",
   "created_utc": 1693026531,
   "score": 13,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsmt5m",
   "message": "I live in a country with conscription and you usually get sent to some border camp in the middle of bumfuck nowhere, after some basic training. During that basic training, everyone is asked to express if they have any preferences for specific places (still in the middle of bumfuck nowhere), so I picked a place at random.\n\nI ended up meeting my two best friends there. One of them got me  a job immediately after we were done with our conscription, and he practically kickstarted my career, lol.",
   "created_utc": 1693027895,
   "score": 11,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsmt9b",
   "message": "I applied for, and got a job...... On the other side of the world.  Never looked back.",
   "created_utc": 1693027897,
   "score": 12,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxspny4",
   "message": "Decided to take a graphic design class as my art elective my junior year of high school. At the end of the semester, my teacher pulls me aside and asks what I plan to do in college. I said “Business, maybe?” And he was adamant that I pursue a career in design. He guided me through the process of prepping my portfolio, applying to schools, etc.\n\nOver 20 years later, I’m leading a team of young graphic designers and helping them shape their careers. I’ve tried to find him so I can thank him for basically setting me on my career path, but I hope he knows how much of an impact he made on me.\n\nTeachers matter!",
   "created_utc": 1693029943,
   "score": 11,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxspv6d",
   "message": "Went to a Mardi Gras party, then an after party at a friend's house instead of moping about my dad dying (it had been a week or two).  Some girl there was cute and fun.  I made sure she got home, and it turned out, she lived a block away from where I grew up.  We dated 8 years, and just had our 15th anniversary.",
   "created_utc": 1693030090,
   "score": 9,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsip0o",
   "message": "I went with some friends to another friends house and met a girl who now is my wife. We met in 2007 and were best friends. We have now been together for 14 years 😊",
   "created_utc": 1693025135,
   "score": 16,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxt7e8p",
   "message": "My twin asked me one day if i could move back in with her because she was struggling with life a little, I said i couldn't because i'm trying to fix my marriage and said sorry to her. 4 weeks later I had to watch my twin die in hospital because of sepsis and it took a week for her die. A decision that haunts me to this day. 4 months later my wife left and not only didn't i save my marriage i also lost the my soulmate (twin) a decision that haunts me to this day. I'll never get over it!",
   "created_utc": 1693044271,
   "score": 8,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxshweb",
   "message": "Not pursuing college has left me in the same field to similarly related fields since I was 18 years old. Idiot 18 year old me was all “hey, I need a summer job!” And it turned out to stick *sorta kinda* ( and before you ask , yes I hate it lol )",
   "created_utc": 1693024633,
   "score": 6,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsmrwy",
   "message": "Went to visit my grandma on my lunch break. Pulled up same time as my mom and we found her dead in her home together. Worst experience of my life but thankful I was there so she didn't experience it alone.",
   "created_utc": 1693027869,
   "score": 7,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxso05k",
   "message": "Wasn’t really insignificant but picking what school I went to, it was either a school I‘ve never gone to with no one going I knew, or a school with all my friends, I choose the first one, and I met the most amazing person who inspired me to do so much, we are now together and happily dating, I’ve never been so happy with someone, it’s improved my mental wellbeing so much",
   "created_utc": 1693028738,
   "score": 7,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxt88qq",
   "message": "Was in a second hand book store and saw a copy of \"Allen Carrs Easyway to stop Smoking\" for £1.\n\nBought it on a whim, thinking it would be total shit. Read it and instantly dropped a 20 a day habit and was actually *excited* about doing so.\n\nThe improvements to my health and confidence led me to start going to the gym and eating better. I lost a lot of excess fat and got in decent shape, which was the initial factor in what attracted my now-wife to speak to me at a party. (turns out one of her instant deal breakers was smoking too).\n\nNow I have a job and a life I love and I think the turning point was reading that book. Before that I was an overweight, sedentary smoker who drank too much and had absolutely no belief in my ability to improve my life. I don't think I'd have ever been able to quit smoking so successfully without the methods in that book.",
   "created_utc": 1693044957,
   "score": 8,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxtbjex",
   "message": "Myself and my dog went left on our daily canal path walk ( we always turn right) and we found an abandoned box of kittens. I carried them home and took them to the vets and that's how I ended up having 5 cats. \nThey are all beautiful, healthy and an absolute joy.",
   "created_utc": 1693047528,
   "score": 7,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsmawv",
   "message": "Tried a random chat feature on the chat app I used back in 2007 out of boredom. Ended up marring the random woman I connected to.",
   "created_utc": 1693027538,
   "score": 4,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxspp3g",
   "message": "I wandered through an education job fair in the student union on my way to class. I was in no way interested, I just like looking at school logos because I think graphic design is fun. The fair was specific to a very niche subfield of education I didn't know existed\n\nAfter grad school I realized I wanted to be a teacher and remembered that job fair. I figured if the college had a job fair for that subfield, it must be a big player in it. So having that college on my resume would probably open doors. Turns out I was very right\n\nTen years later I still get opportunities I would never have if I didn't attend that college. If I hadn't taken the long way to class I might have missed out on an incredibly fulfilling career",
   "created_utc": 1693029967,
   "score": 5,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsjotg",
   "message": "Trusting bad friends",
   "created_utc": 1693025777,
   "score": 3,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsp8js",
   "message": "Forgiving people. I would have very few relationships to explore if I clung to my ego when my feelings were hurt.",
   "created_utc": 1693029628,
   "score": 3,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsrg7a",
   "message": "Choosing random classes that sounded easy in 8th grade before I started high school. Because of that I ended up being dropped by my entire friend group from that time before my freshman year had even reached the halfway point and my life took a completely different path.",
   "created_utc": 1693031289,
   "score": 3,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxt0jo4",
   "message": "My wife and I were very avid hookah smokers, we would smoke around 2.5 to 3 kilos of shisha a month. A couple years ago, we switched over to vaping for health reasons and admittedly mostly for financial reasons. After a few months, I noticed I was losing a lot of weight without exercising more  or anything and that's when I realized I was losing weight because I wasn't snacking. I noticed that whenever I was in our kitchen lighting coals for our next bowl, I would just end up snacking on whatever I saw. This led to me being much more aware of exactly how much I was snacking and how little self control I have. I still struggle with the self control part so I don't really buy anything I am able to snack on anymore, I buy frozen food for the most part, and I have my wife hide her snacks so I'm not tempted. So far in the last 2 years, I have lost 76 pounds (34kgs). It has been life changing for me, my knees and back hurt less, I'm more comfortable, and I sleep better. The downside is that I had a really hard time keeping my pants pulled up since I was already built like Hank Hill with no ass and there's nothing for my belt to grab onto, no matter how much I tighten my belt. I feel like a new person and am excited to continue losing weight, especially because last year, I decided to start cutting my own wood for our wood stove instead of buying firewood. Cutting and splitting 4 cords of firewood throughout the year can be a pretty good workout.",
   "created_utc": 1693038577,
   "score": 5,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxslcwv",
   "message": "I joined a d\u0026amp;d game. It's where I met my current boyfriend.  We've been together 30 years.",
   "created_utc": 1693026887,
   "score": 8,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxt5866",
   "message": "Stopped giving a shit about trivial matters. A health scare changed my perspective on everything!",
   "created_utc": 1693042491,
   "score": 3,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxt7mw9",
   "message": "Was hanging out with a friend for the first time in a while, we were both newly single and were playing a drinking game at my house. At one point she asks \"are we flirting? Because I've been flirting with you and I'd rather know for certain in case I'm making an ass of myself\"\n\nNormally when I'm on the spot like that I'd freeze up and say no because I wouldn't know where to take things from that point, but since I'd a few drinks in me I said I had been flirting too. Now we've been together three and a half years.\n\nWhat makes it better was having a crush on her for many years before that moment.",
   "created_utc": 1693044466,
   "score": 3,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsig3p",
   "message": "Not pulling out",
   "created_utc": 1693024977,
   "score": 6,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxspls7",
   "message": "Deciding to give up and leave my spot after waiting a good 4 hours to see Max Verstappen arrive at the 2018 Australian Grand Prix. My husband and I made our own MV flag and tshirts and spent around $300 importing two of his hats from the Netherlands because at the time there was no real official MV merchandise available. Not 5 seconds after we walked away we heard “Max Verstappen” announced loudly over the speakers. He must have been the last to arrive. It annoys me so much because I don’t know that we’ll ever get that same chance again.",
   "created_utc": 1693029900,
   "score": 2,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxt9oil",
   "message": "Decided to try out a muay thai class on a friday evening after work because \"I had nothing to do that night so why not?\". That was 12 years ago and that day was what ultimately got me into sports.",
   "created_utc": 1693046101,
   "score": 2,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsrp62",
   "message": "**I didn't fix my phone screen.**\n\nMy phone got dropped on concrete and a heavy crack formed in the front glass. still usable but very ugly. After about a week I just started deleting apps that I'd have opened before because it was a pain to look at it (physically hard to read)I'd pick up my phone, turn it on then just.. turn it off.\n\nA week turned to a month, a month to half a year.. I just never fixed it.Eventually I went in settings and turned off any notifications that were not calls or texts.\n\nIt just became less of a priority over time. The device is still usable it's just ugly\n\nThen one day it just died. I'm not sure why. Refused to power on. I called my cell phone company and they wanted a deductible.\n\n\"I can get a phone cheaper than that!\"so I did. Some no name piece of junk that flips open and closed. It took a little while to find a dumb-phone that wasn't locked on 1 or 2G but once I got it I back in business.\n\nThe tack manager app I was using got replaced with a $1 notepad, and that notepad landed the biggest client of my carrier,because I was there, listening watching and able to jump in when at a coffee shop I overheard someone complaining about the exact services I offered.A few months ago I'd have missed that chance, some inconsequential virtual achievement stealing away my focus.\n\n**A month**. I charge my phone once a month. it does everything I need except there are no maps. Now I've got to read road signs or I get lost.\n\nGetting lost isn't so bad. I found myself in a little shop I never knew existed.The server is super cute, and we make shop talk as I'm deciding what to get when the phone rings.\n\nA year ago I never would have answered. Now I hold one finger up and press the button to start the call, hanging up as I realize it's a scammer. Oh well.\n\nHer bright green eyes sparkle as she exclaims \"What is THAT!!\"\n\nI would have walked out purchase in tow, never said anything. This cheap phone paid for itself in full, opening the gates to real conversation that has both of us laughing as we figure out how you actually add phone numbers to the thing.  \nit didn't last as she moved to law school- but that experience made me a better man.   \n\n\nMy phone doesn't do much, but I wouldn't trade it for a flagship given for free.",
   "created_utc": 1693031482,
   "score": 2,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsv9vl",
   "message": "Dad was acting weird, I thought I should check on him but I didnt. Shot himself 30 seconds after.",
   "created_utc": 1693034258,
   "score": 2,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsrxqg",
   "message": "Out swimming millions of my brethren. Plot twist..its one race you don't want to win.",
   "created_utc": 1693031664,
   "score": 255,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxt3e6m",
   "message": "Not taking one more pill",
   "created_utc": 1693040980,
   "score": 0,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsn2gj",
   "message": "When I banged your mom she went full stalker on me, had to move and change my number. Next time you talk to her can you ask her to top up my pre paid Visa I want some KFC",
   "created_utc": 1693028074,
   "score": 241,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxspflx",
   "message": "Made a comment on tiktok. The love of my life responded to it, just so happened to be in the same state just a few miles away going on one year now",
   "created_utc": 1693029772,
   "score": 1,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxsuppa",
   "message": "Met up with an old high school friend I had not spoken to in ten years who randomly decided to take a trip to his home state. I moved across the country two years later and we have been married for over a decade.",
   "created_utc": 1693033817,
   "score": 1,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxtb0uc",
   "message": "Clicking 'accept'...",
   "created_utc": 1693047137,
   "score": 1,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxtb3sq",
   "message": "Signed a piece of paper a family member advised to sign, claiming it was a great opportunity for the future.\n\nInstantly was put into over $400k in debt and 10 years of court battles. Family member denied wrongdoing until their death.",
   "created_utc": 1693047199,
   "score": 1,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxtcyuy",
   "message": "Went to a job fair that I didn't expect much from. Ended up with a state job I've had for over ten years and met my now wife of seven years there.",
   "created_utc": 1693048552,
   "score": 1,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxte7u7",
   "message": "Senior year of high-school 1995. Right before the deadline for dropping/switching classes I dropped typing and switched to a consumers math class. There were two seats available, one next to my best friend and one right behind a beautiful blonde. I handed the paperwork to the teacher, turned around and she said \"this seat's open\". I looked at my friend and he just shook his head, cause what do you think I was going to do? We've been inseparable ever since. Just about 28 years ago probably end of September. Two grown daughters and we still like each other quite a bit.",
   "created_utc": 1693049392,
   "score": 1,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxtf64e",
   "message": "Fucking my wife one evening.",
   "created_utc": 1693050005,
   "score": 1,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxthnx3",
   "message": "Gave up alcohol. Was drinking 100+ standard drinks a week and sick and tired of feeling so crap all the time. Had no intention of giving up permanently, but it'll be 9 years next month and everything good I have in my life - my job, my marriage, my friendships, my relationship with my parents, my emotional and spiritual stability - is because I'm sober.",
   "created_utc": 1693051518,
   "score": 1,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxthwsh",
   "message": "Throwing a dart for honeymoon destination. Ended up moving here ten years later.",
   "created_utc": 1693051663,
   "score": 1,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxti378",
   "message": "I was feeling tired and called in sick to work. \n\nDon't like using sick time but felt the hell with it. \n\nAbout 8:15 am , a pipe burst in the attic. \n\nHeard the commotion and checked it out. \n\nI was able to turn the water off and clean up the mess. \n\nWas scheduled to work to 7 PM and the house would have been destroyed. \n\nFamily heirlooms would have been lost. \n\nGlad I made that decision.",
   "created_utc": 1693051765,
   "score": 1,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxtjco9",
   "message": "Decided to take a logistics class in college, and liked it and pursued the logistics certificate offered. This was basically run by one professor, who was a retired Army Lieutenant Colonel.\n\nHe gave me a flyer for a federal job brief for the federal government. I gave them a copy of my resume. Somehow, a Navy recruiter got it from that person and recruited me to be a Naval Officer. I applied, and it was a 4% selection rate that year (2010, horrendous hiring conditions for new graduates). I had a letter of rec from my retired LTCL which helped me get selected from the pool of 450 applicants that quarter.\n\nDid 9 years Active Duty, still in the reserves today and I work for the Navy as a civilian now.\n\nThanks Dr. Haas!",
   "created_utc": 1693052495,
   "score": 1,
   "submission_id": "161l686"
  },
  {
   "comment_id": "jxtjl1u",
   "message": "I was beginning to come to terms with the fact I'm transgender again, I'd done it before but always denied and repressed myself back into the closet. So I made a reddit account with a new name I liked (this one) and started exploring transgender subs to see if I could relate to the posts. Someone had posted a question asking if anyone wanted to chat. I normally don't answer those kinds of things but was bored and confused in my identity so decided \"why not?\" and messaged her. Over the next almost 2 years she's been my friend, she's helped me to realise who I truly was, she was there for me when nobody else could be, she's been my girlfriend, the woman I love, and hopefully one day something more. An innocuous conversation led me down a path of self discovery and true love and I couldn't be happier at the way things have worked out 🥰",
   "created_utc": 1693052626,
   "score": 1,
   "submission_id": "161l686"
  }
 ]
}