{
 "submission_id": "161wgjn",
 "title": "Albert Einstein once said \"The difference between genius and stupidity is that genius has its limits.\" What are some examples of this that you have experienced?",
 "selftext": "",
 "created_utc": 1693059528,
 "permalink": "/r/AskReddit/comments/161wgjn/albert_einstein_once_said_the_difference_between/",
 "score": 164,
 "url": "https://www.reddit.com/r/AskReddit/comments/161wgjn/albert_einstein_once_said_the_difference_between/",
 "comments": [
  {
   "comment_id": "jxu33ms",
   "message": "You shouldn’t believe every quote you read on the internet. — Abraham Lincoln",
   "created_utc": 1693061681,
   "score": 253,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxtzas3",
   "message": "I think the more educated we become, the more we know how little we actually know, and it’s humbling, but ignorant people really have no idea what they don’t know, leading them to be confident about their ignorant stances.",
   "created_utc": 1693060140,
   "score": 255,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxu6sd4",
   "message": "What's going right now with the head of the Spanish football federation, Rubiales.\n\n(When he congratulated player Jenni Hermoso on winning the World Cup, he laid one on her, kissing her right on the mouth, which she did not like.)\n\nHe acted badly, but I think if he had just come out and made a public apology, everything would have been fine. Maybe it still should not have been, but I bet it would have taken care of everything.\n\nBut he doubled down, saying everything was fine and consensual, and then tripled down saying he was going bring Hermoso up on charges of lying when she said it wasn't?!?\n\nMeanwhile, every club in La Liga is condemning him, the Spanish national team has essentially resigned, and they are likely going to have to arrest this guy to bring some closure to this.\n\nAnd this poor woman, she is a legend of the game. She was a part of the Barcelona team that destroyed the league regularly, won the Champions League, and numerous other trophies. Now she won the WC, but this is the conversation about her?\n\nAnd these fuckers send an army of people to intimidate her and her family into getting her to sign some statement that she was totally fine with everything.\n\nThis guy is just out of control stupid.",
   "created_utc": 1693063176,
   "score": 117,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxud6zi",
   "message": "Oh boy. I once met a guy who was so stupid that he thought the ocean was alive and waves was it breathing. I remember one time in school he was doing homework for another class and asked the teacher “Where were the Canaanites from?” She jokingly said Nova Scotia. He asked how to spell it. This guy thought Beauty and the Beast was based on a true story about a girl and a bear. He would constantly make bets that he lost and never learned his lesson. He didn’t know that chicken the food came from chicken the animal. I have met a lot of stupid people in my life but I have never met anyone quite so bafflingly stupid that I had to wonder if they, in high school, could even read.\n\nEdit: spelling",
   "created_utc": 1693065678,
   "score": 124,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuemmu",
   "message": "our school principal - he regularly targets staff that are not \"all in\" on his ideas and plans for our school.  Those of us who are very vocal find that we receive extra duties, enjoy excessive classroom observations (w/o any feedback), and phantom parent complaints that somehow never make it directly to us.  \n\nEvery time, his arrogance is thwarted by our very impressive contract, and our site union rep's.  Every time he's shown exactly why he's breaking our contract, and that his actions are detrimental to our staff AND to his ability to lead. He hasn't won a case in over two years...and yet he persists. \n\nHis favorite tactic is to take minor student complaints and escalate them to HR in order to force staff onto paid administrative leave.  He did that to four different teachers in his first year on campus, and three during his second.  In all 7 cases, the district investigations proved in favor of the teachers.  \n\nHe is just about out of staff who will support his every word.",
   "created_utc": 1693066237,
   "score": 253,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxubilh",
   "message": "As a high school math teacher, I cringe when students hand in a test and say “I think I aced it.” It’s almost always an F.",
   "created_utc": 1693065021,
   "score": 130,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxugs0x",
   "message": "Once upon a time, I was having a conversation about DEF systems in heavy trucks. The trucker I was talking to conceded that something did need to be done about air pollution, but thought mandating expensive and finicky exhaust cleaners for commercial diesels was unfair and pointless. His solution (which he furiously and resentfully insisted upon) was that The Government should construct one of those ionizing filter things the height of *the* *atmosphere* the full length of the arid southwest east of the Rockies. You see it is always windy there which means *all* the air passes through that region, making it the ideal location for earth's household air purifier. I thought he was fucking with me, but was disabused of that illusion when the conversation turned into a bizarre and abrupt enraged argument. I tried to explain that doing so would be physically impossible, even if there were somehow economic and political support for such a project. I pulled up the staggering height of the whole-ass atmosphere, the insane engineering required to poke a slender needle of steel and concrete even a fraction of the way into it, the weight and force of just the teeny bit of atmosphere that crowds behind a sail, the incredible scaling of that force for a sail approximately the size of California. His response was to, in my presence and in real-time, begin to find flat earth compelling. He needed to have been intuitively on the money so badly that he'd discard all of reality to reassure himself of infallibility. \n\nI've seen a lot of dumb in my life, but that's the weirdest and most wild so far.",
   "created_utc": 1693067101,
   "score": 176,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxtzu6n",
   "message": "This post, because it's not attributable to him.",
   "created_utc": 1693060362,
   "score": 236,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxu5npf",
   "message": "I worked at an embassy. One day a guy came to me, completelu explained a scam he did. It had failed and he wanted to know how I could help him \"as we are countrymen\".\n\nCalled my colleagues at home and set them on his ass too",
   "created_utc": 1693062725,
   "score": 162,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxue3ye",
   "message": "My wife’s cousin once asked me what my wife’s mom’s maiden name was…. It’s his last name",
   "created_utc": 1693066032,
   "score": 68,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxu34k2",
   "message": "Anyone who buys one of the world's most recognizable brands, fires most of the people who make it work, becomes very hands on in an area he has neither experience nor expertise, stops paying the bills, and then rebrands it.\n\nBonus points if that person has already unsuccessfully tried to rebrand several other products under that name.",
   "created_utc": 1693061691,
   "score": 13,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuwovf",
   "message": "I think a lot of you are missing the greater point. Sure, stupidity is boundless, but this isn't about the nature of stupidity. I believe the quotation is illuminating the idea that a genius is only a genius when people agree. Beyond this, at some point, you sound crazy.\n\nA good example would be like Alfred Wegener, the man who came up with the idea of continental drift. In 1912, Alfred Wegener proposed that the continents got to where they are now because they drifted there. For years during his life he was mocked for the idea. The one piece of evidence that he didn't have to confirm his theory was the mechanism in which the continents drifted. He proposed that it was the spin of the Earth. This idea, and ultimately his whole theory of continental drift, was universally rejected by scientists. He died without ever proving this theory. It wasn't until the 1960s that geologists finally figured out the continents were on tectonic plates. Dude was absolutely ahead of his time. Despite actually being a genius, he was ultimately panned as being dumb for believing in what other \"geniuses\" thought was incorrect.\n\nI'm sure there are plenty of other examples, none of which I can think of off the top of my head that I have experienced in my lifetime, but that's how I interpreted the quotation.",
   "created_utc": 1693073466,
   "score": 100,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxufc41",
   "message": "The Demon core incidents, 2nd one specifically.\n\n[https://en.wikipedia.org/wiki/Demon\\_core](https://en.wikipedia.org/wiki/Demon_core)",
   "created_utc": 1693066519,
   "score": 41,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxtxzuq",
   "message": "Kayne West",
   "created_utc": 1693059602,
   "score": 52,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxud4i3",
   "message": "Next time, google the quote first. \n\nhttps://quoteinvestigator.com/2014/07/28/genius/?amp=1",
   "created_utc": 1693065652,
   "score": 25,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxu02vn",
   "message": "Are you familiar with people who think Donald Trump is some kind of positive figure?\n\nYeah. Them.",
   "created_utc": 1693060462,
   "score": 127,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxunjbf",
   "message": "Flat eathers. It is difficult to find more dumb",
   "created_utc": 1693069769,
   "score": 34,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxu2whs",
   "message": "Trumper MAGAts still insisting their orange blob won the 2020 election.",
   "created_utc": 1693061602,
   "score": 59,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxu6tel",
   "message": "Flat earth and creationism",
   "created_utc": 1693063188,
   "score": 11,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxufsv3",
   "message": "Myself as a kid bullshitting my way through political and \"scientific\" discussions to look smart",
   "created_utc": 1693066706,
   "score": 20,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuq9a0",
   "message": "You should assume basically every supposed Einstein quote you read wasn’t said by him.",
   "created_utc": 1693070864,
   "score": 9,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxutjnh",
   "message": "This is a weird one but, fear of learning. People these days are afraid they can't learn something so they never try. They just assume they can't. Or, if they aren't sure something will work they're afraid to try it, and can't understand that if it doesn't work you can just try something else.",
   "created_utc": 1693072185,
   "score": 37,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxtz87p",
   "message": "one example is when individuals propose intricate solutions to complex problems without considering the challenges of practical implementation. while their ideas might be ingenious, the lack of a realistic roadmap can limit their effectiveness. it's a reminder that even the brightest ideas need to account for the real world.",
   "created_utc": 1693060111,
   "score": 18,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxu847p",
   "message": "Stockton Rush",
   "created_utc": 1693063702,
   "score": 9,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxua30l",
   "message": "Joke's on you! My smartsy have no limits! Wait ... what?",
   "created_utc": 1693064461,
   "score": 4,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxujj9u",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuq4zm",
   "message": "My friend thought he was a genius.  He had perfect or near perfect scores on all the standardized tests, top flight engineering degree, etc.  \n\nHe got into trading firm at like age 25.  He thought he found the perfect scheme that the masses were too stupid to figure out.  He was fired from the firm (because they needed a patsy according to him).  So he created a hedge fund that was, when explained to me, just a series of puts against volatility.  Basically, a round about way of selling insurance against the stock market.\n\nAnd with selling insurance, you rack up money until something catastrophic happens, then you lose all a large sum.\n\nHis goal was to start with $50K from friends and family, and he would establish a track record that would then attract millions, then hundreds of millions.\n\nHe was so sure of it, he ruined his life over it.\n\nHe'd make 10% above the market each year, be happy, then every third or fourth year, his portfolio would drop 40%-50%.  But in his mind, he was just \"away from the computer at the wrong time\" and missed those drops.  His hindsight was always so obvious to him.  I offered to automate it, but he said something like \"it's only something I can see.\"\n\nSo, on west coast time, he'd get up at 6AM and just watch the market.  That was his job.  He wasn't making any money, nor did he have a job, his hedge fund was underperforming the S\u0026amp;P quite handedly.\n\nHe did that for over a decade.  It took like 12 years, only when he was almost forced to call his friends and family for more money to cover the losses of the hedge fund (yes, the hedge fund of just $50K started going in to negative territory).\n\nAnd he lived his life like he was a future multi-millionairre.  When he was in his late 30s, he would only go out with girls in their 20s because he \"wanted to enjoy his time before they had kids.\"  He basically wanted a trophy wife before he earned it.  Needless to say, a jobless late 30s guy with no career only attracted the naive or crazies.\n\nThen he got depressed over it.  Then fat.  Then tried to restart his career as accountant by getting more degrees, but is getting less than a new grad even though he's in his mid-40s.\n\nAnd what was worse was the therapy.  He shopped around for a therapist that would eventually confirm his genius.  Therapist said \"You have clinical depression, it's not anything you have done\" and he felt absolved of his, well, life choices.  And now has another scheme of setting up some outsourcing firm for accountants, he's a \"CFO\" of a dinky startup that he feels could be worth billions.  And yes, now that he's got his confidence again, he's chasing girls way out of his league.",
   "created_utc": 1693070814,
   "score": 39,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuvvrs",
   "message": "maga politicians",
   "created_utc": 1693073137,
   "score": 12,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxv7b35",
   "message": "The overlap between the smartest bear and the dumbest person is bigger then you'd think. (Talking about making anti bear dumpsters)",
   "created_utc": 1693077819,
   "score": 18,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxujf9y",
   "message": "Genius: Albert Einstein doing research that would ultimately contribute to the creation of the atomic bomb. He himself talked a lot about how much he regretted it. \n\nStupid: Donald Trump. Just all of him.",
   "created_utc": 1693068117,
   "score": 8,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuxrbn",
   "message": "People that continue to vote for Trump...despite numerous red flags on all possible fronts",
   "created_utc": 1693073905,
   "score": 9,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxu34xd",
   "message": "Bigotry.",
   "created_utc": 1693061695,
   "score": 5,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuc2n5",
   "message": "Elon Musk. Twitter. \n\nDonald J. Trump. If Trump had taken Howard Stern's et al.'s advice, he wouldn't have had his mugshot taken this week.",
   "created_utc": 1693065239,
   "score": 9,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxudz7q",
   "message": "Stupidity thinks it knows everything",
   "created_utc": 1693065981,
   "score": 6,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxujsz2",
   "message": "The sigma, alpha, gama , beta ,delta and what not males and females. Yah  them",
   "created_utc": 1693068274,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxus8wq",
   "message": "The idea that making something \"idiot proof\" seems to only create better idiots.",
   "created_utc": 1693071660,
   "score": 16,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuvwlf",
   "message": "There are limitations to human knowledge and our understanding of things. Rather than acknowledging these limitations, people fill them in with supernatural explanations. When you express uncertainty or doubt, you are mocked or they ascribe to a lack of self confidence.\n\nDoubt is the beginning of wisdom, not the end of it.",
   "created_utc": 1693073146,
   "score": 4,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuw8bz",
   "message": "I used to manage a fast food place. One of my employees one time asked if I'd cosign a loan so he could get a vespa-style scooter. \n\nI declined the offer, but another assistant manager agreed. The asst mgr have wrote some stupid contract that didn't protect himself at all, it basically only said the employee would make the payment and include a \"cosigner fee.\" \n\nAs expected, the guy eventually quit, then defaulted on the loan, then moved. The only contact for this guy was his home phone. The loan company cane after the asst mgr for the full amount. He acted all surprised that this would happen and submitted his hand written contract to the loan company. They pointed out his hand written contract didn't say anything about if the guy stopped paying. Not that it mattered, I think they just said that to point out how increasingly stupid he was.",
   "created_utc": 1693073278,
   "score": 24,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuwvdj",
   "message": "Most conspiracy theories… the blue roof one is the most recent.",
   "created_utc": 1693073539,
   "score": 13,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxux80x",
   "message": "Have a mutual hobby acquaintance who , you know is going through it. In may we went to Boston for an event, at the after party and as a result of this male smitage, she gets very drunk. Meets a man who's like 20 something years older than her and wants to leave with him when he was 86ed from the bar we are at. She doesn't leave with him but ends up walking the streets of boston at midnight while drunk. At 1 am she calls me and says she doesn't know where she is . I ask for her to send her location. She doesn't know how to do it . I say open Google maps and send a screen shot, she doesn't know how to do that . I ask her to read a sign near her and say the street name, but she says something unintelligible. Finally, I ask her to send me a picture of the sign... Which she does but it's a fuckimg stop sign",
   "created_utc": 1693073685,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxv0afi",
   "message": "I work with someone right now who can't spell her own name (Amanda) and forgot when her birthday was",
   "created_utc": 1693074940,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxv4ure",
   "message": "Kanye! 😂",
   "created_utc": 1693076817,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxv7lsn",
   "message": "people believe someone is 6’3” 215lbs",
   "created_utc": 1693077941,
   "score": 33,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuxqzp",
   "message": "donald trump and his drooling zealots",
   "created_utc": 1693073901,
   "score": 6,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxu5axe",
   "message": "If genius means educated and intelligent, both can be varified and those people are receptive to that, if not mentally ill, hence delusional to some capacity. Stupid people come up with shit however they like, reason how ever they perceive/feel, therefore this can be endless, and isn't really sensitive to logic, data, science etc.",
   "created_utc": 1693062582,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuawrh",
   "message": "World Politics. Its not just the US, there are people who really don't care everwhere. Politics is image not substance.",
   "created_utc": 1693064783,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxucwtq",
   "message": "Trump voters.",
   "created_utc": 1693065571,
   "score": 8,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuiza9",
   "message": "I mean, have you seen the entire GOP currently not to even mention Trump supporters? Chirst, the amount of sheer stupidity runs so deep that it's hitting the Earth core.",
   "created_utc": 1693067965,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxumdyd",
   "message": "MAGA",
   "created_utc": 1693069307,
   "score": 4,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxul0lz",
   "message": "The entire right wing",
   "created_utc": 1693068753,
   "score": 7,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxui8ia",
   "message": "I’m kind of feeling like current political climate. Look at Trump, De Santis and the countless folks crippling basic stuff like libraries and our education system. It is a level of stupidity that is difficult for me to fathom.",
   "created_utc": 1693067691,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuvkw2",
   "message": "One example that comes to mind is the misuse of technology. A genius creates a tool with a specific purpose in mind, but then someone else uses it in a way that it wasn't intended for, often causing more harm than good. This shows that while genius has its limits, stupidity can go beyond those limits.",
   "created_utc": 1693073014,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuhiru",
   "message": "About 80% of what I read on Reddit.\n\nI just started on Reddit a few months ago and I am astounded by how stupid people are. It has forced me to conclude that since I am also on Reddit, I must be stupid :(",
   "created_utc": 1693067404,
   "score": 1,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxutata",
   "message": "Maga",
   "created_utc": 1693072087,
   "score": 4,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxutr63",
   "message": "Most of the folks in r/Coronavirus",
   "created_utc": 1693072268,
   "score": 1,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxu9h9g",
   "message": "Investing in the stock market is a great example.",
   "created_utc": 1693064225,
   "score": 252,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxun2ry",
   "message": "It's really the opposite. Working in retail proves there is absolutely no limit to stupidity. Genius even in polymaths is limited by time and interest and sometimes politics",
   "created_utc": 1693069585,
   "score": 0,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuwwac",
   "message": "Politics",
   "created_utc": 1693073550,
   "score": 0,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuc9po",
   "message": "Besides MAGA, of course, but probably sharing many of the same individuals, are religion, UFO fanatics, and on everyone else's list, I'm sure: Hip Hop.",
   "created_utc": 1693065315,
   "score": 255,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxv5m50",
   "message": "unhinged, unscientific Gov't reaction(s) to COVID",
   "created_utc": 1693077125,
   "score": 254,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuykph",
   "message": "WE WAZ KANGZ",
   "created_utc": 1693074237,
   "score": 255,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxusqyt",
   "message": "Women driving",
   "created_utc": 1693071862,
   "score": 253,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuijwj",
   "message": "Ah, the irony of Lincoln correcting Einstein on the internet! 😄",
   "created_utc": 1693067816,
   "score": 1,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuiwmb",
   "message": "The know-it-all is the dumbest guy in the room.",
   "created_utc": 1693067935,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuixhq",
   "message": "Kevin…",
   "created_utc": 1693067945,
   "score": 1,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxunlty",
   "message": "Genius side to me is Nicola Tesla. He was limited by the technology of the time\n\nI know it's not exactly what the question is about but just made me think of it",
   "created_utc": 1693069796,
   "score": 1,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuofz9",
   "message": "Did he say it though? \n\nAbraham Lincoln once said “If you are a racist, I will attack you with the north.”",
   "created_utc": 1693070136,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuouze",
   "message": "We are watching it play out in various indictments every day.",
   "created_utc": 1693070303,
   "score": 1,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxup1tt",
   "message": "[The legendary Kevin story is probably the best example.](https://www.reddit.com/r/AskReddit/comments/219w2o/whos_the_dumbest_person_youve_ever_met/cgbhkwp/?utm_source=share\u0026amp;utm_medium=mweb3x\u0026amp;utm_name=mweb3xcss\u0026amp;utm_term=1\u0026amp;utm_content=share_button)",
   "created_utc": 1693070380,
   "score": 8,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxuserc",
   "message": "Here's on for the stupidity side. Watching people vote against their own interests...oh and people eating tide pods. No limits yolooooooo weeeeeee",
   "created_utc": 1693071726,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxut467",
   "message": "Warfare",
   "created_utc": 1693072012,
   "score": 1,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxut65v",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxvldag",
   "message": "Let me control the direction of a conversation and I will drop the IQ of the room like a jenga tower.",
   "created_utc": 1693083779,
   "score": 7,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxv0kcs",
   "message": "Reddit Mods",
   "created_utc": 1693075054,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxvrsn0",
   "message": "Donald Trumps existence.",
   "created_utc": 1693086495,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxvujh0",
   "message": "Antivaxxers",
   "created_utc": 1693087703,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxv67vj",
   "message": "People misquoting Albert Einstein: \"Two things are infinite: the universe and human stupidity; and I'm not sure about the universe.\"",
   "created_utc": 1693077375,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxvnuus",
   "message": "People who make their political affiliation the very core of their identity. Flying flags, wearing clothing, sharing artwork that looks like it should go on the front of a romance novel because they're unrealistically muscular. It's a level of stupidity beyond comprehension. \n\nPoliticians are public servants, not superheroes.",
   "created_utc": 1693084826,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxvplqh",
   "message": "In my Spanish 1 class, some how we got on the topic of ducks flying south for the winter, and a sophomore girl said “wait ducks can fly?” Then, after the teaching explaining that yes, ducks fly, she asked “what are ducks tho. Are they birds or something else” 💀💀💀",
   "created_utc": 1693085555,
   "score": 4,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxvrg37",
   "message": "MAGA",
   "created_utc": 1693086345,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxvrgik",
   "message": "A smart person knows how to communicate his/her mind, where stupid people resort to criticism and hostility...",
   "created_utc": 1693086350,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxvs401",
   "message": "Glad you asked....I have a perfect answer....\n\nhttps://ia802200.us.archive.org/8/items/carlo-cipolla-the-basic-laws-of-human-stupidity/Carlo%20Cipolla%20-%20The%20Basic%20Laws%20of%20Human%20Stupidity.pdf",
   "created_utc": 1693086630,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxvvmpf",
   "message": "Republicans.",
   "created_utc": 1693088194,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxw51qn",
   "message": "Continued “support” for the Mango Mussolini.",
   "created_utc": 1693092549,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxw6v3w",
   "message": "\"Goats don't breathe through their lungs. That's what their horns are for\"\n\nSaid by a 23 year in complete seriousness. He got livid when we told him how dumb that was.",
   "created_utc": 1693093387,
   "score": 12,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxw9x3j",
   "message": "When I was in middle school I convinced a girl that the kiwi birds laid the kiwi fruit as food for their babies. It wasn’t that hard to convince her.",
   "created_utc": 1693094821,
   "score": 6,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxvkrkg",
   "message": "Trump lovers...",
   "created_utc": 1693083523,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxv9u6c",
   "message": "Elon musk. Limitless",
   "created_utc": 1693078877,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxvjgn2",
   "message": "The stupidity of the Trump cult has shown no sign of hitting the bottom yet",
   "created_utc": 1693082966,
   "score": 4,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxw4t71",
   "message": "Remember covid?\n\nThere is a limit to how quickly we can make a vaccine and we just asked people to try not to kill each other with it for a little while. Wash their hands. Stay apart physically when possible. I wasn't even worried about how many people got the vaccine we just had to wait for everyone who did want it to be able to protect themselves. \n\nEven the world's smartest people working day and night had limits. \n\nBut the people worshipping a literal rapist that told people to take horse medicine and inject bleach... There was no limit. We never knew how stupid the next sentence was going to be.",
   "created_utc": 1693092439,
   "score": 8,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxwm9n8",
   "message": "I think it's more a expression of how smart people are aware that their knowledge is incomplete. Whereas an idiot can be completely confident that they're 100% right",
   "created_utc": 1693100718,
   "score": 4,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxx0eq2",
   "message": "Watch the Documentary The Grizzly Man. It's impressive how far that man made it on pure luck and timing. He thought it was skill and knowledge. It was not.",
   "created_utc": 1693108001,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxv91ng",
   "message": "Genius is okay with acknowledging \"I don't have an answer, so I don't know is an acceptable answer.\" Stupidity will say what they think is the answer and assert it without evidence of truth",
   "created_utc": 1693078539,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxvuyu2",
   "message": "Flat Earthers",
   "created_utc": 1693087894,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxw8lii",
   "message": "the guy that built a rocket to prove the earth was flat is high on that list",
   "created_utc": 1693094198,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxwc4bv",
   "message": "Large scale examples of this phenomenon are the Anti Vaxers during the pandemic.  The Dunning Kruger affect was really apperent.",
   "created_utc": 1693095855,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxwfy0o",
   "message": "I live with TWO Q-affected Trumplets during the pandemic. One (Q1) of them was just like weird quasi-spiritual, conspiracy theorist, mountain man type o' crazy, but the other one (Q2) was Christofascist, Flat-Earth, anti-science type o' crazy. \n\nThe second one, literally the stupidest person I've ever encountered in my entire 38+ years of existence, naturally had the dumbest theories/beliefs. \n\nOne night, Q1 and I were out on our deck preparing to watch a particularly large Starlink Chain (iirc, there were about 50-60 that time; and this was before the spacenerds cried about the lights being too bright, so it would be an especially brilliant sight to behold). \n\nQ2 comes out just before they start coming into view. So, of course Q1 and I try to explain to him what he's about to witness, in very specific, simple, and direct terms, as he *doesn't believe in any of it*. He watched them with us, even supplying his skeptical questions, like \"Well why aren't they all perfectly in-line with the others?\" or \"Why are they brighter over there but not over there?\" All of which we fielded informatively and without judgement (because, again, he's dumber than a box o' rocks and dumb-dumbs hate judgement if it ain't their own). \n\nAfterward, with all of the new, idiot-accessible information he'd received, he came to the incredible conclusion \"Y'all are getting scammed. Obviously they--\" `now I have to jump in just to warn you to swallow any liquids you're drinking, because this caused me to do a spit take in real time` \"--***just turned on the lights on that part of the dome to mess with you science believers***.\"\n\n*Even Q1, the craziest person I know, was absolutely dumbstruck.* Like I said, I did a legit spit-out-my-beer-in-disbelief spit take because, even between knowing Q1 \u0026amp; Q2 for 15+ years, I had never heard something so stupid from either of them. \n\nLike Q2 regularly out-stupided himself... but this was, ***I mean come on!*** I don't wanna get too deep into it, but even if we look at it from the surface level using his beliefs as facts:\n\nSo the earth is flat. There's apparently a solid dome covering it. Satellites aren't real. But the dome is rigged up with lights to simulate satellites. And some unknown entity or organization has control over said lights.\n\n...then They™ orchestrated Starlink launches and the resulting post-launch chains to...bully people that *believe in science*...?",
   "created_utc": 1693097660,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxwq5hu",
   "message": "Well, there's the guy who think it's perfectly legal to ask a governor to \"find\" some votes and to conspire to fake documents to try to steal an election. It's amazing how much about Trump's crimes were recorded, been played on all the news stations, and are public knowledge and they're still trying to say it's all okay, it's just first amendment speech, it didn't really happen, endless what-about-isms, constant deflection. And now the dumb fuck is sitting in a jail cell. FINALLY. They're not going to get away with it and frankly the DOJ needs to keep at it. Prosecute ALL of them and I don't care what party they're affiliated with (but let's face it, it's mostly Republicans who're guilty of corruption).",
   "created_utc": 1693102628,
   "score": 3,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxwu0uu",
   "message": "Conservatives.",
   "created_utc": 1693104566,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxwucid",
   "message": "That guy on [bodybuilding.com](https://bodybuilding.com) who didn't know how many days there were in a week.",
   "created_utc": 1693104725,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxx02ra",
   "message": "A classmate (who is a genius) doesn't really talk much nor flaunt his intelligence.\n\nAnother classmate talks a big game but basically flunked out of school.",
   "created_utc": 1693107811,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxx3gqh",
   "message": "Nearly every quote attributed to Einstein was never said by him.",
   "created_utc": 1693109783,
   "score": 2,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxxeizq",
   "message": "Genius people ask questions about something when they don't know about it or want to find out more. Stupid people try to play along and pretend they know about the something in question but just end up looking...well, stupid.",
   "created_utc": 1693117263,
   "score": 1,
   "submission_id": "161wgjn"
  },
  {
   "comment_id": "jxwknkp",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "161wgjn"
  }
 ]
}