{
 "submission_id": "161woq8",
 "title": "Everyone knows about Vampires and Werewolves, what are some lesser known mythical creatures?",
 "selftext": "",
 "created_utc": 1693060088,
 "permalink": "/r/AskReddit/comments/161woq8/everyone_knows_about_vampires_and_werewolves_what/",
 "score": 228,
 "url": "https://www.reddit.com/r/AskReddit/comments/161woq8/everyone_knows_about_vampires_and_werewolves_what/",
 "comments": [
  {
   "comment_id": "jxu7le6",
   "message": "Hulder \n\nIn Norway they talk of these lovely troll women whose petticoats always show through their skirts. If a young man gently and respectfully alerts her to this accidental impropriety, it is said she will show him an enchanted spot where he will always be lucky in fishing.",
   "created_utc": 1693063498,
   "score": 162,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu1har",
   "message": "Ive been told of a duenda, a sort of magical imp who lives in your house and hides your stuff",
   "created_utc": 1693061032,
   "score": 237,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu0jep",
   "message": "Selkies. \n\nEssentially were-seals",
   "created_utc": 1693060647,
   "score": 241,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu23y2",
   "message": "Karakasa. A Japanese monster. Its an umbrella with a foot and an eye!\n\nRokurokubi. A woman with a very long and flexible neck... I mean really long!",
   "created_utc": 1693061289,
   "score": 10,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuba72",
   "message": "Aufhockers are german mythical creature that jumps up on the shoulders of travelers and weights them down until they can no longer walk and are plagued by fear and doubt. It’s a kind of goblin. The Traveller dies most of the time.\n\nAny kind of nature spirit and fae folk as well as changelings fae children that were exchanged for human ones. \n\nAny kind of lesser dragon.\n\nThe Irish have some scary creatures dealing with spirits and ghosts but I can’t remember the name…",
   "created_utc": 1693064928,
   "score": 104,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu91ry",
   "message": "In Portugal you have the Iron Hand, it's invisible and slaps people In unexpected places and times\n.",
   "created_utc": 1693064061,
   "score": 85,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxtztw1",
   "message": "Penanggalan. From Thailand to Cambodia, it is a disembodied female head that can float through the air, smells like vinegar, and preys on pregnant women and newborn babies.",
   "created_utc": 1693060359,
   "score": 158,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxucfxz",
   "message": "Supernatural TV show introduced me to many different mythical creatures/beings.",
   "created_utc": 1693065384,
   "score": 42,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu76xk",
   "message": "Glühschwanz. A creature from German folklore that resembles a winged lizard, and has a tail that glows red, as if it were on fire. If a farmer underpays their farmhands, it will circle above their house at night. However, if a farmer pays their farmhand properly, and treats them well, it would drop some coins down the chimney. \n\nHowever, despite being a winged lizard, and associated with fire, it's not a dragon. If I had a nickel... \n\nAnd while they're not really unknown, goblins are grossly misrepresented in a ton of settings.",
   "created_utc": 1693063339,
   "score": 104,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxukeb8",
   "message": "My mother used to tell me about a water-dwelling, quasi-malevolent creature called a kappa when I was little. \n\nIn proper Japanese fashion, it could be defeated through politeness.",
   "created_utc": 1693068510,
   "score": 34,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxui5vz",
   "message": "Rougarou. It has the body of a human, the head of a wolf, and hunts children in the swamps of Louisiana. I had never heard of it until I moved to New Orleans.",
   "created_utc": 1693067662,
   "score": 29,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuqlh1",
   "message": "From Romani culture, I offer the grotesque Poreskoro. This abomination is an amalgamation of 4 cat heads, four dogs heads, the body of a bird, and the tail of a snake and it is a self-perpetuating hermaphrodite. It’s children are pestilences, epidemics, and pandemics as it breeds with itself in a fetid perversion of recreation. \n\nIts parents are the King and Queen to two rival Romani clans and their tempestuous relationship emboldened the Queen’s servant to feed her a concoction of cat hair, powdered snake, and hair from the hound of hell as a contraceptive.\n\nPoreskoro was the result.\n\nEdit: There’s also the Minceskro which is essentially a sentient vulva amalgamated with a dung beetle; think where the clitoris is..that’s the dung beetle head and the labia are its flesh wings…for some reason, we have a plethora of monsters born from attempted abortions or contraceptives. \n\nThe same queen from the first myth tried to sterilise herself and buried herself alive and a dung beetle entered her womb. She birthed the Minceskro. She is the mother of—you guessed it—venereal diseases like gonorrhea and syphilis.\n\n[Found a picture of it lol](https://imgur.com/gallery/7eKDS77)",
   "created_utc": 1693071002,
   "score": 32,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuiryf",
   "message": "Ogopogo. Its basically the Western Canadian version of the Loch Ness Monster.",
   "created_utc": 1693067883,
   "score": 26,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu2i4z",
   "message": "skinwalkers.\n\naccording to native American belief, they are men who made deals with evil spirits in order to become a shapeshifter, they then seek out and hunt humans.\n\nthey do this by trying to lure you away from safety, they will mimic anything or anyone in order to fool you, even people you know.\n\nthey are not like other cryptids who hide in the dark, they can hunt even in broad daylight.\n\na common trick for them is to hide somewhere out of view and then attempt to call you over to them, using a familiar voice saying something along the lines of \"hey come over here, its me\" or \"help me please\"\n\nthe big kicker is that while they sound like someone you know, there will always be something off about it. listen to your gut.\n\nas they are shapeshifters, they can appear to be any animal, but seemingly have a preference for ungulates (creatures like deer or elk)\n\nrumor has it that if you have any native blood in you, just the mere mention of its name can attract it.",
   "created_utc": 1693061445,
   "score": 215,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu6put",
   "message": "Squonk.  \n\nhttps://en.wikipedia.org/wiki/Squonk",
   "created_utc": 1693063148,
   "score": 45,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxudu7l",
   "message": "You've heard of The Headless Horseman of Sleepy Hollow? Well, the idea of the horseman is thought to be based on the Irish fairy, the *Dullahan*. The Dullahan, like the Horseman, is a headless rider who more often than not is seen as carrying his own head as he rides off. But unlike Sleepy Hollow's horseman, he doesn't bring death but warns of it. He is a harbinger spirit much like the banshee. When you see him, disaster soon follows. \n\nThen there is The Church Grim, a fairy that takes the shape of a great black hound. It has one job and that is to guard graveyards. The origins of this creature are a little murky. In some legends, particular those in England, a Church Grim is created by human hands rather being born. When a graveyard for a church is being made, the priest would sacrifice a dog and bury it in the graveyard before anything else. The spirit of the dog becomes a fairy and the guardian of the graveyard. In other legends, a Church Grim is a captured fairy dog, there are quite a few throughout British and Irish myths, that is bound once again by a priest, to a graveyard to be its guardian. The creature is benign for all accounts unless you plan to rob the graves it looks over. After that, all bets are off. They have been recorded as being vicious and even deadly toward graverobbers. So, keep graverobbing off of your bucket list unless you want to tangle with one.",
   "created_utc": 1693065928,
   "score": 42,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxueb24",
   "message": "Here's some from Albania\n\nZana - Mountain Fairies/Nymphs\n\nBolla - Giant snake which protects the house it lives under\n\nKuçedra - Evil dragon/Hydra\n\nDrangua - Winged Hero\n\nShtriga - Vampiric witch who kills unguarded children \n\nDhampir - This is the only Albanian mythology creature that is known globally, basically someone who's half vampire half human.",
   "created_utc": 1693066109,
   "score": 42,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu7yma",
   "message": "Draugr.\n\nAn undead creature from Scandinavian literature. Said to be the reanimated corpse of a deceased person inside a burial mound.",
   "created_utc": 1693063641,
   "score": 94,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuj4e9",
   "message": "Banshees in ireland, their cry foretold death",
   "created_utc": 1693067997,
   "score": 20,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuzle1",
   "message": "Changelings. They’re trolls, fairies or elves that kidnap a person and then pretend to be them. There are multiple ways to get them to blow their cover, like doing weird things such as stirring a really small pot with a really big/long spoon\n\nBut one thing that is really horrible, is that because people believed in them, a ton of people used to think simple things from puberty to autism were signs of changelings, and they would kill that person, expecting the real one to be returned",
   "created_utc": 1693074653,
   "score": 23,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu2lrr",
   "message": "It's weird, I live in the northern part of Sweden and work within healthcare and most of my visits have been old people, and on atleast 5 different occasions i have heard them talk about seeing trolls in the forest, like small santas. I really believe this because my grandmother that past away 15 years ago said the same thing to me when I was a child, that she was in the forest and saw a tiny little troll.",
   "created_utc": 1693061483,
   "score": 58,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxui8l9",
   "message": "Baba Yaga - \"appears as a deformed and/or ferocious-looking woman. In the folklore record, Baba Yaga usually flies around in a mortar, wields a pestle, and dwells deep in the forest in a hut usually described as standing on chicken legs.\"",
   "created_utc": 1693067692,
   "score": 37,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuje2o",
   "message": "Major ones in Scandinavia is Huldra, Nøkken and Fjøsnissen.\n\nThese were creatures that were very much considered real back in the day. My grandma remembers meeting an old woman when she was a child who swears she met a hulder one day in the forest.\n\nThe moral of the stories for most of them is; don't follow pretty people into the unknown and be an asshole to strangers and they will mess up your life.",
   "created_utc": 1693068104,
   "score": 18,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuq49x",
   "message": "The Sandown Clown\n\nSighted local to us on the Isle of Wight in the 70s, this certified freak hung out with some kids who found him after they heard a weird siren sound - turns out it was this 2m tall clown guy with a big head, pointy hat, paper-like skin, no shoes, and a boom box / tannoy system with a microphone. He lived in a little two-storey shack (I think near Sandown golf course?) told the kids his name was “Sam… of all colours” and ate berries by shoving them into a hole between his eyes. \n\nI love this little weirdo.",
   "created_utc": 1693070807,
   "score": 19,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxtzbyu",
   "message": "Redcaps",
   "created_utc": 1693060154,
   "score": 35,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu6x07",
   "message": "If anyone is interested on this topic the YouTube subchannel Monstrum is good for this cool topic\n\n[https://www.youtube.com/playlist?list=PL\\_lsQEz7yLOpq278N-4I72cTXlRE1kVUN](https://www.youtube.com/playlist?list=PL_lsQEz7yLOpq278N-4I72cTXlRE1kVUN)",
   "created_utc": 1693063227,
   "score": 36,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxujxoh",
   "message": "Wulver, a Shetland creature with the body of a man and head of a wolf. It went around leaving fish on the windowsills of poor families.",
   "created_utc": 1693068325,
   "score": 15,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxudwhx",
   "message": "Selkies are a pet interest of mine.",
   "created_utc": 1693065952,
   "score": 14,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu5zts",
   "message": "Cheuksin’s. A Korean toilet ghost.",
   "created_utc": 1693062860,
   "score": 14,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuxm5e",
   "message": "The „Mittagsfrau“ or Midday-women. From saxony. She comes to workers on fields who dare to work after the 12 o clock bell rang for the lunch break. If they can tell her a story for an hour, she will go away. If not, they will die.",
   "created_utc": 1693073844,
   "score": 13,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu210v",
   "message": "Hantutetek (sorta asian baba yaga/witch if I recall correctly)",
   "created_utc": 1693061255,
   "score": 13,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxungh0",
   "message": "Chicago Moth Man. Flies around Lincoln park and spooks some folks. Halloween night if you leave some French bread out on your doorstep, he’ll fly up there and leave you some hot beef!",
   "created_utc": 1693069738,
   "score": 12,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu2knj",
   "message": "[Pontianak aka Kuntilanak](https://en.m.wikipedia.org/wiki/Kuntilanak)",
   "created_utc": 1693061471,
   "score": 13,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxujz1r",
   "message": "Nagas",
   "created_utc": 1693068341,
   "score": 13,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuv31l",
   "message": "The Näck in Nordic folklore is basically the male equivalent of a mermaid that lures women and children in to the river with song. Where he then drowns them.\n\nhttps://en.m.wikipedia.org/wiki/Nixie_(folklore)",
   "created_utc": 1693072811,
   "score": 13,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuspw5",
   "message": "The Wendigo. A creature from the great plains area of native American culture. Often depicted as a half man half monstrous deer like creature. Incredibly evil, the creature isolates groups of victims and feeds on them. It also drives people insane and causes them to resort to cannibalism. After which the cannibal goes thoroughly insane before running so fast their feet burn to cinders and they run off into the sky. This is how more wendigos are born. \n\nThere is also a medical diagnosis called wendigo psychosis which you bet involves cannibalism and going nuts. \n\nScary stuff.",
   "created_utc": 1693071851,
   "score": 39,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuxusi",
   "message": "Okay, this is a fun one becaus it's not *technically* a mythical creature, but it has been so readily and deeply adopted into Mexican lore it may as well have been an Aztec myth.\n\nAlebrijes.\n\nThey were invented in the mid 1930s by a man named Pedro Linares. One day, he got sick and got a pretty bad fever, and in his fever dreams, he saw a bunch of weird, brightly colored creatures in a forest, all of them chanting the word \"alebrije.\" When Linares got better, he started making the creatures he'd seen out of paper maché. \n\nIf you look up alebrijes, they're usually a mashup of various animals with patterns drawn on their skim and painted bright colors, usually orange, neon blue, green and yellow. They'll be fish with a snake's head and lion's legs and a human torso, that kind of thing. \n\nHere's the fun part. They became as closely linked with traditional Mexican culture as Piñatas, or Día de Muertos. They were adopted and before long, they became almost a mythical race in Mexican lore. To the point that Pixar itself added them in their movie Coco as a \"guardian of the afterlife\" type of creature in the Land of the Dead. Which is 100% bullshit; they came from some dude's fever addled hallucinations lmao.\n\nBut there you go! Nowadays, Alebrijes are an icon of Mexican culture and iconography, and while technically not a mythical creature in origin, they may as well be one now.",
   "created_utc": 1693073945,
   "score": 9,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuko5c",
   "message": "I don't think anybody has mentioned [the Rougarou](https://thesupernaturalfoxsisters.files.wordpress.com/2018/05/rougarou-swamp.jpg)! \n\nHe sneaks in during the middle of the night to eat bad kids. This is a Cajun monster that I grew up with in Southeast Texas.",
   "created_utc": 1693068619,
   "score": 9,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxumbec",
   "message": "The Sluagh, or Sluagh na marbh, were the hosts of the unforgiven dead in Irish and Scottish folklore",
   "created_utc": 1693069278,
   "score": 9,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxumcmx",
   "message": "Tsuchinoko\n\nA snake-like creature in Japanese folklore with a widened midsection and viper fangs. Some are said to be able to speak but are compulsive liars.",
   "created_utc": 1693069292,
   "score": 9,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuwqsm",
   "message": "Selkie, which are seal versions of a mermaid. Except they can shapeshift between the 2. It is prominently featured in mtg cards. Wolpitingers and bunyips. Real mythology of faerie, they are quite malevolent",
   "created_utc": 1693073488,
   "score": 8,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxucf44",
   "message": "Hodag, some kind of tasmanian devil type thing with legs on one side  shorter because they walk around mountains",
   "created_utc": 1693065374,
   "score": 8,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxufzsg",
   "message": "Wopertinger. Depending in the specific example it is relatively similar to a jackalope with the exception of having additional duck features like feet or most commonly wings",
   "created_utc": 1693066786,
   "score": 7,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxvxvwy",
   "message": "Everything in Philippine mythology. \n\nThere's a thing that pretends to be a helpless baby in the woods and transforms and kills you if you pick it up.\n\nThere's a thing that has inverted audio, the closer it gets the farther away it sounds and vice versa.\n\nWhy their mythology isn't way more popular, especially in horror, is beyond me.",
   "created_utc": 1693089209,
   "score": 8,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxumaqy",
   "message": "Loch Ness it just needs 3.50 anybody going to donate",
   "created_utc": 1693069270,
   "score": 6,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuzyj0",
   "message": "Huldufólk or more commonly known as Álfar or Elfs.\n\nNow Icelandic elfs are not like D\u0026amp;D or Tolkien elfs.\n\nThey are more like what you would understand as gnomes except they live in rocks, hide from humans and if you mess with them or their rocks they will mess you up.\n\nAnd I mean that literally. They would steal your kid and stab you to death while dancing away.\n\nIf they were real that is.\n\n*Nervously looks at the boulder in my garden*",
   "created_utc": 1693074804,
   "score": 6,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu4mpc",
   "message": "There are too many, but here are some of my favorites.\n\n\"Gargouille\"\nThere is a legend in France that the gargoyle, a stone statue of a monster, was a dragon.\nThe creature used to live in Rouen, France, but was exterminated by the local archbishop.\nHowever, there is also a theory that it was worshiped as a god of water in ancient times.\nThere are various theories about its appearance, but it is said that it has a long neck.\n\n\"Takuskanskan\"\nIn Native American lore, this is a type of wind spirit. It is believed that this spirit resides within all moving things in the world as they sway and shift.\n\n\"Leshy\"\nAn Eastern European forest spirit.\nAppears as a person with unkempt hair and a beard, but there is no shadow and no sound of footsteps.\nThey can change their height at will.\nAdditionally, when they are about to be seen by someone they don't like, they disappear immediately.\n\n\"Borometz\"\nA plant-sheep chimera that appears to have its origins in Jewish legend.\nIn simpler terms, it is a creature that grows sheep instead of flowers on its plants.\nIt seems to sustain itself by consuming the grass of plants that are also a part of its own body.",
   "created_utc": 1693062305,
   "score": 17,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxutzfp",
   "message": "I don’t know how many people actually know about this one\n\nThe Yule cat. The pet cat of a troll named Grila in Scandinavian folklore. If kids didn’t receive any new clothes at Yule, which I think is a sort of Scandinavian Christmas, but I Don’t really know that for sure. Anyway if kids didn’t receive any new clothes the Yule cat would come and eat them. I would think it’s to scare kids into finishing all the knitting and stuff like that before the winter to survive.\n\nJust to clarify I’m not an expert about this by any means and this is all just stuff I read on the internet so take it with a grain of salt",
   "created_utc": 1693072361,
   "score": 10,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxul6jm",
   "message": "Selkies",
   "created_utc": 1693068819,
   "score": 4,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxupcag",
   "message": "North American Axehandle hounds. They’re nocturnal dogs that have short legs and have a head that’s shaped like an axe blade. They exclusively eat axe handles if you leave them out for too long.",
   "created_utc": 1693070495,
   "score": 5,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuqk5e",
   "message": "[Vegetable Lamb of Tartary](https://en.wikipedia.org/wiki/Vegetable_Lamb_of_Tartary) \\- a plant whose fruit is a sheep",
   "created_utc": 1693070987,
   "score": 5,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxurq9i",
   "message": "Bunyip - an Australian creature that’s weird even for that remote island.",
   "created_utc": 1693071451,
   "score": 4,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxutw7y",
   "message": "The Lambton Worm, a massive snake/dragon like creature that terrorised the borders of County Durham and Sunderland in North East England.\n \nhttps://youtu.be/BcZcOoP_v2k?feature=shared",
   "created_utc": 1693072325,
   "score": 5,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuh0qc",
   "message": "Chupacabra",
   "created_utc": 1693067199,
   "score": 9,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxugzhs",
   "message": "Sprites",
   "created_utc": 1693067185,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxunzci",
   "message": "Kuchisake-onna\n\nA woman who appears in a veil and asks you a trick question. The only way to get out of being killed by her is to answer the question in a convoluted way, or to answer with another question.",
   "created_utc": 1693069948,
   "score": 4,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuoy46",
   "message": "In Icelandic folklore, there are evil whales known as illhveli. They want nothing more than to kill you and you can't say their names or they'll find you.",
   "created_utc": 1693070339,
   "score": 4,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxur16q",
   "message": "Springheel Jack",
   "created_utc": 1693071176,
   "score": 4,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuscxi",
   "message": "The Faoladh. Werewolves in Irish mythology that fit in with a 1980's swords and sorcery low budget fun adventure. They were warriors that fought with weapons and were the most respected, the high Kings of Ireland were said to have faoladh working for them. They weren't mindless beasts unlike other mythologies. Really cool and strangely enough Wolfman from Marvel Comics is kind of similar to them",
   "created_utc": 1693071706,
   "score": 4,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuzpyi",
   "message": "1. *Mavka*. She's like a spirit of a beautiful girl in Ukraine.\n2. *Potercháta (poterchá)*. In Ukrainian mythology this is the name given to children who died unbaptized. If no one baptizes such a child seven years after death, it became idk, demon? Evil soul?\n3. *Magura*. Ukrainian interpretation of the Scandinavian Valkyrie.  Her heart is forever devoted to the soldiers who died in battle.\n4. *Chuhaister*. Chuhaister is not dangerous. He hunts down female spirits, Mavkas, that eats people.\n\nWe have a lot interesting creatures in our mythology, but I don't really know them, unfortunately",
   "created_utc": 1693074706,
   "score": 4,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxul04j",
   "message": "Dahu; a kind of French mountain goat.  \nTheir unevenly long legs help them climb mountains, but and individual dahu can only walk the hills in one direction, clockwise or counterclockwise.  They are distantly related to the better know Wild Haggis.",
   "created_utc": 1693068748,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxule6y",
   "message": "Incubi and succubi.",
   "created_utc": 1693068905,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuuc3h",
   "message": "Chinoo, ice giants with a frozen heart and almost unending appetite. They eventually chew off their own lips due to their hunger and the hungrier they are the larger they grow.",
   "created_utc": 1693072502,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuy8t0",
   "message": "Huldra.  She lures men into the mountains and enslaves them.",
   "created_utc": 1693074101,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuyc9p",
   "message": "The Nanabozho\n\nIs a shape-shifting creature common in some Native American tribal stories. \n\nhttps://en.m.wikipedia.org/wiki/Nanabozho",
   "created_utc": 1693074140,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuyp5b",
   "message": "Long horse",
   "created_utc": 1693074288,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuzhq6",
   "message": "The rougarou (or loup-garou) is a monster from Cajun folklore. In the legend, this beast is often described as having the body of a man and the head of a wolf or a dog and prowls Louisiana swamps looking for misbehaving children.\n\nThe skunk ape is a cryptid ape-like creature alleged by cryptozoologists to inhabit forests and swamps in the southeastern United States.",
   "created_utc": 1693074611,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxv13ej",
   "message": "My favourite is the Rusalka.\n\nIt is a creature from Slavic mythology. It's a person (in general women) that has died in a violent way and has become an evil water spirit. It lurks in the rivers/ponds and tries to lure its victims into the water to drown.",
   "created_utc": 1693075271,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxv1jt3",
   "message": "In India,\nDaayan and/or Chudail (they are different but some people would say they are same)\n \nIchadhari naagin - so they are mythical snake people who in there snake form were blessed to be able to take human form. So it's said that naag(male snake) and naagin(female snake) (and yes naag -naagin are real species of snakes) mate for life so if you kill the naag the naagin in the form of ichadhari naagin will come seeking revenge. The belief is so rooted that if someone ever ends up killing one(never on purpose ), they will search the other and kill it.",
   "created_utc": 1693075457,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxv2jrg",
   "message": "Karakasa. A Japanese monster. Its an umbrella with a foot and an eye!",
   "created_utc": 1693075870,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxv80ir",
   "message": "The legendary Esquilax, a horse with the head of a rabbit and the body of a rabbit.",
   "created_utc": 1693078111,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxvplxk",
   "message": "It's a liger. It's pretty much my favorite animal. It's like a lion and a tiger mixed... Bred for it's skills in magic.",
   "created_utc": 1693085557,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxvu72k",
   "message": "Hachishakusama, it's a yokai in Japan that kidnaps little kids. Actually, try all of Japan yokais, some not everyone knows about",
   "created_utc": 1693087549,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxx21w5",
   "message": "Filipino folklore \n\n\nKapre. A giant stinky man who hangs around on trees and smokes.\n\n\n\nTikbalang. A humanoid horse, like a reverse centaur. Horse head in humanoid body.",
   "created_utc": 1693108946,
   "score": 3,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxu9dq3",
   "message": "Elwedritsche are a fictional creature that is only known in a quite small part of germany. And even there most people who know them are from families from this region.",
   "created_utc": 1693064187,
   "score": 2,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuq9yz",
   "message": "Lorelei. \n\nShe sits on a rock in the river Rhine and lures ships into some heavy waters and they crash on her rock. \n\nThere is also a figure in Sorbisch (sorb/wendish) folklore called “Mittagsfrau” (Noon-Woman). She steals(?) young women who fall asleep on the field during midday (or something to that regard). \nThere are a few more mythic creatures in sorbisch culture. Most of them sinister and just one of them nice. The nice one is Krabat. He is a good wizard.",
   "created_utc": 1693070872,
   "score": 2,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuqyn3",
   "message": "Siren. They use their angelic voice to lure people in",
   "created_utc": 1693071148,
   "score": 2,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxut4u8",
   "message": "Cadejo. Basically 2 types of good and bad ghost dogs that follow you around and try shenanigans regarding your mortality lol.",
   "created_utc": 1693072019,
   "score": 2,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxux2r3",
   "message": "The melonheads of Chardon, Ohio. \n\nWhile they’re rumored to be found in many areas of America, legend has it they were unfortunate youth confined to a group home, found on Wisner Road, run by the mad scientist Dr. Crow. \n\nOne night, sick of their cruel captor, they burned down the building, killing the cruel Dr. Crow (but did he really die…?) and escaping to live off the land. \n\nThey can still be seen, now and then, on a night much like this, hunting for unwary passersby to rob…\n\n(Here is where you pause, as if you see a poor melonhead in the tree line, scaring one’s nephews.)\n\nOf course, besides not being true on its face, nothing I wrote above is accurate, starting with the fact that Wisner Road is in Kirtland, not Chardon. \n\nBut let’s not let the truth (or “truth”) get in the way of a good story. \n\nBtw, my nephews, in their retelling, managed to work in the story of La Llorona into the melonhead story, demonstrating that these legends are endlessly remixable.",
   "created_utc": 1693073624,
   "score": 2,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxvpvsc",
   "message": "Belschneckel !",
   "created_utc": 1693085673,
   "score": 2,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxvr86a",
   "message": "The boo hag",
   "created_utc": 1693086250,
   "score": 2,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxvy6w3",
   "message": "Baba Yaga",
   "created_utc": 1693089349,
   "score": 2,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxwkavf",
   "message": "Kelpies",
   "created_utc": 1693099765,
   "score": 2,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxwrb6t",
   "message": "My dad",
   "created_utc": 1693103199,
   "score": 2,
   "submission_id": "161woq8"
  },
  {
   "comment_id": "jxuhpgl",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "161woq8"
  }
 ]
}