{
 "submission_id": "161x14b",
 "title": "What’s the best decision you’ve ever made?",
 "selftext": "",
 "created_utc": 1693060926,
 "permalink": "/r/AskReddit/comments/161x14b/whats_the_best_decision_youve_ever_made/",
 "score": 211,
 "url": "https://www.reddit.com/r/AskReddit/comments/161x14b/whats_the_best_decision_youve_ever_made/",
 "comments": [
  {
   "comment_id": "jxucwzj",
   "message": "In 2012 I got an offer from Amazon. It meant leaving Arizona and all my friends and family to move to Seattle. I stressed about it for a long time and finally decided to take it for a year and then move home. \n\nMet a girl my first week here and married her 5 years later.",
   "created_utc": 1693065573,
   "score": 227,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu66xf",
   "message": "Idgaf if it’s cheesy, but proposing / marrying my wife.",
   "created_utc": 1693062938,
   "score": 228,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu1l7i",
   "message": "Leaving my ex. We were horribly toxic together and I'm so much happier now.",
   "created_utc": 1693061077,
   "score": 152,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu8cvs",
   "message": "I found a us army grenade simulator as a kid. It had a pull string.  I held it and was going to pull it but changed my mind.  Instead I tied it to tree and got more string until it I had about 10 feet. It blew a hole in the pine tree about the size of pie tin and about 2 inches deep.  The cops came. I would have lost my hand or worse.  The year was 1968.",
   "created_utc": 1693063796,
   "score": 68,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu1s3c",
   "message": "At 30 years old with a wife and two kids, go to college.  My standard of living dramatically improved after graduating.",
   "created_utc": 1693061155,
   "score": 210,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu4w04",
   "message": "Stopping drinking alcohol",
   "created_utc": 1693062411,
   "score": 190,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu5gq6",
   "message": "leaving and going no contact with my abusive family",
   "created_utc": 1693062647,
   "score": 186,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuf0qu",
   "message": "A bit over a year ago, I decided it was time to lose weight. Now, I had the yearning to lose weight before that, because being fat sucks. But I got a haircut that looked really good and I looked in the mirror and it was as if I were seeing myself for the first time. I looked at myself and thought \"I could be pretty. I really could. You know what? I'm going to give this an honest try.\"\n\nSo I did. I researched the hell out of weight loss, began calorie counting and I am proud to say that Ihave lost 127 lbs... so far.\n\nNow it isn't even a matter of \"Gee, will I ever reach my goal weight?\" It is a matter of WHEN.\n\nMy whole life has changed, and 95% of those changes have been positive. I have met a version of myself I never knew existed. And it is fucking beautiful.",
   "created_utc": 1693066394,
   "score": 4,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuaemv",
   "message": "Every time I chose going to the psych ward over killing myself.",
   "created_utc": 1693064587,
   "score": 126,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu3kxp",
   "message": "quit smoking and drinking, started to exercise!",
   "created_utc": 1693061875,
   "score": 207,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu2245",
   "message": "Getting a golden retriever puppy. That was 11 years ago and now I have 3. So much happiness and love.",
   "created_utc": 1693061267,
   "score": 159,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxubx59",
   "message": "Getting sober from alcohol - 1,290 days but who’s countin!",
   "created_utc": 1693065179,
   "score": 85,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxud35f",
   "message": "changing my major. i have so much more motivation for school now that i actually love what i’m studying",
   "created_utc": 1693065638,
   "score": 63,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuevl7",
   "message": "Accepting an accidental friend request from the woman who'd eventually become my girlfriend.",
   "created_utc": 1693066336,
   "score": 58,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu1sy2",
   "message": "Decision to not giving a fuck",
   "created_utc": 1693061164,
   "score": 85,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu1m8i",
   "message": "Calling a lawyer after a hit and run (Edit* I was the victim)",
   "created_utc": 1693061088,
   "score": 76,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu3lt1",
   "message": "Not Replying to my ex. 2 months after she broke up with me.",
   "created_utc": 1693061885,
   "score": 36,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu9haq",
   "message": "Rescuing a stray kitten that started coming by my house. She’s about 6 or 7 months old now and I love her to death.",
   "created_utc": 1693064226,
   "score": 56,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxubtmf",
   "message": "To get diagnosed and medicated ( bipolar 1)",
   "created_utc": 1693065141,
   "score": 47,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxucw1q",
   "message": "Once I found 3lbs of meth working at UPS. I was using at the meth at the time and decided that would ruin me. I turned it in.",
   "created_utc": 1693065563,
   "score": 46,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxud8ac",
   "message": "Deciding to finally ask out my now wife. We were friends for years and it just clicked one day that she's the one.",
   "created_utc": 1693065693,
   "score": 36,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu2g22",
   "message": "Probably joining the military. I went from a bad kid who had a lot to learn and was very naive to being a responsible adult with more life experience. Just surrounded myself with good people and good mentors.",
   "created_utc": 1693061422,
   "score": 70,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu7cc8",
   "message": "Starting my own business (8 years ago). Killing it and only working part time.",
   "created_utc": 1693063398,
   "score": 31,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxueu41",
   "message": "Checking myself into rehab. I was 23 and completely hopeless. With the way I was abusing substances, I probably wouldn't have survived another 6 months to a year, whether by overdose or suicide. Now, I'm over 5.5 years sober and my life is full, rich, successful and happy. It was the hardest decision I ever made, and the best one.",
   "created_utc": 1693066320,
   "score": 40,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxucw5t",
   "message": "My “No regrets” tattoo. Sometimes I’ll start to regret something then see it and be like, “No, the tattoo is right, no regrets” and I keep crushing it.",
   "created_utc": 1693065564,
   "score": 26,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuafhb",
   "message": "To have kids. My sons are the best that ever happened to me.",
   "created_utc": 1693064596,
   "score": 41,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxudyuu",
   "message": "Divorcing my husband just short of 50 years! No more negative influence.",
   "created_utc": 1693065977,
   "score": 54,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuel2y",
   "message": "Quit letting misery, pessimism and cynicism guide how I lived. Quit making massive assumptions about huge groups of people. Realised that purpose, happiness and opportunity are things that you create.\n\nYou can't just wait for things to get better. If you're not doing something to make them better, things stay exactly as they are.",
   "created_utc": 1693066220,
   "score": 54,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu7whc",
   "message": "Divorce",
   "created_utc": 1693063618,
   "score": 16,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxudqas",
   "message": "Joining the Marines. It put in me the discipline and dedication I needed to accomplish what I have.",
   "created_utc": 1693065886,
   "score": 16,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxunwcf",
   "message": "I was very religious. Not evangelical, but a believer in a God that you have to fear and respect and worship in some form.\n\nI decided to read some books that go against all my beliefs. I came out realizing how silly those beliefs are and it felt like the lights suddenly came on and the monsters were gone. It changed my entire worldview and its the best thing that ever happened to me.",
   "created_utc": 1693069915,
   "score": 22,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu94iw",
   "message": "Asking my gf of only two months to marry me before I left for the Air Force. 17 years of marriage, so far.",
   "created_utc": 1693064091,
   "score": 30,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuef13",
   "message": "Go back to Italy from California after my marriage didn’t go as planned",
   "created_utc": 1693066153,
   "score": 9,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuhkmi",
   "message": "Going to a large university 7 hours from home instead of going to the small school an hour from home. I wouldn’t have enjoy the college experience nearly as much. Going away helped me learn so much more about myself and helped me to realize so much more of what I wanted in the world.  \n\nIf I had stayed home I probably would have moved back to my hometown when I was done and I’d say it’s probably 50/50 if I would have married my high school girlfriend. Not sure life would have been terrible, but I know my life is better now than if I had stayed home.",
   "created_utc": 1693067425,
   "score": 15,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxueod4",
   "message": "Once I was hungry. I had two frozen pizzas. At first, I thought about making one and eating it, then making the second one afterwards. But then I thought: Why not making them simultaneously and putting one on top of the other?",
   "created_utc": 1693066256,
   "score": 31,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxub164",
   "message": "Left my ex and married the one I should have been with from the beginning. She's blessed me with a son and I'm living my best life.",
   "created_utc": 1693064830,
   "score": 8,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuqg2q",
   "message": "Stopped watching the news.",
   "created_utc": 1693070941,
   "score": 18,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu2a48",
   "message": "I got a PhD in management in a top institution . I had no idea ahead of time but now I make six figures and have job stability. I went from making $40k to $120k. Changed my life.\n\nBtw, this doesn’t work for PhDs in other fields. PhDs in most other fields make less money and cannot secure tenure track jobs.",
   "created_utc": 1693061356,
   "score": 26,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuega0",
   "message": "Marrying my wife",
   "created_utc": 1693066167,
   "score": 9,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu3c31",
   "message": "swam into an egg\n\nbig shoutout to my mom and dad",
   "created_utc": 1693061774,
   "score": 35,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu6zxe",
   "message": "Fuck all the bad opinions about me",
   "created_utc": 1693063260,
   "score": 6,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxubc6w",
   "message": "Self employment",
   "created_utc": 1693064950,
   "score": 6,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxubnqo",
   "message": "Making him move out and filing for divorce.",
   "created_utc": 1693065076,
   "score": 6,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuj8o7",
   "message": "To call her the next morning.",
   "created_utc": 1693068042,
   "score": 9,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxumcy0",
   "message": "Honestly, getting my vasectomy. Finally got one when I was 29, I'm 31 now. I knew since I was a teenager that I didn't want kids, even adopted ones so I made an appointment, got snipped, made absolutely sure I was completely empty after the three month check up and my wife and I have never had a pregnancy scare once. Thanks to my work insurance it was only 45 bucks rather than 1000. We're perfectly fine with our cats.",
   "created_utc": 1693069295,
   "score": 7,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxup135",
   "message": "Getting my amazing pupper, Spud the whippet. After leaving a horrible, toxic rship, my self-worth was in the gutter and I sank into a deep depression.\n\nFor over a year, I barely ate, washed, FUNCTIONED. And then when I was a little better, I got Spud and she has made me a LOT better. She has taught me unconditional love, a unwavering sense of belief in myself - she is never disappointed in me - and that life is worth living for myself, as well as her.",
   "created_utc": 1693070371,
   "score": 6,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv1kjk",
   "message": "Ending a 12 year friendship. They were toxic, emotionally abusive and manipulative. Felt so much fucking relief when I ended it.",
   "created_utc": 1693075466,
   "score": 8,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuhjms",
   "message": "Not having kids. My wife and I are very happy. We have all the benefits of dual income no kids. We have time to ourselves, way less stress and we're on track to retire early.  Nobody needs to have kids. Think it through. Your life could be infinitely better without kids.",
   "created_utc": 1693067414,
   "score": 28,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxufg3p",
   "message": "1) not aborting my now 11 years old badass son\n\n2) starting meds for treating my ADHD",
   "created_utc": 1693066564,
   "score": 14,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuuriv",
   "message": "getting an abortion at 19",
   "created_utc": 1693072678,
   "score": 9,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu5cnw",
   "message": "Straightedge tattoo and self-supportive awareness.",
   "created_utc": 1693062602,
   "score": 5,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu5v23",
   "message": "After college I started interviewing for graphic design jobs, and I realized “Oh, this would be excruciating corporate bullshit.” I had a moment in time where I knew I needed to decide between a miserable “grownup” job that pays well after a few years, or just working wherever and focusing on enjoying life.\n\nI wanted to live life, not devote myself to joyless adulthood and a career. I ended up meeting a lot of awesome people, including close friends I still hang out with a decade later, and making countless memories I cherish.\n\nRecently I started focusing on making more money and being a serious adult, and it feels like the right time for that.",
   "created_utc": 1693062806,
   "score": 6,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu6yp8",
   "message": "Started working for myself. I did the exact same job for my old boss , day in day out. They never appreciate what workers do for them . So I went out on my own and never looked back.",
   "created_utc": 1693063247,
   "score": 7,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxubxgo",
   "message": "quit smoking/ substances",
   "created_utc": 1693065183,
   "score": 5,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuhqki",
   "message": "To enlist in the Navy at 27 years old. My life was going nowhere and I needed to do something. Didn't always enjoy being in, but I did 8 years. Traveled completely around the world, got a degree, and transitioned my Navy job to civilian and am doing pretty good for myself overall now.",
   "created_utc": 1693067490,
   "score": 5,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxui1lp",
   "message": "Prioritizing saving in my Roth IRA in my 20s. 20+ years later I’m really seeing the benefits and I’m glad I started when I did.",
   "created_utc": 1693067613,
   "score": 9,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxvf685",
   "message": "left a good paying job is a shitty city for a lower paid job in a better city...\n\nand  because of said job I got early covid shots... and it saved my life as many died around me  including relatives..",
   "created_utc": 1693081149,
   "score": 5,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxueqav",
   "message": "2 of them. 1) to join the military. 2) to leave the military.",
   "created_utc": 1693066277,
   "score": 12,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuc75c",
   "message": "Adopting my first dog from a shelter. He’s an old man now but still the best boy.",
   "created_utc": 1693065287,
   "score": 9,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu3j3p",
   "message": "Moved to Montana",
   "created_utc": 1693061854,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuayok",
   "message": "Joining the military",
   "created_utc": 1693064803,
   "score": 5,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxub1mi",
   "message": "not made yet",
   "created_utc": 1693064834,
   "score": 4,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxubai4",
   "message": "Joining a student association and sorority. I made friends for life (I study in the Netherlands)",
   "created_utc": 1693064931,
   "score": 6,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxubvxm",
   "message": "Joining the US Army.  Got trained in communications tech and realized I really enjoyed technology.  ETS’d, went to school for CS + Math and became an engineer.  Now, I love my job and make a decent wage to boot.",
   "created_utc": 1693065166,
   "score": 7,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuh1hn",
   "message": "Eating more. I was very skinny my whole life. When I got older, I was still ugly and skinny and never had a long term relationship. I wanted to not be lonely anymore, so I started a journey to gain a bunch of weight. My life became consumed by two things, food and weightlifting. After a couple years, turns out I am a much better looking person with some chub on my face. Had some confidence, starting dating lots of girls then met my wife. When I was skinny, I was very unhealthy. I was tired, low energy, no libido, poor mental capacity. Turns out I was basically malnourished. Now I feel amazing and am not lonely anymore.",
   "created_utc": 1693067207,
   "score": 7,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxukbqk",
   "message": "Register to bumble. I met my soulmate, the love of my life.",
   "created_utc": 1693068482,
   "score": 6,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv1kcy",
   "message": "Leaving my ex.",
   "created_utc": 1693075464,
   "score": 4,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv4gq3",
   "message": "Quitting drugs. Best day ever.",
   "created_utc": 1693076661,
   "score": 7,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxueuvv",
   "message": "My son ❤️",
   "created_utc": 1693066328,
   "score": 6,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu27m2",
   "message": "Choosing to let go and experience the world. I was working in the city for few years and then I moved to rural area by myself. I know I’m going to be lonely but I have been making better money, pr approval soon hopefully and trying to upskill and finally do my PhD or MD 😇",
   "created_utc": 1693061329,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxu9zkq",
   "message": "not talking and bothering to fake friends and being able to say no quite easily",
   "created_utc": 1693064424,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuchvj",
   "message": "filing for divorce",
   "created_utc": 1693065405,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxucukf",
   "message": "Learn to say no to big decisions even under immense pressure by people. You don’t have to agree to do anything that’s not fair to you, even if it makes the other person mad yes that’s right.",
   "created_utc": 1693065547,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxucw3a",
   "message": "Not smoking in jr high when all my friends started.",
   "created_utc": 1693065563,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxudm52",
   "message": "Moving out my mom's house at 18. If I could I would have done it sooner.",
   "created_utc": 1693065842,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxugvf8",
   "message": "LASIK.",
   "created_utc": 1693067139,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuhfuu",
   "message": "Not having children in this scary world",
   "created_utc": 1693067370,
   "score": 8,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuhit3",
   "message": "I was 19 and came from a shitty home, met a guy and fell head over heels and was finally happy only for him to sleep with a colleague a few months in. It completely changed me as a person, I spent a few months on strong medication etc and then my mother kicked me out for speaking back to her one night, at that point I felt it best to leave completely. Started applying to universities in England and got into one reasonably quickly, I was ready to go and he contacted me asking for another chance, it had been four maybe five months at that point, so we met and I saw a difference, it felt different, and I gave him that chance. I stayed here. \n\nMany people will call me an idiot etc for doing it, but it's hands down the best thing I've ever done, we're still together 8 years later, married, with a wonderful little girl and our own home. Graduated Uni with a first too. He really is my best friend and I am so, so happy, this is where the little girl I was dreamed of being. Happy.",
   "created_utc": 1693067404,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxulnow",
   "message": "Moving in with my now husband. At the time I was very suicidal due to the death of a significant other. At the time my now husband was just a friend and former co worker of mine. He offered to stay at his place until I got back on my feet because he's never home due to his 14 hr work days. He's done this with some of his friends who are girls as most of his closest friends are women and they suggested to take him up on his offer telling me how much of a big heart he has. He never once hit on me, tried anything, he just came home to me crying and made me a delicious dinner after working so long. I think that's when I started to fall for him. One thing lead to another and now we're married. Best decision of my life. I think it actually saved my life.",
   "created_utc": 1693069012,
   "score": 4,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxumpxp",
   "message": "To stop taking advice from my Mother.",
   "created_utc": 1693069443,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv3we6",
   "message": "Heading to my local flying club. I’ve always wanted to be a pilot, had some highs and lows through the years. Now I’m working towards a license.\n\nYeah I’ll make money doing this someday, but for right now, I am HAPPY. Happier than I’ve ever been!",
   "created_utc": 1693076433,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuikw2",
   "message": "Buying a vibrator. 🤭",
   "created_utc": 1693067827,
   "score": 5,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuawpv",
   "message": "Open a 401K at 16yo",
   "created_utc": 1693064783,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxubkzp",
   "message": "Joined the Peace Corps when I was 23.  Best decision of my life.",
   "created_utc": 1693065047,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuhsob",
   "message": "Can’t think of a single one.",
   "created_utc": 1693067514,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuhw8k",
   "message": "man thats heavy. i was just going to say getting the $10 big box from taco bell.",
   "created_utc": 1693067554,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxui8pl",
   "message": "After my relationship failed at age 18, I took the time to look at what went wrong thoroughly. Turns out that I don't like being in a relationship to begin with.\n\nI'm 40 now, never dated again, never looked back.\n\nBonus: We're still close friends.",
   "created_utc": 1693067693,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxujnyf",
   "message": "Quitting self harm. For hopefully obvious reasons",
   "created_utc": 1693068216,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuls5i",
   "message": "I think I am fucked for not getting any idea",
   "created_utc": 1693069063,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxulxn6",
   "message": "I want to happy others hope best decision I,ver made",
   "created_utc": 1693069125,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuo44c",
   "message": "Penis reduction surgery",
   "created_utc": 1693070002,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxupnr3",
   "message": "To ignore corporate America’s advice",
   "created_utc": 1693070623,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuqitu",
   "message": "Turning my life around and taking care of myself. Cured my depression as a byproduct and my confidence is higher than ever before.",
   "created_utc": 1693070972,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuqrkh",
   "message": "I'm doing it in like a week to ten days. But I'm leaving Canada to go live on a beach for several years. \n\nThis seems like it has the potential to take top spot",
   "created_utc": 1693071070,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv1eh3",
   "message": "Leaving my first wife. She was an overt narcissist with psychotic tendencies and the most extreme level of jealousy I have ever encountered. \n\nI could be having a conversation with friends and their wives while trying hard to include her, only for her to accuse me of flirting and starting a physical fight over my denial only minutes later.",
   "created_utc": 1693075396,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv2xk8",
   "message": "Joining the Marines.",
   "created_utc": 1693076028,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv3mmg",
   "message": "My husband.  Fighting through the hard times together.  Making it work.  Enjoying it.  Laughing together.  He is my team mate and I couldn't imagine life without him.  As we age I find I'm getting more and more worried about losing him.  I just can't imagine ...",
   "created_utc": 1693076319,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv4mz2",
   "message": "Joining the USAF as a 18 year old high school dropout",
   "created_utc": 1693076730,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv5cai",
   "message": "Leaving my job at Walmart",
   "created_utc": 1693077014,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv5fo9",
   "message": "Breaking up with my baby momma",
   "created_utc": 1693077054,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv5hzp",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxvwrqs",
   "message": "Bought a house in 2017. I can barely afford it but the value has doubled.",
   "created_utc": 1693088704,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxudb2c",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuhk4l",
   "message": "Getting sober from drugs and alcohol and recovering from my ED. I thought these things were my crutches for survival but I realised they were destroying my body and my soul.\n\nNo matter how hard it can get at times, recovery is always, always worth it.",
   "created_utc": 1693067419,
   "score": 3,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxufpdn",
   "message": "I file an application for disability social security. It took 6 months, and I got it on the first try. In fact they told me that I should have tried 4 years earlier.",
   "created_utc": 1693066667,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxurnk0",
   "message": "One year stint living abroad, got me out of my shell.",
   "created_utc": 1693071422,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxuwdrb",
   "message": "Probably laser eye surgery. Literally woke up the next day with 20/20 vision, 13 years later still 20/20 vision. It took mere days after the 2-minute operation to completely forget I ever even wore glasses.",
   "created_utc": 1693073339,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv17zf",
   "message": "Every time I chose going to the psych ward over killing myself.",
   "created_utc": 1693075323,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv190x",
   "message": "man thats heavy. i was just going to say getting the $10 big box from taco bell.",
   "created_utc": 1693075334,
   "score": 2,
   "submission_id": "161x14b"
  },
  {
   "comment_id": "jxv1a3f",
   "message": "Learn to say no to big decisions even under immense pressure by people.",
   "created_utc": 1693075346,
   "score": 2,
   "submission_id": "161x14b"
  }
 ]
}