{
 "submission_id": "1623ze6",
 "title": "What is something most people don't know about the Bible?",
 "selftext": "",
 "created_utc": 1693077514,
 "permalink": "/r/AskReddit/comments/1623ze6/what_is_something_most_people_dont_know_about_the/",
 "score": 131,
 "url": "https://www.reddit.com/r/AskReddit/comments/1623ze6/what_is_something_most_people_dont_know_about_the/",
 "comments": [
  {
   "comment_id": "jxv8ehy",
   "message": "The King James Version of the Bible suffered a ton of misprints in its early history.  One of the more famous misprints is the \"Wicked Bible\" or \"Adulterer's Bible\" from 1631.\n\nIt gets it's name from a misprinted version of Exodus 20:14, where the printer omitted the word 'not.'  Thus, the Sixth Commandment in this Bible reads \"Thou shalt commit adultery.\"\n\nIt also has another egregious misprint appearing in Deuteronomy 5: the word \"greatness\" appearing as \"great-asse\", leading to: \"Behold, the Lord our God hath shewed us his glory and his great-asse.\"",
   "created_utc": 1693078272,
   "score": 33,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvmluu",
   "message": "It contains one recipe.",
   "created_utc": 1693084298,
   "score": 102,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvk3p5",
   "message": "There's a talking donkey in the book of Numbers.",
   "created_utc": 1693083238,
   "score": 143,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvluu4",
   "message": "The Bible is actually super metal. 2 Kings 2:23-25. Elisha was a prophet who was traveling from Jericho to Bethel. On the road he gets taunted by \"youths\". Specifically, young men. They called him a \"baldhead.\"  So he turns around and calls down a curse on them in the name of the Lord and two she-bears come and maul 42 of them. And... that's it. No more about this story. Someone thousands of years ago thought this was an important part of Elisha's story. No explanation about what span of time we're talking about. Did these youths just stand still or was this over weeks? No explanation if the maulings were fatal. You don't need to know that. Just don't mock a prophet. Especially with the devastating insult of \"baldhead\".",
   "created_utc": 1693083982,
   "score": 107,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvymgl",
   "message": "The book of Judges is wild. Between Ehud and Sampson you could make a pretty badass action series.",
   "created_utc": 1693089547,
   "score": 132,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvmvxb",
   "message": "There’s a verse about a woman lusting after guys with huge dicks like donkeys and who spew cum in the amount that horses spew.  No joke.  It even makes the horse and donkey comparisons",
   "created_utc": 1693084417,
   "score": 17,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvnnli",
   "message": "The details of prominent characters in the Old Testament. Can’t get your wife pregnant? Why hello new fertile girlfriend.",
   "created_utc": 1693084743,
   "score": 180,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxw5f4w",
   "message": "If you beat your slave to death, then it's a sin. But if he lives for at least 3 days after the beating then you're in the clear",
   "created_utc": 1693092721,
   "score": 109,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxw5mqb",
   "message": "The Bible tells us that titans or giants (nephilim) mated with humans a long time ago (genesis 6:4).",
   "created_utc": 1693092817,
   "score": 213,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxv7nut",
   "message": "There are many apocryphal writings that didn't quite make it into official cannon. Among them are the Gospel of St. Thomas which consists of nothing more than things Jesus said. No commentary, no filler, just Jesus rappin' with his bros. Judas and Mary got their own gospels also.",
   "created_utc": 1693077964,
   "score": 214,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxx0mvh",
   "message": "Mathew 6 5 and 6:\n\nGives specific instructions on not praying in public and tells you to pray in seclusion. \n\n5 And when you pray, do not be like the hypocrites, for they love to pray standing in the synagogues and on the street corners to be seen by others. Truly I tell you, they have received their reward in full. 6 But when you pray, go into your room, close the door and pray to your Father, who is unseen. Then your Father, who sees what is done in secret, will reward you.",
   "created_utc": 1693108131,
   "score": 63,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvpbrs",
   "message": "There she lusted after her lovers, whose genitals were like those of donkeys and whose emission was like that of horses. Ezekiel 23:20 ",
   "created_utc": 1693085438,
   "score": 242,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvvim9",
   "message": "The big difference between Catholic and Protestant Bibles is that Catholic Bibles use the Septuagint as the basis for the Old Testament, while Protestants use the Masoretic Text. The Septuagint is an Ancient Greek translation and would’ve been the one used by early Christians, while the Masoretic Text is the version used in Rabbinic Judaism and was created sometime in the early Middle Ages. The Septuagint has a number of books not present in the Masoretic Text and it’s possible that when it was written there still wasn’t a fully agreed upon canon for the Hebrew Bible. The New Testament canon wasn’t decided upon until the 4th century and there were many writings that were widely read among early Christians that aren’t considered “scripture”. Also, most of the major tenets of Christianity weren’t worked out until the 4th century and there were a much wider diversity of beliefs",
   "created_utc": 1693088142,
   "score": 24,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvu0vi",
   "message": "Old testament goes HARD",
   "created_utc": 1693087473,
   "score": 46,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvsivn",
   "message": "The Jesus in the Bible is pretty goddamn woke towards the less fortunate and marginalized and very resentful of the wealthy thinking riches are a shortcut to salvation.",
   "created_utc": 1693086807,
   "score": 104,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvnbc2",
   "message": "If you made a movie or television show that's 100% accurate to the Bible, it would be rated X\n\nEdit: 666 Upvotes as of this writing",
   "created_utc": 1693084599,
   "score": 205,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvxcx4",
   "message": "Should we talk about the incest (and no I don’t mean Adam and Eve)",
   "created_utc": 1693088968,
   "score": 110,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvn34n",
   "message": "1. There are two stories of creation, one in Genesis 1 and one in chapters 2 and 3. Also two flood stories mashed together. \n2. The \"apple\" in the garden of Eden is actually an unnamed fruit. From what I understand, a pomegranate would be the most likely based on the region the story is said to take place, but please correct me if I'm wrong about that.",
   "created_utc": 1693084504,
   "score": 23,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxw3h4i",
   "message": "Some stories from the bible have such identical themes to sumerian texts that its difficult to believe it wasnt pulled from sumeria",
   "created_utc": 1693091812,
   "score": 111,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvwx8i",
   "message": "There are dozens of great flood myths, much older than the old testament.",
   "created_utc": 1693088771,
   "score": 56,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxw91gz",
   "message": "In Numbers 12 god punishes racism\n\n1: And Miriam and Aaron spoke against Moses because of the Cushite woman whom he had married; for he had married a Cushite woman (a very dark skinned women)\n\n10: And when the cloud was removed from over the Tent, behold, Miriam was leprous, as white as snow; and Aaron looked upon Miriam; and, behold, she was leprous\n\nTranslated by The Holy Scriptures According to the Masoretic Text, the 1917 Jewish Publication Society \n\nThe Bible is frequently used to justify white supremacy but this IMO is the only significant reference to race in the Masoretic Ttext.",
   "created_utc": 1693094409,
   "score": 123,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvsxyv",
   "message": "Shortest sentence in the Bible = Jesus wept.",
   "created_utc": 1693086991,
   "score": 127,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvvkz3",
   "message": "Numbers 5 11-31  \n\nBasically if a woman cheats on her husband, her husband shall bring her before a priest who will give her bitter water. If the bitter water causes a miscarriage she cheated and the \"curse\" will rid her of the fetus. If she didn't then she will stay pregnant.  \nFound this very interesting because it's very obvious that bitter water was a way to prevent or terminate pregnancies and yet people still say the Bible was against abortion.",
   "created_utc": 1693088172,
   "score": 177,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxwzwhe",
   "message": "A lot of stuff that's actually from The Divine Comedy or Paradise Lost is confused with biblical content. The Bible doesn't actually give that much detail about Heaven, Hell, or Lucifer.",
   "created_utc": 1693107712,
   "score": 23,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxwvwhd",
   "message": "Didn't see Deuteronomy 22:28 mentioned yet.\n\"If a man meets a virgin who is not betrothed, and seizes her and lies with her, and they are found, 29 then the man who lay with her shall give to the father of the young woman fifty shekels of silver, and she shall be his wife, because he has violated her. He may not divorce her all his days.\"\n\nSo essentially, if a man finds a virgin and rapes her and is caught, he has to pay her Dad for her and she is forced to marry him.",
   "created_utc": 1693105535,
   "score": 57,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvjoe8",
   "message": "That we don't know who wrote most of it.",
   "created_utc": 1693083058,
   "score": 111,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxw6fh6",
   "message": "There is a wonderful erotic poem named Song of Songs in it\n\n\nhttps://imgur.com/a/RZFnNFW",
   "created_utc": 1693093186,
   "score": 17,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxwt0ik",
   "message": "People who talk about \"an eye for an eye\" for revenge and payback say it comes from the bible. They're partially right and partially wrong.\n\nThere are 3 separate quotes of \"an eye for an eye\" in the old testament commandments.\n\nThe first in Exodus 21:22-25 is specifically in reference to assaulting a pregnant woman who as a byproduct gives birth prematurely. The injury payback doesn't clearly say only the baby's injuries (which will be lifelong) should be paid back but it can be understood to mean that.\n\nThe second in Deuteronomy 19:16-21 is specifically in reference to redirecting punishment for false accusations. Falsely accusing someone is seen as so toxic that the entire punishment that would have been due to the accused would be imposed on the accuser.\n\nThe third in Leviticus 24:19-20 is a general description of justice being a direct payback for harm done to a person. The punishment is proportional and no greater than the level of harm done to the victim\n\nThen in Matthew 5:38-48 Jesus calls on all to rise above that standard and be better than that. This is a really challenging passage for many.",
   "created_utc": 1693104050,
   "score": 16,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvusoj",
   "message": "The serpent in the Garden is...a serpent.  It's described as the most cunning of the beasts.  It didn't get retrofitted into Satan until much later.\n\nCatholics and Protestants have different Bibles.  The Apocrypha is canon to Catholics, but not Protestants.",
   "created_utc": 1693087817,
   "score": 69,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvl8ji",
   "message": "It’s very sexually explicit in places, talks about horse jizz (Ezekiel 23:20), has hilarious direct quotes in a number of translations including “We all growl like bears” (Isaiah 59:11) and “I have food to eat that you know nothing about” (John 4:32), and includes funny names such as Bakbukiah (Nehemiah 11:17), Joshbekashah (1 Chronicles 25:4), and my personal favorite, “their sister Hazzelelponi” (1 Chronicles 4:3). \n\nLeviticus 12 says that a woman who has given birth to a baby girl will be considered unclean for about twice as long as she would have if the baby were a boy.\n\nAlso, once I stopped forcing myself to believe that it all fit together perfectly, i realized that the picture of God in it is so wildly inconsistent that I can’t even participate in a “what if the Christian god existed” thought experiment, because his existence is literally logically impossible considering all the things said about him ostensibly by himself.",
   "created_utc": 1693083723,
   "score": 152,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxwhcvh",
   "message": "God had two she-bears eat a bunch of kids because they teased a guy for being bald.",
   "created_utc": 1693098343,
   "score": 57,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvpg31",
   "message": "The gospels as they are (Matthew, Mark, Luke, John) are not in chronological order, and were all written long after Jesus’ life. The first gospel (Mark) makes no mention of a virgin birth, which is curious.",
   "created_utc": 1693085489,
   "score": 87,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvpwer",
   "message": "It has straight up dark and brooding existentialist literature in it (the Book of Ecclesiastes).",
   "created_utc": 1693085680,
   "score": 23,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxw0pn2",
   "message": "It gives instruction about how to perform an abortion if a man suspects his wife of infidelity.",
   "created_utc": 1693090516,
   "score": 82,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvvqyt",
   "message": "That the New Testament gospels about Jesus's life were recorded about decades later, and not written contemporaneously with his life?\n\nI was shocked to find that out, roughly college age.",
   "created_utc": 1693088248,
   "score": 11,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvxh8n",
   "message": "It’s a translation of a translation of some of the things a committee decided was acceptable thousands of years ago. It’s shocking really how few people understand that.",
   "created_utc": 1693089023,
   "score": 123,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxwlegz",
   "message": "Nowhere in Genesis is it said that Adam is the first human, or that Eve is the first woman. In fact, if you read the first two chapters as chronological, God created humans on the sixth day, and then created Adam later on - which corresponds well with the rest of Genesis, since there were definitely people around not related to Adam (e.g. those that chilled with Caine).\n\nAlso, Adam's name is never mentioned. \"Adam\" literally means \"a man\" or \"a person\".",
   "created_utc": 1693100295,
   "score": 49,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxwffqn",
   "message": "Despite being attributed to Matthew, Mark, Luke, and John we actually have no idea who wrote the gospels.",
   "created_utc": 1693097422,
   "score": 9,
   "submission_id": "1623ze6"
  },
  {
   "comment_id": "jxvvh5u",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "1623ze6"
  }
 ]
}