{
 "submission_id": "1626k8w",
 "title": "What's the most unique or unconventional job you've ever had?",
 "selftext": "",
 "created_utc": 1693083701,
 "permalink": "/r/AskReddit/comments/1626k8w/whats_the_most_unique_or_unconventional_job_youve/",
 "score": 45,
 "url": "https://www.reddit.com/r/AskReddit/comments/1626k8w/whats_the_most_unique_or_unconventional_job_youve/",
 "comments": [
  {
   "comment_id": "jxvs899",
   "message": "I worked in a prison-base nursery program. Basically caring for babies that incarcerated mothers gave birth to. The mothers were with their babies most of the time. But because of things like court hearing and mandatory activities they’d be left with the nursery for a bit.\n\nIt was actually a really amazing program. The pay was shit, but all daycare jobs are like that. \n\nWe had a lactation consultant come by once a week, a social worker stopped by regularly. I only had issues with an incarcerated mother once. We had 1-2 guards during the day. And mothers were still allowed privacy. I was assaulted pretty bad by one lady. And after that I couldnt go back. It really fucked me up. She really did a number on me before a guard showed up. And a couple of the other Moms just watched. Which was probably one of the worst parts.",
   "created_utc": 1693086679,
   "score": 33,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvnl51",
   "message": "Underage buyer for the Virginia Alcoholic Beverage Control Law Enforcement Division.\n\n\nWhen I was 16 (1996) they payed me to buy beer and then an ABC agent would charge the clerk and the store.  And we wouldn’t trick anyone either.   If they asked how old I was, I said 16.   If they asked for ID, I gave them my real ID.",
   "created_utc": 1693084714,
   "score": 53,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvnt4v",
   "message": "Counted magazines in grocery stores and newsstands. I would drive to a store, go inside and count every Time-owned magazine, and their competition. (i.e. People vs. Us). I would write down the totals, and turn the paper in to a regional Time manager. This was in the mid-70s. I made $10 an hour, which was crazy good pay at the time.",
   "created_utc": 1693084805,
   "score": 25,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvw6ne",
   "message": "My junior year of high school I worked as an assistant for a local college student who was essentially a quadruple amputee. Although he had one arm that, while functionally very limited, he was able to use it enough to steer his mobile table-scooter and enough to eat using a fork with a dowel on the end.\n\nI helped him get in the shower, wiped him up after using the toilet, and helped him eat at the cafeteria a few times a week.\n\nIt taught me empathy when most of my peers were (as often teenagers are) very self centered and superficial.",
   "created_utc": 1693088443,
   "score": 20,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvwq6o",
   "message": "Capturing wild bumblebees and then gently gluing tiny plastic number tags on their back",
   "created_utc": 1693088685,
   "score": 19,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvpks9",
   "message": "I was the personal assistant to a rich guy’s Doberman.",
   "created_utc": 1693085544,
   "score": 12,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvpaqm",
   "message": "It must have been somewhere in the mid 90s.\n\nI worked a couple of nights for a transportation company in Sydney, Australia. They employed 4 people for an hour or two every night of the week to do basic math for every package they put in their trucks. The idea being that the volume of the package (a x b x c) and its weight were used by the company to efficiently pack their trucks.\n\nWe used calculators.\n\nI think I only worked there 3 or 4 shifts. I'm assuming at some point the company discovered spreadsheets.",
   "created_utc": 1693085427,
   "score": 11,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvoz60",
   "message": "Work in palliative care in the community for people with less than one month to live",
   "created_utc": 1693085292,
   "score": 5,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvtf6f",
   "message": "Worked in a vineyard tying champagne grapes on wires so each bunch would receive the most sun possible.",
   "created_utc": 1693087200,
   "score": 6,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvwfkk",
   "message": "Peeled labels off frozen lumps of cod - fish processing factory in Scotland. All day 7.5 hrs a day . Not one of my lifes highlights.",
   "created_utc": 1693088552,
   "score": 6,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvxls6",
   "message": "Archeology. Dug up a paupers’ cemetery one summer. Found a full skeleton, excavated, cleaned, documented, and bagged it - EVERY SINGLE DAY.  Took the fun out of archeology for me.",
   "created_utc": 1693089082,
   "score": 7,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvxm6l",
   "message": "Chair crew at a concert venue. \n\nWe’d come in after the show and either set up or take out all the chairs on the main floor of the venue. Nothing else. Got paid in cash and had a couple beers every shift.",
   "created_utc": 1693089087,
   "score": 6,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvyv0u",
   "message": "demolish an old funeral home piece by piece because the guy paying me waned the old wood floors to build a deck around two sides of his house.\n\nnumber 2 job\n\n\nbuilding a deck around two side of a house with wood from an old funeral home.",
   "created_utc": 1693089657,
   "score": 10,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvybbl",
   "message": "Worked for a company that made springs out of glass for NASA",
   "created_utc": 1693089405,
   "score": 4,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw0m9j",
   "message": "Bear Scare \n\nI would chase black and grizzly bears off of oil and gas sites with streamers and bangers, basically dud-rounds designed to scare away wildlife. Sometimes it went well and the bears walked away. Sometimes it went horrible, and we chased bears further into site.",
   "created_utc": 1693090472,
   "score": 5,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw4n6q",
   "message": "I've been into building RC planes since I was a little kid, I grew up in the 70s-80s when the kits were still hand built, which was quite a process.  When I was in college I met a guy who was a professional competitive RC pilot, he had several kits that he wanted to build but didn't have the time with his competition schedule so he hired me to build 4 different planes for him, it was a dream job for me!",
   "created_utc": 1693092360,
   "score": 4,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw4w52",
   "message": "In college, I wrapped Christmas gifts for the holiday season for high end department store customers. I loved it. Doesn’t make a lot of money though, lol. Yes. I got paid to wrap Christmas gifts and make them look pretty. Professional wrapper.\n\n(Once I said that and people were confused because no way would would anyone realistically believe I could ever be a “rapper”.)",
   "created_utc": 1693092477,
   "score": 5,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw763o",
   "message": "I wouldn't call it a job but when I was broke in college I got paid to participate in a study where they hooked me up to an IV, put a gas mask on me and then slid me into an MRI machine to read my brain signals while showing me graphic images while they pumped some sedative/placebo into me from either the veins or gas.... I can say definitively it was not a placebo that I got during that study. It was a strange experience but I got like 200 bucks for food so... worth",
   "created_utc": 1693093528,
   "score": 6,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvl8rs",
   "message": "worked in a morgue",
   "created_utc": 1693083726,
   "score": 8,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvm0n2",
   "message": "Cremationist.",
   "created_utc": 1693084049,
   "score": 4,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvoxpk",
   "message": "I used to do cleaning for a hair studio school. Sweep up the hair, wash the mannequins, clean up spills, clean out hair dye cups etc.",
   "created_utc": 1693085275,
   "score": 4,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvy96y",
   "message": "16 year old.  Before automation was used, my job was to put a coupon in a box of tampons.\n\nSounds easy, but the pace was crazy and it paid extremely well.",
   "created_utc": 1693089378,
   "score": 5,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvzp2l",
   "message": "I'm a theatre technician but theatre was dark during shut down. Instead I built tents in restricted areas on military bases across the country. Saw some cool military tech not available to the public",
   "created_utc": 1693090045,
   "score": 3,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwa6fy",
   "message": "In college I worked at the Arthropod Borne and Infectious Diseases Laboratory (AIDL). Aside from washing dishes, refilling micropipette tip trays, and running the autoclave, it was also my job to take care of the mosquitoes and mice. \n\nI would feed and water the uninfected Aedes aegypti mosquitoes and give them a blood meal by putting a restrained mouse in their cage for 20 minutes (mice are not allergic to mosquito bites). Each day I would remove the cotton wick from the water bottle because the females had laid their eggs on them and save it for later. Then I would take an older wick and put it in a plastic shoebox of water with a lid so they could hatch. The key was catching the pupae at the right time to put them in the mosquito cage before they emerged. If I was off, then when I removed the lid several mosquitoes 🦟 would end up escaping and flying around the room. I then had to try to catch them and kill them before leaving the room so they wouldn’t get out into the rest of the laboratory.  I never even knew what a mosquito actually looked like before working there. I just never caught them biting me. At the lab I would have to wear latex gloves and seal the sleeves of my lab coat by taping them to the gloves. This was because I was putting my hands into the mosquito cage.\n\nWhen new shipments of mice came in it was my job to separate them into new cages and feed them everyday. If a female had babies, I had to rush to separate them from the males so they wouldn’t eat the newborn pinkies. \n\nThe scientists at AIDL were studying Dengue and Yellow Fever, so before I started there I had to get a Yellow Fever Vaccination just in case. I’m sure that didn’t scare my dad any!",
   "created_utc": 1693094940,
   "score": 4,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvplza",
   "message": "Census worker, I worked for 3 months in that position for the Brazilian Institute of Geography and Statistics.",
   "created_utc": 1693085557,
   "score": 3,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvsi4n",
   "message": "Water Filtration tech at Sea World. Worked and managed water quality for everything from the splash pad to the killer whales. Back of house and the areas the guests saw.",
   "created_utc": 1693086798,
   "score": 3,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvxymi",
   "message": "I'm currently directing my first videogame, it's pretty unique enough for me at least!",
   "created_utc": 1693089244,
   "score": 3,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvznf8",
   "message": "Not me but my friend was a lecturer at the London school of economics, a world wide expert in economics, the lead singer of a punk band and worked for a branch of the government (intelligence and national security) investigating cults.",
   "created_utc": 1693090024,
   "score": 3,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw08uo",
   "message": "Counselor at Space Camp",
   "created_utc": 1693090299,
   "score": 3,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw79ga",
   "message": "Commercial diver for sea urchins out of Santa Barbara, Ca.\n\nI also worked  in a dynamite factory outside of Tacoma Wash. After a month of headaches from the nitro I had to leave. I never understood how the other guys could take it.",
   "created_utc": 1693093572,
   "score": 3,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvoa0w",
   "message": "Professional sleeper",
   "created_utc": 1693085000,
   "score": 2,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvya07",
   "message": "I applied for and accepted took a job \"constructing furniture\"....\n\n\nI was a coffin builder, lasted a few weeks and decided it wasn't for me.",
   "created_utc": 1693089388,
   "score": 2,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw2hxr",
   "message": "I am a pest control tech for residential, commercial, and industrial. \n\nI have worked in mortuaries, slaughter houses, mausoleums, fish farms, etc",
   "created_utc": 1693091355,
   "score": 2,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw2nyd",
   "message": "I built hovercrafts for while I learned a lot about laying fiberglass it was tons of fun making every part and then assembling and finally flying it up and down rivers",
   "created_utc": 1693091433,
   "score": 2,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw5zdz",
   "message": "In college, I worked for a researcher/professor who studied genetic mutations. I'd separate fruit flies under a microscope - one pile for two wings, one pile for one wing. Mundane work. It was a work study, and I think I made about $6/hr. Early 2000s.",
   "created_utc": 1693092981,
   "score": 2,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw81a1",
   "message": "Had a few: flown through hurricanes on weather research planes, two unrelated jobs involving handling radioactive materials (nuclear pharmacy technician, and many years later Radiation Effects on Electronics Test Engineer in aerospace), and handling/detonating explosives doing pyroshock testing (again in aerospace).",
   "created_utc": 1693093934,
   "score": 2,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw9ixj",
   "message": "I did Renaissance festivals for a while. Now I grow weed.",
   "created_utc": 1693094640,
   "score": 2,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwdz39",
   "message": "I drove the Zamboni at my college ice rink.\nI was also a wedding DJ in Las Vegas, doing weddings almost every day of the week in many different locations.",
   "created_utc": 1693096733,
   "score": 2,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwis3l",
   "message": "Video game tester for EA Sports as a teenager.\n\nThought it was going to be awesome.",
   "created_utc": 1693099033,
   "score": 2,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvni53",
   "message": "I had sex with women - mostly grannies - for pay.",
   "created_utc": 1693084679,
   "score": 2,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvpz94",
   "message": "A veterinarian once asked me to pinch the bleeding arteries while she performed a C section on a cow.",
   "created_utc": 1693085713,
   "score": 4,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvlsw4",
   "message": "What i do now, Private Assistant.",
   "created_utc": 1693083959,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwgsjq",
   "message": "I dressed up in a Barney Rubble costume to promote a grand opening of s grocery store back in the summer of’97.",
   "created_utc": 1693098068,
   "score": 0,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvn19x",
   "message": "Reverse engineer",
   "created_utc": 1693084482,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvnd70",
   "message": "Amusement Park/hall manager.",
   "created_utc": 1693084621,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvyky6",
   "message": "Public speaking coach for mid-level executives",
   "created_utc": 1693089527,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxvzokj",
   "message": "Hitman. Still at it. (I’m joking of course).",
   "created_utc": 1693090038,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw41en",
   "message": "Worked in a metal foundry. 11$ a hour, had burns all over my arms from the heat and molten aluminum. It was one of the hardest jobs I ever worked and incredibly dangerous, the pay was shit, I ended up no showing and finding something else.\n\nI also seemed to work with a bunch of ex convicts that kept trying me and almost got into a bunch of fights over dumb shit.\n\nMakes me feel bad for felony people because they have to put up with this type of work, it's fucking horrible.",
   "created_utc": 1693092077,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw51qq",
   "message": "human traffic light",
   "created_utc": 1693092549,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw5j5h",
   "message": "I worked for a short term sobering support center as an EMT. It was basically a cross between a drunk tank and a shelter for homeless alcoholics and drug addicts.",
   "created_utc": 1693092772,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw5un4",
   "message": "I was once tasked with pretending to be a suicide bomber, though I didn’t get paid for it so not sure it qualifies as a „job“.",
   "created_utc": 1693092920,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw7fvu",
   "message": "I worked as a portrait artist at a bar. They paid me a high hourly wage and I got tips too.",
   "created_utc": 1693093656,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxw9s1w",
   "message": "Japanese sword researcher for a museum. I would research where, when, and by whom (or which school) made swords dating back hundreds of years. Many beautiful ones and unusual ones. \n\nSecurity at the museum was lax for the staff so I’m sure I could’ve walked out with some and it probably would’ve been years before it was discovered.",
   "created_utc": 1693094756,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwalxq",
   "message": "I was a tech in a small recording studio in the 80s. I have pictures with a bunch of musicians, but in many of them I'm the dorky looking kid with a mop haircut and too tight jeans. Got the job because I could re-solder the MIDI ports on Atari STs and fix almost anything with them.",
   "created_utc": 1693095141,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwar0m",
   "message": "An internship where I helped do medical research for the DoD, wrote presentations for surgeons, and also got to play with a crash sled.",
   "created_utc": 1693095209,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwb8h2",
   "message": "Picked up dead chickens at an egg farm. Not my best moment",
   "created_utc": 1693095438,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwbu57",
   "message": "Did CAD layout for tombstones/monuments.",
   "created_utc": 1693095721,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwbxqp",
   "message": "Fit model. Once designers have prototypes of designs they need actual humans to put them on and see how they fit. I did everything from suit jackets to underwear.",
   "created_utc": 1693095768,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwca3b",
   "message": "Worked as a cut man(woman) for mma and boxing for a few years.",
   "created_utc": 1693095932,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwcf4r",
   "message": "Unique is an absolute, you can't have anything that is the most unique",
   "created_utc": 1693095998,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwe2mm",
   "message": "I injected a pesticide into hemlock trees that worked like an IV to kill a bug that was killing it. Unique and fun. I would hike out into the woods with a couple other people. Hook up the trees. Then sit around for a few hours hanging out and making sure nothing leaked. Then move onto the next set of trees.",
   "created_utc": 1693096779,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxweefv",
   "message": "A race official for one of the AMA's professional racing series.",
   "created_utc": 1693096932,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxweiia",
   "message": "Bar back / bouncer / utility player at a strip club (female strippers).\n\nReplacing pipe in the spent fuel room of a nuke.\n\nInstalling pipe in a ditch next to the puppy room of a pharmaceutical plant (heart breaking).\n\nInstalling the rink at a NHL arena.\n\nInstalling under turf heat at an NFL stadium\n\nMany more!",
   "created_utc": 1693096986,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwes4p",
   "message": "I spent four years as a tour guide for an adventure travel company in Central America, Mexico, and Southeast Asia.\n\nI’ve bribed border officials, paid off drug dealers, evacuated tour groups out of earthquakes, hurricanes, and government coups. I have snuck into countries and gotten deported. I have seen every tourist scam imaginable, and fallen for half of them. I’ve kicked people off tours for bad behavior.\n\nThe stories are endless.",
   "created_utc": 1693097114,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwf9pc",
   "message": "Worked in an adult toy shop.",
   "created_utc": 1693097343,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwfpc7",
   "message": "Clerk in an Adult Store with an adult video arcade. Clean up at close is nasty.",
   "created_utc": 1693097547,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwfrmc",
   "message": "Spreading snow for a movie. They were filming The Shipping News in my home area, a Kevin Spacey movie. We had a freak out of season snowfall that kept them from filming, so they hired locals to spread out mounds of snow to melt faster. What didn't melt they spray painted greed or covered in astroturf mats.",
   "created_utc": 1693097577,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwi4xz",
   "message": "I worked at a Turkey farm processing the birds. Let's just say I put them in a harness to be... hollowed out.",
   "created_utc": 1693098721,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwj5r0",
   "message": "Used to walk polo ponies at Myopia Hunt Club (look it up) between polo matches to cool them down. La Dee Da, La Dee Da.",
   "created_utc": 1693099214,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwk9uh",
   "message": "Dog handler for TV and print work. I had an amazing dog. She had some big-time gigs!",
   "created_utc": 1693099752,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwkxmu",
   "message": "Before I had even graduated high school, I got my first high-paying audio engineering jobs over the summer.\n\nI was in charge of loading in, setting up, recording, tear-down, load out, then proceed to the next show for both the Newport Music Festival (Classical) and the Newport Jazz Festival. \n\nI had just got my license and had a car, and I had like the highest access car pass, so I would just roll up to the back steps of The Breakers, meet up with the Piano Movers, the seat haulers, the caterers, the bartenders, everyone who was crew for the show. But all I had to do was set up some very expensive mics, run cable to somewhere we could monitor, quick soundcheck, then spend the evening getting free drinks (at 17) from the bar, making sure the DAT machines didn't fuck up. \n\nIt was my first taste of working in Pro Audio for real gig money, abusing the system, drinking and doing drugs on the job, but ALWAYS, getting the entire concert with zero issues.",
   "created_utc": 1693100072,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwn6j8",
   "message": "My first job I would open all the letters from return mail for a big company and tick a few boxes depending how angry they got at all the advertising being stuck through their letterbox. Got paid decent, was allowed to listen to music and just vibe all day. Wasn’t bad for 16",
   "created_utc": 1693101169,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwnmkp",
   "message": "I worked on a historic ship museum and lead living history field trips (think colonial Williamsburg except waaaay less fancy) and children's pirate birthday parties.",
   "created_utc": 1693101386,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwqz7x",
   "message": "Cranberry tester for Ocean Spray. I would test them to see how red they were, the growers would be paid based on the color.",
   "created_utc": 1693103034,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxwrz6q",
   "message": "DJ for four years at a gay bar.   I was born to love drag queens.",
   "created_utc": 1693103533,
   "score": 1,
   "submission_id": "1626k8w"
  },
  {
   "comment_id": "jxws2js",
   "message": "When I was like 6 years old I let a biker at a party pull out a baby tooth that wasn't even loose for a dollar.",
   "created_utc": 1693103579,
   "score": 1,
   "submission_id": "1626k8w"
  }
 ]
}