{
 "submission_id": "162aodm",
 "title": "What was the biggest risk you’ve taken?",
 "selftext": "",
 "created_utc": 1693093700,
 "permalink": "/r/AskReddit/comments/162aodm/what_was_the_biggest_risk_youve_taken/",
 "score": 80,
 "url": "https://www.reddit.com/r/AskReddit/comments/162aodm/what_was_the_biggest_risk_youve_taken/",
 "comments": [
  {
   "comment_id": "jxw85z4",
   "message": "Well I don't mean to toot my own horn here, but I once played on the Wii without using the safety strap.\n\nThat's just how us renegades roll",
   "created_utc": 1693093995,
   "score": 135,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwbcgj",
   "message": "got married at only 19. Still married, though, at 63. Same guy lol.",
   "created_utc": 1693095490,
   "score": 86,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxw7qsv",
   "message": "Moving halfway across the country to start over with a new life and new job",
   "created_utc": 1693093797,
   "score": 24,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwco3n",
   "message": "Trusting that fart while stuck in I-85 traffic last week",
   "created_utc": 1693096118,
   "score": 41,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxw9p33",
   "message": "Walking away from my long term relationship",
   "created_utc": 1693094719,
   "score": 21,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwayfj",
   "message": "When I was 30, I traveled to a different country to meet a man I only knew from the internet. That wasn't the smartest thing I've ever done, but I was in love, which for me means my ability to assess risk stops working.\n\nIt worked out, though, and we're married now. ♥️",
   "created_utc": 1693095307,
   "score": 28,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwb8d2",
   "message": "Dropping $2400 for a couple of hours for a lady's time. When you are at this price point, you get what you pay for.\n\nTo Oofinity and beyond.",
   "created_utc": 1693095437,
   "score": 18,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxw7s2h",
   "message": "Mixing drugs and alcohol while on medication.",
   "created_utc": 1693093814,
   "score": 9,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwf4qm",
   "message": "I went for my PhD in a subject I did not study in college. It was a good program, and it felt like everyone else in my cohort and lab hadn't just studied the topic, but excelled in it in college - and in far more prestigious schools than I went to.\n\nBefore I moved for school, I woke up in the middle of the night, sat bolt upright, and thought: \"This is insane, you are sure to fail, you have totally inadequate preparation for this.\" \n\nHonestly, it could have easily gone either way - crushed my ego and wasted years of my life or helped me find my calling.\n\nIt was not an easy road but I had some \"soft\" skills other didn't have that really helped compensate for lack of academic preparation. And everything turned out fine.",
   "created_utc": 1693097278,
   "score": 17,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxw7nsr",
   "message": "finally had the balls to ask out my long term friend who I had been in love with",
   "created_utc": 1693093759,
   "score": 14,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxw7tg0",
   "message": "I said yes.  Now engaged.",
   "created_utc": 1693093831,
   "score": 7,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxw9ktx",
   "message": "Putting my penis in a mouse 🐁 trap 💪🏻",
   "created_utc": 1693094665,
   "score": 3,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxw9vyj",
   "message": "jumped out of a plane, done it a few times now tho :)",
   "created_utc": 1693094807,
   "score": 5,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwhl82",
   "message": "I went parasailing off a cliff in Northern California with my ex.  I totally trusted him. It was one of the most terrifying and Amazing experiences I've ever had.  BTW, I was 66 at the time",
   "created_utc": 1693098455,
   "score": 11,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwdvht",
   "message": "Statistically speaking, driving a car over the past 20+ years.",
   "created_utc": 1693096688,
   "score": 14,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwbcyw",
   "message": "Marriage: epic fail😟",
   "created_utc": 1693095497,
   "score": 3,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwciwq",
   "message": "Not believing in god. If hell is real I'm screwed l🤣🤣",
   "created_utc": 1693096049,
   "score": 13,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwetxl",
   "message": "Left my whole situation and life of 4 years to be with a man that actually makes me happy, its still going well!",
   "created_utc": 1693097137,
   "score": 3,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwf6uy",
   "message": "Moved 1000 miles to take a straight commission job.  Same job 20+ years later.",
   "created_utc": 1693097306,
   "score": 8,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwhw6m",
   "message": "Quit my job without having the next job lined up. Enormous risk that paid off big time.",
   "created_utc": 1693098604,
   "score": 3,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwjatd",
   "message": "Smuggling five pounds of African hash aboard a Navy ship in Mombasa. In a container that WAS carrying Freon-12 from our repair ship over to the ship we were \"fixing\" that night. My partner in crime had grabbed some wood products on the pier and they confiscated that without even looking at the cylinder of refrigerant gas that wasn't in the cylinder. Diego Garcia sailors were paying a HUGE premium when we went back there on our next visit. This was early 80s. Had a blast on the rest of the cruise.",
   "created_utc": 1693099281,
   "score": 5,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwnlke",
   "message": "Adopting my kids. Kids are always a leap into the unknown, even bigger when you know they come pre-marinated in trauma and needs. Best risk I ever took though.",
   "created_utc": 1693101372,
   "score": 7,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwo478",
   "message": "Leaving a six figure job in corporate America to write full time.",
   "created_utc": 1693101627,
   "score": 6,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwa2qh",
   "message": "I saw a girl eating octopus salad at my first cousin once removed's engagement and it was love at first sight.\n\nI secretly wanted a fiance too so I told her I wanted to engage her.  She said yes.\n\nI was 17, she was 20.  My rizz was too strong.",
   "created_utc": 1693094892,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwf043",
   "message": "This morning, the coffee cream in the office fridge had a September 5 expiry date. I used it anyways, so far so good.",
   "created_utc": 1693097218,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxw9516",
   "message": "Posting something political on Reddit.  Spoiler: my karma went 📉📉📉",
   "created_utc": 1693094456,
   "score": 0,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwayl0",
   "message": "Trying to get a motorcycle driving license",
   "created_utc": 1693095309,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwdwwm",
   "message": "Having a kid. He's two weeks now and it scary as hell that I'm a parent now",
   "created_utc": 1693096706,
   "score": 5,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxw7ugy",
   "message": "Went allin on blackjack",
   "created_utc": 1693093845,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxw9x5u",
   "message": "Absolute fucking tech nerd here. My biggest risk was probably installing PriiLoader on a vWii (Wii U) even after being told it'd brick stuff. Only went bad because I set autoboot to a program that opens the Wii menu. Obviously, it went into a bootloop. At least I fixed it, and I have learned.",
   "created_utc": 1693094822,
   "score": 0,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwej3x",
   "message": "Marriage",
   "created_utc": 1693096994,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwg26n",
   "message": "Starting my own business and quitting my job is up there.",
   "created_utc": 1693097716,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwglkf",
   "message": "People who know me would say blowing up UXO.  I would say not loving wisely.",
   "created_utc": 1693097975,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwgom0",
   "message": "Getting married and moving in with my husband",
   "created_utc": 1693098016,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwi4fl",
   "message": "Buying a house sight unseen, and moving to a city I had never been to, with no job, in the middle of a pandemic. It was a huge risk but ultimately worked out great for me.",
   "created_utc": 1693098714,
   "score": 5,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwid76",
   "message": "I listened to my parents, and I wasted my life away.",
   "created_utc": 1693098831,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwiy4m",
   "message": "being born",
   "created_utc": 1693099114,
   "score": 3,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwj5v7",
   "message": "So far ending my lease and moving!!",
   "created_utc": 1693099216,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwjtnp",
   "message": "Buying an apartment with savings and knowing bugger all about the risks of the combustible cladding on the upper storeys.. What's cladding you ask? It's what contributed to the fatal 2017 Grenfell tower fire in London.",
   "created_utc": 1693099534,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwk12e",
   "message": "putting an end to a satisfying but ultimately harmful relationship.",
   "created_utc": 1693099634,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwk91z",
   "message": "I’ve quit several jobs on short notice with no planning and every time it worked out great in the end. \n\nThe time off usually did me a lot of good. And I returned to the workforce ready and eager to work. Mostly because I burned through my savings… but either way…\n\nI also tended to find better jobs after every time. Steadily moving up in pay/position with every job because I have a good resume and I am a good worker, I just get bored of my job very easily once I master it is all, leading to a continuous cycle of me finding a good job, learning all I can, doing it for a while, getting bored, then leaving.",
   "created_utc": 1693099741,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwkevs",
   "message": "I risked my entire life savings to start my own restaurant. I wasn't really confident I knew what I was doing before we opened. I embraced ownership as soon as we opened like a duck to water. My entire life had been leading up to that moment, and it just seemed right. That's not to say I wasn't terrified to death that people would really enter, but as we started going, I realised I did, in fact, know what I was doing (most of the time/occasionally).",
   "created_utc": 1693099820,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwl1f3",
   "message": "Starting a non profit.",
   "created_utc": 1693100121,
   "score": 3,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwl1up",
   "message": "Moved from Minnesota to Washington, all on a promise to have an apartment with my name on it, if I could get there/here “Wednesday by 5PM” it was Monday 6:59 (Minnesota time) as I hung up with the apartment manager. Found out the Greyhound bus was leaving in two hours, and I left. Got to Washington on Wednesday to the apartment and had 15mins to sign the lease.",
   "created_utc": 1693100127,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwl1vu",
   "message": "Studying in Korea by myself with debilitating anxiety and self doubt. It was the best risk I ever took.",
   "created_utc": 1693100127,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwlkv7",
   "message": "I once attached all the flags of the Central Powers from the FIRST world war to my backpack. (The German Empire, Austria-Hungary, The Ottoman Empire and Bulgaria) I was shocked that only a couple people cried “Nazi!” and they were joking.",
   "created_utc": 1693100380,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwlpuj",
   "message": "You generally tend to have a possibility bigger success with more risk, so probably a lot",
   "created_utc": 1693100448,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwmthm",
   "message": "I reconnected with my first girlfriend. Moved her across the country and got married. 5 years later, everything is great!",
   "created_utc": 1693100990,
   "score": 6,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwn3d1",
   "message": "At one point when I was still living in England, my school went bankrupt and had to close. The place we went to after that was pretty shit. And since my parents had spent about 20 years living abroad we all thought it'd be cool to try it out. Now I was expecting somewhere real close for my first time living abroad like Portugal or France. But, instead my parents instantly decided China would be a good idea, despite none of us having been there in our lives except for my dad who visited 20 years prior (and at that point China was like a completely different country). Now after three years of living here I'm still not entirely sure if I regret it or if it was the right move. Certainly made things interesting though!",
   "created_utc": 1693101125,
   "score": 6,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwn856",
   "message": "At 25, I quit my job and moved to another state with my wife (who was fully supportive, but busted her ass to keep a roof over our head the next four years) to go to grad school.  Best decision we ever made.",
   "created_utc": 1693101192,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwn92l",
   "message": "Trusted that it was just a fart.",
   "created_utc": 1693101203,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwnafx",
   "message": "Tried to buy bitcoin on the dip, but lost.....",
   "created_utc": 1693101222,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwnkme",
   "message": "I bought a Ninja ZX6R.  That was even crazier than my Yamaha FZ-09. (These are motorcycles..fast ones)",
   "created_utc": 1693101360,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwonfp",
   "message": "Tesla puts",
   "created_utc": 1693101888,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxworak",
   "message": "Got laid off. Used it as a sabbatical\nTo switch gears. Paid off hugely. Was really hard in the middle of it. Started second guessing my choice. Glad I saw it through.",
   "created_utc": 1693101939,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwq8of",
   "message": "Trusting a girl",
   "created_utc": 1693102672,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwqjy2",
   "message": "Served in the Marine Corps as a combat engineer",
   "created_utc": 1693102827,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwqoao",
   "message": "Sending the crazy text. \n\nYep, he's definitely not into me.",
   "created_utc": 1693102886,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwqx1d",
   "message": "I quit my job and spent every penny I had on a coding bootcamp. I was physically disabled at the time and it was a 80-100 hour a week time commitment. At one point I got so sick I had to be hospitalized overnight, and spent the next week passing out in the back of class from exhaustion. After 3 months of hard work I got a high paying job with great benefits for an international bank.",
   "created_utc": 1693103004,
   "score": 5,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxws0j7",
   "message": "Recently bought an 81 Honda cb750 that hadn't been on the road for a few decades. Got it mostly road worthy and proceeded to do a top speed run on the test ride. 130 mph or so with the wind beating the shit out of me but the bike felt solid.\n\nI went sky diving a few months ago and supposedly during free fall we hit 120mph. Let me tell you how much scarier the motorcycle was lmao.",
   "created_utc": 1693103551,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxws1p9",
   "message": "Moved to another continent to go to grad school. \nI didn't know anyone there, didn't even have a place to live.  I had a week to get it figured out before school started. \nIt was hands down the best thing I've ever done for myself.  I'm so happy I did it.",
   "created_utc": 1693103568,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxws8l8",
   "message": "About a month ago I quit my real job and have become an artist and house cleaner. So far this has not crashed and burned, but I am largely supplemented by the fact that my one steady cleaning client is an over the road trucker who pays me handsomely to clean the cab of the truck, do his laundry, and make him tuna.",
   "created_utc": 1693103667,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwuqwh",
   "message": "Living life as a casual drug user/being on the streets.Never been to jail,many opportunities.Its amazing.Am 60 y.o/f.clean 20+yrs.,but there were rough patches/homelessnes.Everyone I know from back then has done prison time or are dead.Got my shit together w/no support system,and am fine.I often wonder why I made it out-and not them...",
   "created_utc": 1693104931,
   "score": 3,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwuwvt",
   "message": "Trigger warning for psychological abuse, fascism and severe transphobia\n\nI'm currently in the prepping stages of my boldest risk. \nMy parents are psychologically abusive fascists, and I'm prepping to leave asap within the next 6 months because I'll be 18 soon. \nThey aren't good people. They will probably try to manipulate or blackmail me into staying, but my friends and boyfriend are all rooting for me. If it wasn't for my best friend \u0026amp; boyfriend, I would've given up already. \nBtw, I know a lot of edgy teens throw around the word \"fascist\". (This is According to my parents though, so maybe it's not true.) I am not saying this lightly. I am trans \u0026amp; gay, my boyfriend is too. My parents think transgenderism is fake and everyone who claims to be trans is a danger to the public and shouldn't exist / have human rights. They also believe all trans and gay people are going to hell. \nI almost killed myself when I came out to them many years ago because the mental abuse got so bad \u0026amp; they cut me off from 95% of social interaction for two or so years. I am severely delayed in terms of social maturity and have developed serious attachment issues (mostly) because of this. I had to play into the rhetoric of \"it is your mental illness and you're just going through a phase\", and essentially walk myself back into the closet. At least I can somewhat talk freely to ppl now, so long as my parents are not nearby\n\nI'm scared, to be honest. They've raised me to think I can't survive without them. It's only thanks to my teacher that I realized it was a lie, she was also abused as a child and has been supporting me so much. Incase you're wondering why she didn't make any reports, my family has been investigated more than once but I wasn't safe to talk freely. The one time they actually talked to me alone, they believed my parents over myself.",
   "created_utc": 1693105018,
   "score": 3,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxww5yc",
   "message": "Moving to a new state with no job prospects and no friends aside from my SO",
   "created_utc": 1693105675,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwy2ob",
   "message": "Headed to Alaska in less then 30 days. I’ll keep you posted on that risk.",
   "created_utc": 1693106698,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwzyn6",
   "message": "Cocktails of drugs and falling asleep driving through the mountains cause I can't even see the road or cutting my own neck open I can't take this open or just general everyday bad decisions",
   "created_utc": 1693107745,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwzypr",
   "message": "Asked my wingwoman on a date “been married 8 years now”",
   "created_utc": 1693107746,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx0mns",
   "message": "Stock market. Put a lot of money in speculative stocks. Also Crypto.",
   "created_utc": 1693108128,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx0qah",
   "message": "Got married at 18.... 30 years later and she still grudgingly tolerates me more than others \n\nAnother minor risk was having a quick look at a house at the other end of the country, then just buying it using both that and our current house as collateral, selling everything to pay it all off, quitting our jobs and going in blind to a place we knew nobody with nothing lined up but suddenly debt free, three months later Covid shut the world down and if we hadn't taken that chance we would have probably lost everything... again.\n\nChucked in a few different jobs to try something different, my CV looks like a mashup of three different people who can't commit to a single career, would recommend doing it but be smart about it, speaking of CV's mine isn't a work of fiction but it leaves out some interesting things too, it flows but some dates are a touch off.\n\nMost risks are calculated somewhat, mostly, kinda, usually... some aren't, some you'll get away with, others will bite you on the arse, but you'll gain nothing but regrets if you don't take the opportunities that pop up from time to time.",
   "created_utc": 1693108183,
   "score": 2,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwsiun",
   "message": "posting a vent post into a non-venting subreddit",
   "created_utc": 1693103807,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwske6",
   "message": "Managed my buddies gold and silver store. It was small time so not difficult. And customer service has a new meaning to it when you have the capability to tell to \"get the fuck out.\"",
   "created_utc": 1693103828,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwsma2",
   "message": "I quit my job, shipped my car, and moved out to Los Angeles in one weekend. Don't regret it but I'm not in L.A. anymore lol",
   "created_utc": 1693103854,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwsn82",
   "message": "I really thought about just chilling, yet I finished the race first. Worst. Mistake. Ever.",
   "created_utc": 1693103867,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwta4a",
   "message": "Walked out of my job at the post office without a backup planned. As I was taking inventory and checking my options a literal hour later I got a call for a job interview at a place I applied to, i go in and got hired on the spot.",
   "created_utc": 1693104185,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwtshy",
   "message": "Left a six-figure private sector job to work on a presidential campaign. Took a huge pay cut and lost career stability, but it made me happy.",
   "created_utc": 1693104445,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwtvxu",
   "message": "Moving to a country where I knew no one and didn’t know the language. I was fortunate that the people I paid to find me a job really did find me a job, and I didn’t just get trafficked.",
   "created_utc": 1693104495,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwtycy",
   "message": "Drafted Reece James in my fantasy Premier League team",
   "created_utc": 1693104530,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwudas",
   "message": "Went skydiving once in my early 20s. So probably that.",
   "created_utc": 1693104736,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwuob5",
   "message": "Took the last cookie in the jar. So worth the ass whooping I got.",
   "created_utc": 1693104894,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwvme3",
   "message": "Climbed a mountain in my grandmother's backyard as a kid, a few times. One side was relatively easy,the other was cliffs. Decided to go down the cliff side one day, it went wrong and I got lucky.",
   "created_utc": 1693105389,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwvqkt",
   "message": "No comment",
   "created_utc": 1693105450,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwvwja",
   "message": "It makes me uncomfortable to think about it.",
   "created_utc": 1693105536,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxww53y",
   "message": "Took about 8 Ativan in my early 20s. I wasn’t thinking, just sad and and angry and trying to numb the pain and not cut myself. I had never taken more than 2. I took enough to sleep through a whole fucking party that happened around me. My roommate was apparently there, and thought I was just giving everyone the silent treatment and pretending to sleep. I’m glad I woke up in the morning. I’m 39 and it still haunts me to this day. I wasn’t trying to end my life.",
   "created_utc": 1693105662,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxww7pc",
   "message": "Talking absolute filthy shit to my abusive alcoholic “father”. Told him ever single reason why my family and I hate his guts, and when he told me he was going to beat my ass, I told him I dared him to and that I would call cps on his ass if he did. It got pretty heated. \n\nHe’s rotting away in Georgia now, aka all the way across the country from us. I haven’t spoken a word to him in over a year and it was the best thing I’ve ever done.",
   "created_utc": 1693105701,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwwgrs",
   "message": "No rubber with a one night stand.",
   "created_utc": 1693105838,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwwi6v",
   "message": "The potentially wet fart I went ahead and squeezed out.",
   "created_utc": 1693105858,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwwj0c",
   "message": "I farted once forcefully",
   "created_utc": 1693105871,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwwrqq",
   "message": "Took a job in the bad part of town, where the busses stopped running an hour before my shift ended. Most muggings can be avoided by looking behind you frequently and running quickly when neccessary.",
   "created_utc": 1693105999,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwxdr6",
   "message": "Banging your mother",
   "created_utc": 1693106327,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwxkur",
   "message": "Moving across the country mid-way through university.\n\nIt paid off in some ways (I became WAY less shy), it was a huge mistake in others (fractured my spine and crippled myself for life).",
   "created_utc": 1693106433,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwxn40",
   "message": "Joining the military",
   "created_utc": 1693106467,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwyrx0",
   "message": "quit my job to start a crypto company with friends. got scammed. worked for free, company was a scam. crypto is a scam. learned linux tho.",
   "created_utc": 1693107086,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwz620",
   "message": "Believing in The Lord Jesus Christ!",
   "created_utc": 1693107303,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxwz85g",
   "message": "Buying an Audi with 250k miles",
   "created_utc": 1693107335,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx00us",
   "message": "Getting drunk when i turned 15 during covid season. My brother all this time though i had covid💀💀",
   "created_utc": 1693107781,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx0d6d",
   "message": "My wife and I having a baby together.  Now it’s not just 2 of you.  Plus you got to feed, educate entertain the kid, etc.   I mean when we got married I had like $5k to my main so didn’t think I was risking that much getting married.  Kids though I was responsible for till 18 years old.",
   "created_utc": 1693107976,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx0s2g",
   "message": "Moving half way across the world at 23 and putting all my money and quite a bit of money I got from my parents into a company I started with my friend it’s worked out pretty well though",
   "created_utc": 1693108211,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx0ss8",
   "message": "160 mph on a plugged tire 😂",
   "created_utc": 1693108223,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx10a2",
   "message": "licking a battery, I had no clue what voltage it was and still dont",
   "created_utc": 1693108339,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx14xf",
   "message": "Eating Taco Bell then trusting a fart while wearing khakis.",
   "created_utc": 1693108413,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx1r19",
   "message": "Giving the relationship w/ my x a second chance. We’re now married w a toddler :)",
   "created_utc": 1693108769,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx1xui",
   "message": "A few years back I felt like I was the only one keeping my relationships alive . I stopped texting my friends first and instead said I’ll wait for them to text me first . I went from about 15 friends to 1 .",
   "created_utc": 1693108880,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx2g3e",
   "message": "Moving from coast to coast to be with my now fiance, worked out",
   "created_utc": 1693109176,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx2ltv",
   "message": "Drove 45 minutes to hook up with a dating app match who was a total stranger. Worked out okay, helped me learn some things about myself and what I need to work on.",
   "created_utc": 1693109267,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx3pl8",
   "message": "Meeting a stranger on yahoo! answers and ended up flying across the country to meet and be with him. I had a one way ticket and kinda just stayed. We ended up being together for 3 years.",
   "created_utc": 1693109932,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx43xn",
   "message": "Randomly kissed my crush at a party She said yes 14 years ago",
   "created_utc": 1693110169,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx495k",
   "message": "Going way out into the ocean in large waves alone, my surf spot was about half a mile out over a reef and the waves were massive. I caught a few (smaller ones on that day, still formidable), lost my board, swam for a very long time, found my board, caught a couple more, then hit a rock with my board on the last wave going in, I was almost in at that point.",
   "created_utc": 1693110258,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx5b0u",
   "message": "I don't experience risks as humans do, but I'm here to help you with any questions or topics you'd like to discuss! Is there something specific you'd like to know about risk-taking?",
   "created_utc": 1693110901,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx5v1z",
   "message": "I haven't quite taken it, am on the verge:  \nCutting off contact with my mother, who was involved in my abuse for many, many years. Scared as fuck, am ready to do it.",
   "created_utc": 1693111242,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx6mtl",
   "message": "Quit my full-time job in Sweden and moved to Australia. I used all my savings on visas and starting a new life far away from my safety net. Seven years later, I'm still in Australia and will soon get my citizenship :)",
   "created_utc": 1693111732,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx6nyk",
   "message": "Spent all my savings to disappear on a solo trip for a month. Stayed with a friend of a friend in Minneapolis, at a random hostel in Glacier, with internet strangers in Seattle, an acquaintance in Portland, and a friend in San Francisco. Was alone for the vast majority of the trip as a 20-something. I very easily could have met some terrible fate, but at that point in my life, I didn't care whether I lived or died.\n\nGlad everything turned out for the best. I'm doing better now.",
   "created_utc": 1693111752,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx6r24",
   "message": "Almost getting married when I was strongly against it. I really cared about a woman I used to date and she gave me the classic marriage ultimatum. I gave in and proposed because I didn’t want to lose her. Big mistake. The planning process made me realize I was a fool. Never been more stressed out in my life. It took my BP going through the roof to finally call it off.",
   "created_utc": 1693111807,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx7l9x",
   "message": "To set the stage I need to give a few examples in my life. \n\n1.I got in a fight with a smaller guy than me.  I had never been in a real fight.  Then as he was choking me, I saw my vision start to narrow and I realized, this guy might kill me, accidentally or accidentally on purpose.\n\n\n2. Years later my buddy Pete and I were driving in a dust storm.  We slowed way down because we couldn't even see the end of the hood of the car.  We turned off the road because we didn't want to get hit by someone else, like a semi that was taller.  When the dust storm passed, we got out of the car and looked around, where is the road?  We apparently drove about a quarter mile off the road with rocks and trees and ravines.\n\n3. I was working on a radar antenna out in the dessert all by myself.  Nearest human was 10 miles away.  I had my arm inside an access panel when the software glitched and the thing spun around 360 in less than a second.  It could easily have ripped of my arm and I would have bled to death before anyone would have thought to check on me.\n\n4.  I took skydiving lessons and jumped out of a plane 5 times solo.\n\nSo now what is the biggest risk I have ever taken?\n\nI left my first wife, quit my job, and had no plan whatsoever.  She cleaned out the checking account and maxed out the credit card.  I had no car, she had caused me to alienate all my old friends.  I was not on speaking terms with my family.  So I go down to a homeless encampment.  The first night I am there, with all of my possessions in two garbage bags, the cops bust a homeless guy for something.  The rest of the camp is sure that I am an informant.  They have active discussions about what they are going to do to me.  It was the longest night of my life.  When the sun came up, I waited until I was off to one side and I ran faster than I ever had before.",
   "created_utc": 1693112349,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx9866",
   "message": "Almost everywhere I have moved to, I have never visited before. So, around 12? A couple of different countries, many cities in the US, etc.",
   "created_utc": 1693113441,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxx9m40",
   "message": "Marriage. I lost.",
   "created_utc": 1693113708,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxxa7ge",
   "message": "Emigrating. No regrets.",
   "created_utc": 1693114121,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxxc1wx",
   "message": "Randomly quit my job of 9 years and went back to school at 30. Graduated this year and was hired immediately earning double my previous salary. Everyone thought I was going to fail. I’m so glad I took the risk and didn’t let my anxiety keep me stuck.",
   "created_utc": 1693115424,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxxdrt4",
   "message": "I think that most people have that time in their life where they just can't keep doing what they are presently doing. YOu see the future and realize you have none..lol\n\nI quit a solid job, moved away from friends and family, on a coin toss/chance that a job would not turn out to be vaporware (it was) and that I could live off the employment insurance long enough to find another job ( I couldn't). iT was a frightening start but eventually I got on my feet and did very well. But that was a decade later.  I made the right decision for mer. But being homeless for a summer didn't make me feel like I did during the 2½ years of pain, disappointment and social outcasting.",
   "created_utc": 1693116692,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxxdwmu",
   "message": "Taking LSD, MDMA and DMT on separate occasions with friends but supplied by people I barely knew and in hindsight probably weren’t very trustworthy. Can’t say I regret taking these risks, because they paid off. However it could have easily gone the other way.",
   "created_utc": 1693116794,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxxeemz",
   "message": "I used to sell a lot of weed in my mid 20s and the lack of self preservation tactics I used was ridiculous. I'd give my number to anyone, I'd let people in my house to buy it that I'd never met before and used to keep large amounts of product and money just lying around in my house that I'd hardly ever lock the doors of. My only rule was noone under 18. How I didn't get arrested and robbed is beyond me. This all started while I was on a good behaviour bond for drug possession charges too",
   "created_utc": 1693117174,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxxi8q0",
   "message": "Looking at this post",
   "created_utc": 1693120134,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxxj2kj",
   "message": "Getting married",
   "created_utc": 1693120786,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxxkwib",
   "message": "I don’t do that. 😐",
   "created_utc": 1693122243,
   "score": 1,
   "submission_id": "162aodm"
  },
  {
   "comment_id": "jxxlth9",
   "message": "starting my own business. quitting my high paying engineering job to start my own firm.",
   "created_utc": 1693122981,
   "score": 1,
   "submission_id": "162aodm"
  }
 ]
}