{
 "submission_id": "162bdjx",
 "title": "How did you quit smoking cigarettes?",
 "selftext": "",
 "created_utc": 1693095503,
 "permalink": "/r/AskReddit/comments/162bdjx/how_did_you_quit_smoking_cigarettes/",
 "score": 255,
 "url": "https://www.reddit.com/r/AskReddit/comments/162bdjx/how_did_you_quit_smoking_cigarettes/",
 "comments": [
  {
   "comment_id": "jxwnoht",
   "message": "Got cancer, pretty good at convincing you to stop. Wouldn’t recommend going that route though. All turned out ok in the end fortunately.",
   "created_utc": 1693101412,
   "score": 247,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwnxxe",
   "message": "I read something that said cravings are temporary and will pass shortly, so every time I craved a cigarette, I would tell myself the craving would pass soon. Low and behold, after the craving passed, I didn’t feel like I needed a cigarette.\n\nPlus I hated how I smelled after smoking a cigarette, so that helped with avoidance.",
   "created_utc": 1693101541,
   "score": 151,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwpdzh",
   "message": "cold turkey combined with cardio.\nthe first month or two sucks but the cardio reminds me that cigs have/has an impact. improving lung capacity during cardio reminds me there is a reason i left them behind. the exercise also helps overcome the inevitable bit of depression that accompanies quitting \n\n25 years. quit \u0026gt;yr ago.",
   "created_utc": 1693102249,
   "score": 69,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwcirb",
   "message": "When I wanted one, I just didn't smoke one. When I did that for about a week I just kinda forgot about them (18 yr habit).\n\nI realize that sounds like a smartass response but it really does work.\n\nNow kratom, that's a different monster. Currently 15 days off the green sludge and finally over the withdrawals.",
   "created_utc": 1693096047,
   "score": 153,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwo0uu",
   "message": "I got up one morning and wasn't feeling very good. You know that crappy feeling in your lungs and throat? I had one cigarette left in the pack. I said to myself, \"I'm smoking it, and then that's it. I'm done. I smoked it, and it tasted bad. That was it. I didn't tell my wife or anyone else. I just quit cold turkey. It was hard, no question. 28 years of lighting up with a cup of coffee,  a glass of beer, after meals, when I picked up the phone, when I got into the car. It took a major shift of habits to do it. The first 6 months were the worst. But when I realized that my senses of taste and smell were coming back, it got a lot easier. I still occasionally have a dream about smoking, but I've always told myself that I was an addict and that one backslide would ruin the whole thing. Never quit quitting.",
   "created_utc": 1693101580,
   "score": 56,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwxh3l",
   "message": "My then boyfriend said he couldn’t handle the smell and I wanted him to stop drinking multiple big red bulls so he wouldn’t have a stroke so we agreed to stop and we both did cold Turkey. This month was 14 years together 😅",
   "created_utc": 1693106377,
   "score": 27,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwhae0",
   "message": "I used my laziness to my advantage. I had half a pack left after I got off work, didn't feel like stopping by the gas station on the way home so I said I'd pick some up tomorrow, then next day I just decided to see how long I could go without one. It sucked for sure but after the first week, sunk-cost fallacy kicked in (If I go back now this whole shitty week will have been for nothing) and it's been almost 11 years now. Carton a week to 0. Anytime I tried to ween myself off I always went back, had to just cut it out completely.",
   "created_utc": 1693098310,
   "score": 45,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwfrp9",
   "message": "I had a kid. Seriously, I saw my wife's ultrasound and decided I wanted to live to see my daughter grow up. She's 2 years old now and her sister is almost a year old. This is probably the best decision I've made in my life. Smoked 18 years. I just hope I stopped early enough.",
   "created_utc": 1693097578,
   "score": 52,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwmz0i",
   "message": "Allen carr easy way to quit smoking definitely helped",
   "created_utc": 1693101066,
   "score": 46,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwl59r",
   "message": "I watched friends \u0026amp; coworkers die from smoking related causes. Witnessed my mother spend the last decade of her life tethered to an oxygen tank. I read the tea leaves.\n\nSmoke-free since 2012. Cold turkey. If my weak ass can quit, so can you.",
   "created_utc": 1693100172,
   "score": 14,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwvnv4",
   "message": "Sunflower seeds and hate",
   "created_utc": 1693105410,
   "score": 12,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwtgs0",
   "message": "Get yourself a Mason jar and a pack of cigarettes. Smoke the pack, and put each butt into the jar. When the pack is gone, put enough water in the jar to cover the butts. Anytime you want a cigarette after that, pop the top and smell the jar. You won't want a smoke after that. Super gross. Worked like a charm",
   "created_utc": 1693104279,
   "score": 10,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwmlm6",
   "message": "Spite. On Halloween I told a coworker I was quitting as a New Year’s resolution. She laughed at me and said “okay” sarcastically. Quit that day in 2018.",
   "created_utc": 1693100882,
   "score": 9,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwxvtl",
   "message": "Smoked for 10 years.  Got a horrible virus with a sore throat and couldn’t smoke for 3 days.  At that point I knew I was over the hump and never started up again. That was 30 years ago.",
   "created_utc": 1693106594,
   "score": 9,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwxdb7",
   "message": "Allen Carr - easy way to stop smoking",
   "created_utc": 1693106320,
   "score": 21,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwp42u",
   "message": "I got pregnant and quit for the baby, I tried smoking one after I gave birth but it was disgusting and I quit completely.",
   "created_utc": 1693102113,
   "score": 7,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxx1581",
   "message": "I quit on my 30th birthday with 2 mindsets: (1) For the rest of my life, I want to say that I only smoked in my 20s. (2) If I want to buy a house, I need to quit. One year later, I bought a house. The patches also helped tremendously. And I also looked at the app “QuitNow” almost daily. And just an fyi - I smoked almost 2 packs a day for 12 years. Been 806 days since my last cig.",
   "created_utc": 1693108418,
   "score": 7,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxx36iz",
   "message": "I quit drinking.",
   "created_utc": 1693109613,
   "score": 7,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxww8s9",
   "message": "I just stopped doing it. Every time I smoked a cigarette I just imagined in my head the damage it was causing my heart and lungs and that was enough for me to not do it again.",
   "created_utc": 1693105718,
   "score": 5,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxx8geu",
   "message": "Stopped all associated activities. Looked forward to my first cigarette and coffee, so I switched to tea. Cigarette after a meal? Took a walk instead. And stopped cold turkey. But quit several times before it took. And it’s been @35 yrs.",
   "created_utc": 1693112917,
   "score": 5,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwhhyw",
   "message": "Switch to vaping, over time reduce the amount of nicotine in the liquid until you're vaping 0%, then quit vaping",
   "created_utc": 1693098412,
   "score": 17,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwo0n1",
   "message": "I started vaping B)",
   "created_utc": 1693101577,
   "score": 15,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwo0xd",
   "message": "Started vaping.",
   "created_utc": 1693101581,
   "score": 14,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwpayd",
   "message": "For me it was vanity, black coffee with apple blow pops, and a whole lot of serenity prayer that got me through the first 30 days. Then it was running 3 times per week, 1-3 miles, along with nightly malts and Tom Clancy books.",
   "created_utc": 1693102208,
   "score": 6,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwqhbm",
   "message": "Umm I use those nicotine pouches, like chewing tobacco,  using for a year now and I can't tell if it's better or worse.. because now I prefer these over smoking, but I use them nearly constantly.. and spitting is kinda nasty.. but I can breathe... so there's that..",
   "created_utc": 1693102790,
   "score": 6,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwsotv",
   "message": "Had a heart attack at 41..",
   "created_utc": 1693103889,
   "score": 5,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwk0u6",
   "message": "I smoked for over 40 years and I was a heavy smoker.  I decided I had to quit, I was getting bronchitis and my doctor said if I didn’t quit I would have chronic bronchitis.  My cigarettes were up to $50 a carton too.  I read a book called The Easy Way to Quit Smoking by Allen Carr and I quit smoking.  It wasn’t really as hard as I thought it would be, I had tried to quit many times before and I’m really not sure why it took this time.  Maybe just a combination of it all.  I haven’t smoked in 14 years.  Good Luck but I will say that it is doable.",
   "created_utc": 1693099631,
   "score": 8,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwprkb",
   "message": "Allen Carr",
   "created_utc": 1693102436,
   "score": 13,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwbpbx",
   "message": "By realizing anything you put in your body will affect who you are, you are what you eat, smoke, drink etc",
   "created_utc": 1693095659,
   "score": 26,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwdxkf",
   "message": "Everyone I know that successfully quit switched to a vape and slowly weened off nicotine over several years.",
   "created_utc": 1693096715,
   "score": 19,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwpgd6",
   "message": "When I really wanted to stop I used the gum and lozenges to ease the crave. 8 years free and cigs smell like death to me.",
   "created_utc": 1693102282,
   "score": 4,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwsl98",
   "message": "I took Chantix. It's also an antidepressant. I smoked while on it until they tasted horrible. Stopped at that point.",
   "created_utc": 1693103840,
   "score": 4,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwuxpb",
   "message": "I made a game of it.  None before 7am or after 10 pm, then after 3 days I'd make it 8am and 9 pm etc.  It was a good way to cut back, even if you don't quit completely.  Eventually, you're down to like 4 a day, and you're done.  Most smoking is just repetitive.  If you really only had one when the craving hit, it would probably be about 6 a day.",
   "created_utc": 1693105029,
   "score": 5,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxx4whc",
   "message": "Quit after 40 years - cold turkey. Incentive was my apartment was going smoke-free. Did not want to move. After my last cigarette I threw out everything smoking related. Got a box of store-brand Nicorette mints just in case. Returned them unopened after a month when the worst was over. Just sheer willpower.",
   "created_utc": 1693110653,
   "score": 4,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwbk9p",
   "message": "Zyn Pouches",
   "created_utc": 1693095593,
   "score": 6,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwjmpy",
   "message": "I’m using chantix. I have personally noticed mental downsides to it, and a few crazy dreams, but I’m powering through it and talking about my feelings. \nAlso using a vape for now. Then will end with the lozenges.\nGood luck!",
   "created_utc": 1693099440,
   "score": 6,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwlolt",
   "message": "Bupropion, literally just turns off the want.highly recommended.",
   "created_utc": 1693100432,
   "score": 6,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwlcp0",
   "message": "Cold turkey. Said I quit one afternoon and gave them away to my friends, they laughed at me and I said I was done killing myself. Never smoked one since that was over 30 years ago. I smoked 2.5 packs a day for two years.",
   "created_utc": 1693100271,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwlzik",
   "message": "Cigarettes: Broke up with my ex-girlfriend and in that process realized something that we did together was not healthy.\nNicotine: Still working on it but the lungs feel better after 10+ years of regular pack/day",
   "created_utc": 1693100581,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwmwhb",
   "message": "Followed the ACTUAL INSTRUCTIONS on the nicotine gum.",
   "created_utc": 1693101030,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwqaaw",
   "message": "Stuck in a hospital bed for a month for an unrelated reason. The nurses offered patches but I declined. When I got out, even if I wanted any, I was too frail to walk to a store to get any on my own. I picked it up again a few years later but was able to go cold turkey by remembering my previous success.",
   "created_utc": 1693102694,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxww62v",
   "message": "Bad cold. Always refrained from smoking during a cold because it hurt. Two weeks later I got better and then I'm home free.",
   "created_utc": 1693105677,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxww9f8",
   "message": "I practiced. \n\nI quit with gum. Relapsed\n\nI quit cold turkey. Relapsed\n\nI quit with mints. Relapsed\n\nI quit cold turkey. Relapsed\n\nI quit with the patch....\n\n30 years smoking, 15 years without.   Just keep trying",
   "created_utc": 1693105727,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwwfqb",
   "message": "Allen Carr Easy Way to Quit Smoking",
   "created_utc": 1693105822,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwwpcx",
   "message": "I went cold turkey. I had tried at least 6 times before through various means. Tried to dwindle down, didn't work. Tried chantex, I felt like a ticking bomb didn't take much to make me get angry and I didn't like that. I tried patches, just didn't help. After I got out of the Marine Corps I just stopped and I never picked one up again.",
   "created_utc": 1693105964,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwxu0c",
   "message": "Vaped for a little bit, until I stopped craving cigs. Then weened myself off vaping",
   "created_utc": 1693106568,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwy22z",
   "message": "Heart Attack at 44",
   "created_utc": 1693106689,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwyx2b",
   "message": "Juul. I got 2 other buddies that quit with it. \n\nPrior to it I tried quitting everyway under the sun, it's a great thing. Just breaks my heart to see it being thrown under the bus all the time, but I get it. Maybe mango isn't the best place for an electric cigarette lol",
   "created_utc": 1693107165,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxx1x8p",
   "message": "caught covid",
   "created_utc": 1693108870,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxx3e8x",
   "message": "Bought a brand new pack, packed it, left the wrapper sealed, every time I wanted one I would pull it out and remember why I didn't already open it (because I told myself I didn't want to smoke anymore when I packed em) and after a few days of that, gave em to a buddy who smoked and was just.. done.",
   "created_utc": 1693109740,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxxdlq3",
   "message": "Allen Carr Easy Way to Stop Smoking. It is actually easy. And then if I ever think of smoking (or eating when I’m not hungry, for that matter), I breathe in through the nose for 4 counts, hold for 7 and exhale through mouth for 8 counts X 3. I don’t think most people realize how much the relaxation of smoking is due to the deep breathing - that book and the deep breathing has made quitting easy. I don’t envy smokers at all.",
   "created_utc": 1693116566,
   "score": 3,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwdeex",
   "message": "Hypnosis",
   "created_utc": 1693096468,
   "score": 4,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwew67",
   "message": "juul , then cold turkey, i smoked for 12 years and mainly enjoyed marlboro reds and/or newports. They just got wayyy too expensive for me, wasn’t fully for health reasons but im glad i did.",
   "created_utc": 1693097166,
   "score": 4,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwxniy",
   "message": "The Easy Way to Quit Smoking by Allen Carr\n\nIt tells you at the start to keep smoking until you finish it. It's not a long book or a hard read at all but it took me 6 months to get through it. I just wasn't ready to quit yet.\n\nThe moment of putting out my final cigarette was the biggest wave of relief and weight off my shoulders. Anytime I get a \"craving\" it's a reminder of how much better my life is instead.",
   "created_utc": 1693106473,
   "score": 4,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwbm3t",
   "message": "I tried many times over the years then finally didn't return back to the habit.  It wasn't easy.",
   "created_utc": 1693095616,
   "score": 5,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwlmx4",
   "message": "Got hospitalized with pneumonia and almost died. \nFast forward 9months I was drinking with friends and they were all smoking. Needless to say I’m a smoker again.",
   "created_utc": 1693100408,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwlzrt",
   "message": "The patch",
   "created_utc": 1693100584,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwmiz5",
   "message": "Through blood sweat and tears",
   "created_utc": 1693100846,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwmpjz",
   "message": "I quit cold turkey 20 yrs ago it was really hard though.",
   "created_utc": 1693100935,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwn9am",
   "message": "Self discipline, a cinnamon stick and nicotine gum.",
   "created_utc": 1693101206,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwo2bk",
   "message": "Cold turkey or taper off. \n\nI used to smoke a pack a day a long time ago. Switched to vape for a while. Then decided I wanted to start weening down. Started from 12mg, then to 6, then to 3, from there I got bottles of 0mg juice, and a bottle of 3mg. I’d mix them to make 1.5mg then to .75mg etc etc. all the way down to 0. Then it was just a matter of not having that oral fixation anymore.",
   "created_utc": 1693101600,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwo8dp",
   "message": "My daughter begged me for years to stop. Around 2010 I walked into a vape shop and haven’t smoked since.",
   "created_utc": 1693101682,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwoae7",
   "message": "A cancer diagnosis is pretty damn persuasive",
   "created_utc": 1693101709,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwoyde",
   "message": "Switched to vaping. Then to quit vaping I bought a pack of cigs and smoked like 2 and said fuck it and quit. Then I used affirmations and smoked weed until I didn’t feel like shit anymore. At the end I realized how hard it was and how shitty the withdrawal felt and vowed to never smoke cigs again.",
   "created_utc": 1693102036,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwp439",
   "message": "Remember that cravings never go away, they just get more and more infrequent. I've been quit for 15 years but I'll still occasionally get an urge. Not often, but every few years. \n\nI don't know why, but knowing that ahead is time helped me to recognize cravings for what they were - my body reacting to withdrawing, and not a reason to give up.",
   "created_utc": 1693102113,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwpf0u",
   "message": "Choosing not to do put cigarettes in your mouth. Realize it’s a choice your making, and consciously deciding to not do it anymore. \n\n(And maybe chew nicotine gum until the cravings go away.)",
   "created_utc": 1693102264,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwpkb1",
   "message": "I would smoke half a cig, knock the cherry off, make sure it's out and put the half a cig back in the pack. I made a pack last twice as long. After a while I would feel sated after only a third of a cig, then later just a few drags were enough. One day I took a drag and tobacco suddenly tasted wrong to me, and I was done. I would occasionally feel a mild craving when stressed, but I just fought it, and now the smell of tobacco is wholly unappealing to me",
   "created_utc": 1693102336,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwps7n",
   "message": "Ran out. Never bought anymore",
   "created_utc": 1693102446,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwpwt8",
   "message": "I've been vaping for 2.5 years and slowly dropped the nicotine to 0. It doesn't bother me anymore. I can go all day without vaping.",
   "created_utc": 1693102509,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwpwvr",
   "message": "Playing with my head, I keep on putting in my head how nauseous I was getting by the taste or the smell of it. Doing it often enough, one day i actually gagged, kept on happening until I just got too grossed out. It's been about 6-7 years now.",
   "created_utc": 1693102509,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwq2mi",
   "message": "Cold Turkey. I had a nasal surgery to remove some polyps in my nasal cavity. My husband of 21 years at the time abandoned me a week before my scheduled surgery. I had to go through the recovery by myself. I could barely get out of bed to use the bathroom let alone smoke a cigarette. The pain I was in was damn near unbearable but because the pain was intense it hid my withdrawal symptoms. So as I slowly healed I had gone through withdrawal without knowing it. I didn't want to smoke. I I didn't want to cause any damage to my nose or throat because I never wanted to have this type of surgery again. I accidentally quit smoking after 28 years thanks to my successful surgery to help take care of my allergy symptoms. I haven't smoked in over two years now. I don't recommend my method.",
   "created_utc": 1693102588,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwqa0z",
   "message": "I started vaping instead I know its only a half measure but I feel way better and run 5 miles a day with no breathing issues at all",
   "created_utc": 1693102690,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwqlj7",
   "message": "Pick up a diffrent habit",
   "created_utc": 1693102848,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwqvfu",
   "message": "Smoked for over 30 years.  My goddaughter at her 6th birthday party when I showed up and her mother said \"go give your uncle a hug,\" replied \"I don't want to. He smells bad.\"\n\nI smoked the rest of the cigarettes I had and then never had another one.  That was 1412 days ago (I also downloaded a widget for my phone to keep a running tab of days quit.  It helped to look at in my weaker moments.",
   "created_utc": 1693102982,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwqwo1",
   "message": "Left my toxic relationship and used nicotine patches. Within a month a stopped using patches.",
   "created_utc": 1693102999,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwqx2u",
   "message": "I've never been a smoker but what worked for my mom was having a precocious 5yo that dumped every pack she bought into the house in the toilet",
   "created_utc": 1693103005,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwqyb0",
   "message": "Didnt buy them",
   "created_utc": 1693103022,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwrghe",
   "message": "I smoked for 18 years. I took a week off of work and did push-ups as I was playing FF13. With the controller on the floor. My mind was on the game and my body was busy. I'm by no means a health nut or anything. I had a baby on the way and I needed to quit.",
   "created_utc": 1693103273,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwrhc8",
   "message": "I took a pill. I think it was Chantix? I smoked for 16 year and quit in just under 3 weeks. Have had zero desire to start again in 5 years.",
   "created_utc": 1693103286,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwrl7a",
   "message": "Pack ran out and in the mean time I was hitting my vape with intentions of buying another pack when I got to the store. The vape fell in the water while I was kayaking and I decided to take that as a sign. Couldn’t quit cold Turkey so I bought a vape with refillable cartridges and decreased the nicotine content any time I bought new cartridges for it. Once I got down to a 2.4% nic content I bought a no nicotine vape in order to transition over… currently trying to quit vaping but I haven’t smoked a cigarette in a couple months",
   "created_utc": 1693103339,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwrseq",
   "message": "Started trying to jog",
   "created_utc": 1693103440,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwrt3q",
   "message": "Hypnotherapy. \n\nOne session. \n\n40 cigarettes a day to none.",
   "created_utc": 1693103449,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwsimy",
   "message": "After a decade, I just decided they were gross and quit cold turkey.",
   "created_utc": 1693103804,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwsj6s",
   "message": "Friend bet me a $100 I couldn't quit for a week. Week passed and when my friend came to pay me I said keep the hundred and never picked up another one. He saved me thousands.",
   "created_utc": 1693103811,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwssuz",
   "message": "Smoked half a pack a day for 20 years. I was tired of being out of breath and I knew it was unhealthy, so:\n\n1) I made a plan. In 6 months, on New Years Eve, I will stop smoking\n2) got a vape ready for the 6 month goal with e-liquid with the appropriate amount of nicotine. For me it was 6mg\n3) smoked my last cigarette on New Year's Eve 2015\n4) reduced the amount of nicotine in the e-liquid each New Years\n5) when I got to zero mg nicotine in 2019, my brain kinda clicked, like no more dependence, and I set it down and never picked it back up",
   "created_utc": 1693103945,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwsz9c",
   "message": "I switched to flavored vapes and then used the way they taste when they run low as a deterrent that helped me taper off. Sugar free candy helped shift the focus to stop the vaping.\n\nI'd tried vapes before but they were not these candy flavored ones. I think that they were made to resemble the flavor of tobacco actually made it less helpful of a focus shift.\n\nI'd had some initial success with nicotine patches but they give me a rash reaction and caused me swelling.",
   "created_utc": 1693104033,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwt2cz",
   "message": "Nicotine patch, 12 years ago",
   "created_utc": 1693104076,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwt8jn",
   "message": "A hangover and persistence",
   "created_utc": 1693104162,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwtrp3",
   "message": "Morning sickness helped me kick the habit. It was so revolting I couldn’t have continued if I wanted to.",
   "created_utc": 1693104434,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwu48i",
   "message": "I just quit cold turkey. If you want to quit bad enough you will do it and if not you will come up with excuses not to.",
   "created_utc": 1693104612,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwwcpe",
   "message": "Wet socks and a hurricane.",
   "created_utc": 1693105776,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwyosi",
   "message": "i quit vaping, juul lol. it was pretty easy because i hate fruity flavors. if i hit someone else’s it just made me think nicotine was gross",
   "created_utc": 1693107037,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxx07pn",
   "message": "I started dropping acid. \n\nBut for real, I did it the hard way. Cold turkey. I smoked my last cigarette and it was intentionally not the last in the pack. I gave myself a date to stop, smoked the last one just before going to bed, walked over to the kitchen sink and ran water into the pack and threw away all my lighters and looked for any \"emergency\" cigarettes in my car and did the same at work. It was rough for about two weeks but by doing that, I used the withdrawals as an achievement and a reminder of what they did to me.",
   "created_utc": 1693107890,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxx3eow",
   "message": "Got pregnant",
   "created_utc": 1693109747,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxx9foq",
   "message": "Me scrolling as I smoke a cigarette",
   "created_utc": 1693113585,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxxcli9",
   "message": "Short answer: I got a vape\nLong answer: Started dating this woman who had a couple of kids, was kind of a new thing to me. They always wanted to go out and do stuff so we were always in the car and I felt incredibly guilty smoking in the car with them, so I went out and bought one of those fruity lost Mary vapes for when I was in the car with them, and that started to turn into being in the car nearly all the time, and so I just stopped buying cigs after my first day without them, I eventually switched to vuse because both the flavors available to me taste closer to a genuine tobacco and menthol tobacco flavor than anything else I’ve had so far. Had been smoking cigarettes almost 20 years, I don’t cough up a bunch of phlegm anymore every morning, so I mean idk if vaping is worse than what we’re currently aware of.",
   "created_utc": 1693115818,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxxgm9g",
   "message": "I got really sick with the flu and basically said fuck it, I'm not smoking since I'm in bed 24/7 this week, might as well quit while I'm a few days ahead. I quit cold turkey after 10 years of a pack a day",
   "created_utc": 1693118872,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxy09jh",
   "message": "Got sick of having no money. To help curb the craving, I chewed pen lids",
   "created_utc": 1693134509,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxy0d6x",
   "message": "Quit 13 years ago with vapes, going from 4 MG to 2 MG to 0 MG.  Also quit drinking for 3.5 years as well as certain friends.  Distract yourself for 15-20 min when the urge hits, and eventually it goes away.\n\nTake the money you would be spending on packs or cartons and put in a jar.  After that first year, treat yourself to something nice, you earned it!",
   "created_utc": 1693134582,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxy4mvj",
   "message": "Got strep, couldn't smoke for a week, never started back.",
   "created_utc": 1693137438,
   "score": 1,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxy4mym",
   "message": "Part 1: Realising that you actually want to quit. This can be a struggle in itself, but focusing on the immense freedom you'll get will help.\n\nPart 2: Accept your habit and don't condemn yourself. Being a smoker does not make you weak no matter what society tells you.\n\nPart 3: Meditation. Or more specifically: \"smoking meditation\". Whenever you're gonna smoke, locate yourself somewhere you won't be distracted or disturbed. Light up and whenever you inhale close your eyes and feel the smoke in reaction with your mouth, throat, lungs, head and the rest of your body. Do this with every inhale of every cigarette.\n\nPart 4: The longer you continue doing part 3, the less you'll actually enjoy it and the easier it will be to realise how ridiculous this habit is. This is when you make the decision to extinguish your last cigarette. Keep in mind that few people succeed on their first try. Quitting smoking should be considered a skill as well as skateboarding. Falling is a part of mastery, so don't give up if it doesn't work this time, just start over from part 1. \n\n(When I went through this process I managed to quit 4 times before actually meaning it. It is just as much an emotional process. I hope this helps)",
   "created_utc": 1693137440,
   "score": 1,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxy5hos",
   "message": "just made up my mind and quit, cold turkey, wasn't as bad as I thought it would be, never talked about it with my wife, two weeks later she quit and we never discussed it until years later, once you decide that its over then its easy",
   "created_utc": 1693137963,
   "score": 1,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwx6zm",
   "message": "Stupid as it sounds, and it took me 45 years, the secret seems to be don’t have the first one.",
   "created_utc": 1693106224,
   "score": 4,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwz47a",
   "message": "I tried Chantix, patches, gum, slowly cutting back and cold turkey. Nothing stuck for longer than a few days. Finally, my them 4 year old started hiding my lighters, locking me out of the house and endlessly nagging me to quit. So I got a vape pen and a high nicotine liquid. \n\nSix years later, still vaping. 6mg liquid though. \n\nVaping is awesome and anyone who smokes and wants to quit should try it.",
   "created_utc": 1693107274,
   "score": 4,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwyeoq",
   "message": "Don’t listen to ANYONE saying to start vaping. If you’re worried about damaging your body with tobacco, vaping will make things worse. It’s a whole other animal.",
   "created_utc": 1693106882,
   "score": 4,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwgets",
   "message": "14 years smoker\nI woke up 1 day and i said to myself \"I'm done\" and i stopped smoking that day ( sept 2022) i dotn recommend it tho. The battle with withdrawal and depression is crazy.",
   "created_utc": 1693097884,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwdmhz",
   "message": "Osato convinced me that cigarette smoking is very bad for your chest.",
   "created_utc": 1693096573,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwhtic",
   "message": "Eliminated toxic aspects of my life",
   "created_utc": 1693098568,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwuyup",
   "message": "I tried quitting many times, for a couple of months, a couple of years, one time even for five and a half years.\n\nWhat really made me put them down for good was the day I got diagnosed with tongue cancer.\n\nI had about half my tongue removed, was bombarded with radiation 35 times, infused with platinum based chemotherapy 7 times, list most of my sense of taste, most of my salivary glands, and went about 6 months without a proper meal.\n\nMy jawbone is now dead and my teeth are fucked.\n\nMy issues aside, the secret to quitting smoking boils down to two things:\n\n1.) You have to want to quit.\n\n2.) You have to not smoke.\n\nThe rest is all bullshit.\n\nThe physical addiction is over in four days.\n\nThe psychological addiction may never go away completely. \n\nMy neighbor the nursing professor puts it this way: \"You start smoking when you're a teenager, and you spend the rest of your life trying to quit.\"\n\nHer husband is a hypnotherapist and told be that the biggest indicator of potential success in quitting smoking is having made previous serious attempts to quit.\n\nI think most of us needed five or six genuine attempts to quit before we succeeded.",
   "created_utc": 1693105046,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwxooc",
   "message": "Two weeks of daily cutting back then once down to zero a day lots of Skyrim and candy. Got shakes and flu like withdrawals the whole nine for about 1.5 weeks after. Haven't touched one since. Always want one of I see or smell it.",
   "created_utc": 1693106490,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxwd8nh",
   "message": "I chew them instead, feels good to give my poor lungs a break and a chance to heal",
   "created_utc": 1693096392,
   "score": 2,
   "submission_id": "162bdjx"
  },
  {
   "comment_id": "jxx1367",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "162bdjx"
  }
 ]
}