{
 "submission_id": "162dv8e",
 "title": "What's the worst sex you've ever had?",
 "selftext": "",
 "created_utc": 1693102533,
 "permalink": "/r/AskReddit/comments/162dv8e/whats_the_worst_sex_youve_ever_had/",
 "score": 178,
 "url": "https://www.reddit.com/r/AskReddit/comments/162dv8e/whats_the_worst_sex_youve_ever_had/",
 "comments": [
  {
   "comment_id": "jxx5n3n",
   "message": "He was quiet and seemed uncomfortable the entire time. After he told me I was the first person he slept with since he became widowed so I don't blame him.",
   "created_utc": 1693111105,
   "score": 239,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx575x",
   "message": "I didn't realize I had an ovarian cyst until I started fucking my boyfriend and it popped. I screamed bloody murder and fell down spasming in pain. He freaked out and kept asking what was wrong and if he should take me to the hospital. I could barely breathe but I tried gasping \"no, just wait.\" He was absolutely terrified to fuck me for the next 2 weeks.",
   "created_utc": 1693110836,
   "score": 36,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxwywdn",
   "message": "Not sex but worst sexual moment of my life was when i grabbed boobs for the first time and came in my pants",
   "created_utc": 1693107154,
   "score": 184,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx8fvf",
   "message": "Does oral count? Had a dude bite my clit. I thought the first time was a fluke, like nerves or something. It was in fact not a fluke. I was too stunned to react and was in pain for days. I was legit worried he permanent damaged me because the next time a guy went down on me, I felt nothing. Good news. I’m thankfully not damaged. The second guy just sucked, but not as badly as the first one.",
   "created_utc": 1693112908,
   "score": 82,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx48ta",
   "message": "It’s kind of a dark story, but I’ll sanitize it.  This woman just went from pure bliss to crying and shouting “stop! Stop!” in a matter of seconds.  Scared the shit of me.  I shriveled up instantly, jumped up, and while haphazardly putting on my clothes, heard her laughing.  Apparently it was a joke.  She was laughing, I was shaking like a leaf.  I swear to god, she looked like Regan O’Neil for a split second.  So fucking evil.\n\nFear turned into rage and I quickly exited her apartment without saying much.  She was grabbing me, trying to get me to stay, but nah.  Blocked.  Deleted.  Prayer that the cops didn’t come knocking on my door for some bullshit.\n\nBtw, I’m 36.  This was only 3 years ago.  This wasn’t a teenage thing, we were both adults.  I was  33, she was 30.  Crazy.",
   "created_utc": 1693110252,
   "score": 51,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx9woy",
   "message": "I think this is the worst because it was the scariest. A couple nights after I lost my virginity I went back for more, so she gets me to sneak into house and we do our thing and I hear loud bangs on the door from her dad screaming “QUIT THAT WRESTLING IVE GOT WORK IN THE MORNING!” \nHe thought I was one her siblings. Thank god he didn’t open that door.",
   "created_utc": 1693113912,
   "score": 174,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx9ve6",
   "message": "Invited someone I knew was a tweaker over. He was tweaking. It was like a human-sized spider crawling all over me, trying to figure....something.....out. There wasn't any actual sex.\n\nNever again.",
   "created_utc": 1693113887,
   "score": 84,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxwzwxo",
   "message": "After my kidney operation, when my penis was able to achieve about a 25% recovery rate... me and the missus got about 2 minutes in when I noticed that the bed sheet was drenched in blood and piss.\n\nHaving a laser up the penis does no good.  That face Kermit the Frog makes when he scrunches his mouth up, coupled with a distinct sinking feeling in the nether regions accented by a melting hot lava for a dick...  \n\nDo yourselves a favour - cut salt out of your diets.  Uuurgh \\*shudder",
   "created_utc": 1693107719,
   "score": 236,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx97vz",
   "message": "Dude farted while I was giving him head. The smell was horrendous like it had fermented in his colon for  the entire day. I would've been fine had he not grinned like he did it on purpose. \nWe did the deed after but I was not into it and was turned off. Never texted him back after that",
   "created_utc": 1693113436,
   "score": 251,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx0frf",
   "message": "Dated an African girl for a while years ago and this girl could ride like none other. Used to just effortlessly bounce on it with endless stamina. Just amazing. \n\nOne day we’re are right in the middle of it, and she bounced a little too much and it slipped out… and I couldn’t move out of the way fast enough. She came down on it, full force. Head, shaft, both balls… unreal level of pain. I literally screamed and then didn’t move for like 15 minutes.\n\nEDIT: HOW IS THIS STILL GETTING UPVOTES?!?! OMG it has more upvotes than the actual thread topic!! Had I known a story about getting my dong crushed would be this popular, I ’d be doing it on the daily! \n\nI mean, I really wouldn’t, but damn I can’t believe this many people now know the story of Zulu nation vs. my dick. \n\nWow.",
   "created_utc": 1693108017,
   "score": 152,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx79pq",
   "message": "This guy I was best friends with had a huge thing for me after a while, so I figured I’d give him a chance because he was very good to me. I told him he can come over to fuck and he was saying he’s going to tear my shit up and asked if I can take bigger penises. \n\nWell he ended up having a micro-dick. I faked my moans to be nice and it wasn’t even in. He bragged about making me moan so loud after to our guy friends without asking my permission and kept trying to push to fuck again as I’d ask him to please quit begging until I had to block him.",
   "created_utc": 1693112136,
   "score": 217,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx7m5y",
   "message": "Me and my wife, both tipsy. There was a cabinet beside our bed and on top was a 10 x 10 plaque in memory of her dad, who had passed a month or so prior. I almost lost my balance and grabbed the cabinet for support. Que the plaque falling and hitting her right in the head, neither of us could drive so i had to call for a ride to get her head stitched up. That stayed not funny for a pretty long time.",
   "created_utc": 1693112365,
   "score": 48,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxwq2cj",
   "message": "My first. Came in less than a min",
   "created_utc": 1693102584,
   "score": 230,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx894b",
   "message": "In college. Met up with a guy. He made me a cocktail that was mostly mixer. We drank maybe one drink each and got to business. His version of making out consisted of him sucking my tongue and not much else. It was really gross. I tried to skip the foreplay because it was so awful. Guy was completely soft the whole time. I tried a handy, tried blowing him. Never got hard. Finally decided to call it and go home. The whole time I was getting dressed he blamed it on the drinks, which again were very weak. Kept saying “damn whiskey dick.” \n\nDude continued to message me for months trying to hook up again, long after I stopped replying to him.",
   "created_utc": 1693112782,
   "score": 77,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxwscdk",
   "message": "I hate to say this.  He was an acorn. I have never seen anything like it since. And it took him forever to finish.",
   "created_utc": 1693103718,
   "score": 6,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx15vd",
   "message": "I was way too young and stubborn. Some guy was super overconfident and dared me he could make me scream. I had sex with him anyway and stayed silent. It wasn’t good but I didn’t bother faking it to make him happy. I still feel bad but it was horrible.",
   "created_utc": 1693108428,
   "score": 170,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxww1fq",
   "message": "I was having some fun time with my wife when I had an attack of coital cephalalgia. Also known as sex headache. A short but extremely painful burst. It felt like someone had just blown the top of my head off with a shotgun. I literally cried out in pain and instant floppy. Would not recommend.",
   "created_utc": 1693105608,
   "score": 243,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx4d5f",
   "message": "We were mid-coitus, and she looked into my eyes and told me I reminded her of the \"[long-haired shirtless guy with the shoulder things from School of Rock](https://imgur.com/a/2AaSZgU)\". I knew exactly who she was referring to the second she said it, and I was so baffled and distracted by it that my boner died immediately. I kinda stopped, rolled off, and started mumbling something out of confusion. She got shy and panicked and kept saying \"it's a compliment!\", but it was more the utter confusion of hearing that sentence mid-thrust and immediately picturing exactly the fuckin' guy she was talking about.\n\nNot a \"bad\" story at all, but the sex itself was very bad.",
   "created_utc": 1693110324,
   "score": 9,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx42pf",
   "message": "A dental student with a tiny ass dick who thought he was a hot shot with a big dick. He was sweating on top of me, muttering (“I need to lose weight, that’s why I’m sweating so much”), asking if I liked it while I felt absolutely nothing and then after he came (cuz fuck my pleasure, of course), this motherfucker had the nerve to grab the opened tin of SOUR CREAM AND ONION flavored Pringles sitting on his bedside table, eat one, offer me one (I obviously declined) and then try to kiss me. 🤦🏻‍♀️",
   "created_utc": 1693110149,
   "score": 97,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx1rgk",
   "message": "The strings of my wife’s IUD poking the head of my penis.  It wouldn’t happen every time but when it did it was horrible.  I had a vasectomy so she could have it removed.  We were both so happy after it was removed.",
   "created_utc": 1693108776,
   "score": 238,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxwydzb",
   "message": "In the moment beach sex.",
   "created_utc": 1693106872,
   "score": 25,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxwq7vi",
   "message": "She was angry, I was confused. There was no trust and little love. I just about didn't finish, but she was convinced if I didn't finish that I secretly hated her.",
   "created_utc": 1693102661,
   "score": 112,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx48uh",
   "message": "Already wasn’t attracted to him and the sex was ehh, but he shhh’d me. Twice.",
   "created_utc": 1693110253,
   "score": 111,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx634u",
   "message": "The guy was just... not great. A hook up, hadn't bathed that day, gave up when he got too winded after a couple of minutes, called his penis his \"little guy\". It was libido killing all around.",
   "created_utc": 1693111384,
   "score": 137,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx5itx",
   "message": "Losing my virginity. Too young, way too young, and he was a complete and total asshole.",
   "created_utc": 1693111031,
   "score": 224,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxeo9f",
   "message": "A few strokes into a VERY casual hookup, she says, “what if I get pregnant?”. I literally shriveled out of her.",
   "created_utc": 1693117372,
   "score": 148,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx9909",
   "message": "The WORST sex I ever had was when I pretty much started climaxing 3 seconds after penetration. Well, more like I was responsible for the worst sex that poor woman ever had. 😆\n\nI was visiting a friend out of state and while there I ended up altering my return trip so I could stop by for a quick visit with an online friend in a neighboring state. I was only there for 3 days and we hung out a little bit, but not for very long each day. Day 1 was the meet and greet. We talked and then hugged goodnight. \nDay 2 she initiated a make out session. Day 3 was the day I was leaving and she was going to stop by to say goodbye. \n\nI was all packed up, she stopped by and we talked a little bit and both of us wished that I had a little more time there. \nAnd then she started unbuttoning my shirt... 😲\n\nNow, at NO time while visiting her did I ever envision anything sexual happening between us and that could maybe be chalked up to my limited experience with women at the time. I always let her take the lead and played everything by ear when I was with her. \n\nI never expected to have sex with her so I was caught completely off guard when things started heating up and moving in that direction. Both her and I seemed to be incredibly turned on and I had a feeling I was about to become the equivalent of Jim from American Pie. 🥧 😆\nI hid behind foreplay long enough and it was now the moment of truth. The second I went in, yep, I was Jim from American Pie! No amount of mental gymnastics was helping at that moment. 😂\n\n20 years later and I'm STILL sorry, Melissa. 😂\n\n\nI always wanted a rematch with her at a later date just to redeem myself but for whatever reason I never pursued it enough to make it happen and we fell out of touch after a while.",
   "created_utc": 1693113458,
   "score": 47,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxwwjlf",
   "message": "Non-consensual. I'll spare you the details.",
   "created_utc": 1693105879,
   "score": 154,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxaijr",
   "message": "This was simultaneously the best and worst somehow. It was the best cause it was the first time someone got me off via a blow job and the worst cause i came so hard I popped a blood vessel. \n\nThankfully blood didn't come out til after I pulled out of her mouth. Obviously went to the ER but got told that nothing was wrong. I think they said something about being too rough with it but i don't remember exactly what they said. Was just glad I didn't permanently damage my dick lol",
   "created_utc": 1693114333,
   "score": 185,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxbolq",
   "message": "I was 17 , visiting a girl from school. Her family was home \u0026amp; we were in the basement.  Things got super hot making out \u0026amp; feeling each other.  She unbuttoned my pants and dropped her sweats , bending over.  We start , and I noticed she was clenching up weird, I rolled her over and she was full on seizing. Foaming mouth.  I freaked out and ran upstairs dick swinging, Yelled for her parents.  Dad came running downstairs and sees his daughter spread eagle. Mom is standing with my and my flaccid dick. \n  I grabbed my pants and left.",
   "created_utc": 1693115158,
   "score": 77,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxd7lw",
   "message": "Was doing missionary with my gf and pulled out to cum on her belly. As I did, I looked down and I must have aimed a little too high and also just had a very powerful ejaculation for whatever reason. Ended up cumming in my own eye. That shit burned for hours. We still laugh about it to this day, she’s now my wife.",
   "created_utc": 1693116273,
   "score": 89,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxwszjy",
   "message": "Finally had her daughter out of the way.  She came in so sunburned she could hardly be touched but she insisted because we ought not get another chance for several weeks.\n\nIt was bad for both of us.",
   "created_utc": 1693104037,
   "score": 68,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx94b1",
   "message": "I was hittin it from the back and I didn’t know this broad had a wig or weave or whatever it’s called and I went to pull her hair and the wig thing came off and I didn’t know what to do and everything just stopped so I put that bitch on and she got mad and took it off my head and then I went to grab a beer and I apologized for putting her weave/wig thing on and that I was just trying to make her laugh…THEN A FEW NIGHTS LATER we were asleep and I woke up to use the bathroom and that weave/wig thing was laying on the floor next to my bed and it was dark and I just stepped all over it and it got all tangled up on my feet and I started freaking the fuck out cause I didn’t know what it was I turned on the light and just started freaking out cause I was half asleep and I thought it was a symbiote like venom or some kinda new spider and I ripped that damn thing off my foot and threw it across the room and she got mad again. \n\nI got two other stories but it’s a lil bit fucked up.",
   "created_utc": 1693113368,
   "score": 156,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx0u5d",
   "message": "Every single time since I've had prostate surgery.  I now cum without warning so there's no way to hold back and nothing actually comes out.",
   "created_utc": 1693108243,
   "score": 15,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx7wvy",
   "message": "First (and last) time I had sex with a guy I was dating. He had no technique and took literally hours to finish. He blamed it on a pinched nerve. Nothing I did helped. Not sure why I waited for him. I got to know every tile on the ceiling. When he finally came, it was literally by his own hand. I got up, went to the bathroom and then left.\n\nThe funniest part was that he asked if as a Greek man, he lived up to the hype. At the risk of insulting all Greek men I didn't say anything other than goodbye.",
   "created_utc": 1693112560,
   "score": 219,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx8w56",
   "message": "I dated a girl for a few months that kept telling me how good she was at blowjobs and how every guy she dated said she was the best. When she finally gave me one it was the worst bj expertise I’ve ever head. Lots of teeth and just going up and down as fast as she could. I hate to sound shallow but this made me want to break up with her. I was just like WTF 😬",
   "created_utc": 1693113212,
   "score": 158,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx2ng1",
   "message": "I had a painful sinus infection",
   "created_utc": 1693109293,
   "score": 11,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx83g7",
   "message": "[deleted]",
   "created_utc": 1693112679,
   "score": 51,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxafl7",
   "message": "I was having shower sex with this guy and I slipped, hit my head on the bathtub faucet and blacked out. I woke up to him and his roommate standing over me debating whether to call 911. I was ok besides having some bruising lol",
   "created_utc": 1693114277,
   "score": 33,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx52ym",
   "message": "My first encounter ended up being in the back of a friend's van in the dead of night in January, not long after they had backed into a pole and shattered their rear windscreen. \n\nIt was cold and dark; I fumbled with the condom and was totally paranoid that we'd be caught. Suffice to say, the mood was ruined.",
   "created_utc": 1693110764,
   "score": 10,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxelbb",
   "message": "The girl constantly asked what I wanted and then proceeded to ask if it was feeling good and if she needed to do anything more, it was like every 5 seconds... I fixed it by telling her to let me cover her mouth and fuck her from behind.",
   "created_utc": 1693117310,
   "score": 192,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx2xct",
   "message": "The vacuum cleaner.",
   "created_utc": 1693109458,
   "score": 25,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx600x",
   "message": "She made out like a woodpecker. Just constant pecks with pursed lips on the cheeks, mouth, everywhere. I was in complete disarray.",
   "created_utc": 1693111329,
   "score": 84,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx92ve",
   "message": "Was fucking this chick who was giving me no feedback. I literally said mid-stroke “fuck this” and got off of her and went to sleep",
   "created_utc": 1693113340,
   "score": 17,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxaopp",
   "message": "The first guy I ever slept with at 18 who thought he was some sort of sex god. I look back on what I accepted for so long and pity my younger self.",
   "created_utc": 1693114452,
   "score": 73,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxf51p",
   "message": "He couldn’t get it hard so he apparently just kinda smooshed it in there. He then proceeds to pass out on top of me half a shimmy later (there were zero pumps) When I tried to push him off of me I felt the awful tearing sensation. Turns out because I was so dry (surprise) his time bit of moisture leakage caused his limp ass noodle to adhere to my vaginal wall…he texted me the next day asking if I had a good time……………",
   "created_utc": 1693117731,
   "score": 114,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx4wr5",
   "message": "Well my first relationship was with a girl (I’m bisexual) and she would make me feel terrible and would become extremely cruel the first time I didn’t want to go down on her when during her period. She insisted me so much and almost kicked me out of her house so I did it under pressure. It was completely disgusting honestly, she didn’t even shaved (that’s okay I just don’t like hairy kittens). Years later I realized that it was abuse hahahah (and other situations like that)",
   "created_utc": 1693110658,
   "score": 15,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx7bi1",
   "message": "This girl that kept her pelvis into mine. Like I was already in there and she just kept shoving her hips forward. It was really strange cause she kissed the same way too, just pushed my head back with her face.",
   "created_utc": 1693112169,
   "score": 75,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx6ga4",
   "message": "I mercy fucked a guy. He took forever to cum and I was drying out.  It was awful",
   "created_utc": 1693111616,
   "score": 25,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx9bem",
   "message": "She was on top and I had my eyes closed for a little while, but when I opened them I looked at her face and for just a brief moment got a flash of that giant dog thing from The Neverending Story.",
   "created_utc": 1693113504,
   "score": 21,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx9zqq",
   "message": "Suffice to say I'm not talking to my hand ever again!",
   "created_utc": 1693113971,
   "score": 9,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxcowa",
   "message": "Me checking for my name",
   "created_utc": 1693115889,
   "score": 62,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx8h3u",
   "message": "My first time going down on him.... got a random bloody nose 😓",
   "created_utc": 1693112930,
   "score": 6,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxwsn7v",
   "message": "All of whatever i had before my recent partner. I was too much of a people pleaser and i never voiced out what i really liked in bed, i just went with whatever my partners wanted to do with me just to see them happy. I remember a partner who was on the big side, and with that type of bigness, it hurt way more. I'd fake all i could, but the kitty doesn't lie, so the dryness... ouch.",
   "created_utc": 1693103867,
   "score": 19,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxaxbn",
   "message": "Not really sex, but more like a sexual experience... i was hoping I'd never have to tell this story, but here goes...\n\nWas 19, and had been struggling with IBS, and my fuck buddy at the time wanted to give me a rimjob... well you can guess the rest. I warned her about my IBS and she stayed confident that she could handle it. Her tongue went in my ass 4 or 5 times back to back and then I shit all over her face and mouth. She puked, I puked... it was horrible.",
   "created_utc": 1693114617,
   "score": 77,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxwq7gg",
   "message": "When I was nervous af, first time I didn't get hard",
   "created_utc": 1693102655,
   "score": 9,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxg423",
   "message": "She was on top, and when I came, my face was in her tits, and I got a bloody nose.\n\nHer entire chest was covered in blood, as was my face.\n\nIt was my first time 🤗",
   "created_utc": 1693118479,
   "score": 17,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxhfsw",
   "message": "A one night stand. It was horrific from start to finish. \n\nShe showed up late, asked me if I was “Arabian” (I’m not but still offended for Arabs everywhere) and chugged vodka from the bottle under my desk. \n\nGet down to the good stuff and as I’m about to go down she says “Sorry if it smells like dick down there”. As a gay woman I think that is hands down the worst thing you could hear during sex. \n\nFast forward the horrible sex and her loud ass snoring, she walks to the bathroom outside my room butt ass naked before I could stop her. I shared the house with 4 other guys who happened to be having their morning coffee as she pranced by. \n\nThey have never let me live it down.",
   "created_utc": 1693119516,
   "score": 237,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx65qz",
   "message": "During a particularly long session I strained my suspension ligament and remained erect for an entire day until I could see a doctor. It was quite painful.",
   "created_utc": 1693111430,
   "score": 60,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx0adu",
   "message": "We used a condom. FOR PIV sex. \n\nIt was mint flavored.",
   "created_utc": 1693107933,
   "score": 20,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx9hrx",
   "message": "For shits n grins I fucked a 450lb woman once. It was really hard trying to get access to her vagina and I'm standard issue 6 inches.",
   "created_utc": 1693113626,
   "score": 11,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx59bp",
   "message": "Very drunk, did not go well, she cried",
   "created_utc": 1693110872,
   "score": 8,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxx5pv8",
   "message": "A chick shat herself while I was hitting it from the back. Well, shit happens..",
   "created_utc": 1693111153,
   "score": 66,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxddhq",
   "message": "I had just gotten off work and was tired and my gf of 5 years was riding me and i not only started to fall asleep while she was riding me but i also started to go soft, it made me realize i was not longer into skinny woman",
   "created_utc": 1693116395,
   "score": 3,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxdmi2",
   "message": "Had an full blown argument in the middle of our anniversary trip ( no yelling tho, small hotel). The argument started when she tried making sense of some really bad things she did during that day, and was constantly trying to prove to me that \"that's not the real her\" while I was giving her oral and getting ready for the penetration. \n\nI asked her to stop, and that I don't want to hear that right now, but she continued. I ended up getting angry at her and have gone limp because if it. So she started crying softly, while I rolled over to the other side of bed. So we were  both kinda laying in bed, both naked and just...said nothing for some time. I tried making some common ground after that, but of course, she felt hurt by her own actions and my reaction to her words and timing. \n\nIt was the last night of the trip, and I had planned something interesting for us that evening, but it ended up being this. So after about 10 minutes of very sparse wordings drom her, she wanted to try again. It took me a long while to get up again (really hard to get hard while I'm mad at her), but what ended up happening is that we kinda had normal sex afterwards, but it felt just so...wrong and stupid. I went on until she came, but I could not be further from my finish. She kept asking me if I'm gonna cum to, multiple times, and being mad and all, I took my condom off (being dry as hell from the inside) and tossed in on her tummy (not thrown, tossed, very important later on). So now, she had more mixed feelings of guilt, shame and disappointment, while I was angry at her...again. I went to the bathroom and to the shower first, and I could hear her crying again...just not as softly now. \n\nTomorrow morning, it looked liked she calmed down, and that she was back to her usual self, but she never was. Not long after our trip, our communication changed, she became more distant and after a month she changed her tone with me, being much more argumentative, which led the relationship into a halt. After some more dumb arguments from her side with absolutely no reasoning (just trying to dump her wrongdoings on me), our relationship fizzled out. \n\nNot long after, she explained to me what was on her mind and why she was so mad at me now. She mentioned a lot of moments during that trip, blaming now me for everything, and also enlarging the story tenfold. Now, her story was that I yelled at her (didn't), threw stuff at her (the condom part, which again, was tossed) and much more. I tried talking to her on multiple occasions, trying to make some sense to her of the actual things that happened and explained everything to her again and again as things were, but she didn't listen. \n\nIn the end, that sex turned out to be the start of our relationship downfall. We broke up a few months, after that, because she kept being unreasonable and distant, while I was trying to salvage what was left. \n\nIn the end, you cannot fix other person mistakes if the other person does not want them to be fixed.",
   "created_utc": 1693116581,
   "score": 3,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxhag4",
   "message": "The guy took me to the shower and put me down on my knees, naive me thought that I was going to give him a blowjob until he started pissing all over my face. \n\nWe hadn’t discussed anything like this prior or anything… needless to say I left after that.",
   "created_utc": 1693119397,
   "score": 2,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxi6dp",
   "message": "When the fucking cat scratched my butt midway",
   "created_utc": 1693120083,
   "score": 248,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxjx37",
   "message": "The smell.   She smelled awful.   Like vinegar and sweat and hot mustard.",
   "created_utc": 1693121459,
   "score": 4,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxjsyo",
   "message": "I was at a low point. Real low. Not having success with girls. Really horny. I had a one night stand with a...big girl. I'm 5'10  and at the time maybe 150lbs. This girl was 6'6 probably closing in on 300lbs. I'm not proud of being there but I was 18 and super horny. I figured how bad could it be at least fat girls have big butts and I like butts. I do not like butts with pimples all over them. I do not like the smell of a bigger girl sweating because in 100⁰ she doesn't have an apartment with AC. I also really like being able to breathe during sex. The whole thing started terribly too. I showed up and we both knew why I was there. She was naked when she answered the door. I almost turned around and walked away right there, but horny 18 year old. I walked in and immediately I'm on my knees and she's practically sitting on my face. I don't have a steel spine. My neck isn't made to support 300lbs. Also did I mention I like breathing? She basically dragged me to the bedroom and plopped herself belly down ass up and literally said \"go\". I got undressed put on the condom and went in. She stopped after a second and said \"you're not in my vagina you're fucking my thigh.\" My penis for probably 2-3 minutes was fucking a fat fold. When I finally dug through the fat I found her vagina. I was inside her for maaaaybe 30 seconds when she said \"I'll do it\" she climbed on top and yes my penis was in her, but if I haven't mentioned it yet I like to be able to breathe she crushed me into the bed. That being said for being a big fat girl she was surprisingly very good at riding. I came. She was disappointed. She crawled up and her big sweaty fatness just slimed my entire body as she plopped down on my face. She was surprisingly good at riding a penis. She was riding my face at this point and she's not good at that. Her vagina was on my mouth. Her belly fat was covering pretty much from nose up and her thighs covered each side of my head completely. I ALMOST DIED. I couldn't breathe. She was having a wonderful time and my arms were basically pinned under her calves and I couldn't move. Even if I could have moved I wouldn't have been able to push a 300lb woman in orgasmic bliss off my head. I bit. I don't want to brag, but I have found the enigma that is the clitoris. I bit it. Gently. She didn't get the message. I bit it hard and she yelped and sat up. I finally was able to take a breath. It was the worst breath of life I've ever taken because it was basically vagina and sweat smell that I inhaled. She asked me \"did you bite my clit?\" I said yes and she was like \"I'm not into that\" and she started to climb back up. I had to think fast or die there. I, in a panic, said \"I like biting\" BIG FUCKING MISTAKE. She said oh you do? And fucking sank her teeth DEEP into my neck. I thought she was going to eat me. She drew blood. I was in so much pain. My neck from the sitting at the beginning and the vampiric bite. My head from the pressure of 300lbs centralized on it. My chest from her monstrous pimple riddled ass sitting on it while she rode my face into oblivion. Finally I said what saved me. I said, while her teeth were severing my jugular, \"oh my god I just came again\" She got up and said \"I came while I was on your face so I guess we're done\" I got dressed and got the fuck out of there. She wanted a kiss goodnight, but I dodged it and drove home as fast as possible. I got home, I was living with my parents, my mom saw the wound on my neck. She was like \"WHAT HAPPENED?!?\" I had to tell my mom that her son got bit by a sexual encounter he just got home from. I couldn't think of a lie. What lie would I have even said? A very human looking teeth pattern was in my neck. She said \"what ever floats your boat\" and went to bed. I immediately bandaged up my wound, brushed my teeth, and cried while taking a shower. The girl called me multiple times and sent me texts saying she had a great time and wanted to do it again real soon. No fucking way was I ever going back. I probably wouldn't survive a second round. That was 14 years ago. Inversely I *actually* really enjoy my wife sitting on my face and making it hard to breathe. She plays it up too teasing me by saying \"oh do you need to breathe? Too bad because I'm comfortable\" I don't bite her clit. I lick her butthole. She's ticklish so it gets her to move a little. Plus my wife is 5'2 and weighs significantly less than me so I can move her off me if I need too.",
   "created_utc": 1693121368,
   "score": 17,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxd5ak",
   "message": "How about weirdest? Buddy of mine lived in a nice apartment complex and always threw parties. \n\nI always rented to guest apartment to not drive home. \n\nOne big party, girls from an apartment up the road come in, a  bachelorette party group. I end up talking to a girl. Take her back to my rental. \n\nWe have sex. I'm really drunk, I could not operate my boots. Really struggled to get them off. She gets annoyed and pulls them off. Then, my jeans were giving me trouble. She unbuttons and unzips. We have sex. \n\nI stumble into the kitchen for another beer. Chug it, we're ready to go. She's on top, things are going great. She asks a question, I can hear myself speak gibberish. I'm hammered. \n\nShe stops, is still on top of me, and starts crying. Says \"what kind of person am I?\". Talking about herself. \n\nThen breaks down ugly crying. \n\nI'm trying to figure out whats wrong. Turned out, she was the bride! Oops.\n\nShe wanted one last fling. And she picked a dude that was blackout drunk, except I never black out. I just keep drinking till I have a safe landing zone. (It's not passing out if you pick the spot!)\n\nAt first, I felt bad. Though all I did was be there. But, then I figured, I helped her future husband. Taught her the grass isn't always greener. Sometimes the other side of the fence is a guy that isn't certified to operate his boots.",
   "created_utc": 1693116225,
   "score": 0,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxeg8a",
   "message": "He spent almost the entire time switching between sticking his tongue and his finger in my ass. I ended up having a panic attack afterwards because of it.",
   "created_utc": 1693117207,
   "score": 9,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxah7b",
   "message": "The day I was forced to have sex with an ex friend and his brother 😞",
   "created_utc": 1693114307,
   "score": 3,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxdd8k",
   "message": "Was going down on him and heard a noise and dude was watching porn on his phone. Stupid me actually stayed for a few mins until I realized he had no interest in touching me in return. At least I was smart enough to leave at that point. I don’t think I have ever felt that worthless in the moment as I did then.",
   "created_utc": 1693116390,
   "score": 100,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxh5kc",
   "message": "Was when I lost my virginity. She was fresh on her period and there was blood everywhere. All over me and my sheets. Having sex after that I couldn’t ejaculate for a long time (about 2 months)",
   "created_utc": 1693119292,
   "score": 3,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxhsr0",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxhb72",
   "message": "My first time. She was a childhood \"friend\" that I knew since pre-k. My parents knew her parents and they made us hang out. She was really reclusive and cared more about collecting bugs and plants. I was the only person she really tolerated hanging out with. \n\nWe both graduated and we were sitting in her room playing videogames (only thing we really had in common) when I was supposed to be helping her pack. She asked out of the blue if I wanted to have sex with her. We got down to the act and she didn't even moan. She never moaned. The whole time she just looked almost robotic and felt like she was mentally a mile away. She rode me and just stopped, saying she came, juices leaking down my thighs and continued riding me so I could cum. Then after laying on my chest for a little bit, got up, handed me my controller and continued a few more rounds of Goldeneye.\n\nLooking back. I think she was on the spectrum and nobody knew about autism back then.",
   "created_utc": 1693119415,
   "score": 94,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxy07eh",
   "message": "About three months into dating, before we were married, my wife gave me a BJ. It was amazing. So amazing in fact that when I came, I tensed so hard that my muscle contractions dislodged a kidney stone from my kidney wall which plugged my kidney at my ureter (tube from kidney to bladder). This led to 3 operations over the course of 11 days to include 4 days in the hospital and 2 separate ER trips. I also woke up in the middle of one of these operations, that was not enjoyable either. However, she stuck with me through it all, so I had to put a ring on her finger.",
   "created_utc": 1693134466,
   "score": 176,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxcxs6",
   "message": "Got a handy once, the woman was doing everything \"normally\", then suddenly she grabbed the sausage with one hand, and *vigorously* rubbed the head with the palm of her other hand. Like a dick noogie. Awful.",
   "created_utc": 1693116071,
   "score": 120,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxw3xv",
   "message": "All sex I have I am eternally grateful for, however I think the worst sex I ever gave was when I lost my virginity and having no experience other than porn proceeded to spit on this poor bird’s vulva and start slapping it like I was trying to ring a service bell at a hotel desk. Mercifully she still consented to penetration, presumably to stop the horrendous foreplay. That lady is now a lesbian.",
   "created_utc": 1693131314,
   "score": 65,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxvgrt",
   "message": "I was recovering from a cold, I was feeling about 90% normal again, but anytime I got active and the mucus started to thin, I got a bit of a runny nose. One evening, my girlfriend and i were going at it, I was on top, and the sniffles kicked in.. It isn't normally a problem, as I'd only have to sniffle every once in a while, so we continued. But I noticed that I had to do it really frequently, and I was thinking to myself, \"why is this running so much?\" \nThen she felt something dripping on her, and she started shouting, \"what the fuck was that???\"\n\nGot up, turned on the lights.. Her chest and stomach were covered in blood.. I didn't have the sniffles, I had a nose bleed. What's worse is that she's Hemophobic, so when she sees the blood, she starts screaming, then she throws up, then she passes out..",
   "created_utc": 1693130794,
   "score": 112,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxgtjp",
   "message": "just turned 21. she was 31 and had 2 kids. met her at the bar that night. took her back to a hotel room and was going at it. halfway through she said, \"i told my kids i'd find them a baby daddy.\"",
   "created_utc": 1693119031,
   "score": 50,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxi7o7",
   "message": "After my girlfriend dumped me in an absolutely brutal fashion after I cooked her dinner at my place she asked if I wanted to fuck one last time. I said yes because low self esteem and not really being able to process what just happened. She got on top and rode me til she came, got off me and walked right out the door. I laid there and cried most the night.",
   "created_utc": 1693120111,
   "score": 142,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxx0cv",
   "message": "I had sex with a guy I had been dating for a few weeks, it was our first time together (not first time ever). He wasn’t interested in foreplay but just put it in and started humping. I wasn’t really feeling it, but you know, the first time with someone can be a bit bad so I soldiered through. And he was hot. \n\nAll of a sudden he started demanding: ”Do you want my milk? Tell me you want my milk!?” I almost started to laugh but I was like ”yeah sure I guess” lol. (At this point I was just hoping he would give his ”milk”). I wasn’t feeling it but kind of kept going out of… politeness? Then it became even more awkward. ”Tell me you’re my whore!” I almost did, just to make him finally come, but then I decided that this is not for me so it ended there. He was very cranky about it.\n\nI do find dirty talk hot, but it was just so awkward and wrong somehow.\n\nI’m sure he could write here about the same encounter, because from his point of view it was probably bad sex too!",
   "created_utc": 1693132026,
   "score": 103,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxj6p7",
   "message": "A few dates in with a girl i met online. We headed back to her place and did not mesh sexually at all. We were both able to laugh about it and chalk it up to nerves. Tried again a short time later after talking and another date and same thing. Neither of us were doing anything right to get the other going. Agreed that we should just be friends.",
   "created_utc": 1693120874,
   "score": 46,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxy3mie",
   "message": "She said I could slap her bottom. I did but missed the mark. Hit myself in the nuts. Took myself out right then and there.",
   "created_utc": 1693136794,
   "score": 45,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxmls3",
   "message": "She didn't want foreplay, she refused oral, she just wanted me to fuck her as hard as I could. She invited me into her bedroom, threw me on her bed, and it was memory foam. I gave it my all. Was like fucking in quicksand.",
   "created_utc": 1693123616,
   "score": 131,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxoat7",
   "message": "He kept calling it his “demon dick” and wasn’t all that good at it? Like he just Jack hammered into me and then would ask if I came lol. \n\nAt one point he meowed and I just couldn’t handle it anymore.",
   "created_utc": 1693125000,
   "score": 123,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxxnzmh",
   "message": "On holiday with my ex. I was on new medication for endometriosis and everything was so sore down there it was agony to sit down. However, my ex said I owed him holiday sex, so I said we could try. I was sobbing with the pain, like ugly tears and I couldn’t hold it back. All he said to me was ‘it turns me on so much to know I’m causing you this much pain’ absolute scumbag. You’d expect your partner of nearly 7 years to be a bit more compassionate instead of that :/",
   "created_utc": 1693124745,
   "score": 127,
   "submission_id": "162dv8e"
  },
  {
   "comment_id": "jxybnm8",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "162dv8e"
  }
 ]
}