{
 "submission_id": "162gd8p",
 "title": "Reddit users, 30 yrs old and over.. What is the hardest part about getting older?",
 "selftext": "",
 "created_utc": 1693109977,
 "permalink": "/r/AskReddit/comments/162gd8p/reddit_users_30_yrs_old_and_over_what_is_the/",
 "score": 51,
 "url": "https://www.reddit.com/r/AskReddit/comments/162gd8p/reddit_users_30_yrs_old_and_over_what_is_the/",
 "comments": [
  {
   "comment_id": "jxx4wc2",
   "message": "Random bullshit health issues that prevent you from doing the things you want.",
   "created_utc": 1693110651,
   "score": 69,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx93mr",
   "message": "[deleted]",
   "created_utc": 1693113355,
   "score": 4,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx5lsk",
   "message": "Not only do a lot more things hurt a lot more often, but now you're the one responsible for getting those things looked at and you can't afford to go to the doctor every damn time you sleep on something wrong.  You basically walk around with your \"check engine\" light on all the time.",
   "created_utc": 1693111082,
   "score": 196,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4enc",
   "message": "Seeing my parents getting significantly older and losing elder family members 😞",
   "created_utc": 1693110349,
   "score": 88,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx5feo",
   "message": "Time goes by faster",
   "created_utc": 1693110974,
   "score": 18,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx5qqz",
   "message": "Possibilities no longer seem endless",
   "created_utc": 1693111168,
   "score": 99,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx43rz",
   "message": "Maintaining friendships and/or developing new ones especially if you relocate or travel extensively for work. Not impossible just not as easy as teens and twenties 41F\n\n[edit] included age and gender because have seen this answer for posts relating to men having this issue but it is decidedly not gender specific.",
   "created_utc": 1693110167,
   "score": 13,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4c4h",
   "message": "Watching parents and older relatives get older has been toughest for me.",
   "created_utc": 1693110308,
   "score": 243,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4r86",
   "message": "Knees",
   "created_utc": 1693110561,
   "score": 215,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4hjl",
   "message": "Coming to realization that all the shit the adults told me when I was younger actually came true and that, despite this efforts, the youth of today will ignore my advice just as I had ignored it.",
   "created_utc": 1693110399,
   "score": 243,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4qek",
   "message": "As a dude, hair thins out on top. Apparently, it migrates to your nose/ears/eyebrows. Not a ton, just a wild hair here and there. I have to pluck my f-in eyebrows, wtf.\n\nThe other is being sore. Sleeping wrong can ruin your morning. Who thought resting could make you sore.",
   "created_utc": 1693110548,
   "score": 12,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx48wq",
   "message": "Random aches and pains......the realization that you aren't invincible.",
   "created_utc": 1693110254,
   "score": 180,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4968",
   "message": "Realizing all the opportunities you missed.",
   "created_utc": 1693110258,
   "score": 54,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4gkd",
   "message": "When your high school friends start dropping dead of heart attacks. It's weird. You expect accidents to take the lives of your friends or diseases like cancer that are caused by their work, but when heart attacks kill them it just seems surreal.",
   "created_utc": 1693110382,
   "score": 58,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx5gyd",
   "message": "The overwhelming desire to just give up, lay down and cry/sleep/die but you can't. Because bills.",
   "created_utc": 1693111000,
   "score": 247,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx5gum",
   "message": "From my perspective admitting that 30 yrs old is not at all old.  That is young.  For me 60 is now considered \"old\".",
   "created_utc": 1693110999,
   "score": 61,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4722",
   "message": "Damn, 31 and I'm in the older category now..",
   "created_utc": 1693110222,
   "score": 161,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4h8y",
   "message": "I used to be with ‘it’, but then they changed what ‘it’ was. Now what I’m with isn’t ‘it’ anymore and what’s ‘it’ seems weird and scary. And it’ll happen to you!",
   "created_utc": 1693110393,
   "score": 182,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4be6",
   "message": "Not being able to make new friends",
   "created_utc": 1693110296,
   "score": 178,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx424f",
   "message": "You used to be hip and with the times but slowly but surely you’re getting older and more stuck in your ways….becoming the thing you desperately weren’t trying to be when you were younger.",
   "created_utc": 1693110139,
   "score": 27,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4g06",
   "message": "Looking in the mirror.",
   "created_utc": 1693110372,
   "score": 90,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx5l4a",
   "message": "Knees, trying to lose weight, maintaining friendships, dating",
   "created_utc": 1693111071,
   "score": 126,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx5tvl",
   "message": "Having to count calories to maintain my body shape from my 20s when I used to eat whatever I wanted",
   "created_utc": 1693111222,
   "score": 106,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx6by0",
   "message": "Feeling like you’re way behind on societal expectations.",
   "created_utc": 1693111540,
   "score": 56,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx8d3y",
   "message": "The spirit is willing but the flesh is soft and spongy.",
   "created_utc": 1693112855,
   "score": 143,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx74xx",
   "message": "Regrets about choices made years ago.",
   "created_utc": 1693112050,
   "score": 117,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxde6w",
   "message": "For me it's coming to grips with the impermanence of the moment. I feel like we're hard wired to operate under the assumption that we always have more time. But windows of opportunity do close, permanently. People you neglect will leave, never to return. Everybody you know will leave, one way or another. The good times never last (nor do the bad times) but the impermanence of my life and the things I cherish have really been kicking me in the dick lately.",
   "created_utc": 1693116409,
   "score": 194,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4r3g",
   "message": "The things you used to do without breaking a sweat now results in 3 days of pain and the inability to properly function",
   "created_utc": 1693110559,
   "score": 118,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx6y6s",
   "message": "Not sure if I’ll ever meet someone that I can trust and losing the ability to have kids before finding my person",
   "created_utc": 1693111930,
   "score": 183,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx9d07",
   "message": "It's harder to lose weight.\n\nYour sex drive goes down.\n\nAches and pains last for days.\n\nYour tolerance for other people's bullshit goes through the floor and that makes working with people tricky sometimes.",
   "created_utc": 1693113535,
   "score": 125,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxggqw",
   "message": "I'd say the realization that life was simpler before you turned 25.\n\nWas easier to make friends because of school. That gets more difficult after 30 because you're starting to realize you're becoming the people you made fun of in college for going to clubs.\n\n*Was* way easier to meet women because of school and a larger circle of friends.\n\nDating, after 30, is more complicated because now you're having to navigate emotional baggage, kids, failed marriages, etc instead of just 'hey, you want to grab a drink tonight and see where it goes from there?'\n\nFriendships start to fade, not intentionally, but because life happens. Folks have kids, kids grow up, have school, sporting events, etc. If you work later shifts your friends go to sleep earlier because they have to get up to take their kids to school.\n\nYour friends and sibling's failed relationships aren't things that just go away because now there may be kids involved and you still have to see those people again and again unlike in college where you could just laugh and say 'remember that joke you dated in college...what was his/her name, again?'\n\nThat sense of spontaneity you once had and your desire to just quit your job and get out on the open road is tempered by the fact that you either have recurring bills (car/house/credit card payment) a partner and kids or some other responsibility that you can't ignore. You can no longer blow a few hundred dollars on concert tickets or a camping trip because now you have to pay for your room and board and food and you can't just go to your mom and dad's when things go wrong.\n\nThe ever increasing realization that everything is getting more expensive but wages haven't/aren't keeping up with the reality of the cost of living. You're just getting by in the moment let alone in a situation where you can prepare for the future.\n\nEveryone is getting older and when you hit 40 people start to pass away. A few years after they pass, unless they were a close family member, you realize how quickly people move on, the sun doesn't stop burning, the world doesn't stop turning and life goes on.",
   "created_utc": 1693118752,
   "score": 137,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxh56z",
   "message": "The slow drain of idealism. When you think you can't get any more cynical, you find more things to make you cynical.",
   "created_utc": 1693119283,
   "score": 81,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxhfc4",
   "message": "Trying to stay interested in the world.   \n \nThe older I get the less fucks I give...about pretty much everything.  \nIt's frustrating and exhausting to try to stay engaged with what's going on in the world.  :(",
   "created_utc": 1693119506,
   "score": 197,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx74ct",
   "message": "Your friends will drift away and disappear from your life, for no reason at all. Time starts moving really fast, and every single day just starts blurring together. There is no “next big stage of life to look forward to.” You just begin this blurry repeating pattern of apathy, existential dread, and anxiety, and all your hobbies and entertainment just become mere distractions from it all.",
   "created_utc": 1693112039,
   "score": 155,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxb4ia",
   "message": "Life.\n\nHaving kids, having friends with no kids. Not having the money to do the things our parents could, like have a nice house in a good neighborhood, family vacations and a house stocked with food. Body deteriorating, hairline receding, metabolism slowing down.\n\nIn all honesty the hardest is probably not being where you thought you’d be by now.",
   "created_utc": 1693114757,
   "score": 177,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx5vxt",
   "message": "The hardest part is hearing that 30 yrs old and over is \"getting older.\"",
   "created_utc": 1693111258,
   "score": 148,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4ze7",
   "message": "All the bad health choices of my 20s coming to bite me in the ass.",
   "created_utc": 1693110703,
   "score": 80,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx84yc",
   "message": "The lost feeling of being young and excited",
   "created_utc": 1693112707,
   "score": 30,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx68sm",
   "message": "The bodily aches and pains. You can literally wake up from a good night's sleep with a sore back, or put your neck out from simply turning your head. It's ridiculous really.",
   "created_utc": 1693111484,
   "score": 40,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx8ubs",
   "message": "Feeling your body slowly failing you on the simplest of tasks.  Like you'll just be walking along when suddenly your knee is just like, absolutely fucking not, and it bends all weird and suddenly you can't walk without pain for the foreseeable future.",
   "created_utc": 1693113178,
   "score": 53,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxf2ug",
   "message": "It's really easy to fall behind on technology. Like, scarily easy.\n\nOver the last few years I've had to make an effort to set a little time aside and make sure I'm keeping up. Otherwise, it's too easy to lean on technologies I've already mastered and think it's good enough. \n\n(For example: newer/better versions of programs like how Word and Excel restructure their UI for no fucking reason every couple years, new smart phone features, Ai, at least passing familiarity with whatever new social media is popular, digital cash services such as Venmo. I also switch from iPhone to Android and back every couple years to make sure I know how to use both in a pinch.)",
   "created_utc": 1693117684,
   "score": 40,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx3zj2",
   "message": "Seeing the youth on Reddit think they know what they are talking about when it comes to politics.",
   "created_utc": 1693110097,
   "score": 164,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx5t7n",
   "message": "Realizing that \"throwing your back out\" is not just a thing for old people.",
   "created_utc": 1693111211,
   "score": 44,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx5a1m",
   "message": "Injuries take longer to heal. I've got a twisted ankle and banged hip from a fall that 15 years ago wouldn't have been a problem, and 15 years from now could probably be lethal",
   "created_utc": 1693110884,
   "score": 30,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx7jb9",
   "message": "Am 35, so not really old.\n\nHowever, I lost my dad a couple years ago. He was only 60. Heart attack. Wasn’t really that out of shape or anything. \n\nWatching all the people you love get older and start having health problems is hard.\n\nAlso, knowing with each year gone that also means one fewer years of opportunities in your life.\n\nWhen you are a kid you can do whatever you want. You’re free with the whole world ahead.\n\nAll the dreams of where I could travel, the colleges I could go to and the experiences I would have, the things I wish I had experienced in my youth are now gone. The type of relationships I would experience. Career choices considered. Gone in the rear view mirror. Letting go of the possibility of your dreams and visions maybe being fulfilled someday is hard. \n\nIt’s like finishing a chapter in a book you’re really into. You love the book and don’t want it to end, but you know it does and when you’re on the last few pages you know there’s only so many possibilities left in the story.",
   "created_utc": 1693112311,
   "score": 99,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx84sx",
   "message": "My neck, my back",
   "created_utc": 1693112704,
   "score": 60,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx7i7v",
   "message": "Your value is gone. No one cares if you suffer and you are looked at as the out of touch bad guy even before you speak. Like I really want to check out.",
   "created_utc": 1693112291,
   "score": 98,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx49yi",
   "message": "At it's core, shit rarely changes.",
   "created_utc": 1693110271,
   "score": 10,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx4xko",
   "message": "Losing hair in places where you once had hair, and growing hair in places where you've never had hair\n\nMentally feeling the same as you always have but your body isn't what it once was \n\nGrey pubes\n\nLosing loved ones. I know this could happen to anyone at anytime but it's common as life goes on",
   "created_utc": 1693110672,
   "score": 49,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx6iwk",
   "message": "For me:\n\n• Making sound effects while getting up or sitting down\n\n• Not being able to sit on my knees for longer than 2 seconds \n\n • Having to frequently change positions while sleeping\n\n• Snap! Crackle! POP! 😑 like the damn Rice Krispie cereal \n\nAnd…\n\n• Stiffness and (lower) back pain that pop up randomly",
   "created_utc": 1693111663,
   "score": 66,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx87tq",
   "message": "Nerve pain for no particular reason.",
   "created_utc": 1693112758,
   "score": 22,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxdxr0",
   "message": "Overcoming the inevitable insight that you are going to die one day. It was hard, but now my life is so much better when I have accepted death as a part of life :)",
   "created_utc": 1693116817,
   "score": 24,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx42bj",
   "message": "Saggy ball sacks.",
   "created_utc": 1693110142,
   "score": 17,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx9uw7",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxaneb",
   "message": "Time moves faster. It's honestly kind of frightening.",
   "created_utc": 1693114426,
   "score": 48,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxc2gu",
   "message": "I’m 60 years old and a baby boomer.  I’m think it’s sad that younger people make assumptions about my values based on my age.  I don’t value amassing wealth, I support progressive causes, I support younger people in public office (Leaders We Deserve), etc.  Baby boomers are not all the same, just like younger generations are diverse in their thoughts and goals. I support protecting the environment for future generations.",
   "created_utc": 1693115434,
   "score": 21,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx64zt",
   "message": "Friends and loved ones dying has definitely sucked. I’ve always prided myself on having a pretty large friend group with around 10 people I truly consider friends. 2 of them have passed away in the last 2 years. Add to that family and extended family I’m close with passing away as well and it’s pretty strong reminder how temporary everything is",
   "created_utc": 1693111417,
   "score": 31,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxcrmt",
   "message": "I'm Mid-50s.  My youngest two children are both high-school age now, my older two are grown, and I'll be a grandmother next year. MiL is later stage 5 Alzheimers (based on what I observe, she's adamantly refusing to get tested), My mother  was just recently diagnosed with Stage 4 Alzheimers, and my Dad has been dead for 7 years now. My FiL is Dying. \n\nMy husband and I have each lost an uncle this past year. I expect to hear of my aunt's passing any time now. \n\nThat's the hardest part, watching the decline of my parents' generation. My Dad, it wasn't so hard. I was LC with him, and his passing was a relief. My FiL, it's much harder to watch. It's cancer, and he's slowly wasting away. My MiL is losing her mind. This is the woman that told me, at age 18, that I was \"allowed\" to be an adult. I learned so much sitting at her kitchen table as a  young woman. Her decline has been slow, and all the more brutal for that. She's cut so many people out of her life as this disease has progressed that she has no support and so few anchors now. And she's in denial about her lost abilities. \n\nMy mother...oh... I knew she was struggling with memory. But now that the diagnosis is in, I can see that it's been affecting her for years. And I have some of the same issues that she did in her 50's. Is this my fate too? Is my mind going to go the same way hers is? \n\nI can't ease their suffering as much as I'd like to. I can only be there as I can for them, and it isn't really enough. And as they wither and fade, I see my own future.",
   "created_utc": 1693115945,
   "score": 40,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxhx3e",
   "message": "Having kids late in life and thinking, if I live to this age then maybe I can see them do this or that",
   "created_utc": 1693119886,
   "score": 9,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxca9p",
   "message": "Your regrets outweigh your dreams.",
   "created_utc": 1693115590,
   "score": 34,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx7sgf",
   "message": "My mind isn’t as quick as it used to be. Learning new things is definitely harder than it used to be.",
   "created_utc": 1693112478,
   "score": 30,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx91ew",
   "message": "Watching people I love and know die. Realising that there’s actually quite a few that died way younger than they should have.\n\nNot feeling like I’m where I want to be career wise (copy and paste this for kids, partners, travel or real estate and other financial security for those that lack it). I try not to mull over this too much because right now my priorities are different, and I am blessed with a family and a wonderful husband so my life is pretty good. Money can always be made.\n\nThis seems trivial, but watching the next generation go out and make their impacts on the world. For the most part I think Gen Z has actually brought about a lot of awareness and change in a positive way, on the other hand there’s this crazy addiction to tech and social media trends that I’ve no doubt will plague the generations to come and will ultimately be the challenge our generation has when it comes to raising our kids.",
   "created_utc": 1693113312,
   "score": 14,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx9ape",
   "message": "The worst part for me, who is 45 years old, is that I've continued to run and cycle regularly, stay in excellent shape, keep the weight off, and have even gotten smaller more gradually over time. However, the day after performing manual labor-intensive jobs like home repairs, every single portion of my body hurts. I exercise with weights a couple of times a week, ride a road bike once or twice a week, and run once or twice a week. However, I worked on exterior home renovations for 8 hours yesterday, including siding replacement, and today I am unable to stand.",
   "created_utc": 1693113491,
   "score": 8,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxdzoh",
   "message": "making friends  :(",
   "created_utc": 1693116858,
   "score": 15,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx85j2",
   "message": "So far, my knees aren't what they used to be and I've had to significantly change what I can eat aka I've had to cut out A LOT of my favorite foods.",
   "created_utc": 1693112717,
   "score": 7,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx8an5",
   "message": "The joint/ back pain. Sleep wrong and i’ll be stiff for a week.",
   "created_utc": 1693112810,
   "score": 8,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx8vls",
   "message": "Your body aches more and more. Those injuries you had come back to haunt you",
   "created_utc": 1693113201,
   "score": 17,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx9w7b",
   "message": "One day you find ten years have got behind you.  No one told you when to run… you missed the starting gun.",
   "created_utc": 1693113903,
   "score": 107,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxadey",
   "message": "All my joints hurt, all the time.\n\nThey would hurt less if I exercised more, but that would require me to exercise and make them hurt more in the short term, for nonspecific long-term gain. And I have a fuckin' job that I can't do if I'm laid out in bed because my joints are fucked up!",
   "created_utc": 1693114233,
   "score": 17,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxdgsy",
   "message": "Time moves so fast now. Once you have your life more or less in order, a job, perhaps a family, time just flies. When you're young, you go through so much new stuff that time seems to slow down. But I can clearly remember celebrating my 30th birthday and that was 17 years ago! I just started a new job, oh wait, that was 4 years ago!",
   "created_utc": 1693116465,
   "score": 27,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxdoh1",
   "message": "Back pain",
   "created_utc": 1693116622,
   "score": 7,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxfpo7",
   "message": "Throwing your neck out by...sleeping",
   "created_utc": 1693118171,
   "score": 13,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxa7pl",
   "message": "30 to 40 was not bad.\n\n40 to 50, then all of your injuries from your teens and 20s start to hurt, you start needing reading glasses, and perhaps the hardest part of all, your friends start dying.",
   "created_utc": 1693114126,
   "score": 22,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxb09g",
   "message": "Expected to be as optimistic as the young.",
   "created_utc": 1693114673,
   "score": 6,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx5p62",
   "message": "I'm in my early 40s.. For me it's dealing with anyone over 65 or younger than 25 lol",
   "created_utc": 1693111140,
   "score": 16,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxe4mv",
   "message": "Declining health",
   "created_utc": 1693116963,
   "score": 5,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxggk5",
   "message": "Knowing that you have more years behind you than in front of you",
   "created_utc": 1693118749,
   "score": 45,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxjxb0",
   "message": "Facing and forgiving myself for the terrible decisions I made",
   "created_utc": 1693121464,
   "score": 5,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx59kv",
   "message": "The sudden aches and pains that crop up once in a while.",
   "created_utc": 1693110876,
   "score": 4,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx76er",
   "message": "I can't drink as much as I used to without regretting it. I need more sleep. My lactose intolerance is now a serious issue not just an inconvenience. And I have to actually watch what I eat so I don't get fat.",
   "created_utc": 1693112076,
   "score": 4,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx7ilx",
   "message": "I just don't care about anything anymore.  Everything looks shitty and I don't want to talk to most people if they're like a Twitter post",
   "created_utc": 1693112298,
   "score": 4,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx7tav",
   "message": "The loneliness.\n\nI barely have any friendships from being a kid. All those high school or earlier friends have drifted so far apart. I only have 2 that I just like to send my story to on social media, realistically I'll probably never see them in real life ever again, but I try to keep some form of communication with them.\n\nFrom college, I only have 1 friend. And it's only because a few years after college we ended up at the same company and lived together for a bit.\n\nNone of those friends initiate conversations my way anymore. I feel like I'm more invested in maintaining them than they are.\n\nMy dating life felt hopeless, I quit trying 4 years ago. \n\nThis year - I've only hung out with people I think 3 short times? Otherwise every day it's just me on my own.",
   "created_utc": 1693112493,
   "score": 60,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx7zk7",
   "message": "Realizing I'll never play another game of pickup hoops unless I feel like tearing an Achilles or blowing out a knee.",
   "created_utc": 1693112609,
   "score": 5,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxx8ley",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxw0dc",
   "message": "Getting less attractive. I know this sounds a bit superficial but as a woman it’s hard.",
   "created_utc": 1693131233,
   "score": 143,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxho74",
   "message": "Looking after your own kids and your parents at the same time.  Shit gets hard",
   "created_utc": 1693119695,
   "score": 25,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxij4i",
   "message": "I sat and watched as my son died.\n\nI think he knew I was there, I don't really know. I'd gladly go before I do that again",
   "created_utc": 1693120360,
   "score": 24,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxf7kt",
   "message": "Only being 30 and being asked by strangers online about \"getting older\".\n\nMy serious answer is that you spend more time dwelling on the time that's behind you rather than the time you have ahead of you. I did fuck all with my 20s really, besides try to work on my mental health. Some might say that's a good enough use of my life so far, but I've got so many projects and cool things I wanna do that I'm only just now getting started with, and might not ever finish. I've never much cared for making a decent living or acquiring lots of stuff, but I've always been passionate about my creative endeavours.\n\nIf I were to give a positive about getting older though, it's that experience really does change you - hopefully for the better. I was a jerk when I was 20, and pretty clueless about a lot of things. I still am in some ways, but I like to think I'm a far kinder and more chill person at 30 than I ever was when I was younger.\n\nWhatever age you are, try to treat others with patience and compassion, and strive to be a better version of yourself than you were yesterday. Whatever other things you might do, or fail to do, with your time on Earth, that's one thing you can't regret doing more of ❤",
   "created_utc": 1693117785,
   "score": 25,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxjbdt",
   "message": "Time goes by like a roll of toilet paper. The closer you get to the end, the faster it spins.",
   "created_utc": 1693120977,
   "score": 15,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxy6lkf",
   "message": "Realising that when someone speaks of \"20 years ago\" they're NOT talking about the 1980's 😵‍💫",
   "created_utc": 1693138637,
   "score": 15,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxxi8br",
   "message": "For me, I think the worst part is feeling like my best years are behind me, like it'll never be as good as it was again, and just aging. \n\nI hate that my body will never be as easily in shape as it was when I was younger. I can work ten times as hard and it'll still be less than half as healthy as my body was, effortlessly, in my twenties. \n\nI don't want to be old.",
   "created_utc": 1693120126,
   "score": 14,
   "submission_id": "162gd8p"
  },
  {
   "comment_id": "jxy3cib",
   "message": "I'm a big gamer and book reader and one of the worst for me is that there's a lot less sense of wonder and discovery to be felt. The past few years have been especially rough \\[praise Baldur's Gate 3 for being the best game to come out in probably 10 years\\] but the older you get and the more you experience, the less new experiences there are. You eventually settle on which one is the best or your favorite and there's little to no incentive to venture outside of that game/series because you already know before playing/reading it exactly what it's going to be like.   \n\n\nMOST things are egregiously formulaic and once you recognize the formula you can never turn off knowing what it is and how everything follows it. Few things are ever a surprise or unpredictable or mentally challenging.",
   "created_utc": 1693136613,
   "score": 14,
   "submission_id": "162gd8p"
  }
 ]
}