{
 "submission_id": "162n1d3",
 "title": "How did that teacher get fired at your school?",
 "selftext": "",
 "created_utc": 1693132841,
 "permalink": "/r/AskReddit/comments/162n1d3/how_did_that_teacher_get_fired_at_your_school/",
 "score": 79,
 "url": "https://www.reddit.com/r/AskReddit/comments/162n1d3/how_did_that_teacher_get_fired_at_your_school/",
 "comments": [
  {
   "comment_id": "jxxyz3w",
   "message": "Used corporal punishment. We were first graders and she made those of us who didn’t have their homework kneel on salt/seeds/buckwheat. One of the kids in my class was literally the most obedient kid and she was top of the class and always had her homework—that day she must’ve forgotten it at home. She made her kneel and the girl cried so quietly and without a sound and peed in her uniform. She transferred and never came back after that day. \n\nYeah, it was a private school. Parents heard about it and threatened to sue.",
   "created_utc": 1693133556,
   "score": 118,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxygw90",
   "message": "My middle school choir teacher was a closeted gay man. He had a long-term boyfriend but none of us knew about it, until one day a parent saw them at a HOUSE PARTY making out. They spread rumors throughout the school and multiple parents immediately removed their children from his class. The parents complained to the school and got him fired. The good news is, he eventually quit teaching and opened up a bakery with his partner, which did very well and got featured on Cupcake Wars.",
   "created_utc": 1693144014,
   "score": 112,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyc61c",
   "message": "Some foolish people thought it would be funny to accuse a teacher of groping them.  It never happened, but by the time the truth came out the teacher had already lost his job and his reputation.  He never worked again.  Jokes have real consequences.",
   "created_utc": 1693141709,
   "score": 69,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxy8qjw",
   "message": "A kid got yelled at one day for being a dumbass. \n\nWell mr.dumbass decided to lie and say the teacher sexually assaulted them. Even though it wasn’t true, and there was no proof or reason to believe them. \n\nThe teacher got fired just in case. Because even having someone **accuse** you of sexual assault of a minor. Is enough reason for you to lose your job and never find one in the education industry again. \n\nYou don’t even have to be convicted. Just accused. Which… is scary you could ruin someone’s career that fast. And a big reason I’ll never get into education despite it being a big interest of mine.",
   "created_utc": 1693139872,
   "score": 42,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxxye29",
   "message": "Got caught getting high in her car between class  periods",
   "created_utc": 1693133111,
   "score": 24,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxy4lkv",
   "message": "She made students make a tag saying “ I am a useless boy “ and made them wear it for a whole day in the school, also made them walk around the football field for an 1hr in her session. \n\nWhat wrong the students did??, well they were talking and playing odd or even in her session”. \n\nNext week she was fired.",
   "created_utc": 1693137415,
   "score": 24,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxxzfuh",
   "message": "He used to bribe students with good grades in return for food",
   "created_utc": 1693133908,
   "score": 20,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxy0p06",
   "message": "Having sex with a class student of this underage grade 7",
   "created_utc": 1693134820,
   "score": 18,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyevdp",
   "message": "Had an art teacher who basically ignored the class and sat at her computer the whole class.\n\nOne day, a guy goes to the TV/VCR in the corner of a room and put on a porno, muting the TV.\n\nShe didn’t notice. Word spread and she ended up fired.\n\nAlso, my asshole of sophomore English teacher got fired for being “too friendly” with some female students.",
   "created_utc": 1693143046,
   "score": 18,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyee2d",
   "message": "Selling illegal fireworks.",
   "created_utc": 1693142815,
   "score": 10,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyhx3q",
   "message": "A Spanish teacher got fired because he was teaching with an expired teaching license.",
   "created_utc": 1693144484,
   "score": 9,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxy2h7h",
   "message": "Was subbing for a science teacher on maternity leave. Was almost going to be offered a permanent spot in the school, but then he taught the students in the first year how to properly commit suicide by hanging.",
   "created_utc": 1693136043,
   "score": 8,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxy9z7v",
   "message": "He put a hidden camera in his step daughter’s room",
   "created_utc": 1693140564,
   "score": 13,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxy95rg",
   "message": "She slapped a student across the face for mouthing off at her.",
   "created_utc": 1693140113,
   "score": 8,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxydrlq",
   "message": "DUI driving home from chaperoning the Senior Prom.",
   "created_utc": 1693142512,
   "score": 7,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxykeek",
   "message": "He was an English teacher. Fourth year at the high school.  I was quite close to him as I was one of eight students in his speech and debate class/club. \n\nHe assigned his sophmore english class to do a dramatic reading of a short story.  He provide a bunch a stories to read from, and amongst them was one story that described a particularly graphic rape/murder.  The kid who picked it up was one of those dipshits who took things too far, and well, it wasn't long before the school board and local newspaper caught wind of the scandal. \n\nI sorta felt bad. It was clearly a mistake on his part, but like he should have not allowed that material into class.  And on the other hand he was an asshole speech and debate coach. I was halfway through the year and decided to quit anyways, but I didn't want to deal with letting him know I was leaving. So the whole program imploding around me due to a teacher scandal was really best case scenario for me.",
   "created_utc": 1693145604,
   "score": 7,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxy8dh2",
   "message": "One was alcoholic\n\nAnother two had a threesome with an underage girl",
   "created_utc": 1693139670,
   "score": 13,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxy54fk",
   "message": "She referred to the January 6th \"event\" as an \"insurrection\" when asked by a student and a certain hyper Republican board member's kid was in the class. She was fired 2 days later for \"inappropriately political remarks\" in class. Yes, this was Florida.",
   "created_utc": 1693137741,
   "score": 37,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxykv8i",
   "message": "Because of me I think. Once in primary school i was messing around with a classmate, she threw a sponge at me, making me chase her around the classroom. Teacher tries to stop me and grabs me by the neck making me fall on my back. It didn’t hurt but I got surprised. I don’t remember how but some way the principal and my parents got involved and we never saw the teacher again after that. He was sort of a substitute teacher and from what I can remember he was pretty well liked even by me.",
   "created_utc": 1693145817,
   "score": 6,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxylglo",
   "message": "Hit a student. In class in front of everyone. He was on the edge for years, couldn’t control his temper. He should have been fired before that.  \n\nBut then one day as an adult I was leaving my flat which is a maisonette with a shared entrance, and he was standing in the hallway! Turned out it upstairs neighbour was his singing teacher. Luckily he kept the same appointment time so I was able to avoid the times he would be entering and leaving.",
   "created_utc": 1693146079,
   "score": 5,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxym04c",
   "message": "My kids’ principal got fired because she and her husband (also a principal in the next district over) were selling guns and cocaine.",
   "created_utc": 1693146312,
   "score": 6,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxymeb1",
   "message": "Embezzling from the students.  For quite a few years, she would collect money for this \"senior trip\" that never seemed to materialize.\n\nShe was arrested a few years after I graduated.  I wonder if she's out of prison yet?",
   "created_utc": 1693146481,
   "score": 7,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyqff2",
   "message": "First year teacher, the guy came from Kenya. He taught Spanish but sucked at it. If you talked over him it would hurt his feelings and he would send you to the office. He sent on average 43 students a day to the office. If you worked ahead he would make you erase it. Well, no one gave a shit about him or what he had to say. Was also caught multiple times starring at girls. Well anyway, dude was fired at the end of the year. Fuck that guy",
   "created_utc": 1693148130,
   "score": 6,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyhxnl",
   "message": "Separated students seating arrangements based on their grades. All the black kids ended up being lumped together in the lowest seating grade and was assigned additional work. Black parents got mad and stormed the classroom one day. Teacher got escorted out, never to be seen again.",
   "created_utc": 1693144491,
   "score": 10,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxy5lt1",
   "message": "Use of alcohol on the job. \n\nBottle in the top left drawer. \n\nTook years, though.",
   "created_utc": 1693138034,
   "score": 5,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyb17n",
   "message": "He got very angry with administration. We all were. He posted a picture of himself saying \"people will pay\" while he was holding an ar15? (I'm not good with guns, the popular semi). He was arrested and fired. \n\nNow, there is no connection that the photo was a threat to administrators, but it was seen as so. When I had him, he was a great teacher, and he even let us play old school Mario in class on Fridays. This was high school. \n\nUpon being arrested, the gun had no ammo and he had never fired it. I think he was just angerly posting, but we have to take all threats seriously because if we dont- people will get hurt.",
   "created_utc": 1693141120,
   "score": 5,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyg8sn",
   "message": "Male teacher smacked a girl on the butt while she was walking up the stairs, telling her to hurry up.",
   "created_utc": 1693143703,
   "score": 3,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyh5ae",
   "message": "Got caught at a massage parlor while it was getting raided",
   "created_utc": 1693144129,
   "score": 6,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyi3nk",
   "message": "got mad at a kid playing with his ruler during class (springing it on the desk, in a way) so they snatched the ruler from the kid and slapped his hands with it several times until the ruler snapped in half. \n\nthankfully, the teacher never came back the next day :,)",
   "created_utc": 1693144568,
   "score": 5,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyms9a",
   "message": "Had a band teacher get mad at a student and stabbed his snare drum with a pen in front of the whole class.",
   "created_utc": 1693146648,
   "score": 6,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyqkdb",
   "message": "Well, (not my school but worth an honorable mention) Bishop McCort Highschool in PA: the one \"Brother\" molested a LOT of boys, SO many boys,  \u0026amp; killed himself when they found out. Years later,  the  computer teacher had an affair with a student \u0026amp; kidnapped her to Canada \u0026amp; killed himself in their hotel room.  \n\nCatholic School. Still in business. True story.",
   "created_utc": 1693148186,
   "score": 6,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyrlji",
   "message": "Used a sick day rather than a vacation day to fly to Japan to fight in mma. Got caught and was fired for improper use of time off.",
   "created_utc": 1693148609,
   "score": 4,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxytxmu",
   "message": "Forgot he had pepper spray in his handbag and went to the bathroom. The smart kid sent 12 colleagues to the E.R. 😂 \n\n(laughing about it cuz no one was seriously hurt)",
   "created_utc": 1693149555,
   "score": 5,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyxum9",
   "message": "Accidentally pulled a hijab off a girl (got caught on something)",
   "created_utc": 1693151122,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyy3wo",
   "message": "High School science teacher. Not so much fired as \"forced to resign\" for getting caught with a hidden camera in the supply closet in his class where he would let girls change for doing displacement experiments. A girl apparently noticed a red light or something, saw it was a camera, got tf out of there and went straight to school leadership. They came and apparently found the teacher frantically trying to delete footage. Resigning was better for the school's reputation, of course.",
   "created_utc": 1693151224,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyyg47",
   "message": "She wasn't even a teacher and used to teach us for months.\n\nShe smoked with us at the pauses.\n\nShe somehow got in there, and no one really knew how.\n\nShe probably got paid, but that adds to the mystery",
   "created_utc": 1693151357,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxxzx81",
   "message": "she hit children, I was one of them as well",
   "created_utc": 1693134265,
   "score": 10,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyhpwi",
   "message": "Seventh grade computer class back in 05, got caught literally \"red handed\" masterbating to porn/ pictures of kids from the school. We all knew he was a creep, but the way the class was setup, he was always hidden. He didn't realize that when they updated the system, even teacher computers would be recorded and sent to the district for review. I had him as a teacher, but not the class that they busted him in. A couple years after it happened, I had his brother as earth and science at the nearby highschool, and all he would ever comment is that he no longer has a brother.",
   "created_utc": 1693144391,
   "score": 9,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxy6wbq",
   "message": "Got caught looking at CP in one of the computer labs.",
   "created_utc": 1693138815,
   "score": 8,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyex2t",
   "message": "Priests and nuns don’t get fired. They get caught eventually.",
   "created_utc": 1693143068,
   "score": 9,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyii3f",
   "message": "Parents found out we where pooling money to pay a tutor to pass our exams. Went to the principal, made a big deal about it (as they should) and he was \"let go\" and we got a wonderfull teacher using his sparetime to help us catch up",
   "created_utc": 1693144751,
   "score": 4,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyjhag",
   "message": "Teacher threw a donut at an annoying student.",
   "created_utc": 1693145189,
   "score": 4,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxynwxm",
   "message": "Fired from my son’s school for creepy cannibal kiddie porn.  I used to chat with him at pickup;he seemed like such a cool guy.",
   "created_utc": 1693147112,
   "score": 4,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxypkqv",
   "message": "When I was in 5th, a 6th grade teacher got fired for feeling up girls backs and shoulders to check if they're wearing a bra. It happened to a few of my friends and he would inquire about the bra style. When I was in 8th grade (at a different school), our principal got fired because he was spanking kids in his office.",
   "created_utc": 1693147786,
   "score": 3,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxypm6c",
   "message": "My memory of this is kinda hazy since this happened 10 and a half years ago.\n\nShe was telling at us, I don't remember if anything specific triggered her episode but she said shit like \"I don't give a rats ass what you think\" and \"I wish I could use the paddle\" \n\nAlthough the one thing I'll always remember was before she sat down she said \"I'm going on Facebook, I don't care what the hell you do\" \n\nI guess she got fired the same day because we had a sub after lunch, and we had a new short term sub every few days before we got a long term sub for the rest of the year.",
   "created_utc": 1693147802,
   "score": 4,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyr627",
   "message": "Slept with one of the students consistently for over a year… he was a middle school teacher in his 40’s and she was a 7th grader. Very sad.",
   "created_utc": 1693148434,
   "score": 3,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyrdss",
   "message": "This happened a few years after I had his class. He was a cool dude and taught 8th grade history. But when he was teaching class one day, he hooked his laptop up to the projector to get the PowerPoint presentation going for that days class, and apparently he accidentally left very hardcore gay porn up on his laptop and projected it onto the screen in front of all the students. He was fired soon after",
   "created_utc": 1693148521,
   "score": 4,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyuij2",
   "message": "He freaked out because the 13 year old boys wouldn't stop running their mouths. He threw a textbook across the room and told the class he could kill someone with his bare hands",
   "created_utc": 1693149791,
   "score": 4,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyvdrl",
   "message": "Teacher at my school wasn’t quite right. Students and staff had been mentioning things regularly to the deputies…just noting they were a bit odd, said a few funny things, didn’t seem to quite be with the schedule. \n\nOne day she was supervising an exam and she shit herself. In the classroom. Then continued supervising. Eventually a kid left for a bathroom and desperately flagged down a teacher to ask for some help. \n\nShe left that day and didn’t return. She was weird but I hope she’s okay.",
   "created_utc": 1693150148,
   "score": 4,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxywj0e",
   "message": "College Professor- had too many complaints about grading and teaching practices. He taught Anatomy and I took his class for the first two weeks of a semester. He put us in groups and brought the anatomy dummy around and had us list the parts he pointed to based on our previous reading. My group was last and got all of 5 minutes. He promised we’d start the next class where we left off. He did start the class with us, but moved on to a completely different section. I quit his class shortly after to increase my work-study schedule.",
   "created_utc": 1693150603,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxy9fod",
   "message": "Oh you mean our principle when I was in prep? Pedophile.\n\nwhen we were at my nans for school holidays he was on the TV with a jacket over his head being led into court, thats how we found out. First day back at school the stand in principle said the former had a bad headache and wont be back.\n\nnana ran and turned it off. Whole town cover up since 1990, cant find his name, nobody talks about it, ever.\n\nweirder I remember saying to my mum one day while she washed dishes before his arrest, \" Mum, I dont like Mr ...., he looks at me funny\" and she froze for a minute and replied \"Maybe he thinks you are pretty\".",
   "created_utc": 1693140266,
   "score": 9,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxynw77",
   "message": "Damn, they didn’t.\n\nMultiple semi known affairs with students among the staff and life just kept on going…\n\nThe 80’s were a different time",
   "created_utc": 1693147104,
   "score": 3,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxywnjf",
   "message": "She got caught making meth when her in-home meth lab blew up lol",
   "created_utc": 1693150652,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyxr0h",
   "message": "My IT teacher had a fist fight with this big Samoan guy in my class and got fired later that day.",
   "created_utc": 1693151083,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyxs0z",
   "message": "He had a tv in his home, this was a Christian reformed school and tv where not allowed.",
   "created_utc": 1693151094,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyy84q",
   "message": "Showed a video made in the 60’s about how gay people are perverts and disgusting.",
   "created_utc": 1693151269,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyyynn",
   "message": "A kindergarten teacher came to school drunk and was teaching students about inappropriate stuff. According to my brother, (His freind told him) She wouldn't stop swearing.",
   "created_utc": 1693151578,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxydh9o",
   "message": "I had a gym teacher one year who refused to accept I was physically incapable of getting up on a balance beam; and said something so traumatizing to get me up that I have no recollection of it. I have no recollection at *all* of how I managed to stand up on the thing!\n\nWhen I got home, I told my parents. My very angry father spoke to the principal. The next semester, there was a new gym teacher.",
   "created_utc": 1693142372,
   "score": 5,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxydorq",
   "message": "He made plenty of sexual comments and jokes to girls my grade when we were in 7th. Some were directly in front of me. I was a junior when I found out he got fired for allegedly touching a female student inappropriately.",
   "created_utc": 1693142473,
   "score": 3,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxycbj7",
   "message": "This teacher in my hs got caught having phone sex with other high school girls. At first the girls claimed they were innocent. But then it turned out their dumbasses recorded everything. Thinking it would be funny. So they got kicked out also.",
   "created_utc": 1693141788,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxygwxm",
   "message": "She had sex with the brother of another employee in one of the school's bathrooms.",
   "created_utc": 1693144022,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyhqly",
   "message": "When I was in middle school (many years ago) a teacher was let go after he got arrested for selling drugs to students.",
   "created_utc": 1693144401,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyikwd",
   "message": "For having inappropriate sexual relations with her students",
   "created_utc": 1693144787,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyjp7r",
   "message": "There was this really perverted english teacher at my school who used to \"flirt\" with girls by sitting on their desks during class. Overall creep. He finally got fired when he \"joked\" that he'll accompany a female student to the washroom.",
   "created_utc": 1693145286,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyk86d",
   "message": "He was a science / driver's ed teacher and was taking girls to El Torito for margaritas ... I'm sure in several cases it went even further than that, but for myself and my girlfriends it never went further than that (in the late 70s).  Everybody loved him.  I was long gone from high school by the time he finally got fired.",
   "created_utc": 1693145525,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxykg5d",
   "message": "Met up with a student at a hotel she paid for. Did drugs and showered together. \n\nWas a pretty big news story here  😅.",
   "created_utc": 1693145626,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxykg8k",
   "message": "I heard my art teacher in middle school got fired for having sex with a substitute teacher in his class. That could’ve been a rumor though",
   "created_utc": 1693145627,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxylgc3",
   "message": "Sleeping with a student. Take as old as time",
   "created_utc": 1693146075,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxylyqw",
   "message": "He got drunk and molested a preteen student on a party. He was a sportsteacher.",
   "created_utc": 1693146296,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyn90h",
   "message": "Big scary PE teacher knocked the living fuck out of a guy in my year during a lesson, student started arguing with him \u0026amp; called him a “Scottish bastard” so the teacher fucking sparked him… he then proceeded to get the hairiest of sacks.",
   "created_utc": 1693146839,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxync2j",
   "message": "Sexually harassing minor girls",
   "created_utc": 1693146874,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyni2v",
   "message": "Volley ball coach fucked one of the girls on her team.",
   "created_utc": 1693146943,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxynn6k",
   "message": "Well this happened over an year ago, I had joined a coaching centre for the entrance exam preparation during my final year of high school. I hated the classes with all my might, It used to be good but later the head of the centre got greedy and started enrolling every single bastard who had money which resulted in many of my class bullies also coming to that place. But the worst of them all was the chemistry teacher. He was an uncultured son of a bitch who didn't even have basic manners, he used to swear at class, he used to dirty talk in the class and cat call the girls, he was only good at physical chemistry but didn't know a word or two about organic and inorganic but the worst part was that he was friends with all the bullies, he used to go hang out with them and sometimes even go out with them for drinks(he himself didn't drink BTW). And the worst thing for me was that he used to team up with the bullies and bully me, he used to call me names and I was the second most favorite target of them in that class. He would keep a blind eye whenever my bullies used to tease me and the worst happened when another teacher complained about the bullies in my class and this bastard decided tell the head that I was one of them to save his beloved students\n\nDuring last year July, one of my best friend didnt came back home on time, his mom got all worried up and started calling everyone and even called me we all had seen him leave with another friend to smoke after the classes had finished at 6:30 but he hadn't returned home even after 9. The next day we all came to know that these two bastards went with this chemistry teacher for a party, they drank till 10 and later this irresponsible piece of shit left them alone and these two assholes decided to go to a friends apparatment and smoke some joints. The next day my best friends mom showed up at the faculty and this son of a witch asshole had the audacity to take the responsibility of those two and said that they won't repeat the mistake again(they did it several times afterwards too). This was also the beginning of the end of my friendship with my ex best friend\n\nWe had also tried to complain about this guy a lot to the head, but we eventually stopped because everytime we tried to complain about him some mole from our class would inform him about that which would infuriate him further more. But this bastard didn't last long, during october some new girls came to the classes and they weren't gonna tolerate this guy. They decided to complain about his cat calling towards girls in the class but that didn't do much but later things got serious when one of the new girls complained to the teacher that this guy had messaged her privately and that was it, 3-4 more girls came forward and told the head and his wife(who was like the second in charge) about this guy who was in his late 20s or early 30s messaging these girls privately who were 16-17 year old girls. That was it, he was fired, we all rejoiced and I thought that now his favourite bullies are gonna be upset but NO, they just didn't care, they didn't care about anyone other than their little gang, they decided to lick the boots of the next guy who came so that they could become the new teachers favourite too and tbh they succeeded in that but I wasn't there to see it long, cause I left the coaching centre as soon as I realized that this place is doing more bad than good \n\nI decided to study on my own and was able to get a decent score in the state entrance examination and get into ECE at a good and known college of my city but now one of the bullies from that class is also with me in that college doing electrical engineering and I have to suffer that bastard for the next 4 years.",
   "created_utc": 1693146999,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxynv82",
   "message": "told a 13-14 year old girl that she “should’ve stayed in the sheets”. was also a huge pedo but nobody did anything until the parents got vicious. this is a public school which will hire literally anyone with little-no background checks.",
   "created_utc": 1693147092,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyodbx",
   "message": "At my school the new French teacher started screwing the old computer teacher, who was married to the geometry teacher.  At the end of it just the geometry teacher had her job and all the other two teachers money because she divorced the computer teacher and managed to sue the French teacher as part of an alienation of affection suit.  Then she hooked up with the metal shop teacher.",
   "created_utc": 1693147297,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxysk14",
   "message": "He got drunk and went driving naked, flashing truckers",
   "created_utc": 1693148995,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyv1fj",
   "message": "Ugh. I just fired a teacher for failing to provide the ECE units she said were in progress. She lied to me about it. What she doesn’t know is that she was also fired for stealing from me and stealing company time (All currently under investigation). She is facing some serious charges.",
   "created_utc": 1693150009,
   "score": 2,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyyhd1",
   "message": "Private school Pedo central",
   "created_utc": 1693151371,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyyvzz",
   "message": "Threw a shoe at a kid and broke his nose.",
   "created_utc": 1693151549,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyze4d",
   "message": "Football coach aka gym teacher having sexual relationships with the underage cheerleaders",
   "created_utc": 1693151742,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyzi7f",
   "message": "Robbed a bank wearing the same clothes he wore to school that day",
   "created_utc": 1693151784,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyzmhe",
   "message": "Bit touchy with the delinquent kid kept behind after school.",
   "created_utc": 1693151829,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz0l0l",
   "message": "Middle school teacher brought in her personal camera so students could record video projects. I guess she had a bunch of tapes in a box somewhere and just grabbed a random one for us to record over. She should have checked the tape first.\n\nWhen me and my friends did something dumb in front of the camera (can't remember what we did), we rewound the tape to record over that part. When we stopped the tape to see if we had gone far enough back, we realized we probably went too far.\n\nWhen we pressed play, the video that started playing was porn. We later found out it was our teacher's sister and new husband on their wedding night. Our teacher was transferred to a different school and we all had to have meetings with the school admin to talk about what we'd seen.",
   "created_utc": 1693152185,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz0lez",
   "message": "The drivers Ed teacher got a DUI. So he no longer could teach that class. He then became a PE teacher.",
   "created_utc": 1693152189,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz0sdn",
   "message": "Having sex with female students. It was quite common knowledge when I was at school but could never be proved. Fast forward 10 years and one girl Snapchats them both in bed to all her friends. He was arrested and sent to prison. Oh, and fired.",
   "created_utc": 1693152261,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz0vtq",
   "message": "She told the class she was pierced below the belt and it was done by her friend’s husband.",
   "created_utc": 1693152298,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz1des",
   "message": "A kid in the theater was sorting sticks and grabbed one that had a general gun shape. He brought it to his shoulder and mimed aiming down the sights. He said “look a hunting rifle” and the technical director said “no guns in school.” When the kid didn’t put the stick the teacher jumped up from his seat in the audience, ran across the stage to the kid, grabbed him in a bear hug, and swung him around in a classic ‘disarming’ manor before releasing the kid by throwing him into the wall. I witnessed the whole thing. Safe to say he did not come back the next day.",
   "created_utc": 1693152486,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz1qux",
   "message": "Debra Lafave had sex with my classmate and she did it while her husband was not home in the bed and she didn't get arrested just an interview with Matt Lauer",
   "created_utc": 1693152631,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz1sns",
   "message": "By fucking \"that girl\".",
   "created_utc": 1693152650,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz1tet",
   "message": "Our Biology Honors teacher had sex with a junior that year. Meanwhile his wife teaches downstairs. Apparently they stayed after hours one day\n\nThe year before I had a history teacher where my mom worked with his wife. To introduce ourselves, he had us make these video presentations depicting something related to the Revolutionary war. Turns out about a month after, he was arrested for possessing 24 Gigs of child porn \n\nReally makes me wonder if he possessed my film. Also feel truly terrible for his wife and children",
   "created_utc": 1693152658,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz262c",
   "message": "Kept naked photos of himself on his work computer and some students went snooping and found them.",
   "created_utc": 1693152796,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz27ob",
   "message": "I pointed out one teacher in one of my classes in high school that liked to get a little too handsy with the freshman girls. Not grabbing titty handsy, but rubbing their shoulders and snapping bra straps. Creepy as all hell regardless. Provided a sneaky video of it happening to one girl he particularly liked to harass. \n\nClass got a female sub that year who was actually pretty cool. The fired teacher was the only teacher I ever had any real issue with.",
   "created_utc": 1693152814,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz2ros",
   "message": "I got my mouth taped shut once in kindergarten. That teacher never taught again in NJ. Hopefully permanently banned from teaching anywhere.",
   "created_utc": 1693153031,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz2zbg",
   "message": "he read horse porn to the class. a student wrote and sent it to him for an “assignment”",
   "created_utc": 1693153111,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz3u61",
   "message": "Principal was stealing kid’s medication from the nurses office.",
   "created_utc": 1693153439,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz3vx6",
   "message": "He threw once of those apple pointer sticks at a kid half way across the room the hit the kid in the eye. It was a great throw and I hated that kid, but yeah he unsurprising got fired.\n\nEdit: This was around 1996",
   "created_utc": 1693153459,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz3ymd",
   "message": "No one ever got fired. There was this one sub that kept flirting with the girls in the 7th grade, my class, and even I heard him telling a girl to come to his house and drop something off, I went to my teacher and reported it. He said they would probably tell the guy to stop, and if he did, he would probably be ok. He was gone on Mrs than two weeks after that, so he must have kept trying.",
   "created_utc": 1693153488,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz3yto",
   "message": "He ran the school newspaper and in one issue they named all the couples that made out between classes and gave their locations on a map.\n\nSome students and their parents were not ok with this",
   "created_utc": 1693153490,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz4ajy",
   "message": "Teacher was a communist and got into a physical fight with a student who had strong ADHD to who she named «fucking ADHD kid». Parents got involved and it was straight out the door. No meeting",
   "created_utc": 1693153616,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz4kwy",
   "message": "my spanish teacher in high school would have \"friday talks\", where we would talk about current events (kinda sus right off the bat, this was a public school). eventually the topic of religion came up and this man completely seriously said \"atheists are all sociopaths because they dont have religion to give them a moral compass\". one my good friends in the class was the only one to fight back on this stance and he got sent to the office for it. needless to say that teacher wasnt back the next year. also i didnt learn any spanish in that class",
   "created_utc": 1693153728,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxychoh",
   "message": "Welllll i have one with a twist. So this was 8th grade I believe and the math teacher was beloved by all. I never had him but everyone loved him, heard amazing things. This kid, Jake, idk what happened but they had an altercation. Probably over him having a bad grade, it gets physical, supposedly. Jake comes back the next day with a cast. For months Mr. Garrison is out on unpaid leave. Then it comes out oh Jake, yeah he faked the whole thing. I don’t know if Mr.Garrison actually did grab his arm or not bc like I said I never took his class so I wasn’t actually there and everyone had a story at the time so who knows what’s real and fake. But I do know that Jake ended up getting suspended bc he lied and his family **allowed him to continue the lie** someone in his family was able to put the cast on him and they pretended. Unsure how it was found out, I think bc he didn’t go to an actual doctor and they needed an exam from a physician not just seeing the cast. Mr. Garrison was reinstated and didn’t have Jake in his class when he came back lol",
   "created_utc": 1693141875,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyr9gi",
   "message": "\r  \nGot caught getting high in her car between class periods",
   "created_utc": 1693148472,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyhf91",
   "message": "He didn't get fired for this but I think He shoud \nSo we were in exam hall and this one girl was talking to another girl while the exam was going on and our teacher got pissed he took the girls paper and said you don't have to write the exam and she was saying like sir i am so sorry sir my father will kill me sir mind you we were in 3th grade and when she said my father will kill me he asked first tell me how many father you have",
   "created_utc": 1693144257,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyqgi0",
   "message": "This teacher got caught making out with a student ( 18F) he just had twins with his wife. Ruin his life for a thot",
   "created_utc": 1693148142,
   "score": 0,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxymt05",
   "message": "Our best P.E teacher was fired a year after my graduation because the 7th graders complained that he was to tough on the workouts and would scream at them. Yes, he was very strict and he would scream to keep you running or working out kinda like a militar approach but those fucking snowflakes got him fired. \n\nAnother one resign, he wasn't fired, because of a scandal. He was hooking up with a 15 year old, he used to be a priest, he quit priesthood to marry his wife and the proceeded to cheat on her with a 15yo which in hindsight doesn't surprise me given he was a priest and all.",
   "created_utc": 1693146657,
   "score": 255,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyk1i1",
   "message": "Caught dealing drugs.",
   "created_utc": 1693145441,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxykdil",
   "message": "Dropping the \"N\" word to a few of the home boys. There's actually a video on YouTube of him explaining his reasoning for using it and how the way he said isn't bad.",
   "created_utc": 1693145593,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyny3j",
   "message": "We had a Canadian teacher around 2000, slept with a 16 year old boy and she was extradited.\n\nEdit - found a link\nhttps://www.dailymail.co.uk/news/article-98551/What-jury-didnt-know-teacher-cleared.html",
   "created_utc": 1693147125,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyof6z",
   "message": "Inappropriate AOL messages to a student. Luckily it never went beyond that.",
   "created_utc": 1693147318,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyp0g7",
   "message": "Music teacher at my school who gave private lessons on evenings and weekends. Got caught in a shower with his student and came out they were having a sexual relationship for a while.",
   "created_utc": 1693147562,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyr4b9",
   "message": "he came to school drunk and hit on girls and grabbed their ass",
   "created_utc": 1693148414,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxywalz",
   "message": "I can’t remember any teachers being fired at my school",
   "created_utc": 1693150512,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyxc2y",
   "message": "Cause she was a witch.",
   "created_utc": 1693150916,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxyz1ai",
   "message": "Raped a classmate and SA'd another",
   "created_utc": 1693151606,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz59tb",
   "message": "Married a divorced woman. This was a Catholic school in the ‘70s. He was also our principal and a great teacher.",
   "created_utc": 1693153994,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz5d4g",
   "message": "Music teacher told a student that if he had a moustache he would be the black hitler",
   "created_utc": 1693154029,
   "score": 1,
   "submission_id": "162n1d3"
  },
  {
   "comment_id": "jxz5eyd",
   "message": "High school volleyball coach/history teacher was fired for buying the team margaritas at Chilis for winning some big game.",
   "created_utc": 1693154049,
   "score": 1,
   "submission_id": "162n1d3"
  }
 ]
}