{
 "submission_id": "162rf9o",
 "title": "What's a small, seemingly insignificant decision you've made that ended up having a huge impact on your life?",
 "selftext": "",
 "created_utc": 1693145437,
 "permalink": "/r/AskReddit/comments/162rf9o/whats_a_small_seemingly_insignificant_decision/",
 "score": 83,
 "url": "https://www.reddit.com/r/AskReddit/comments/162rf9o/whats_a_small_seemingly_insignificant_decision/",
 "comments": [
  {
   "comment_id": "jxyliie",
   "message": "It took a random part time job out of desperation making wooden snowboard/skateboard racks. 12 years later I’m deeply imbedded in the woodworking industry and found a career. Didn’t see that coming.\n\nEdit: appreciate the gold, I’d caul that a classy move",
   "created_utc": 1693146101,
   "score": 133,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxyvas7",
   "message": "I was flying to Costa Rica to go backpacking south from there, my sister told me to fly into Guatemala, I had to see it. So I did, and here I am still 10 years later, with a son and a life I never imagined.",
   "created_utc": 1693150116,
   "score": 90,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxyw0fk",
   "message": "Was at a conference and stepped outside for a smoke. Bumped into a friend of mine who introduced me to the man he was walking with. That man encouraged me to apply for an opening in his office and, six months later, he hired me.\n\nIt was the job that jumpstarted my career, changing my trajectory. And all because of a bad habit.",
   "created_utc": 1693150399,
   "score": 64,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzkfax",
   "message": "I broke my hand playing soccer in high school (fell, landed awkwardly). Consequently, all I could do for gym class was walk a loop around the track the entire class period until my cast came off. A girl had a cast on her broken finger (hers got accidentally closed in a car door), so she walked with me every day, and we talked and hit it off.\n\n20+ years later we’re married with a couple of kids.",
   "created_utc": 1693159791,
   "score": 149,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz9x6n",
   "message": "My new desk job’s internet filter stopped me from going to my favorite websites. It didn’t block Boardgamegeek.com, however, so I ended up spending my downtime at work researching board games, game designers, and publishers. \n\nI read about a game I couldn’t find a copy of and put together a version of how I thought it might play. Later I found out I was totally wrong about how that game worked, but I preferred my version of the game. \n\nYada yada yada, I’m an award-winning board game designer now.\n\nEdit: sorry to disappoint, but this Reddit profile is far too incriminating to share my game (and therefore my real identity) with you guys.",
   "created_utc": 1693155789,
   "score": 12,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxyl93a",
   "message": "A kid's birthday party I wasn't planning to go to, I changed my mind at the last second, met my husband there.",
   "created_utc": 1693145988,
   "score": 219,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz5zxs",
   "message": "Took an art appreciation course in college. Had a career that had nothing to do with art, but I've spent at least part of every holiday since then touring museums in different world cities, and various states and provinces in the US and Canada. It's given me so much enjoyment in life.",
   "created_utc": 1693154272,
   "score": 34,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzcn4z",
   "message": "Accepted an invite to some dudes team on Overwatch (videogame). Now I live on the opposite side of the country with him and we have two dogs and a Costco membership.",
   "created_utc": 1693156826,
   "score": 19,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzaxym",
   "message": "Decided to work out again. I'm loving it and I'm so much happier.",
   "created_utc": 1693156181,
   "score": 222,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz349t",
   "message": "Grabbed a beer instead of going home early. I got offered a job when I was struggling to find a first job",
   "created_utc": 1693153165,
   "score": 26,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz9lq2",
   "message": "Playing wow, I picked druid.\n\nEnded up loving playing a healer. \n\nDecided to become a nurse IRL.\n\nStill like being on the healing team.",
   "created_utc": 1693155666,
   "score": 183,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz9j1q",
   "message": "I was walking out the door of work one day.  Phone rang and I decided to go back and answer it instead of leaving.  Quick 30 sec call and I was out the door.  Couple miles down the road was a bad multi car accident on a bridge.  Could have been me.",
   "created_utc": 1693155637,
   "score": 191,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxyp4af",
   "message": "2015, in Ukraine. Vinnytsia to be exact. \n\nWent to shop to buy a bottle of water. No gas, no flavor..just a simple water bottle.\n\nEnded up getting married with cashier who saw me a few times and was always curious to know what the fuck I'm doing in that part of the country.",
   "created_utc": 1693147605,
   "score": 17,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz4hkp",
   "message": "Decided to relax my leg while trying to kick the ball, missed the ball and fucked my knee up. 2 years later still hurts",
   "created_utc": 1693153692,
   "score": 137,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz6xew",
   "message": "I took a job in an Emergency Room doing insurance paperwork. I thought \"Okay but what happens before they get to the hospital?\" That exposure lead to a career as a 1st Responder. I never would have imagined I would be helping people in Emergencies been doing it every day for decades.",
   "created_utc": 1693154628,
   "score": 36,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxyq5kv",
   "message": "Checking out a new tea shop that opened up in my area. I became friends with the owner and she told me about a coding bootcamp, and less than a year later I had a great new career.",
   "created_utc": 1693148019,
   "score": 80,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz08l8",
   "message": "Commenting on a reddit post. Ended up moving to their country.",
   "created_utc": 1693152057,
   "score": 178,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz9j75",
   "message": "My wife and I met online in Texas in 2015.  My roommate got wifi and I ended up making a dating profile on POF and from the first I messaged her we hit it off, we have 3 kiddos now and are very happy together!\n\n\n\nIn early 2016 we went on a one week vacation to California and on the drive back to Texas we decided to move to Cali (we moved back to TX in 2019) just to try it out.    We got married in Cali and had our first 2 children there.  Before the road trip to Cali, moving there had never even been a thought to us!!!\n\nSo many variables left out but those some of the most smallest choices that ended up having huge impacts in our lives",
   "created_utc": 1693155639,
   "score": 156,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz0baq",
   "message": "Went for a jog even though I didn’t want to. Ended meeting a cute woman who was a bit of a motormouth but we had a lot in common. We ended up dating for about 4 years. We wanted different things and ended it but she’s still a fantastic friend.",
   "created_utc": 1693152084,
   "score": 245,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxys5yl",
   "message": "Watched a beginner blender tutorial series. Pretty sure that played a large part of why I got hired at my current company, and I just received a promotion after less than a year with a $10k/year raise that involves me using blender to make beauty renders for marketing material.",
   "created_utc": 1693148837,
   "score": 39,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzavsc",
   "message": "Grabbing lunch instead of skipping it in middle school, I was really depressed back then and I met my current friends there, my life has just bee way better, and I probably wouldn’t be here without them.",
   "created_utc": 1693156157,
   "score": 78,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzk1qy",
   "message": "Me and 2 other coworkers decided to grab some dinner after our shift. One ended up cancelling, so I thought my other coworker would cancel too. We were both hungry, so we decided to still grab dinner together. We'd been coworkers for over a year and have always gotten along, but this dinner truly felt like a first date. It was so enjoyable and we talked so much that we didn't realize the restaurant had been closed and that the workers had been cleaning up around us (servers were too nice to interrupt our conversation). Him and I ended up falling in love soon after that. Been together for over 6 happy years and wouldn't change a thing.",
   "created_utc": 1693159643,
   "score": 28,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz3thr",
   "message": "After completing 3 science degrees I wasn’t having a good time. Randomly decided to apply to get into medicine thinking that I’d never get in. Anyway, I’m a doctor now, love it and hate it but definitely changed my life for the better overall",
   "created_utc": 1693153432,
   "score": 219,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz5rbd",
   "message": "Going to the gym. Now a year later my life has entirely changed. I think different, I live different, I eat different.",
   "created_utc": 1693154179,
   "score": 174,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz60qo",
   "message": "I said  ok to hanging out with this dude (we've been hanging out for 15 years now)",
   "created_utc": 1693154281,
   "score": 66,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz28wd",
   "message": "As a teen I got curious about psychedelics and got an ounce of blue ape mushrooms. Didn’t know what I was doing and I ate the whole ounce. Never been the same",
   "created_utc": 1693152827,
   "score": 127,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzort7",
   "message": "Scratched myself up in the field in ROTC training due to my own stupidity. **Debated whether to go to the medical tent, since it was super minor. I ultimately did**, and the cot next to me was a cadet from another school that was in a unit more in line with my career goals. The cadet got me an interview with the commander, and when I graduated and commissioned, I was assigned there. In the first few months, I met my now-wife, who was also new to the unit. Nearly two decades of marriage later, we’re both retiring and traveling the world together.",
   "created_utc": 1693161483,
   "score": 211,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz5nlc",
   "message": "At 5 years old i decided to pick sides between my emotionally scared mother and my alcoholic stepfather.\nI picked the side of my step father....\n\nAt 21 years i figured out that that decision caused me to develop social adjustment disorder which i got diagnosed a year later.\n\nAfter 5 years of therapy and self reflection i got ready to move to a big city and go to university.\n\nI am still a little socially crippled but far far better than 5 years ago.\n\nIt took me quite some time but now i am able to talk to people.",
   "created_utc": 1693154140,
   "score": 148,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzjl30",
   "message": "Saw an absolutely gorgeous guy on a “dating” app. He was absolutely stunning, and so far out of my league . Normally I would never have messaged someone so  obviously attractive but I felt I needed to tell him that I thought he was the most attractive person I’d seen online. \nWe’ve been together 11 years, married for 7, and I’ve never been happier. \nOh and he thinks I am the hottest thing on legs, so that’s a huge bonus.",
   "created_utc": 1693159464,
   "score": 203,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz8b7v",
   "message": "Decided to go to my friend's weed dealer 'cause my guy was out. Ended up in a torrid, hellish love affair with said new dealer that I'm still climbing out of 4 years later.",
   "created_utc": 1693155163,
   "score": 62,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzqi25",
   "message": "People in the comments\n\n\"Applied to medical school... and what da ya know, I'm a doctor now\"",
   "created_utc": 1693162206,
   "score": 145,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzaehw",
   "message": "Decided to pursue medical school again after failing the first year due to kidney disease. Met my fiancé ❤️",
   "created_utc": 1693155973,
   "score": 70,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzqk5s",
   "message": "First month of uni, can’t wait to take faster bus home to take a dump and continue playing whatever. Cute girl I’ve helped with some computer tech class asks which bus I take as she thinks we live nearby, decide to “ugh, fine I’ll take the longer one”.\n\nIt’s eleven years later, quit drinking and smoking, have depression under control, finished two masters (was about to quit bachelors in the upcoming week), I’m petting our poodle, playing with our nine month old son while my super hot redhead, freckled, funnier than me, smarter than me, salt of the earth wife takes shower, and I’m asking myself how the duck I’ve got so used to this that I needed this post to get reminded how bloody unfairly lucky I’ve been, all thanks to deciding to hold that dump half an hour longer.",
   "created_utc": 1693162230,
   "score": 138,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxyucf3",
   "message": "[deleted]",
   "created_utc": 1693149720,
   "score": 55,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxyv9kf",
   "message": "Two roads diverged in a yellow wood,\nAnd sorry I could not travel both\nAnd be one traveler, long I stood\nAnd looked down one as far as I could\nTo where it bent in the undergrowth;\n\nThen took the other, as just as fair,\nAnd having perhaps the better claim,\nBecause it was grassy and wanted wear;\nThough as for that the passing there\nHad worn them really about the same,\n\nAnd both that morning equally lay\nIn leaves no step had trodden black.\nOh, I kept the first for another day!\nYet knowing how way leads on to way,\nI doubted if I should ever come back.\n\nI shall be telling this with a sigh\nSomewhere ages and ages hence:\nTwo roads diverged in a wood, and I—\nI took the one less traveled by,\nAnd that has made all the difference.",
   "created_utc": 1693150102,
   "score": 87,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz36jz",
   "message": "[deleted]",
   "created_utc": 1693153189,
   "score": 20,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzie4g",
   "message": "I was doing online dating with no success and I was ready to give up. I almost canceled my date just out of pessimism but figured it was already it’s already scheduled I’ll just go and if it doesn’t work out I’ll just take a break from dating.\n\nThe date lasted about 8 hours and 15 years later we’re still together.",
   "created_utc": 1693159004,
   "score": 101,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzjl88",
   "message": "Went to MoMA on LGBT parade day. Met a girl on the F train platform at Rockefeller center station. Met her again by chance a few months later. Now we have 2 kids, and moved to Europe to be closer to her family. It’s been 18 years since that visit to the MoMA.",
   "created_utc": 1693159465,
   "score": 32,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzk3we",
   "message": "Worked in a kindergarten during my gap years between high school and university (I didn't even plan to go at the time). A kid with speech and social issues happened to take a special liking to me, resulting in me ageeing to work closely with his speech therapist, despite only being the teachers assistant. This reignited my interest in language and made me apply to be a linguistics major. My high school grades made it a long shot, but it turns out that very year they tested out a new system of accepting 50% of students based on motivational essays, to try to combat a high drop out rate in linguistics. I made it in on that, they ditched it the next year cause it didn't work. I now have masters in Language Psychology and start teaching at the same university this semester. If I had applied literally any other year, my chances would have been like lottery odds.",
   "created_utc": 1693159667,
   "score": 99,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzmfiz",
   "message": "Took an antibiotic for a possible infection and was perfectly healthy before. Ended up with permanent nerve damage at 24 years old and it turns out I never had an infection to begin with.",
   "created_utc": 1693160566,
   "score": 44,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzdceh",
   "message": "going out of my shell for 2 seconds to try do some volunteering, grabbing a special invitation to an afternoon school because the director was involved in both programs which gave me my career and my favorite hobby",
   "created_utc": 1693157085,
   "score": 7,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzg7av",
   "message": "I'm terrible at Judo and dislocated someone's shoulder. Felt guilty so decided to learn First aid and found a course 40 mins from where I live. Met my wife there and I often think what if I didn't slip up whilst training...",
   "created_utc": 1693158162,
   "score": 67,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzgqsa",
   "message": "About 22 years ago I was fresh outta highschool and had no idea what I was going to do with my life.  I went out rollerblading one evening and I decided to go down this road that looked familiar.  I noticed a house and thought \"hey, that kinda looks like my buddy from HS's house,\" so I decided to knock.\n\nSure enough, it was his house.  He was having a LAN party that weekend and invited me to come over, so I did.  Ended up meeting this obnoxious kid who wouldn't leave me alone.  Kid ends up becoming my best friend and shaping the direction of my life.  He eventually convinces me to play World of WarCraft when it came out.  Roughly 3 years later I met my now wife in WoW.\n\nAll because I decided to go up and knock on a door.",
   "created_utc": 1693158372,
   "score": 105,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzhit5",
   "message": "My first job. Either a cashier in a grocery store or Taco Bell. The grocery store was closer to hone, so I went there. Met my wife, 30+ years later, still married, managing a grocery store.",
   "created_utc": 1693158671,
   "score": 24,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzhlnk",
   "message": "Bought a blender. Quick oats, natural peanut butter, frozen banana, protein powder, seeds or hemp hearts\n\nEvery morning. Super healthy breakfast. Energy for hours and hours",
   "created_utc": 1693158701,
   "score": 41,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzixtu",
   "message": "I stopped at a grocery store, and I saw a man standing next to his truck with a bunch of puppies. I approached him and ended up taking him my little angel of a dog. 🥹\n\nHe gave me her for free. ♡",
   "created_utc": 1693159216,
   "score": 66,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzjbm1",
   "message": "Started usind electric toothbrush about 7-8 years ago. Also, started brushing my teeth before goong to bed every day. My oral health has improved a lot ever since.",
   "created_utc": 1693159363,
   "score": 39,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxznnpc",
   "message": "I ran to catch a train home for christmas and just caught it. Thought I saw a friend of my sister two waggons in front so I made my way through that full train and found him. He invited me to go for a beer with his friends in the new year. Out of curiosity I went and met a really cute guy in that group. I typed my number into his phone because I wanted to be obvious. That was almost ten years ago, we‘ve been married for four. It blows my mind that if I didn’t run for that train our wonderful daughter wouldn’t even exist.",
   "created_utc": 1693161050,
   "score": 65,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxyxt04",
   "message": "Talking to someone about a comment on Reddit….changed my life ❤️",
   "created_utc": 1693151105,
   "score": 22,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxziyfb",
   "message": "Got hired at an agency providing personal care attendants. I was told I could work with seniors or people with disabilities (pwd). Working with pwd paid 25 cents an hour more. Went with pwd. \n\nEnded up working with pwd for 8 years, formed great friendships, served on volunteer boards of directors for non-profits, and met my wife. Now have three grandchildren. Going for the 25 cents an hour more set the trajectory for the rest of my life, I have no idea where I’d have ended up otherwise.",
   "created_utc": 1693159222,
   "score": 6,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzhysy",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxymf8z",
   "message": "Falling for that one girl in my late teens",
   "created_utc": 1693146492,
   "score": 14,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzb92f",
   "message": "One morning I turned the computer on.  Met my future husband in a genealogy chat room.",
   "created_utc": 1693156297,
   "score": 4,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzejq2",
   "message": "i girl i knew broke up with her boyfriend, texted to check up on her, ended up healing her and then dated her, she cheated, its been 2 years and I'm still heartbroken, lost alot of friends, got one year late in my studies,deleted all my socials, my family hates me because I became a rude person and lost all of my kindness and ended up being alone and broke. not blaming her tho cause texting her was my decision but yes I was never this person that I've become.",
   "created_utc": 1693157534,
   "score": 5,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzhxu8",
   "message": "Wanted to go to a college basketball game. Was kind of hanging out with this girl and she really didn't want to go, so I didn't force the issue and invited a friend instead. Wound up meeting the woman who became my wife that night. Been married 24 years now.",
   "created_utc": 1693158828,
   "score": 15,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzjs14",
   "message": "On my first day working in a new country, I accepted a lunch invite from a girl in the office. She's now my wife",
   "created_utc": 1693159538,
   "score": 6,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzm82z",
   "message": "Went to a going-away party for a coworker that I didn't really know but I had nothing better to do that evening. Met my husband.",
   "created_utc": 1693160486,
   "score": 15,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzy1ke",
   "message": "I started a savings account and actually put money into it, lost my job a couple years ago and it really helped out with the bullshit expenses and kept me from losing more.",
   "created_utc": 1693165370,
   "score": 1,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxykrws",
   "message": "Letting go of people that don’t serve me, even if it’s family.",
   "created_utc": 1693145775,
   "score": 14,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxyt19v",
   "message": "I joined Reddit due to the situation I was in at the time, and then I replied to a friendly post that popped up on my feed. It could have been really insignificant, but it turned out altering my whole life path as I knew it.",
   "created_utc": 1693149187,
   "score": 14,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz8qtg",
   "message": "within a week a dating, I let her talk to my mom!\nmy mom obviously thought there was something serious going on and that we’d been together for long enough to take it to the next level.\n\nOne thing led to the other, as my mom told my dad who told the uncles and aunts and I had to really make a lot of effort to explain that it was not that serious. But, the whole extended fam still judges me for breaking up with her.\n\nI mean peeps, it is my life and I get to decide what I do with it!",
   "created_utc": 1693155331,
   "score": 3,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzgu1a",
   "message": "Decided to go to some church classes for a joke with my mates - met my first girlfriend",
   "created_utc": 1693158407,
   "score": 3,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzij6o",
   "message": "Decided to (uninformed) take a small amount of psilocybin truffles with two classmates, had very small visuals a few hours later. Thought it was fun to do this with a good friend because of the visuals. End up having the most beautiful trip on a relative low dosage, listening to mainly Bon Iver’s sophomore self titled album, which is so gorgeous. That’s my favourite band now, that I watched five times live since 2012 (also was my first ever live concert), and became an elemental part of my life growing into adulthood. Because of that trip I now work as a psychedelic guide and am almost done with my first big year long education program. I want to become a licensed psychedelic therapist when it’s possible.",
   "created_utc": 1693159059,
   "score": 4,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzjfgd",
   "message": "I've been replacing my \"who cares anyways\" with \"I can always logout\" and gravitate more towards absurdism to make living worth while.\n\nI'm very nihilistic. I value life in general, just not mine.",
   "created_utc": 1693159403,
   "score": 22,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzl7no",
   "message": "Going for an hour walk every day. You are in better shape mentally and physically.",
   "created_utc": 1693160100,
   "score": 20,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzmqmp",
   "message": "I need a coffee..",
   "created_utc": 1693160687,
   "score": 4,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxznako",
   "message": "I bought 150 BTC when it was $10\n\n\n\nThen I forgot/lost my seed\n\nDon't worry shift manager Peggy, I'll be there at 5am tmro",
   "created_utc": 1693160905,
   "score": 5,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzoz01",
   "message": "I put a $2k trip on a credit card 10 years ago. That balance has been up and down, never below 2k. But currently closer to $10k.",
   "created_utc": 1693161564,
   "score": 13,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxyv8zj",
   "message": "Hanging out with Laura.",
   "created_utc": 1693150095,
   "score": 13,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzo4l6",
   "message": "The decision to stop drinking. I wasn't addicted or anything and only drank occasionally. However, I got into a depression and a burn-out. When you are stripped of many joys in life, you automatically start seeking refuge and escape. You see how thin the line is between having a glass of wine to drinking yourself to unconciousness because the darkness is overwhelming. It would seem like the easy way out. While it didn't help me to get out of my depression in itself, I got out of it better because I stayed away from things that feed escapism. \n\nIt's better to be a recovering *depresso* without an addiction problem.",
   "created_utc": 1693161231,
   "score": 25,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzej09",
   "message": "A little over a year ago, I read a fanfic and something in my brain was telling me that I should comment (something I rarely do). Did this for another month or two until I decided to leave my discord on one my comments.\n\nWe now message each other every day, and we even met in person back in June to attend a convention together. She's my best friend, and it all came from one silly little comment I left on her story.",
   "created_utc": 1693157526,
   "score": 12,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzesvg",
   "message": "In basic training, I decided to take 30 seconds to help a kid properly fold one of his t-shirts in preparation for an inspection. Because of this, when the inspection was being conducted, as the instructor went through my wall locker, he found some dust on the bottom of the rail the drawer slides on. I didn't have time to wipe that down. I got washed back two weeks, because it was the end of the year and there were no more groups right behind mine. \n\n\u0026amp;#x200B;\n\nMeanwhile, [Minot](https://en.wikipedia.org/wiki/2007_United_States_Air_Force_nuclear_weapons_incident) Air Force Base just had a huge nuclear missile incident. Almost all of my team from tech school training (military police) was sent to North Dakota. Everyone from my original group in basic training was sent all over the world. \n\n\u0026amp;#x200B;\n\nI met my first and second wives in North Dakota, and I have two kids out of it that I love very much.",
   "created_utc": 1693157632,
   "score": 14,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzhz5t",
   "message": "Got tired of dating apps and not finding anything long term. At the beginning of the COVID shutdown I decided to look into dating websites even tho they were old and clunky and not very user friendly. \n\nEnded up finding my wife there. 😊",
   "created_utc": 1693158842,
   "score": 8,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzratj",
   "message": "Deciding to talk to someone who was angry at his results during a test in class (we were both 15M)\n\nWe became best friends incredibly quickly, having incredible fun together, wanted to start our rock band, hell he fell in love with a girl and I was heads over heels for her own best friend... what a crazy time!\n\nBut when died just two months after that, of course everything just crashed down. At the funeral, I was the only representative from high school with our French teacher, with whom he practiced theater. When she mentioned it to me, I proposed to take his place in the play that was being prepared for the end of the year...\n\nWhat followed was an amazing adventure of two years of building back my self confidence, meeting incredible people, having an incredible time, which allowed me to end my highschool after my last play with the troupe, and receiving a thunderous round of applause after the eulogy I did at the end of said play - he was the most comedic person I've ever met, of course I asked for a celebration instead of a minute of silence!\n\nAimery, it's been 11 years already but I wouldn't be half the man I am without the few months we had together. Just like you I don't believe in life after death, but if there's one person I'd be dying to meet again, of course that'd be you, bloody moron! 😁",
   "created_utc": 1693162533,
   "score": 19,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jy044bq",
   "message": "I volunteered feeding the homeless at a local church years ago, now I’m in a senior position addressing homelessness for the city of Los Angeles.",
   "created_utc": 1693167834,
   "score": 76,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzgnrm",
   "message": "TLDR: 401K saving....\n\n\u0026amp;#x200B;\n\nSaving for retirement..... Just got out of the Army (1996 time frame)and was about $15K of credit card debt, joined civil service. Pay was $29k / year, but I always set aside 10% for retirement. When you don't make much it's not a lot to set aside. \n\nThe government did 5% matching up to 5%. As I got older I ramped it up to the maximum and never looked back.\n\nNow nearing retirement I'm looking at a very nice retirement and no need to depend on Social Security.",
   "created_utc": 1693158340,
   "score": 14,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzhjdw",
   "message": "I decided to get roommates in my house for some extra income. I was charging $700, which in my upper-class neighborhood is low. This cute Filipina girl came to look at the house but said she could only afford $500. I let her move in.. (I think we know why). After a few weeks, we started dating, and now one year later she is pregnant with my child.",
   "created_utc": 1693158677,
   "score": 6,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz12qi",
   "message": "That time I said YES when I really wanted to say NO",
   "created_utc": 1693152372,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxz8wyx",
   "message": "Stoicism",
   "created_utc": 1693155398,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzanbt",
   "message": "Just the tip",
   "created_utc": 1693156067,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzctrw",
   "message": "Replied to a Whisper post. Ended up turning into meeting and dating a wonderful man who I thought I would spend the rest of my life with.",
   "created_utc": 1693156896,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzeket",
   "message": "Deciding not to go to my school to go with my mom to her school and help her out in her classroom. I Ended up meeting my Boyfriend there ❤️",
   "created_utc": 1693157541,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzfsv0",
   "message": "I accepted a friend request on Facebook from someone I’d never met or spoken to. She became one of the most important people in my life. Traveled internationally for the first time in my life to meet her family. I only wish things had worked out in the end, I would have happily married her.",
   "created_utc": 1693158009,
   "score": 7,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzgga8",
   "message": "Taking that one extra tab 😵‍💫",
   "created_utc": 1693158260,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzglaf",
   "message": "Joined a Minecraft RP Discord server in early 2020. Met my bf there, who basically saved my life from me.",
   "created_utc": 1693158314,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzi10h",
   "message": "Turning down my dream job at Lucasfilm",
   "created_utc": 1693158863,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzi2gz",
   "message": "I visited my late father's childhood hometown to take part in a family reunion kind of event. Before I left, I asked through Facebook if any of my old classmates (I went to a vocational school a couple of towns over) would like to meet. Didn't think much of it. \n\nI ended up meeting a classmate and her family in my dad's hometown, and staying over the night and making business plans. Due to these plans, I ended up moving to the town a year after. The plans fell short due to illness, but regardless, I ended up getting my first permanent summer job in my life. I had never dated or been in a relationship before, but in a few years of time, I ended up dating my classmate's stepson. I've met way more people and gained way more hobbies, interests, and experiences than I ever did living elsewhere. I've had my happiest 6 years in my life while living here. Now were looking into moving to the UK, which equally excites and terrifies me. \n\nAnd this all started because I asked if anyone wanted to see me on a whim.",
   "created_utc": 1693158879,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzilnf",
   "message": "Dating a deranged girl.",
   "created_utc": 1693159086,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzjwhu",
   "message": "In 2015 I invested a few thousand in counter strike items that are now worth a small fortune",
   "created_utc": 1693159586,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzl2en",
   "message": "When I was younger I bought a pair of pinstriped slacks and a chain pocket watch because I thought it'd look rad. \n\nI signed up for a sears credit card to save 50% or whatever and then paid it off right away. \n\nThat early credit card gave me a head start on a long credit history which in turn has contributed to a great score (800+). Helped with vehicles, a house, etc.",
   "created_utc": 1693160042,
   "score": 35,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzltyy",
   "message": "Not me but\nI was on my bus leaving for home after school i sat on my regular by the emergency exit. I normally sat alone in the bus even at times when it would be fully packed then one day we had a few more children on the bus so  this girl asked me to sit beside me and i said yeah sure and exactly one year later she's my girlfriend.",
   "created_utc": 1693160339,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzm0e7",
   "message": "Which clubs and societies I joined at university in my final year. Met the girl who became my wife not long after. 25 years later, 2 kids almost grown up. All because I picked jiujitsu rather than canoe club.",
   "created_utc": 1693160406,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzm70j",
   "message": "Met a girl from the other side of the planet in a random videogame server.\n\nHit it off with her\n\nWe visit back and forth for a couple of years.\n\nShe moves to my country for around 8 years. Decide we've lived here for a while let's try her country for a while.\n\nIn 2019 I get cancer so the plans get thrown on hold\n\nBy 2021 covid is in full swing\n\n2022 we get the visa\n\n2023 we move to her country\n\nLess than 3 months later my bipolar father commits suicide and I presume it's my fault for leaving and not supporting him.\n\nBecome aimless, wish I could just lie under a tree and turn to dust\n\nRead this post.",
   "created_utc": 1693160475,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzm7sn",
   "message": "This could have had a huge impact, a few years ago (when I was a minor) I worked at a job, long story short, the supervisor ended up being a pedo, he’s in jail right now for it. One day halfway through my shift, he asked me if I had a ride home and offered me one, I didn’t think much of it, just thought he was trying to be nice and welcoming as I was new to the job, and then a year after I left seen the article about him getting caught at work. Idk what he could’ve tried had I said yes, just shows you never really know what some people are about.",
   "created_utc": 1693160483,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxznmrr",
   "message": "To go for a second drink with a girl I wasn’t sure about. 4 kids and 20 years with her",
   "created_utc": 1693161039,
   "score": 7,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzo7lo",
   "message": "I don’t know about huge impact but I randomly watched a video on YouTube about the Seattle Mariners and became a baseball fan. This after having absolutely no interest in the sport the first 32 years of my life.",
   "created_utc": 1693161264,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzof7m",
   "message": "Took a job out of state that was supposed to only last a month. It lasted almost a decade and they were the most fun years I've ever had",
   "created_utc": 1693161345,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzouu2",
   "message": "Becoming friends with the two nerdiest guys at my job (we'll call them Nate and Tim) led me to meeting my husband. And before anyone asks, my husband was not Nate or Tim, bit instead Nate's brother.",
   "created_utc": 1693161518,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzov7e",
   "message": "Had the choice to go out with one housemate or stay in with the other and play video games with his friend. Stayed in, met his friend who was visiting. 12 years later, my current career, my close friend group \u0026amp; my partner I met all from this friend-of-a-friend.",
   "created_utc": 1693161522,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzoxs6",
   "message": "Went to a football (soccer) game in Germany. Met my now girlfriend there, few months later migrated from the Netherlands to Germany to move in together. One year anniversary coming up soon!",
   "created_utc": 1693161551,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzp2gv",
   "message": "3 month work cover for a friend in London. 30 years later in Oxford with 3 children.",
   "created_utc": 1693161608,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzpemk",
   "message": "Found a book by the name \"God and the new physics\" at my grandmother's place when I was 12. Now I finished a master's in physics.",
   "created_utc": 1693161749,
   "score": 11,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzpipe",
   "message": "Moved into an apt over another one. Met a girl who lived next door and got dogs together. Even though we aren’t together anymore I am a life long dog owner (never thought I would be) and met all of my best friends to this day there. Had I moved into the other apt I never would have gotten dogs and never would have met my current friends.",
   "created_utc": 1693161796,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzpje3",
   "message": "Moved into an apt over another one. Met a girl who lived next door and got dogs together. Even though we aren’t together anymore I am a life long dog owner (never thought I would be) and met all of my best friends to this day there. Had I moved into the other apt I never would have gotten dogs and never would have met my current friends.",
   "created_utc": 1693161803,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzpo2u",
   "message": "Entered the green card lottery. Friend was trying to figure out how to do it, so I downloaded the instructions and completed an application to show them how. Since it was easier than asking them for all their info, I made a dummy application using my own info.  When I was done I thought “meh, might as well” and dropped my application into the outgoing mail. Then forgot all about it. I was highly confused when, nearly a year later, I got a letter from the state dept. \n\nI’ve been in the US for 20 years now, married, kids, the whole thing. Biggest change I ever made, and it was just a random 15-minute thing I did to help a buddy",
   "created_utc": 1693161859,
   "score": 99,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzpugt",
   "message": "Moving to the other end of a state for a guy. We broke up soon after, and I'm still here 20+ years later.",
   "created_utc": 1693161933,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzq7nl",
   "message": "I replied to a question from another user on a forum. We ended up texting a lot, visited, fell in love. Got kids now. We ended things, but I'm happy as can be about my kids that I love more than anything.",
   "created_utc": 1693162087,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzq7pz",
   "message": "Was struggling in architecture college. I started studying to become a software engineer. I was a natural. And I learned how to just create some small games as a pastime",
   "created_utc": 1693162088,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzqfzt",
   "message": "Learning to play guitar, out of curiosity and love for music i just decided to learn guitar, 1 year later already have huge shows in theatre rooms etc. Still aint got the balls to learn music theory.",
   "created_utc": 1693162182,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzqgyi",
   "message": "I asked a new hire coworker how training was going and had a semingly normal conversation. 20 minutes later I was harassed in my supervisor's office bc the new hire complained. I brought it up to the manager and was told it would be handled. Next week I got pulled into the office and was \"offered\" to change roles to work from home. \n\nWFH gave me time to reflect on my life and figured out I had ADHD, went back to school and finished my undergrad. 3 years later I'm still in the same position, that new hired left, supervisor leaves me alone. Haven't done anything with my degree but I've learned a lot about myself, taking medication and getting proper counseling for unrelated things. \n\nAll from a nice simple conversation.",
   "created_utc": 1693162193,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzqhnb",
   "message": "Asked my mom about a flyer on the table when I was applying for colleges. Had not even thought about attending this college until then and it’s where I ended up going and I ended up permanently setting up in that city. I never would have met my friends or for that matter, my ex friends. Who knows where I’d be instead?",
   "created_utc": 1693162201,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzudzv",
   "message": "I chose to be nice to everyone in high-school, even the kids people thought were weird. Fucked my life up pretty bad 10 years ago and recently got a call asking if I wanted to train as a software developer by one of those kids. I was frying chicken in a gas station for scraps. Dude told me he remembered me being smart and into that stuff and knew I could learn fast",
   "created_utc": 1693163819,
   "score": 62,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzv2i2",
   "message": "I picked up my guitar the first week of college and noodled on some Zep riffs. A Zep fan happened to be visiting my floor and came to chat...ended up great friends through college and after.",
   "created_utc": 1693164107,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzvqbt",
   "message": "Doing like 5 push ups a day when I was 13",
   "created_utc": 1693164387,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzw01y",
   "message": "After I dropped out of grad school, I was working in a crappy fast casual dining place just to get some money while I looked for a real job, but I wasn't having much luck.  Got bored one slow day and started browsing imgur while waiting for customers.  I saw a post about jobs and how nobody was hiring, and a comment by some random guy said his job was always hiring.\n\nDecided on a whim to DM him and ask what he did/what company, etc.  Nearly a decade later now, I'm a highly paid, highly sought after consultant in IT Asset Management.  Never even would have thought to apply to positions like it with my background if I wasn't getting desperate.",
   "created_utc": 1693164506,
   "score": 2,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzx5e4",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzyq0d",
   "message": "I went to prison for a robbery. I did it. I was a heroin addict. After almost 5 years in, at a work center, I got a write-up which would make me stay in for a few months longer. The warden offered a deal if I would paint a mural at a local high school of their mascot, they'd forgive the writeup. I had always been good at drawing (they knew that which is why they asked) but had never done a mural. I figured out how to scale it up in my head and did it. I got out about 6 months later and made it my career. I'm now married, happy, and fully booked until summer of next year for work, owning my own business. In September, I will have been out for 10 years. I also hid my initials in the high school mascot mural.",
   "created_utc": 1693165651,
   "score": 91,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jy03bza",
   "message": "I had a blog where I couldn’t figure out some HTML code, so I emailed the blog of another person who had figured it and they sent me the code.\n\nThey lived about 1,000 miles from me and had never spoken before.\n\nFour years later we’re married, bought a house, and have a child together.",
   "created_utc": 1693167520,
   "score": 50,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jy02g4i",
   "message": "Nearly didn’t go to a blind date but he was my soulmate.  I knew in a blink when I met him.  Lasted 33 years and I still miss him…",
   "created_utc": 1693167162,
   "score": 31,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jy08x1m",
   "message": "Went to a bonfire, met a random person who diagnosed me with a serious illness that I immediately got treated for and now I’m living life healthier, happier and more fulfilled than ever before.",
   "created_utc": 1693169774,
   "score": 25,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jxzxkyc",
   "message": "Started working at age 16. My supervisor suggested I sign up for “Profit Sharing” a 401k precursor.  Stayed with that company for 25 years, made a nice contribution to my retirement later in life.",
   "created_utc": 1693165179,
   "score": 21,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jy06c8e",
   "message": "I was with my mom at a bar in paris. She was a pain in the ass about what specifically she wanted to eat.. so we left without finishing the drinks. 10 min after the bar got shot by terrorists.",
   "created_utc": 1693168737,
   "score": 23,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jy03o7v",
   "message": "On Friday 1st August 1997, I was going to go straight home from work, but a colleague talked me into going to the pub for \"a quick pint\"\n\nTwo hours, a couple of shared joints \u0026amp; 4 pints later, I got on my pushbike \u0026amp; made it about a quarter of the way home before coming off at the bottom of a steep hill \u0026amp; nearly getting killed.\n\nI was supposed to be going on a residential course the following Monday, but I was in hospital.  I had to re-book onto another sitting, five weeks later, and 300 miles away.\n\nAnd that's where I met my wife - who was living overseas at the time, but by coincidence was planning to move back to where she grew up - literally walking distance from where I was  living at the time.\n\nNot only did the accident cause me to meet the woman currently sitting next to me on the sofa, but forced me to completely reassess my life.  I got my drinking \u0026amp; drug abuse under control (and have since gone sober sober), and got me off the self-destructive path I was on.",
   "created_utc": 1693167656,
   "score": 40,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jy03z7e",
   "message": "I had no direction in college, so after year 3 I decided to take a break and just work. I already had a part time job on the books and a friend encouraged me to look into a position he knew about in pharmacy. It was off the books, I had free time, so I decided to give it a shot. My boss taught me everything and had patience with me. I took to it like a fish in water and worked 2 part-time jobs while I decided what to do about college. 30 something years later, I'm licensed and proud to say I've learned ALOT. That part-time, off the books gig, developed into a recession proof job in healthcare that made it possible to provide for myself and family. Never thought I'd be in healthcare, and steadily climbed that occupational ladder. Don't be afraid to jump into new areas, ESPECIALLY if the support/training is there.",
   "created_utc": 1693167777,
   "score": 17,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jy069u7",
   "message": "21st December 2014. A girl I was crushing over at the time and had some casual flirting with, was going to a party, but having asked her out the day before and been turned down, I decided to sack the party, go see my family early. I headed home a day earlier than planned for Xmas. Was living in Glasgow, took the train from Queen Street Station. Got the 14:39 train back home with no issues. \n\nVery next day on the news. Bin lorry had crashed into Queen Street station around half past 2 in the afternoon, driver had a heart attack and lost control of the vehicle and killed 6 people. The place where it crashed, I was walking by, with earphones on 24 hrs before. \n\n\nSo yeah I didn't die because a girl turned me down and I decided not to head to the same party. Life's relentless.",
   "created_utc": 1693168710,
   "score": 11,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jy01czj",
   "message": "I had just moved to Florida from PA with my brother, and we decided to grab lunch at a restaurant we’d never been to before. Got to chatting with the waitress, explained we were new, etc. She brought over her manager \u0026amp; he offered me a job on the spot. Met a cute bartender and 10 years later, we’re married with a 5 year old. Live in a new big city together. Just jumped on the gravy train of life head first by picking that place to eat at.",
   "created_utc": 1693166725,
   "score": 11,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jy06zwn",
   "message": " Had dropped out of college and then decided to return. Applied for housing and the housing office gave me the choice between two rooms. I chose one and ended up dating the Resident Assistant on my hall. We married three years later and just celebrated our 26th anniversary.",
   "created_utc": 1693169001,
   "score": 10,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jy072vq",
   "message": "18 years ago, I had gone to Dallas to see someone for the first time whom I had met online.Those were the days of AOL chat rooms. Went to a movie and a dinner, came back to my hotel and by 9 pm was already asleep. Then another girl calls me and wakes me up. She knew I was coming to Dallas to meet another girl. I was annoyed that my sleep was disrupted. I picked the phone while grumbling.\n She said. I live not far from your hotel, we can grab a coffee. I was too lazy to get dressed up but I said I can meet you in the lobby for a little bit, I have an early morning flight back to St. Louis. She came, we chatted for a little bit and then got into her Honda civic to get coffee at local Albertsons! Her driving kinda scared me, dropping F bombs while jumping through red light. In any case, I had to have a coffee date in Albertson's parking lot in my shorts and Hanes T shirt. We got married 3 months later, my life is a million times better due to her, we have a wonderful family with three kids. I can't thank the stars enough that I picked the phone. I can't imagine my life without her. I told her that her fancy Nokia phone which lit up when a call came totally impressed me and that's why I decided we are going to get married. Both of ours first relationship too!",
   "created_utc": 1693169035,
   "score": 10,
   "submission_id": "162rf9o"
  },
  {
   "comment_id": "jy07aae",
   "message": "Was talking about communication encryption on a conference panel moderated by my friend and I gave an example about unsecured Russian comms from the Russo-Japanese war of 1904-1905. I was a full-time programmer back then.\n\nAfter the conference ended, my friend came to me and said \"Hey, I just started a new magazine, would you write an article about the Russo-Japanese war for me?\"\n\n\"Yeah, sure, why not.\"\n\n10 years later, \\~ 1000 articles later and 8 books later, I am somehow a fairly known author/journalist/blogger, and someone started a (Czech) Wikipedia entry about me.\n\nStill do some programming in Php, Python and C++, though.",
   "created_utc": 1693169117,
   "score": 8,
   "submission_id": "162rf9o"
  }
 ]
}