{
 "submission_id": "162wnsm",
 "title": "If suitcases could talk, which travel story would yours tell?",
 "selftext": "",
 "created_utc": 1693157768,
 "permalink": "/r/AskReddit/comments/162wnsm/if_suitcases_could_talk_which_travel_story_would/",
 "score": 191,
 "url": "https://www.reddit.com/r/AskReddit/comments/162wnsm/if_suitcases_could_talk_which_travel_story_would/",
 "comments": [
  {
   "comment_id": "jxzhceq",
   "message": "\"This bastard keeps me hostage on top of his wardrobe and doesn't let me go anywhere\"\n\nCan't afford a holiday lol\n\nIt gets dragged through the mud for camping once in a while",
   "created_utc": 1693158604,
   "score": 86,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzgo19",
   "message": "After getting drenched in Southeast Asia during monsoon season, dragged along rough cobblestone paths in Europe, getting vomited on in Las Vegas, and forced to roll around in the piss covered floors of airport bathrooms all over the world, I don’t think my suitcase would have many nice words to say about me.",
   "created_utc": 1693158343,
   "score": 45,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzibim",
   "message": "\"After a few days in Tokyo, he started calling me the 'damn heavy object' he had to lug around the rest of Japan. Too much shopping, boy!\"",
   "created_utc": 1693158976,
   "score": 11,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzn86g",
   "message": "This lazy bastard lives out of me for the next month after he gets back from anywhere",
   "created_utc": 1693160878,
   "score": 18,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzfwgd",
   "message": "The time the rental call was illegally towed and I had to steal the suitcase from the trunk.",
   "created_utc": 1693158047,
   "score": 13,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzi6ca",
   "message": "I lay here dusty and stored\n\nempty and bored.\n\nhaven't been anywhere in a very long time\n\nthe last time I was packed\n\nthe trip got sacked \n\nand that was in 1999",
   "created_utc": 1693158921,
   "score": 32,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzmh89",
   "message": "So get this, right, this guy - he spends like 4 hours a day for a week researching a million different sets of luggage. Reading reviews, looking at pics, the works. Okay, and get this, he buys me, and I'm not cheap, I'm not cheap. But this putz rarely ever travels! I get to his house and he shoves me into a storage room. I've been used like 2 times and he only ever brings my medium sized case. The large and small have literally never left. This moron spent all that time researching for quality just to go on one trip every 2 years or so. \n\nOh, and he sucks at packing too. Plastic bags, stuff thrown about. He's worthless. But the storage room has been nice. I've gotten to be good friends with all the exercise equipment he doesn't use.",
   "created_utc": 1693160584,
   "score": 15,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzmw66",
   "message": "“man, my most recent travel was the worst. First I was thrown in a big ol dusty moving trailer, being tossed and turned around for what seemed like forever! Next thing I know I was thrown in a hot cabin left to rot (I made a friend though, his name was Winfery the wolf spider). The whole trip I was stuffed full with smelly clothes, dont even get me started on the socks! And to make matters even worse, I was woken up every morning at 6:30am by some guy with a speaker blasting marching cadences! Thank god its over.”\n\n*a few seconds later*\n\n“Wait, i’ve just gotten word that i’ll have to do it again *next* year. Save me from my pain, please”",
   "created_utc": 1693160748,
   "score": 4,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxznh13",
   "message": "This bitch messy as fuck.",
   "created_utc": 1693160976,
   "score": 3,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzfdp1",
   "message": "The one where me and my mates were playing the infamous \"who can shout bomb the loudest\" game and got the teacher in trouble.",
   "created_utc": 1693157848,
   "score": 7,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzjxwp",
   "message": "\"that dummy dragged me through downtown Chicago during the -30F temps to get from the L to Ogilvie. He almost lost his hands to frostbite because he forgot the gloves he packed inside of me\"",
   "created_utc": 1693159601,
   "score": 3,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxznkbs",
   "message": "sittin in my closet ☹️",
   "created_utc": 1693161013,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzoj60",
   "message": "\"the tale of the dumb bitch who got scammed by a New York hotel so she had to live at the airport for a week while the bank tried to get things sorted\"",
   "created_utc": 1693161388,
   "score": 2,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzhfxl",
   "message": "Being tossed around at Pearson Airport and being forgotten in some pile only to be found weeks later.",
   "created_utc": 1693158641,
   "score": 4,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzifbz",
   "message": "Neglect and abuse Im thinking.",
   "created_utc": 1693159017,
   "score": 2,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzfi1b",
   "message": "I think he'd be talking about a lonely girl who's been to beautiful places but has no one to share the joy of traveling with.",
   "created_utc": 1693157894,
   "score": 3,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzk9qc",
   "message": "that \"i haven't travelled anywhere in over 2 years\"\n\ni don't like the tourism BS so i don't want to go.",
   "created_utc": 1693159730,
   "score": 0,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzl2oi",
   "message": "About the time they were kidnapped by a random woman and refused by a flight attendant!",
   "created_utc": 1693160046,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzlj1l",
   "message": "Probably our trip to Mexico lol also brought back a bunch of tequila 😂",
   "created_utc": 1693160221,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxznk1k",
   "message": "Oh, we have a suitcase in my family that's damn near a family heirloom.\n\nIt's an old gray/blue suitcase, and I have no idea where it originated.  My sister and I used it when going back and forth between my dad's house and my mom's house. \n\nHow it's survived all of these years, I don't know.  It's been used and abused since the early 80's at the least.  My sister and I used it for all sorts of imaginative things.",
   "created_utc": 1693161010,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxznkta",
   "message": "Mine would orobably tell the police how the body ended up in it. That would not please me so thank god they can't talk. AMIRIGHT?!",
   "created_utc": 1693161018,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxznuwu",
   "message": "Probably would be coughing with all the dusts it accumulated in my storage.",
   "created_utc": 1693161127,
   "score": 0,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzowp5",
   "message": "For me: Big backpack that stays in the hostel/hotel and a smaller ultralight daypack to carry around.\n\nMy Setup: Lowe Alpine Cerro Torre 65:85 + MindShift Gear UltraLight Dual 25 L\n\nThe Mindshift was designed as a camera bag. But it turned out to be extremely good day pack too.",
   "created_utc": 1693161539,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzoy4k",
   "message": "If I'm on a vacation staying in one room for the duration, a suitcase.\n\nI'm staying in more than one place, backpack.",
   "created_utc": 1693161555,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzozja",
   "message": "Mine would just complain about how I ride him around the airport when I’m lazy lol",
   "created_utc": 1693161572,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzp4wm",
   "message": "Story about sitting in a car for 14 hours",
   "created_utc": 1693161636,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzra1g",
   "message": "That I never unpack until I’m about to travel again.",
   "created_utc": 1693162524,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzsvtz",
   "message": "I was in Airport in Detroit where they put me right back on the next plane (and I think another one, can't remember) to Los Angeles, where my owner was. Don't know how I got there but I think I was switched for another black suitcase... well what can you do... but on that same trip I got a big sibling (grey) and he carried all my owners new clothes bc I couldn't fit it all. Maaany clothes were bought on this trip I can tell you 👌🏻",
   "created_utc": 1693163192,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxztcgm",
   "message": "\"I am so tired of being stuffed to death. Please, get help.\"",
   "created_utc": 1693163386,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzth7v",
   "message": "when i was a kid it would've been \"holy shit, how many books does this bitch need?\"",
   "created_utc": 1693163441,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzu9i8",
   "message": "My family used it more than I ever did.",
   "created_utc": 1693163769,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzucb8",
   "message": "I don’t have a suitcase",
   "created_utc": 1693163800,
   "score": 0,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzucht",
   "message": "“So many dildos.”",
   "created_utc": 1693163803,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzuct8",
   "message": "I don’t have a suitcase",
   "created_utc": 1693163807,
   "score": 0,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzulat",
   "message": "I saw an orange one just like me! I'm so excited!",
   "created_utc": 1693163906,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzvv9d",
   "message": "Airline Spokesman : How do we know it didn't always look like that?",
   "created_utc": 1693164447,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzvz48",
   "message": "Did they put it IN the engine?",
   "created_utc": 1693164494,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzvzwr",
   "message": "Ahhh… the old “strap it to the landing gear” trick.",
   "created_utc": 1693164504,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzwi6q",
   "message": "I'm a baggage handler...\n\n*sweats profusely*",
   "created_utc": 1693164724,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzyj2f",
   "message": "I had I Hella good time in Spain while my family was in Texas......\n\nHow do you mix up luggage marked Texas - Bush Intercontinental Airport and Madrid Spain?",
   "created_utc": 1693165572,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzyyl5",
   "message": "So, my own suitcases wouldn’t have much to say. But I picked up an amazing little leather case at Goodwill a while back that definitely could tell some stories.\n\nhttps://imgur.com/gallery/oGsrwKO\n\nDid some research on the hotels snd shipping line. This suitcase was owned by someone who worked for a company that imported fruit, specifically bananas. Remember from history the original banana republics? The scandals where American companies were essentially running the governments of third world countries for cheap imported fruit? Those guys. This suitcase.",
   "created_utc": 1693165750,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzyzjl",
   "message": "The day we went to the Cayman Islands for a week. It started with a sort of \"crash landing\" on the plane bc of how short the line was, it freaked my mom and sister out. The rest of the week was better; we got to stay in an apartment with a perfect view of the beach, heck, we went down there almost every day to swim in crystal-clear water and look at the fish swimming around our feet, and my dad took an old-fashioned waterproof camera to take pictures of the reefs (max: 27), and we even saw some stingrays! My dad and I spent the first sunset looking out into the ocean pretending it was just a gigantic spaghetti fish sandwich, like in Uncle Grandpa, and some days we also ate gummy bears while watching Wreck-it Ralph or Teen Titans Go!",
   "created_utc": 1693165761,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jxzz8k4",
   "message": "I'm proud to say I've been in this family for 4 generations one time in 1975, this dude father took me to Korea and stored fished in me. I can still feel the chilly scales sometimes",
   "created_utc": 1693165864,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy00c9c",
   "message": "Lost",
   "created_utc": 1693166313,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy00ld5",
   "message": "I never get cleaned",
   "created_utc": 1693166417,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy00zjj",
   "message": "\"He once spent an entire trans-Atlantic flight evacuating digestive contents from both ends with 15 minute breaks of sweating profusely in his seat in between.  He says the saline IV was like heaven, but the ambulance ride was at unfortunate expense.\"",
   "created_utc": 1693166576,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy01b5e",
   "message": "Oh boy!  I’m getting packed.  I know this will be a fun trip, and I wonder where are going!!!  *sigh* this Hampton Inn is just like the others and I’m all alone.",
   "created_utc": 1693166705,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy01da9",
   "message": "I went to France without my human and didn’t go home for weeks.",
   "created_utc": 1693166728,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy01nik",
   "message": "\"She sat on me for two whole hours because the train was full and now I have a big dent\"",
   "created_utc": 1693166841,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0233r",
   "message": "My sister borrowed mine once and vomited into it. Then she left it in her room sealed up for a month, before returning it to me uncleaned.\n\nPretty sure it would talk about that shit show",
   "created_utc": 1693167016,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy02a7m",
   "message": "Only if Tom Hanks is involved.\n\nhttps://www.youtube.com/watch?v=tBgOGGiHoz4",
   "created_utc": 1693167095,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy02bwj",
   "message": "Messenger bag rather than suitcase. We were in a small yacht on the Aegean sea. It was a student trip and I’m from a lower middle class background, it felt like a dream that I was even there. No clue how my parents were able to swing it.\n\nWe were sitting on deck on a bunch of big cushions, a group of dear college friends, right after a Turkish-style brunch. Surrounded by absurdly beautiful turquoise water with three or four little islands visible around us, no one else in sight. I remember the nearest island had some random ancient (or ancient-looking) ruins, including a small amphitheater facing the water. It was late morning on a gorgeous day, warm enough that some kids were swimming, jumping off the boat and generally messing around. Others were reading or napping on deck. A professor who was reading with a mimosa said, “Sorry, kids, but your lives just peaked.”\n\nAnd our little group was talking about that, how magical the trip had been so far, seeing the Blue Mosque and Hagia Sophia. Even the richer kids had never been to Turkey. And one girl says, “This is perfect. Absolutely nothing could make this moment better.”\n\nAnd RIGHT after she said it, we heard a slight commotion from the kids in the water, looked overboard and saw a tiny boat with a loud motor bouncing over the waves, clearly coming right for us seemingly out of nowhere. When he got close enough, the sole occupant of the boat yelled, “Ice cream! Ice cream for sale!”\n\nWe lost our minds. I was one of the few with my bag nearby, so I scrambled for lira. Had just enough on me to buy my little group and the professor ice cream ☺️",
   "created_utc": 1693167114,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy02xjz",
   "message": "My suitcase would moan about always being dropped from the loft instead of being lowered gently. It then gets its revenge by getting a speed wobble and throwing itself on its back like a petulant child.\nMostly gets overpacked and dragged around the UK.",
   "created_utc": 1693167358,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy03u9k",
   "message": "I don't have a suitcase... I never go much of anywhere...",
   "created_utc": 1693167722,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy04jwx",
   "message": "I'm a one of a kind, way cool leather weekender bag that my owner made and proudly exclaims as much to anyone who even so much as looks at me.  \n\n\"Yeah, I made that.\"",
   "created_utc": 1693168011,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy04k4x",
   "message": "Not an exciting one, but mine would definite scream when it's abruptly sent jumping from one luggage carry-car like there is no tomorrow. It is rough to see your suitcase jumping into the middle of other suitcases while you're stuck in the plane with no power.",
   "created_utc": 1693168013,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy052uv",
   "message": "They'd complain about all their injuries from being throw around so much.",
   "created_utc": 1693168227,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy06gd0",
   "message": "\"Stop buying Baklava\"",
   "created_utc": 1693168783,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy06os4",
   "message": "My suitcase likes to tell the happy story of the homeward flight that ended seven years of nearly constant business travel.  Many people dream of a chance to travel, but trust me, when you do it for a living it becomes little more than an endless quest for clean socks.",
   "created_utc": 1693168878,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy06rk8",
   "message": "\"I've seen a LOT of vomit in a lot of countries... also, Copenhagen is a self indulgent grey shithole\"",
   "created_utc": 1693168909,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy079gx",
   "message": "\"woohoo, my first trip, I'm so excited\"\n\n  \n\n\nI'm usually more a backpack guy, got a suitcase for a worktrip",
   "created_utc": 1693169108,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy08901",
   "message": "Oy vey! We’re going to NYC again?!! We just got back from there! (My grand baby is in Manhattan)",
   "created_utc": 1693169506,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy08jzl",
   "message": "The tale of the closet",
   "created_utc": 1693169629,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy094dz",
   "message": "The tales of the dusty basement.",
   "created_utc": 1693169859,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy09otj",
   "message": "Abused, thrown in busses and/ or airplanes every week.",
   "created_utc": 1693170088,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy09rfw",
   "message": "“Ya know you could check a bag instead of lugging it through the airport every time!”",
   "created_utc": 1693170119,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy09w80",
   "message": "I once split right down the middle and dropped my owners shit everywhere. As punishment I’ve not been out of the loft in 5 years.",
   "created_utc": 1693170174,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0afbl",
   "message": "“I live in an attic”",
   "created_utc": 1693170391,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0d18v",
   "message": "I never get to go anywhere. So I sit 365 days a year and do nothing but think of all the places that I would love to see. The only time I am used is when the cat sleeps on me.",
   "created_utc": 1693171459,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0gd46",
   "message": "I had a huge red suitcase i named Big Red. I used it during a time when my job filled my passport over the course of 5 years. Big Red got literally dragged all over the planet, beat up and lost occasionally until she could no longer travel with me. \n\nThat bag has stories, man. And scars.",
   "created_utc": 1693172849,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0grd3",
   "message": "It is gonna tell you how I ALWAYS pack friggin’ last minute, then cram everything inside it carefully hoovering around the weight limit, but actually only using 1/3 of what I packed. 😅🤣\n\nMy suitcase is also a bit busted, but I am keeping it as a new one would get cracked soon enough anyway. \n\nAlso it is nice silver colour and has to wear a bright neonpink belt so I can see it from miles away arriving on the luggage reclaim carousel and no random strange man tries to steal it ’by accident’ or not ever again. 😡",
   "created_utc": 1693173018,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0h6ek",
   "message": "Help! I've been locked in this attic for over 5 years! Please let me see sunlight!",
   "created_utc": 1693173194,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0hhep",
   "message": "A lot of fucked up shit including many talks with foreign embassies",
   "created_utc": 1693173326,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0kli8",
   "message": "The time my anxious boomer mom and I got in the wrong kind of taxi in Tangier (local only but we needed to go to the port) and the driver was illiterate so putting French and Arabic on google translate was no help at all. My mom started yelling because she thought we were getting kidnapped. Finally he got frustrated, pulled over and tried to kick us out in an area we didn't know, until some rando who spoke some English saw the situation and talked the guy into taking us back to the hotel where we found the right taxi.",
   "created_utc": 1693174693,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0kr4l",
   "message": "He keeps me in the garage most of the year and occasionally when he feels the need to satiate his lust for the pain of others he throws me onto this conveyor that puts me into a moving corpsebin full of my brethren for hours while I am bashed by the others and listen to their screams.",
   "created_utc": 1693174762,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0lo5h",
   "message": "We go to the gym and back. Sometimes office.",
   "created_utc": 1693175169,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0m3ed",
   "message": "“Lmfao this kid just ran into the window”",
   "created_utc": 1693175361,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0mf2x",
   "message": "The suitcase would still be in counselling.",
   "created_utc": 1693175506,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0q046",
   "message": "The Time m’y uncle molested me",
   "created_utc": 1693177133,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0qhwo",
   "message": "“She’s seen some shit…”",
   "created_utc": 1693177361,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0qkb2",
   "message": "My last day in NYC, literally just walking around before heading to JFK, I helped rescue a bunch of kittens that had gotten stuck inside a car's engine bay.",
   "created_utc": 1693177392,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0te2z",
   "message": "This bastard thinks it's funny to see if he can fit his body inside me like its a first time joke Every Time! He never fits, and infact he gets bigger in-between every attempt! Some days I stare at my zipper and wish I ended up as lost baggage at the airport...",
   "created_utc": 1693178668,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0tjt1",
   "message": "Please kill me",
   "created_utc": 1693178738,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0tlrf",
   "message": "“ow ow! ow! ow ow ow ow yaoooowwww!”",
   "created_utc": 1693178763,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0tvs1",
   "message": "boing. boing. wuuusch.",
   "created_utc": 1693178888,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0u338",
   "message": "Help i've spent more than a decade locked in this dark closet!!!!",
   "created_utc": 1693178980,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0ug0e",
   "message": "Wow that was a short drive from Goodwill.",
   "created_utc": 1693179142,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy0wj5a",
   "message": "\"I've been under the bed for 2 years because this mf never travels\"",
   "created_utc": 1693180094,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy12908",
   "message": "Went to las Vegas for a few days and ended up getting creamed by another suitcase that couldn't hold his load that was back in 2005 \n\nNow I have a pair of twin smaller carry-on cases",
   "created_utc": 1693182713,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy12shl",
   "message": "I don’t own a suitcase because I keep my distance from anyone who could snitch on me to my opps. Also I don’t travel.",
   "created_utc": 1693182957,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy16e82",
   "message": "My combination is 1 2 3 4 5",
   "created_utc": 1693184617,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy177sc",
   "message": "It's been hot and humid in this room. Finally daylight, oh it's raining. At least the walk to the car was quick. This is a pretty ride to the airport. Ohhh time to get manhandled at security and off to the plane. Wait what does, you don't have a visa mean? Great rain and another car ride. Well this bar has a cool view of the street and the passing monks. I was thirsty, but wasn't expecting a beer spilled on me. Great at least I get to wash the beer off on the way to the car. Security was more invasive than expected but here I am in Vietnam.",
   "created_utc": 1693185006,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy17dyh",
   "message": "Jeff who lives at home",
   "created_utc": 1693185089,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy18b7g",
   "message": "Suitcase I don't care what they want to know. You just need to STFU and keep your zippers zipped.",
   "created_utc": 1693185529,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy18rqv",
   "message": "The time he spent two weeks at an airport in upstate New York because the airline claimed they had no idea where he was. Then one day somebody that worked at that airport noticed he'd been sitting there a long time so they called his owner to ask when he was going to come get his bag. Owner lives in Denver.",
   "created_utc": 1693185749,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy1948v",
   "message": "\"LET ME OUT OF THE FUCKING CLOSET, I HAVE BEEN IN HERE FOR 5 YEARS, YOU BROKE ASSHOLES!\"",
   "created_utc": 1693185915,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy1afz9",
   "message": "So the guy flips me over, takes the stuff out and then decides to throw me in the damn closet. I carried that bitches luggage from the UK all the way to Mexico and he puts me in there without hesitation. I was hoping to, y’know, swim in the sea and dick hot babes yet i was shrouded in darkness for a week. Bloody horrible, im gonna break a wheel just to spite that guy.",
   "created_utc": 1693186557,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy1gnhg",
   "message": "“This moron won’t stop running”",
   "created_utc": 1693189558,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy1i6dj",
   "message": "Please, for the love of God, get this fat, orange cat off of me!",
   "created_utc": 1693190302,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy1lnbw",
   "message": "I’m into bdsm and regularly take a whole cashe of chains, collars, ropes, dildos, vibrators, etc.  \nmy luggage is jealous",
   "created_utc": 1693192065,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy1md4p",
   "message": "*The Heathrow… the Heathrow…*",
   "created_utc": 1693192453,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy1mvjr",
   "message": "It would tell the tale of my trip to Ireland and how much I want to go back.",
   "created_utc": 1693192730,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy1phx9",
   "message": "This fucker only leaves his hotel room to eat meals.",
   "created_utc": 1693194163,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy1pjt2",
   "message": "With ai tech this could be a real thing. \n\nIn red dwarf an old British sitcom from the 90’s theres an episode called stasis leak with an ai suit case delivering it self to the hotel. You should watch that episode. \n\nIt was made with 80’s tech but the idea was onto something. Red dwarf was my favorite show.",
   "created_utc": 1693194192,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy1tv55",
   "message": "Poor suitcase hit the tarmac at 30mph when the baggage handlers failed to secure it. Brand new Ogio bag with asphalt skid marks all over it.",
   "created_utc": 1693196712,
   "score": 1,
   "submission_id": "162wnsm"
  },
  {
   "comment_id": "jy1uaxr",
   "message": "Probably complain about the noise on the hotel room from the one trip I had to take for orientation for a new job.",
   "created_utc": 1693196985,
   "score": 1,
   "submission_id": "162wnsm"
  }
 ]
}