{
 "submission_id": "162xt3v",
 "title": "Which profession has the most f**ked up people in it?",
 "selftext": "",
 "created_utc": 1693160394,
 "permalink": "/r/AskReddit/comments/162xt3v/which_profession_has_the_most_fked_up_people_in_it/",
 "score": 149,
 "url": "https://www.reddit.com/r/AskReddit/comments/162xt3v/which_profession_has_the_most_fked_up_people_in_it/",
 "comments": [
  {
   "comment_id": "jxzvpeg",
   "message": "EMS. We kinda have to be. I've seen a guy seconds after he shot himself in the head (more than once,) a guy's leg strewn out over 100 yards from a car hitting his motorcycle (his boot was in the road with his foot still inside of it,) car crashes, domestic violence, ect. We work 48-96s, so 2 days on, 4 days off, sometimes with no sleep. I keep seeing doctors as an answer, and while yes, I can see that, they're getting these people after we bring them in and stabilize them. We're the first ones on scene, figuring out how to move them without killing them, dealing with panicked family members, usually in harms way ourselves. So we all end up at least a little fucked up. Lol",
   "created_utc": 1693164376,
   "score": 80,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzqdul",
   "message": "When I was in the military, we'd have super fucked up conversations about everything imaginable, then one day one guy stops and says, \" You know, if people back home knew what we talked about, they wouldn't like us anymore.\"\n\nSo probably troops. Especially combat arms.",
   "created_utc": 1693162158,
   "score": 238,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzm2nn",
   "message": "Politician",
   "created_utc": 1693160429,
   "score": 216,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy06xgo",
   "message": "Higher ups in health insurance in the US. Most morally bankrupt people on the planet. They will deny lifesaving coverage to actual children in order to line their (already full) pockets. I don’t know how they live with the knowledge that they are condemning people (and children/babies) to death, pain, or lifetimes of crippling medical debt so they can buy a nicer car for themselves.",
   "created_utc": 1693168975,
   "score": 221,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzqacr",
   "message": "Life coaches",
   "created_utc": 1693162119,
   "score": 147,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxztr52",
   "message": "Idk about F up, but I used to work in the law field. Every attorney was doing coke, I dated one who did it all night and went to defend someone is court, they also all cheat on their spouses with each other \u0026amp; their secretaries",
   "created_utc": 1693163556,
   "score": 208,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzrrm7",
   "message": "I'm going with people in the medical fields. Not because there aren't more fucked up people in this world in different fields, but because those people went to that field of expertise with at least some sense of trying to help people. And all they see is death, misery and suffering. It must be pretty hard to the mind that is at least supposed to be well meaning. And all they can do is laugh and do their best. The mental toll must be immensive.",
   "created_utc": 1693162726,
   "score": 154,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy02et6",
   "message": "I was told I was \"too nice\" to work on Wall Street. That says it all for me",
   "created_utc": 1693167147,
   "score": 112,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzo833",
   "message": "Investment banks",
   "created_utc": 1693161269,
   "score": 190,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzrcsz",
   "message": "The insurance industry! Politicians don't have shit on insurance agency owners!",
   "created_utc": 1693162556,
   "score": 34,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzn5bf",
   "message": "Idk but I believe that an average doctor's mind is pretty fucked up. He sees an opened up man, a woman without a hand a leg, a patient with terminal cancer, a teenager that is overdosing and it's another day at work meanwhile for most people this would be a life altering event.",
   "created_utc": 1693160847,
   "score": 200,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzvwdz",
   "message": "As a former Ford dealer, I will say car salesman. \n\nNot for the typical reasons. Not all car people are crooks, most of them, like other professions, just want to make a living and go home.\n\nBut if you have a pulse, SOMEONE will hire you to sell cars. \n\nNever met an industry of people with more issues than I have in my old career",
   "created_utc": 1693164460,
   "score": 124,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzmwj4",
   "message": "Used car salesman",
   "created_utc": 1693160752,
   "score": 223,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzwfwx",
   "message": "I was a busboy at 16 years old. The very 1st staff meeting I attended, management started off by telling us \"NO MORE DOING COKE IN THE PARKING LOT!!! OUR GUESTS ARE NOT FUCKING BLIND!!!\" I was literally a church going alter boy and was scared to work there but everyone was a high energy character and kinda looked out for me. There was a bunch of slamming, yelling, cursing, and fighting but nobody was malicious. After college, I worked in finance, a boiler room sales office and those guy's were a bunch of entitled, greedy, racist, elitist, narcisistic, violent douche bags. The first week I was killing it and thought I could put up with the toxic environment, because the money was great. I quit by the end of the week.",
   "created_utc": 1693164697,
   "score": 199,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzmiig",
   "message": "Lawyers",
   "created_utc": 1693160598,
   "score": 175,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy008zb",
   "message": "Scrolled way too far to not see finance. Finance folks are the most misanthropic, sociopathic folks I have ever met. I went to Wharton Business School and the amount of folks on their way to Wall Street that were ok w/forced labor, resource exploitation, etc. was intense. Humans are numbers to them and they only believed the worst in people.\n\nAnd, yes, I am generalizing. Yes, it was almost ALL of my classmates. Yes, many were nepo-babies. Why was I different? I went to law school and dipped into some Wharton courses.",
   "created_utc": 1693166276,
   "score": 71,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzzgb5",
   "message": "Anything that is high prestige - politics, law, medicine, academia etc. Fields like that are catnip for narcissists",
   "created_utc": 1693165954,
   "score": 44,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzu4tg",
   "message": "Real estate agents",
   "created_utc": 1693163714,
   "score": 66,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzoy33",
   "message": "Influencers.",
   "created_utc": 1693161555,
   "score": 87,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzqopf",
   "message": "Therapist/psychologist. Not in the sense that they are \"corrupt,\" but I feel like they usually go through some shit that fucked them up and made them go into that field.",
   "created_utc": 1693162281,
   "score": 64,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzsbw1",
   "message": "Mental health, social services, psychiatry. Trust me. And the higher the degree and sphere of influence/connection to local, state, federal politics, the more demoralizing. \n\nRemember, kids; title doesn’t dictate behavior. Or ethics.",
   "created_utc": 1693162962,
   "score": 140,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy0a6js",
   "message": "I have quite a few friends, but the ones that went into psychology seemed to have the most problems. I believe that they got their degrees in psychology in order to learn how to deal with their own psychosis. They also had more marriage problems than my other friends.",
   "created_utc": 1693170291,
   "score": 22,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxztxan",
   "message": "Human Resources, or whatever  bullshit they call that now.\n\nTheir only purpose in the company is to get people to work as much as possible for as little money as possible, and they hide that in so many layers of corporate bullshit I want to puke.\n\nIn a company I worked for a long time, there where three people in HR that were very nice, decent and caring human beings, and I think the HR big boss, despite some flaws, really believed workers should be treated right. \n\nWhen the company got bought by a much bigger company, the new managers fired the three for being good and humane persons. Fuck the new HR bosses.",
   "created_utc": 1693163626,
   "score": 88,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy0bgj6",
   "message": "Abattoir workers, especially slaughter men.\n\nNo ifs, no buts, no coconuts. By far the creepiest people you will meet.",
   "created_utc": 1693170813,
   "score": 10,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzm6y2",
   "message": "Police",
   "created_utc": 1693160474,
   "score": 246,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy0a9yw",
   "message": "Anything that involves Hollywood.",
   "created_utc": 1693170330,
   "score": 9,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy0adhe",
   "message": "Actors",
   "created_utc": 1693170370,
   "score": 8,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzv08b",
   "message": "Oh boy this again. I can’t wait for everyone to say politician, police officer, lawyer, military, loan businesses, pyramid schemes, insurance, and for a wild card let’s throw in tow truck drivers and maybe call center operators every thread has one of two curveballs so why not",
   "created_utc": 1693164082,
   "score": 106,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzolcn",
   "message": "There are 2 different types of fucked up, mentally and morally. Mentally, I’d group all first responders together, very dark sense of humor to cope with what they see. Morally, I would say politicians. That doesn’t need an explanation.",
   "created_utc": 1693161411,
   "score": 13,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxztruo",
   "message": "F'd up people are everywhere!",
   "created_utc": 1693163564,
   "score": 6,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzwdfx",
   "message": "As a cps worker, the investigation supervisors were all having affairs and one strangled the new hire in the office. Our judge got a DUI. Even HR was sleeping with the office manager",
   "created_utc": 1693164667,
   "score": 7,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy0a5b0",
   "message": "Influencers! 💯",
   "created_utc": 1693170277,
   "score": 7,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzps15",
   "message": "Law enforcement seems to attract some messed up people.",
   "created_utc": 1693161905,
   "score": 73,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy00ols",
   "message": "Every single one. There are f***ked up people everywhere.",
   "created_utc": 1693166454,
   "score": 13,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzsxb9",
   "message": "Every single one. More specifically, people in leadership positions",
   "created_utc": 1693163210,
   "score": 12,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzp0fz",
   "message": "Life",
   "created_utc": 1693161583,
   "score": 6,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy08rwk",
   "message": "Politicians",
   "created_utc": 1693169717,
   "score": 6,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy08z3n",
   "message": "Cops and military",
   "created_utc": 1693169798,
   "score": 6,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy0e9i3",
   "message": "Yoga Teachers. \n\nYou expect people who are into ‘wellness’ and ‘meditation’ to be rather calm, but no; absolute fucking psychos.",
   "created_utc": 1693171968,
   "score": 6,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy0f12t",
   "message": "I will get hate for this...but I think\nthe army. you have to be f*ked up to blow up innocent people for the sake of oil, power, resources etc",
   "created_utc": 1693172286,
   "score": 1,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy0g4b7",
   "message": "Law enforcement, military, prison, politicians",
   "created_utc": 1693172744,
   "score": 1,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzmg85",
   "message": "the dental arts",
   "created_utc": 1693160573,
   "score": 17,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzxq1n",
   "message": "Politics followed by medicine imo",
   "created_utc": 1693165238,
   "score": 17,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy02d9p",
   "message": "Congress",
   "created_utc": 1693167129,
   "score": 11,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy05955",
   "message": "I hear the entertainment industry is pretty bad",
   "created_utc": 1693168298,
   "score": 12,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jy05711",
   "message": "Mental healthcare - by a mile.\n\nTrue story: patient with a history of violence is placed on one-to-one observation. He also has a history of sexually acting out, but mostly just taking his dick out and walking around aimlessly.\n\nAbout 30 minutes in to watching the patient, his *female* one to one falls asleep. Deep asleep.\n\nThe patient climbed over her chair, walked into a female patient's room, shit in his own hand, and jacked off until she shouted at him to leave. The female patient walked to the nursing station and pounded on the glass to wake up the sleeping nurse, who finally escorted him to the bathroom to wash up.\n\nThe female staff stayed asleep through all the shouting and crying. I was finally called (supervisor) and when, after shaking her really hard, I finally managed to wake her up... Her response?\n\n\"Man, y'all be DOIN too fuckin' much!\" She was furious.",
   "created_utc": 1693168275,
   "score": 16,
   "submission_id": "162xt3v"
  },
  {
   "comment_id": "jxzns0x",
   "message": "",
   "created_utc": 0,
   "score": 0,
   "submission_id": "162xt3v"
  }
 ]
}